{"user_id": "105534758447080150259", "name": "Teresa Brown", "time": 1583098124786, "rating": 5.0, "text": "We made a quick stop here while flying from Florida to Oklahoma. Great little airport, although there is nothing small about the runway! It was in great shape and well lit. The FBO was so cute with the most inviting little porch complete with a porch swing. It was so inviting to sit there for a bit. The fuel prices were good and the fuel pumps worked great and well maintained. There was an older gentleman there and he was so helpful and friendly. The bathrooms were clean and well maintained. Would highly recommend stopping here while traveling.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMbBLbhgYwzkZ2JwieKWDIX7nlowTPvg1Yfa2il=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPcayLuchmcLcsWQLSVAKB5LSCxz1cdzgBhAUAX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMKLH62mnlfCLOIxtIl5jtqO7Sv4yDWyG31NxEm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMY8ui7fdfW7BV18FhpatNoJBLROs0L4_IULpmu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPc0VcmXz6_hoiV8EjrzsaZk_td67m-Ui-ZkM1c=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88902d3e8dfa097d:0x8b7916eab112923a"}
{"user_id": "105004481171202666948", "name": "Jesus Christ", "time": 1571413509104, "rating": 4.0, "text": "Great little airport.", "pics": null, "resp": null, "gmap_id": "0x88902d3e8dfa097d:0x8b7916eab112923a"}
{"user_id": "112355922789886727099", "name": "Teresa Torres", "time": 1623111151755, "rating": 5.0, "text": "Brett from GNG autos was an very helpful individual. He contacted me quite often to inform me that he was working on the best possible pricing for the transportation of our 4 vehicles. He new and kept in mind exactly what my budget was and, what I would and would not pay. He kept in contact with me all the way until the end. Brett did a fabulous job and got me the best pricing as promised. Thank you for all you've done Teresa", "pics": null, "resp": {"time": 1623176850835, "text": "Thank you Teresa, it was a pleasure being able to help you. Please do refer us to your friends and family!"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "103085252640757836439", "name": "George Martinez", "time": 1615310541000, "rating": 5.0, "text": "My Experience with G&G Was perfect, they had perfect comunication and amaizing service they moved all my 3 Articulate Dump trucks", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP-IQTCLFz8lFhNJK96lgzNXzNvIh8CCFSKKdgc=w150-h150-k-no-p"]}], "resp": {"time": 1615329643399, "text": "🙏🙏"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "117381566466544596408", "name": "Alana Rodgers", "time": 1622400243511, "rating": 5.0, "text": "Exceptional service! Brett Robles at G&G Auto Transport made it very easy to understand the process to get my Jeep Wrangler transported. He was clear and concise since step 1 and throughout the whole process. Thanks again. Highly recommended.", "pics": null, "resp": {"time": 1622400967378, "text": "Thank you Alana, it was a pleasure working with you. Please keep our number and let us know if we can help you again"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "114877557766513087337", "name": "Umesh Kishnani", "time": 1621825416995, "rating": 5.0, "text": "Thank you for your professionalism! My experience with G&G Auto Transport was nothing short of exemplary. Brandon was utmost professional and thoroughly connected throughout the process. He even charged me the deposit fee after the driver had arrived and picked up my car. Please work with Brandon and team! I'll surely use their services next time I need my car transported!", "pics": null, "resp": {"time": 1621856009498, "text": "Thank you for choosing us Mr.  Umesh, we hope to work with you again soon"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "101044437182794405475", "name": "Logan G", "time": 1615469824591, "rating": 5.0, "text": "Best Company to move heavy equipments!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPrhrXu6qCq2bgJLOM3ZIyzzSaOFaHoOu-OTPBT=w150-h150-k-no-p"]}], "resp": {"time": 1615480321505, "text": "🙏🙏"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "108765404421403022764", "name": "Donna Brown", "time": 1620072658482, "rating": 5.0, "text": "I'll be using this company again.\nI am ill-equipped to be able to deal with this situation but Brett accomplished everything I paid for.\nI was given an itinerary that was delayed by 1 hour(Unexpected road work).\nThis company understands what their job is and takes the pressure off of myself.", "pics": null, "resp": {"time": 1621521445143, "text": "Thank you for your feedback Donna, we hope to work with you again soon"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "100493125780503441364", "name": "Debby Fischer", "time": 1623008977616, "rating": 1.0, "text": "I used G an G Auto to ship my car from Sacramento to  the Trenton TX area. I paid their deposit of $150 after they first quoted $100 and quoted first $800 then $850 to do the job. My son signed the contract and then the issues started. They were supposed to pick up my car on March 26, 2021 so it could get to Trenton Tx by end of March. They never called and I had to call them. Told me the driver is running late will call in the AM of March 27, 2021. Never called and no pick up. This repeated for 2 days. No one ever called back and I always had to chase them. Finally, a supervisor called back told me they driver was AWOL, the guy John who I was dealing with was fired and now they have to find a new driver,  like that was my fault. Took them days to get back to me after I spoke to another supervisor who said she would call back and guess what… no call back. Finally, they said the had a new driver and it would cost $1400 with $150 already paid so I would have to pay the driver $1250. After my son already signed a contract for $850. When I asked for a discount for my trouble and extra cost to rent my rental car for another week they told me no. I do not know how this company has such a high rating with the BBB when they obviously extorted $400 dollars from me to get my car to Trenton TX and another $700 for the extra week of my car rental. Not to mention they never called back and were dishonest from the beginning. This company is horrible. Find a different company and do not  trust rating from the BBB.", "pics": null, "resp": {"time": 1623013363615, "text": "We apologize about this please provide me an order # since i checked and we do not have an order under Debby Fischer."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "114494768604812232492", "name": "Julie Weagley", "time": 1622256459628, "rating": 1.0, "text": "I hired them to transport my vehicle. For two days I was told that they would have a driver to pick up my car, several calls from me as to when they were going to be able to get the car. Told that they were having a difficult time finding a driver because the rate was too low. They rate that I was quoted by Brett at G&G. So I cancelled the service because they couldn't deliver what they promised. Then they have the nerve to change my debt card $200.00 without my authorization. I will be disputing the charge. You want to loose money and waste your time then this is the company for you.", "pics": null, "resp": null, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "112864359725708422539", "name": "Yolanda Neil", "time": 1612975780858, "rating": 5.0, "text": "This was my first experience with shipping my vehicle across country. Brett from G & G was the first person I called back after getting an overwhelming amount of shipping quotes. I shared with Brett he will the first contact I made and would continue to look around at other rates. Brett made sure I knew the right questions to asked, how to research other company as well as G & G.\nAfter speaking with other companies, I came back to Brett and G & G, due to the knowledge, responsiveness, transparency and customer service Brett offered. I would truly recommend G & G to anyone looking to ship their vehicle and know that you will receive quality service. Overall because of Brett’s ability to make me feel valued and he was working to meet my needs I would recommend G & G.\n\nThank you Brett for all you help!!!", "pics": null, "resp": {"time": 1612976747725, "text": "Thank you for your feedback Mrs Yolanda, we are proud to have met your expectations. Keep our contact and share it with you family and friends please. We hope to work for you soon!"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "108206575374534252591", "name": "SuperchargedSS1", "time": 1619726719889, "rating": 1.0, "text": "Scam artists. Their contracted driver provided a phony certificate of insurance.  When I brought it to Brett's attention he said he was going to talk to his supervisor and straighten it out.\nHe lied and never provides the correct one.\n\nAfter trusting them his driver proceeded to cancel the pickup 1 hour before the agreed to time.  Now G and G refuses to refund the $150 deposit.  A fraud case with the cc has been opened as well as a case with the FMCSA.\n\nTHIS COMPANY IS BAD NEWS. STAY AWAY", "pics": null, "resp": null, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "105267948240873417797", "name": "Jim Cuch", "time": 1615840890229, "rating": 5.0, "text": "Diana De Paz was fantastic. I really felt like she had my best interest in mind.\n\nI actually went with another broker first and then cancelled for their poor customer service. Diana stepped up, won my business and had a driver ready to pick up the vehicle within the hour.\n\nThanks!!!", "pics": null, "resp": {"time": 1615842632114, "text": "Thank you for your feedback Mr. Jim, we hope to work with you again soon!`"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "114244143052518370603", "name": "Jorge Perez", "time": 1615305430327, "rating": 5.0, "text": "I was recommended by a friend that uses G&G often, and I will do the same he did! recommend them to my friends! They have great customer service, Hunter was available at all moment answering all my questions, I was very satisfied when my car was delivered and will use them again!!", "pics": null, "resp": {"time": 1615329694968, "text": "🙏🙏"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "114174736794378540991", "name": "Brandon Perez", "time": 1620697640717, "rating": 5.0, "text": "I booked with other company but they were just playing with me, I got really sick of it so I contacted G&G they gave me a good price and they moved it the day I told them to, I had great communication they were really professional. I will highly recommend it and of course I will use it again.", "pics": null, "resp": {"time": 1620740389240, "text": "Thank you for working with us!"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "103644437642404714868", "name": "Carl Widener", "time": 1620070295179, "rating": 5.0, "text": "Brett was super nice and professional and the movement was awesome.   Will do business again for sure. Thanks", "pics": null, "resp": {"time": 1621521515169, "text": "Thank you for your feedback Carl, we hope to serve you again soon"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "118113397311118804576", "name": "The Monkey Brand", "time": 1618873890152, "rating": 5.0, "text": "G&G auto was amazing! Tony, the agent that helped me, especially. I really felt like he had in mind what was best for me and met my needs.", "pics": null, "resp": {"time": 1618934135984, "text": "thank you for your bussiness."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "109770694028769484843", "name": "Marcus Owens", "time": 1618265996205, "rating": 5.0, "text": "Me an Brett Robles  have a excellent  relationship he made my  decision to go with him easy I had over 25 company  called me and I  turned then down for  Brett  Robles this guy really care about his  customers  I am shipping  over  a half a million  cars  🚗  an I a very pleased on how he handled things  thanks Brett 👍🏾", "pics": null, "resp": {"time": 1618275815710, "text": "Thank you for working with us God Bless!!"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "101282999161332448824", "name": "Tu novia La luna", "time": 1618873613840, "rating": 5.0, "text": "G&G is a wonderful company, every single time I have worked with them they have been the most helpful, they take all the factors into count and care for their customers.", "pics": null, "resp": {"time": 1618934330565, "text": "Thanks for working with us"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "109880992024718252278", "name": "Elmar Rojas", "time": 1618873680419, "rating": 5.0, "text": "My experience with G&G was amazing, they had perfect comunication throughout the whole process. The assistance, care and service the agent, Tony, provided was excellent.", "pics": null, "resp": {"time": 1618934321667, "text": "Thanks for working with us!"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "100421135786360650695", "name": "Heidy Alvarado Alvarado", "time": 1615310305411, "rating": 5.0, "text": "Great experience  in moving my International 4200, Great customer service . They always aupdated me, If you need any equipment to be shipped I  highly recommend this company.", "pics": null, "resp": {"time": 1615329657757, "text": "👏👏👏"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "107475515382333738695", "name": "Ricky Contreras", "time": 1615235150618, "rating": 5.0, "text": "Excellent customer\nAlways in  Communication from beginning to end.\nThats why I have continued to use G and G transports. Thanks to Brett and his customer service I will continue to do business with them.", "pics": null, "resp": {"time": 1615329741452, "text": "Thanks for the feedback Ricky. We are here when you need us"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "105056482511617335400", "name": "Asim Kazimov", "time": 1605568102532, "rating": 5.0, "text": "I ship vehicles all the time, I've used other car shipping companies before but I'm sticking with this one. Brett gives me the best price and works really hard to meet my expectations \"Promply and Efficiently\". The best part is that they are available 24/7! Highly recommended.", "pics": null, "resp": {"time": 1605635675981, "text": "Thanks for the feedback Mr. Asim, we are happy to have met your expectation. We are looking forward to working with you again soon."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "111153913880653299597", "name": "Daniel Sloane", "time": 1616769283729, "rating": 1.0, "text": "I signed a contract with G and G Transport to have a vehicle transported from Florida to New York! After many many calls to someone named “Diana”, I think there must be 5-6 women named Diana there! I signed a contract with them on March 12th, 2021. The vehicle was supposed to be picked on March 26, I called that day and asked for a time windows of when they would be picking it up! I was then told they were still looking for a driver!!! This is 13 days after I signed the contract! They’ve done nothing about contacting me about pickup! They don’t return my calls, and I called their head office more than 90 minutes ago! He said he would call me right back! He didn’t!\nI would avoid this company like Covid 19! They have no clue what they’re doing and here I am, with a flight booked to Ny tomorrow morning, and my vehicle sits in my driveway!\nI would have to say, this is one of the worst companies I have ever dealt with!\nDan Sloane/Angelo Gencarelli", "pics": null, "resp": {"time": 1618275857758, "text": "we apologize for  this please in the future call at 256 272 9998"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "112188822502981734384", "name": "Dayana Miller", "time": 1615310201458, "rating": 5.0, "text": "jlg E450AJ\nprofesional company, they help me move my Boom Lift 100% recommended", "pics": null, "resp": {"time": 1615329678908, "text": "🙏🙏"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "102133578936861585441", "name": "Michael _", "time": 1609959968534, "rating": 5.0, "text": "They did a good job. There were a couple delays in picking it up, but the shipment arrived on time. Fairly priced & legit.", "pics": null, "resp": {"time": 1610033621858, "text": "Thank you very much for working with us!"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "110080166128930028816", "name": "Toni Sandoval", "time": 1603922462605, "rating": 1.0, "text": "DO NOT USE THIS COMPANY!!! I was in contact with Elsy for a month and she was very communicative, very friendly, very responsive. I was so excited to work with them until the Friday before my scheduled transport. She stop responding she strung me along all day believing that my vehicle would be picked up on the 26th and around 2pm she just stopped responding. I didn’t find out until after 5pm that my vehicle wouldn’t be picked up and  she hadn’t even notified me that the date would be pushed back or that she didn’t even HAVE A DRIVER!!! If you need transport I highly recommend Brad at Lightning Auto carriers", "pics": null, "resp": {"time": 1603979581917, "text": "We apologize for what happened Toni next time ask for a manager or call me at 256-272-9998 to prevent this from happening."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "116589183410321314758", "name": "Gino Carlucci", "time": 1618350014308, "rating": 1.0, "text": "George called me names, failed to pick up the vehicle for 3 days, Overcharged me, Carrier said they were getting 750 and good ole George charge me 1050.00 Stay away from these guys.", "pics": null, "resp": {"time": 1618353129774, "text": "Sir we had 3 different drivers at different times, it's not our fault you could have the car ready. You working with multiple brokers doesn't help eather. We recoment choosing a company next time and stay loyal to them to avoid something like this from happening again. Your refund has be completed. Have a blessed day."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "118265536265741013017", "name": "Tim Duncan", "time": 1596835472806, "rating": 5.0, "text": "This company offered the best price to ship my vehicle from Alpharetta, GA to Knoxville, TN.  I also checked their claim and they are indeed highly rated by the BBB.  Great personal service at a great price.  My personal thanks to the lovely Maria for seeing this through, because she was  there for me day and night.  So sweet, professional and helpful.  Thanks G&G Auto Transport, especially to Maria.", "pics": null, "resp": {"time": 1598486552832, "text": "Thank you for your business."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "103294451360829009690", "name": "justin parsons", "time": 1596244656586, "rating": 1.0, "text": "***BEWARE*** DO NOT USE THIS COMPANY.  I scheduled a pickup for 7/31 to deliver my new vehicle from FL to NC.  Adam Gomez gave me a price of $600 and said my vehicle would be picked up and possibly delivered on 7/31but delivery would be no later than 8/1.  I called Adam at 8:30 AM on 7/31 to confirm pickup.  He said he would call me back in a hour or two.  At 1:30 PM, the car lot I purchased the vehicle from calls me.  They said they have here heard from G&G.  I called Adam and he told me they do not have a driver yet.  I told him that this was poor communication and he needed to call me back with a scheduled time for pickup.  At 6 PM I call G&G back and speak with someone different who says they still do not have a driver for my vehicle.  At 8 PM I receive a text from Adam saying they have a truck for $900 that can pick my vehicle up Sunday.  This is two days later than my original quote I and $300 more.  If you do not want your time wasted, use another company.", "pics": null, "resp": {"time": 1598551558020, "text": "Hi Mr. Justin I'm sorry to hear about your bad experience with our company, We're normally known for our exceptional attention to detail, and we regret that we missed the mark. Covid-19 has drastically changed the industry; prices are changing constantly, driver are staying home, there are looting and rioting all over the states etc. If you don't mind giving me a call at (256) 464-2554 at your earliest convenience, it would be greatly appreciated. We look forward to speaking with you and working toward earning back your business."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "112157970455829624294", "name": "lana giorgobiani", "time": 1599087707260, "rating": 5.0, "text": "The best price to ship my vehicle from NJ to FL.  Great personal service at a great price.  Personal thanks to Mr. Adams to make this transaction very easy and pleasant.", "pics": null, "resp": {"time": 1599091584809, "text": "Thank you for choosing us, we hope we can do business in the future."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "117367633701841229584", "name": "Sonia Cedeno", "time": 1594217289051, "rating": 5.0, "text": "I contacted this company and am giving them a good review not because they deliver my car not to their fault but because they were very professional and kept me informed on details. Hunter was absolutely very professional and great to deal with.", "pics": null, "resp": {"time": 1600263500196, "text": "Thanks a lot for your feedback mrs Sonia Cedeno, we hope to work with you again :)"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "117794203452514202813", "name": "Warren Mccloud", "time": 1587030558155, "rating": 5.0, "text": "I needed to get a car transported from Houston to Milwaukee, Wisconsin ASAP they made it happen. Great customer service, GREAT PRICE, and nice and respectful driver, car was picked up Friday made it to Milwaukee, Wisconsin that Sunday in perfect condition. I would definitely recommend GNG Auto Transport", "pics": null, "resp": {"time": 1589685440359, "text": "Thank you choosing us and we are happy to have met your expectations!"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "112800862367064515021", "name": "Jason Dennis", "time": 1598478577418, "rating": 1.0, "text": "I dont usually give negative reviews unless a company deserves it. And this company absolutely deserves it. I was to have my car shipped on a certain date and was ensured the driver would come. I ended up having to wait two days because the company was telling me false information and when I cancelled my pick up they never gave me my money back. This company is a sham and I wish for it to close down due to horrible services.", "pics": null, "resp": {"time": 1598486166724, "text": "Jason, we are truly sorry to hear that, our driver had many hiccups  at delivering a unit to the port and therefore he was unable to get to you fast enough, we apologize for everything please call me at 256-272-9998 to see how we can work it ask for Logan im the manager, we would love to get your business back."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "113275475046698331807", "name": "Buba Jarjue", "time": 1597889369377, "rating": 1.0, "text": "GNG AUTO TRANSPORT VERY VERY POOR WHEN IT COME TO SERVICE, on Thursday the 08/13/2020 sign a contract for my truck to be pick up in Charlotte Nc I told them the due date for my truck to be pick up is Friday the 08/14/2020 they make a promise the truck will be pick up Friday morning not to worry.\nSo since they promise it will not pass the due date I was not worried.The date of the pick up around 1:45pm they call coming with lots of excuses the truck was never pick up the due date which end up costing me $160 cause the place was not open the entire weekend.\nThis is bad business promising a customer and not fulfilling it so please be careful with this company GNG AUTO TRANSPORT WHEN DOING BUSINESS WITH THEM BEFORE WHAT THEY DID TO ME HAPPENING TO YOU. I WILL NOT RECOMMEND THIS COMPANY WHEN COME TO MOVING YOUR CAR/TRUCK.", "pics": null, "resp": {"time": 1598918369656, "text": "Hi buba, sorry to hear what you went through i did not know about it any concerns please call me to find a solutions to the issue my name is Logan.."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "107139965870826405426", "name": "jasmine cisneros", "time": 1594864711102, "rating": 1.0, "text": "DONT waste your time. They kept us waiting the whole day saying that they were going to pick up the vehicle and I already didn’t trust them so the unresponsiveness  definitely did it. It’s all about communication and that’s something they just couldn’t do.", "pics": null, "resp": {"time": 1614292217621, "text": "Sorry for the inconvenience. please give us call for future reference"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "117131285763928775227", "name": "tom Watts", "time": 1609192644331, "rating": 5.0, "text": "Responsible company that knows what they’re doing", "pics": null, "resp": {"time": 1609193688290, "text": "Thanks for the feedback Mr. Tom, we are happy to have met your expectations ;)"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "100621919247660806336", "name": "hener perez", "time": 1605555093375, "rating": 5.0, "text": "Great Service from beginning to end, this guys are the best.", "pics": null, "resp": {"time": 1605564894002, "text": "Thank you! For Choosing us!"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "105827401967236624812", "name": "Madinabonu Akbarova", "time": 1597255321379, "rating": 1.0, "text": "THE WORST COMPANY EVER!\n\nI could give them “LIAR OF THE YEAR COMPANY AWARD” !!! Totally waste of time! We have been waiting for 2days and they keep lying still! If you don’t wanna waste your time, look for another company!", "pics": null, "resp": {"time": 1598486395083, "text": "We are sorry for the delay in our response we were unable to find an order in our system under your name Madeena Akramova, if you need anything please call me at 256-272-9998 and i would appreciate if you  could check if you are sure leaving the comment to the correct company."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "102023836510310491847", "name": "Shokhrukh Akramov", "time": 1597256279835, "rating": 1.0, "text": "EVEN DOES NOT WORTH ONE STAR\n\nI have been waiting for two days to pick my Ford F350, but they just wasted my time and money!!!", "pics": null, "resp": {"time": 1598486239432, "text": "Sorry for  taking so long to respond please call me at 256-272-9998-  to see how we can get it fixed we did not find an order under Shokhrukh Akramov."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "113730446180130631506", "name": "Madinabonu Akbarova", "time": 1597255151845, "rating": 1.0, "text": "*****BE AWARE ****\nDon’t waste your time!!!!! They are not responsive!!! Liars I think it’s fake company!", "pics": null, "resp": {"time": 1598486514943, "text": "Madinabonu Akbarova unable to find your order in our system any questions call me 256-272-9998 to see how this can be fixed."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "107740621491060073735", "name": "Candice Jones", "time": 1581744262856, "rating": 5.0, "text": "Great company that provides quality service at a reasonable price!", "pics": null, "resp": {"time": 1600263512947, "text": "Thanks a lot for your feedback mrs Candice, we hope to work with you again :)"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "114185372020057398661", "name": "Chad Finneman", "time": 1607482676776, "rating": 1.0, "text": "terrible company", "pics": null, "resp": {"time": 1611354648618, "text": "sorry we where not able to find an acct with you name"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
