{"user_id": "100563081401820429882", "name": "Smol_Bean", "time": 1614975806961, "rating": 1.0, "text": "My brother is missing. MY BROTHER!!!   On welsday My brother and his friend got bullyed and they ran away. PLEASE DONT SEND YOUR CHILDEN HERE PLEASE!", "pics": null, "resp": null, "gmap_id": "0x8889cbbd65e8b0b3:0xf5a88c5742046438"}
{"user_id": "102866835761921750885", "name": "Tyler Wallace", "time": 1593804676132, "rating": 1.0, "text": "They are dishonest people they allow people who your trying to get out of your life and kid’s  life for multiple reasons they take side with the person in the wrong and help them instead not to mention you can never get a hold of no one they will lie to your face and say they wanna help you and they are here for you...every time my wife has got any child support from them they have taken some out for some bs reason or make her way extremely to long Cullman DHR needs to be shut down for how their justice system is messed up", "pics": null, "resp": null, "gmap_id": "0x8889cbbd65e8b0b3:0xf5a88c5742046438"}
{"user_id": "105334109368771087891", "name": "Rebecca Richardson", "time": 1566415987869, "rating": 4.0, "text": "Took three people there,one for food assistance and two for the Crossings food bank. The staff for the department of human resources were professional and helpful. The staff for the Crossings food bank were very friendly and helpful. The community is well served by the Al DHR.", "pics": null, "resp": null, "gmap_id": "0x8889cbbd65e8b0b3:0xf5a88c5742046438"}
{"user_id": "114014476440399095956", "name": "Robert Fornes", "time": 1586642111266, "rating": 1.0, "text": "I can't get my case work on the phone when I need her to give her information about me, my husband and where we live at and how much our rent is and other bills we have to pay for my food stamps? BTW this is Regina Katherine Fornes is talking here", "pics": null, "resp": null, "gmap_id": "0x8889cbbd65e8b0b3:0xf5a88c5742046438"}
{"user_id": "108909421854005365081", "name": "Miranda Evans", "time": 1582642472172, "rating": 5.0, "text": "Really nice people that work here they're all a blessing.:)", "pics": null, "resp": null, "gmap_id": "0x8889cbbd65e8b0b3:0xf5a88c5742046438"}
{"user_id": "107750740680897969436", "name": "Jamie Raley", "time": 1532814388120, "rating": 1.0, "text": "I'm giving it 1 for being on a mother's side who is just living off the system and not wanting to do nothing letting my 2 year old daughter cuss plus lies on me and steals my income taxes and I talked to a lawyer about Emily what the mother has said and done to me by law of child support she is breaking the law and not believing the father of her child who has heard her say mean things to her own kids and I did see this how do you think I stayed out of trouble for almost 30 year's by telling the truth", "pics": null, "resp": null, "gmap_id": "0x8889cbbd65e8b0b3:0xf5a88c5742046438"}
{"user_id": "112206487514629583533", "name": "Rebecca Mccurry", "time": 1547577502864, "rating": 1.0, "text": "This place is ridiculous now you can't get anyone on the phones when you need them the most I've never been so disappointed in the Cullman county system", "pics": null, "resp": null, "gmap_id": "0x8889cbbd65e8b0b3:0xf5a88c5742046438"}
{"user_id": "113535859318216791044", "name": "Crickett Lynne Turrentine", "time": 1478679799815, "rating": 2.0, "text": "Bad neighborhood, INEPT staff, horrid waiting area", "pics": null, "resp": null, "gmap_id": "0x8889cbbd65e8b0b3:0xf5a88c5742046438"}
