{"user_id": "113393998999103138159", "name": "Jessica Cost", "time": 1618523981494, "rating": 5.0, "text": "Dr. Reddy literally saved my life. I came to her three years ago on over 200 units of insulin a day, an Alc of 10.5, and extremely overweight...absolutely miserable. She released me from her care, today, because I no longer need her services. Today, I am completely OFF of insulin, down two medications, and have lost almost 100lbs. She was so very decisive in my care. She was thorough and she doesn't mince words. If you, the patient, does what she advises you to do, YOU WILL SUCCEED. PERIOD. She's good people!!!", "pics": null, "resp": {"time": 1618581789355, "text": "Hello, Ms. Cost. Wow, what an incredible story! Thank you for sharing. We're so pleased to know that you are now off insulin and on the road to a healthier future. We will make sure Dr. Reddy and the rest of the Huntsville Hospital Endocrinology & Diabetes Clinic team know how much you appreciate their efforts. We wish you continued good health."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "108087568096497140502", "name": "Judi McMillin", "time": 1609363134047, "rating": 5.0, "text": "Dr. Reddy takes care of me for both diabetes#2 and thyroid issues. She is very comforting, knowledgeable, caring, etc. She never rushes my appointment. True...it does take some time waiting for her but it is very worth it. Her staff is fabulous....they all are friendly and caring. The one (Brian) is a total riot! He's very funny and likes to joke with me. This truly is THE doctor you need for these conditions.", "pics": null, "resp": {"time": 1611608916903, "text": "Hello, Ms. McMillin. Thank you so much for the kind words and the great review! We are so pleased to hear that Dr. Reddy and the rest of our team are meeting your needs. We look forward to continuing to care for you in the future."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "106810881904472922741", "name": "stacy wilks", "time": 1605809550952, "rating": 5.0, "text": "Dr. Reddy is by far the best endocrinologist I have ever been to. She listens and never seems rushed when we are discussing my plan of care. The wait has been very long because of the Covid issues and how long it takes with patients plus the tele calls. The office staff is wonderful. Lynn always answers all questions and is pleasant despite these trying times. I feel like I am getting the best care of all of my years with type 1 diabetes.", "pics": null, "resp": {"time": 1611260854543, "text": "Wow, Stacy. What a wonderful review! We're so pleased  to know that Dr. Reddy is not just meeting your expectations but exceeding them. We appreciate your support and are glad you are part of our Huntsville Hospital Endocrinology & Diabetes Clinic family."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "115589825808441670651", "name": "Nichelle Carpenay", "time": 1600889188747, "rating": 5.0, "text": "I LOVE this office with Dr. Jindal and his staff! The staff is sure to make you smile and keep you well informed with appointments, prescriptions etc. They even sent a sweet card in the mail. Very, very professional and kind. And Dr. Jindal is such an encouragement and great help with getting his patients better and giving vital information on what is necessary to get healthy. I have already seen improvements being one of his patients. Thanks Dr Jindal and Staff😊", "pics": null, "resp": {"time": 1601059098695, "text": "This is all wonderful to hear, Nichelle! We're so glad to have you as a patient and to know that your health is improving with Dr. Jindal's care. Thank you for taking the time to let others know of your experience with our clinic."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "106893672237859183268", "name": "Jamie Weinstein", "time": 1582571937853, "rating": 5.0, "text": "Dr Reddy is by far the best endocrinologist that I have seen in my 25 years with type 1 diabetes. She is super knowledgeable and up to date on all new devices and medications and most importantly she listens to every concern and comment I have. She is very punctual, which is very important to me since I have to bring my toddler with me, with whom she is great with as well! Couldn’t recommend her more.", "pics": null, "resp": {"time": 1582582119784, "text": "We appreciate the fantastic review, Ms. Weinstein, and are excited to share your comments with Dr. Reddy. Thank you for your continued trust and support."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "111823123781686739539", "name": "Donna Maschke", "time": 1580743922180, "rating": 4.0, "text": "Dr. Reddy is very thorough and explains details of treatment well. She is a new physician for my mother and we have seen her twice. Both times I had to call their office because they didn't call in the prescription. Overall we are pleased with our experience", "pics": null, "resp": {"time": 1580762168937, "text": "Thank you for taking the time to leave a review, Ms. Maschke. We're glad to hear that Dr. Reddy has impressed you so far, and we hope to do better in the future regarding your mother's prescriptions. If there's anything else we can do to improve your experience, please call (256) 265-0780 and ask for the Practice Administrator."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "108120892485025119571", "name": "Troy Biles", "time": 1580138985070, "rating": 5.0, "text": "I’m a patient of Dr. Jindal and I’ve been seeing him approx a year or so. I see these negative reviews and I know after visiting with him during my visits, these reviews are not accurate. His bedside manner is excellent. He’s extremely knowledgable and professional. He listens to me and my concerns and considers what I’m telling him. Someone mentioned that he was only on the room 7 minutes, well I have no idea the circumstances, but there have been times I’ve only seen him a short period because it’s a follow up after getting lab work done etc.. He listens and responds but he does have other patients to see as well.\n\nThe office staff are always very friendly and every appointment that I’ve had has been great as far as wait times. Never over 10 minutes or so.\n\nI highly recommend this physician and his staff.", "pics": null, "resp": {"time": 1580165013370, "text": "Hello, Mr. Biles, and thank you for taking the time to let others know about your experiences with Dr. Jindal and our staff. We're glad to know that our team is meeting your expectations and will pass along your compliments to Dr. Jindal."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "103546565758565830096", "name": "Jessica Styles", "time": 1572280608978, "rating": 1.0, "text": "My labs are messed up, my ultrasound shows Hashimotos Disease and I was told to lower my carbs and see a psychologist for therapy. I've been sick for FOUR YEARS. If you want a doctor who doesn't listen and suggests you have a psychological issue when you tell him your quality of life is poor, then this is the doctor for you. I was warned before seeing him and decided to give him a chance. Huge mistake. It only prolonged my suffering. Hard pass on this doctor for me.", "pics": null, "resp": {"time": 1572627025341, "text": "We're sorry to hear about this, Ms. Styles. Please call our Practice Administrator so we can work with you to address your concerns. The number is (256) 265-0780. Thank you."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "101089892653688354833", "name": "Ken Graham", "time": 1543338905633, "rating": 1.0, "text": "I just had my first visit with Dr Jindal and I wanted to share my first impression. He comes in telling me that my medical history doesn't make any sense (all diagnosed by Vanderbilt) and spent most of the time doing all the talking. He spends, at most, 7 minutes in the room and then leaves. I am in shock at how little he asked about my medical history. I'll go back for the results of the lab work and I'll update this if the appointment goes completely different. As of now, he is the worst Dr I have seen in the last 10 years.", "pics": null, "resp": {"time": 1545164952259, "text": "Hello, Mr. Graham. Our practice administrator would be happy to speak with you about your concerns. Please call her at your earliest convenience. The number is (256) 265-0786. Thank you."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "115992707989493727323", "name": "Shandora Moore", "time": 1547841682929, "rating": 5.0, "text": "Awesome doctor. For first time I felt comfortable about having an Endocrinologist.", "pics": null, "resp": {"time": 1548091716291, "text": "Thank you for the kind words and the great review, Ms. Moore. We're so glad that you've had a five-star experience!"}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "110533569448933972280", "name": "AK Colossus", "time": 1547045769926, "rating": 5.0, "text": "Dr Jindal was great when I saw him. I am borderline needing medication for hypothyroidism/ Hashi and he didn't force me to get a prescription. He gave suggestions for a lifestyle that would promote better thyroid health. Also I had my one year old in the office and the appt couldn't have gone better. I will say he is very concerned and on top of it for women who want to have children and have thyroid issues.", "pics": null, "resp": null, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "111325044508787676878", "name": "Shirley Hobbs", "time": 1597338442149, "rating": 4.0, "text": "Dr Reddy was Great", "pics": null, "resp": {"time": 1597856069568, "text": "Thank you for taking the time to leave a review, Ms. Hobbs! We will make sure Dr. Reddy knows how pleased you are with her care."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "102346525844950518895", "name": "Daily in The Word", "time": 1508211020017, "rating": 5.0, "text": "Wonderful experience with Dr. Jindal and his staff.  First visit was today.  They were kind, courteous, and attentative to detail.  They asked all the right questions, were thorough and seemed to be interested in finding the best treatment plan possible.", "pics": null, "resp": {"time": 1508421690429, "text": "We appreciate your nice comments and feedback, Mr. Kitchens. It's a privilege to care for people in our community."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "112017314760631702903", "name": "lewis jolly", "time": 1567541626752, "rating": 1.0, "text": "Never go to Dr. Jindal. He left paperwork on his desk and did not send it in so my son's drivers license got suspended.", "pics": null, "resp": null, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "111707701803401322468", "name": "Cal and Dar Lawley", "time": 1614181132307, "rating": 5.0, "text": "Dr. Garg is an extremely thorough and professional doctor. She has been my thyroid doctor for over a year now and I wouldn't dream of changing. Although the wait in the waiting room can be somewhat lengthy at times, the staff are all very friendly. If you're looking for an endocrinologist, I highly recommend Dr. Garg.", "pics": null, "resp": {"time": 1614289356717, "text": "It is our honor to provide compassionate care always! We are delighted to hear this feedback and thank you for sharing."}, "gmap_id": "0x888e803f6c3e914f:0x99f1e3c56e88478"}
{"user_id": "108221869444738187658", "name": "Leti JB", "time": 1613144258937, "rating": 5.0, "text": "Dr. Garg is a great listener, she appears to be truly concerned about her patients, and is very knowledgeable.  I really liked the fact to that she has called me personally to discuss results.", "pics": null, "resp": {"time": 1613778684482, "text": "We are honored to provide compassionate care for the people of the River Region! Thank you for sharing."}, "gmap_id": "0x888e803f6c3e914f:0x99f1e3c56e88478"}
{"user_id": "107126770959605064930", "name": "lou harris", "time": 1608682238949, "rating": 5.0, "text": "Excellent service from all aspects - front desk to exam room.", "pics": null, "resp": {"time": 1611010222520, "text": "Thank you for sharing! We are honored to serve the patients of Central Alabama with excellence in healthcare."}, "gmap_id": "0x888e803f6c3e914f:0x99f1e3c56e88478"}
{"user_id": "106546310690683916256", "name": "Daniel Pope", "time": 1568264026386, "rating": 5.0, "text": "Dr. Garg is an excellent endocrinologist. Very caring with a great personality. She has been my endo for several years and has exceptional knowledge in her field of medicine and is a true professional.", "pics": null, "resp": {"time": 1568302326715, "text": "Thank you so much for your review. It is our honor to be your healthcare provider. If there is anything further we can do for you, please don't hesitate to call us at (334) 613-7070."}, "gmap_id": "0x888e803f6c3e914f:0x99f1e3c56e88478"}
{"user_id": "107849092721032919838", "name": "Tony Montgomery", "time": 1545325095237, "rating": 5.0, "text": "Dr. Garg was very great. She listened to my concerns and her replies and suggestions were helpful. I'm glad she is my new Doctor. Very fast service.", "pics": null, "resp": {"time": 1545410035340, "text": "Mr. Montgomery - thank you so much for your review. It is our honor to be your healthcare provider. If there is anything further we can do for you, please don't hesitate to call us at (334) 613-7070."}, "gmap_id": "0x888e803f6c3e914f:0x99f1e3c56e88478"}
{"user_id": "103928093621604817127", "name": "Annie Bishop", "time": 1553269451039, "rating": 5.0, "text": "Dr. Garg is Awesome!! Very professional and knowlegeable. Takes time with you to answer all your questions and concerns. Annie B", "pics": null, "resp": {"time": 1553700010951, "text": "Thank you so much for your review. It is our honor to be your healthcare provider. If there is anything further we can do for you, please don't hesitate to call us at (334) 613-7070."}, "gmap_id": "0x888e803f6c3e914f:0x99f1e3c56e88478"}
{"user_id": "117665421855410351840", "name": "Michael DeVine", "time": 1545336693461, "rating": 5.0, "text": "Extremely pleasant. My my Doctor of 34 years retired and I was unsure of what to expect. Dr. Garg was willing to proceed cautiously. I was very much pleased.", "pics": null, "resp": {"time": 1545410020505, "text": "Mr. DeVine- thank you so much for your review. It is our honor to be your healthcare provider. If there is anything further we can do for you, please don't hesitate to call us at (334) 613-7070."}, "gmap_id": "0x888e803f6c3e914f:0x99f1e3c56e88478"}
{"user_id": "106276702774166680149", "name": "Abby McNeil", "time": 1566073110123, "rating": 5.0, "text": "I have seen dr garg once so far and drive from Dothan to see her as I come to Montgomery regularly . I am pleased with her services so far. She listens and seems very thorough with her patients . I did not feel brushed off , and although some labs are still pending , I have had her office call me with updates on them letting me know they haven’t forgotten about me and they’re still pending and I really appreciate that . All in all a great clinic and dr so far and worth my time for the drive . -Catherine", "pics": null, "resp": {"time": 1566316841801, "text": "Thank you so much for your review. It is our honor to be your healthcare provider. If there is anything further we can do for you, please don't hesitate to call us at (334) 613-7070."}, "gmap_id": "0x888e803f6c3e914f:0x99f1e3c56e88478"}
{"user_id": "115917392509875271202", "name": "Amy Boyd", "time": 1627932475730, "rating": 5.0, "text": "Dr. Garg is the best thing that has happened to me in years! She is very knowledgeable about any questions I have and is never rude or arrogant when answering! Her bedside manner\n(Office Manner) is great! I was her first patient here at UAB MONTGOMERY and what a blessing for me and my medical problems!! Love Dr. Garg!!!! It is great to have UAB and these physicians here!!!", "pics": null, "resp": {"time": 1545925737271, "text": "Ms. Boyd - thank you so much for your review. It is our honor to be your healthcare provider. If there is anything further we can do for you, please don't hesitate to call us at (334) 613-7070."}, "gmap_id": "0x888e803f6c3e914f:0x99f1e3c56e88478"}
{"user_id": "107482311454769073379", "name": "N M", "time": 1614779540611, "rating": 1.0, "text": "No mask, no business. I cannot believe medical professionals go without masks when Alabama hospitals have requested that everyone continue to wear them. By your responses, you don't seem to care. Good luck.", "pics": null, "resp": null, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "116008421754795951536", "name": "Paul Sherling", "time": 1622899908974, "rating": 5.0, "text": "Excellent Service!  Each employee treats you like family that you don’t get from chain drug stores and other pharmacies.", "pics": null, "resp": {"time": 1622913493962, "text": "Thank you so much Mr. Sherling for the kind words. Our staff tries so hard to make everyone feel welcome and appreciated. Have a great day!"}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "110598605561773046937", "name": "mario vantez", "time": 1605819182396, "rating": 1.0, "text": "Not a single pharmacist or employee wearing a mask. Please respect the safety of your customers in the future.", "pics": null, "resp": {"time": 1605835074650, "text": "While I do respect your ability to have an opinion on the wearing of masks, context certainly does get lost when our intent is to lecture someone instead of attempting to solve a problem no matter if it is real or perceived.  We strive to make ALL patients and employees comfortable but we also respect their personal decisions.  I do not feel as though immediately taking comments to the internet instead of addressing your concerns in a personal manner is necessary nor is this the appropriate forum for the airing of grievances.  You, Sir, have a wonderful day!  John N. Holley"}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "109433833530012531742", "name": "Leslie Grimes", "time": 1616268217243, "rating": 5.0, "text": "Nice and prompt.", "pics": null, "resp": {"time": 1616269241920, "text": "Thank you so much!"}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "100291437703887988049", "name": "Julie Schnabel", "time": 1558100642989, "rating": 5.0, "text": "Left a text message because I was having problems with there phone returned my call within minutes and they weren’t even open.. I had forgotten about time difference.. Staff has always been friendly and helpful on the phone Customer Service is A#1 Thanks.", "pics": null, "resp": {"time": 1558114761007, "text": "Thank you Ms Julie and have a great day!"}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "117295865147140159267", "name": "SuperSteve English", "time": 1583561781903, "rating": 5.0, "text": "Love Holley. Good people & a pleasure to go into.", "pics": null, "resp": {"time": 1583590143944, "text": "Thank you so much for the kind words."}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "116623717407645105879", "name": "Steve Milton", "time": 1576346800992, "rating": 5.0, "text": "S'where I git muh crack at, Joe Rogan! *scratchin my neck*", "pics": null, "resp": {"time": 1576353798639, "text": "Mr. Milton, Thank you so much for the 5 star review but I don't quite understand the crack reference since that is an illegal substance and this is a licensed pharmacy. We obviously do not have that in stock and I'm pretty sure that we can't even order it! I am familiar with the celebrity Joe Rogan, however. I do hope that your neck will stop itching since you scratched it. Have a great day!"}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "104659072692344453739", "name": "Dr Mike", "time": 1613494619313, "rating": 5.0, "text": "John and the staff are AWESOME!!!!", "pics": null, "resp": {"time": 1613496747752, "text": "You are too kind. Thank you so much!"}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "101052142436820662439", "name": "Ricky Nickolson", "time": 1497616695254, "rating": 5.0, "text": "I started using Holley Pharmacy in Enterprise shortly after it first opened in our city. The \"home town\" service just cannot be matched by the big box chain pharmacies! As a customer, it is nice to feel welcomed and appreciated in a place of business, rather than feeling like an intrusion.", "pics": null, "resp": {"time": 1607441500696, "text": "😎"}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "115203495935290214160", "name": "Lisa Harrison", "time": 1539007943759, "rating": 5.0, "text": "I appericate the patience and the kindness they show. They genuinely care...", "pics": null, "resp": {"time": 1539010222769, "text": "Thank you so much for recognizing our team's effort and it truly is about the patient. Please let us know how we can help!"}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "117608698150275689997", "name": "Diane Gabert", "time": 1505959076454, "rating": 5.0, "text": "They stayed open late for me to fill my prescription after exiting the hospital. I have found my new pharmacy.", "pics": null, "resp": {"time": 1607441463603, "text": "👍😎👌"}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
