{"user_id": "111724864696762019427", "name": "Carl Jernigan", "time": 1621397056382, "rating": 5.0, "text": "Can't say enough about the customer service i received. I brought my RV motorhome for service on my generator fuel line. I needèd repairs done within a week for trip i was about to take. No one else would even look at it. Not only did they replace the fuel line but i also needed new shocks which i purchased and they installed them no problem and gave me recommendations on other stuff that needed fixing which i took care of also. Great staff and professional work. A++", "pics": null, "resp": {"time": 1621439693561, "text": "Thank you for the glowing recommendation. We appreciate you!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "109748375907729808742", "name": "Taylar TLC", "time": 1610423196930, "rating": 3.0, "text": "This is an update to my original review upon receiving a call and efforts to make it right from Marc the Service Manager.  As you all know, many businesses won't even take the time to contact a lost customer.  Marc not only reached out but followed up with us to confirm we were taken care of, even though we had to pull our truck.  He made no excuses and stated that the communication errors were taken seriously and will be addressed.  Ultimately our repair had to been completed elsewhere but Williams still followed up and showed accountability.  I would be comfortable continuing to use W.W. Williams as I have at various locations.  However, I would advise that you seek assistance from Management if communication is lacking.  I wish we had done so sooner.\n\nBe aware that every experience isn't the same.  We had a truck towed in to this location due to the good reviews and communication with the tech on our call.  We were told that our truck would be looked at first thing the following day.  Day 1, truck not looked at, we were told someone went home sick.  This was after we called to get an update.  We were told it would be looked at the following a.m.\nDay 2,  I we provided the potential location of the issue after speaking with our home mechanic.  We asked how pics could be sent to get things rolling.  We emailed a pic of the part and diagnostic which was from a recent repair of another unit with the same problem.  We followed back up after not hearing anything mid day.  The truck was not looked at by mid-day we were told this time 2 people were out.\nDay 3, Calls and face to face contact again resulted in no action, the truck was not looked at.\nDay 4, We went to location to try to nail down a realistic expectation of when the truck would be touched.  We were told they would try by late afternoon but could not say for sure, this came from advisement with the shop supervisor.\n\nThis has been the worst experience we have had with a WW Williams which we use often locally.  Our confidence in towing the truck was due to the quality of work and professionalism we experienced in the past.  This location has not met the standard exemplified by the WW Williams name.  Truitt has not followed up with us nor provided a realistic time table to address the misinformation provided prior to the town in.  We understand staff issues occur, especially in the current pandemic climate.  However, there is no excuse for not providing updates nor treating all customers with the same level of priority.  The business is open, there are technicians present, and trucks being worked on.  Yet, we have not been serviced nor updated with an expected diagnostic date.  The cost of being out of service has been extended due to the poor service standard.  Beware before taking your truck here.  Sitting and no communication is not a reasonable expectation and very costly in trucking.", "pics": null, "resp": {"time": 1610485566188, "text": "Thank you so much for updating this and we do hope that we can do better for you in the future!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "118413429877737385554", "name": "Kenneth Knight", "time": 1614692495633, "rating": 5.0, "text": "Very  nice customer service.....and the service department was great", "pics": null, "resp": {"time": 1614698766586, "text": "Thank you so much!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "108215941761391925114", "name": "Curtis Mathis", "time": 1585105211129, "rating": 5.0, "text": "Best shop in town! Honest, fast, done right the first time! Been going there for years. Robert and his crew are always looking out for me. I won’t take my truck anywhere else. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "116224449923543135208", "name": "kelvin james", "time": 1618447593730, "rating": 5.0, "text": "Great great service", "pics": null, "resp": {"time": 1618507041915, "text": "Thank you so much!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "104010787190080266303", "name": "Kenny Owen", "time": 1616608830602, "rating": 5.0, "text": "Great people to work with", "pics": null, "resp": {"time": 1616609732049, "text": "Thank you!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "115519949273179296156", "name": "Randy St John", "time": 1582143620348, "rating": 4.0, "text": "Pat was very helpful and easy to work with. Reasonable prices for the items I purchased", "pics": null, "resp": {"time": 1582152162930, "text": "Thanks so much for the feedback Randy!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "118228704701249784997", "name": "Michael Gautney", "time": 1599734013542, "rating": 5.0, "text": "Always get good friendly service", "pics": null, "resp": {"time": 1599746954173, "text": "Thanks Michael!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "116138372496205644838", "name": "Joseph Peroni", "time": 1576866312099, "rating": 5.0, "text": "Great shop, and customer service. Family atmosphere and a great place to work!", "pics": null, "resp": {"time": 1576870249548, "text": "Thanks Joseph!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "114161607885603002366", "name": "Daniel Burnley", "time": 1600905792957, "rating": 5.0, "text": "It was an excellent experience.", "pics": null, "resp": {"time": 1600958039574, "text": "Thank you so much!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "106166888234817752035", "name": "Justin Lasiter", "time": 1555697022966, "rating": 4.0, "text": "A great mechanic shop however very disappointed in how I was handled in hiring process. I was judged based on false charges but neglected to see I wasn't convicted on any crime! Not my fault someone filed false report on me but charges were dropped due to no evidence!! I'm a hardworking husband and father whom lives honestly and that is how I should be viewed. Very upset about this!! Been applying there for 3 years.", "pics": null, "resp": {"time": 1551711821323, "text": "Wow Justin! Thanks for the amazing review!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "113775023754455172169", "name": "Tim Smith", "time": 1580742858726, "rating": 5.0, "text": "Great Shop. Would recommend to anyone!", "pics": null, "resp": {"time": 1580746612525, "text": "Thank you Tim!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "116284012956829537207", "name": "M “Mobtownrider” R", "time": 1485361316737, "rating": 5.0, "text": "Absolutely fabulous customer service. Mark and the guys here are very knowledgeable and go the extra mile. I will definitely be doing business with them in the future.", "pics": null, "resp": null, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "100339413949066430970", "name": "e phipps", "time": 1580863975365, "rating": 5.0, "text": "Happy customer here! Thanks for doing great work!!", "pics": null, "resp": {"time": 1580913987378, "text": "Thanks so much!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "100896026337920169822", "name": "Paul Phipps", "time": 1580862962572, "rating": 5.0, "text": "Great service and very nice people!", "pics": null, "resp": {"time": 1580913982771, "text": "Thank you Paul!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "101240834146321417768", "name": "Lauren Thornell", "time": 1605305398519, "rating": 5.0, "text": "Ashley and the team are STUPENDOUS!!!!", "pics": null, "resp": {"time": 1605545535682, "text": "Thank you so much!!!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "105747534784458540235", "name": "Bach Wilson", "time": 1402314332118, "rating": 1.0, "text": "This company took advantage of us and ripped us off.\n\nI am a mechanic, but I don't often vacation with all of my tools, so I know what I am talking about here.\n\nWe suffered transmission problems on our motor home on Memorial Day weekend. AAA got us in touch with W. W. Williams. I described our problem over the phone to W. W. Williams. The front seal was leaking badly, our transmission was functioning normally as long as it had fluid in it, however was leaking too rapidly to drive. The mechanic on call nearly insisted that he come out and have a look at it on site, however I told him there was nothing that could be done on the side of the road. We decided we would spend the night on the side of the road and have it towed to W. W. Williams the next day.\n\nThe next day we had the RV towed to W. W. Williams. The mechanic on call insisted that we let him come out and put the RV inside the gates, even though we were not worried about it as it was a very industrial area. The mechanic came out and was nice and spent about 10 minutes installing the driveshaft since it had been removed by the towing company. We again explained and showed him the problem and he assured us that it would be no big deal for them to repair. The shop was very nice and appeared to be well equipped. The mechanic estimated 8-10 hours labor for the repair. He waited another 20 minutes for our ride home to arrive and we left.\n\nA few days later W. W. Williams called to say that they could not repair our RV. They said that since it was leaking from the front seal, they wouldn't have the tooling. They charged $600 to tell us this, which is very upsetting because I told them that was what the problem was from square one and several more times after that. They justified their price by a minimum 4 hour charge for the guy to meet us to put it behind the gate, and then a inspection fee on top of that to glance underneath the camper. Their seasoned mechanic should have been able to make that call right away, and charging for an inspection is ridiculous as this could and should have been done by the mechanic while we were paying for his 4hr service call, he had plenty of time for that as he was with us for an hour or less. The tooling is also a very lame excuse.\n\nThis company clearly took advantage of us, and figured they could make an easy profit without having to touch our RV. Life is expensive enough as it is, we don't need to gouge each other. I am really upset that I told them our problem from the very beginning and they still put us through all of this.\ncall right awaycl", "pics": null, "resp": null, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "113759996123349442535", "name": "lydicake yumyum", "time": 1525802566971, "rating": 5.0, "text": "Repaired my brother's truck in a timely manner, and compared to other places we've taken his truck their work is thorough. Costly, but worth every penny.", "pics": null, "resp": null, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "116293948450474491932", "name": "Patrick King", "time": 1598461471961, "rating": 1.0, "text": "Expectations are too high for the money", "pics": null, "resp": {"time": 1598536249116, "text": "We apologize you had a less than expected experience. It is always our intent to provide our customers with service that meets their expectations, and if we failed in that effort, we are deeply apologetic. If you'd like to speak to us more about your visit, please email us at info@wwwilliams.com and let us know how we can reach out."}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "105264621372232370170", "name": "Lee Mason", "time": 1580742782913, "rating": 5.0, "text": "Best shop in town", "pics": null, "resp": {"time": 1580746592746, "text": "Thank you Lee!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "111927341118701617740", "name": "Keith Warren", "time": 1564230695313, "rating": 1.0, "text": "Charged way to much money for diagnostics and it was wrong", "pics": null, "resp": {"time": 1564413870842, "text": "Hi Keith. We'd love to talk to you more about this. Can you please message us the best way to reach out to you?"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "109947812281148804442", "name": "Ronnie Allen", "time": 1573857281937, "rating": 5.0, "text": "Great place", "pics": null, "resp": {"time": 1574096831418, "text": "Thanks Ronnie!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "103982540728786899604", "name": "Ricky Pyles", "time": 1529861661963, "rating": 5.0, "text": "Great guys.", "pics": null, "resp": {"time": 1530634028712, "text": "Thanks for the kind words Ricky!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "111262304274744007028", "name": "Ronald Bush", "time": 1625076374713, "rating": 5.0, "text": "Good folks. Good service.", "pics": null, "resp": null, "gmap_id": "0x88898555d128c033:0xd864069658997cfa"}
{"user_id": "105517745393849096956", "name": "Steve Pierce", "time": 1608242705011, "rating": 5.0, "text": "I’ve used this company on a few repairs (the most recent was one I created) and every exchange has been professional, quick, and priced fairly. I’ve dealt with Rick each time and he’s a great guy to work with.\nFive stars for me-\n\nSteve Pierce\nCoast Equipment Services", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "114549923175477789635", "name": "Dwight Keener", "time": 1558263235355, "rating": 5.0, "text": "Great price on a fuel injector pump rebuild. Saved me from buying a new one. Great job.", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "103945743370275520911", "name": "Larry Miller", "time": 1592127830442, "rating": 5.0, "text": "Best turbo repair shop", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "113004782316400347088", "name": "Victoria Edwards", "time": 1570130406856, "rating": 1.0, "text": "BEWARE!!!!!! Do not buy a turbo from this place!!! We bought a turbo for $1600 dollars and 3 weeks later it went out and now they don't want to cover it with the warranty. This is the worst service I have ever received and a WASTE of money. I got children to feed.", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "100869027137899215669", "name": "Chloe Barr", "time": 1560412073470, "rating": 4.0, "text": "Really enjoy the customer service :)", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "112283004879325645899", "name": "Capt Tom Adams", "time": 1467050154012, "rating": 5.0, "text": "Test CalibrationGreat place for turbos and injector pump rebuilds!!! Nice folks too ! Tom Adams Mexico Beach Charters", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "110933377730012459235", "name": "Jackie Neese", "time": 1502726785374, "rating": 1.0, "text": "I have been dealing with this company for a year and they refuse to stand by their parts- if you can get coverage for the part your lucky but you will never see a dime for labor compensation. DO NOT use them ever!!! Deal with someone who will stand beside their parts and back them with labor coverage. They are horrible to deal with!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
