{"user_id": "117834130056006683615", "name": "Jan Bartos", "time": 1616526807800, "rating": 5.0, "text": "Just great experience. Called them up that i need dirt. They came the same day at promised time. Perfect customer service!", "pics": null, "resp": null, "gmap_id": "0x88892d8f96ace415:0xb4c107c3bff2478b"}
{"user_id": "111188975648738282239", "name": "Jd Anderson", "time": 1618940056650, "rating": 1.0, "text": "Their driver was so focused on his sandwich that he literally stopped in the middle of a four way intersection after a stop sign.", "pics": null, "resp": null, "gmap_id": "0x88892d8f96ace415:0xb4c107c3bff2478b"}
{"user_id": "109975469888565123611", "name": "Dylan Spencer", "time": 1624413145156, "rating": 5.0, "text": "Great Company.Delivery was on time and drivers were very professional!", "pics": null, "resp": null, "gmap_id": "0x88892d8f96ace415:0xb4c107c3bff2478b"}
{"user_id": "104748849963995262716", "name": "Carl Bley", "time": 1512768299294, "rating": 5.0, "text": "Cliff and his men did an excellent job of building up this embankment. They delivered loads of red fill dirt, brown fill dirt, and top soil. Jeff was very proficient in distributing the soil and packing it down. They also left the property in great shape. It was a good experience from start to finish.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPWMH1wFUSHdJMlqMCNM16v61zJogU-hquKQHLl=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892d8f96ace415:0xb4c107c3bff2478b"}
{"user_id": "105190787710437783547", "name": "Jason Abraham", "time": 1599235690553, "rating": 5.0, "text": "As advertised.   Prices are in line.  Delivers as promised.  Will use again.\n\nFill dirt one load\n#4 rock 2nd load", "pics": null, "resp": null, "gmap_id": "0x88892d8f96ace415:0xb4c107c3bff2478b"}
{"user_id": "104113321509103082489", "name": "Michael Lawley", "time": 1598361879180, "rating": 5.0, "text": "Speedy friendly service.Good feel on gravel  will use again!", "pics": null, "resp": null, "gmap_id": "0x88892d8f96ace415:0xb4c107c3bff2478b"}
{"user_id": "112387871965610597109", "name": "James Heath", "time": 1565671413406, "rating": 5.0, "text": "Reasonable prices. They delivered on time. I tarped off an area where I wanted them to try to dump as much sand as possible and he managed to get all of the sand in there. I'll be needing some more sand and other bulk items in the future and will be using CT Hauling & Materials for certain.", "pics": null, "resp": null, "gmap_id": "0x88892d8f96ace415:0xb4c107c3bff2478b"}
{"user_id": "103372224904975216170", "name": "Cameron Rutherford", "time": 1589177166663, "rating": 5.0, "text": "Cliff is a very kool kat", "pics": null, "resp": null, "gmap_id": "0x88892d8f96ace415:0xb4c107c3bff2478b"}
{"user_id": "118044799174115161543", "name": "Thomas Rodgers", "time": 1515646646929, "rating": 5.0, "text": "I use CT Hauling and have found them reasonable, timely, and their equipment in good repair.", "pics": null, "resp": null, "gmap_id": "0x88892d8f96ace415:0xb4c107c3bff2478b"}
{"user_id": "111170405108943276817", "name": "Jerry Montalbano", "time": 1381443922857, "rating": 5.0, "text": "Cliff and his drivers make a great team. Recommend this company to anyone.", "pics": null, "resp": null, "gmap_id": "0x88892d8f96ace415:0xb4c107c3bff2478b"}
{"user_id": "107547863177803365880", "name": "Pat Hoban", "time": 1544724965119, "rating": 1.0, "text": "They were very difficult to work with and I was told everything was moved and the area was clean, but they left a huge mess leaving a lot of work for me to do. Instead of cleaning the huge mess they made on my neighbors property, they just spread it across the pavement and left. I will NEVER work with them again.", "pics": null, "resp": null, "gmap_id": "0x88892d8f96ace415:0xb4c107c3bff2478b"}
{"user_id": "102724431908432288744", "name": "Travis Gibbs", "time": 1449763781828, "rating": 2.0, "text": "On time delivery.\n\nWas disappointed at how little gravel you get for $300. There was a christian fish on the side of the truck. Maybe they think this gravel will fill my whole driveway like Jesus fed the multitude with 5 loaves and 2 fish. Also, the driver was smoking cigs, which is just unpleasant.", "pics": null, "resp": null, "gmap_id": "0x88892d8f96ace415:0xb4c107c3bff2478b"}
{"user_id": "100077939075350200733", "name": "Dallas Paige", "time": 1624997526429, "rating": 5.0, "text": "just moved to BC from california, building a barn and needed some services done. made one call and steve himself was here within 2 hours to deliver a load! great service, the best hospitality, wouldn’t recommend anyone but steve🤩", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP3bpcS9ZpiGU4xsGdg769-AGbYxqUsxetKMvVX=w150-h150-k-no-p"]}], "resp": {"time": 1625241117930, "text": "Welcome to Baldwin County and Thank You for contacting Us!! We Appreciate the 5 Star Review..... God Bless"}, "gmap_id": "0x889a08c01ec1b899:0x539f8ab85316452c"}
{"user_id": "102134900092645484080", "name": "David Worsley", "time": 1623249767458, "rating": 5.0, "text": "The millings Steve delivered were excellent quality. He was on time and very dependable. Highly recommend!", "pics": null, "resp": {"time": 1623349114464, "text": "Thank You David!! It was Our Pleasure doing Business with You. Hope we can provide service for you again in the Future!! God Bless-"}, "gmap_id": "0x889a08c01ec1b899:0x539f8ab85316452c"}
{"user_id": "111993343836043750563", "name": "Shirley Bucciero", "time": 1622747317569, "rating": 5.0, "text": "Very prompt and efficient service. He shows up when he says he will. Takes much pride in his jobs.", "pics": null, "resp": {"time": 1623349084241, "text": "Thank You for Your Review!! It was Our Pleasure doing Business with You. Hope we can provide service for You again in the Future!! God Bless-"}, "gmap_id": "0x889a08c01ec1b899:0x539f8ab85316452c"}
{"user_id": "112063791077914800447", "name": "Matthew Ebersole", "time": 1622735689209, "rating": 5.0, "text": "Thanks for the great service Steve. We like the clay and asphalt millings you provide!", "pics": null, "resp": {"time": 1623349013667, "text": "Thank You Matthew!! It was Our Pleasure doing Business with You. Hope we can provide service for you again in the Future!! God Bless-"}, "gmap_id": "0x889a08c01ec1b899:0x539f8ab85316452c"}
{"user_id": "107400963079268016208", "name": "Christine Borntrager", "time": 1622740664520, "rating": 5.0, "text": "Has always been prompt with delivery or made contact if unable to provide service as promised. Very nice and friendly. Thanks", "pics": null, "resp": {"time": 1623348871732, "text": "Thank You Christine!! It was Our Pleasure doing Business with You. Hope we can provide service for you again in the Future!! God Bless-"}, "gmap_id": "0x889a08c01ec1b899:0x539f8ab85316452c"}
{"user_id": "104566076130165814966", "name": "Samantha Harrison", "time": 1606584437499, "rating": 5.0, "text": "Steve was a Very personal and Very Professional.  Very prompt.  Great person.", "pics": null, "resp": {"time": 1606587813456, "text": "Thank you Samantha for your review. It is much appreciated. Hope to do business again if you have future needs."}, "gmap_id": "0x889a08c01ec1b899:0x539f8ab85316452c"}
{"user_id": "109706436225171472696", "name": "Amanda Kidney", "time": 1624901013543, "rating": 5.0, "text": "Bought my decorative egg rock from them. It turned out beautiful.\nBought sod from them, it thrived.\nThought I'd save $25 on my next sod purchase and bought from another supplier in Mobile,  I regret it. The other sod I got is sickly and struggling, the pieces were falling apart as we tried to lay them.\nThe extra $25 per pallet is well worth it at woerner for healthy and thriving sod. (Centipede)", "pics": null, "resp": {"time": 1625002310275, "text": "Thank you for your 5-star review. Customer service is a top priority for Woerner - we are glad we were able to help and do hope you return to visit us again soon!"}, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "117463367338042272096", "name": "Johnny Williams", "time": 1622551088049, "rating": 5.0, "text": "Very well stocked. The staff was extremely helpful. I will be back for sure.", "pics": null, "resp": {"time": 1622588788550, "text": "Thank you for your 5-star review. Customer service is a top priority for Woerner - we are glad we were able to help and hope you return to visit us again soon!"}, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "103067280062003932732", "name": "Chad kiper", "time": 1624920923525, "rating": 5.0, "text": "Great products. Friendly employees. A+", "pics": null, "resp": {"time": 1625002325801, "text": "Thank you for your 5-star review. Customer service is a top priority for Woerner - we are glad we were able to help and hope you return to visit us again soon!"}, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "104124685854222856150", "name": "Pamela Waleri", "time": 1615338067779, "rating": 5.0, "text": "Monday delivery. Very good company to work with.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPmlzihmDjUnnbTgD7hClIDxcbzZKrrE8VASy_3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP0nyX3SypJ00TR1C_dOaQD5KBEUatJMX6u17S_=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "116508142221212463546", "name": "Andrew Carstarphen", "time": 1623451067130, "rating": 5.0, "text": "Great service firm the guy that loaded my car with the items I purchased", "pics": null, "resp": {"time": 1623956197281, "text": "Thank you for your 5-star review. Customer service is a top priority for Woerner - we are glad we were able to help and hope you return to visit us again soon!"}, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "118127555627923531900", "name": "Ivan Martinez", "time": 1621106294858, "rating": 5.0, "text": "Beat place to get sod in the area and they offer military discount!", "pics": null, "resp": {"time": 1622038166010, "text": "Thank you for your 5-star review. Customer service is a top priority for Woerner - we are glad you had a great experience and hope you return to visit us again soon!"}, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "109915946316919334091", "name": "Kim", "time": 1615495453807, "rating": 5.0, "text": "Always a-1 service with smiles...always enjoy my trips there.", "pics": null, "resp": {"time": 1617631743487, "text": "Thank you for your 5-star review. We are so happy that we made your experience at our store a good one, customer service is a top priority for Woerner Turf. We hope you visit us again soon!"}, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "118240667964691471622", "name": "B C", "time": 1507325200860, "rating": 5.0, "text": "Built a deck and walkway at my house last fall. David and the crew in Mobile helped with materials and advice. I got a great deal on some cut stone, sand, gravel, dirt, beach pebbles, and sod. Planted a flower bed in a galvanized trough and used the gravel for drainage. Built the walkway with the cut stone and used the beach pebble around some of the bushes. The grass took some time since I planted it in the fall, but it came out great in the spring. I will definitely be back for my next DIY project.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPG71PSD5ni2njtJpqgukaZ9RbfsgzNMTtjEPXf=w150-h150-k-no-p"]}], "resp": {"time": 1507487748181, "text": "Thanks for the detailed review, B C!"}, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "109084710107628305676", "name": "Michael Thompson", "time": 1585599556617, "rating": 2.0, "text": "I’m a concrete contractor that uses these guys from time to time. They are a bit expensive, but I don’t mind paying for good service and quality products. We have purchased gravel, wall blocks, pavers and stones from them in the past. I always recommend them to customers for any of their personal landscaping needs. I went in to purchase some pea gravel and when I reminded the girl at the front desk that I should get contractor price, she was extremely rude. I probably would have went ahead and got an account, but she was so rude and disrespectful I never had a chance. Her name is Carla and I suggest someone in management teach her manners. I’ll use other stores for my products and not recommend them anymore if this is how they could be treated. By the way, I can go a bit further and get gravel from one of the trucking companies for half the cost.", "pics": null, "resp": {"time": 1590672664896, "text": "Michael, We are sorry about your experience at our store. We hope that you will give us another chance later down the road."}, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "102666608104076756321", "name": "Benjamin Stout", "time": 1589030594469, "rating": 1.0, "text": "Very very poor way of doing business! Today makes the second time this week that I have tried to purchase a large amount of rock from you and was not successful. I waited in line before you were open only for you to help others that came way after me first. I waited over 2 hours the other day and still was not helped. I will no longer do business with you and I will also no longer suggest you business to others. If you dont want the business close the location instead of doing business the way you are.", "pics": null, "resp": {"time": 1590672381996, "text": "Benjamin, We are sorry about your experience at our store. We hope that you will give us another chance later down the road."}, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "110323852899610344402", "name": "Ewing Lawn Care", "time": 1558453977883, "rating": 5.0, "text": "We have been using Woerner for many years and have always been satisfied with the quality of materials, as well as the superb customer service.  The employees are always friendly and give excellent advice on the products they sell.  I'm always impressed with how the employees are hustling to load materials for customers, as this is very rare to see these days!", "pics": null, "resp": null, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "112808015075142240813", "name": "Dante Piccini", "time": 1558451594097, "rating": 5.0, "text": "This place has some great sod, I would highly recommend getting sod from them. Also any question about sod, pavers, insecticides, watering schedules, they are very friendly and helpful in answering any questions I had. Steven, Carla, and all the guys inside and those helping to load outside are very friendly and good people. I'm happy to do my business with them and will continue to do so knowing that their expertise and products are very good. Even if you are not sure about something, I would recommend going in person or calling them, they are very helpful. 5/5 for me.", "pics": null, "resp": null, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "100773125138099620082", "name": "david street", "time": 1561583480934, "rating": 5.0, "text": "Always professional and courteous service - and very \"veteran-friendly\". Always ready answer any questions. I highly recommend them for any yard or gardening needs. Thanks to you all... Regards.", "pics": null, "resp": null, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "105168413839869796195", "name": "Scarlett Harrison", "time": 1558456229016, "rating": 5.0, "text": "As a landscaper, this is the only place I will get my sod and landscape products! The quality is amazing! The staff is super friendly and extremely helpful! I’ve been a customer for over 15 years and counting! 😊", "pics": null, "resp": null, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "100864651910214263867", "name": "Nate Crabtree", "time": 1556377470106, "rating": 5.0, "text": "Great staff, help is always helpful. Materials are top notch at a good price with great selection. Highly recommend!", "pics": null, "resp": {"time": 1558093338435, "text": "Thank you, Nate. Glad to help you."}, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "114146216846322690114", "name": "Matt Jones", "time": 1555256670465, "rating": 4.0, "text": "Great office staff. Materials are pretty good. I've gotten some rough looking sod here a few times but that's the only complaint. I go here alot.", "pics": null, "resp": {"time": 1555341412618, "text": "Thank you, Matt. We do try to do our best on quality control, so we apologize for any that has been not to your or our standards. See you again soon!"}, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "112530545874651687823", "name": "Sheila Vickery", "time": 1562629078710, "rating": 1.0, "text": "We purchased over $7,000 of grass last March. We now have numerous weeds and crab grass instead of the centipede we paid for. Would not recommend them or ever use them again.", "pics": null, "resp": {"time": 1562680692091, "text": "Sheila, we do apologize. We do not have a warranty on our grass especially over a years time just because there are some many things that we do not have control over once it has left our field. Have you contacted our store? We would like to talk with you, Do you mind if we reach out to you?"}, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "106216914165075972173", "name": "Christina Carr", "time": 1558063580196, "rating": 5.0, "text": "Great service.  Great product.   Always has what I need.  My go to place for all of my landscape needs.", "pics": null, "resp": {"time": 1558093312611, "text": "We are glad we are able to help you!"}, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "110481635813113430681", "name": "Ryan Ludvik", "time": 1558550776566, "rating": 5.0, "text": "They are always super friendly, have great selections and prices for premium dog food, and though my dogs are both 80lbs of hugs and kisses, they're always accepting and don't mind. Anytime someone needs dog food or lawn items, I always suggest Woerner's!", "pics": null, "resp": null, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "111833321329061270732", "name": "Ross Hatcher", "time": 1472092807966, "rating": 5.0, "text": "This is a really neat store if you're into landscaping.  I could easily spend enough money here to make my wife pretty angry.  I've bought sand and gravel here recently, and the prices seem very fair.  They also got me in and out pretty quickly.  On my last trip to buy gravel, the load got pretty heavy and made my trailer tires look pretty deflated.  The young guy who loaded it then had me follow him to get some complimentary air from their compressor to make sure I got home safely.  Great service!", "pics": null, "resp": null, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "115942807186392533371", "name": "kim nelson", "time": 1558449757689, "rating": 5.0, "text": "Great Service and friendly staff. They were very knowledgeable about what products I needed for my lawn.", "pics": null, "resp": null, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "111256041933776315105", "name": "j Wayne", "time": 1558571936625, "rating": 5.0, "text": "Our company Quality sod and lawn care has been using woernrs for over 20yrs always good service", "pics": null, "resp": null, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "105486360991020784408", "name": "Matthew Jenkins", "time": 1497453044184, "rating": 5.0, "text": "I have purchased many loads of gravel, sand, and rock from them. They have always been friendly and helpful and the price is right. I have been to many places like this around the area and Woerner beats them all in service, selection, and price.", "pics": null, "resp": null, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "100403197929977804688", "name": "Deeanna Smith", "time": 1507065895112, "rating": 1.0, "text": "I picked up \"clean long leaf straw\" for a new customer. Well, that was a lie. Loads of trash and straw that was old and very brittle. I even took pictures. Called to speak to mgr. He was very rude. He said he sold 1500 bales a week and hadn't had a complaint. I will never go there again. Lowes has better pinestraw.", "pics": null, "resp": {"time": 1507073264943, "text": "Hey Deanna, we are sorry to hear the experience and purchase was not acceptable. We will follow up and find a resolution soon."}, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "108671487736737561326", "name": "John McCabe", "time": 1558609878185, "rating": 5.0, "text": "I frequent this store for sod and pinestraw mostly.  They always have better service and superior products than their competitors.", "pics": null, "resp": null, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "116785559613132358812", "name": "David Vincent", "time": 1558459752574, "rating": 5.0, "text": "Everyone I come in they are very helpful and polite", "pics": null, "resp": null, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "110054057274937925733", "name": "Bill Huber", "time": 1537475887775, "rating": 5.0, "text": "I buy some sod and dyed pine straw here several times per year.  They always have what I need and the staff is always friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "105021170578529876646", "name": "Chase Nelson", "time": 1535927511685, "rating": 1.0, "text": "The absolute worst turf supplier in the area.  I purchased a pallet of grass a while back. After it was picked up and delivered to my home where it was laid in the area prepared, I discovered that more than half the grass was already dead and falling apart. This was the worst choice!", "pics": null, "resp": {"time": 1536068371091, "text": "Chase, we do apologize for any previous experiences you have had with us. We are under new management at this location. We hope that you will give us another chance in the future to change your mind about our business. And again we are sincerely apologetic."}, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "100308524505063145402", "name": "Scott Griffith", "time": 1475240781334, "rating": 5.0, "text": "Purchased a load of pea gravel. The service was prompt, professional, and the price was reasonable.", "pics": null, "resp": null, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "112587643170636920347", "name": "Half Time", "time": 1591968842150, "rating": 5.0, "text": "Great staff", "pics": null, "resp": null, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "103208583513346246733", "name": "Shay Rivers", "time": 1553027600814, "rating": 5.0, "text": "Wow! I love this place!", "pics": null, "resp": null, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "111215008769118618506", "name": "Hunter Walker", "time": 1552258868424, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "103436227153887769451", "name": "Matthew Blackmon", "time": 1450229204331, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "108346923478261534226", "name": "David Pham", "time": 1620077044723, "rating": 4.0, "text": "(Translated by Google) It sells all kinds of building stones, people can come here to choose from the price is very good better than homedepot and low here. You may get a discount when you buy a lot. 👌👌👌\n\n(Original)\nNơi đây bán tất cả các loại đá xây dựng mọi người có thể đến đây lựa chọn thoả mái giá cả rất tốt tốt hơn homedepot và low tại đây. Có thể bạn sẽ được giảm giá khi mua nhiều. 👌👌👌", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNrBtnjn-qFtXtXrFtQxi7aOTasseXiBj4FyD4G=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOqwo-9I8vLYI9dU8Y8m8FW5CHtWWQNElNTo3Xu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOWMutuLVLJJHvf483hLPIbQvoc43Ebv7mEDVv4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPkInex61fSFFB4oR4-N62fgbM-vEy8AIgM8FCW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMtIFlfrBhZEafx0U3ZzwQx03IFwZZZzjEl3mHi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMXDFtsI8Abqdr2VL6VELeYouzDNASbCb4P1MGo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMbEAaqVqM08CH9oOGyShLXFWz0L1LGThxk57XD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOQNx452G3iIk8UZKxTz5vwX7Uk_TkW8t4mrQ-y=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNzq53M7pA5-nEYZQz677BivpvYyYgbb6-9t981=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOZkpCbY0VMA1ihy_zWEGH3TA9ZceBfy0QAIn8d=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP0Zi1MSWvpmCvzQduV6-xKi_OXyEAohXtxvCET=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNV70B28A-po1dB7Qt52yDhNMX0ZKgVPjDetrDR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP_clBu62uFNAukJaNkI3fUg3UxbTUJly6nt66e=w150-h150-k-no-p"]}], "resp": {"time": 1620239838897, "text": "Thank you for your review! We are glad you had a great experience and hope you return to visit us again soon!"}, "gmap_id": "0x889bb3c6c5f1da5d:0x7ad06a8efdfbd79c"}
{"user_id": "112914101280516257299", "name": "DeWayne Fowler", "time": 1622164696841, "rating": 5.0, "text": "Garrett Contracting installed a road for us behind our house. They did a super job. Josh, as well as the other members of his team, were very professional, accommodating, knowledgeable, and respectful, which says a great deal about this young group of men. Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x886299466c6c3f1f:0x7bbf148542acd354"}
{"user_id": "118257067513933595202", "name": "Morgan Jump", "time": 1617846687072, "rating": 5.0, "text": "I have nothing but good things to say about this company. I inquired about having my driveway repaired and they were out to my house within a few days. Scout was amazing and got the job done exactly how I imagined it would be. Thank y’all so much!", "pics": null, "resp": null, "gmap_id": "0x886299466c6c3f1f:0x7bbf148542acd354"}
{"user_id": "103965519093785923731", "name": "Zac Lott", "time": 1616646990208, "rating": 5.0, "text": "I myself own a small civil contracting company and use Garrett Contracting for a lot of my larger excavation projects as well as gravel, sand and slag deliveries. Reliable and affordable.", "pics": null, "resp": null, "gmap_id": "0x886299466c6c3f1f:0x7bbf148542acd354"}
{"user_id": "109607800450053550688", "name": "Donnie Pierce", "time": 1596592008803, "rating": 5.0, "text": "We hired Garret Contracting to build a dirt pad for a horse barn. Right away I noticed the great communication between Josh and I. He came out to give us a quote within 24 hours of contacting him and gave us a good, compatible price shortly after. Josh has this positive vibe about him and truly cares about the customer. He is friendly, helpful, professional, reliable and super polite. Unlike other companies I had contacted, he was able to give us a quicker time frame and set us up for about 2 weeks out. Josh gave prompt replies to questions and updated us as the projected date approached. On the construction day he and his crew showed up exactly on time and started to work on the project without any delay. His crew was also very polite and friendly and accommodated our needs. Josh's crew worked efficiently and never took a break and the job was done sooner than we expected. Josh and his crew are particular about their job and giving it their all to meet or exceed the customers expectations. Josh makes sure to check on the progress in between and again once the job is complete. Customer satisfaction is important to him. It has been a real pleasure to work with Josh and I hope he continues to stay true to himself and the way he treats people. His momma raised him right! \"Thank you\" doesn't seem to be enough to say to Josh and his crew. Right now it's just a \"pile of dirt\", but it is part of making our dreams come true. It's much more than just a JOB WELL DONE!", "pics": null, "resp": null, "gmap_id": "0x886299466c6c3f1f:0x7bbf148542acd354"}
{"user_id": "115750202718519389065", "name": "Paul Pedersen", "time": 1562162556570, "rating": 1.0, "text": "Not reliable.\n\nI've been trying for over a month to get this company to come out and give me an estimate.", "pics": null, "resp": null, "gmap_id": "0x886299466c6c3f1f:0x7bbf148542acd354"}
{"user_id": "109722648064000489366", "name": "Brian Baer", "time": 1565704869207, "rating": 5.0, "text": "Great company", "pics": null, "resp": null, "gmap_id": "0x886299466c6c3f1f:0x7bbf148542acd354"}
