{"user_id": "106350767182777437343", "name": "Nicole D", "time": 1572207478628, "rating": 1.0, "text": "I had to call numerous times to talk to my lawyer about my case and all i got was document. It seems like i am just a number not a person. Also  was unable to get any couseling services. I am the victim why do i have to be treated and punish again and again. I will not refer anyone in need to this facility.", "pics": null, "resp": null, "gmap_id": "0x888e8172b97721a7:0x2006b1e8f3981510"}
{"user_id": "102548782099643070514", "name": "Melissa Ortiz", "time": 1474902478386, "rating": 1.0, "text": "The counselor left the room to talk with another counselor and they were talking bad about me, I know this because she didn't close the door and I overheard them laughing about it. I know that swallowing your pride and asking for help is the hardest part but don't do it here unless you want people talking trash about you. This place is the reason a lot of women don't want to ask for help!!!", "pics": null, "resp": null, "gmap_id": "0x888e8172b97721a7:0x2006b1e8f3981510"}
{"user_id": "106217777521930010396", "name": "Tracy Weissend", "time": 1539205917379, "rating": 4.0, "text": "They think everyone is nothing but trash ..its obvious the way they look and talk to people", "pics": null, "resp": null, "gmap_id": "0x8889cbc7675a586f:0xf1751887efe65ab5"}
{"user_id": "103522727271630462269", "name": "Abcdefg Hijklmn", "time": 1479495568854, "rating": 1.0, "text": "How dare you take Mr. Maynor from his family for 40 yrs because he did what the judicial system is afraid to do. Rapists get months  while those that do the \"systems\" job for them are persecuted and given the highest sentance. Shame on you DA and your whole system. That man did what any father would or should do. His only mistake was waiting until the perv was released. Had he done it prior to sentencing he could've been found insane. Well guess what insanity can come at anytime. You Mr./Mrs. DA need to put yourself in his shoes. Imagine what that families life has been like since that day. You have no idea! Shame on you and everyone else in the \"system\" that had to do with this case. If you'd do your job the first time this wouldn't happen and that goes for all DAs in the country. SHAME !", "pics": null, "resp": null, "gmap_id": "0x8889cbc7675a586f:0xf1751887efe65ab5"}
