{"user_id": "108499541977609253056", "name": "Ronald Redd", "time": 1500234657287, "rating": 5.0, "text": "Great Dive Experience with a great crew. Can't wait to go again.", "pics": null, "resp": null, "gmap_id": "0x889a0792577b5f41:0xbfd022171eec7e0c"}
{"user_id": "114477928894400351358", "name": "Lynda Tiefel", "time": 1562891336564, "rating": 5.0, "text": "Great crew, plenty of room on the boat, very organized.", "pics": null, "resp": null, "gmap_id": "0x889a0792577b5f41:0xbfd022171eec7e0c"}
{"user_id": "113351234094733595473", "name": "Tony Day", "time": 1597627952714, "rating": 5.0, "text": "Took my Open Water and Advance Open Water here. Great dive shop and great instructors. My experience has been excellent!", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "110109603965891371856", "name": "Wes Christie", "time": 1574107012644, "rating": 5.0, "text": "I had a great experience getting my open water certification and would highly recommend ScubaVentures.  Mark and other instructors are very hands on and make you comfortable.  Looking forward to some trips with this group in the future.", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "111763537406054000547", "name": "Dylan Jardine", "time": 1533562289205, "rating": 5.0, "text": "Great instructor and staff, perfect for people that are just getting into scuba diving. The equipment there is top of the line. If you live in the Birmingham area buy your equipment there, and if something does not work take it back and they will sort it out. No fuss no muss and your out.", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "107014988951944185738", "name": "Cindy Pierce", "time": 1593799296756, "rating": 5.0, "text": "Great people. Good selection of products.", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "108886498969830961519", "name": "Dee DaSilva", "time": 1599959940404, "rating": 5.0, "text": "Loved it and I am going back", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "106860821038624201662", "name": "Hank Hankerson", "time": 1532631352047, "rating": 1.0, "text": "I walked in looking to purchase some gear and 3 associates/owners/customers were standing around with a dog. I said I was interested in purchasing some gear for an upcoming trip and none of them looked up and continued with their conversation. The dog came over a few times for pets and was clearly the only one interested in earning any business. After staring at the display items for 10 minutes with no assistance I left the store.", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "109462668186527101559", "name": "eric brosch", "time": 1533673649164, "rating": 5.0, "text": "Excellent experience. The staff is well trained and highly skilled in both the diving and retail aspects of the business. Friendly, helpful and knowledgeable, Mark, Traci and Mackenzie ensure a quality experience whether you are a novice or seasoned diver.", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "118201801326004487762", "name": "Sara Harper", "time": 1534595261367, "rating": 5.0, "text": "Excellent service and staff. Every time we've been to ScubaVentures, we've been impressed with the friendliness and  professionalism of Mark, Makenzie and Traci. They go the extra mile to make sure you are equipped with all you need, ensuring your scuba adventure is the best. Thank you to these three that helped us immensely last week!", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "101750261492283363328", "name": "Charlie", "time": 1497475460313, "rating": 5.0, "text": "Great dive shop!  The staff is all friendly and knowledgeable.  They have everything you need to dive.  My daughter and I started diving a couple of months ago and they have taken care of everything including trips, certification classes, gear, and have spent lots of time answering all my questions.  :)", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "105563290804026316246", "name": "Candace Padgett", "time": 1560305718382, "rating": 5.0, "text": "Review for Open Water course - I highly recommend  ScubaVentures and Blue Water Park. Tip: They have more classes available than what is shown online so stop by the shop or give them a call.\nI was able to get my Padi Open Water Certification over the course of two weekends, excluding the e-learning that I did on my own time. Clint was our instructor and was amazing. Very patient with everyone's skill/comfort level, thorough with the material, and flexible with everyone's schedule (ours in particular since we had a commute). Will definitely return when we go for our Advanced Open Water.", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "113472240458011142707", "name": "Dixie Lauderdale", "time": 1533487459391, "rating": 5.0, "text": "This is the best dive shop in Birmingham! They are very helpful and knowledgeable about everything to do the SCUBA. If you are looking to get certified, need a refresher course, need gear, etc. they will have all you need to do so!", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "104075836998907272142", "name": "Brooke Brasher", "time": 1533495749510, "rating": 5.0, "text": "I completed my open water PADI certification with Scuba Ventures in Vestavia. Great team of people, very knowledgeable and friendly! They were able to answer all of my questions on diving and gear. I would absolutely recommend these guys for certifications, gear, trips, etc. Their love of diving is definatly contagious!", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "112655150049042174207", "name": "Mike Reynolds", "time": 1533495352795, "rating": 5.0, "text": "Very professional and fun group of divers. Mark and the gang will set you up good!", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "108292854708517201125", "name": "Rolanda Horton", "time": 1524317172570, "rating": 5.0, "text": "Great instructors - VERY patient and knowledgeable. They love what they do and it’s infectious.", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "114110696952000077990", "name": "Greg Ottwell", "time": 1532716801344, "rating": 1.0, "text": "I was in the shop on 7/21/18 and went in with the intent to purchase two complete sets of gear for me and my wife, it was the Absolute worst service I have ever received! The dog the old lady had in the store was barking, it was obnoxious!! The old lady working there clearly didn't have a clue about anything (air headed doesn't begin to describe her) especially diving related! The young girl working there ignored me,she seemed spaced out, the owner was there and wouldn't help me he stayed in his office, and to top it off the only thing anyone asked me asked me was if I wanted to give her mutt a dog treat?!?!?  What type of customer service is this??? what type of unorganized dive shop is this?? will be going elsewhere from now on!", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "111310897840682505575", "name": "Mont Jaymz", "time": 1524575771393, "rating": 1.0, "text": "Horrible Service. Horrible owner .. Gear stays for weeks that turn to months with no call... Has happened to 4 of my dive buddies, myself and my father .. Each who swear they'll never go there again. Save ur money go to Panama City Divers Den or Dive Locker ... Ull get ur gear done right and shipped back to you or given back that day .. Oh n air fills 5 bucks.", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "108747148330761035947", "name": "Chad Hill", "time": 1450234368879, "rating": 5.0, "text": "Incredible prices, too notch salespeople and teachers who really care about their craft.  I've been diving for years and this is were I choose to take my children to learn!!!", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "109268273710875462007", "name": "Lee Winnige", "time": 1477936572935, "rating": 5.0, "text": "Great service and knowledgeable staff. Whether for purchasing equipment, training or booking a trip.", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "104912490585312292216", "name": "Chris Stantis", "time": 1477948232246, "rating": 5.0, "text": "The owner is helpful and friendly. Take one of their PADI classes and get certified!", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "101216743082299773656", "name": "Robert Evans", "time": 1497574331463, "rating": 5.0, "text": "Staff knows their stuff.", "pics": null, "resp": null, "gmap_id": "0x888918eb7cf96a7d:0x8ff39ea582d03f9d"}
{"user_id": "106431159864702836106", "name": "Scott Sutton", "time": 1621273389519, "rating": 5.0, "text": "The staff is very friendly, extremely helpful without being pushy.  Great place for professional dive advice and gear.", "pics": null, "resp": {"time": 1621276167595, "text": "Thank you Scott. We appreciate your business."}, "gmap_id": "0x88626cb1702addd9:0x3e16f7bcf4ce7e30"}
{"user_id": "111576705602882832832", "name": "Heath Skelton", "time": 1623353247361, "rating": 5.0, "text": "The Open Water Certification class was great, and the staff is friendly and helpful in my experience.", "pics": null, "resp": {"time": 1623354050944, "text": "Thanks for the feedback Heath. We enjoyed having you in our class and look forward to more diving adventures with us!"}, "gmap_id": "0x88626cb1702addd9:0x3e16f7bcf4ce7e30"}
{"user_id": "114332004716934224320", "name": "dennis robertson", "time": 1619565874182, "rating": 5.0, "text": "Been doing business with them for years.  They have what I want and need to go diving safely and efficiently.", "pics": null, "resp": null, "gmap_id": "0x88626cb1702addd9:0x3e16f7bcf4ce7e30"}
{"user_id": "106036904765287815732", "name": "Jason Trodglen", "time": 1599946115910, "rating": 5.0, "text": "I couldn't ask for more from a local business. The staff are always very helpful and knowledgeable about their products. Their prices are very reasonable and I enjoy doing business with this dive shop.", "pics": null, "resp": null, "gmap_id": "0x88626cb1702addd9:0x3e16f7bcf4ce7e30"}
{"user_id": "101780998557591239356", "name": "Shaun Starnes", "time": 1595347997932, "rating": 5.0, "text": "Excellent dive shop, the staff is knowledgeable and they offer a lot of courses to advance your diving skills. The staff gives great advice in regards to purchasing new equipment. All around great dive shop.", "pics": null, "resp": {"time": 1595351982792, "text": "Thank you Shaun!"}, "gmap_id": "0x88626cb1702addd9:0x3e16f7bcf4ce7e30"}
{"user_id": "116426559932290413383", "name": "gus buffler", "time": 1602794284754, "rating": 3.0, "text": "Equipment way too expensive, buy that somewhere else.\nBut Shawn and the rest are great instructors.I enjoyed the lessons.", "pics": null, "resp": null, "gmap_id": "0x88626cb1702addd9:0x3e16f7bcf4ce7e30"}
{"user_id": "103903671620237750314", "name": "Todd Knight", "time": 1597337254108, "rating": 2.0, "text": "Staff is friendly and helpful, but they DO NOT service scubapro, spare air, etc ...... The website doesn't list any specific brands, which leads one to believe that any gear can be serviced...nope.", "pics": null, "resp": {"time": 1597341281657, "text": "Hi Todd, we are sorry we are not able to service your equipment. We formerly had an outside service we could send these brands to but they have recently closed their business. We have searched for a replacement but have been unable to find one that would be financially feasible. We will add the brands we can service to our website. Thanks for pointing out that."}, "gmap_id": "0x88626cb1702addd9:0x3e16f7bcf4ce7e30"}
{"user_id": "114644423544718169104", "name": "john england", "time": 1592064288960, "rating": 5.0, "text": "Great dive shop. Always friendly and top notch service!", "pics": null, "resp": null, "gmap_id": "0x88626cb1702addd9:0x3e16f7bcf4ce7e30"}
{"user_id": "102920897619254052126", "name": "Corey Spurgeon (Sideswipe)", "time": 1590615602674, "rating": 5.0, "text": "Love the place the people working there is always willing to help", "pics": null, "resp": {"time": 1590678459402, "text": "Thank you!"}, "gmap_id": "0x88626cb1702addd9:0x3e16f7bcf4ce7e30"}
{"user_id": "113040366846357484255", "name": "Hugh “Chappy” Chapman", "time": 1528297287701, "rating": 5.0, "text": "Top notch service and equipment available.  Classes are not only professional but a joy to take.  Great dive shop deserving of 5 Star PADI rating.", "pics": null, "resp": null, "gmap_id": "0x88626cb1702addd9:0x3e16f7bcf4ce7e30"}
{"user_id": "114467286195100641695", "name": "Chris White", "time": 1518311118800, "rating": 5.0, "text": "My family and I have taken several classes with SDI and have enjoyed every aspect of the training!  Everyone I’ve had the opportunity to meet and learn from has been very knowledgeable and enthusiastic in sharing the sport of scuba diving with me!  I’m looking forward to blowing more bubbles!  Thanks Sean, Max, Mox and Greg!", "pics": null, "resp": null, "gmap_id": "0x88626cb1702addd9:0x3e16f7bcf4ce7e30"}
{"user_id": "102070102844287852030", "name": "Glen Strobach", "time": 1342897843986, "rating": 3.0, "text": "Took our equipment to SDI for a rebuild last year and put everything away.  Fast forward to 11 months later, took the equipment out and went diving.  The secondary octo's leaked air straight off the bat.  I took them back in to the store and explained that they must have adjusted something wrong and to please look at them.  The agreed to re-adjust for no fee since they did the work.  The \"couple\" days turned into a week and I heard nothing.  After stopping to check on them I was told they were next in line to be worked on \"he thinks\" but he will have the guy call me.  I requested a phone cal either way so I could arrange picking them up.  1 week later (today) I stopped in to check on them and they were still not completed and yes, NO phone calls or communication either way.   I took my faulty equipment back and will look to mail them or just buy new ones (not from SDI).  Worst customer service afetr the sale I have ever seen PERIOD!  The only way they stay open is being the only game in town.....  Run Away!", "pics": null, "resp": null, "gmap_id": "0x88626cb1702addd9:0x3e16f7bcf4ce7e30"}
