{"user_id": "106990939780327463946", "name": "John Foster", "time": 1615438785168, "rating": 5.0, "text": "Best out of 5 lawyers I've ever used.", "pics": null, "resp": null, "gmap_id": "0x88891d42f938d5e7:0x9bed10fa71dc785c"}
{"user_id": "114580524993718063933", "name": "April Paulick", "time": 1625886544071, "rating": 1.0, "text": "Not real nice", "pics": null, "resp": null, "gmap_id": "0x88891d42f938d5e7:0x9bed10fa71dc785c"}
{"user_id": "103817065231394137258", "name": "Tanya Nunn", "time": 1571970387356, "rating": 5.0, "text": "Great guy great lawyer he has helped me and my family in many situations", "pics": null, "resp": null, "gmap_id": "0x88891d42f938d5e7:0x9bed10fa71dc785c"}
{"user_id": "109220731276202641554", "name": "Tanya Nunn", "time": 1499876840007, "rating": 1.0, "text": "The only reason I gave a one is because you had to in order to leave a review. I would never personally tell anyone to use this lawyer unless you want to handle the case yourself we used him on a few criminal cases that there was no evidence in and had to do all the leg work in he did nothing he made my child take a guilty plea that there was no evidence in absolutely none. Well we tried to let him do a suing case and he asked us to call the insurance company and to go fix our totaled car so therefor i hired another lawyer on it we had a criminal case this morning that he was suppose to be at the last hearing and he didn't show up so  if you want this lawyer you best be ready to do the work yourself and pay out the butt to him", "pics": null, "resp": null, "gmap_id": "0x88891d42f938d5e7:0x9bed10fa71dc785c"}
{"user_id": "114470386716366897983", "name": "Jack durham", "time": 1556742573347, "rating": 5.0, "text": "He is processing some real estate paper work for me. Very good attorney.", "pics": null, "resp": null, "gmap_id": "0x88891d42f938d5e7:0x9bed10fa71dc785c"}
{"user_id": "113847056582779468250", "name": "Dennis Coshatt", "time": 1573665326632, "rating": 5.0, "text": "Honest and dependable", "pics": null, "resp": null, "gmap_id": "0x88891d42f938d5e7:0x9bed10fa71dc785c"}
{"user_id": "108264310669485384528", "name": "Liz Taylor", "time": 1566294031965, "rating": 5.0, "text": "Very professional.", "pics": null, "resp": null, "gmap_id": "0x88891d42f938d5e7:0x9bed10fa71dc785c"}
{"user_id": "108649795811651433616", "name": "Mo B", "time": 1603336105117, "rating": 4.0, "text": "Friendly", "pics": null, "resp": null, "gmap_id": "0x88891d42f938d5e7:0x9bed10fa71dc785c"}
{"user_id": "101096852331784596014", "name": "Nick Gehricke", "time": 1624968946759, "rating": 5.0, "text": "I'm located out of state, so when I needed an attorney I searched high and low to find the best one. I sent many inquires out to the ones that I thought were fitting, Mr. Merrell replied in no time. We were able to establish an action plan for what was needed all while I was remote.\nIn the end, he and his office were prompt and helpful with any questions or assistance needed. If you ever need any legal guidance in Alabama, be sure to reach out to Merrell Law Firm!", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "111015909430046914671", "name": "James Huffman", "time": 1621896557232, "rating": 5.0, "text": "Ed Merrell and his staff's professionalism is outstanding. I would recommend this Firm above all others I have used in the past. They get the job done. You can rest assured your legal matters are in the best hands for whatever issues you are needing done. Five stars!!", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "104235693064381719100", "name": "Josh Johnson", "time": 1620917446395, "rating": 5.0, "text": "I dont typically post reviews, but I understand the difficulty finding good legal representation. Hopefully this review will help others in narrowing their search for legal representation. I spent time searching for the right fit for myself when going through a divorce. I landed with Merrell law firm. I can say without a doubt, I made the right choice. My divorce was difficult at best, but Ed was always a calming force, was honest with his feedback, and fought hard for my rights. Ed is not your \"typical\" attorney. I was unfortunately involved with other attorneys during this process, that were not employed at Merrill law firm. I quickly learned a lesson in law. In my experience a lot of attorneys are concerned first and foremost with money, and concerned secondary with actually dealing with and helping the person behind their paycheck. I never felt this way with Ed Merrell or anyone else at Merrell law firm. Ed has a passion for actually helping his clients and a genuine/honest approach to his job. If you want honest, hard-working, knowledgeable, representation, go with Merrell.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "118106593205186573633", "name": "Udayakumar Karuppanan", "time": 1619708376303, "rating": 5.0, "text": "Attorney Edward Merrell has is own style of solving the case as the way the client thinks. He listened patiently and have collected all the fine details related to the case. Attorney Edward Merrell helped me in getting the right verdict for my traffic ticket.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "109560430224563209453", "name": "Will G", "time": 1614466505138, "rating": 5.0, "text": "Mr. Merrill went above and beyond in order to provide me with the best representation possible on short notice and at a price that was better than any other attorney in the area. Great outcome and communication and he made sure that I was satisfied and understood all of my options. I highly recommend that anyone in need of legal services use this firm as you will not be disappointed! Thank you!", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "113066826950900283449", "name": "Miranda Tedder", "time": 1616794508409, "rating": 5.0, "text": "My attorney Sera Harrison is excellent!  She helped me with very little time to prepare.  I will continue to use Mrs. Harrison.  The staff there are very friendly and responsive.  I know if I have a question I can always call the office and someone will help me.  If I really need to talk to Sera, she will always respond or I will set up an appointment to talk with her.  She is very professional and trustworthy.  Mrs. Harrison is an excellent attorney that will fight for you.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "112522944920997138263", "name": "Mor Gabriel", "time": 1619726053908, "rating": 5.0, "text": "I'm very happy I chose Merrell Law Firm to represent me in this case.\nThey took care of it quickly, professionally and kindly,\nKept me posted with any updates, and the service was above and beyond.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "111319880420121112812", "name": "Yolanda Paige", "time": 1619708375419, "rating": 5.0, "text": "This group is awesome and I really appreciate your help with this devastating matter.  Thank you so much❤", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "108487988282236541903", "name": "Judy Spatafora", "time": 1610580343884, "rating": 5.0, "text": "Edward Merrell was very helpful and took the time to answer questions we had.  I would recommend him to anyone needing a good attorney.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "111177851972655755684", "name": "Alysha Rader", "time": 1603638771453, "rating": 5.0, "text": "I chose Sera to help me finalize my divorce. She was extremely profession, courteous, sensitive to the nature of my situation, and very quick to respond. She was able to help me finalize everything after I had moved, and made the process very easy for me. I also had a great experience with Mr. Merrell. The only thing I wished was different is that monthly statements would have been delivered via email without me asking. But they always provided one when I asked. ☺️ Highly recommend Sera if you are going through a divorce. She was always prepared and on top of things.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "109649276153107180822", "name": "Anna Streety", "time": 1624284302750, "rating": 2.0, "text": "He just tells it like it, weather you like it or not.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "110817100660443760298", "name": "Kody Simpson", "time": 1616790155390, "rating": 5.0, "text": "Edward does as he is promised, and fights hard for his clients. I would definitely recommend him to any and everybody.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "100118470903069845880", "name": "SONNI KAUR", "time": 1597183365465, "rating": 5.0, "text": "I spoke with Edward Merrel today about an unfortunate situation that I'm dealing with right now and honestly, what a great experience talking to him. He not only gave me several options that I can take to deal with my situation, but also provided genuine advice on a personal level even though he knows it won't benefit him any way. I was expecting a very limited conversation since it's a consulation. But I'm so impressed at how kind, honest, genuine, and thorough he was. I would definitely recommend Edward Merrel and this law firm to everyone!", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "109711393416802073713", "name": "Clare Taylor", "time": 1595342590145, "rating": 5.0, "text": "I spoke to Ed and he is very responsive, professional, eloquent and nothing short of helpful. I needed someone for my budget and he offered an amazing price. I would highly recommend, especially if your case is in Hoover municipal.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "110803415848538426254", "name": "Shirley Thigpen", "time": 1598546195741, "rating": 5.0, "text": "I had a lot of questions about starting a new business and Mr Merrell went over everything and explained it to me and I am very thankful for everything. Thank you so much for your help.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "103705754368759046934", "name": "drekkerius hicks", "time": 1592931589175, "rating": 5.0, "text": "I called and spoke with Edward Merrill about a problem I was having and he is nothing short of professional. He made sure to find the search for solutions while doing it in a timely manner. I really appreciated his services . I definitely recommend this law firm.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "100102552898619172010", "name": "Christy Blankenship", "time": 1581614109217, "rating": 5.0, "text": "I have used the Merrell Law Firm more than once. Ed made a difficult situation less stressful and easier than expected. Very knowledgeable, trustworthy, professional, and quick to respond. Hands down the best and I would highly recommend! Thank you Ed Merrell!", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "101280170270530621623", "name": "Montece Taylor", "time": 1587419752964, "rating": 5.0, "text": "Great Law firm!! They tell you everything you need to know about your case. Ed has helped me on 2 different cases and I would definitely recommend him", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "109753557535523579799", "name": "Tanasia Bush", "time": 1591808081341, "rating": 5.0, "text": "Picking an attorney is not easy and at times comes with worry. Mr. Merrell erased every fear and doubt in my mind. He’s genuine, highly educated, super caring, and most importantly upfront. I would NOT want to enter a courtroom without him. His passion for what he does is obvious and makes him the great attorney he is. Look no further!", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "115059584847011933548", "name": "Carolyn D.", "time": 1580765159042, "rating": 5.0, "text": "Ed came highly recommended to me and I can see why. He was very knowledgeable and helped me through my whole process. He is definitely here for you, and I will be passing his name along to anyone who needs his services.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "106318046241712578982", "name": "Shontell Washington", "time": 1593453936750, "rating": 5.0, "text": "Mr. Edward Merrell is one of the most kind and genuine lawyers I have met.  He went over and beyond to meet my needs.  I called Mr. Merrell's law firm looking for another lawyer that provided pro bono work.  He informed me the person no longer worked there and that their profession was in another area.  Mr. Merrell took the time out of his day to personally assist me with locating other agencies that could possibly assist with pro bono work.  After calling the agencies, I decided to call Mr. Merrell back to ask if he was willing to take my case.  I was willing to pay for his services because of the personal attention, genuine concern, warm spirit and overall excellent customer service the owner himself, Mr. Edward Merrell, provided me during my interaction with him.  You can not go wrong with Mr. Merrell.  He is truly on your side and for the people!", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "115298817490325355602", "name": "Humble Mj", "time": 1598625851805, "rating": 5.0, "text": "Great law firm they spoke with regarding the case made me feel comfortable", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "111180514278499571858", "name": "Rachel Cofield", "time": 1583072002883, "rating": 5.0, "text": "Mr. Merrell has always been informative and kind, and his staff is excellent. He has helped me with what I needed in a professional and efficient manner and I would recommend him to anyone who needs legal counsel.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "100114933064963761780", "name": "Abdullateef M", "time": 1603898128342, "rating": 5.0, "text": "Generous advice, professional, and fair price. Thanks Edward and Amanda.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "118288186489035288004", "name": "cathy whaley", "time": 1577549602501, "rating": 1.0, "text": "I was married for 46 years. My husband filed for divorce. I retained April bauder to represent me. She told me I would get alimony and the house I lived in. She was wonderful UNTIL we went to  trial. SHE  was on my ex husband side. He got everything we owned no alimony after 46 years of marriage.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "104742600963525584488", "name": "Heather Fox", "time": 1541165555142, "rating": 5.0, "text": "Very satisfied with all of Mr. Merrell's hard work to get the case resolved. He was straight forward about everything and was very helpful! I would recommend The Merrell Law Firm to anyone without a doubt! I can't thank you enough for all the hard work you've put in and for being an all around genuine person!!", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "105311531805003506688", "name": "kamal khasanov", "time": 1562606940918, "rating": 5.0, "text": "i would highly recommend Merrell Law Firm, always responding immediately, trying to find the best solution for my problem and do it the best way possible. Personnel from the office very nice and professional.\nit was a pleasure work with Merrell Law Firm.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "102227436809414382496", "name": "Mohamed Hamed", "time": 1588851162544, "rating": 1.0, "text": "I Had a complaint against him in Maryland for professional ethics and If you have a similar case let me know. Please contact me at this email Egylaw@outlook.com", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "115485234818061904927", "name": "Jessica Duckett", "time": 1552071785452, "rating": 5.0, "text": "Edward is awesome. He took time to look into my case and help me on very short notice, was calm and collected and knowledgeable when explaining things, listened to everything I said, and his advice was spot on. Couldn't recommend anyone higher.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "104401215387847839329", "name": "Mandy Smith", "time": 1603920937291, "rating": 1.0, "text": "They will not stand up for you in court. My friend lost custody of her kids because this firm was not prepared. They are rude.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "101702358225407291609", "name": "Melinda Estes", "time": 1500566703574, "rating": 5.0, "text": "I hired the Merrell Law Firm about a year ago and I couldn't be happier with my decision. I have been through a lot and they have went above and beyond for me more then I could ever expect. They truly care! They take the time needed for your situation. I will never go to any other attorney. Hands down the best! They walk you through every step/process of your case. No questions they get the job done. Merrell Law Firm you guys are amazing!! Ed, I can not say enough for how thankful I am for you! HAPPY tears😊", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "112075045922976526753", "name": "Jill Pearson", "time": 1593859665790, "rating": 5.0, "text": "Best family law attorney hands down. Would recommend them always they work hard for their clients.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "114893831333322773486", "name": "David Hudson", "time": 1581626929346, "rating": 5.0, "text": "I’m thankful that I have a good man like him on my side.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "102539137036757386809", "name": "Jessica Rhodes", "time": 1541610951091, "rating": 5.0, "text": "If you are debating your options for legal representation, I encourage you to reach out to the firm. My experience with the candor, speed, expert guidance, and thoroughness were invaluable when dealing with a difficult situation. Edward Merrell has been the bright spot in an otherwise unfourtuante circumstance. Thank you Merrell team!", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "111390122515524971418", "name": "LaShae Hubbard", "time": 1541165066611, "rating": 5.0, "text": "I would highly recommend Merrell Law Firm without any hesitation. He was very attentive to the problem, he went above and beyond to help with my case, and he made sure everything was explained in detail. I couldn't be happier with the attorney I turned to for help. Thank you for all the help and for being such a kind person!", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "116448233890101787477", "name": "April Ray", "time": 1555142919470, "rating": 1.0, "text": "I am going through a nasty divorce. I wanted Mr. Merrell to rep. Me but he pushed me off on Mrs. Harrison. I paid $1000 for her to come to my Pendente Lite court appearance. I had never saw her. She asked me for a document and disappeared for a while. She came and got me around the side hall on another wooden bench after back surgery. I paid another $500 to send the answer to the Decree. Never got to speak to her again. I sent emails and got a rude email saying \"I can not check emails all day. You aren't my only case.\nI then got a letter from Ed which was asking for $5000 immediately to cover the remainder of the case. I sent Mrs. Harrison an email that I had something that could shut down the case. I got a rude email that told me they would not speak to me or return an email till I paid $460 or so now and then the remainder of $5000. That was the last straw. I got them to send me an invoice for ONLY what was behind. I WILL NEVER SUGGEST THEM. Now with no lawyer searching for another I am going to lose my battle to keep my son. It's all about the $$$. I'm paying the deficit, getting my stuff and taking it to another attorney.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "106009435380948202656", "name": "Chris Hampton", "time": 1522848949368, "rating": 5.0, "text": "Mr. Merrell & Mrs. Bauder assisted me in a child custody matter.  Both were extremely helpful and helped me through the entire process.  Highly recommend this law firm.  Both attorney's were awesome.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "100070737649677369970", "name": "Ashley Montgomery", "time": 1525097034451, "rating": 5.0, "text": "Ed is amazing! They are so professional and whatever I need help with he always gets it taken care of. Absolutely wonderful for every type of needs!!", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "101572580796921016233", "name": "Michael Thomas", "time": 1522848795450, "rating": 5.0, "text": "Mr. Merrell put together a will and POA for my mother.  I highly recommend him to anyone.  Very professional and great to work with.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "100952537786589485457", "name": "Drew Pearce", "time": 1612816023021, "rating": 5.0, "text": "Highly recommended", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "110653724884686002918", "name": "Joseph Taylor", "time": 1612815949759, "rating": 5.0, "text": "Highly Recommend", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "118318680000119747984", "name": "Donnie Hill", "time": 1525148537864, "rating": 5.0, "text": "One of the most professional firms I have worked with, extremely accessible and efficient. Helped me finish my case while traveling for work with short notice.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "112535900649921297988", "name": "Rani Bishop", "time": 1540324956102, "rating": 5.0, "text": "He is thorough, thoughtful, and fighter. I am thankful to have someone with TRUE knowledge of the law representing me.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "107943645210854358818", "name": "sabrina smitherman", "time": 1596859972288, "rating": 5.0, "text": "Always a great experience!", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "117458909725346165406", "name": "Patrick Thomas", "time": 1556718690169, "rating": 5.0, "text": "Prompt, professional and courteous. Highly recommend this firm.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "117715603736328270160", "name": "Walt Sabol", "time": 1547430409578, "rating": 5.0, "text": "I have known Steve Merrell for 30 years and every time he has represented me I have gotten very positive results and he always won my case. Walt Sabol.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "108934243810071102583", "name": "LandsMineLLC LandsMineLLC", "time": 1567097693124, "rating": 4.0, "text": "Close friend of my relative, positive feedback in the community", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "107424673228634965629", "name": "Jason Anderson", "time": 1523891730051, "rating": 4.0, "text": "Very friendly and up front about what to expect. There were a couple of times I felt like I had to pull information, however to be fair I am a bit impatient at times. Also, I think some of it is the legal system itself and not the law firm.Overall, they took care of my issues and I would use them again if needed.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "113364986995838554623", "name": "Stephanie S.", "time": 1522850050153, "rating": 5.0, "text": "Edward Merrell is extremely passionate about working for his client's.  I highly recommend and endorse Mr. Merrell.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "103349217363276891089", "name": "McQuael Frazier", "time": 1526912215537, "rating": 5.0, "text": "A great and honest man!! If Mr. Merrell tells you he's going to do something, you can take that to the bank!!", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "109628976247248922604", "name": "aocooperfan williams", "time": 1596376956086, "rating": 4.0, "text": "Very courteous and professional", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "106299251098792469074", "name": "Janiece Peeples", "time": 1540552947935, "rating": 1.0, "text": "I hired Mr. Merrell to represent me in an emergency hearing to try and get custody of my grand child and keep her from being okaced in foster care. There were no allegations of abuse or neglect and it should have been an easy case to win. I paid a $1000,00 retainer fee. He sent another attorney Ms. Baulder and she was totally incompetent. She told me that I could not enter the court room because I was not a party to the case but the child's mother was present and wanted me to go in with her and I had every right to do that but Ms.Baulder refused and just sat at the table and did nothing. She told me that a half day at court would cost $650.00. I contacted Mr. Merrill and asked for my money back he would not even refund me the $350.00 that was left after paying her the $650.00 for doing nothing. I had paid him $1030.00 and he sent me a check for $15.00. Do not trust this law firm.,", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "110109603965891371856", "name": "Wes Christie", "time": 1514131827504, "rating": 5.0, "text": "They do great work!! Helpful, understanding and puts your mind at ease", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "110955517850298924140", "name": "Linda Ponziano", "time": 1523568619769, "rating": 5.0, "text": "I first met April Bauder at legal aid in Birmingham. I took my daughter with me to be my other \"eyes and ears\" as I suffer from anxiety and panic disorders, and needed legal advice as my husband was divorcing me, for the 4th time and I had no money to hire an attorney. April was kind and compassionate and patient. I started off my divorce without a lawyer, as the husband made me all kind of promises, and I believed him. You know the saying \" fool me once, shame on you, fool me 7639 times.....\", well..... things got ugly, and I saved my quarters, dimes, and nickles, worked harder, and on Jan 23, 2018 I hired Miss April Bauder. Why? You don't  fake kindness, that is something  you are taught. You don't fake compassion, that is something you feel. People with handicaps are treated \"different\", and April has never treated me different. She ALWAYS returns my calls, and last, her laughter! She has this infectious,  contagious  BEAUTIFUL laughter!!!!  The last few months have been sorrowful, painful, and soooo much hurt. I could cry til the sun goes down, April calls me and I giggle, and giggle and giggle! Proverbs 17:22 \"a cheerful heart is good medicine, but a crushed spirit dries up the bones.\" (NIV)  AND Leah Thomas? Well, somewhere is a storage unit, there is a sparkling little tiara, for her, and she will be the guest of honor at my next pool party! Thank you, thank you thank you, April. If it wasn't for your volunteer work, I would of never found you. Grateful  for the Merrell Law Firm, and what it produces out of it's  people, for people like me who are struggling.... Linda Lee Ponziano Bradford", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "115060633354811417577", "name": "Gjjb Jknb", "time": 1503384729087, "rating": 1.0, "text": "I do not recommend them.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "109899877183884633837", "name": "John Law", "time": 1525041817079, "rating": 5.0, "text": "Outstanding, very caring and compassionate.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "106578124279492448492", "name": "Mateus Oliveira", "time": 1620814545747, "rating": 5.0, "text": "(Translated by Google) Mr. Pablo's work for me was very fast as a result of my process. To Mr. Pablo Rocha, thank you very much for your work. He's an excellent lawyer.\n\n(Original)\nO trabalho do senhor Pablo para mim foi muito rápido o resultado do meu processo . Ao senhor Pablo Rocha muito obrigado pelo seu trabalho. Ele é um excelente advogado.", "pics": null, "resp": null, "gmap_id": "0x888923b58aedf6eb:0x421fef70b97ec27f"}
{"user_id": "106574148164203850254", "name": "Paul Roberts", "time": 1621702855189, "rating": 5.0, "text": "Lee Webb is great! Need legal advice or documents? Call him.", "pics": null, "resp": null, "gmap_id": "0x889a408e32daaa35:0x7c8db55168b446f5"}
{"user_id": "102706798649714163197", "name": "brian johnson", "time": 1608138747345, "rating": 1.0, "text": "I hired Ken Raines and ended up with someone named Lee Webb. They requested a real big retainer, which I paid. They advised me to do what I will call a pipe dream and chase a legal avenue that only cost me a big pile of money. In short, a crazy long shot and answering emails, and drafting a response for $1375 cost me all of my retainer in a few months. They billed even more which they said they wrote off and fired me two days before a bunch of discovery items were due to opposing side because I refused to fill their pockets back up....In  my opinion they railroaded me and took advantage of my good nature..Again, in my opinion you shouldn't consider this firm", "pics": null, "resp": null, "gmap_id": "0x889a408e32daaa35:0x7c8db55168b446f5"}
{"user_id": "105914742844252368175", "name": "john john", "time": 1602975287561, "rating": 1.0, "text": "Took my business elsewhere since discovering they couldn't get justice for Echo. Shame.", "pics": null, "resp": null, "gmap_id": "0x889a408e32daaa35:0x7c8db55168b446f5"}
{"user_id": "109390182791980391584", "name": "Tyler tbreezy Brown", "time": 1556074420142, "rating": 5.0, "text": "Great friend", "pics": null, "resp": null, "gmap_id": "0x889a408e32daaa35:0x7c8db55168b446f5"}
{"user_id": "103693046227545524431", "name": "Jessica Hodges", "time": 1616551854380, "rating": 5.0, "text": "Mr.Thomas worked fast and he is very honest about the process!! I'm very pleased that i chose him to get the job done! I would recommend anyone who is looking for a divorce lawyer to look no further.. He has reasonable prices!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "101889267994627716093", "name": "Dominick Haywood", "time": 1624115185527, "rating": 5.0, "text": "Very nice man about business and business only I recommend anybody to him because you going to get your money's worth", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "114537209137586778649", "name": "sami shakir", "time": 1627494038675, "rating": 5.0, "text": "Awesome attorney.. very helpfull", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "110649431474134034650", "name": "Desiree Saunee", "time": 1609436191066, "rating": 5.0, "text": "Very knowledgeable helpful kind caring lawyer. Made the process easy and go smoothly. I highly recommend Monk law firm!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "110908484126716492716", "name": "Britney Johnson", "time": 1615488220804, "rating": 5.0, "text": "Awesome attorney, very responsible price definitely recommend", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "108844368881044810034", "name": "Justin Lindsey", "time": 1595624990819, "rating": 5.0, "text": "Mr. Monk was very professional, personal and intuitive when handling my case. I highly recommend him and wish him well.\n\nThank you, Mr. Monk!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "102246230259998690517", "name": "Devin Prince", "time": 1591805554198, "rating": 5.0, "text": "I am very pleased that I chose Mr. Monk for my divorce. He was professional and kept me updated on my case.  It was a smooth process and  at a price I could afford.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "107250789019554688986", "name": "Katy Moore", "time": 1565381341990, "rating": 5.0, "text": "Tom Monk is fantastic. After being referred to him through many people, I was not let down. He goes over everything thoroughly, gives great legal advice, and is very understanding. I love his hospitality and anyone thinking about going to him just do it, because it’s totally worth it! Price was the cheapest I found, awesome turn around time, and just a wonderful experience!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "110251864925127362841", "name": "Faith’s Fundamentals", "time": 1560792735259, "rating": 5.0, "text": "Mr. Monk was beyond helpful in my divorce, and sensitive to the situation which I have not found to be the norm in my search for an attorney. Very knowledgeable and made sure all bases were covered. He was very efficient and flexible with my schedule. I appreciate all of his help and would recommend him 100%.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "111266825448274162459", "name": "Megan Presnall", "time": 1566507555804, "rating": 5.0, "text": "Mr. Monk was incredibly helpful and thorough in answering all my questions. I have been so impressed with his work ethic, he made the entire process quick and painless for me. I’m so appreciative to him, and so glad I chose him!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "107527808736310480238", "name": "kat cannon", "time": 1401293005622, "rating": 5.0, "text": "I went to the Monk Law Firm for my divorce and I highly recommend him if you are seeking an attorney. I was able to get an appointment right away. I was in and out in less than 30 minutes and left with my divorce papers in my hands. Mr. Monk was extremely knowledgeable and professional and made sure I clearly understood everything. I cannot say enough good things about my experience. His rates were ridiculously low and reasonable. I will definitely use this law firm again if I ever need an attorney in the future.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "117844328751739823745", "name": "Ashlee Maddox", "time": 1550003981037, "rating": 5.0, "text": "Mr. Monk is amazing.  He worked with my schedule, got everything done quickly, and is super friendly and down to earth.  He made this process 100% easier than it would have been if I had tried on my own.  Totally worth it.  😁", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "111070648457674222997", "name": "kat tay", "time": 1553020958661, "rating": 5.0, "text": "Wonderful attorney.  Very professional, friendly, efficient and extremely reasonable rates.\nI highly recommend Tom Monk for your divorce needs.  He got everything done the way I wanted it.\nI received text letting  me know my divorce had been filed.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "103918881988051373185", "name": "Clarke Stewart", "time": 1557874179124, "rating": 5.0, "text": "Mr Monk by far is the best choice in mobile. He made a very stressful time in my life much easier. He didn't complain when I brought my soon to be ex-wife and son with me to fill out the paperwork. I couldn't recommend him enough, he was such a great help. If you are going through a bad situation and you feel that divorce is the best way, give Mr Monk a call.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "103147551407079646269", "name": "Jana B", "time": 1563981246735, "rating": 5.0, "text": "Mr. Monk has been excellent through this process. I give him 5 stars. Would recommend to anyone going through a divorce. He has been very understanding and helpful through this experience.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "102950424644914813785", "name": "Jessica Bethel", "time": 1527045166906, "rating": 5.0, "text": "Walking into Mr. Monk's office, I wasn't quite sure what to expect. I knew little to nothing about divorce. All I knew was that I needed one. After calling around I realized just how expensive it could be. Mr. Monk answered my call personally, met with me the very same day, and drew up the paperwork at our meeting. He was very personable and answered all of my questions. He put me at ease and made a difficult situation a little better.  I would definitely recommend this attorney to anyone looking for an affordable divorce.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "107726229239897155048", "name": "Jessica Walker", "time": 1478793375779, "rating": 5.0, "text": "Mr. Monk is absolutely the best professional lawyer I have ever meet with.  I called him yesterday, explained to him that I needed an uncontested divorce, meet with him the same day, and he had all of my paperwork typed up and ready to be signed in less than 1 hour. He is the cheapest divorce lawyer, that  I was able to find in the city of Mobile!!!  He is very professional, straight forward, and very \" DOWN TO EARTH\"!!!  I WOULD HIGHLY RECOMMEND MR. MONK TO ALL OF MY FAMILY, FRIENDS,  AND EVEN STRANGERS!!! JOB WELL DONE!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "115922921392165301290", "name": "Caroline Miller", "time": 1490049723147, "rating": 5.0, "text": "Thomas Monk was great to work with and made the uncontested divorce process very straightforward.  He is a great listener and was patient with answering my many questions.  Mr. Monk made several legally sound suggestions that showed he prioritizes his clients' best interests.  I would recommend his services to anyone looking for a fast, affordable divorce.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "108111948271231484653", "name": "Josh Henderson", "time": 1556821925288, "rating": 5.0, "text": "Mr. Monk was excellent in handling all of my needs. He has very great prices as well. Very kind and professional. Would recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "117996380554097907232", "name": "Darren Felps", "time": 1339855752614, "rating": 5.0, "text": "Mr. Monk is a very affordable and super fast divorce attorney. He answers the phone personally and will explain everything fast and easy. I called him in the afternoon and had a meeting the same day. One day later I had papers ready to go. Thanks for the good work, very highly recommended.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "107163839347659369941", "name": "Candise Beech", "time": 1396723804570, "rating": 5.0, "text": "I called to different attorneys and I didn't want to break my account! I called and he had a great price and for an uncontested divorce and a property deed! I called Wednesday and ask if he could meet me Friday he said yes what about 11! I got there he was very friendly! I ask him how long would it be before I got my papers! He said you could have them tomorrow( which was Saturday) he said I know it Saturday! He said I will have them before 5 pm! Well he had them ready and to be signed before 1:30pm! I will recommend him to anyone that needs an uncontested divorce! He was great!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "110328229294518294026", "name": "fredyb", "time": 1589051285939, "rating": 5.0, "text": "Great honest service and reasonably priced!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "110671274956711995313", "name": "Alexis Murphy", "time": 1529445805266, "rating": 5.0, "text": "No divorce is easy. All parties involved are losing something, but with Mr. Monk handling everything at a fair and reasonable price everything is more convenient. Thank you for your help and support! Would refer his services to anyone looking for help!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "115642641180487642159", "name": "Mi P", "time": 1543337450878, "rating": 5.0, "text": "Efficient, fast, and knowledgeable. He works around your schedule to help make the process easy. I also contacted him last year and he was just as helpful. I would recommend Mr. Monk.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "101366672127529149928", "name": "Kristy Shear", "time": 1492041310382, "rating": 5.0, "text": "Very affordable and reasonable. Mr. Monk was very helpful and gets things done very quickly for you. He will even text you to communicate which is very helpful for someone like me that works a full time job. I would highly recommend his services!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "101721767856688854584", "name": "Elesia Boykin", "time": 1556207885893, "rating": 5.0, "text": "Very professional, timely, and thorough! Mr. Monk got everything done in a timely fashion so that I’m able to free myself of my past and walk boldly into the future! I highly recommend him as your divorce attorney!!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "102213406689615592494", "name": "Nicole Dixon", "time": 1521215644518, "rating": 5.0, "text": "Mr. Monk is intelligent, hard working, assertive and very responsive. As soon as I met him I knew I was in good hands. I would highly recommend him to my family members and close friends. Great Attorney!! And very very great PRICES 👌🏾", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "109239654439317845746", "name": "Antoine Randle", "time": 1370429108685, "rating": 5.0, "text": "Mr.Monk is awesome! He genuine, fast, straight to the point and honest. There is no run around about the price and he was very understanding and flexible of my time schedule, all things which are rare in an attorney. I recommend Mr.Monk to anyone who is looking for real quality legal work.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "102099951557169841074", "name": "Laura Eddins", "time": 1426957844785, "rating": 5.0, "text": "I needed a quick uncontested divorce and was unsure what steps to take. I called Mr. Monk and he was able to meet with me immediately! He walked me through everything that needed to be in the paperwork and made sure I had a clear understanding of the process which wasn't easy because I had my very rambunctious 3 year old with me. Mr. Monk was very patient and understanding. He was able to have the paperwork ready for me the very next day! I would most certainly recommend Thomas Monk to anyone seeking a divorce lawyer.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "116150721211366562251", "name": "Savannah Hardin", "time": 1530196319072, "rating": 5.0, "text": "Mr. Monk is wonderful! For a quick and affordable uncontested divorce he’s the man to see. He answers all questions and concerns, I highly recommend giving him a call for your legal needs!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "102710175519672959185", "name": "Brittni Mosley", "time": 1519321808997, "rating": 5.0, "text": "Definitely did not feel pressured into doing anything that I did not want done. He made the divorce so simple. He even made the best suggestion because I had no idea what to do. Very thankful that I found such a great attorney.", "pics": null, "resp": {"time": 1519324772491, "text": "Thank you for considering me as your attorney. I am always happy to provide as many different solutions to a problem as possible and explain possible the consequences of those solutions."}, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "116717307148942463025", "name": "Joe Pelletier", "time": 1390877041759, "rating": 5.0, "text": "I needed an uncontested divorce,needed it fast,and couldn't afford to spend hundreds & hundreds of dollars to have it done.I started calling around and searching online for a local attorney who could help me and not break the bank... I came across Thomas Monk on the net and called his office and I'm so glad I did. Not only was he willing to meet with me right away,but he made me feel like a friend doing a friend a favor.He was very professional and courteous, and made the whole experience relaxed and stress free. It was a bonus that his fees were much lower(which scared me at first) than all the other attorneys I spoke with.He had my papers printed and in my hand the first day,and after all the necessary signatures/notaries were there,he took the time to file them with the court that very day! It was painless and I would recommend Mr Monk to anyone seeking divorce.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "115922383814943025349", "name": "Angela Gray", "time": 1369794301913, "rating": 5.0, "text": "I am very happy that I chose Mr. Monk to be my lawyer. He was very helpful and organized. He had all of his paperwork ready and in order. He answered all my questions. His prices is very reasonable. So, if you need a good lawyer, Mr. Monk is the best!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "102006439302374823525", "name": "Laura Grantham", "time": 1511668885342, "rating": 5.0, "text": "HIGHLY RECOMMEND!  I used Mr. Monk for a non-contested divorce.  He was very knowledgeable, organized, and made the process as pleasant as a divorce can be.  Mr. Monk was very responsive and helpful during the entire process.  I would highly recommend Mr. Monk.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "114513546908507877572", "name": "Shanna Ludlam", "time": 1406729964045, "rating": 5.0, "text": "Mr. Monk was extremely nice and professional. He made the whole experience as easy as possible. He was very helpful , even calling me himself to discuss a change that could be made. I would highly recommend him for any legal needs.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "102489557940812919998", "name": "Amelia Cervantes", "time": 1347972974226, "rating": 5.0, "text": "I WAS LOOKING FOR A LAWYER TO HANDLE MY DIVORCE BY PUBLICATION AND MOST OF THEM WANTED SO MUCH $ UPFRONT BUT I CAME ACROSS MR. THOMAS MONK WHO I DECIDED TO HIRE BECAUSE HIS SERVICES WEREN'T OUTRAGEOUSLY EXPENSIVE. HE WAS EASY TO WORK WITH AND ALWAYS KEPT ME INFORMED OF WHAT WAS GOING ON. HE TOOK CARE OF THE STEPS NEEDED SUCH AS NEWSPAPER PUBLICATION IN A VERY TIMELY MANNER. HE SHOWED UP TO COURT AND DID A GREAT JOB. MY DIVORCE IS FINAL AND I JUST RECEIVED MY DIVORCE DECREE 2 WEEKS AFTER GOING TO COURT. I WOULD TOTALLY RECOMMEND HIM TO ANYONE WHO IS LOOKING FOR A GREAT LAWYER WHO IS TRUSTWORTHY AND  WONT TAKE YOU OUT ON THOUSANDS OF DOLLARS!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "101244449569377946466", "name": "Rae Arnold", "time": 1558638967099, "rating": 5.0, "text": "Amazing honest and friendly lawyer. A rarity in the field. 100% reccomend. Helped me with my divorce. Very straightforward", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "101892604466236836482", "name": "Curtis Thompson", "time": 1527278868510, "rating": 1.0, "text": "It is a lawyers duty to defend those of us who are not affluent in the law. As most people will read this from a google search, lets assume you are facing charges for the very first time. DO NOT HIRE THIS MAN. He may be great at handling other forms of law work, but as a criminal defense attorney he is atrocious. His promises made are but words to convince you to hand over your hard earned money. Continue your search, and good luck.", "pics": null, "resp": {"time": 1527281435828, "text": "I don't know who you are. You are not one of my clients. I am sorry you had such a horrible experience. But you have got me confused with someone else. Please retract the inaccurate review."}, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "105962131280823257108", "name": "Debbie Henderson", "time": 1355637165635, "rating": 5.0, "text": "The process of divorce is never a pleasant experience.  But with Mr. Monk handling my divorce he made it as simple as possible, explaining everything along the way.  He never made me feel like I was bothering him when I contacted him and he was always very prompt in responding.  He looked out for my best interest and brought up several points to consider when we were discussing the wording of my divorce paperwork in order to protect me in the future.  I would certainly recommend Mr. Monk to anyone who find themselves needing an attorney.  His fees are reasonable and his service is top-notch!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "103428123421307026329", "name": "Margaret Jordan Tooley", "time": 1406157388565, "rating": 5.0, "text": "Mr. Monk is an amazing divorce lawyer. I paid him and literally had my divorce papers draft in my email that afternoon. Everything looked great and his price was very reasonable too! I will definitely recommend Mr. Monk to anybody getting divorced!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "113323636312964778284", "name": "Leann Neilson", "time": 1436276920840, "rating": 5.0, "text": "Mr.Monk was very polite and well spoken. He help me to make sure I  had everything I needed to move forward, with a quick and clean divorce. Divorces can be a very stressful time but with Mr. Monk he made it as less stressful for me as possible. I would highly recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "118065910215197322730", "name": "Tiffani Moore", "time": 1543271241504, "rating": 5.0, "text": "He was great! Very eager to answer any and all questions. Fast and easy process. Highly recommend Mr. Monk!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "109045313681835752854", "name": "Jessica July", "time": 1393527752049, "rating": 5.0, "text": "I had a wonderful experience. My divorce was easy, fast, and affordable. I would highly recommend Mr. Monk to anyone. He was very knowledgeable and understanding of my situation.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "103984622516481333793", "name": "Angela Lowe", "time": 1523299547062, "rating": 5.0, "text": "I definitely recommend Mr.Monk. He has made this entire process easy and affordable! He is extremely nice and very helpful. If you are considering a divorce I highly recommend Mr.Monk!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "114315453211861869580", "name": "Rachael Pearson", "time": 1557451927356, "rating": 5.0, "text": "Mr. Monk is a great attorney for a quick, easy, and reasonably priced divorce.  He was very down to earth and non judgmental about my situation, and was available to meet each time I called him.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "103692224669361411309", "name": "dante Easterling", "time": 1543259691823, "rating": 5.0, "text": "Very quick and efficient! Helped me navigate through my divorce. Also, very reasonable price.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "116480161344366737721", "name": "Joker Jones", "time": 1555541484859, "rating": 5.0, "text": "He did amazing job for me getting out of very long  divorce  after 11 years waiting and being separated he was able to get me out of it I’m so thankful for everything mr. Monk did for me and my family and I be able too happy and enjoy my life he was always up front about everything and explain everything to me and let me know the process and I am very extremely satisfy with everything thank you for everything you did mr. Monk", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "108572905953123794669", "name": "Etuanda Rox", "time": 1429561404449, "rating": 5.0, "text": "Mr. Monk is great at what he does!!! Straight to the point...He made my whole situation comfortable. This was the best appointment I've had in the last 5 and 1/2 years....I recommend Mr. Thomas Monk to anyone going thru a divorce.... Gotta love that man!!!😙😙😙", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "110250786780628406022", "name": "rebekha friedrich", "time": 1470446649310, "rating": 5.0, "text": "Mr. Monk is great! I meet with him today for a uncontested divorce and could not be happier with his services. He was extremely pleasant to work with. He helped me see situations outside my mindset to make better decisions out my divorce. Not only was he pleasant to work with and helped me see outside the box he was also very financial friendly. I would recommend him to anyone!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "106841942599252399822", "name": "Sabrina Ramelli", "time": 1411004317922, "rating": 5.0, "text": "Mr. Monk was so incredibly helpful. I am so glad I found him on Google search under family law! I would recommend his services. He is quick and very reasonably priced.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "104307488548400078071", "name": "Michelle Matthews", "time": 1497040688062, "rating": 5.0, "text": "Mr. Monk recently helped me with a non-contested divorce.  I found him to be very personable and knowledgeable and I knew he was always looking out for my best interest.  He was always available to answer any questions or concerns I had and I was very pleased with his honesty and integrity.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "100170156431244596559", "name": "Jacquitta Perry", "time": 1456437554860, "rating": 5.0, "text": "I needed a uncontested divorce. I called Mr. Monk and he was able to meet with me immediately. He was very polite and professional. I was in and out in less than 30 minutes with my divorce papers in my hand. I highly recommend him to anyone seeking a divorce.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "116298197817010374042", "name": "Amanda Allen", "time": 1388498636339, "rating": 5.0, "text": "Tom Monk was referred to me by a friend and I'm so glad she did! He was very pleasant and professional and he took the time to explain things and made sure I understood. In my search for divorce lawyersi have not met one as helpful as he is.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "116906383998573272445", "name": "Jason NunyaBusiness", "time": 1363724452098, "rating": 5.0, "text": "Completely upfront and reasonble with fees.  Other lawyers kept adding fees after I had asked up front about costs.  Mr. Monk had paperwork filled out faster than I could have expected!  Very happy!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "104189960324340320314", "name": "Dedria Payne", "time": 1529676111204, "rating": 5.0, "text": "Mr. Monk was great! I was in and out he explain everything fully to my best interest! I will definitely recommended Mr. Monk.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "106904620287958494411", "name": "Kristen Martinez", "time": 1555346925902, "rating": 5.0, "text": "Very nice and helped as much as possible and get straight to it with no hesitation I recommend this lawyer to anyone in need of a quick divorce at a great price...best divorce lawyer in Mobile and also he has a great attitude and very friendly which helped smooth out the process..", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "117906234696864526402", "name": "Dana Mosley", "time": 1521862017375, "rating": 5.0, "text": "I called and made an appt for the same day. Always spoke with Mr. Monk directly. He always answered the phone and/or called me back within the hour. Would recommend to anyone looking for a affordable and reliable attorney.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "100544919251013608050", "name": "Beth Lowery", "time": 1433782541551, "rating": 5.0, "text": "Mr. Monk made the process efficient and affordable while providing some expert advice. After a brief appointment on a Friday afternoon he provided everything needed to proceed on the following Monday. Would definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "101135975964842358664", "name": "Ladarion Wilkerson", "time": 1583077981835, "rating": 5.0, "text": "Very good attorney affordable an even meet me on the weekend", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "100938346798251502214", "name": "Jennifer Akridge", "time": 1493507713859, "rating": 5.0, "text": "Mr. Monk was very knowledgeable and helpful throughout everything. He his very reasonable as well. Very thankful for his services and would highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "100291127103864432498", "name": "Kat K.", "time": 1388367355423, "rating": 5.0, "text": "I required legal council and set forth into what was a rather exhaustive investigation of my local options. In doing so, I stumbled upon Mr. Monk’s website, and being impressed with what I learned of his credentials and experience, I gave him a call. Mr. Monk met me right away—on a Saturday, during a thunderstorm no less—for the sake of my convenience alone. He was abundantly knowledgeable and proficient, guiding me through each step of what otherwise would have been a rather taxing process.\nI typically do not bother to leave reviews for services; however, this was a case that warranted exception. Such was the exceptional professionalism of the man. To those of you in need of legal council: look no further. Place your confidence in Mr. Monk’s exceedingly capable hands.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "110484679192333123991", "name": "laura heathco", "time": 1526694951237, "rating": 5.0, "text": "He was very reasonably priced. He was friendly and answered all of my questions. Would definately recommend him to anyone!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "109641793835053488205", "name": "Nicole Bass", "time": 1397858999443, "rating": 5.0, "text": "I was referred to Thomas Monk by a close friend and I couldn't be more satisfied! I was nervous and thinking it would be a long process for my divorce but it was anything but that. Mr. Monk is a kind and understanding gentleman and I'm so thankful I used him. I will refer everyone to his practice from now on!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "110482788021972401628", "name": "Christina Smith", "time": 1497444215846, "rating": 5.0, "text": "Choosing Mr.Monk as my attorney was a great decision. He was very fast and thorough with my case. I highly recommend him!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "100883109710175065143", "name": "Michaela Jones", "time": 1530623649566, "rating": 5.0, "text": "Very helpful attorney!! Explained everything to me  thoroughly with my divorce!! Great prices!!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "104655924788877402455", "name": "Brandi Seitz-Graham", "time": 1457126250374, "rating": 5.0, "text": "Mr Monk is a great attorney! Not only did he make the divorce process so much less troublesome and less of a headache he never hesitated to answer my calls, emails, or questions about this process. I recommend Mr Monk for anyone in need of a great divorce attorney or attorney in general.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "116693413687550033092", "name": "Leamiah Hughes", "time": 1557522562781, "rating": 5.0, "text": "Very professional very personable and the best lawyer I've ever had any dealings with.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "102306940916945284199", "name": "Victor Baker", "time": 1523112846660, "rating": 5.0, "text": "One word awesome he let me come in on a Saturday and was very knowledgeable about my situation. The price was great also", "pics": null, "resp": {"time": 1523118219270, "text": "Thank you for the review. I try to work around people's schedules. I also think that some attorneys charge an outrageous price. Therefore, I try to charge something more reasonable."}, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "110818912260265513572", "name": "Jessica Santiago", "time": 1358175676099, "rating": 5.0, "text": "Mr. Monk was very helpful and made the process very easy. He had my paperwork drafted within a few hours of our meeting. I would recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "105661297008689703130", "name": "Brandis Deakle", "time": 1427840865593, "rating": 5.0, "text": "I am very pleased with Mr.Monk and the service he provided. I am glad that I found the right attorney for my divorce. I highly recommend him to anyone. Thank you Mr.Monk", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "101038982761813472733", "name": "Leah Teel", "time": 1497381907871, "rating": 5.0, "text": "Mr. Monk was very helpful, answering any questions I had, and filed my paperwork the same day I came in to sign. He was also the cheapest attorney for getting an uncontested divorce... others still wanted $600+ just to draw up paperwork.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "107857414215658018387", "name": "Lonni Whitten", "time": 1390831637917, "rating": 5.0, "text": "Mr. Monk was a wonderful attorney to work with. He made the process very simple and had my divorce papers to me within 24 hours! :)", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "100918848412066020281", "name": "Kimberly Brooks", "time": 1516145488894, "rating": 5.0, "text": "He was very helpful answered all of my questions was prompt and expedient. I would highly recommend him.", "pics": null, "resp": {"time": 1516147481665, "text": "Thank you. I am always here to provide people with any legal services or advice. I try to make the process of retaining a lawyer as easy and painless as possible. Proudly serving the Mobile and surrounding areas for over 15 years."}, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "112811528325464423925", "name": "Brooke Coates", "time": 1489877566838, "rating": 5.0, "text": "Mr Monk was very helpful and made sure everything was taken care of the way I wanted. He is an excellent lawyer and I recommend everyone to him.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "116862181180013860555", "name": "Zack DuBoise", "time": 1502224861400, "rating": 5.0, "text": "Very fast had my papers drawn up while I was there, and answered all my questions. Very good attorney", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "108458657158945398664", "name": "Amanda Sullivan", "time": 1516152102560, "rating": 5.0, "text": "Mr. Monk was very considerate and helpful with our situation. He was wonderful and I would recommend him to anyone!", "pics": null, "resp": {"time": 1516299404879, "text": "I really appreciate that you took the time to review my law firm and give me a great review. Thank you. I hope you never need an attorney, but if you do need a lawyer, give me a call and I will give you any legal advice that I can."}, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "108415396982975242858", "name": "Christina Benton", "time": 1484067215253, "rating": 5.0, "text": "First time using a lawyer.  He returned my call personally.  He was very courteous and put me at ease.  I would recommend him.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "118201110705392371975", "name": "Angela Denton", "time": 1447890399248, "rating": 5.0, "text": "Mr. Monk came to me highly endosred by two co-workers. I have to say it was advise I am glad I took.  Mr. Monk is very professional yet down to earth with his clients.  He handled my case quickly and efficiently. I was estactic with the results.  Thank you Mr. Monk!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "115918932461475379715", "name": "Dwight Dean", "time": 1523059033869, "rating": 5.0, "text": "Mr Monk is very kind and proactive. We are very happy that he was referred to us!", "pics": null, "resp": {"time": 1523119948830, "text": "Thank you for your complements and kind words. I am glad that my law firm could be of assistance."}, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "118442425985414396073", "name": "Amber Levesque", "time": 1381354618538, "rating": 5.0, "text": "I was very impressed with Mr Monk! He was very helpful, answered all of my questions, great prices! Would defiantly use him again!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "114822241963909608450", "name": "Kerry Lunceford", "time": 1499784186102, "rating": 5.0, "text": "Mr.Monk was super helpful and gets the job done quick. He went out of his way to help me through the process and the price was reasonable.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "116002969610285442389", "name": "Emily Hubbard", "time": 1517864510687, "rating": 5.0, "text": "Great, easy and prompt experience.  Very satisfied. Thank you.", "pics": null, "resp": {"time": 1519324148013, "text": "Thank you for the great review. I always enjoy helping people in different legal situations when possible."}, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "111586487673220306950", "name": "Karl Baldwin", "time": 1338746330033, "rating": 5.0, "text": "My experience with Thomas Monk was a quick and very informative visit. He made my divorce process easy and painless and I will recommend him to anyone who needs a divorce lawyer!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "111122750976135648390", "name": "Jeanette Rivera", "time": 1469816654670, "rating": 5.0, "text": "Excellent service, i would highly recommend him to all my friends and family.Every question i had was answered. It was very affordable,and easy process", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "110704564170420389347", "name": "Andre Kistner", "time": 1467773329881, "rating": 5.0, "text": "highly recommend..explained every detail and option of my case and dealt with it in a timely and professional manner...am more than satisfied with my out come...", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "103159636694854027293", "name": "Tyra Pruitt (myty 0928)", "time": 1363635971615, "rating": 5.0, "text": "Mr. Monk is Great. He is Honest with you  The tells you the Good and the bad.  He listens to what you have to say and  makes sure that he can help you before  anything else.\n\nThanks Mr. Monk", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "108910942517490804652", "name": "Kai cook", "time": 1581181206849, "rating": 5.0, "text": "Quick Fast and Simple..Great job", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "101957913122990009643", "name": "Jasmine Moore", "time": 1602235858024, "rating": 5.0, "text": "Affordable and Efficient..", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "116150071430830637435", "name": "Mike Richardson", "time": 1403414047074, "rating": 1.0, "text": "Spoke to Mr. Monk several months ago regarding a criminal case. Mr. Monk advised me that he would not take the case because it required \"too much research\". It was a simple harassing communications case.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "118009614020611466529", "name": "Jessica Smith", "time": 1548781379351, "rating": 5.0, "text": "Mr. Monk is wonderful at what he does as a Lawyer , If you need a Divorce I recommend him .", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "104098582616835304675", "name": "Katherine Faircloth", "time": 1413047604112, "rating": 5.0, "text": "Mr. Monk was very fast, efficient, professional, and affordable. I would recommend his services to friends and family.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "107775624393835550007", "name": "Laura", "time": 1415225050883, "rating": 5.0, "text": "Friendly, fast, and exceptional services was provided by Mr. Monk. I will definitely will refer him to all my friends and family.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "115213166328278948385", "name": "Shelby Hill", "time": 1492190117607, "rating": 5.0, "text": "Very easy and fast process! He answered all of my questions and made this whole thing easy!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "101125880443282491632", "name": "Monica Blue", "time": 1385407381614, "rating": 5.0, "text": "Mr. Monk was extremely kind.  He went far and beyond. I will tell anyone that needs a lawyer to call Monk Law Firm.  Friendly , proessional and prompt.  He cares and iy shows.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "106880326671288352282", "name": "case sync", "time": 1393945630781, "rating": 5.0, "text": "Professional, knowledged, and dependable . We would definitely recommend his services to anyone in the gulf coast area.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "113410049641717551383", "name": "regina dixon", "time": 1513972194134, "rating": 5.0, "text": "Loved everything about Mr. Monk. He was so professional, and finished everything very quickly. He answered all of the questions I had.", "pics": null, "resp": {"time": 1515598514745, "text": "Thank you for the wonderful review. It was my pleasure. I enjoy being an attorney because I can help people in Mobile and the  surrounding areas."}, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "105837867985487823010", "name": "Daphne Chalker", "time": 1509726218880, "rating": 5.0, "text": "Mr. Monk made the divorce process a breeze. Thoroughly enjoyed working with him!!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "118003744315901162217", "name": "Amber Levesque", "time": 1379709148782, "rating": 5.0, "text": "I was very happy in choosing Mr Monk...not only are his prices great, he is very fast and efficient, answered all of my questions, and was very helpful on things i didn't quite understand, i would totally use him again!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "109881190606663894322", "name": "John Simon", "time": 1485211244211, "rating": 5.0, "text": "Mr. Monk responded quickly and walked me through this process with compassion. I can't thank him enough.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "109826755000022580192", "name": "matthew davis", "time": 1461704285026, "rating": 5.0, "text": "Great experience very knowledgeable and would highly recommend to anyone needing a divorce .", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "105719505259500883355", "name": "carrie Voulgares", "time": 1567095978699, "rating": 5.0, "text": "Very inexpensive for uncontested divorce", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "116597998764142044237", "name": "Karley Bolton", "time": 1445285314055, "rating": 5.0, "text": "Very sweet man and always answers my calls of gets back with me soon after .", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "116702116202582554526", "name": "Roygie Wilson", "time": 1487957575527, "rating": 5.0, "text": "Mr. Monk is very professional, he returned all my phone calls himself, and received my paper the same day!!!!! he was the cheapest I found in Mobile..", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "101889417594527906525", "name": "Randy Lofton", "time": 1469799178169, "rating": 1.0, "text": "He hasn't helped me at all. Wasted my time and money I do not recommend him", "pics": null, "resp": {"time": 1469800482261, "text": "I am sorry that you feel that way. You are always welcome to call me and I will try to assist you in rectifying your issue within the bounds of my representation. I am always up front and honest about the scope of my representation and I always mentioned that I cannot guarantee results."}, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "107225188950615420550", "name": "Forrest Neal", "time": 1546627920907, "rating": 5.0, "text": "Very kind, friendly, and knowledgeable attorney!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "111209870893812618497", "name": "Elizabeth Perry", "time": 1525821384856, "rating": 5.0, "text": "Fast and helpful!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ab063c009:0xd9139bd754c304ff"}
{"user_id": "106358023633286455397", "name": "Brandy Wickliffe", "time": 1567793545319, "rating": 5.0, "text": "Meg is a great lawyer. All options put on the table and very knowledgeable. Great staff as well", "pics": null, "resp": null, "gmap_id": "0x888a29fd968bb997:0x84a6bb06c88bef9"}
{"user_id": "110532470948433774540", "name": "Seth Tanner", "time": 1595208355234, "rating": 5.0, "text": "Nice and professional. They understand", "pics": null, "resp": null, "gmap_id": "0x888a29fd968bb997:0x84a6bb06c88bef9"}
{"user_id": "108963646721637415780", "name": "Vickie Roden", "time": 1619491026946, "rating": 4.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x888a29fd968bb997:0x84a6bb06c88bef9"}
{"user_id": "104775190390376124146", "name": "Darlene Willis", "time": 1552822939862, "rating": 5.0, "text": "Very nice people. Helped alot", "pics": null, "resp": null, "gmap_id": "0x888a29fd968bb997:0x84a6bb06c88bef9"}
{"user_id": "116582384602585384291", "name": "Myrna Kervin", "time": 1564890850312, "rating": 5.0, "text": "Made the whole process very easy and came to our house.", "pics": null, "resp": null, "gmap_id": "0x888a29fd968bb997:0x84a6bb06c88bef9"}
{"user_id": "101197845570960199946", "name": "Chris S", "time": 1584387671946, "rating": 5.0, "text": "This is a Great attorney!", "pics": null, "resp": null, "gmap_id": "0x888a29fd968bb997:0x84a6bb06c88bef9"}
{"user_id": "114874132067472768650", "name": "Crystal Huey (Crystal Beckom)", "time": 1525574423153, "rating": 5.0, "text": "Very nice, helpful firm. Thanks Amber!", "pics": null, "resp": null, "gmap_id": "0x888a29fd968bb997:0x84a6bb06c88bef9"}
{"user_id": "113175244306519093764", "name": "Angel Early", "time": 1491928618722, "rating": 4.0, "text": "They had papers ready when we got there", "pics": null, "resp": null, "gmap_id": "0x888a29fd968bb997:0x84a6bb06c88bef9"}
{"user_id": "100038613926463189267", "name": "McKenzie Meeks", "time": 1624032949804, "rating": 5.0, "text": "Nicole has been nothing short of wonderful. I was needing someone to get the ball rolling so my current husband could adopt my oldest son and no one wanted to make the first move but she never hesitated. Nicole has made this entire process smooth and easy and did it all in such a timely manner seriously she gone above and beyond in just two months. I cannot say enough good things about this woman and her crew at her office, next stop court and a name change and we couldn’t be more excited!!!!", "pics": null, "resp": {"time": 1624034312878, "text": "Thank you for allowing us to assist you with this matter. We really appreciate your kind review!"}, "gmap_id": "0x888e8fff97fcb4e9:0xb269649773a0083e"}
{"user_id": "100261508934301372622", "name": "Whitney Rosario", "time": 1600697037804, "rating": 5.0, "text": "I was looking to start the adoption process, and Nicole was referred to me by a friend. Nicole was very informative and did not hesitate to answer any questions I had throughout the entire process. She made it effortless and was reassuring the entire time that everything would workout perfectly, & it did. I am now mom to 3 beautiful little girls. I would not go to anyone else besides her after the experience we had. As poorly described in the review below, Nicole does what is in the best interest for the children and she will tell you that upfront.", "pics": null, "resp": {"time": 1600707520097, "text": "Thank you!"}, "gmap_id": "0x888e8fff97fcb4e9:0xb269649773a0083e"}
{"user_id": "104855443423686296040", "name": "Leah Gamel", "time": 1594472309158, "rating": 5.0, "text": "Nicole Clark was an attorney for my husband in child custody and then myself in the adoption of my husbands children. She went above and beyond for us! We sat down with many lawyers prior to meeting her. Some told us we didn’t have much of a chance and others told us we would have to settle but not Nicole. Nicole knew we had a good case and she fought for us. She was confident, smart, and eager. She made the courtroom setting less scary for us because she had no problem standing up to any lawyer she faced. She answered any questions we had in a timely manner and as soon as the court gave her any information she provided us with it. I am now the adopted mother of 3 beautiful girls! Nicole was worth every single penny spent. I will always 10 out of 10 recommend her.", "pics": null, "resp": {"time": 1597145648678, "text": "Thank you!"}, "gmap_id": "0x888e8fff97fcb4e9:0xb269649773a0083e"}
{"user_id": "104285027359998150050", "name": "Ashley Crim- Smith", "time": 1598146975474, "rating": 5.0, "text": "Nicole is hands down THE BEST!!! We'll never use anyone else again... HIGHLY recommend using The Clark Law Firm for any& all legal needs!!! She's passionate about the law& DEFINITELY will fight tooth& nail to help your case!!!", "pics": null, "resp": {"time": 1600432629069, "text": "Thank you for your review!"}, "gmap_id": "0x888e8fff97fcb4e9:0xb269649773a0083e"}
{"user_id": "106409108669716650373", "name": "ROXANNE MCNEIL", "time": 1613374672697, "rating": 5.0, "text": "I just absolutely loved my lawyer.... she is the BEST!!!!  Thank you Nicole!!!!", "pics": null, "resp": {"time": 1624034344654, "text": "Thank you for your review!"}, "gmap_id": "0x888e8fff97fcb4e9:0xb269649773a0083e"}
{"user_id": "106900611955904632179", "name": "Lisa King", "time": 1597180817454, "rating": 1.0, "text": "She's rude and takes up for people that shouldn't be takin up for. Believes everything that is told to her by  untruthful people. She doesn't believe in keeping family together rather see them torn apart.", "pics": null, "resp": {"time": 1597146063795, "text": "Thank you for your review of our services. However, after an extensive review of our records, it appears that you are not and have never been a client of The Clark Law Office, LLC. Due to confidentiality restrictions, we are unable to discuss your concerns on an open forum such as this. You are welcome to contact our office to discuss your concerns further."}, "gmap_id": "0x888e8fff97fcb4e9:0xb269649773a0083e"}
{"user_id": "112224174887269544464", "name": "Aaron Sprayberry", "time": 1567695940896, "rating": 5.0, "text": "Mrs. Clark provides nothing but top notch, professional service! I would recommend The Clark Law Office for any of your family law needs.", "pics": null, "resp": {"time": 1592588081449, "text": "Thank you!"}, "gmap_id": "0x888e8fff97fcb4e9:0xb269649773a0083e"}
{"user_id": "112436546463521102260", "name": "Kay Fleming", "time": 1619582540919, "rating": 1.0, "text": "This experience was ongoing for 1.5 years.     Very unresponsive lawyer who does nothing for your case.   His representation toward his client is very unprofessional and never called you back to let me know where my case stands.   After Covid hit it was like he took my money and left me high and dry with case.   This is the worst lawyer I’ve ever hired to represent me in a visitation of grandchild whom I had legal visitation file in court.  So now I’m left without seeing my granddaughter for over 1.5 years.   This lawyer should be disbarred from representing anyone.   Very incompetent in this profession.   I would never recommend him to anyone and even had another lawyer refer me to him which wasn’t any better than Mr. Smith.   I’m so unleashed with how this went.", "pics": null, "resp": null, "gmap_id": "0x8889227564f164c7:0x27248d728f74b2d4"}
{"user_id": "103206095998100104117", "name": "Deja Leonard", "time": 1609455615725, "rating": 1.0, "text": "Had a hard time remembering who I was even when he was the one initiating the call. When I called to terminate services, he said that  he had no record that I paid him any money when in fact I paid a little over $500. Not competent enough for cases; he had a hard time understanding and communicating.", "pics": null, "resp": null, "gmap_id": "0x8889227564f164c7:0x27248d728f74b2d4"}
{"user_id": "111803702494656341480", "name": "Tameka Fields", "time": 1481045598205, "rating": 5.0, "text": "This started off as a less than desirable  experience but I'm happy to say that there was a COMPLETE turn around. Mr. Smith did a great job of walking me through the process and getting things resolved. I can finally officially start the next chapter of my life! I would recommend Mr. Smith to anyone in need of a divorce attorney. Thanks again", "pics": null, "resp": null, "gmap_id": "0x8889227564f164c7:0x27248d728f74b2d4"}
{"user_id": "104603644905360742422", "name": "Andrea Mitchell", "time": 1493740610758, "rating": 5.0, "text": "Tim just finished helping me get my daughter back after her father had taken her away from me.  Tim was always so nice and he wasreally good in court.   I appreciated getting copies of everything he did and he even gave his cell phone number in case I needed him during the weekend.  If anyone is ever in the bind I was in get Tim Smith.  He is great.", "pics": null, "resp": null, "gmap_id": "0x8889227564f164c7:0x27248d728f74b2d4"}
{"user_id": "104248126637153268070", "name": "Jeremy Patton", "time": 1445981457830, "rating": 1.0, "text": "Absolutely can not reach him.  My company paid him to give my wife and I a living will, death will, and POA.  I have only received one and it has marks through it so guessing not fully legal.  Even after meeting my wife and I on 2 separate occasions at 1 appointment(there because he said it was all ready) he handed my wife and I divorce paperwork to fill out and walked off.  Had to chase him down once we realized how wrong he was.  My company paid him in March.  It is now October and still not done.  I have to call him every time.  So far have called him 4 times this week with no response.  Horrible lawyer.  Wouldn't use him ever again!  It shows how attention to detail he is.  Google still has him in Hoover.  He moved downtown at least 6 months ago, but he has no clue!!!", "pics": null, "resp": null, "gmap_id": "0x8889227564f164c7:0x27248d728f74b2d4"}
{"user_id": "104173037221253913100", "name": "Aneesh Chand", "time": 1456587585264, "rating": 1.0, "text": "Highly unethical attorney. We chose Tim since he was  a member of our legal plan to represent us in a civil case. After telling us that the plan would not cover our case, we paid Tim a $2500 retainer. During this time Tim would be proactive and mail us copies of whatever documents he would send or file with the courts. I looked over our legal plan and found that his charges should have, in fact, been covered by our plan.Our legal plan's counse determined that this was so and advised Tim of the same. Since being notified that his time would be covered by the plan and  to not use my retainer for covered charges, I stopped getting any correspondence from his office. No copies of any documents,  no phone calls, no more updates, nothing. Tim never even told us that there was a hearing for summary judgement. The  only reason we found out was from a copy of the order from the  court, itself.  After the hearing, we found out that Tim didn't even argue our case as we had discussed. We eventually lost our case. Tim didn't even bother to notify us until over a week later. When asked about our options, Tim determined that he no longer wanted to represent us and referred us to another attorney who wouldn't even return our calls. When asked about the refund of the $2500 retainer, Tim put us off for over 6 weeks until he finally acknowledged he was trying to \"come up\" with the money. Our legal plan counsel had also been contacting him to return our retainer without further delay. Throughout this time and during our case Tim would never initiate contact with us. We had to initiate contact with him. Even then, it would take anywhere from a week and a half to a month before he would respond.  Tim eventually decided after 46 days that he was no longer going to refund our money despite knowing that his charges were covered by our plan. I have yet to get a breakdown of how my retainer was spent, much less anything else. I would never refer him to anyone. Now he is running for circuit court judge. If Tim is representative of our judicial and legal system, then we, as citizens, have very little when it comes to faith in our legal system.", "pics": null, "resp": null, "gmap_id": "0x8889227564f164c7:0x27248d728f74b2d4"}
{"user_id": "117838392149817286905", "name": "BAMA GIRL", "time": 1615582762075, "rating": 5.0, "text": "Great passion guy who didn't make any promises. He was genuine and honest. He has a passion for helping people. He doesn't take on a lot of clients so he can handle your case properly. He gave me a list of the first few things he would do or if I didn't hire him ,told me I could file them myself. I have never been told that by an attorney and I have had 2 already on this case alone.", "pics": null, "resp": null, "gmap_id": "0x8888ddddef2ece2b:0xd98de9e5bcebda54"}
{"user_id": "116158173801108396774", "name": "Mike West", "time": 1603994363917, "rating": 5.0, "text": "Great attorney. No games , just true hard work for his clients & reasonable.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMsAr1VeL5BZyKbfRrIuNCj1yZrOcEZyeE8Qlck=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888ddddef2ece2b:0xd98de9e5bcebda54"}
{"user_id": "113316844346400886037", "name": "james guynn", "time": 1616029230469, "rating": 5.0, "text": "I spoke with MR Burdick reference representing me in a case involving a company in Alabama.  He was unable to assist me because I live in GA and the case would go before Ca court.  He gave me very good advice after I explain my problem.", "pics": null, "resp": null, "gmap_id": "0x8888ddddef2ece2b:0xd98de9e5bcebda54"}
{"user_id": "106423356344080573431", "name": "Andrew Carroll", "time": 1584270340373, "rating": 5.0, "text": "He helped me get 50/50 visitation with my child and be able to more of an influence in his life. I tried a few other attorneys before I found Austin Burdick. He is very professional and will fight for you just like he did for me. He is a firm believer in equal parental rights. I tried for eight years before finally switching to him. His virtue is uncompromising when it comes to fighting for what is right for and father and his child. No other attorney that I have found works harder for the best interest of the child than Austin. Thank you for always doing your best when it came to my case. You treated it like it was your own child you were fighting for.", "pics": null, "resp": null, "gmap_id": "0x8888ddddef2ece2b:0xd98de9e5bcebda54"}
{"user_id": "114991029666428625589", "name": "Mark Davis", "time": 1590605380105, "rating": 5.0, "text": "Austin, an exceptionally qualified attorney, has represented my best legal interests since 2013. Austin has always gone well above and beyond his required legal duty to protect my rights. I have personal knowledge of Austin doing the same for others.\n\nAustin - accurately - will defend unwarranted legal filings made by opposing corrupt attorneys, he will file accurate legal filings without unnecessarily creating additional strife in your personal life all the while protecting your legal rights, he will personally drive across the state of Alabama for jailed clients working to obtain their freedom, he will call out injustice and attempt to correct it, and he knows - and gets - Constitutional law (a rarity in Alabama).\n\nIf Alabama had more attorneys like Austin working to protect citizen’s legal interests in doing what is right rather than lining pockets and making legal friendships our state would be a better place to live.\n\nIf you want to retain an effective attorney that will work timely and efficiently to protect your rights, Austin is the attorney to retain.\n\n/s/ Mark Davis\nFlorence, Alabama\nmark.davis.al@icloud.com", "pics": null, "resp": null, "gmap_id": "0x8888ddddef2ece2b:0xd98de9e5bcebda54"}
{"user_id": "103977756111192782071", "name": "Jonathan Bates", "time": 1584158183549, "rating": 5.0, "text": "This is home to one of the best attorneys in Birmingham!!!  EXTREMELY knowledgeable in family law, even when children are involved.  All it took was a few phone calls, several documents, and several face to face meetings and everything has been prepared.  My ex will be so excited to see what he has prepared!!!  I literally cannot wait to show her!!!!", "pics": null, "resp": null, "gmap_id": "0x8888ddddef2ece2b:0xd98de9e5bcebda54"}
{"user_id": "110852457605915889068", "name": "KC BAMA", "time": 1586460704984, "rating": 5.0, "text": "Hands down the best lawyer! Highly recommended, I was blessed to have him represent me. As a man, I was facing a tough battle for my kids and my rights as a father. Mr.burdick helped me overcome a PFA and won my case for me, I am now the custodial parent and he made it seem easy! Thanks again", "pics": null, "resp": null, "gmap_id": "0x8888ddddef2ece2b:0xd98de9e5bcebda54"}
{"user_id": "115404677011509229390", "name": "Darlene Grubbs", "time": 1578461792336, "rating": 5.0, "text": "Mr Burdick represented me in a divorce in 2018. He was compassionate, prepared, and provided excellent representation. I would highly recommend him. I would hire him again should another issue arise.", "pics": null, "resp": null, "gmap_id": "0x8888ddddef2ece2b:0xd98de9e5bcebda54"}
{"user_id": "112489248429991218723", "name": "Dalanna Hanson", "time": 1584194568928, "rating": 5.0, "text": "Rational, Intelligent and Compassionate are 3 words I would use to describe this attorney! *Highly Recommend!!", "pics": null, "resp": null, "gmap_id": "0x8888ddddef2ece2b:0xd98de9e5bcebda54"}
{"user_id": "104281008259039277967", "name": "Traci Watkins", "time": 1486402565515, "rating": 5.0, "text": "To Mr. Burdick:  Our family would like to thank you for being compassionate, caring and always available for us on our recent custody case.  It meant a lot to us when you said “I’ll pray for you”.  When faced with evil situations, including judges with blinders on and other attorneys that are clueless to the situation, we take great comfort in our Lord and Savior, Jesus Christ.\nPsalm 118:8\nIt is better to take refuge in the LORD than to trust in man.", "pics": null, "resp": null, "gmap_id": "0x8888ddddef2ece2b:0xd98de9e5bcebda54"}
{"user_id": "117949388232560811256", "name": "Kevin Serra", "time": 1525916468762, "rating": 1.0, "text": "good guy at first-  but Does not return emails timely, refuses to keep cyou in the loop. Excessive billing. bills too long for simple emails or letters Not effective. Horrible communicator. Does not listen. I would never hire him again.", "pics": null, "resp": {"time": 1525921258307, "text": "I am disappointed in your assessment. You seem to have forgotten that you asked me to review complex corporate/LLC documents and provide you with legal analysis of the same. The letters written for you required considerable analysis. The analysis and letters that you received were of excellent quality. As to the communication, you sent me an email that I was not able to respond to while in court. I did contact you once I was out of court. We discussed this and you seemed to understand. As a litigation attorney I cannot stop trials or hearings for the sake of emails. You received timely responses and never went even 24 hours without a response. Your prior emails to me praised the quality of my work. So your review comes as a shock to me. I wish you the very best of luck in the future."}, "gmap_id": "0x8888ddddef2ece2b:0xd98de9e5bcebda54"}
{"user_id": "103858852413619455769", "name": "Steven Kneussle", "time": 1497539552102, "rating": 5.0, "text": "Mr. Burdick is one of few attorneys who have stood up to advocate for equality in family court. He is a true Constitutional attorney who will fight for your case all the way up to the Supreme Court. He is only one of two attorneys in the entire State whom I would recommend. The rest are sleeze balls.", "pics": null, "resp": null, "gmap_id": "0x8888ddddef2ece2b:0xd98de9e5bcebda54"}
{"user_id": "107283981511008138767", "name": "Tony Butler", "time": 1532371765372, "rating": 5.0, "text": "Mr. Burdick represented our company in a frivolous lawsuit in which the judge dismissed with prejudice (meaning the individual could not bring further suit against our company.)  Although we waited until the last minute to contract an attorney, Mr. Burdick reviewed our documentation and represented us well in court.", "pics": null, "resp": null, "gmap_id": "0x8888ddddef2ece2b:0xd98de9e5bcebda54"}
{"user_id": "111764342454987168721", "name": "Jason Shafer", "time": 1521902980434, "rating": 4.0, "text": "Seems to be a good guy and very attentive", "pics": null, "resp": null, "gmap_id": "0x8888ddddef2ece2b:0xd98de9e5bcebda54"}
{"user_id": "116436670046535300943", "name": "William M", "time": 1456460601989, "rating": 1.0, "text": "A lawyer who cannot accept that all human beings are equal regardless of race, gender or sexual orientation should not be allowed to practice law.", "pics": null, "resp": null, "gmap_id": "0x8888ddddef2ece2b:0xd98de9e5bcebda54"}
{"user_id": "113035978513132895413", "name": "April Clifton", "time": 1596650504841, "rating": 5.0, "text": "My uncontested divorce was handled quickly and professionally at a very good price.", "pics": null, "resp": {"time": 1596672595113, "text": "Thank you so much for the kind review!"}, "gmap_id": "0x888603e2e688f51b:0x23f95f8b85e3b191"}
{"user_id": "110535149471193178401", "name": "Kindra Morris", "time": 1623328351297, "rating": 5.0, "text": "First visit I was very nervous going in. After sitting down with Russell he made me very comfortable. He laid everything out on the table for me and told me what he could do. He reassured me that I had a great possibility of getting a great outcome on my case. He also had a great sense of humor. I walked out feeling very relieved. I knew he was the right person to help me. The staff were always nice and responsive as well. My attorney did everything I asked for, answered all of my questions and more. I barely had to call in, I just sat back and let the work get done. My results….I did not have to go to court and my case is now closed. I had a pending felony charge that will now be expunged from my record! Look no further, I highly recommend Russell and his amazing staff to help you! Best wishes! Thanks Russell!!!", "pics": null, "resp": {"time": 1623346906478, "text": "Well, God Bless you for those sweet words, Kindra. The first half of your comments represents my favorite part of my job - providing hope and reassurance. We appreciate the opportunity to help you resolve your legal issues and are very pleased with the results. We are all wishing you the best moving forward. Again, thanks. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "100066907347606392276", "name": "Huntsville Shred Service", "time": 1575430852688, "rating": 5.0, "text": "Attorney Russell Crumbley was very easy to work with, I liked his knowledge, and sense of humor.  I had a lot at risk, he explained what he could do at our first meeting and it went like clock work.  I would certainly use and recommend him again. I must also mention his office staff, first class.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNv0ypd-RdwYgvYIKJCmSfLZX7x_2MB1EaTkGZ9=w150-h150-k-no-p"]}], "resp": {"time": 1556638502326, "text": "Thank you \"Big Shredder\"! And, thank you for noticing our help. We could not do what we do without them. And, yes, I think they are a great crew. We appreciate the opportunity to help folks just like you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102862716345224178195", "name": "Joe Dean", "time": 1613672423802, "rating": 5.0, "text": "From the first meeting onward Russell was professional, and straight forward. He laid out everything on how it would be handled and kept to his word. We had complete confidence in him and felt reassured along the way. It went exactly as he said and are extremely satisfied with the results.  The cost was worth every penny. If you want the best possible defense attorney look no further.", "pics": null, "resp": {"time": 1614783373411, "text": "Thanks Joe. Much appreciate the kind words. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114763522428853564897", "name": "Butch Roberts", "time": 1616539295602, "rating": 5.0, "text": "I really liked Michael Morella. He actually watched the video and told me not to plead guilty.  He did not charge me extra $ for it.. I did nothing wrong and he made me feel better about the whole situation.  I felt comfortable with him throughout the whole situation. I really don't trust lawyer's, but I trust him.", "pics": null, "resp": {"time": 1617381871444, "text": "Outstanding! Thanks. And, so you know: he didn't charge you extra because that was a part of our job. We simply did what we were supposed to do. I already passed this on to Mike. He smiled. God Bless! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111653090118119005103", "name": "marcus washington", "time": 1619560886725, "rating": 5.0, "text": "The lawyers were professional and well prepared. My case was small, they handled it like a major one. Highly recommended.", "pics": null, "resp": {"time": 1619719497260, "text": "Thank you Marcus! Your \"small\" case was probably big to you. That's how we try to handle them here because, while our attorneys may have been there thousands of times, many of our clients have never been through it. We are all thankful that you chose US to help you through this. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "112454722157584852975", "name": "Danny Wanny", "time": 1621649409436, "rating": 5.0, "text": "Russell Crumbley is an outstanding attorney. Upfront regarding cost. Highly recommend.", "pics": null, "resp": {"time": 1622129564492, "text": "Danny, I appreciate your thoughts and kind words. Hope things are well. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "106939112161124137464", "name": "Bellamy Gibbs", "time": 1616073262797, "rating": 5.0, "text": "From the very beginning Tyra the receptionist was very professional, sweet and understanding. Mr. Crumbley done an amazing job on getting my DUI and License dropped and renewed. They worked with me on payment plans. I highly recommend this law firm. You don't get judged, they help you with any issue or problem. You don't wait days on a response. You get the nothing but the truth and they are very serious about their cases and care about their clients.Ty all for everything you done for me.", "pics": null, "resp": {"time": 1617381707705, "text": "Well, we certainly appreciate your kind words and no, we don't judge. Our attitude, frankly, is that there is a \"judge\" for that. Our job is to represent you, the client. Thanks for noticing and I will pass on the praise to Tyra. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114554079115095767008", "name": "Ray Hurst", "time": 1616888913066, "rating": 5.0, "text": "Mr. Crumbly is very easy to work with. Well versed in the Huntsville legal system. Definitely someone you want on your side.", "pics": null, "resp": {"time": 1617382036378, "text": "Ray: I'm just a Huntsville boy. That makes it easy to be easy. It was a pleasure to work with you and I certainly appreciate your kind words. We all wish you nothing but the best moving forward. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110277441533126080165", "name": "Alan Richards", "time": 1617892342490, "rating": 5.0, "text": "Did a great job for me after a DUI....\nI have never had the need for a criminal defense lawyer – until I did!  I hired Mr. Russell Crumbley based on two recommendations from persons who work in the legal business.  Now, I am the one recommending Russ and his team at Crumbley-Blackwell & Associates to anyone reading this.  Just hours after my arrest, I was able to make an appointment before my first visit to the court.  Having never been in this situation before, this was very important to me.  Russ was with me every step of the way.  In the end, my case was dismissed thanks to this fine law firm.\nThere were many court appearances, so I was able to observe his interactions with other defense lawyers, prosecutors, and two judges.  It was obvious to me that he is well liked and, more importantly, well respected in the legal community.  It takes more than just navigating the legal system (which Russ did with ease), it also takes relationships.\nAgain, I highly recommend Mr. Crumbley and will never forget what he did for me.", "pics": null, "resp": {"time": 1617914270694, "text": "Thank you, so much, Alan for those kind words. It was a privilege to represent you and I am really glad it worked out for you. It was quite stressful for you but it is behind you now. Best wishes for you moving forward. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "106897533072813692894", "name": "Hunter Bright", "time": 1611109013163, "rating": 5.0, "text": "Micheal was very professional about his job. He made sure I knew what to do and when to do it. I had a 1st offense DUI case and he got it dismissed. I would recommend Russell Crumbley to anyone. A special thanks to Michael for helping me win my case.", "pics": null, "resp": {"time": 1612451153626, "text": "Thank you Hunter. I will pass along the kind words to Michael. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "107997308596256463257", "name": "Eric Marion", "time": 1614958899673, "rating": 5.0, "text": "I had a great experience dealing with and being represented by Mr. Crumbley.  My legal situation was handled professionally and I was able to have my situation get resolved with the best possible outcome.  I would strongly recommend this firm to anyone who is in need of legal representation.", "pics": null, "resp": {"time": 1615579510838, "text": "Thank you, Eric! We ALL appreciate your kind words. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "106898732574227796161", "name": "J. B.", "time": 1619715978948, "rating": 5.0, "text": "I would like to publicly thank Crumbley-Blackwell & Associates, specifically Michael Moranilla and Richard Crumbley. They are true professionals from start to end and made sure to include me in all discussions about my case. Excellent work everyone! Thank you all so much for everything. I will definitely be recommending and referring Crumbley-Blackwell to anyone in need of a kind and professional law firm. Once again, thank you for everything!\n\nJB", "pics": null, "resp": {"time": 1619719291485, "text": "Well, thank you very much for those very kind words! Our doors remain \"always open\" to our clients to be as involved as they need to be in their case. We are happy to know that you were pleased and satisfied in, not only the results, but also (and, just as importantly) the experience along the way. I will pass on the kind words to the others here and please know that we are ALL wishing you the very best moving forward. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105831430521633911850", "name": "Katina Coleman", "time": 1615341364650, "rating": 5.0, "text": "Even thought, they couldn't help me in my case, I received alot of good information, explained to me so I could understand it. Also so they where very professional, especially Tyra upfront, made us feel very welcome.", "pics": null, "resp": {"time": 1615579593494, "text": "Sorry we couldn't \"formally\" help you but it sounds like our staff took care of you anyway. I am glad to hear this and I will pass on the kind words. Thank you and good luck! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105393247228638069085", "name": "Rob Lyon", "time": 1606934811796, "rating": 5.0, "text": "Mrs. Amy Alexander was phenomenal in dealing with an ugly custody fight involving mental health issues. From the moment she took the case, problems vanished and we could finally see results. This lady is a complete professional, and a credit to her firm.\n\nI have custody of my kids, they're finally safe, and I owe this entirely to our attorney and her staff. I am grateful for their work on our behalf.", "pics": null, "resp": {"time": 1581428089479, "text": "Thank you Rob! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111317775072035747763", "name": "Christopher Fitzgibbon", "time": 1617334636907, "rating": 5.0, "text": "Chris F.\n\nI was arrested nearly 2 years after a bar fight for felony assault, had never been arrested before and both a family friend and the bail bondsman recommended Crumbley-Blackwell. I hired Mr. Crumbley as my lawyer and he did everything he could. They tried to get me to take a plea for a misdemeanor and 2 years probation and Mr. Crumbley easily could of just told me to take it, as he was already paid and could of dumped me off and move on, but he insisted we take it to trial because he thought wasn't right what was happening and i never should of been arrested or charged for defending myself when I was attacked. He believed we could win and so I went with his advice. In the end right before the trial he got all charges dismissed and even court fees waived and I just had to pay a small restitution fee. Hiring Mr. Crumbley was the best decision I could have made and am extremely thankful to him and his firm for everything. Hopefully I never have any use for him again but if I'm ever in a bad way again he'll definitely be my first call.", "pics": null, "resp": {"time": 1617382187908, "text": "Chris: I felt strongly about your case. I hated you had to go through what you did. It took guts on your part so kudos to you, sir. You stood strong. I just stood beside you. Be blessed! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103903528244662804209", "name": "Mary Windham", "time": 1610665658964, "rating": 1.0, "text": "About the same as Hodge. My brother recommended Crumblee. I have made three attempts. Each one has been the bums rush. Strike three, you're out.", "pics": null, "resp": {"time": 1610724269489, "text": "Bums rush? Three attempts? You really don't provide me with much to go on here but if you have a legal matter with which we can help ... that is what we do! If you need to speak with me please TEXT ME at 256-503-1185 and I will personally call you from my cell phone and help you decide if you have a case with which we can help you. Whatever your frustration, that is not our purpose here. I really don't know what else I can say ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109884756515514124925", "name": "Christopher Drouilhet", "time": 1598973915201, "rating": 5.0, "text": "Eleven months ago I found myself in a terrible situation I never thought I would be in. The charges against me were overwhelming to say the least. I retained the services of Crumbley-Blackwell and associates, and it was the best decision I could have made. When I was at my lowest they brought me hope, and provided me with a means to get all charges dismissed. If anything I was skeptical at the ease of the process, but that's just my nature. They definitely are top notch in my book. If you need a good defense attorney look no further. They delivered!", "pics": null, "resp": {"time": 1602011933131, "text": "While we appreciate your kind words we appreciate, even more, your confidence in us on the front end when you were deciding who to hire to represent you. We appreciate that confidence. We appreciate knowing that you are happy with our efforts. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "112028310010741024801", "name": "Cedric Marks", "time": 1606219632057, "rating": 1.0, "text": "Took my 200 fee and didn't even attempt to help. Pretty funny if all Lawyers charge a fee Mr Dutton from Lawrence county didn't charge me a dime not one red cent! So stop!!", "pics": null, "resp": {"time": 1606148628424, "text": "Our attorneys charge a consultation fee for cases involving family law and/or DHR. You were told in advance that your consultation would cost $200.00. You agreed and paid the fee. To maximize the value of that consultation, my staff gave you a list of items (in advance) to bring to the meeting for the attorney to evaluate for you. After meeting with you, our Sr Attorney advised you on how he could move forward on your behalf to accomplish your goals. He explained the fee structure and gave you the opportunity to retain us to move forward on your case. You chose not to hire us. That closed the matter. Please feel free to share Mr. Dutton's phone number here for those who, like yourself, would prefer a free consultation. I will not be offended by that at all. I wish you and Mr. Dutton nothing but the best. - Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114039286009170564583", "name": "Dan Flohr", "time": 1603807854203, "rating": 5.0, "text": "Sometimes life throws you a curve ball or you just flat out make a mistake.  Russell Crumley was able to show me there was a light at the end of the tunnel.  He used his experience and expertise to guide me through the complicated legal system.  Now my problem is solved and no longer an issue weighing heavily in my life.", "pics": null, "resp": {"time": 1604589137175, "text": "Thank you Dan! God Bless! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103055754604186752407", "name": "Caleb Campbell", "time": 1623815234494, "rating": 1.0, "text": "Very very dishonest don’t use!", "pics": null, "resp": {"time": 1623854619022, "text": "This is a very odd review. I notice (by clicking on your name) that you gave the EXACT same review on another law firm's site. We contacted them and, like us, they have never heard of you. Your name does not register in a name search for either of our offices. Since their name is VERY similar to ours, I am left to conclude that perhaps you called one of us, didn't like what you were told and weren't sure who to review. I literally have NO IDEA what this is about. In either event, I have been practicing law for 23 years. My partner has been practicing for 24. \"Dishonest\" is not a word I would EVER expect to be used to describe either one of us. We bend over backwards to take care of our clients. If you are actually a client, you should call me (or TEXT ME: 256-503-1185). In my experience fair, open and honest communication usually resolves misunderstandings. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103523752939750585881", "name": "George Whitmire", "time": 1596023448186, "rating": 5.0, "text": "Highly recommend Crumbley-Blackwell & Associates, P.C; completely in awe of the professionalism, responsiveness, quality and value that I received. Mike, Nicole and Mr. Blackwell are experts in their field and care about their clients and justice. First Class in all they do.", "pics": null, "resp": {"time": 1598880581977, "text": "Thank you George. We talk about what is needed around here often. Our attitudes are: We are professionals - BE professional. The rest will take care of itself. I really appreciate you praising the entire team. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109727442591205007124", "name": "Amber Nunley", "time": 1589410678634, "rating": 5.0, "text": "Nicole was absolutely, without a doubt,  one of the best decisions I could have made in my case. She got me exactly what I hoped for and it was the best possible outcome in my case. I can’t thank Nicole and this law firm enough for all their hard work!!", "pics": null, "resp": {"time": 1598880295307, "text": "Thank you Amber! I will certainly pass your comments on to Nicole. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "112341360060418524601", "name": "Lisa Miller", "time": 1582059990951, "rating": 5.0, "text": "As a native of Huntsville, I was familiar with Mr. Blackwell and his reputation as being a man of integrity and fighting hard for his clients. I found he and his staff to be very knowledgeable and compassionate.  They take a no-nonsense approach and are straight forward. I would highly recommend this firm for legal or domestic issues.", "pics": null, "resp": {"time": 1598879691057, "text": "Thank you Lisa! You are correct. Jon is very good at what he does and is highly thought of in this community. We appreciate your kind words. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105624286577909969550", "name": "Christopher Domskie", "time": 1598968690172, "rating": 5.0, "text": "Johnathan Blackwell is a great attorney. He is very dedicated passionate and knowledgeable about the law and helping on your situation", "pics": null, "resp": {"time": 1602011792388, "text": "Thank you Chris! We are quite fond of Jon ourselves. I will pass your kind words on to him. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "104186385138467433632", "name": "Julie Ertman", "time": 1580718338123, "rating": 5.0, "text": "Kyle Clark and Amy Bryant of Crumbley-Blackwell & Associates did a fantastic job to help me win my case. They were very professional and thorough from the very beginning until the very end of my case. They kept me informed on all matters and worked diligently throughout the whole process. They are the best! Thank you!", "pics": null, "resp": {"time": 1581428076074, "text": "Thank you for your comments. I have passed this on and they are very pleased that they met all you r expectations. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114986702029375134487", "name": "Alisha Fowler", "time": 1568043710240, "rating": 5.0, "text": "When you hire a lawyer the most important thing is trust, you must trust what they are telling & selling you! Jon told me from the day I walked in and before I paid what he was going to do. I remember how confident he was, and I was like…. Really??? I was so nervous! I called Chelsea all the time asking the same questions over and over, she was so patient & understanding though 😊 My cases were an A-2 DUI, Failure to properly yield, & No Insurance (which I had). We pled not guilty, the case was continued three times, and the fourth time we went to trial in district court. Not guilty all 3 counts!! So impressed! So the whole team is just wonderful to work with, I am so pleased with the friendly educated passionate service I received. Grateful", "pics": null, "resp": {"time": 1568049555431, "text": "Thank you SO MUCH, Alisha, for those kind words. We will certainly make sure everyone involved knows how you feel about them and how they made you feel. Sounds like EVERYONE did their job - the way it is supposed to be done. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "112468619035155765803", "name": "Mark", "time": 1562873030493, "rating": 5.0, "text": "Attorney Crumbley and one of his partners, Attorney Hess, helped me through a situation that could have affected every area of my life. They helped streamline the process and gave wonderful advice and insight. On top of it all, I feel I have two new friends. I highly recommend each of these men. The synergy in this firm is superb. They have the best of the best and work together to help their clients. Very thankful to have met them and worked with them.", "pics": null, "resp": {"time": 1568032994625, "text": "Mark: Thank you for that. This certainly was a \"tag team\" effort on all our parts. And, it did turn out very well. Hope things continue to work out that way for you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111503498398426133443", "name": "dancin fool", "time": 1577848413510, "rating": 5.0, "text": "Russ Crumbley and his team did a great job defending me! He spent plenty of time with me going over legal matters and helped set my mind at ease with his experience and knowledge of the law. He fought in my defense and got the case dismissed. Thank You!!!", "pics": null, "resp": {"time": 1581430797994, "text": "Thank you \"fool\". I guess you're really \"dancin\" now. LOL! Thanks for the opportunity you gave us to fight for you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111980433170111516148", "name": "Francisco Chavez", "time": 1582855137028, "rating": 5.0, "text": "Going here was the the best decision I made after my DUI. Not only were they there for me in my time of need, they even got my case dismissed. The whole staff was professional. I have been here for all my legal needs and will continue going in the future if need be.", "pics": null, "resp": {"time": 1598879851673, "text": "Francisco: ALWAYS here for you man! Thank you for letting US help you through this legal battle. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "100536755537518873135", "name": "David S", "time": 1585593113006, "rating": 5.0, "text": "I've utilized Mr. Crumbley's services on a couple occasions and he did not disappoint!  He was able to get my charges dismissed and now hopefully expunged, and far exceeded my expectations!  The office staff is very helpful, and hiring Mr. Crumbley will give you the peace of mind that you have the best representation available in northern AL!", "pics": null, "resp": {"time": 1598880245998, "text": "Thank you David for your kind words. Rest assured, we will continued to work hard for you if, and when, needed. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "107090998275280638550", "name": "Wesley Cantrell", "time": 1584979654858, "rating": 5.0, "text": "Mr. Crumbley was highly recommended to me by a friend and he did not disappoint.  The office staff was always helpful and polite.  Mr. Crumbley was able to get my case dismissed and got the best possible outcome for me.", "pics": null, "resp": {"time": 1598879981173, "text": "Wesley: Thank you! Thank you for you comment and thank you for trusting in us to handle your legal matter. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108143992796859544311", "name": "Steve Hallet", "time": 1572412493570, "rating": 5.0, "text": "When confronted by the long arm of the law, it is absolutely imperative you have someone in your corner you can count on. With Mr. Crumbley and his associates on your side, you can relax in even the most stressful of situations. He and his team will use their vast expertise and legal maneuvering to find you the best possible options given your circumstances. Extremely professional and understanding.", "pics": null, "resp": {"time": 1572623908701, "text": "Steve: We certainly appreciated the opportunity to work with you. As much as I enjoy solving legal problems, it may bring even more satisfaction when I know I have reduced the stress associated with these situations. I am extremely pleased that you feel like we delivered for you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109954877396229766791", "name": "JW Wryta", "time": 1591135699809, "rating": 5.0, "text": "I am a male 37 year old honor discharged protected veteran who holds a Masters Degree and has never had any issues with the law prior to my DUI in 2017.  While my charges were from 2017, I was not arrested until 2019 because I was sent to the hospital on the date of the offense instead of jail and diagnosed with Sudden Traumatic Shock exasperated by alcohol.  Being arrested was completely out of the norm for me.  I did not know where to begin, what to expect, and was consistently imagining the worst possible outcomes and scenarios.  Based off my charges, my bail agent highly recommended that I contact Mr. Crumbly for counsel.  I had an initial meeting with Mr. Crumbly within a week from the first time I contacted him.  The initial meeting did not take longer then an hour and during that time Mr. Crumbly was able to explain all my available options to include representation options, payment options, court expectations, and expected timelines.  Perhaps the most beneficial thing Mr. Crumbly discussed in the initial meeting was the overall stress of the situation.  He told me that it was human nature to imagine the worst possible outcomes and to not worry about that as it was him and his teams job to make sure those outcomes don’t happen.  He was absolutely right and ,during the entire course of my case, I constantly imagined the worst possible scenarios; however, I always made myself think back to that initial conversation with Mr. Crumbly and remembered that is why he is there.  After that initial meeting, Mr. Crumbly and his team handled everything for 6 months up until my court date with the Judge.  Before I even had to go before the Judge, Mr. Crumbly had secured a deal with the DA for me to enter the Pre-Trial Intervention Program (PTIP) and have charges dropped following the completion of the program.  I was more than happy to enter PTIP as it took all uncertainty and stress off the table and I was able to hold everything going forward in my own hands.  As of May 2020, I have successfully completed the PTIP program and am currently working with Mr. Crumbly on having my charges expunged.  I am very pleased with the services I have received from Mr. Crumbly and his team and would highly recommend them.  While I am not going to put personal information on here for obvious reasons, Mr. Crumbly has my full permission to give my number to prospective clients who would like a recommendation.", "pics": null, "resp": {"time": 1598880390721, "text": "JW: It was a pleasure to work with/for you. And, YOU sir, did a great job yourself. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "101081062130182874227", "name": "Ecstatic Diddy", "time": 1571800958930, "rating": 5.0, "text": "Russ Crumbley and his team did a great job defending my daughter!  He spent plenty of time with us going over legal matters and helped set our minds at ease with his experience and knowledge of the law.  He fought in defense of my daughter and got the case dismissed.  Thanks!!!!!!!!", "pics": null, "resp": {"time": 1571867681837, "text": "Thank you \"Diddy\". As a dad (and grandfather) myself, I understand the extra layer of stress that is added when matters involve your child. Thank you for trusting us to take care of what is, undoubtedly, that which is most important to you - family! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "115737704635699699620", "name": "Weston Smith", "time": 1574195850618, "rating": 5.0, "text": "Russ Crumbley represented me and through some lawyer magic got all my charges dropped.  I thought my life was ruined when I got a DUI and he got me off without community service.  He is an incredible lawyer and I highly recommend him to anyone wants a quick and efficient way to get your life back on track.", "pics": null, "resp": {"time": 1574708654090, "text": "Westin: You are too kind. Thank you for those kind words and I am most pleased that we were able to get this matter resolved for you as quickly as we did. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "113829132892636933168", "name": "Refer a Neighbor", "time": 1574713258547, "rating": 5.0, "text": "Mr. Crumbley made the whole experience smooth and easy. As scary as the situation was, he assured me to trust him and he would do the rest. He was able to have my charge dismissed..I will definitely recommend him..Thanks, William Scott", "pics": null, "resp": {"time": 1581430850483, "text": "Thanks neighbor. We really appreciate that you gave us the opportunity to serve you in your time of need. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111957113840165874947", "name": "Adnan Elkhaldy", "time": 1571153020193, "rating": 5.0, "text": "Russell Crumbleyl and his office provided excellent service, demonstrating professionalism and personal attention to all details of my problem. “I hired Mr. Russell to help out with my domestic violence problem because of something that wasn’t my fault. I was worried I should lose everything but Russel got us sorted out from the first meetings. Mr. Russell made us feel a lot better while he worked. I’d hire him again\nAdam", "pics": null, "resp": {"time": 1571867404125, "text": "Mr. Elkhady: It was an absolute pleasure assisting you in your legal matter. Thank you for choosing me to assist you. I hope everything goes smoothly for you as you move forward from this. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "107400676344064036948", "name": "John Clark", "time": 1560344510944, "rating": 5.0, "text": "After reading many of these reviews there is not much else to add. His service was better that I could have hoped for and the relationship is one of empathy and not judgement. They truly want to help you out whatever your situation. Do what he says, follow through and you too can see those wonderful words \"Dismissed\"", "pics": null, "resp": {"time": 1561641473973, "text": "John: That was a very gracious note. Thank you so much for that. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108564363418122658261", "name": "Cameron Loew", "time": 1553006276236, "rating": 5.0, "text": "I contacted Crumbley the day after I got released from jail for a DUI charge. I received a consultation from him and decided that he was my best bet. I was not mistaken. The best result came out of the case and I wouldn't recommend anyone else. Everything was handled and I was secure in good hands. My only qualm was that I wasn't given more time to weigh my options when I took a plea bargain. But that is just about my personal comfort because the best possible scenario occurred. Thank you!", "pics": null, "resp": {"time": 1555694036194, "text": "Cameron: Thank you for your honesty. You had a couple of hard choices to make and I can tell you, without question, you DID make the right choice. Thank you for letting us help you make those decisions. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "101078835591643491952", "name": "Bo Spragins", "time": 1564515311231, "rating": 5.0, "text": "Russell provided me unsolicited guidance and direction that was 100% spot on. He helped me because he knew what to do, wanted to help, and I think he just thought it was the right thing to do. He cared about my personal and families well being which is hard to find these days.\n\nPeople these days don't care about each other. Russell is a good man and lawyer and I appreciate he cared enough to step up as a man and say something.\n\nI recommend Russell Crumbley! Tell him your story. If he can help you he will, and FAST.", "pics": null, "resp": {"time": 1564600392569, "text": "Bo: Thank you for that! Sometimes, it is the simplest things that can make the biggest difference. Glad I was there to help. Glad you had the boldness to follow through and make it work. God Bless you and your family! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103623278570606273626", "name": "Scott", "time": 1582838407942, "rating": 5.0, "text": "I read many reviews on other law firms in the area before deciding on Mr. Crumbley to handle my legal matters. From the first visit until the case was dismissed, he and his staff were very polite, professional, caring and able to keep me informed throughout the entire process and provided all the guidance to secure the results I needed. I never had doubts of his knowledge of the legal system. I'm grateful to have such a good lawyer by my side and will most definitely return to Mr. Crumbley for any future legal needs.  Stop reading and call Crumbley!", "pics": null, "resp": {"time": 1598879777334, "text": "Wow! Thanks Scott. Really happy to hear that you are just as pleased with our staff as you are your attorneys and the results. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108360140141941602983", "name": "Greg Cole", "time": 1560336976782, "rating": 5.0, "text": "I liked how from my first consultation he was very straightforward and honest. No sugar coating he told me his plan and the long term goal and followed through exactly on his word. It was a very serious mistake I made and definitely put me in a position I will never get in again. Thanks to Russell and his team all charges were dismissed and I can put that worry behind me. I would definitely recommend this law firm to everyone I know.", "pics": null, "resp": {"time": 1561641583231, "text": "We appreciate those words, Greg, and we are very happy to have been able to get these results for you. An isolated \"mistake\" should never define a good person. Your's won't! Than you for choosing us! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "100301755535499115798", "name": "Richard Walker", "time": 1572375509621, "rating": 5.0, "text": "Very professional, precise, and dedicated to seeing all parties are satisfied.  and staff is very helpful as well. I will and would recommend them to anyone with any legal issue.", "pics": null, "resp": {"time": 1572623743556, "text": "Thank you, Richard, for the kind thoughts. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110783023668418023055", "name": "Joe Larson", "time": 1567778803131, "rating": 5.0, "text": "You can't go wrong here.  If you're in a DUI situation and don't know what to do, be confident that Russell and his firm will get you the best possible outcome.  His firm is always available and ready to guide you through the process of DUI dismissal.  Retain and sit back.  Give it some time and watch everything work out for the best.  Worry all you want but there's no need.  This is coming from someone with a DUI as a first offense and smear against an otherwise clean record.  I did not know what to do and worry was my only option at the time, but after meeting with Russell Crumbley, it was clear he would get me the results I was after.  Dismissal!", "pics": null, "resp": {"time": 1567805702902, "text": "While I appreciate the very kind words, you actually offer good advice here. When you hire a lawyer, know that it will take a minute. It is a process. Let your lawyer do the worrying and do his or her job. We appreciate your confidence. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114260931223415324032", "name": "Angela Carobene", "time": 1565629877550, "rating": 5.0, "text": "Mr. Crumbley is very professional and takes the time to answer all questions and has the ability to put you at ease. His knowledge and sense of humor are assets to his practice. His staff is very friendly. I would recommend him to anyone looking for an attorney.", "pics": null, "resp": {"time": 1566420706180, "text": "Thank you, Angela! I will pass on the kind words to my staff. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102965939881991180847", "name": "Terrial White", "time": 1604532221662, "rating": 1.0, "text": "Can't afford !!! $200.00 just to tell me that they was real, really to _ _ _ m HIGH", "pics": null, "resp": {"time": 1604589108137, "text": "I don't even know what to say to anyone who takes issue with the fact that we charge for our services. Best of luck to you! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102666891835687377340", "name": "Jane Doe", "time": 1574353535612, "rating": 5.0, "text": "Russell was completely professional and put me and my husband at ease.  He was able to get our domestic violence case dismissed with prejudice and now it is being expunged.  We would recommend to anyone.", "pics": null, "resp": {"time": 1574708596372, "text": "Thank you so much! We appreciated the opportunity to take care of you! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111342205787467498063", "name": "Aaron McCray", "time": 1566842046595, "rating": 5.0, "text": "Mr. Crumbley and his staff were utmost professional in a quick manner representing my interest with a legal case. The initial consultation explained the process and was represented well. I would recommend and hire his legal staff in the future!", "pics": null, "resp": {"time": 1567805557986, "text": "Thank you, Aaron. We appreciated the opportunity to handle your legal needs. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117564245435677995145", "name": "Jonathan Shewell", "time": 1557602584319, "rating": 5.0, "text": "I had 2 DUI charges against me in Huntsville, AL and hired Russell Crumbley to defend me on these in court. Thanks to his excellent defense team both charges were dismissed. I was greatly relieved and highly satisfied with his abilities as an attorney. I would recommend him to anyone in need of an attorney.", "pics": null, "resp": {"time": 1557867350640, "text": "Thank you Jonathan! It was a pleasure working with you. And, as always, we appreciate your recommendation. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108290936878454055498", "name": "nazarieh@aol.com nazarieh", "time": 1510288683380, "rating": 5.0, "text": "My husband and I have known Mr. crumbly as a personal friend for many years. In the past few years we have gotten to know him on a professional level, as well.  Mr. Crumbly assisted a few close friends. He was very thorough and personable. He was also available to answer all of their questions and he was successful in resolving their case. We would highly recommend Mr. Crumbly and his Law firm!", "pics": null, "resp": {"time": 1520519176801, "text": "Nothing like having great friends! And, you guys are great friends. I appreciate your kind words and I appreciate the opportunity to represent people who matter to you as well as the confidence you continue to show me and my firm."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110795611122238939274", "name": "Ethan C", "time": 1549037259237, "rating": 5.0, "text": "Mr. Crumbley was very enthusiastic to help me. He keeps it real with you on what the worst case scenarios are but gets the job done. He comes in with the facts and gets straight to the point. He definitely knows what he is doing and I would recommend to anyone.", "pics": null, "resp": {"time": 1555690108579, "text": "Thank you Ethan. Your lawyer's job when you hire one is to take control and focus on what matters. And, it is your lawyers job to know what matters. And, in addition to the facts, and the law, our clients matter. Thank you for your \"enthusiastic\" review. It was appreciated. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105467789044303671869", "name": "Vikki Franz", "time": 1582914718023, "rating": 5.0, "text": "Incredible experience! Mr. Crumbley is absolutely phenomenal at what he does! I was charged with making a false police report for trying to help a family member who had passed out on the floor and was not breathing, while I was on the phone with emergency services my family never had regained consciousness and woke up, when the EMT’s and police had arrived she was up and able to explain to them she was okay but the officer did not want to believe what we were saying and arrested me. The first day I went to see Mr. Crumbley I told him how worried I was and that I felt completely taken advantage of, he assured me that this was going to be beaten. He took the time to get the recording of the 911 call and the body cam of the officer and reviewed it all. He had his last visit with me before court and he showed me what he was going to present to the court and what he was going to say and when I left I felt very confident that this was going to be the win we needed. So we went to court and sure enough he got everything dropped and cleared. I highly recommend Mr. Crumbley . Very amazing and welcoming! Thanks you Mr. Crumbley for working so diligently on my case!", "pics": null, "resp": {"time": 1598879939482, "text": "Thank you Vikki for that amazing comment. We really just did our job. Really happy it worked out for you the way it did. Thank you for believing in us. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "106911410184869117808", "name": "D Stewart", "time": 1567553635461, "rating": 5.0, "text": "Good Job\n\nI would highly recommend Mr. Crumbley as an attorney.  He was able to get me through my case successfully.  He knows his stuff.", "pics": null, "resp": {"time": 1567805612273, "text": "You are kind. Thank you and wish you the best moving forward. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114556389167760874246", "name": "Richard Castillo", "time": 1563405378570, "rating": 1.0, "text": "ABSOLUTE WASTE OF 5,000 DOLLARS. MR CRUMBLEY SAYS IT'S 3,000 FOR AN ASSOCIATE TO REPRESENT AND 5,000 FOR HIM TO REPRESENT A CLIENT( TOTAL LIE , HE DID NOT SHOW UP AT MY COURT AN ASSOCIATE DID AFTER PAYING 5,000). ABSOLUTELY NOTHING WAS DONE TO HELP ME THAT THE JUDGE WOULDN'T DO FOR ME WITHOUT A LAWYER... DO NOT HIRE THIS FIRM YOU WILL REGRET IT", "pics": null, "resp": {"time": 1563471590182, "text": "Richard: we got your case dismissed with conditions after about two court appearances. You did designate me to try your case in front of a jury if it went to that. Fortunately for you, we were able to avoid that with minimal court time for you. Further, you specifically authorized my associates, in writing, to be with you in court on the court dates that they were there. It would have actually been difficult for us to have done a more effective and efficient job for you. You are welcome to schedule an appointment to come have another look at the paperwork you signed. If issues remain after that I will do everything I can to make you feel like you were treated fairly. ~Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117425560384147665302", "name": "John Mastoris", "time": 1551824565509, "rating": 5.0, "text": "I am very pleased with the professional courtesy and service I received from  this law firm.  I was kept well informed of the progress of my case, and received sage advice from the attorneys.  I am happy with the outcome they achieved for me and strongly recommend them.", "pics": null, "resp": {"time": 1555689937769, "text": "Thank you John. We enjoyed working with you. Thanks for that opportunity. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111996371078087582186", "name": "J Mac", "time": 1599747987123, "rating": 3.0, "text": "They can help help you.  Their staff is very friendly.", "pics": null, "resp": {"time": 1602011997109, "text": "Thank you for your kind words, J Mac. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "113668275720600982936", "name": "vincent mari", "time": 1529973439240, "rating": 5.0, "text": "I came to Mr. Wisda for help in regards to a custody case I was going through. It's a very trying experience and Mr. Wisda and his team were fantastic from beginning to end making me feel comfortable with everything and explaining thoroughly when I had questions, and I had a lot of questions. That being said, either Mr. Wisda or his assistant Amy were always available when I needed them which was incredibly helpful.\nI am incredibly grateful to Mr. Wisda and his staff for the resolution and outcome we achieved in the matter and will forever be indebted to Mr. Wisda and Amy.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108785837336988881649", "name": "Michael Hearst", "time": 1581359612193, "rating": 1.0, "text": "The staff is very rude and disrespectful. When asked about any information I was put on hold ,and when returned to call staff was extremely rude. Couldn't get the simplest of answers. Never got any return calls. Dont feel that they gave 100% of ability.", "pics": null, "resp": {"time": 1581428011384, "text": "I would simply invite ANYONE to call my office and see how you are treated. I am confidant that it will be courteous, competent and friendly. And, KNOW THIS: we appreciate your business! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "107571240726693434286", "name": "Matthew Mullins", "time": 1560810407145, "rating": 5.0, "text": "Mr. Crumbley is a professional in this business and highly experienced. He always strives and pushes for the best possible outcome which is something you want. Highly recommend.", "pics": null, "resp": {"time": 1561641437744, "text": "Thank you Matthew! We have a great support staff and team of lawyers here and we are very thankful that you gave US  the opportunity to serve you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "116031131112077643019", "name": "John Doe", "time": 1572278369363, "rating": 5.0, "text": "I got pulled over with a small amount of marijuana in rural Alabama. I was issued a citation for Possession of marijuana in the 2nd degree and not arrested. Attorney Crumbley and his team were able to get this citation dismissed within about 5 months, and I never even had to go to court. I simply had to pay court fees and attorney fees, which were well worth the outcome. Everything was handled in a timely manner, and my calls were always returned within 24 hours. The fact that I did not even have to go to court, or plead guilty, for a marijuana charge in rural Alabama is a miracle. Mr. Crumbley is a legal Wizard and is very professional.", "pics": null, "resp": {"time": 1572278733969, "text": "It was a pleasure working with you \"John Doe\". And, for others reading this, these cases obviously don't always go quite THIS well. It was a great outcome for us both. In either event, best luck to you moving forward as you work toward making your future great! I know you will. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117850612540911524935", "name": "Ruth Ridley", "time": 1572784607616, "rating": 5.0, "text": "Mr Crumbley did a wonderful job for me. The court appointed lawyer told me i didn't have a chance and that I should just plead guilty and try to get probation. Mr. Crumbley met me in court to ask to continue the case so to have time to prepare. The judge refused and we had to go to trial immediately. His cross examination of the arresting officer and plaintiff was brilliant. The judge's verdict was NOT GUILTY! I recommend Russell Crumbley because he's the best.", "pics": null, "resp": {"time": 1572886891690, "text": "Sometimes, EXPERIENCE is the only weapon you have. When backed into a corner you can't really have \"too much\" of that. Experience always matters but in a situation like yours it can truly make all the difference. I have been there 1000's of times. You haven't. I commend your courage and cool under those circumstances. Congratulations on your victory and thank you for giving me the chance to fight that fight for you. And, thank you very much for those kind words!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "118136172571615590513", "name": "John Everett", "time": 1568665719144, "rating": 5.0, "text": "I never write reviews online, but Mr. Crumbley, his associates and staff have gone above and beyond for my case. Being arrested is a nightmare, but having these folks in my corner made the whole process seem simple and worry-free. This speaks not only to their legal wherewithal -- but also to their willingness to listen and answer questions that might not matter in the long run, but are important to you and your own piece of mind. Right from the get-go, Mr. Crumbley moved aggressively to have my case thrown out, which was ultimately successful! I have no reservations fully recommending this firm to anyone up against a criminal charge. I got the best outcome possible. Thanks Russ!", "pics": null, "resp": {"time": 1570655103647, "text": "Well THANK YOU, John, for taking a moment to share your experience! It matters to us and it matters to others who are considering who to hire as their legal team. We appreciated the opportunity to help you with your most important issues. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102365533365975299553", "name": "CrimsonStorm1968", "time": 1531076836380, "rating": 5.0, "text": "If you need a really good criminal defense lawyer ,hire these guys . As with any lawyer it is not going to be cheap , but these guys got the job done for me with what I can honestly say was the best possible outcome and without having to go to trial. Mine was a case where I had to defend myself against an attacker where I got the better of the attacker, enough said there  . I am pleased with the job they did handling my case  and with the outcome  .Russell is a no nonsense guy and he tells it to you like it is be it good news or bad news .He does not sugar coat anything . If you are looking for a lawyer that will be on the up an up with you and look out for your best interest ,I would give my recommendation . He took care of my matter and I could not have asked for a better outcome …   Thanks guys !", "pics": null, "resp": {"time": 1529327238378, "text": "Thank you CS! We enjoyed the opportunity (and, thanks for that) to work with you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110803216469063896100", "name": "Kelley Denson", "time": 1486535632177, "rating": 5.0, "text": "I don't even know where to begin.  Russell is not only an attorney, he is a friend.  He takes his work very seriously, and has a huge heart that most attorneys just make you feel like a number and only care about your money, but he is not at all that way.  He really cares about his clients,and appreciates each and every one.  There is no one that I know that has the heart and knowledge of law that he does. He is genuine, kind, ambitious and most of all caring.  He is a family man with kids, and he knows how important it is that he takes care of you.  My words are only from my heart about this man.  You have to give him a chance to understand for yourself that what I say about him is nothing but honest and loyal.  But I do want and need to add something to my review about Russell..he is not only caring, ambitious, and knowledgeable, he is also very direct, will always be truthful to you and you need to be truthful with him.  He can not help you if you are not.  He is humble and kind...but he can not help if you will not open up to him, because how can he help you if you are not giving your all to him.  I recommend Russell to everyone that I run in to.  He has helped me in the past and God knows he has helped my son in the past.  My son would be in prison if it weren't for Russell.  But thank God my son has turned his life around.", "pics": null, "resp": {"time": 1489523876762, "text": "Thank you, Kelley. That was heart felt."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102172519892304368618", "name": "Dennis Brock", "time": 1471031501571, "rating": 5.0, "text": "I'd like to recommend Mr. Crumbley and his staff. They have worked with me for 3 years to resolve my case in a just and discreet manner. Even though it took longer than I expected their professionalism, diligence and caring attitude paid off to get my difficult case dismissed. They helped me with my concerns and spent several hours to answer all my questions and charged a fair price. I am very grateful for their service.\nDennis", "pics": null, "resp": {"time": 1489526235838, "text": "Thank you, Dennis. Your kind words are reassuring, even, to us. We are grateful for you as well."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "106546393724626297985", "name": "Albert Solberg", "time": 1551986973101, "rating": 5.0, "text": "Russell is amazing. He is very professional and hard working. He handled my case better than expected. He will be very straight forward about what the expectations are.", "pics": null, "resp": {"time": 1555690291454, "text": "Albert: God Bless you for those kind words. There was much gratification associated with getting things taken care of for you. It was obvious from the very beginning that it was very important to you and your family how things would turn out. Great resolutions are even more satisfying when it matters as much as it did. Thank you! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111430062774485148286", "name": "Drew Rose", "time": 1562881578369, "rating": 5.0, "text": "Mr. Russell Crumbley helped me on a serious case. I had a burglary and theft charge that would have led me to serious jail time. Not only did they reduce it all down to just theft of a lower degree they also kept me out of jail and only did probation. I am very pleased with how professional and reliable they are.", "pics": null, "resp": {"time": 1568032904993, "text": "Thank you Drew. We are very happy we were able to get this result for you. Hope things are well. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "116076671159022054708", "name": "Chris Young", "time": 1548294758366, "rating": 5.0, "text": "Mr. Crumbley was extremely professional and spoke clear and precise in what possible outcomes could be. I am extremely satisfied with the results from him and his team. I personally have never had the privilege of hiring an attorney until him and would trust him and his team in the future. Highly recommended!", "pics": null, "resp": {"time": 1555690535908, "text": "Thank you Chris! We are thankful for the opportunity to have helped you handle your situation. And we will ALWAYS endeavor to continue to earn your trust. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "116112112573223931917", "name": "Computer Lady", "time": 1565211528731, "rating": 5.0, "text": "Worked With Us All The Way\n\nAttorney Crumbley worked with us from the first consult all the way to the end of our case.  He was thorough as well as offering a personal touch.  I would highly recommend Attorney Crumbley.", "pics": null, "resp": {"time": 1566420078420, "text": "Thank you \"computer lady\". Nothing like being told you were nice on top of everything else. This would make my mother smile. Thank you! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109064773891093508091", "name": "Rebecca Pullen", "time": 1570637695867, "rating": 5.0, "text": "I called to make an inquiry. They were courteous and helpful on the phone. If I need their services in the future, I won't hesitate to call this firm.", "pics": null, "resp": {"time": 1570655187687, "text": "Thank you, Rebecca. I guess we couldn't help you at this time but it is great to know that our people are kind and courteous from the outset. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103490079885113467437", "name": "sheree Roden", "time": 1528938893606, "rating": 5.0, "text": "Thank you to Russell Crumbly and associates...! If you need fine representation and very educated lawyers, then Russell  Crumbly and associates are who you should call. I couldn't be more pleased with my outcome. Thanks once again to Micheal the lawyer Russell thoght was best for my case. I would say job well done!", "pics": null, "resp": {"time": 1529007786831, "text": "Sheree: We appreciate that you chose us to represent you. We, too, are pleased with the way things worked out for you and wish you the best moving forward."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103092720700724297427", "name": "Mike", "time": 1565215772719, "rating": 5.0, "text": "Mr. Crumbley was very enthusiastic and straight forward with me. He kept it real with me on what the worst-case scenarios were and what options I had. He literally stopped me from making a career ending choice.  He knows what he is doing. Mr. Crumbley was extremely professional and spoke clear and precise in what possible outcomes could be. I am extremely satisfied with the results from him and his team.  A shout out to the associate I dealt with Michael Morenilla. He was extremely professional and spoke clear and precise on what possible outcomes could be. I am extremely satisfied with the results from him. The office staff is top notch! They are polite, professional and always treat you with respect. I personally have never had the privilege of hiring an attorney until him and would trust him and his team in the future. They are a high-quality legal firm that is always professional and client-focused.", "pics": null, "resp": {"time": 1566420400382, "text": "Mike: I REALLY appreciate your acknowledgement of the important people that make up our team here. I have shared your appreciation of their efforts with them. It is important for them to know their efforts were both appreciated and valued. It is important to me that they did a good job for you. We wish you nothing but the best moving forward. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "100273756705627447536", "name": "sherry steele", "time": 1538586141645, "rating": 5.0, "text": "Mr. Crumbley restored my faith attorneys. Well maybe not all attorneys but he really treated me and my family like we were family.  He did excellent in representing us and won our case. This man is genuine and empathetic. I highly recommend him!", "pics": null, "resp": {"time": 1541012423728, "text": "Sherry: Your family mattered very much to me AND my team. It was an honor and a privilege to stand in the court room with you and give you the fight you so much deserved. I wish nothing but the best for you and your family moving forward. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114555436326154743391", "name": "Anon Ymous", "time": 1551388043412, "rating": 5.0, "text": "Mr. Crumbley always helped me with any questions I have had at anytime and was always readily available to provide his assistance in anyway necessary. He is kind, professional, and knows what he is doing. I highly recommend his professional help when/if the time arises.", "pics": null, "resp": {"time": 1555694105007, "text": "Those were very kind words and they are much appreciated! Wish you the best. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105280047219991312620", "name": "D M", "time": 1534363459970, "rating": 5.0, "text": "Mr. Crumbley and his legal team are some of the most professional and personal individuals I've ever had the pleasure of working with. Not only did they handle my case exceptionally (the best possible outcome for me was achieved) but they also made me feel safe and secure about my circumstances. They understand everyone makes mistakes, and they'll do everything they can to ensure you get a second chance. I honestly can't think of one bad thing to say about my experience with this firm!", "pics": null, "resp": {"time": 1541010818774, "text": "DM: Thank you! Your case mattered to us. YOU mattered to us. I am glad that you were able to see that to some degree. I have said it many times that solving legal problems is only PART of what we do here. Thank you for letting us do all we do for you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103375649268074761315", "name": "william pierce", "time": 1536887168730, "rating": 5.0, "text": "Mr. Blackwell (and his secretary!) were very helpful in getting my criminal case dropped.\nVery minimal contact, did what they assured me they would do.\nI HIGHLY recommend this firm, as it was HIGHLY recommended to me.", "pics": null, "resp": {"time": 1541011751492, "text": "William: Jon does great work. And, yes, he does what he says he will do. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "116685256068896938490", "name": "Teles Walker", "time": 1555528174558, "rating": 1.0, "text": "Attention when hiring an attorney make sure you get a Contract!!! just because you meet with a lawyer an he tells about a case he have beaten make sure you ask him about the cases he lost they will forget to mention those case.?Its a drought on good lawyers not cop out lawyers here in Hsv!!!! When your so call lawyer is bickering with you an he is a paid lawyer an he tells u that’s a good deal an supposedly working for you... get rid of him if you can but if you can’t afford another attorney  make sure u but the word out on him lawyers talk the talk to get your money but don’t walk it don’t be afraid to tell your lawyer how you feel an what’s real they have they picks an chooses!! all I’m saying make sure your lawyer is a stand up type of guy this lawyer firm ain’t Upper echelon as they appear from my experience.", "pics": null, "resp": {"time": 1555689431449, "text": "Teles: I am extremely disappointed but not at all surprised that you feel this way. And, no, we don't win every case. But, sometimes, winning has to be defined only after considering ALL the surrounding circumstances. Given the details of ALL we were working with in your matters, we got you an extraordinary result. I am sorry you are unable to recognize that. And, by the way, you did get a contract, you signed it and initialed it in all the places which directed this office how to proceed on your behalf. In either event, as always, I wish you nothing but the best moving forward.  ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "100696620345288904647", "name": "D W", "time": 1534967297272, "rating": 5.0, "text": "Very professional.  Took care of my case and arranged dismissal.  Micheal took time to explain all information and reassuring me through my case with good advise out eating options that resulted in best outcome for me.\n\nThank You,\n\nDebbie", "pics": null, "resp": {"time": 1541011114074, "text": "DW: Thank you for your feedback. We are pleased to know you were happy with our services to you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105097266447472004443", "name": "Arian Imaei", "time": 1565538608609, "rating": 5.0, "text": "Mr. Crumbley is absolutely the best criminal defense attorney in this area without a doubt and I would never hesitate to recommend him to any friends or family. Any time I ever think of THE BEST criminal defense representation in our area, I instinctively think of Russell Crumbley with no doubt. If you want to receive the best results, please go with Mr. Crumbley. He has gotten me 3 separate dismissals on cases that I was undoubtedly guilty on. His representation is worth the top dollar that you will be paying and just know that you truly do get what you pay for so definitely don’t think twice about him if you’re seeking the best result that you could possibly get in North Alabama. There is a reason why his billboards are so frequent around the area. How do you receive the best outcome in a criminal defense matter? Easy. Just hire the best.", "pics": null, "resp": {"time": 1566420621725, "text": "Wow, Arian! If I ever decide to toot my own horn I will just copy and paste this review. I am humbled. Thank you for letting us take care of you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114056241937881540325", "name": "Kyle Mystery", "time": 1528998775197, "rating": 5.0, "text": "Extremely professional and knowledgeable. Used him a few years back for a case i had that carried multiple charges(Domestic Violence, Disorderly conduct, public Intoxication and resisting arrest) and would have been very bad had Russel not been on my side. Results of that case was way better than I could have expected. Got a reckless driving ticket recently and I wouldn't have even considered using anyone else. I recommend him to everyone.", "pics": null, "resp": {"time": 1529007899437, "text": "Thank you, Kyle! There is probably no better compliment than the fact that you would hire me again. I appreciate that you did. I will give my best for you again."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103646039949591004792", "name": "JustOneAnonymoose", "time": 1488406951811, "rating": 5.0, "text": "I've used Russell twice in the courtroom and both times he fought for me and worked with me in ways far exceeding that which you would anticipate.  He and his partners go above and beyond to make it work.  Russell's a great guy with great work ethic that shows in and out of the courtroom.  Highly recommend making the easy choice here and letting him represent you.", "pics": null, "resp": {"time": 1489523072352, "text": "Sure wish I knew who you were. Perhaps you will call me and let me know. In either event, those were very kind words and I thank you for them. And, if you are going to use an anonymous name, at least yours is a cool one."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "107020111037941479514", "name": "misthe king", "time": 1574521871193, "rating": 1.0, "text": "Avoid like the plague. This law firm is about taking money and providing incompetent service.", "pics": null, "resp": {"time": 1574708274140, "text": "The legal advice we gave you was not only proper, it was necessary that we advised you as we did considering your legal situation because anything else would have constituted legal malpractice. While a client is not obligated to follow our advice, it IS necessary for us to give advice within the law and consistent with court oders. As far as your unpaid retainer balance, don't worry about it. We still wish you nothing but the best moving forward. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105021783760886312588", "name": "Jeff Slaten", "time": 1510197508000, "rating": 5.0, "text": "The staff here is phenomenal.  I have used this firm for a personal injury case and other legal matters for over a decade. If you need any legal services or advice please feel comfort in knowing this firm is here to help.", "pics": null, "resp": {"time": 1520519752829, "text": "Thanks, Jeff. You have been great and everyone here loves you. Hopefully, you won't ever ask me for frequent flyer miles. LOL!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110933880804343832478", "name": "Randy Bice", "time": 1548201971906, "rating": 5.0, "text": "Mr Crumbley did a wonderful job for me and my family. I would strongly recommend him to anyone looking for a good lawyer.  I will use him again if need in the future", "pics": null, "resp": {"time": 1555694183813, "text": "Randy: Thank you! I am glad things turned out the way they did. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "100001489763440455594", "name": "Anthony Hamlet", "time": 1487436773259, "rating": 5.0, "text": "Would like to say Russell is a very good attorney he has help me many of times over the years. He is the type of attorney that will fight for you till the end not only that he is fair. Russell will work with you anyway he can he is honest at everything he does so if anyone needs a good attorney I highly recommend Russell. Thanks Russ for everything you have done for me", "pics": null, "resp": {"time": 1489523243794, "text": "Thank you, Anthony. You have always been a pleasure to serve. You are very kind and considerate ... online AND in real life!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102579146077324859420", "name": "Jessa Harris", "time": 1553654712535, "rating": 5.0, "text": "Long and challenging process but a satisfied outcome thanks to this team. Appreciate all the hard work. JH", "pics": null, "resp": {"time": 1555690443469, "text": "Jessa: Thanks for choosing us and, yes, I tell people all the time that it is a process and you need to hang in there. No one knows though until they have been through it. Your outcome depended on your strength as much as it did ours. Thank you for your comments. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "112657718156076932005", "name": "Hondamilo@gmail.com phillip", "time": 1528852310893, "rating": 5.0, "text": "The firm assisted me with 2 traffic tickets I got in Madison County. It may not seem like a big deal, but I have not had a ticket in well over 5 years and I did not want the points on my license. Mr. Blackwell was able to get both tickets dismissed! Court started at 9:00 am and I was out by 9:30.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117795247924031198201", "name": "M T", "time": 1533088623227, "rating": 5.0, "text": "I highly recommend hiring Russell Crumbley. He helped to get my DUI charge and a violation charge dismissed.  And, my drivers license was not suspended. His office helps with that too. His services are reasonably priced as well. He and his office team are very professional and work efficiently and effectively and communicate with you along every step of the way. They make the process comfortable and seamless. I was very pleased that I chose Russell Crumbley as my defense attorney!", "pics": null, "resp": {"time": 1541008603592, "text": "Thank you, MT, for those kind words and your \"virtual\" referral. Hope things are much better now. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111804762259424765362", "name": "Victoria Jeffries", "time": 1467997082559, "rating": 5.0, "text": "I must say that the Crumbley Law Firm, P.C. is fabulous and in my opinion they are the best in town! Mr. Crumbley is very thorough and intelligent and most of all he does not talk or look down upon anyone for anything. His staff is very nice and knowledgeable and they all are willing to help out in the best way they can. I highly recommend this Law firm!!", "pics": null, "resp": {"time": 1489520685238, "text": "Thank you, Victoria, for those very kind words. You are very gracious."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110855024109985701550", "name": "matt hall", "time": 1527096417165, "rating": 5.0, "text": "I would like to recommend Mr.Russell Crumbley to all for all types of Legal Representation. He did a wonderful job for a Family Member. He came Highly recommended and I would do the same to anyone", "pics": null, "resp": {"time": 1529007063782, "text": "Thank you, Matt!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117266550208073248588", "name": "Stacey Newlander", "time": 1549924927160, "rating": 5.0, "text": "I hired Mr. Crumbley as my attorney for a traffic offense. I was concerned about the outcome as I did have priors on my record that could, without doubt, prove unfavorable for me. I was truly surprised at the actual outcome of my case and was very pleased! Thank you, Mr. Crumbley!", "pics": null, "resp": {"time": 1555694252079, "text": "Stacey: We will ALWAYS try our best no matter what. Things did work out well for you and we couldn't be happier. Thank you for your kind words. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111718594347750736837", "name": "Preston Taylor", "time": 1537472617774, "rating": 5.0, "text": "OUTSTANDING! Mr.Crumbley is by far the best attorney that Huntsville has to offer. I would highly recommend him, and will be hiring him for any future needs. He is very nice, and easy to talk to. Something not every attorney has, but Mr.Crumbley knows his stuff, and is extremely knowledgeable with various laws and regulations. Overall just a great guy, and attorney!", "pics": null, "resp": {"time": 1541012109404, "text": "Thank you, Preston! That was quite awesome! You probably have made me sound better than I am but I will have to find a way to live with that. But, I WILL say that I am quite easy to talk to …. That is one of the better parts of life. A little small talk makes EVERYONE feel better … ME included. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117667437375334000636", "name": "Elizabeth Williams", "time": 1557849609973, "rating": 5.0, "text": "I was arrested for a DUI 2 weeks before I moved out of state about a year and a half ago. The experience was terrifying and Crumbley assured me that I could move forward with my move and he would take care of things here in Alabama. My court case was continued for quite a while, a strategy that was used to wait for the right opportunity to get my case dismissed. After a year of patience and taking a quick 2 day DUI awareness class, my DUI was dismissed to court costs and I am now in the process of filing for an expundgement. Everyone at this office has a wonderful professional attitude and are very gracious with any help they can provide. I have no desire to be in a position to need Mr. Crumbley's help again but to anyone out there needing help, he's 100% worth the price!", "pics": null, "resp": {"time": 1561641659371, "text": "Thank you Elizabeth. We were honored to be chosen to help get you back on the path you desired. Wish you nothing but the best moving forward. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109887107714376880537", "name": "Sandra Hopper", "time": 1483725642057, "rating": 5.0, "text": "I have used Mr.Crumbley on several occasions to represent my husband. Upon our first meeting I was kind of taken back because he would stop me in mid sentence and ask a question. I thought man he is not listening,but he was already processing the case. He has a special swagger that works magic in the court room. He is  smart and confident and the court room is his home away from home. He walks in gives you a beaming smile and goes to work. I highly recommend his services. Super excited about his new partners as well that's a lot of experience in one building.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "107932078767390069454", "name": "Brian Hodges", "time": 1556829711710, "rating": 5.0, "text": "I want to tell you that Crumbley-Blackwell is the #1 law firm in the entire Huntsville/Madison and surrounding areas. Mr. Crumbley is very thorough, professional and you can not beat his long years of experience in the field, plus he can make you laugh when your not up to laughing. To add, his staff(Misty), is patient and follows through on all requests. I can not recommend this office enough. They helped me through a very difficult case and I can never thank them enough. If you need help, then call Crumbley, it can save and preserve peace in your life because he is a man of law and fights for his clients and he will always present you with the best option so trust him! Call them!", "pics": null, "resp": {"time": 1557265468787, "text": "Thank you, Brian for those amazing words. You have actually encouraged me, through that testimony, to try even harder for people like you. I hope everything continues to go well. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105779521670749188196", "name": "Nikesha Baxter", "time": 1487301703382, "rating": 5.0, "text": "The Crumbled Law Firm is Simply The Best.  They didn't just represented me in one but Three cases. Everyone in the office was very  kind very attentive to me and always listen to my concerns and helped me understand the law.  So I would recommend anyone that's in a nasty Custody case, DUI, Criminal Please check Russell and His Amazing Team Out", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "113813689173329902974", "name": "Chase Brown", "time": 1510074300975, "rating": 5.0, "text": "I am very pleased with the outcome. They stayed in contact during the whole ordeal, and provided answers as well as reassurance when needed. I highly recommend these guys", "pics": null, "resp": {"time": 1520523031091, "text": "Thank you, Chase. We are always here to provide support, as necessary, for our clients. By taking advantage of that opportunity, you were able to maintain a comfort level and peace of mind throughout the process. We are all happy with how this worked out for you."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105399239585009201995", "name": "John Montero", "time": 1486253133388, "rating": 5.0, "text": "Russell helped me out of a really impossible situation that turned my life around.  He was more than my attorney. He was a mentor. After my case was over I went on to earn a Bachelor of Science and an MBA. I can truly say that if It was not for Russell Crumbly my life would have taken a much different path!!", "pics": null, "resp": {"time": 1489519457279, "text": "Those are generous and kind words, John. Thank you! You are one of the \"success stories\" that makes us all grateful for the experience."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109529049120180164664", "name": "Jake Black", "time": 1515606711600, "rating": 5.0, "text": "I highly recommend Mr. Russell Crumbley to handle your DUI issues. I was faced with losing my government security clearance and he worked with me for more than a year, and was very, very helpful. His price was very reasonable, and he took care and concern in getting my clearance and all legal issues taken care of. I don't really like to write recommendations because I feel like I paid for the service, so what else do I owe you? But, in this case, Mr. Crumbley went beyond the call of duty to help me and I am deeply appreciative.", "pics": null, "resp": {"time": 1520533009105, "text": "Thank you, Jake. You have done A LOT of things right in your life. In fact, we could use more men like you. But, even good men run into a wall from time to time. I was VERY HAPPY we were able win your hearing and keep your security clearance but, rest assured, all I did was bring to light all the many positive qualities you had already made a part of who and what you are. Thanks for trusting us to do that for you."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102561112514577844953", "name": "Stephan Cathcart", "time": 1537472810156, "rating": 5.0, "text": "Mr.Crumbley was able to take my stressful situation and turn it to ease! He’s a great attorney! I will be recommending him to everyone I know, because he’s so ethical, and easy going but stern in the court room. Very smart, and great prices! You can’t find this quality of service for these prices anywhere else!!! Thank you Mr.Crumbley for everything!", "pics": null, "resp": {"time": 1541012267942, "text": "I am very glad we could help ease the stress - IN ADDITION to handling the legal problem. Easing the tension has become as rewarding as winning. There is a lot to be said for just helping someone \"catch their breath\". Anyway, I really appreciate your kind words. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102520607214365277223", "name": "Tabitha Kontur (R and F Consultant)", "time": 1504206479047, "rating": 5.0, "text": "We hired Russell to take care of a legal matter for our son and he was amazing! He did exactly what he said he was going to do and I highly recommend him and his team should you need legal counsel.", "pics": null, "resp": {"time": 1520524574989, "text": "Thank you, Tabitha! I hope things are going well for you all."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111926808023466526434", "name": "Sheryl Bridges", "time": 1522505894811, "rating": 5.0, "text": "Mr. Crumbley is an outstanding attorney. He handled my case very professionally and confidently. I could not ask for a better outcome for my case. I would recommend him to family and friends. Worth every penny! Thank you Mr. Crumbley.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108778722651346471573", "name": "elizabeth seymour", "time": 1489158799677, "rating": 5.0, "text": "Russell Crumbly is a fantastic lawyer. I was being charged with a DUI and a friend of mine recommended Russell Crumbly, and it was the best decision I could have made. I was so embarrassed and ashamed of myself, I was also a nervous wreck. Russell Crumbly reassured me that he would take good care of me and because of him I'm being given a second chance. Russell Crumbly gets the job done! I highly recommend!!", "pics": null, "resp": {"time": 1520532025697, "text": "Thank you, very much, Liz! You did a great job hanging in there!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110555168063114440758", "name": "Ruth Beardsley", "time": 1541006001301, "rating": 5.0, "text": "My experience with the Crumbley Law Firm was incredible. Mr Crumbley demonstrated exceptional professionalism and extensive knowledge of the law pertaining to my case throughout the entire process. His team of experts worked diligently to ensure true justice was served. I would like to extent special thanks for the work by Josh, Mike, and Nicole. I HIGHLY recommend this Team for any and all of your Law Related situations. My case was dismissed with prejudice, to be followed with the removal of this unfortunate blemish from my record. Thank you for a job well done.", "pics": null, "resp": {"time": 1541012998858, "text": "WB: This is what we shoot for with every client. Thank you, so much, for including the individuals who help make up our team. I will share this with them because it means as much to us as it does to you. So, again, THANK YOU and please accept our best wishes for your future. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103240129008639211259", "name": "Anthony Parise", "time": 1473948507336, "rating": 5.0, "text": "Called around to a few other places and got the run around. I received a letter in the mail from the Crumbley Law Firm and the letter looked very professional. I decided to give them a call (a week before my arraignment) and they worked with me. Very polite and actually let me do some talking and ask as many questions as needed. Highly recommended and most likely the best in the area. -Tony Parise", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "115768264436166501447", "name": "Jennifer Tabares", "time": 1462544754023, "rating": 5.0, "text": "Absolutely amazing!! Very informative and always working around the clock!  I highly Recommend Russell, hopefully I will not need his services in the future but if I do, then I will definitely go with him again!", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "107788908832134080924", "name": "Kyle Pickett", "time": 1560879103245, "rating": 5.0, "text": "Mr. Crumbley took and his team addressed my concerns with care and got the best results available to me. Thanks again!", "pics": null, "resp": {"time": 1561641355732, "text": "Thank YOU Kyle! Hope you have a great and safe summer! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108442703236670193212", "name": "James Chaney", "time": 1504320801443, "rating": 5.0, "text": "A rock and roll team of Lawyers!  Having these guys on my side is the best defence I can think of.  Expertise in DUI, Elder law, and Criminal Defence means I'll never have to look elsewhere for my legal needs.", "pics": null, "resp": {"time": 1520524500841, "text": "Rock and Roll Lawyers? LOL! That's awesome! Thanks. I will have to share this one with my wife (every time we go to Rock and Roll Sushi)."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108442703236670193212", "name": "James Chaney", "time": 1504320801443, "rating": 5.0, "text": "A rock and roll team of Lawyers!  Having these guys on my side is the best defence I can think of.  Expertise in DUI, Elder law, and Criminal Defence means I'll never have to look elsewhere for my legal needs.", "pics": null, "resp": {"time": 1520524500841, "text": "Rock and Roll Lawyers? LOL! That's awesome! Thanks. I will have to share this one with my wife (every time we go to Rock and Roll Sushi)."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117870035143521330847", "name": "Brookelyn", "time": 1461123020880, "rating": 5.0, "text": "After meeting with eight different lawyer's looking and praying for the one who made me feel the most confident in beating not only ONE but TWO DUI. I finally got a consultation with Mr.Crumbley for a meeting and after literally five minutes I knew he was the one to hire. Russell Crumbley did not only save me from losing my license for not taking the BAC. Moral of my review I got both of my DUI thrown out, kept my licenses, and now I am moving on with my future. Thank you so much Mr. Crumbley for saving my future!!", "pics": null, "resp": {"time": 1489526579218, "text": "Thank YOU, Brooke, for choosing me as your attorney. It was a pleasure working for you. Thanks for that opportunity."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "107705060147221531840", "name": "Charlie Barnes", "time": 1510690825278, "rating": 5.0, "text": "Mr. Crumbley and his team do an excellent job. I was very pleased how they handled my case. He was very responsive to  my text and questions.  I  highly recommend this Law Firm.", "pics": null, "resp": {"time": 1520518957196, "text": "Thank you VERY MUCH, Charlie. I have noticed over the years that people sometimes get frustrated with the process but they NEVER ask questions about it. If folks don't ask questions, their lawyers don't know they have them. You did a great job of remaining informed. You certainly played a part in your high satisfaction level. Nice job!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103231526390782532417", "name": "Adam Hyder", "time": 1556637674147, "rating": 5.0, "text": "When I found myself stressed out about and facing serious legal issues from  a particular incident for which I truly had ZERO involvement...I heard a friend talking about The Crumbley Law Firm... I heard him talking about how his case had been dismissed and he was even given back restitution for his troubles...  i figured that I should Atleast have a consult with him.... 2 years later....  all worries are a long , long , time ago and we are moving forward with a clear , stress free , More than satisfied!   I can’t thank them enough for all the hard work, research, phone calls, for my case!  Thank you again CRUMBLEY LAW FIRM!   If you are reading this review ... you probably should have called him like, yesterday!! You will be glad that you did!", "pics": null, "resp": {"time": 1556638630562, "text": "Much too kind, friend! I appreciate the opportunity to work with you and all others who give us such an opportunity. We celebrate with you as you move forward. God Bless! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "106895714476925360112", "name": "Daniel Harry", "time": 1552879183827, "rating": 5.0, "text": "Mr Crumbley AKA MR COMMUNICATION was the best man for the job. He and his team saved my future. What started out as a felony ended with a dismissal. Thank you again Mr Crumbley. NVDO", "pics": null, "resp": {"time": 1555694363529, "text": "Daniel: LOL! Mr. Communication? Wow! Not sure I qualify for that but I will sure take it. Thank you very much for those \"high marks\" and I am really glad things went the way they did for you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103363782959271406160", "name": "Ahmad Ghalaiyni", "time": 1585151692632, "rating": 1.0, "text": "They mentioned free consultation on website , when you go there or ask for appointment, they ask for $200 ( consultation fee !! )", "pics": null, "resp": {"time": 1598880127277, "text": "Yes, we DO mention free consultations on our website. We ALSO mention consultation fees. It all depends on what type matter you have. I am sorry we were not able to be a good fit for you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "113292523741221647780", "name": "Greg Kaltz", "time": 1550802667465, "rating": 5.0, "text": "TO WHOM IT MAY CONCERN-\n\nIn March of 2014 I was charged with a DUI in Madison County, Alabama. This led to several serious concerns I had as to what negative impacts this DUI might have regarding maintaining my current place of employment, a valid Alabama Driver’s License, and the potential for increased auto insurance rates. In addition, I was uninformed of all the specific issues pertaining to Alabama State Law as they apply to a DUI charge especially, with respect to possible fines, imprisonment, unknown future adverse impacts, or establishment of an unfavorable permanent criminal history. The level of stress in my daily life was extremely high, to say the least, due to this situation and these concerns.\n\nI was referred to the Law Office(s) of Russell W. Crumbley to try and sort all these issues out. Russell put me immediately at ease and clarified for me, in a no-nonsense way, what needed to be done to effectively address the DUI charge against me. He also kept me informed as to the current status of my case as it made its way through the Alabama judicial process and provided reassuring personal representation at any and all court scheduled hearings or appointments. I would HIGHLY RECOMMEND retaining Russell as your DUI Attorney should you ever find yourself in a similar situation. He is a completely knowledgeable and competent attorney in the area of Alabama DUI Criminal Law and you can rest assured that he will obtain the best possible outcome regarding your case.\n\nSincerely Yours-\n\nGreg Kaltz\n\nP.S. – Due to Russell’s expertise, he obtained a DISMISSAL of the DUI charges against me! He is also handling a follow-on expungement action for me that will clear my Alabama arrest record for DUI.", "pics": null, "resp": {"time": 1555694949537, "text": "Greg: It was a pleasure. Thank you! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "101435250670398002136", "name": "Brock Grayson", "time": 1557264097957, "rating": 5.0, "text": "Mr. Russell Crumbley took good care of my DUI case and was an expert in all things considered. He took the stress out of my hands and life and handled everything in a professional manner. On a Sunday, he was the only office that took my phone call, I had to be at court the next day after my arrest at 8 AM. Every office was closed, including Crumbley's. However, on his website there was a chat option in which he took my request and talked to me personally. On that very Sunday he met with me within an hour. He was on his way back from Tuscaloosa and still met with me! I've never been so stressed, but after meeting with Mr. Crumbley, he assured me I would be taken care of. The results: My case was nolle prossed: thrown out. All I had to do was sit back, and relax while Russ took care of the rest. If you want positive results, do yourself and stress level a favor and call his office and have him represent you. You will not regret it.", "pics": null, "resp": {"time": 1557331507325, "text": "Thank you, Brock, not only for those kind words but also for letting us handle your case. We consider it an honor and a privilege to work with every client that gives US that opportunity. There are options in this town. We tend to appreciate those people who choose us. Again, THANK YOU! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110566516761719178249", "name": "Refinnej", "time": 1541421656073, "rating": 5.0, "text": "Mr. Crumbley has been extremely helpful a couple times for me.  His office has been helpful and detail oriented to ensure that we knew everything that was going on and kept me up to date every step of the way.  They were always friendly and accommodating.  Even while not representing me, he was able to give me some great advice about my father's will and estate after my father had passed away.  He took the time out of his busy day to tell me what I needed to do and who it would be that I needed to find and contact once it went to probate.  This is not his area of expertise, he was just helping me know where to start.  He explained to me the process.   Since it was a large city that my father lived in, it was a while before the estate went to probate and I assumed I had been written out due to my father's controlling sister so I didn't bother looking into it until 2 years later when I was found by a life insurance company and received a letter explaining that I was the beneficiary of a policy.  I then took Mr. Crumbley's advice by finding the attorney through the probate court and found that I had many savings bonds, which the sister told me had been spent 10 years prior.  The executrix allegedly told the attorney that she tried to contact me, but she did not  Thanks to these cushions I have been able to go back to school.\n\nI want to add, if anyone is in legal trouble, please seek counsel.  The DA will lie straight to your face.  The DA will threaten you with the highest jail terms to get you to plead guilty so they don't have to take it to trial.  Their in house legal assistants that are there to help guide defendants will tell you that if you don't take the plea \"deal\" that you wont win.  They are only there to help the DA, not you.  It's very difficult, especially when it's your word against law enforcement officers, many who have no problem lying in court and they're buddies with the judge.  You need someone who knows the law and knows how the courts work.  It wont be free, but it's worth it to not have to go to jail and/or have a record haunting you.  For more serious crimes, you may get a public defender, but your life is on the line with someone who may not care about you or what happens to you.  It's a dangerous risk to take and once you are convicted, it's harder to find people to listen to you.", "pics": null, "resp": {"time": 1541428090094, "text": "How kind of you. Thank you. What a mountain of burden you had going on in your life. Thanks for letting us help you navigate through it. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "106330632589751065518", "name": "Bobby Caldwell", "time": 1551287204706, "rating": 5.0, "text": "I hired Mr. Crumbley to help out with a pretty scary issue where I had made incredibly dumb mistakes from lack of judgment and maturity. I was worried I would lose everything, my family and my future (and I almost did) but Crumbley got me sorted out, reassured and sealed after just a couple of meetings. I wish he had been a bit cheaper and that this all never happened, but Mr. Crumbley made me feel a whole lot better while he worked. I’d hire him again, 100 percent.", "pics": null, "resp": {"time": 1555694864432, "text": "LOL! Everyone wishes lawyers were cheaper. Even lawyers when they are on the hiring end and we are ALL on that end from time to time. And, even \"mature\" people make mistakes so don't kick yourself. Things turned out great for you so learn from it. And, THANK YOU for your comments. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "104132695407415216503", "name": "mike thornton", "time": 1597357309806, "rating": 4.0, "text": "Best attorneys in huntsville", "pics": null, "resp": {"time": 1598880645803, "text": "LOL! If we were the \"Best in America\" could we get 5 stars? Seriously, what a great compliment! THANK YOU! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "104279461972614331822", "name": "Miguel Martinez", "time": 1547582448387, "rating": 5.0, "text": "Mr. Crumbley was recommended to me by a friend. I'm very happy I listened. Mr. Crumbley was very professional and walked me through the process step by step and made me feel at ease about the whole process. If you are in doubt about a lawyer, do yourself a favor and give Mr. Crumbley a call. You won't be disappointed. I wasn't!", "pics": null, "resp": {"time": 1555695108083, "text": "That was really nice, Miguel. Thank you (and your friend). ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110566516761719178249", "name": "Refinnej", "time": 1541421656073, "rating": 5.0, "text": "Mr. Crumbley has been extremely helpful a couple times for me.  His office has been helpful and detail oriented to ensure that we knew everything that was going on and kept me up to date every step of the way.  They were always friendly and accommodating.  Even while not representing me, he was able to give me some great advice about my father's will and estate after my father had passed away.  He took the time out of his busy day to tell me what I needed to do and who it would be that I needed to find and contact once it went to probate.  This is not his area of expertise, he was just helping me know where to start.  He explained to me the process.   Since it was a large city that my father lived in, it was a while before the estate went to probate and I assumed I had been written out due to my father's controlling sister so I didn't bother looking into it until 2 years later when I was found by a life insurance company and received a letter explaining that I was the beneficiary of a policy.  I then took Mr. Crumbley's advice by finding the attorney through the probate court and found that I had many savings bonds, which the sister told me had been spent 10 years prior.  The executrix allegedly told the attorney that she tried to contact me, but she did not  Thanks to these cushions I have been able to go back to school.\n\nI want to add, if anyone is in legal trouble, please seek counsel.  The DA will lie straight to your face.  The DA will threaten you with the highest jail terms to get you to plead guilty so they don't have to take it to trial.  Their in house legal assistants that are there to help guide defendants will tell you that if you don't take the plea \"deal\" that you wont win.  They are only there to help the DA, not you.  It's very difficult, especially when it's your word against law enforcement officers, many who have no problem lying in court and they're buddies with the judge.  You need someone who knows the law and knows how the courts work.  It wont be free, but it's worth it to not have to go to jail and/or have a record haunting you.  For more serious crimes, you may get a public defender, but your life is on the line with someone who may not care about you or what happens to you.  It's a dangerous risk to take and once you are convicted, it's harder to find people to listen to you.", "pics": null, "resp": {"time": 1541428090094, "text": "How kind of you. Thank you. What a mountain of burden you had going on in your life. Thanks for letting us help you navigate through it. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "113999791360732906945", "name": "Sara Traylor", "time": 1551123188253, "rating": 1.0, "text": "My husband went for a consultation about some legal issues and the lawyer he spoke with would not listen and just dismissed him without knowing all the information. I would NEVER recommend this firm to anybody.", "pics": null, "resp": {"time": 1551187808579, "text": "Sara: I am sorry you and/or your husband do not feel like he got heard the way he  should have been heard. I take it from your comment that you were not at the consultation. In either event, I would invite you and/or your husband to reach out to me via email (russ@crumbleylaw.com). Leave me a number and I will personally call you and/ or your husband at my very earliest opportunity. You certainly may come to the office but I am offering to make this as easy as possible for you. I am here for either, or both, of you. I will make sure your husband is heard. I will make sure he knows he is heard. I don't know if he has an issue we can help him with but, if we can't, I will make sure he understands that and I will make sure he understands why. If we can't help but I know someone who can I will give him a name and number of that lawyer. I am here to help - not frustrate. Thank you for your time. ~ Russell Crumbley"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "115808209837038627187", "name": "Tim Turner", "time": 1554383366997, "rating": 5.0, "text": "I hired Russ Crumbley thinking I didn't have much of a chance with my lawsuit and they came through with charges dropped and I would recommend them to anyone. Thanks Russ Crumbley & Associates", "pics": null, "resp": {"time": 1555694443172, "text": "Tim: Sadly, lots of people JUST LIKE YOU go in and plead guilty because they think that is their only option. Nothing could be further from the truth as you now well know. Hope all is well. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "115110303836409854076", "name": "Joseph Hall", "time": 1526265968575, "rating": 5.0, "text": "Mr. Crumbley came highly recommended to me and I would also recommend him highly to all others for any legal reason. He served our family member with great care , but most importantly, great skill.", "pics": null, "resp": {"time": 1529007036975, "text": "Thank you, sir! You are very kind."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "101069073858892978665", "name": "Nandi Biba", "time": 1535136060117, "rating": 5.0, "text": "The Crumbley firm represented me recently in a trafficking case. They are very professional, knowledgeable, and take the welfare of their clients very seriously. They love to win! In my case the judge was very one sided and was allowing the ada to do almost whatever he wanted. Still, Russell and Josh were able to win and get me a not guilty verdict, avoiding a 20-30 year sentence. Their team consists of several brilliant attorneys with various backgrounds. If you value freedom like I do, I wouldn’t hire anyone else other than the Crumbley firm.", "pics": null, "resp": {"time": 1541011614089, "text": "Nandi: Taking care of you is what we do. You were a great client with much resolve and determination. It took a lot of guts to fight the fight you fought. It was a privilege to be the attorney chosen to stand beside you in that fight. We appreciate that you chose our firm. It was great to see your face when you got YOUR verdict. It was even better seeing the face of your wife, your mother and your father. Congratulations on the BIG win! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "112447643679754548675", "name": "Grateful Anonymous", "time": 1539695101302, "rating": 5.0, "text": "Very professional in explaining the process and helping me to get the best deal possible.", "pics": null, "resp": {"time": 1541012814003, "text": "Well I am grateful as well ~ that you let us handle your legal matter. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103195639547293344777", "name": "Bob Harper", "time": 1524947653705, "rating": 5.0, "text": "Allow me to say this to anyone who might be seeking legal counsel. I had a problem with the state of Alabama wanting to impose fines and a suspension on me for something that happened eight years ago and in another state. I went in and spoke with Mr. Crumbley and explained my situation. He in turn explained the legal process that would be followed, the possible consequences and the cost to have his firm represent me in this case. He is not cheap but, let me assure you that \"you get what you pay for.\" With the experienced law firm of Crumbley and his team what I got was a victory against an opponent (the State of Alabama) that the little man very rarely gets.\n\nI give them 5 stars.", "pics": null, "resp": {"time": 1529006712372, "text": "Thank you, Bob! Funny how things work sometime. You were a good client but, as you know - after my representation of you, we have gotten to know each other through some common geographical connections. It has been a treat to get to know you in ordinary circumstances as well."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "100996409714327886790", "name": "Ashley Ebert", "time": 1547134242504, "rating": 5.0, "text": "Mr. Crumbley and his legal team was very attentive to my needs and wants throughout my divorce. They were ready to answer questions and provide information throughout the entire process. He made me feel at ease, even during a very nervous and drawn out process. I was very skeptical at times, but Mr. Crumbley and his staff were right there to explain things and keep me in the loop on all actions that were taking place with my case. At the end of this, Mr. Crumbley pointed out that my demeanor had changed from the first day we met to the actual court date. It was great to hear someone recognize that I had gained confidence throughout the process and I have to say most of this was the way Mr. Crumbley and his staff worked with me and supported me during this very difficult time. I want to thank Mr. Crumbley and his staff for everything they did for me!", "pics": null, "resp": {"time": 1555695594133, "text": "Thank you Ashley! It is not often we get to see someone actually GROW during the course of their case but grow you did! And, you did yourself a great big favor by doing so. Best to you and your family as you move forward from this matter. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110577258547077771643", "name": "Rick Roden", "time": 1486320896618, "rating": 5.0, "text": "Russell Crumbley and his team were great.  Our daughter had a motorcycle/car wreck and they listened to us and gave us advice every step of the way.  I highly recommend them for any of your legal needs.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109811535066599567821", "name": "Jessica Riley", "time": 1510005125437, "rating": 5.0, "text": "I got my first and last DUI. I contacted Mr. Crumble and from the very beginning they were very helpful and always available to answer any questions I had during that confusing and scary time. And in the end they were able to get the charge dismissed", "pics": null, "resp": {"time": 1520523304593, "text": "Alex: Thank you! People ask me what is the best part of my job. Your review gives me the chance to illustrate that answer. These matters are confusing and scary. Providing comfort and peace of mind is every bit as good as winning! Glad this is behind you."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117413008847521198773", "name": "Gary Cathcart", "time": 1486524076454, "rating": 5.0, "text": "From the initial meeting to the final outcome, Mr. Crumbley and his dedicated staff of legal professionals never gave me any doubt that my case was always their priority.  Maintaining constant communication at every step in the litigation process, I always knew what to expect and how to react.  I was not only satisfied with the results of my case, but very pleased at the way it was handled.  I highly recommend Russell Crumbley and his team to anyone seeking personal injury litigation.", "pics": null, "resp": {"time": 1489523820174, "text": "Thank you, Gary. You are very kind."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110488481539370262237", "name": "Wendy Adams", "time": 1486009359880, "rating": 5.0, "text": "Mr Crumbley handled some issues for my nephew.  My nephew lives out of state.  The process was painless and efficient.  Thank you so much!", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110957201691134287707", "name": "Theodora Geiger Malcolm", "time": 1531395364185, "rating": 1.0, "text": "I don't hate it...I just can't contact them by phone.", "pics": null, "resp": {"time": 1531485616190, "text": "Well, THIS is certainly a problem - for both you AND me! Please feel free to call me on my cell phone. ~ Russell 256-656-6954 And, THANK YOU!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105186697060886433898", "name": "Melody Graden", "time": 1529455361267, "rating": 5.0, "text": "Russell in a top noch lawyer he was up front and honest we us he knows law and how to use it we was completely saticefied we the way he represented us and the out come of the case he kept Jackson County in line thank you russell", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "106331410309180099538", "name": "Cheryl Mellema", "time": 1528807797517, "rating": 1.0, "text": "Mr. Crumbley’s office called me the day after I posted my review of his partner, and asked if I would speak with Mr. Crumbley at his office. When I explained I was busy I was asked if I would speak with him over the phone. I agreed and I was transfered to Mr. Crumbley.  After listening to me explain my why I left the review and my account of my interactions with Mr. Matt Wisda, Mr. Crumbley asked me several questions.\n1. Would I consider removing my review?\n2. Would I consider moving it to Mr. Wisda’s webpage?\n3. If he (Crumbley) were to fire Mr. Wisda would I then delete my review! I said no.\n4. Was there ANYTHING he (Crumbley) could say or do that would result in me removing the review? To which I responded “Not ethically”, because I felt he was trying to “lead me” into asking for a monetary resolution.\n\nDuring our discussion Mr. Crumbley stated he was not at all happy about Mr. Wisda’s conduct. And that he was considering actions (including termination).  He asked once more if there was anything he could do To get me to retract the review against “Crumbley, Blackwell, & Wisda Lawfirm”.  I explained to him that when I researched Divorce Attorneys/Firms I based my decision in part on the reviews of his Firms website and information regarding the lawyers and therefore would not consider removing the review. We said goodbye and I hung up.\n\nI spent that day wondering if he would call again. I just knew “IT” wasn’t over.\nSo this evening I checked on my review out of curiosity...and wouldn’t you know it there is this long drawn out explanation that it was I who was misinformed etc.  Never once mentioning any unethical behavior on behalf of Mr. Wisda!\nI want to SHOUT from the highest rooftops what a sleazy slimeball you are! Shall I post more? Shall I post information Mr. Wisda freely disclosed to me about a clearly VERY SENSITIVE divorce and custody battle where the children involved had been...!\nYou disgust me!\n\nI retained Matt Wisda to represent me for my divorce.  I feel he acted unethically.\nI contacted his office after receiving an invoice for services that were not rendered. When I followed up with an appointment a few days later not only did he begin by talking about another case he had been working on (this was the 2nd time he mentioned details of this other party's case!) but he also presented me with an official Settlement Agreement\" that clearly stated me and my spouse had both agreed to - WHICH NEITHER OF US HAD!\n\nWe never went through discovery at all! No mediation - nothing!\nThe entire document looked copy and pasted, and all of the assets and then some were to be awarded to me!\n\nMr. Wisda was trying to fool me into thinking he had been hard at work on my case and that I was entitled to everything when in fact he hadn't done anything. Additionally It was never my intention to try take my husband to the proverbial cleaners. I just wanted a fair settlement.\n\nI didn't even look at the \"Settlement Agreement\" he'd drawn up while at his office. I had already decided to sever our business agreement and told him so.  I asked when I could pick up my remaining retainer and he said it would be about a week.\n\nWhen I went to pick up the monies, enclosed with my check was an invoice of almost $700 for the bogus \"Settlement Agreement\" that had been drawn up without consultation or discovery.  Coincidentally the new invoice showed just one line item for the preparing of said agreement which was dated after the phone call I mentioned above.\n\nI immediately drew up a letter refusing to pay and insisting I be refunded.  Additionally in the letter I called him out for trying to fool me and get paid for it. I emailed this letter and received a response early the next morning stating they would immediately refund the that money, which they did.\n\nI am leaving this review to make others aware.  In our consultation meeting he told me his practice \"is like a game to me.\"  And because  conducting his business in such a way, I feel, is an abuse of his power as an attorney and is extremely unethical.", "pics": null, "resp": {"time": 1528493792927, "text": "We deeply regret that your experience with our office did not meet your expectation. We work very hard to not let that happen. Having said that, you say that you received a “settlement agreement” that indicated you and your husband had agreed to the settlement terms when, in fact, you had not agreed. You also say that this agreement was put together without doing any “discovery” or any “mediation”. You initially hired Mr. Wisda to assist you in negotiating an uncontested divorce with your husband’s lawyer. In fact, you produced, for us, a “settlement agreement” created by your husband’s lawyer when you hired Mr. Wisda. That settlement agreement had already been prepared absent any “discovery” or attempt to “mediate”. It was clearly the intentions of both parties (and their lawyers) to settle this matter, if possible, without costly litigation. This type divorce typically does not involve “discovery” (in the traditional sense) and most certainly doesn’t involve “mediation”. In these type matters we simply go with settlement negotiations to the extent we are able, which necessarily includes “settlement proposals”. Also, in this type situation, both parties tend to agree that they know what the assets are and their values are not in dispute.\n\nThe “settlement agreement” your husband’s attorney prepared, and gave you, was just like the one Mr. Wisda gave you. In reviewing your husband’s proposal it is noted that it also includes language stating that the two of you “acknowledged and agreed” to things that you had not already agreed upon. In other words, both lawyers settlement agreements included the very same language in that regard. In fact, most paragraphs in all settlement agreements are full of language such as “the parties acknowledge and agree …”. This language is included to satisfy legal requirements and applies to you ONLY AFTER you have actually read it, agreed to it and signed it. It is not intended to mean that you have already seen it and agreed to it. And, it is NEVER INTENDED to deceive. Your attorney, Matt Wisda, did exactly what your husband’s lawyer did with respect to that language.\n\nAs far as the “attempt to fool you” is concerned: you received an itemized statement of the charges. You received two billing statements. The second of those two seems to be where you objected. That statement involves the “settlement agreement”. You were dissatisfied with that charge and objected to that bill and, although you had NOT notified him of your desire to terminate him until after that work was done, we refunded every penny to you of that part of the bill. And your objection, as much as any we can tell, is founded on your belief that it included the “bogus” settlement language indicating that you and your husband had agreed to the terms that you had not agreed to.\n\nWe strive to handle cases the way our clients direct us. And, while the services you received were not satisfactory to you, Mr. Wisda DID NOT bill you for services not rendered. His conduct was not unethical. His ability to communicate effectively with you, I will agree, must have missed the mark. For example, we are not sure how, exactly, you did not understand that the “acknowledged and agreed” language in the settlement agreement did not mean you had both already agreed to that agreement. That was no more the intent of what Mr. Wisda provided you than it was the intent of what your husband’s attorney provided him. It was merely two lawyers doing their jobs and adding the language that was going to be necessary at some point, in advance. Perhaps THAT is why it looked copied and pasted.\n\nWe would encourage ANYONE who is dissatisfied in ANY way, with ANYONE in our office, to meet with any of us. WE ARE ALWAYS AVAILABLE to meet with that person and do everything we can to alleviate their concern and fight for your cause. Your case matters to us. And, YOU matter to us. Best wishes moving forward during this trying time.\n\n~ Russell Crumbley & Matt Wisda"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108893150977543046838", "name": "Amber Roden", "time": 1529540019790, "rating": 5.0, "text": "Although my case isn’t over yet, these people at this law firm are amazing. I can say they truley build a relationship with their clients, and they are especially great to veterans. As a Veteran I come with quirks that a normal court room may not understand, however these guys told me I had an opportunity to get into Veterans Court with people who will understand my mentality and actions. I am profoundly greatful for this firm and all of their help, guidance, and prayers. Thank you, Crumbley and Associates!", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "112604978908427922049", "name": "Annie Sloan", "time": 1525998136517, "rating": 5.0, "text": "Mr. Crumbley and his associates are great! Mr. Crumbley was available to answer any questions that I had and made sure that I felt like I was in good hands… and I was! He made a very stressful time in my life much less stressful and I'm very greatful for that. I would recommend Mr. Crumbley & his associates for your legal needs.", "pics": null, "resp": {"time": 1529006993313, "text": "Thank you Annie! My favorite part of the job is relieving the anxiety. Thank you for letting us take care of your legal matter (as well as your stress)."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "113209172053181450013", "name": "Jonathan Russell", "time": 1533058264128, "rating": 5.0, "text": "I came to Mr. Crumbley with a domestic violence case in Huntsville VS me. I am an aerospace engineer here in Huntsville, and, like many of you, hold a security clearance. These charges HAD to get dropped if I had any hope of keeping my clearance and my job. I had never been in any trouble before so I wasn't sure how to go about things when the public defender asked me how I wanted to plea.. she told me to plea guilty and pay the county for a class that may or may not get the charges dropped. After getting some much needed advice from a kind correctional officer outside, I declined that plea and decided to plea not-guilty and seek out my own legal counsel. I found Mr. Crumbley's office and the charges ended up being dropped/dismissed. Him and his team, even the front office, they were all excellent. Couldn't have asked for a better outcome. Now my life, my clearance and my job will remain in tact. Everyone has the blurb at the end of their advertisements saying \"no representation is made that the quality of legal services performed is greater than that of other lawyers\" but I'm not sure I agree with that. Mr. Crumbley really knows what he's doing and takes the time to understand where your coming from, what you are trying to do, and came up with a fantastic plan to get me there. Thanks again, to the whole office and team at Crumbley, Blackwell, Wisda and Asc.", "pics": null, "resp": {"time": 1541008337764, "text": "Wow! Thank you Jonathan for those VERY KIND words. You were very fortunate to have gotten some really good, free, advice before you even met us. You did yourself a HUGE favor in following that advice. Thank you for choosing us to represent you. It was an honor to see you through this difficulty and it was especially gratifying to us considering how easily this could have turned out differently for you. Best wishes moving forward. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109103275249720637670", "name": "John Smith", "time": 1524870515137, "rating": 5.0, "text": "Mr. Crumbley is a phenomenal attorney.  Not only did he handle my case in a professional manner, but he also showed a genuine sense of caring.  He always responded in a timely fashion, if not immediately. I was at risk of losing the capability of obtaining a security clearance. Knowing the time sensitivity of my situation, Mr. Crumbley was able to expedite my case. He managed to propel what should have been a four month process before my first initial court date, to my case being completely dismissed three weeks after retaining him and his firm as my council. I highly recommend Mr. Crumbley, not only because of the outstanding success I received, but because of the quality of his character. He was a very compassionate and kindhearted man, that I will forever be indebted to. The investment does not compare to the beneficial return you will be rewarded with if you obtain Mr. Crumbley’s council.", "pics": null, "resp": {"time": 1529006507978, "text": "Your words are amazingly kind. Thank you! But, also, thank you for choosing me and my team to assist you in your matter. Your matter was very important as well as urgent. There are many lawyers in town you could have chosen. You chose us. The only way I knew to respond was to do the best I could do. Again, thanks for the kind words and best to you and yours moving forward."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "104191070693618894207", "name": "Aaron Cannady", "time": 1507347544075, "rating": 5.0, "text": "Since day one, I can honestly say Crumbley and his team has extended excellent service for me as a client and I am very pleased with the efforts that they have put forth. I would recommend Crumbley and his firm as one of the best teams around. Not only was I treated with a lot of care and respect, but the firm made me feel comfortable about my investment. I just wanted to take the time to thank everyone at Crumbley for their contributions and efforts.", "pics": null, "resp": {"time": 1520524280257, "text": "Thank you, Aaron! I will pass your kind words on to \"the team\". We have a great group of people here from the front desk, to the conference room and to the courtroom. I appreciate knowing that they ALL treated you the way I would want to be treated. Hope things continue to go well for you moving forward."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108498626513275782935", "name": "K A", "time": 1528924665957, "rating": 5.0, "text": "Outstanding service. When looking for a lawyer he needs to be your first choice.", "pics": null, "resp": {"time": 1529007598334, "text": "Thank you, KA. We appreciate you recommendation. And, obviously, we are thrilled that you were happy with our service."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114863220130182123631", "name": "Kenny McCrary", "time": 1550618789006, "rating": 5.0, "text": "I want to thank Kyle Clark in my recent case.What was a simple case turned out to be not so much when you are dealing with child support cases.Ex spouse's can be  difficult but he stepped up and problem was solved ..Thank you Kyle and the Crumbley team!", "pics": null, "resp": {"time": 1555695064829, "text": "Thank you Kenny! So glad this worked out for you and, yes, Kyle is a very smart young gun who we are quite excited to have on our team. Nothing quite like \"problems solved\". Have a great day sir. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111030120565310329047", "name": "Matthew Conlee", "time": 1462889281035, "rating": 5.0, "text": "I would Highly recommend Russell Crumbley for any legal needs. Russell worked very diligently to win my  case!", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109882374900221012956", "name": "Daniel Littleton", "time": 1463292430986, "rating": 5.0, "text": "Threw his actions and what he accomplishes it is obvious that Mr. Crumbley is the perfect lawyer for whatever problem you may be facing. He took a very stressful and uncertain time in my life and helped me threw it so now I can breath easier. Thank you for your hard work.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "106899323811165606327", "name": "J D", "time": 1529271934724, "rating": 5.0, "text": "I would like to thank Mr. Crumbley and his associates for fighting and succeeding in giving me a second chance in life. Mr. Crumbley is a confident yet humble man who will comfort your worries and lift your spirit through your difficult time. He was more than a lawyer to me. Some sessions we would just talk for hours about how to successfully overcome the stress and obstacles of life. Mr. Crumbley made a profound impact on my life. One I will forever be grateful for. Thank you Mr Crumbley for my mulligan in life.", "pics": null, "resp": {"time": 1529327153130, "text": "JD: Thank you! I wish I could sufficiently articulate how this review makes me feel. I often reference the \"mulligan\" that you reference. It is a simple concept that is most often applied on the golf course. But, as are many other simple sporting analogies, it is a great metaphor for life. I like to think such things are helpful. Your reference to it certainly makes me think it meant something to you as well. Here's hoping you \"hit 'em long and straight\" from here on out. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103449820587874690261", "name": "Steve Crabb", "time": 1462892791469, "rating": 5.0, "text": "I would highly recommend Mr. Crumbley for your legal needs. He and Mr. Jarvinen work as a great team and cover many areas of law.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111643165772784693993", "name": "mike mcfarlen", "time": 1529797706781, "rating": 5.0, "text": "I needed an attorney and didn't know where to turn so I asked a friend that had been in a similar situation . He gave me two names, Russell Crumbley and the attorney he had used. He told me every time he went to court Mr. Crumbley was there representing clients. I chose Mr. Crumbley.  Within days the other attorney  ( Jonathan Blackwell ) joined Mr. Crumbley's firm and I had both working for me. I could not have been happier .   Mr Crumbley and his firm were able to get all charges dismissed. The service was professional, the fee was reasonable, and the result was great. If you need an attorney call Crumbley, Blackwell, Wisda and associates. You will be glad you did.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109348264812525627004", "name": "Need Lawadvice", "time": 1528552333253, "rating": 5.0, "text": "I contacted Crumbley, Blackwell, Wisda & Associates, PC for help with a very personal legal matter. My attorney, Mike Morenilla, provided the advice and support that I needed to get the issue resolved in a very professional and caring manner.  It was a very stressful ordeal and Mr. Morenilla provided the reassurance that I needed that everything would turn out ok. I highly recommend this firm for any legal matter you may have.", "pics": null, "resp": {"time": 1529007252975, "text": "Thank you \"Lawadvice\". We take pride in the resources we can provide in our team approach. We are very thankful that you were so satisfied. We appreciate you and we appreciate your recommendation."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102278851608440929848", "name": "Desiree", "time": 1509063921365, "rating": 5.0, "text": "james  floyd\nMr. Crumbley  is an outstanding  lawyer who takes  great  pride in his  work and treatment of his clients.I would highly recommend him if you need  legal  representation.His staff was  courteous and professional.during the entire process", "pics": null, "resp": {"time": 1520523526735, "text": "Thank you for that Mr. Floyd. This was a difficult process for you and your family but it ended very well. Sometimes, an unexpected glitch creates an opportunity for us to step up to another level for our clients. I appreciate that you noticed that effort and that you were kind enough to share it here. God Bless!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "101398690732813194123", "name": "Chuck Swinford", "time": 1524024195896, "rating": 1.0, "text": "Contacted them trying to get help in resolving debt with a collection agency. Was dismissed very quickly and told there's not much an attorney could do and to pay the debt.", "pics": null, "resp": {"time": 1523630718845, "text": "Chuck: I very much appreciate your considering our firm to assist you with your issues. We do every thing we can to make ourselves available to people who wish to hire us to handle their legal issues. There are, however, occasions when people do not wish to hire us (for one reason or another) or even schedule an appointment to come meet with us. Under those scenarios, our staff gives the best information they can (given the limited engagement over the phone) to help them resolve their own issues. Other than that, there is very little an attorney can do for that person. If you feel you have been dealt with less than fairly I would invite you to communicate your concerns with me by emailing me directly at russ@crumbleylaw.com. Leave your phone # and I will be glad to call you and see if I can give you a better answer than the answer you received earlier this week. I can assure you that you will feel much differently after we speak. Either way, have a good day and best wishes with you issues. ~ Russell Crumbley"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "107308441151951329909", "name": "Douglas Crago", "time": 1499895944028, "rating": 5.0, "text": "Friendly staff. Really willing to help and make things as easy as possible.", "pics": null, "resp": {"time": 1520524638028, "text": "Thank you, Douglas. I will sure let my staff know how good they are doing. I will be sure to keep them around as well. :-)"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "118211064788641637381", "name": "Susan Anthony", "time": 1490306266650, "rating": 5.0, "text": "Incredible lawyer! Was informant and helpful through my entire process and got the job done perfectly!", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110485937813049158162", "name": "Kevin Bacon", "time": 1463144517583, "rating": 5.0, "text": "Mr. Crumbley is a very professional and knowledgable attorney. As a Law Enforcement officer, I have seen, first hand, at how well-rounded he is. He legitimately does his absolute best at seeing what's best for his clients. Needing an attorney for a civil case myself, I contacted Mr. Crumbley's office, among a few others. He was the ONLY attorney that returned my call. Come to find out, I had a conflict of interest with him being the defense attorney for an individual that I, unfortunately, had to arrest. I would HIGHLY recommend Mr. Crumbley's services, civil or criminal.", "pics": null, "resp": {"time": 1489520821926, "text": "Thank you, \"Kevin\". Nothing like getting feedback from someone who sees you in court on a regular basis. You do a great job as well. Thanks for your service as a law enforcement officer. Stay safe!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117915021326253256936", "name": "William Mars", "time": 1508942643453, "rating": 5.0, "text": "Mr. Crumbley was a fantastic resource to have in my corner as I negotiated a dispute with my out of state employer. Mr. Crumbley's calm made not only myself but also the opposite party understand that the dispute could be resolved with him as the mediator. I still work at my company and I know for a fact that I would not be if not for Mr. Crumbley's help. At the time, a very stressful situation, I was not able to explain myself in a clear manner and Mr. Crumbley explained the situation to my employer in an eloquent way by formulating thoughts into words.", "pics": null, "resp": {"time": 1520524080224, "text": "William: Thank you for sharing this. I remember sitting in the conference room with you ... listening. There were MANY layers of stress that had piled up for you. I will never forget your case because of what you had on the line on different levels of your life. It was an honor and privilege to help you resolve this. With so much at stake, it was certainly a great day for all of us when it all resolved in the positive way that it did. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103052519117670767013", "name": "Arian imaei", "time": 1555792952150, "rating": 5.0, "text": "Russell Crumbley and his team are the absolute best in their profession. Mr. Crumbley is the most exceptional, top notch attorney in the area and will exceed your expectations each and every time under his representation. He has represented me on 4 separate cases (3 misdemeanor and 1 felony) and has impressed me more and more each time with his results with all 4 of the cases being dismissed with NOT GUILTY verdicts when I was very GUILTY as a matter of fact. As soon as he walks in the courtroom you should know that you will be taken care of. This mans representation is like the results of having the combination of Peyton Manning in the regular season and Tom Brady in the playoffs which in other words is about as good as is gets when in comes to criminal defense representation. I honestly do not have enough words or ways that I can use to describe how high level of an attorney he is and worth every dollar of the premium cost to afford him to represent you because you get what you pay for so you won’t be disappointed no matter how guilty you are of your charges. Don’t hesitate to call his office as they are more than happy to assist you with whatever questions or concerns you may have in regards to your case. Mr. Crumbley is hands down the best attorney in our area for any criminal matters. Do yourself a favor and make sure you hire him to take care of yourself because I’d honestly be hesitant to have anybody else to represent me in a potential criminal defense situation besides Mr. Crumbley. To Teles Walker, you won’t find a better attorney or receive a better result than having Mr. Crumbley by your side and am sure you received a contract as Mr. Crumbley is always sure to provide one so everyone out there should disregard any negative reviews because those folks are more than likely either trolls or generally unhappy with their own lives and you can tell the literacy of the individual by reading their review from a grammatical standpoint. To the rest of the folks out there, be sure to disregard the ignorant individuals reviews as that is a false representation of Mr. Crumbleys services. As GUILTY as any individual may be, I can guarantee that you will receive the best possible legal result with Mr. Crumbley by your side and I say that with no doubt in mind. There is a good reason as to why you see his billboards all around our area and it’s for his consistently exceptional results. As always thank you for your outstanding as well as expectation exceeding results Mr. Crumbley.\nYours sincerely,\nAnother Satisfied Client", "pics": null, "resp": {"time": 1556027434386, "text": "Wow! I have fought for clients for 21 years but, as far as I know, this is the first time a client has fought for me. I never really thought about clients reading other people's reviews before they write their own but I guess they do. I think you were more upset than I was. But, I have learned over the years that people see things, view things, expect things and interpret things differently from each other. As they say: \"one man's trash is another man's treasure\". EVERYTHING must be ALWAYS viewed with the proper perspective. I appreciate your strong, heartfelt words but they weren't necessary. We take cases all across the board and that includes cases that are very difficult and filled with a multitude of considerations, possibilities and opportunities - even for failure. Sometimes the absolute best outcome still falls short of the perfect outcome. I think most people understand that. Having said that, God Bless you young man. Many thanks! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105504463129488306994", "name": "mike money", "time": 1490804539525, "rating": 5.0, "text": "I retained Mr. Crumbley to represent me on a DUI in the city of Madison. I had heard a lot of good things about him and his firm from other people that had used his services. I scheduled a consultation and went to meet Mr. Crumbley. I was very nervous about my situation, but within minutes he had me at ease and feeling confident we would win this case. During our meeting, Mr. Crumbley was very professional and knowledgeable and easy to talk to. I followed his advice and we took the case to a jury trial in the higher court. We were scheduled court dates several times and each time I went, the court wasn’t able to try the case at that time and would reschedule at a later date. Jump forward 6 years (that’s our court system), and the court finally scheduled a court date. So since it had been 6 years, I had moved a couple of times so the court didn’t have my current address so I was never notified of the new date. Mr. Crumbley still appeared in court on my behalf, he informed the court that he had tried to contact me but was unable to reach me. The court was talking about doing several different things, but Mr. Crumbley kept fighting on my behalf to reach a solution that was in my best interest. The day after my court date, I had a missed call, I called the number and it was Mr. Crumbley’s office. His staff found out who had tried to contact me, next thing I know, Mr. Crumbley was on the phone. He told me about the missed court date, and I’m thinking Ok, bench warrant!!! He continued to tell me the news….Case is Dismissed!!! What better outcome could there be. Thanks Russell.", "pics": null, "resp": {"time": 1520525082285, "text": "Mike: THANK YOU for that. But, I just did what you hired me to do ... I kept fighting. And, it certainly worked out better than I expected. Just goes to show ... you never know until you go try. God Bless!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "101450159794462300011", "name": "Rick Wienczkowski", "time": 1565129480934, "rating": 4.0, "text": "Very professional so we'll see if he wins my case or not", "pics": null, "resp": {"time": 1566419902194, "text": "Mercy! I'm not speechless often but I may be here. Of course, I won a trial one time by not saying a word. True story. Of course, I hope we win your case as well. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103817291522820376262", "name": "K Cheema", "time": 1510345089226, "rating": 5.0, "text": "Excellent lawyer, very effective communicator and knowledge of legal processes.", "pics": null, "resp": {"time": 1520519045146, "text": "Thank you SO MUCH! IF I did a good job communicating, you did as well. So, thank you for THAT as well."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "101692053037746828107", "name": "Vicky G", "time": 1531500751827, "rating": 5.0, "text": "Mr. Wisda and his assistant Amy make a great team for my very complicated and drawn out divorce case.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103780661660319699726", "name": "Margie Girard", "time": 1517396557573, "rating": 5.0, "text": "Yesterday I posted negative reviews about Mr Crumbly. I apologize and know I posted in hast.", "pics": null, "resp": {"time": 1520517811642, "text": "Margie: You had A LOT on your plate ... sometimes, life just gets difficult and hard to manage. No worries, and thank you for understanding where we come from in handling these sometimes very delicate legal matters. Hope your day is better."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103510020611381283667", "name": "ben floor", "time": 1486563430459, "rating": 5.0, "text": "Open and honest with me and walks you through the process.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "112808035632410121958", "name": "Molly Johnson", "time": 1486307619230, "rating": 5.0, "text": "Mr. Crumbley helped me with a situation that could have jeopardized my future and career. I highly recommended him for any of your legal needs!!", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "104957238976159604531", "name": "Marina Efimova", "time": 1468608638482, "rating": 1.0, "text": "He has rude and not responsible representatives. And if he can't organize his firm work properly, I don't believe he is doing his job well.", "pics": null, "resp": {"time": 1488301432004, "text": "It is critically important to us/me that anyone who calls our office has a pleasant experience from the very first moment they are greeted on the phone. We have a seasoned, competent and caring staff but we would encourage ANYONE who takes exception to the way they are treated by anyone in my office (including any of the attorneys) to bring the details of that to me (Russell), personally, by emailing the name (and details of the conversation) to me at russ@crumbleylaw.com. I will thank you in advance for helping us/me maintain a helpful and caring environment for our clients who are, for the record, the most important people to walk through our doors."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108208899833538466701", "name": "Sean Brady", "time": 1477424697795, "rating": 5.0, "text": "Mr Crumbley is one of the few lawyers willing to help people with criminal cases, and even makes up for his high prices in consultation when youre not pleased with the consultation at first. His advice is fair, and non bias.", "pics": null, "resp": {"time": 1488302519104, "text": "That was very kind, Sean. I appreciate your gracious attitude. I wish you nothing but the best."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108257506774849255460", "name": "Lucas Johnson", "time": 1535406865124, "rating": 5.0, "text": "Curtis Whitmore is great and friendly.", "pics": null, "resp": {"time": 1541011641872, "text": "Lucas: Yes, he is. Great guy! Thanks for saying so. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103461324183032244647", "name": "William Smart", "time": 1603157547266, "rating": 5.0, "text": "Useful", "pics": null, "resp": {"time": 1604589163027, "text": "Thank you William. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110868700782359568967", "name": "Bobby Peden", "time": 1536798151007, "rating": 5.0, "text": "These people can handle any thing. They handled all my needs.", "pics": null, "resp": {"time": 1541011705474, "text": "Bobby: You are much too kind. But we WILL roll our sleeves up and work. Thank you for continuing to place your trust in us. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102409251739989835326", "name": "Mike Pilotte", "time": 1561663565298, "rating": 5.0, "text": "Awsome attorney..", "pics": null, "resp": {"time": 1568033036496, "text": "Thank you, Mike. We certainly appreciate your giving us a chance. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105594477513756937616", "name": "Angel Pennington", "time": 1520469355057, "rating": 5.0, "text": "I visited Jonathan Blackwell and although I didn't need immediate legal help, he gave me stellar advice and if I do need legal help in the future I will Defenitely use him!", "pics": null, "resp": {"time": 1520532632755, "text": "Thank you, Angel. Please keep us in mind!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "104158596799754295635", "name": "Walter Prunzik", "time": 1486333033171, "rating": 5.0, "text": "\"Not Guilty, or Case Dismissed\" These are the only words I want to hear from a courtroom judge, and I've heard em both when Russell Crumbley was my attorney!", "pics": null, "resp": {"time": 1489523760870, "text": "Walter, our favorite \"world traveler\". You have SUCH a way with words. Thank you!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111661015498013132953", "name": "Dena Mastin", "time": 1493755260229, "rating": 5.0, "text": "I could not have chose a better law firm to handle my case!!! Thank you so much Russell and Mike👌🏽👌🏽👌🏽👌🏽👌🏽👌🏽.", "pics": null, "resp": {"time": 1520524901328, "text": "You showed tremendous courage during the course of your matter. Your willingness to stand strong in the face of great risk gave us an opportunity to shine. I will NEVER forget your personal display of courage. Carry on!!!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "118078438045310432421", "name": "DIPYO Much", "time": 1535124569716, "rating": 5.0, "text": "Outstanding lawyers that really care!!", "pics": null, "resp": {"time": 1541011222217, "text": "Thank you, John! That made my day. 5 words that said it all. And, we really appreciate your taking a minute to say so. Today is Wednesday, hope you have a GREAT weekend when it gets here. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111383651073425070102", "name": "Day Dreamar42", "time": 1517608155980, "rating": 5.0, "text": "Best lawyer anyone can ask for", "pics": null, "resp": {"time": 1520517307365, "text": "Thank you, Joe. We enjoyed working with you. Best luck moving forward."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114198234793193017362", "name": "Ben Tipton", "time": 1542154345567, "rating": 5.0, "text": "Pretty good legal services", "pics": null, "resp": {"time": 1555695624936, "text": "Thanks Ben! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "101176330698234101806", "name": "Jacob Cooley", "time": 1561376254878, "rating": 1.0, "text": "Very expensive and not worth it.  Will make promises and not follow through.  This is for Blackwell, I'm not sure about Crumbly", "pics": null, "resp": {"time": 1561641314585, "text": "Jacob: It is very disappointing to see your level of disappointment. After a review of our records, it appears as though this review stems from issues about 10 years ago. Jon and I bend over backwards for our clients to try to get the best results possible. We have tried many cases in front of a jury. We get MOST cases dismissed and, of course,  some clients do enter a guilty plea. However, every case is different and has it's own variables, nuances and circumstances (both in fact and in law). For that reason, alone, we never make promises or guarantees - even when we believe we could. That is just not good business. The ONLY thing I know to do is to reach out to you and I have done that - to no avail. My office and my phone line remain open to you. In either event, we wish you nothing but the best. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108750194863716400431", "name": "e c", "time": 1594255293215, "rating": 5.0, "text": "Nice", "pics": null, "resp": {"time": 1598880456093, "text": "Nice! THAT is so cool I'm going to tell my wife about this one. THANK YOU! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111221493145599867447", "name": "Dustin Dadd", "time": 1567955361583, "rating": 5.0, "text": "Best in the business", "pics": null, "resp": {"time": 1568049189002, "text": "Thank you, David, for letting us take care of you. We appreciate you as much as you appreciate us. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "118397378157549850111", "name": "Drama Baby’s", "time": 1565475867180, "rating": 5.0, "text": "Amazing....", "pics": null, "resp": {"time": 1566420487545, "text": "Wow! Thank you LayLay! Just … THANK YOU! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117353932842762829422", "name": "Gay Campbell", "time": 1572398994514, "rating": 5.0, "text": "Excellent", "pics": null, "resp": {"time": 1572623927439, "text": "Very kind! Thank you! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "116662350584586485493", "name": "Douglas Dyar Jr.", "time": 1529612450769, "rating": 5.0, "text": "Thank you Russell", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103898603255668286287", "name": "Michael Chunn", "time": 1511456229377, "rating": 5.0, "text": "Professional and friendly", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114198234793193017362", "name": "Ben Tipton", "time": 1542154345567, "rating": 5.0, "text": "Pretty good legal services", "pics": null, "resp": {"time": 1555695624936, "text": "Thanks Ben! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "104517042143286199355", "name": "Hyper Explorer", "time": 1520737755387, "rating": 5.0, "text": "Get this lawyer, Blackwell  .", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105696835351400139674", "name": "Cydney Cooke", "time": 1621016547131, "rating": 5.0, "text": "The BEST in the BUSINESS! Mark is a straight shooter. He's honest about outcomes and if he says he can do it, BELIEVE! Mark is attentive, driven, focused and he listens to your concerns and desires. Mark doesn't take a case just for the money, he truly cares about his clients getting their desired outcome! He is worth all the money he charges. I promise you won't be disappointed and if you are, you didn't listen to him.", "pics": null, "resp": {"time": 1621017498075, "text": "We strive to provide the best legal representation that we possibly can for each of our clients. We sincerely thank you for allowing us the opportunity to work with you. Many thanks!"}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "112545149762132401036", "name": "TA R", "time": 1618364090727, "rating": 5.0, "text": "Mark is really great at his job.  I was really impressed with his knowledge and legal expertise.  He didn’t just treat me like a client,  he genuinely cared about me and my son well being during our difficult time.  I was never pressured to hurry and move forward with the process.  If I could give Mark and his staff-Allyson a (10) I would hands down!   I couldn’t have asked for a better outcome in a terrible situation, it was better that I expected.\nIf going through a divorce, hire Mark before your spouse does!\nThank you Mark!!", "pics": null, "resp": {"time": 1618366589225, "text": "You were a pleasure to work with and we wish you the wonderful life that you deserve!"}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "106108140926168017935", "name": "Amber Wells", "time": 1621391567547, "rating": 5.0, "text": "I encountered my first instance of needing an attorney dealing with child support and per the google reviews I opted to hire Mr. Gober. As stated in various reviews, Mr. Gober is very straightforward as he advised me on what to expect from the beginning to the end of the process. I was in court for approximately 35 minutes and walked away full of smiles and happiness! I am beyond please with the results produced on my behalf of my daughter and I.\nAllyson was amazing as well! My initial phone call with her was very informative and professional as I can recall we spoke for approximately 30 minutes lol!!!\nI would like to extend a huge thank you to the both of you!!! (HUGS HUGS & HUGS)\n\n-Many blessings to this business", "pics": null, "resp": {"time": 1621396540240, "text": "It was more than a pleasure to work with you! Thank you so much for your confidence in us."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "114798955305292923047", "name": "Kelly Abella", "time": 1612030268820, "rating": 5.0, "text": "I couldn't have picked a better Attorney for my very contentious divorce. Mr. Gober has the perfect blend of qualities for the job. He was smart, insightful and professional. He was appropriately resolute but also able to manage the expectations realistically.  His wonderful sense of humor showed up just when I thought the anxiety would surely overwhelm me. And he assembled a team of the best specialists in the business as we needed them. While a divorce is never a pleasant, it is nice to go into battle with a team you completely trust.", "pics": null, "resp": {"time": 1612816677477, "text": "You were wonderful to work with, Ms. Abella.  Our senses of humor definitely clicked. Thank you for trusting us with your case.  Representing you has been a pleasure."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "100287989401200614879", "name": "tink06 Bama", "time": 1616546373114, "rating": 5.0, "text": "Mr Gober consulted with me and had wonderful advise for my situation.  He was very professional and extremely kind.  I will definitely use him in the future if required!", "pics": null, "resp": {"time": 1616632547640, "text": "Thank you so much!  It was our pleasure. We hope you don’t need us but we are here if you ever do."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "114591099914408446035", "name": "Amy Simpson", "time": 1614024719577, "rating": 5.0, "text": "Perhaps the thing that impressed me most about Mr. Gober was nothing was \"sugar coated\". He was very straight forward and told us what to expect each step of the way. Going thru a two year custody/dependency case from start to almost finish Mark has kept us informed of each step and what the options were and what the risks were. There were no empty promises made just to keep the client happy which I know sometimes occurs when seeking counsel. Everything down to his amazing office staff has made this difficult situation easier to navigate. Our family couldn’t not have asked for more than Mark has given. We would give him 10 stars if it was an option!  We will continue to use him for our legal needs ❤️", "pics": null, "resp": {"time": 1614658978060, "text": "Thank you for your kind words. I give you guys 10 stars as well!"}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "106506843032787332598", "name": "Kaci McDonald", "time": 1614382682074, "rating": 5.0, "text": "Mark and Allyson are the best around. I chose Mark Gober based off of excellent Google reviews and I’m so glad I did.", "pics": null, "resp": {"time": 1614383717076, "text": "We are glad you did as well, Kaci. It was a pleasure to represent you!"}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "116964046021853492829", "name": "Carrie Summers", "time": 1595889750129, "rating": 5.0, "text": "I would highly recommend Mark for your child custody modification needs!!! Mark has you and your little ones best interests in mind!!! He will present you with realistic expectations and fight for you!!! PS-His right hand lady, Allyson, is pretty awesome too!!! Lol, I kinda feel like I’m losing a piece of my family!!! Thank you both for all you have done and do!!!", "pics": null, "resp": {"time": 1595894882225, "text": "It was our pleasure to represent you and you will always be part of the MSG,LLC family!  Thank you so much."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "112485898981389202387", "name": "1JDC21 EBAY", "time": 1605634773237, "rating": 5.0, "text": "Mr. Gober is a professional and honest lawyer who can de relied upon when life grows hard", "pics": null, "resp": {"time": 1612816716878, "text": "Thank you so much.  We owe our success to our clients."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "115986742652717927276", "name": "Cheryl Chastain", "time": 1597335720003, "rating": 5.0, "text": "Mr. Gober answered any and all of my questions and nothing was considered insignificant.  He had my best interest at heart and worked diligently to obtain the best possible outcome for me and my future.  I am very appreciative of his negotiation skills and the promptness of completing my case.  Allison was quick to respond to anything I needed and was a very calming voice in my frantic calls.  I would recommend Mark Sterling Gober, LLC to anyone needing an exceptional and caring attorney.", "pics": null, "resp": {"time": 1597607819555, "text": "Thank you for your kind words. You were a pleasure to work with."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "102603007347490377574", "name": "Troy Cannaday", "time": 1574478304059, "rating": 5.0, "text": "I can not say enough positive about Mark and Allyson.  From our first conversation through the signing of the final divorce paperwork, I found Mark to be fully engaged and focused on my situation.  He gave sound guidance and was willing to hold back in areas I was not willing to push hard on. Mark, thank you for your honesty and integrity.  You helped make a difficult situation bearable.  Calling you was the best decision I could have made!  God Bless!", "pics": null, "resp": {"time": 1574486116423, "text": "Thank you, Troy. It was my pleasure to work with you. One of the most rewarding aspects of what I do is those occasions when a client becomes a friend. All the best to you."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "111376473504725958781", "name": "Tashana Westbrook", "time": 1586039337393, "rating": 5.0, "text": "I was very pleased with Mr. Gober. He handled my case well, and I got everything I wanted. He was prompt on everything. He is very knowledgeable and answered any and every question I had. I would highly recommend him!", "pics": null, "resp": {"time": 1596512431268, "text": "Thank you, Ms. Westbrook.  It was our pleasure to work with you."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "115252275572536632432", "name": "T. Mitchell", "time": 1548266926032, "rating": 5.0, "text": "Mark is a diligent lawyer who focuses on what's most important to his clients. He worked hard to settle our case as quickly as possible. We live out of state and he was mindful to limit our travel as much as possible. While the case was for my husband, it crossed over to me, and Mark held true to take care of us both. While I'm hopeful I will never have to go through a legal ordeal again-I would not think twice about what lawyer to represent me or my family. Mark will get the best deal available to you, hire him!", "pics": null, "resp": {"time": 1554863541127, "text": "Thank you so much. Working with you was our pleasure!"}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "117923947929816907642", "name": "Bianca Love", "time": 1591110920175, "rating": 5.0, "text": "I only called the firm for legal advice and consultation regarding custody and visitation. Mark was in mediation, but Allison answered all my questions and addressed my worries immediately. When and if I do need them, I will not hesitate to call. I know they will handle my case aggressively and with care.", "pics": null, "resp": {"time": 1591114671893, "text": "Thank you so much for your confidence. We strive to earn it every day."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "104328145841720685328", "name": "Johnathan Mitchell", "time": 1582136343793, "rating": 5.0, "text": "If your looking for a Divorce attorney I recommend Mr. Mark Gober be your choice. I cannot say enough about how pleased I am that I chose him to handle my case!", "pics": null, "resp": {"time": 1582140201261, "text": "Thank you, Jonathan. It has been a pleasure working with you!"}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "107838469933384895640", "name": "Nick Ware", "time": 1591367367620, "rating": 5.0, "text": "If you have family issues that you need resolved, hire Mark Sterling Gober! He Will get the job done! Extremely professional!", "pics": null, "resp": {"time": 1591371980311, "text": "Thank you, Nick. It is a pleasure to work with you. It’s all going to work out."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "101523126564113069394", "name": "Sam Bone", "time": 1590765499242, "rating": 5.0, "text": "I interned for Mark when I was in undergrad. He is the premier divorce and family law attorney in Tuscaloosa, AL.  I still call him when I have issues I need to help walk through.", "pics": null, "resp": {"time": 1590769330701, "text": "Thank you, Sam. Those words mean a great deal coming from one of the most successful young lawyers I know. Proud of you."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "111676468037157780109", "name": "Laura Leigh Thompson", "time": 1565632912281, "rating": 5.0, "text": "As a Realtor, I sometimes need legal services for my business, and I receive attorney referral requests from clients. When that happens, I always rely on and recommend Mark Gober. Not only is he an outstanding family law attorney, he specializes in ensuring his clients feel safe and secure in challenging circumstances. I call him “one of the good guys.” Mark is intelligent, knowledgeable and confidently navigates even the most complicated legal scenarios…and he does that while keeping his clients at ease. Mark is also highly respected, and has a ’sterling’ reputation among his colleagues. I don’t use the word ’trust’ lightly. I trust Mark Gober.", "pics": null, "resp": {"time": 1565634333973, "text": "Thank you, Ms. Thompson. We very much appreciate your confidence and trust. The feeling is quite mutual."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "102476374317048701100", "name": "Tim Jackson", "time": 1604343343526, "rating": 2.0, "text": "Not a professional one on one interview.....price is outrageous.", "pics": null, "resp": {"time": 1604726341570, "text": "Our firm has never represented this gentleman and has no attorney/client relationship with him. His only contact with us was a brief telephone call. Unfortunately, we were unable to accept small weekly payments for representation in a very involved legal matter. We regret that Mr. Jackson was frustrated by financial limitations. Although Mr. Jackson has never received legal services from our office to “rate”, we wish him the best."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "102727720538492846511", "name": "Christopher A.", "time": 1570799501962, "rating": 5.0, "text": "Mark and Allyson consistently go above and beyond for their clients. I can attest to this experience firsthand. Mark dealt with my extreme anxiety while I was facing a complex and harrowing situation. While I can be very detail-oriented and laser-focused on worries and what-if's, Mark is in the know, and he's been doing this for a while. He knows exactly what to do, what to say, and (as it is important in small towns such as these) he knows the right people. If you want an attorney who will fight for you and make sure you get the best possible outcome, you can look no further than Mark Gober.\nSorry it sounds cliche, but he really does.\nNow where's the 'more than 5 stars' button on this thing....", "pics": null, "resp": {"time": 1571024943413, "text": "Thank you, Chris. Working with you was our pleasure."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "103504339119405228783", "name": "kristy patterson", "time": 1518637402609, "rating": 5.0, "text": "Mark did an excellent job of handling my divorce. He kept me informed throughout the process by immediately forwarding to me all court filings as well as written communication between him and the opposing attorney, which greatly reduced my anxiety during the divorce process. I also appreciated his professionalism and the manner in which he dealt with or appropriately ignored petty, exaggerated, or nonexistent issues created by my former spouse and his attorney. That saved me a lot of money! Mark's accessibility, as well as his no nonsense, no drama approach made the process as emotionally and financially painless as possible. His assistant, Allyson, was also great!", "pics": null, "resp": {"time": 1518639869848, "text": "Thank you for your kind words, Ms. Patterson. Working with you has been my great pleasure. You have been an excellent client."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "106211452417841326485", "name": "Chris Williamson", "time": 1572659539023, "rating": 5.0, "text": "Mark truly cared about my case and that care was evident in his actions.5 stars are not enough! Thank you!", "pics": null, "resp": {"time": 1572673791592, "text": "Thank you so much, Ms. Williamson. Working with you has been our pleasure. All the best to you and your family."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "104469881304212115031", "name": "Michael Jennings", "time": 1457068756989, "rating": 5.0, "text": "Mark has been my attorney for a couple of years now handling custodial issues and I must say that I have been very grateful to have had Mark Sterling Gober represent me.  He is an incredibly knowledgeable, dedicated, thoughtful, and thorough attorney.  He always gave me his direct and honest opinion with respect to my case and I really value his opinion and advice.  He was very punctual and always returned calls and/or emails  promptly.  When a friend or colleague needs legal advice or representation, I always steer them in Mark's direction.  I am very happy to not only know Mark on a professional level, but I also consider him a great friend of mine and my family.\n\nI highly recommend Mark Sterling Gober, LLC, to anyone needing legal representation.", "pics": null, "resp": {"time": 1457721191198, "text": "Thank you, Michael. You are always a pleasure to work with. We deeply appreciate your confidence and kind words."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "101349089311320823307", "name": "Don Barron", "time": 1550161009988, "rating": 5.0, "text": "Mr. Gober is very professional and knowledgeable.  He is very ethical and works diligently to protect the best interests of his clients.  I recommend him for anyone that needs legal services.", "pics": null, "resp": {"time": 1556112296635, "text": "It was our pleasure to work with you."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "100942009335727908607", "name": "Jennifer Holifield", "time": 1554919911431, "rating": 5.0, "text": "Attorney Mark Gober is a rarity! The personalized service and exceptional work he and his staff provide is unmatched to any others. Mark helped my husband with obtaining an LLC for his electrical company. The turnaround was fast and the experience was excellent. We would recommend Mark Gober and his office staff to anyone needing any type of legal services or counsel. He is truly a rare find in this field and goes beyond expectations for his clients. Highly recommended!", "pics": null, "resp": {"time": 1571025080250, "text": "Thank you so much for your kind words. We appreciate you."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "109712732889153911226", "name": "Roy Parker", "time": 1454944768126, "rating": 5.0, "text": "Aside from guiding me through the turbulent legal waters of a difficult divorce.\nMark was always there for moral support as well. He understood from the first what was important to me and worked with me to achieve that. He always returned my calls or any other communication promptly. I will always be indebted to him for his kindness and patience throughout my experience.", "pics": null, "resp": {"time": 1454955472877, "text": "No lawyer could ask for a better client than you, Roy Parker."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "116882165276177377477", "name": "Jacob King", "time": 1605837903160, "rating": 5.0, "text": "Mark and his staff went above and beyond!", "pics": null, "resp": {"time": 1605840453912, "text": "Thank you, Jacob. It was our privilege to fight for the rights of an excellent Father like you!"}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "117045130689137655064", "name": "Tyna Pyburn", "time": 1454625250993, "rating": 5.0, "text": "Mr. Gober and his staff were complete professionals that showed great compassion.  They were always patient in explaining  the entire process and were prompt to answer all my questions.  Mr. Gober handled my case as if I were family and that gave me great peace of mind. He fought non stop to secure me an exceptional settlement and make sure I understood the implications of what I was agreeing to both financially and legally. I could not have asked for better representation.", "pics": null, "resp": {"time": 1454743175422, "text": "Thank you so much. Working with you was a pleasure."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "104465355738246223580", "name": "tina bearden", "time": 1497665860297, "rating": 5.0, "text": "I can't begin to express how thankful I am for Mark Gober,  he is awesome.   Hands down the best lawyer.  He's very professional, dedicated and stands by his word. I am very pleased with his service.  I would gladly recommend him to everyone.  Thank you Mark!!!!", "pics": null, "resp": {"time": 1497668261866, "text": "I am humbled by your kind words, Ms. Bearden. Representing you has been a pleasure. Thank you so much."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "118261281166285245422", "name": "Jennifer Farmer", "time": 1554910380357, "rating": 5.0, "text": "Outstanding service from start to finish.  Mark Gober handled my case with both professionalism and compassion.  The representation I received from Mark Sterling Gober, LLC exceeded all expectations.  I would highly recommend him to anyone seeking legal counsel.", "pics": null, "resp": {"time": 1554912728719, "text": "Thank you so much! You are a pleasure to work with."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "113512830614321813942", "name": "Rodney Williams", "time": 1495812557807, "rating": 5.0, "text": "Mark is hands down the best of the best. He doesn't make promises he can't keep and he always delivered. Mark is very punctual and professional. Also his staff keeps you in the loop of things by letting you know what the next steps are in the process. I wouldn't recommend anyone else in Tuscaloosa or surrounding areas to represent you but Mark Gober!", "pics": null, "resp": {"time": 1501641452149, "text": "Thank you for your kind words, Rodney. Representing you was a pleasure."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "116140794746906310852", "name": "Grumpy (𓃒)", "time": 1467064327058, "rating": 5.0, "text": "Mark have this nonchalant personality like  nothing is big deal, and I was worry at first because my Case is big deal to me!!! And I was afraid that he was not working hard enough for my case!!! But he has wow me at the Courtroom!! Very fun to watch him attacking the other opponents verbally and made them lose their cool and say some thing they not supposed to say.... I'm still smiling thinking about it!!\nAnyway ! We won!! And I'm so happy!!! By the way he not cheap, but you pay for what you get!!!\nChocolate covered strawberries coming your way Mark!!! Thank you very much!!!", "pics": null, "resp": {"time": 1467068723474, "text": "It was my pleasure to work with you, Holly !  I'm so happy with our result."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "101679623153856480799", "name": "Kelly Greene", "time": 1454979089064, "rating": 5.0, "text": "As my attorney, Mark Gober has been compassionate, dedicated and thorough.  He is always quick to respond to my emails and phone calls.  He knows the legal aspects of my case and has been so helpful in guiding me through the steps that need to be taken.  He has listened to me when I've been discouraged and has taken the time to calm my fears.  He has gone above and beyond what I ever expected and has been the best possible attorney that I could have chosen for my case.  I highly recommend Mark Sterling Gober, Attorney at Law.", "pics": null, "resp": {"time": 1455060616530, "text": "Thank you so much. Working with you is our pleasure."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "112467446784372409236", "name": "Lisa Samuels", "time": 1574624795539, "rating": 5.0, "text": "down to earth professional and very informative.", "pics": null, "resp": {"time": 1576021492631, "text": "Thank you so much, Ms. Samuels."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "104769314165727690414", "name": "Kati Williams", "time": 1518628730706, "rating": 5.0, "text": "Mark went above and beyond for my family.  He made my children's needs a priority and protected them like they were his own.  He was not just my attorney but also became my friend.  Thank you Mark!", "pics": null, "resp": {"time": 1518635198996, "text": "Thank you, Kati. I am very proud to have you as my friend."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "101738440306797035552", "name": "Michael Ashton", "time": 1463686121755, "rating": 5.0, "text": "Mark is a great lawyer and incredible person. He's helped me through a few tough times and I've always been grateful to have him in my corner. Highly recommend.", "pics": null, "resp": {"time": 1463877042853, "text": "Thank you, Michael !"}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "108592537297094698462", "name": "Mike Causey", "time": 1474580099105, "rating": 5.0, "text": "From our first meeting on, Mark showed professionalism and a genuine caring attitude for my situation. His dedicated staff is efficient and attuned to the needs of the client. I highly recommend Mark Sterling Gober.", "pics": null, "resp": {"time": 1474686613903, "text": "Working with you was a pleasure, Mr. Causey."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "117701681122513381781", "name": "Jace McCauley", "time": 1501636775248, "rating": 5.0, "text": "I hired Mark as my divorce attorney, even though the court proceedings where two counties away, worth every penny. I was very pleased with the outcome. Mark is a professional lawyer.", "pics": null, "resp": {"time": 1501641528025, "text": "Thank you, Jack. You were a model client and I was pleased with our result. All the best."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "105494554949427381181", "name": "Steve Hallman", "time": 1482908158268, "rating": 5.0, "text": "We recently had the stressful burden of a child support situation change our lives. Involved in a case that had never been before the Alabama Courts, we had no idea if we should fight or roll over and (pay)dead.  I am far from being a quitter but sometimes you feel that there is nothing or no one that can help you and the ones you care for. Sometimes it seems that the Justice system is anything but just. This is exactly how we felt all the way up to our final hearing. We new we were going to need an intelligent and thorough attorney. We researched and asked people who we should use and was referred to Mark. We went and talked with him and he took our case, but told us he couldn't promise anything. He told us that he would do the best he could, and that was all we could ask for. We just wanted what was fair and felt it was worth the fight. After trying to go to court without an attorney and seeing how that was going we just knew we had to have representation. Our finances were extremely tight and we worried that it might just all be for naught. It seemed the law just didn't have anything to protect us. Mark Gober searched and searched and found cases in several other states that supported our side, and gave us some hope. Still we were concerned that it could go either way. We even were concerned that the truth was not going to come out because everyone kept saying that it was all irrelevant. Even with all of the negative things we were hearing  we stuck it out and kept fighting because we felt that it mattered. We wanted our case to maybe help someone else in the future. Mark surpassed anything that we could have expected when we got in the courtroom for our final hearing. We were amazed by how thorough he was without even having to bring every detail into it (which could have taken a lot more time and cost us a whole lot more money). I could not believe it when he actually got them to admit things on the stand that showed exactly what was going on. Justice was truly done as much as it could possibly be thanks to Mark. This was a case for me of right vs. wrong and the good won out. Thank you so much for all that you have done for our family. You are a wonderful attorney and we will definitely tell everyone we know or talk with how hard you worked for us. You went above and beyond, and we now have faith that the Justice system can work.", "pics": null, "resp": {"time": 1483507564939, "text": "Thank you so much for those kind words. This was most definitely a case of \"right vs. wrong\" it was my pleasure to work with you and Jennifer."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "110367266534686802994", "name": "Vanessa Griffin", "time": 1455240673803, "rating": 5.0, "text": "He's a wonderful and experienced attorney who helped me through a difficult divorce and I was very pleased with how I was represented.", "pics": null, "resp": {"time": 1455244791185, "text": "You were a pleasure to have as a client, Ms. Griffin. We appreciate your kind words."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "102257147247817206906", "name": "Lucas Sanders", "time": 1533916789141, "rating": 5.0, "text": "The whole group was great and took care of everything we needed", "pics": null, "resp": {"time": 1548146083766, "text": "It was our pleasure, Luke. Thank you for  allowing us to work with you."}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "106138386042379946022", "name": "Robin Lewis", "time": 1571837763526, "rating": 5.0, "text": "The best attorney in Tuscaloosa.", "pics": null, "resp": {"time": 1571864893853, "text": "Thank you so much, Ms. Lewis.  It was our pleasure to work with you and we wish you all the very best!"}, "gmap_id": "0x888602e8f47ced21:0xfd050a20d411d190"}
{"user_id": "100797197793850253161", "name": "Trey Horton", "time": 1433982163218, "rating": 2.0, "text": "Went in, Very old guy.... I told him about some tax things I would like to take care of. Paid him $500 - he said he was going to the IRS to pull my transcripts (that can be pulled online) the next day so when I met him next I asked to see them. Since he said he spent all day down there getting them and used the $500 I paid him.. . He could not produce them. Never saw them. I asked him what I needed to do, he offered no sort of plan, no sort of advice. Said let's offer them xyz and see what they say.... Give me a break. I can do that myself...   Never went back. hate being lied to. Lost $500 beware...", "pics": null, "resp": null, "gmap_id": "0x888917df8c1c89dd:0x6669c005e7cb1a1e"}
