{"user_id": "109535931511347327100", "name": "Shelley Kim", "time": 1461042114274, "rating": 5.0, "text": "It was such a pleasure hearing DJ Billy Ferguson!  Growing up with a dad who's a musician, I was exposed to, and have an appreciation of, the older generation's music as well as every genre of music out there.\n\nBilly, being so humble, surprised me with his extensive knowledge of these genres from old classics to country to hip-hop!  Ask him for ANY song and he'll pull it up in a second.\n\nHe's an excellent MC - a natural - and is an asset to any event because he loves what he does, he's been doing it for ever, and can blend into whatever role you need him to play.\n\nI can't wait for my daughter to get married so more people can get to experience him as I have.", "pics": null, "resp": null, "gmap_id": "0x888c29fc6afc368b:0x674376fee6b94d4e"}
{"user_id": "100265935271884226756", "name": "Lana Grier", "time": 1451238678050, "rating": 5.0, "text": "I highly recommend Hubcap Classics with Billy Ferguson when looking for disk jockey.  Mr. Ferguson has provided entertainment at multiple events I have attended through the years. He has awesome sense of humor and access to every song you could imagine.  He is definitely a crowd-pleaser and keeps the party lively!", "pics": null, "resp": null, "gmap_id": "0x888c29fc6afc368b:0x674376fee6b94d4e"}
{"user_id": "112881252800758493659", "name": "james worrell", "time": 1500344220093, "rating": 5.0, "text": "D j had excellent communication skills", "pics": null, "resp": null, "gmap_id": "0x888c29fc6afc368b:0x674376fee6b94d4e"}
{"user_id": "112915029039315141933", "name": "Burnette Plumbing", "time": 1497609384092, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x888c29fc6afc368b:0x674376fee6b94d4e"}
{"user_id": "116207822186030735357", "name": "Benjamin Ellis", "time": 1517428990439, "rating": 1.0, "text": "Idk", "pics": null, "resp": null, "gmap_id": "0x888c29fc6afc368b:0x674376fee6b94d4e"}
{"user_id": "108180800077036929089", "name": "Chasen Shaw", "time": 1578287927437, "rating": 5.0, "text": "Birmingham is lucky to have JAMM. They're a small business with big capabilities for special events of all kinds. I've worked with them for many years and always appreciate their professionalism.\n\nYou really can't go wrong working with Geoff and the JAMM team.", "pics": null, "resp": null, "gmap_id": "0x88891764f5f60a81:0xe98ab25cc34c3d64"}
{"user_id": "100567245515630847121", "name": "Tracy Pool", "time": 1533061099022, "rating": 5.0, "text": "I hired JAMM for my wedding and they did a wonderful job! I met with Jeff several days beforehand to go over the songs I requested and he worked in every single song during the reception at very specific times! He also provided white curtain covers to hide the not so pretty green curtains behind our altar in the hotel where we were married, as well as lighting. Our guests raved about how beautiful everything was, and a lot of that was because of JAMM!", "pics": null, "resp": {"time": 1533597549788, "text": "It was great helping you create your wonderful wedding! Congratulations again!"}, "gmap_id": "0x88891764f5f60a81:0xe98ab25cc34c3d64"}
{"user_id": "110745501166153434853", "name": "Erik Church", "time": 1558968390795, "rating": 5.0, "text": "JAMM Entertainment was referred to us by a friend.  We are so thankful that we heard of them.  From the initial quoting process, I could tell they had done this before.  They were extremely thorough and professional, ensuring that every part of our day had good flow from a DJ perspective.  We met with our DJ (Geoff) in person after filling out an initial planning form.  He made sure every detail was covered.  On the big day, everything flowed so smoothly it was incredible.  The ceremony was absolutely beautiful with no \"hiccups\" that always seem to happen with DJs.  The reception was so much fun! Geoff was incredible at reading the crowd, sensing when people needed a little motivation to come back out and party.  I would highly recommend JAMM to anyone needing a DJ for their wedding ceremony/reception or any event!  Geoff - thanks again for all that you did!", "pics": null, "resp": null, "gmap_id": "0x88891764f5f60a81:0xe98ab25cc34c3d64"}
{"user_id": "116300831600957058864", "name": "Florida Consumer", "time": 1463005558452, "rating": 5.0, "text": "When my daughter got married, I pretty much just paid the bills, let her manage the process and stayed in the background. However, I did not do that with regards to finding a wedding disc jockey in the Birmingham, Alabama area.\n\nWhy?\n\nA lot of couples put a lot of energy into all of the other vendors that support a wedding, sometimes leaving the selection of the DJ until very late in the process when both time and money are short. That's a huge mistake because the disc jockey establishes the mood and tone of the wedding and the reception. Pick the wrong wedding DJ at the last minute and you'll be sorry.\n\nWhen I contacted Jamm Entertainment Services about my daughter's wedding they patiently answered all of my questions, recommended the right services, and delivered exactly what they promised - a smooth, perfectly orchestrated wedding service and reception with a consistently packed dance floor that we'll remember for the rest of our lives!\n\nI want to thank them in particular for their patience in answering all of our technical questions about the video and photo files we provided because they were a critical part of my daughter's wedding event.\n\nIf you're looking for the best Birmingham, Alabama disc jockeys, you'll be delighted with Jamm Entertainment Services just as I was.", "pics": null, "resp": null, "gmap_id": "0x88891764f5f60a81:0xe98ab25cc34c3d64"}
{"user_id": "118049290365692441657", "name": "Brandy Morris", "time": 1376673073418, "rating": 5.0, "text": "I'm an event planner in Birmingham, Al and it has been an absolute pleasure working with Jamm. From the start they're so great. They're prompt and professional and will provide the perfect ambiance for any space and music for guests. It's so hassle free which is awesome considering all the other details I have to worry about. All I have to do is share my vision and I know I can trust them to bring it to life. The dj's are fun to work with and I can't say enough about Becky Reese. Her willingness to go above and beyond is so refreshing. These guys are providing the latest and greatest in technology. If you're looking for that wow factor at your event...there's no question, this is who you want.", "pics": null, "resp": null, "gmap_id": "0x88891764f5f60a81:0xe98ab25cc34c3d64"}
{"user_id": "114411851329761752775", "name": "Pelham Morris", "time": 1521054618573, "rating": 5.0, "text": "Excellent event planning, combined with creative budgeting solutions and cutting-edge tech make JAMM ROCK!", "pics": null, "resp": null, "gmap_id": "0x88891764f5f60a81:0xe98ab25cc34c3d64"}
{"user_id": "101262182106173485699", "name": "Zachary Banks", "time": 1604150780527, "rating": 5.0, "text": "DJs are awesome!!!", "pics": null, "resp": null, "gmap_id": "0x88891764f5f60a81:0xe98ab25cc34c3d64"}
{"user_id": "100652289493775469372", "name": "Derek Hoffman", "time": 1575695627905, "rating": 5.0, "text": "Lindsay did karaoke at a Christmas party and was the bomb dot com. Whatever she’s paid... needs to be doubled", "pics": null, "resp": null, "gmap_id": "0x88891764f5f60a81:0xe98ab25cc34c3d64"}
{"user_id": "113073151865447294636", "name": "Collin Robinson", "time": 1629306452089, "rating": 5.0, "text": "So much fun! DJ Platinum had our entire wedding dancing for almost 2 hours. He played a very good mixture of popular and catchy songs for everyone to enjoy.\n\nOnce the playlists my wife and I sent him ran out, he seamlessly played his own mix and had a good time with it.\n\nBrian Robinson (not related) MCd and he was very professional and fun too!\n\nThe photo booth was a huge hit, and the pictures it printed were a nice touch. Plenty of friends and family left with 2 or 3 photos in their hands.\n\nI highly recommend Platinum Entertainment DJ to anyone in the Birmingham, AL area!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "112249180929930124797", "name": "Rolanda Hammond", "time": 1629563705755, "rating": 5.0, "text": "DJ Platinum provided great music and all around EXCELLENT service for my company's 2 day event! I highly recommend him for all of your functions!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113298567284197600786", "name": "kim russell", "time": 1626455603793, "rating": 5.0, "text": "DJ Platinum did a great job with our wedding! He turned our wedding reception into a huge party! I had a great time working with Platinum Entertainment. They are very professional and the online client site made it very easy to customize the music for my wedding.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "117169855353980590722", "name": "Teddy Rachel", "time": 1617038660219, "rating": 5.0, "text": "We had an absolutely great experience with platinum entertainment! We had DJ platinum and he was extremely professional and kind through out the entire process. The website was easy to use, they were very willing to help us in any way and the wed site and song list were easy to use. Sound quality was great, music selection was great. Couldn’t have wanted anything more, and one of the more affordable options as well. Lots of options for upgrades if you’d like such as photo booths, better lighting and personalized touches but we didn’t opt for those, I’m sure they would have been fun though.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "114123426787945851253", "name": "Alissa Maldonado", "time": 1627265760497, "rating": 5.0, "text": "The guests would not stop dancing the entire night! The band was above and beyond. They did a great job between balancing spanish music and today's top hits. 10/10 would recommend!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "106863722157897804259", "name": "Brandee Davis", "time": 1620917774567, "rating": 5.0, "text": "Excellent experience!! The smoke machine and sparklers were a great accent to our big day!! Very professional and everything was organized so perfectly! I would definitely recommend using this company for your special occasions", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "107319094291154570012", "name": "A S", "time": 1623772450750, "rating": 1.0, "text": "Hello!\n\nMy client and I were not pleased with the cloud effects and the lighting. I kept having to keep dimming the lights to actually see the lights on the ceiling, which is not what I was expecting. They were not the lights that I requested.\n\nI was never asked where I wanted the lights set up. Also, I was told that your employee could only run the cloud machine once and that is not what I paid for. I spoke with Andre the owner and he stated that he could not do it and I had a full camera crew on site for this event and it did not look well on cameras. I am really upset and feel like I was taken advantage of as a woman.\n\nThe owner eventually stated that he could do another cloud which did not last long at all.\n\nI did not feel like a client that the company cared about. I felt taken advantage of and let down considering that this was a major event for my client.\n\nI do feel like these issues need to be addressed.", "pics": null, "resp": {"time": 1623790101504, "text": "Hello Aleta,\n\nUnfortunately, the 3rd party person you booked us through did not explain the functions of the services you booked. They consulted us and told us that you needed dance floor lights and the dancing on the cloud. That is what your proposal was for and that is what was paid for and those are the services you received. If you needed the service multiple times then you would have to pay for the additional times.\n\nThere was never any contact from you until the day of the service. We spoke with the 3rd party you used to book the service, therefore, we cannot confirm what was agreed upon from those conversations between you and that person.\n\nDancing on the Cloud is a one time use cloud of smoke that is normally used for a first dance. It is not a multi-use service and it is what was requested and what was paid for. The dancing on the cloud lasts 2-3 minutes. That’s What we advertise on the website and that is what is written up on the client site by contract.\n\nDance Floor lights are moving head lights on truss stands that are Meant to shine on the dance floor. Also, with any lighting, it is not expected to have lights on in the room with lighting services. If you wanted Lighting for the entire room, WE would have advised you to go with uplights versus dance floor lights. We also would have advised 2 sets of uplights since the Boutwell Auditorium is a big venue. We never spoke with you, only your 3rd party booking person.\n\nIt was explained to you when you called the day of the event how the services work.\n\nMany of our clients are women. We do not take advantage of people. We simply provide the services requested of us. Unfortunately, you didn’t give us a chance to discuss prior to posting a 1 star review.\n\nThanks! Have a Great Day!"}, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100354024946965785625", "name": "Chelsea Ryles", "time": 1625689731798, "rating": 5.0, "text": "Our DJ was AMAZING . He made our night PERFECT. The music transitions were ON POINT .  He kept the crowd up all night at our wedding . We also used him for uplighting , a photo booth and dancing on the clouds for our first dance which the guest enjoyed . We could not have asked for a better company to use for our wedding . He is worth EVERY PENNY.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "114871775959483318296", "name": "Alyssa Angel", "time": 1599068730417, "rating": 5.0, "text": "These guys are amazing! They provided the Photo Booth for my event and it was a HUGE hit! All of our guests loved it. It takes beautiful, high quality pictures and makes everyone look like a million bucks! The team also helped me design a custom layout for my prints and digital downloads which was amazing. These guys are the real deal and some of the best money we spent at the wedding! Don't hesitate to book them! You won't regret it, and i say that with confidence!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "109941719816502000188", "name": "Harper Basquill", "time": 1613744791468, "rating": 5.0, "text": "We hired Platinum Entertainment for my daughters 13th birthday party and had the DJ and mirror photo booth and they exceeded our expectations! They stayed in touch leading up to our event, did an excellent job designing graphics for the photo booth print out pictures, and kept the kids dancing with the music they chose! The mirror photo booth was very popular with the kids and adults, highly recommend the mirror photo booth!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100803294590759815487", "name": "Jessie Hickey", "time": 1607303347568, "rating": 5.0, "text": "My husband and I got married on November 21, 2020 at Matthews Manor and DJ Platinum was our DJ! It was absolutely AMAZING! He checked in with us multiple times before the event, the night of was incredibly flexible, and overall made the night more enjoyable! He played the best music and listened to exactly what we wanted!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "117429410283577237991", "name": "Breonna Dunn", "time": 1617152025094, "rating": 3.0, "text": "Trevon was AMAZING! Ceremony music and dj’ing during reception was flawless. However, one of my sparkles during our grand entry and re-entry did not work. Also, the fog machine and monogram did not have the effect I expected.\n\nI would definitely hire Trevon though for future events.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "110387279282910657248", "name": "Breanna Culwell", "time": 1592277747849, "rating": 5.0, "text": "Absolutely incredible. I was super stressed about picking music right before the wedding they met with me, and as soon as we were done I was so confident in my music choices. He really knows how to read the crowd and get them involved and all out on the dance floor. Will definitely be hiring them for other events in the future, I could not have asked for a better DJ for our wedding. The photo booth was amazing. So many of my guests were taking about how great our DJ was not just at the reception but throughout the entire ceremony. If you are trying to find a DJ for your wedding, stop looking now, and hire platinum entertainment.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "115716368883465207896", "name": "Tracie Hughey", "time": 1613226864053, "rating": 5.0, "text": "What an amazingly postiive experience I had!!!  I can not say enough about how professional Platinum Events was through this entire process.  We had a high school dance.  From the beginning to the end, the experience was wonderful.  First was the immediate responses to all questions and communication.  The website was professionally and clearly laid out.  The \"ala carte\" choosing of the services they provide was so user friendly.  All communication was done by email so everything was clear for me.  I didn't rely on any  verbal committments, it was all recorded in emails.  The price...frankly I don't know.  I live by the motto you get what you pay for....I love capitalism.  And if I paid more than other services, I don't care....I got what I paid for....a wonderful experience.  Our services included a DJ, lights, sound system, and mirror photo booth.\nThe DJ set up was compact, high quality and the DJ screened the music for me...(i had enough on my plate).  Their website allowed my daughter to upload a spotify playlist easily and he screened it.  It also allowed a timeline that he respected and utilized..  The website has event planning section ......It was great.  I wish I was gifted at writing so I could paint a picture of what a wonderful experience but.....I had a wonderful experience and will recommend and utilize them a hundred times over!!!  We also utilized the Mirror Photo Booth...so fun.  Great props, assistance at it's side the entire time, easily usable, I am so glad I upgraded to this but I am sure the starter photo selection is great too but I am glad I upgraded to this one.  They designed a stamp for each of the photos customized to our event and they initiated that process and went with it without much of my involvement because I didn't have time.  The individuals who worked the event were dressed appropriately for the event, cordial, available, cooperative....I appreciated them handling EVERYTHING.  It made it worth every penny.\nMy ONLY suggestion would be to work with them on customizing your props for the event.  That was a shortcoming on my part not theirs.  Their props were great but looking back, I wish I had included some things that were directed toward this group of seniors.\nI can't thank them enough for working with us on providing these high school seniors a winter dance that had been cancelled by those around them twice who were more concerned about perceptions of participating in a \"super spreader event\".  They had a wonderful time, fantastic memories, and NO, we weren't a super spreader event.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "117900391247237689780", "name": "Anne Heaney", "time": 1605478332170, "rating": 5.0, "text": "Very professional! This team took such good care of my husband and I at our wedding and during the planning process, and made sure we had the perfect ceremony and reception! If you don’t want them to stray from playlist, I recommend telling them not to take requests, but just know you are in good hands with Platinum!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "104073717433578632420", "name": "summer perry", "time": 1597852167319, "rating": 5.0, "text": "Andre did such an amazing job providing the music for our wedding. He was very intuitive in playing songs that inspired our guests to dance and enjoy themselves! We also got the cold spark and dance floor light add ons and they were well worth it!! The cold sparks are SO AWESOME and surprised and delighted our guests during both our first dance and our wend off.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "107759013879817623292", "name": "Bethany Henry", "time": 1584712497566, "rating": 5.0, "text": "DJ Andre and his crew are truly the best in the business. The communication prior to the event, his professionalism during the event, and the overall execution was incredible and played a HUGE role in making our wedding day so fun and special. Andre did our ceremony and reception music and made everything flow so well with very little instruction from us...he didn’t miss a beat! His DJ booth, the uplighting, and his entire set-up look SO nice and professional! They add a very unique element that I wasn’t expecting, but was so happy with! DJ Andre played all the music that we requested, but also took guest requests and worked them in seamlessly to keep the overall vibe the same. And last but not least: they had a very sweet surprise for us and our guests at the end of the night that they had compiled throughout our day! I told everyone that night that Andre was not only one of our BEST vendors, but also one of the most affordable. You will not regret booking him for your wedding or special event!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "116430348420419770695", "name": "Chloe Harbison", "time": 1591489959536, "rating": 5.0, "text": "We booked Platinum Entertainment to DJ at our wedding- we spoke with Andre and explained to him what we wanted at our ceremony and how we would like our reception to be a big, fun celebration. Andre did not disappoint- everything was phenomenal!! Our wedding would not have been the same without them, I could not recommend them enough!\n\nVery professional and easy to work with!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "114180843333105291346", "name": "Billy Parker", "time": 1603391618480, "rating": 5.0, "text": "THE BEST DJ EVER!!!!! Highly recommend to anyone who is looking for a DJ you can trust to do an incredible job. Our reception was the best!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "104349675559494838490", "name": "JK Presnick", "time": 1568166982346, "rating": 5.0, "text": "DJ Platinum was SO much fun!!! I don't think there was one wedding guest not dancing & I had an afternoon/day wedding! The entire company and process with Platinum Entertainment went above and beyond to make my wedding planning as least stressful as possible. The website allows you to customize your day however you wanted with a \"do not play\" list, a \"play\" list, a wedding day timeline & so much more!! I even ~joked~ the day before my wedding & told my parents that I thought the only wedding vendor that did not stress me out yet was the DJ! The morning of the wedding we got a call from DJ Platinum telling us that they got a new photo booth & were wondering if we wanted to try it out for FREE!!! I am SO HAPPY we were able to have this at the wedding!! For any future brides, I would HIGHLY recommend using their photo booth because it was an absolute HIT!! I was able to have a link of every picture that was taken in the booth & it was one of my favorite things to look back at from the day of!! Looking back at my day, I would ABSOLUTELY \"splurge\" with the photo booth! I couldn't imagine my day without it. Thank you so much Platinum Entertainment!! All of my guests complimented the DJ days later!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113968821610841605818", "name": "Nicole Towns", "time": 1585181297627, "rating": 5.0, "text": "I used Platinum Ent for uplighting and a photo booth. I was blown away with their service. The uplighting really made the room pop with the green color. The photo booth was so much fun. My guests really enjoyed it and I had a lot of fun playing on it. The personal touches that was designed was beautiful. There were so many options. I would definitely recommend them for any event!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "117434750201721822021", "name": "Nia Richardson", "time": 1573003987400, "rating": 5.0, "text": "DJ Andre was absolutely the best! The communication was great, and the online customer portal made it easy to customize my packages. He played all the music that I wanted and new songs that I loved. The uplighting was phenomenal and it really completed the look. Plus, the Mirror Booth was a hit all night long. Booking Platinum Ent was the best decision, and affordable too.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113870332684016942162", "name": "Brittany Mosier", "time": 1530279037119, "rating": 5.0, "text": "DJ Platinum was SO AWESOME! He did our ceremony music and the reception for our wedding day and everything was perfect and exactly what we asked for. He responded quickly and efficiently to all my questions and had our wedding guests dancing the entire night! We loved our static monogram he created for us and it was exactly what we wanted! Our wedding guests still talk about how much fun he was and that the variety of music he played was fantastic! I could keep going on and on about him and how great the customer service was! Platinum Entertainment is a definite MUST for your wedding day DJ!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "108037293941024594767", "name": "Ojas Gokhale", "time": 1601267301982, "rating": 5.0, "text": "I have known DJ Platinum as a coworker and as a DJ. He is the most amazing DJ we have encountered at Wedding events and there are not enough words to describe his talent; he takes requests on the fly and blends them seamlessly into his routine and often can incorporate music out of the standard genre (His Bollywood music skills are now legendary among my Indian friends). He performed at two of our friends weddings and obviously, recently at my own wedding. He set up the mood for the perfect party; one that my wife and I had desired. Everyone danced right right until the end. The lights and speakers he got were nothing short of a nightclub in Vegas.\nHe is very easy to work with and has a very professional approach, including an online dedicated user portal, with a form to setup songs. I highly, highly recommend his services.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100594469079064428534", "name": "Dana Franklin", "time": 1560870055233, "rating": 5.0, "text": "Platinum Ent is the BEST to get all that you need to make your event sure to be a hit!  We used DJ Platinum Andre for our event lighting, mirror photo booth, dancing on the cloud, cold sparks, and more! Not only did the DJ really know how to turn up the party, and add beautiful special effects to our day, but the service was the ABSOLUTE BEST!!! Whenever we needed anything they were right there to help us!  I am big on service, so i the service is good I am highly likely to return and recommend your business! AND I HIGHLY RECOMMEND THERE SERVICES!!! Thanks again Platinum Entertainment!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "102337304870064166631", "name": "Jessica Upton", "time": 1545237562237, "rating": 5.0, "text": "Platinum Entertainment was excellent. They were easy to work with and everything was easy to set up. The music playlist can be set up through their website, which is super helpful. They also include must have songs and a \"don't play\" list. They took requests and made announcements throughout the ceremony as requested. Everyone at the wedding said it was the most fun wedding they'd been to - and a good bit of that experience can be attributed to the DJ  from Platinum Entertainment. They made our special day a lot more fun!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "109366621583925003259", "name": "Sebastian Eady", "time": 1556577104548, "rating": 5.0, "text": "DJ Platinum was awesome. He was very easy to contact and got back to us in a timely manner. His website is very straight forward where you could add a playlist to the website if needed. He played amazing music for all ages to enjoy!! He set up for the ceremony and reception and played the music according to the schedule. Overall great experience! Would recommend and use again to family and friends 100%. Thank you DJ Andre!!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "104052489346513726369", "name": "Justin Mathison", "time": 1564896088671, "rating": 5.0, "text": "Andre and his team were phenomenal. Everything from the lighting to the custom logos to the EMCEEING to the mirror photo booth and of course the music was amazing! My wife and I could not be anymore pleased. He was super communicative throughout the entire process and we had so many great comments about the services he had to offer. He even did things on the fly which really helped us out! Thank you Andre and the Platinum ent. Team!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "104005600110603854714", "name": "Kennedy Thomas", "time": 1526915571619, "rating": 5.0, "text": "I do not have enough good things to say about Andre. He was so easy to work with, got back with you quickly, and made sure he knew exactly what you wanted for your big day! I trusted him completely with the song choices & he did an awesome job. He was good at reading the crowd, playing a mixture of genres & songs that got everyone dancing at my reception. Also- his prices are INCREDIBLE! Really cannot go wrong with DJ Platinum!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "104694368420360464750", "name": "Tricia Tapley", "time": 1572640431812, "rating": 5.0, "text": "Andre with PlatinumEntertainment was awesome!!! Best DJ, lighting. Professional setup!! He kept all the guests dancing all night long. Such an easy person to work with. Highly recommended him for any of their services. His online setup of your timeline, music playlist and do not play, etc was so easy to do. He is so much fun and fantastic to work with!!! Thanks for a wonderful wedding party for our daughter.!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "109668712452647258076", "name": "sarah stephens", "time": 1514765879878, "rating": 5.0, "text": "Platinum Entertaining DJ went above and beyond at our wedding reception!!! He kept the party going for 5 hours!! The dance floor was full for a solid 4 hours. During the planning process Andre addressed all of my questions within the same day. He was so easy to work with and made me feel confident that we’d have a fun wedding. He played all of our songs as requested and ended the songs where I wanted them to end (we did partial songs during the father/daughter mother/son dance). He did cues for different parts of the reception (toasts, send off, etc). Everyone commented that they had the best time and it was largely because of the music choices! I’m so beyond thankful for Platinum Entertaining, they did a fantastic job!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "107682899931534867598", "name": "Stacey Green", "time": 1572443253446, "rating": 5.0, "text": "I rented the photo mirror for our employee banquet.  It was a huge hit.  Everyone loved the pictures.  We really enjoyed using the props and the guy who managed it was great.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "108828007058460682094", "name": "Keisha B.", "time": 1507817317932, "rating": 5.0, "text": "One word: AMAZING!!! My wedding reception was on Saturday, October 7, 2017 in Huntsville, AL. I think on Tuesday evening, I decided I wanted a photo booth and so the search began. During my search, I ran across Platinum Ent Dj's website. They offer a Mirror Booth rental. BEST THING EVER!!! What I loved about the website was that you could instantly find out if the booth was available for your event and how much it would cost. I also was very happy that this company was willing to travel to Huntsville, approximately 1.5hrs away from Birmingham, for my event.\n\nFrom the very beginning, Andre was courteous and professional.  This company definitely understands customer service and it shows! They provided an easy and convenient method to pay for the services online which I appreciated. They also showed up early to the event just to make sure everything was in its proper place.\n\nThe mirror booth was a real hit with my guests. Everyone absolutely loved it! Based on my experience, I highly recommend this company to anyone looking for quality service and a stress-free event. This company literally exceeded all my expectations.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "111222103569986688517", "name": "Amy Davidson", "time": 1545539748354, "rating": 5.0, "text": "DJ Andre was a fantastic DJ for our daughter’s wedding reception! He kept the party going for 4 hours and was so easy to work with. We would definitely recommend him for any event.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100791531187314044988", "name": "Mary Cowan", "time": 1573601419949, "rating": 5.0, "text": "DJ Platinum and his crew were amazing! Very professional and read the crowd very well! Everyone can’t stop talking about how much fun the wedding was! The up lighting is a MUST! 10/10!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "116725622801658922648", "name": "Sheriah Gibson", "time": 1535643301211, "rating": 5.0, "text": "Awesome to work with! As an event planner, Andre made my job easy but his timeliness and making sure I was fully aware of their needs to execute the event and keep our clients pleased. He was great to work with and I look forward to booking him again soon! Thank you!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "114729532607714712505", "name": "Ivy Patterson", "time": 1550692243117, "rating": 5.0, "text": "“We had a great experience with DJ Platinum. We were ambivalent about getting a good DJ because we wanted to avoid the corny vibe we’ve seen so much at school dances, but Andre was down to the earth, played great music, was totally accommodating to our students, and created an incredible soundtrack for our night! He was also perfect with timing and setting everything up before the dance started.  Plus, he adjusted his songs to the vibe of the party which was awesome. It was great to have DJ Platinum along with his lovely wife Kia.  It was just great to have someone so attuned to what we wanted. This DJ company is super professional and reliable and communication was wonderful and clear throughout. Thank you again Andre and Kia for sound-tracking such a wonderful night!”", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113655657374020030186", "name": "Ashley Harris", "time": 1528937037196, "rating": 5.0, "text": "Andre was super responsive as we were planning for our wedding on June 9th. He even put together a last minute mix for the father Daughter dance! Price was absolutely reasonable and the Photo Mirror is a must!! Would definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "101450557188396234990", "name": "Brittney Jones", "time": 1574700466310, "rating": 5.0, "text": "Amazing and professional company, they are the best and made both of events successful! I can't wait to use them again.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "108846228832747243457", "name": "Miranda Carroll", "time": 1564861866296, "rating": 5.0, "text": "I absolutely loved the photo booth at a recent Wedding I attended. It Captures all of your personal&funniest experiences, and memories😍🥂🍾💕 I highly recommend this for your next Event⭐⭐⭐⭐⭐", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "110118678117047180824", "name": "Britnee Wellman", "time": 1472163471807, "rating": 5.0, "text": "DJ Platinum was wonderful! He is a lot of fun, but still very professional. Our guests really enjoyed the variety of music he played and had a great time. The lighting looked great and he created our monogram for the dance floor. Two thumbs up!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "112214976698345966961", "name": "Dedric & Tonja Brown", "time": 1471908884250, "rating": 5.0, "text": "Dj Platinum did our wedding and he was the best...the lighting was every thing, the monogram was so beautiful, and the music was non stop and perfect. He is very professional and i would definitely recommend his services and use him again for another event!!!! Thanks for making our day rememberable!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100746457071490072436", "name": "Jessica Whiteside", "time": 1471913836864, "rating": 5.0, "text": "Dj platinum was EXCELLENT, He kept the crowd dancing. The lighting was beautiful. I can't wait to book him for our next event. He made sure our wedding and reception was perfect.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "117934201291551973330", "name": "Courtney Harris", "time": 1572540131534, "rating": 5.0, "text": "Trevon Dj Too Kold was awesome! I would recommend his services to anyone! He made our wedding so much fun!! He also was the most affordable DJ I could find in the Birmingham area. I would 10/10 hire him again for his DJ services!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "102613210394200483698", "name": "Courtney Harris", "time": 1571687405252, "rating": 5.0, "text": "Words can’t express how great and excellent the service was. From the lightning, to the photo booth, dancing on the cloud and to the cold sparkler machines everything was outstanding! I would recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "115082803796772890675", "name": "LaToya Smith", "time": 1471970381915, "rating": 5.0, "text": "I worked with  DJ Platinum on my husband's birthday party. I highly recommend his services.  He was both professional and affordable.  DJ Platinum is equipped to handle any size event.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100545746874245003561", "name": "Jessica Spence", "time": 1471890670144, "rating": 5.0, "text": "DJ Platinum did an amazing job at our wedding reception this past weekend. We received so many compliments about him from our family and friends. He definitely kept the party going! We would definitely recommend him to any future bride and grooms.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "109416864469229461793", "name": "Sheriah Gibson", "time": 1563904932324, "rating": 5.0, "text": "Great services! Andre and his team consistently provide our clients with the best products and quality around.\n\nThank you! - Posh Occasions by Sheriah, LLC.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "110901168465064379653", "name": "Crystal Duco", "time": 1524846103468, "rating": 5.0, "text": "The photo mirror was a huge hit at our wedding!  They were so nice and easy to work with!  One of the best decisions!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "107703260186863613755", "name": "Sametra Moore", "time": 1520631663057, "rating": 5.0, "text": "I would like to thank DJ Andre for providing an excellent service for my husband 50th surprise birthday party.  He kept my guest dancing the entire time. I highly recommend this DJ.\n\nThank you for your service.\n\nMrs. Moore", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "105949058196141856797", "name": "Shenita Counts", "time": 1527303841968, "rating": 5.0, "text": "I normally don’t write reviews but in this case I made an exception. In the words of my daughter, The DJ was “Lit”!! They were very professional and on time. The teenagers and I loved the music selections, the photo booth and all the up lighting. A+ service!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100168393196667353272", "name": "Gabriele Watts", "time": 1517157251615, "rating": 5.0, "text": "Can’t rave about this company enough!!! They kept us on the dance floor all night. The lighting was spectacular and the videography was stunning when we saw the final product! Book them!!! You will not regret it!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "102859119436773104114", "name": "Devon Reid", "time": 1489272326994, "rating": 5.0, "text": "DJ platinum provided a variety of music for our wedding. It turned from a wedding, to a blast of a party! Lol", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "112956952818301526246", "name": "Megan Harris", "time": 1533235747058, "rating": 5.0, "text": "DJ Platinum went above and beyond for my wedding! I loved everything. I definitely will be using him again.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "116918423622048680461", "name": "Tederick Withers", "time": 1555446355108, "rating": 5.0, "text": "We really enjoyed everything and the staff was very nice and professional we appreciate everything and we'll be contacting again for our next event", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "114577347903861311162", "name": "Memendra Page", "time": 1514667595570, "rating": 5.0, "text": "Awesome service... He was superb..he is a one stop shop.. This is the company you want to book to make everything a sucees", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "108724413625585668858", "name": "Rodrigus Cannon", "time": 1506623834229, "rating": 5.0, "text": "I really like the his professionalism! All the music was clean and had great sound quality.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "118106607360427909912", "name": "Tee Williams", "time": 1472135049252, "rating": 5.0, "text": "He's great for whatever event you plan. DJ Platinum did a great job at the reception everyone enjoyed the music.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "109763122864866866986", "name": "Curtia Moon", "time": 1491332921215, "rating": 5.0, "text": "DJ Platinum is ALWAYS my first choice for a wedding Dj referral to my couples.  He is prompt, has a great attention to detail, and keeps the party jumping.  He is a pleasure to work with.\n\nCurtia Moon\nMXK Events & Weddings", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113617161010399176527", "name": "Nachica Thomas", "time": 1471905302355, "rating": 5.0, "text": "Best DJ around and the lighting system is AWESOME!!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "102303802693490892612", "name": "Tory Moody", "time": 1474317505402, "rating": 5.0, "text": "Dj Platinum was there for us from the beginning to the big day on our wedding day! The area we were having our wedding at was pretty much a cell phone dead zone, but Dj Platinum thought that out and gave us a form list to send him with sections to write in what songs we wanted; once that got back to him he created the playlist and took care of the rest. He made everything simple and more important for me and my bride he made it affordable; definitely, definitely, would recommend him to anyone I know who has a wedding coming up or even a party and a needs a Dj who is professional and is kind on their wedding budget! For the package we asked for Do Platinum definitely exceeded our expectations; of course besides providing great music he provided lights to help provide the right atmosphere to our reception, and his travel fee was definitely kind on our wallet. When the wedding was over and we went to the reception hall and walk through the doors DJ platinum had a very great set up waiting for us; what stood out most to us was the fact that the lights he used lit up the walls and ceiling with me and my wife's favorite colors of red and purple, both us and the guess we're blown away! A great time was definitely had by all, and none of that would have been possible without the professional help of Do Platinum!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113652179523908315793", "name": "Christopher Thornton Sr", "time": 1545239420986, "rating": 5.0, "text": "Andre and Kia were very responsive to our last second requests and odd requirements of our over 40 group Christmas Party (60 guests).", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113544257508887224233", "name": "Lashonda Calloway", "time": 1531747106429, "rating": 5.0, "text": "Awesome, professional, everything for my wedding was beautiful!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "112365238420445973108", "name": "Daren Turner", "time": 1570335312950, "rating": 5.0, "text": "Awesome service and music!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "103445300453480876864", "name": "Amanda Hickman", "time": 1619582942142, "rating": 5.0, "text": "From he time I first spoke to him he was very personable and helpful. He answered every phone call helped me out from the time I hired him until the wedding was over he was there for me. I most definitely recommend Jeff and Timothy their amazing and down to earth.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "113059907300348675839", "name": "Wendy Miller", "time": 1622478051500, "rating": 5.0, "text": "Great job today with music and sound system at our Memorial Day ceremony. Your professionalism is 5 star!!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "106046820848664602419", "name": "Thomas Byrd", "time": 1620252444143, "rating": 5.0, "text": "Music Man Productions provides the best live sound and DJ services in the Wiregrass. He was able to work with me to come up with a package/price that was perfect for our event. Will be using again!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "105984295892714510125", "name": "Angelina Kitts", "time": 1623563534373, "rating": 5.0, "text": "Jeff was so professional and sweet and just wonderful!! He made the day perfect and I would absolutely recommend him!!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "116748653853346189234", "name": "Andy Sibley", "time": 1610137692679, "rating": 5.0, "text": "Jeff and his team did a great job. Very professionally and easy to work with. I highly recommend to hire them for all of your sound needs.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "108594849853367810529", "name": "Karen Golden", "time": 1584387456905, "rating": 5.0, "text": "Jeff Strickland is simply the best in his field. I am a gospel singer and I like to take Jeff with me when I sing at different churches. He is totally professional. He knows exactly how to blend my music and also is very easy to work with. He listens to what you want and works with you to fine tune the sound. I would highly recommend Jeff for church services, for soloists of all genres,\nweddings, reunions, parties or any and all kinds of music. Jeff is also extremely dependable!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "103784772270702534144", "name": "Headland Area Chamber of Commerce", "time": 1585336989530, "rating": 5.0, "text": "Jeff and his crew always show up early and stay with us until the job is beyond done. He provides professional, quality sound and has become part of the team for the Headland Area Chamber of Commerce. Great service and has a big heart.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "104239653481270127059", "name": "Brenda Fulford", "time": 1584312785949, "rating": 5.0, "text": "If you need music for an event of any kind Jeff Strickland is the man to call.  He has great equipment,  lights and  the type of music you prefer.  He is professional and has reasonable pricing. Always a great experience.\n\nTed and Brenda", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "101805305790946548798", "name": "Tammy Martin", "time": 1583970486184, "rating": 5.0, "text": "Have hired the Musicman several times and he is always very professional. He offers music for all occasions. Dancing and Karaoke. I give him 5 stars.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "104168710113112894887", "name": "Ronnie Bush", "time": 1584317714489, "rating": 5.0, "text": "He is very professional and knowledgeable about music and equipment. I have led  the music at church for over 35 years and our sound has never been this good.I don't know what I would do without him", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "107687923502063312996", "name": "Melvin Williams", "time": 1569640541959, "rating": 5.0, "text": "Top notch sound and lights.Great equipment,and always a great mix.Great guys to work with.He's got my vote!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "107713093748506115468", "name": "chris wortz", "time": 1583949889032, "rating": 5.0, "text": "Great equipment,  great personality,  he does a great job!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "112947858006965496584", "name": "Donnia Rambin", "time": 1583940843929, "rating": 5.0, "text": "Jeff is very professional. He does a great job and is a delight to work with.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "112100372596557505411", "name": "Shane Corbin", "time": 1568846456888, "rating": 5.0, "text": "Was very personable, we had a great time with the music selection.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "110759091560651205262", "name": "Una Taylor", "time": 1569088588845, "rating": 5.0, "text": "A Joy!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "107409750187919429024", "name": "Sherry Watkins", "time": 1514591787115, "rating": 5.0, "text": "Great Christmas Musical Light Show! It gets better every year!", "pics": null, "resp": null, "gmap_id": "0x888c3c0ee458276d:0x7aab8beb65466226"}
{"user_id": "107013364765854681116", "name": "Shannon Geer", "time": 1514174301790, "rating": 5.0, "text": "Awesome addition to your Christmas show with adding the Christmas trees.", "pics": null, "resp": null, "gmap_id": "0x888c3c0ee458276d:0x7aab8beb65466226"}
{"user_id": "110470644388765400128", "name": "Nicole Musa", "time": 1583866400338, "rating": 5.0, "text": "Great Christmas show", "pics": null, "resp": null, "gmap_id": "0x888c3c0ee458276d:0x7aab8beb65466226"}
{"user_id": "101935565539460285684", "name": "Melissa Bowie", "time": 1622996757881, "rating": 5.0, "text": "Amazing people. Very nice. Will absolutely use this place again", "pics": null, "resp": {"time": 1623008718368, "text": "Thank you! We enjoyed celebrating with you and your family."}, "gmap_id": "0x888c297c998b4b73:0x39741018cb9591a8"}
{"user_id": "100704184443069560314", "name": "Gwen Ross", "time": 1625247640501, "rating": 1.0, "text": "The owners they just hung around the female owner cutting the lights off, cut on the lights she want on some little stroll lights like it was her baby shower going in the kitchen check things it was horrible I recommend no one to rent this place unless you want the owner to run your event!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888c297c998b4b73:0x39741018cb9591a8"}
{"user_id": "107116227627708265939", "name": "Pink Pap", "time": 1602696434428, "rating": 5.0, "text": "Awesome event planners!!   Ms. Katrina did an excellent job helping planned a baby shower.  When she stated”I will take care of everything” she did exactly that.  Everything I asked for and more was provided.  She and her husband, El were professional and responded to my calls and texts in a timely manner.  The food presentation was nice and the decorations were beautiful and was everything I asked for and more. A big shout out to the decorator, Ms Wanda Rogers, you went beyond my expectations.  I definitely recommend Mr &Ms Erby’s place for an event and their event planning services.  Thank you so much for making our event special!!", "pics": null, "resp": {"time": 1602704965241, "text": "It was our pleasure to serve you and your family. We look forward to future events.\n\nThank you,\n\nEl and Katrina"}, "gmap_id": "0x888c297c998b4b73:0x39741018cb9591a8"}
{"user_id": "107288914022869018026", "name": "Alexander Lee", "time": 1611081385290, "rating": 5.0, "text": "Wonderful venue for host your small to medium size event with built in entertainment", "pics": null, "resp": {"time": 1612668629286, "text": "Thank you for trusting us with your family evets."}, "gmap_id": "0x888c297c998b4b73:0x39741018cb9591a8"}
{"user_id": "104403541285589949906", "name": "Marilyn Ellis", "time": 1526770901499, "rating": 5.0, "text": "The environment was peaceful and the setting was great. I had an excellent time.", "pics": null, "resp": {"time": 1526804805740, "text": "Thank you, please visit again."}, "gmap_id": "0x888c297c998b4b73:0x39741018cb9591a8"}
{"user_id": "113712911923352895720", "name": "Shenika Williams", "time": 1515123437792, "rating": 5.0, "text": "Nice space ! Clean..small dance floor.", "pics": null, "resp": {"time": 1515602763000, "text": "Thank you for your review. I'll work on the dance floor."}, "gmap_id": "0x888c297c998b4b73:0x39741018cb9591a8"}
{"user_id": "102632774999082811768", "name": "Patrick Lindsey", "time": 1531527200850, "rating": 5.0, "text": "Super friendly and professional!", "pics": null, "resp": {"time": 1531540148613, "text": "Thank you very much!"}, "gmap_id": "0x888c297c998b4b73:0x39741018cb9591a8"}
{"user_id": "113579476173578450098", "name": "Niamh Hunt", "time": 1527086822359, "rating": 5.0, "text": "i love u", "pics": null, "resp": {"time": 1623008765907, "text": "Thank you"}, "gmap_id": "0x888c297c998b4b73:0x39741018cb9591a8"}
{"user_id": "112317126159442378371", "name": "Alyn Boyer", "time": 1625058697421, "rating": 5.0, "text": "I thought Seth and his team were awesome. Very professional...on time... great music and the photo booth was also fun!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "113753545530393532120", "name": "Daniel Westfall", "time": 1605733303295, "rating": 5.0, "text": "Overall great experience! Great communication leading up to and after the event, nice music selection, and a DJ that read the crowd well. They offer other services as well - including a cool photo booth. Would recommend.", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "115555951684107550038", "name": "Madison Poole", "time": 1605705519393, "rating": 5.0, "text": "Such amazing / professional people to work with! The communication before and during the wedding was phenomenal! If you’re looking for a fun DJ, you’re looking at the right place!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "117907838586655513299", "name": "Shoals Diversity Center", "time": 1532370451903, "rating": 5.0, "text": "Reasonable prices, complete efficiency and superb communication.  We will never have another event without Fine Era!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP7iaTFsT1x_aTXxvqNE8y5qNSasAwBre9oRwIZ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "102236065462838998956", "name": "Sara Moseley", "time": 1573511665772, "rating": 5.0, "text": "Great for Wedding Rentals and as a DJ!\nSeth and his team at Fine Era were responsive to communications, prompt, efficient, accommodating with the venue location, and offered an extensive menu of services at very reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "105734223164660320772", "name": "Michael Henderson", "time": 1561505291974, "rating": 5.0, "text": "Absolutely professional. Top shelf production, will definitely hire again!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "105020868738915951523", "name": "Leella Holt", "time": 1447336717234, "rating": 5.0, "text": "Seth at Fine Era Productions provides a wonderful experience for high school dances.  The music has already been \"scrubbed\" and is suitable for school venues.  Seth is prompt and dependable.  Fine Era Productions provides services in such a manner that school sponsors do not have to be concerned about the outcome!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "110383955445711650681", "name": "Erin Gray", "time": 1438881269749, "rating": 5.0, "text": "Last year, our school had to find a new DJ. Seth and Fine Era Productions really came in to save the day! Not only are they fantastic at their job but they are really great people to work with. We used their DJ services that included up-lights as well as their bistro lighting. The event was a major success and looked amazing. The music is current and they know how to get the crowd going. I can not recommend Fine Era Productions enough! I've already reserved them for this year and can not wait to work with them again!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "110895378820813791615", "name": "Christina Turberville", "time": 1621888783585, "rating": 5.0, "text": "Shoals Event Specialist recently supplied us with tables and chairs for our prom at Muscle Shoals High School.  They did a great job and were very professional and followed through with all of our needs and details.  Thank you for taking such good care of our needs!", "pics": null, "resp": {"time": 1621889813877, "text": "Thanks Christina!! Y’all were great to work with and we look forward to working with you in the future!"}, "gmap_id": "0x887d49893b312427:0xea2a3927ca8504e1"}
{"user_id": "117637430881900342712", "name": "Alexis Humphrey", "time": 1571429719243, "rating": 5.0, "text": "AAAAAhhhhhmazing!!!! Sam and Lamarcus knew what to do when to do it. The music was perfect for every part of my wedding. Easy to communicate with and very responsive with email, text, & call. I will diffidently rehire for later events!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOJ3q7adUr6DnnlYlO-ZHx8AWadcMaICNjQ1v3y=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNItyGvOngBsQkY6cgSica-hYhRs2ua08Cus6ja=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipObtqFEzszQDQt6oAFqR8y0YGq6TPUU9nVb_UPY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP0K5EyxrcWenvEU_vE4aPkinaL9gLYImhvOkhe=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNmAzcv0kvOSvBke8Jg3aOomVEFnox_pKuFnE_t=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d49893b312427:0xea2a3927ca8504e1"}
{"user_id": "112171893527173085919", "name": "Deonna Mullins", "time": 1603074269566, "rating": 5.0, "text": "Shoals Event Specialists served us for an outdoor baby shower recently. They did an excellent job! Sam responded within a few minutes each time I reached out! They worked with me to figure out exactly what I needed. Their prices and services are the best! I highly recommend them for all your event needs!", "pics": null, "resp": {"time": 1603074917211, "text": "(Translated by Google) Thanks Deonna!\n\n(Original)\nThanks Deonna!"}, "gmap_id": "0x887d49893b312427:0xea2a3927ca8504e1"}
{"user_id": "115772651178362935970", "name": "Alyssa Nelson", "time": 1609084275676, "rating": 5.0, "text": "Very professional. Love every thing they do. You should consider them at your next event.", "pics": null, "resp": {"time": 1609084919909, "text": "Thanks!"}, "gmap_id": "0x887d49893b312427:0xea2a3927ca8504e1"}
{"user_id": "104477228560481877922", "name": "Zach Blenkinsopp", "time": 1605027695375, "rating": 5.0, "text": "Talk about a great company to work with.  Thanks a lot for everything and I look forward to having a long standing relationship with you guys!", "pics": null, "resp": {"time": 1609084933424, "text": "Thanks Zach!"}, "gmap_id": "0x887d49893b312427:0xea2a3927ca8504e1"}
{"user_id": "113493429067837845274", "name": "Susan G", "time": 1601349492211, "rating": 5.0, "text": "We rented a tent, tables, chairs and a bar through Shoals Event Specialists this past  weekend.  The price and service were excellent!", "pics": null, "resp": {"time": 1601679473245, "text": "Thanks Susan! We had a great time and are so happy yall trusted us to handle all of these services."}, "gmap_id": "0x887d49893b312427:0xea2a3927ca8504e1"}
{"user_id": "109029183188981188136", "name": "Ruby Page", "time": 1582135222728, "rating": 5.0, "text": "I hosted a couples wedding shower and planned on around 20 to 25 people. Around 3 in the afternoon on Saturday the day before the shower which was on Sunday. I realized I had totally forgotten about tables and chairs.\n\nI messaged Shoals Event Specialist with my fingers crossed that someone would be available to help since almost all of the other party rental places were closed on the weekend and with it being such short notice, I wasn't holding my breath.\n\nNot only did they answer, but they were very pleasant and helped me figure out how many tables and chairs I would need and delivered everything and picked it all back up after the party.\n\nShoals Event Specialist truly saved the day!", "pics": null, "resp": {"time": 1582139260020, "text": "Thank you for the great review Blair! It was great meeting you and your family!"}, "gmap_id": "0x887d49893b312427:0xea2a3927ca8504e1"}
{"user_id": "105175791429229252424", "name": "Amber Edwards", "time": 1577858445080, "rating": 5.0, "text": "I hired them as the DJ for my Wedding two weeks ago and the did not disappoint. The did set up their systems on time and every music they played was wonderful.", "pics": null, "resp": {"time": 1577975708239, "text": "Thanks for the great review Amber! We love getting feedback from satisfied customers."}, "gmap_id": "0x887d49893b312427:0xea2a3927ca8504e1"}
{"user_id": "108979727823482587452", "name": "Bentley Sharp", "time": 1559651677344, "rating": 5.0, "text": "These guys did a dance for my sons school. He loved it and told me how nice it was. I will definitely use them for my next event.", "pics": null, "resp": {"time": 1559654094717, "text": "Thanks Bentley!"}, "gmap_id": "0x887d49893b312427:0xea2a3927ca8504e1"}
{"user_id": "108522694157633721121", "name": "Ace Eaton", "time": 1557927952597, "rating": 5.0, "text": "Very professional and fun to work with. I’ve enjoyed my experience working with the guys at Shoals Event Specialists. I highly recommend them for all your DJ needs and venue needs for weddings like tents, tables, and chairs.", "pics": null, "resp": {"time": 1559653761711, "text": "Thanks Ace!"}, "gmap_id": "0x887d49893b312427:0xea2a3927ca8504e1"}
{"user_id": "105015568210457166251", "name": "Nick Highfield", "time": 1559666147143, "rating": 5.0, "text": "I definitely give these boys a five star rating. But don't let this distract you from the the fact that in 1966, Al Bundy scored four touchdowns in a single game while playing for the Polk High School Panthers in the 1966 city championship game versus Andrew Johnson High School, including the game-winning touchdown in the final seconds against his old nemesis, Bubba \"Spare Tire\" Dixon.", "pics": null, "resp": null, "gmap_id": "0x887d49893b312427:0xea2a3927ca8504e1"}
{"user_id": "111337447583860548252", "name": "Dustin Coan", "time": 1600210962609, "rating": 5.0, "text": "Very knowledgeable staff who will assist you with rentals for tables, chairs, and linens, staging, lighting, sound re-enforcement, and more!", "pics": null, "resp": {"time": 1547261576517, "text": "Thank you!"}, "gmap_id": "0x887d49893b312427:0xea2a3927ca8504e1"}
{"user_id": "116493956751397842435", "name": "Thomas Lindsey", "time": 1559762330987, "rating": 5.0, "text": "The party yall DJ'ed that I was at was awesome! Yall did a great job!", "pics": null, "resp": null, "gmap_id": "0x887d49893b312427:0xea2a3927ca8504e1"}
{"user_id": "107418793155452983556", "name": "Andrew Parker", "time": 1559661090419, "rating": 5.0, "text": "these boys played at a Halloween party. They kept playing that fire, and I couldn’t stop dancing.", "pics": null, "resp": {"time": 1559663787649, "text": "Thanks Andrew!"}, "gmap_id": "0x887d49893b312427:0xea2a3927ca8504e1"}
{"user_id": "100389098859269266755", "name": "ellen todd", "time": 1617631009918, "rating": 5.0, "text": "Brandon, just wanted to thank you for your fabulous service at my daughter’s wedding. You are such a professional and clearly love what you do! So many of our guests commented on your energy, passion, and gift of creating a fun atmosphere. Sarah and James had the MOST special day, and you played a role in that. I am happy to recommend you to anyone.\nThanks again,\nEllen Todd", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "107950379938175492195", "name": "Jesica Moore", "time": 1598831633247, "rating": 5.0, "text": "High Energy and Simply Amazing! Brandon keeps everyone on the dance floor and he even got out and busted some moves - Brandon was a wonderful emcee too! His dj skills and song choices were on point! He was able to engage all ages with his \"hosting\" and kept our wedding reception party going! Very smooth/hip and not cheesy at all (we have all encountered those in our lives)! Not to mention, our \"photo booth\" was so fun for all the guests and very modern/sleek design. We loved our photos from these candid shots - they were hilarious and captured the true spirit of the night! They surprised us with a photo book of all our guests' photos as well - which I LOVE! Brandon is hands down the BEST!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN1iBCNg1Oc8Pv9MsoeIPQ_oxLasJPaMz04eZm5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNdJxm9bv5R0_1MW8jPhqDOiLTGC5dTtGWmMW0N=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPuKVgPe4Z6Vj7ScoiDb_cgr0DPHmOaF_A4Ey9w=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNZsSbUVn88lc32BjS6Fu_hfrMJ4Hb7QsxDG725=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOaOR7K-ZcaPm99nKqPnWd4bLl9WewQQHsVbcIu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNXbJ5eR7xEFQnViplzLo4FjB0e38SPx4xVOscx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNqocsx6GaLgk1_3SgfPEAxI6hTtVMVVMNEhzBu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPq3TmXma8jAtbbBErNtQV1HWvYOBp25UJE8125=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOSHXCa-frfBuEq6QBdjUvAMwHhqepXtSZTZ1Jj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMc340fweicfOi1LbJ-aLh0C5JQUwUxdu2A9bgk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "100400079868832203022", "name": "Ashlynn Bowman", "time": 1618840973109, "rating": 5.0, "text": "Wow! I don't have enough great words to share about how much fun Ryan Jones at WellDunn Entertainment was at our wedding. He played great music for all age groups to dance too, he knew exactly where to be and when to be there making the experience for the Bride and Groom stress free. If I could do it over again, I wouldn't because the first time was so great with Ryan!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "102484149622551425761", "name": "Shelly Roark", "time": 1623103870375, "rating": 5.0, "text": "DJ Mason was amazing! He provided professional service and upbeat songs on our playlist that really kept the crowd going! He was very intentional to go over his timeline with us and double check all song requests. He made sure that we were comfortable and on the same page before coming to our reception.  That meant the world to us! We would highly recommend DJ Mason and Welldunn Entertainment to anyone needing dj services!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "110026042433832861857", "name": "Megan Hays", "time": 1605203868364, "rating": 5.0, "text": "I can not say enough great things about WellDunn Entertainment!! We hired Brandon Dunn as our DJ for both our ceremony and the reception after I saw his services first hand at my best friend's wedding a couple of years ago. We were blown away by how awesome he was! And then our wedding planner (Becky's Brides) recommended him as well, so of course we immediately knew we had to hire him. Needless to say, best. choice. ever!! I have been to weddings with DJs who are not as awesome as Brandon, and you never realize how important the DJ is for the overall vibe and energy of the party until you hear a bad one - haha. Those experiences made me even more thankful that we went with WellDunn because it made all of the difference in the energy of our wedding! Everyone was talking about how awesome Brandon was. He is simply fun and a joy to work with. He is also a genuinely good guy and I can't imagine what our wedding would have been like without him. I was a COVID bride and I was all the more thankful for his empathy and flexibility when we had to postpone our wedding to October. I have to say it was all worth the wait! The highlight of the night was when Brandon let me take over the DJing and the crowd went wild!! Those are some of my favorite pictures from the entire night. Thank you for making our special day and night SO much fun. Everyone kept saying it was the most fun wedding they had ever been to!! <3", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMc3IU8Zy12-1E1wBNDiGLuH5Sxd9-hWT_cT97L=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPJ1LVZe_pWhuliyrm3ha4HD17SM913vPoHzyKE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNxPYiScECL1H0EwEHmYuwkemhWYmURIDYqRYzI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNKonct0CQze6yqFUwRujjUMjDhk_6ybaPIG_fL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMZSOJxKjpxIX_Hmsqk2lUFXpe8DsayDZT2Lu-Q=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPFrdyEcFgUaaawqOw8DEuMF5NpGh4eBmL8sEkr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMFIeyJGUFrvQsjrGYx_Sz4vKsFQhWcAwg5Xk4i=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "114746704886551957564", "name": "Kristen Morrison", "time": 1609440447822, "rating": 5.0, "text": "Dj Well Dunn exceeded our wedding expectations! He kept the dance floor full all night and we had so much fun because of him. I can’t recommend him enough! We did the photo booth as well and it was perfect! He made the planning part easy and was responsive to all my questions and concerns. I cannot recommend him enough!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "112109486022123109893", "name": "Shelley Garson", "time": 1579645293774, "rating": 5.0, "text": "HIRE BRANDON ASAP IF YOU WANT PEOPLE ON THE DANCE FLOOR! He's genuinely the nicest guy and listens to all your requests! We gave him more \"dont play this or that\" and he crafted the best music for us!! Thank you Brandon for making our wedding SO fun!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP8i-43lcQqae990j3t6q2TYoxCxHh-uql6a0w6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPD7xd9Ik_1FAZqbhdTe5Z-jsGPQzQQbw7v2xJS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMtnpQNXxFdzkfX5-K7UeCu_pLHu6wrdWGo-vv9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNRVQoWOhlFtuWNTxzG-0RQRzF0oiniysN7BNQ0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM7bYQae95CKx-5oo8n0oohI5hQI6CTo_fuhRk_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOxONmFzgj5XKYwfJae49qixR4DCRoQKHQPZKg3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPbyCwHChs_khOYKaWIZGxOjplcV4ZvIrZBxsW9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPLMJtfz07HvhqVWYxNVDD4Zn1qkKSEydwkbici=w150-h150-k-no-p"]}], "resp": {"time": 1579650354475, "text": "Thank you so much Shelley!! Your wedding reception was so much fun. We appreciate you trusting us as your D.J. company"}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "117517858819757503316", "name": "Amanda Curvin", "time": 1604600826562, "rating": 5.0, "text": "Brandon was an amazing DJ! He and the whole team at WellDunn were so wonderful, and Brandon made all the difference at the reception. Brandon worked with us to customize our music selections, and he kept the flow and energy up throughout the reception. Truly awesome experience, and I highly recommend him!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "116268978466967825796", "name": "Kelsey B", "time": 1601511506378, "rating": 5.0, "text": "We went back and forth between a band or DJ for our wedding and I am so glad we went with WellDunn entertainment. Brandon was amazing and really knew how to get all the guests up and dancing! I still have guests telling me that they loved our DJ.", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "108828637174018426940", "name": "Savannah Farrow", "time": 1598472572270, "rating": 5.0, "text": "We LOVED DJ Well Dunn! We used them for our wedding reception and D.J. Mason was so awesome! Everyone had such a great time. Their company was so easy to coordinate and plan with! Would highly recommend and use again!", "pics": null, "resp": {"time": 1598794643025, "text": "Savannah thank you so much!! We appreciate your feedback and had a great with you and your guests. Thanks again for trusting and choosing WellDunn Entertainment."}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "112145326803452355676", "name": "Jordan Rush", "time": 1601251232554, "rating": 5.0, "text": "DJ Prez was amazing! We had an amazing wedding. He was excellent and really kept the party going. Couldn’t have asked for a better DJ to play at our wedding!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "106114360553223283791", "name": "Rebecca Cason", "time": 1598712100643, "rating": 5.0, "text": "I’ve known DJ WellDunn since he was playing at Tin Roof in Birmingham, so I knew for my wedding day that I had to have him! Oh man and he did not disappoint!! He got all the guest out there dancing on the dance floor and was even out there with us! I wouldn’t want my wedding day any other way!!", "pics": null, "resp": {"time": 1598794541421, "text": "Rebecca thank you so much! It was an honor to be your Dj and entertain your guests. So glad to hear your wedding day was amazing. Thank you for trusting WellDunn Entertainment and congratulations again!"}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "115216004363792814980", "name": "Delena Nguyen", "time": 1603828638336, "rating": 5.0, "text": "We’re so happy that we hired WellDunn entertainment! D.J. Mason was awesome and everybody loved his energy!! We also got the photobooth service from WellDunn and totally worth it! I loved my template for my pictures and all my guest enjoyed that they got a copy of their photobooth to take home! I will be recommending them to my friends for their weddings or events!", "pics": null, "resp": {"time": 1603829895981, "text": "Thank you so much!!! You should be receiving you “hands on” gallery very soon 🎉 Congratulations again and thank you for choosing and trusting 🅦🅔🅛🅛🅓🅤🅝🅝 🅔🅝🅣."}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "116170322117567798599", "name": "Jada Chubb", "time": 1592161097425, "rating": 5.0, "text": "Book WELLDUNN Entertainment for your next event! - DJ WellDunn knows how to get a party started! He ensured everyone at our wedding reception had a great time by engaging with the crowd. He was extremely professional, organized, and timely. We were so impressed with DJ WellDunn and his team! The online planner option helped make our wedding planning process a breeze! Thank you, WellDunn Entertainment!!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "103686285355465008243", "name": "Emily Sims", "time": 1592952502744, "rating": 5.0, "text": "If you’re looking for a DJ for your event, look no further!! We had such a great experience from start to finish with Welldunn Entertainment! From the beginning, Callie was so awesome and helped answer my MANY questions! She always answered in a timely manner, and was so nice and helpful with everything! The online planner makes it SO easy to plan and see the entertainment for your event come together! Closer to our wedding, we started communicating with our DJ, Mike Lira. I can’t say enough good things about him either! DJ Mike planned the day and entertainment exactly how I imagined it. He sent over a detailed description of all of the songs and the timeline for when things would be played. He was so organized and easily accessible if I had any questions/concerns. I even had several guests come up to me to say how professional, organized, and friendly our DJ was. We had a few miscommunications in our reception (unrelated to our entertainment); DJ Mike didn’t miss a beat and went right along with the changes being thrown at him. We are so thankful we chose WellDunn Entertainment and would recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "106327289756618652851", "name": "Morgan Todd", "time": 1595299083350, "rating": 5.0, "text": "Michael was a blessing to our perfect day! Always on point with his music choices and the party was always rocking! I will forever suggest WellDunn Entertainment as a wedding DJ and photobooth service. Thank you so much for everything you did!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "114496315931186307354", "name": "Jaime Thornburg", "time": 1591804677574, "rating": 5.0, "text": "Brandon did a fantastic job at our banquet last night! We had less students due to the COVID19 situation and he kept the party going and negated any weird down time created by the smaller crowd. Our students loved him and so did all the chaperones! I also want to thank Callie in the office who went above and beyond as we had to change our date multiple times when things were shut down so unexpectedly. The photo booth was also a big hit and the custom template they made for us was spot on. Overall we could not have had a better experience and can’t wait to book them again next year!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "111981770395264140270", "name": "Betsy Terenzi", "time": 1583175254721, "rating": 5.0, "text": "Brandon did such a great job getting the party going at our wedding reception! He did an amazing job of sensing the room and playing the right songs at the right time. He is incredibly friendly, energetic, and interactive with guests! No one will miss having a live band with Brandon leading the party!", "pics": null, "resp": {"time": 1583182770140, "text": "Betsy thank you so much for your thoughtful review and kind words. We truly enjoyed being your entertainment choice for your wedding reception. Congratulations 🎉"}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "109533202417114546766", "name": "Amy Roberts", "time": 1582638922788, "rating": 5.0, "text": "Brandon and his team are nothing short of the best in Birmingham. They're so easy to work with and take the stress out of planning your event. Our students went on about how much they enjoyed the music and had a great time and it was all thanks to WellDunn!", "pics": null, "resp": {"time": 1582781776168, "text": "Thank you so much Amy! We truly enjoyed being your entertainment choice for your event"}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "100730931373694980411", "name": "Meghan Easterling", "time": 1596129229033, "rating": 5.0, "text": "Went to a friend's wedding where Brandon was the DJ and we had the BEST time! He was really awesome", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "110616680760421161871", "name": "Kyle Mavin", "time": 1598703944487, "rating": 5.0, "text": "Great service - DJ was amazing - kept everyone dancing and entertained - Fun, Easy Going and Knowledgeable during the planning - you need a DJ? WellDunn is the guy to get!", "pics": null, "resp": {"time": 1598794581522, "text": "Thank you so much! It was our pleasure"}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "112025891629677639602", "name": "Tahara Evans", "time": 1582166035837, "rating": 5.0, "text": "Brandon and his crew are awesome to work with.  We have enjoyed both Brandon and Ian at the Hoover Randle Home & Gardens.  Both are professional and interactive.  One of the best!", "pics": null, "resp": {"time": 1582781724402, "text": "Thank you so much. We enjoy performing at Hoover Randle Home & Gardens anytime"}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "105348587188084986834", "name": "Charlie Beth Musgrave", "time": 1591825038898, "rating": 5.0, "text": "Brandon & Brittany were AMAZING! They really connect with teens and is tons of fun!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "115204997294845261461", "name": "Julie Sasse", "time": 1572221476019, "rating": 5.0, "text": "We love Brandon and WellDunn Entertainment! They really know how to excite the crowd and get everyone dancing!!! My team was so thrilled to have him back at our event for the 2nd year. We can't wait to use him again!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "116093386195391575866", "name": "Alexis Nicole", "time": 1593118992274, "rating": 5.0, "text": "Our experience with DJWellDunn was beyond amazing! We had DJ Mike and he was the life of the party! He was so easy to work with - quickly responsive to every question we had, extremely flexible, and through all the COVID madness, he stayed positive and worked with us through every change that came our way. His music selection had the crowd on their feet the entire night and kept everyone dancing. When he announced the last song everyone screamed \"Noooo!!!\" and he played a couple more to ease the crowd haha! Just shows how great of a time he put on for everyone! We absolutely love Mike and are so grateful to have had him be a huge part of our day! I HIGHLY recommend Mike (and DJWellDunn overall) to anyone looking for an amazing DJ and DJ company for any special event!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "109871191619978690492", "name": "Olivia Stanley", "time": 1586668903119, "rating": 5.0, "text": "Brandon was our wedding dj with WellDunn Entertainment! He was hands down The Best dj I've experienced. My amazing planner hooked me up with him and I felt so lucky he was available on my date. I could not have imagined a different dj! He was loads of fun and interacted with my guests the entire night. He played only the best songs after listening to my plan and my guests requests!! It was a total blast because of WellDunn! Brandon has found his calling. As one bridesmaid said “he’s so much fun, makes you want to be friends with him!” And I have to agree. Nothing but the best. Thank you guys so much.", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "104249167056930126505", "name": "Stephanie Dameron", "time": 1557081727480, "rating": 5.0, "text": "We loved DJ mason for our wedding! It was a great party atmosphere with awesome energy. He is a fun person that drove from out of town to come as well. Great service for a great price!!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "108287190314629754797", "name": "Emmie Stutts", "time": 1583875095689, "rating": 5.0, "text": "WellDunn Entertainment is one of my favorite vendors to work with. They are always wanting to make your event special and fit the needs of the guests you have attending. I look forward to using them in the future!", "pics": null, "resp": {"time": 1583879606438, "text": "Always a pleasure to work with you Emmie. Thank you for taking the time to write a review"}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "104251143603436054594", "name": "Sara Franklin", "time": 1572880886395, "rating": 5.0, "text": "Absolutely INCREDIBLE DJ! Highly recommend him for weddings, charity events, or whatever you need!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "116611557755894329041", "name": "Amanda Harvie", "time": 1569235036194, "rating": 5.0, "text": "We were very happy with DJ WellDunn’s services, which were used for our school’s homecoming dance. Between the music and the photo booth the 900 students in attendance were highly entertained and enjoyed themselves. Everyone was so easy to work with, and the DJ worked hard to accommodate the students’ song requests, finding clean versions  up until the last minute for the school function. We appreciated their professionalism and cooperation!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "107409264681559499193", "name": "Elizabeth Shipp", "time": 1555354049821, "rating": 5.0, "text": "I hired WellDunn Entertainment for my Sorority Formal and was very pleased with the service that they provided.  Our DJ, Amado, was charismatic, easy to work with and responsible.  Of all of the aspects of formal, I received the most and best feedback from my guest about the DJ whom they said was the best we had ever had at an event.", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "105651229675472249104", "name": "Anne Betbeze", "time": 1570723746862, "rating": 5.0, "text": "We had Michael Renda as the DJ for my daughter's wedding and he was the greatest!  He was easy to work with and played exactly what the couple wanted.  He made the reception a party, by getting everyone up and dancing.  I have been told by many that our reception was the most fun that they had ever had!  Also if you have doubts about getting the up lighting and cake spots, GET THEM.  It gave the reception a beautiful ambience!  Money well spent - all around,  thank you WellDunn and Michael Renda!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "116278324608806446947", "name": "Amanda Millwood", "time": 1546821755079, "rating": 5.0, "text": "Brandon did such an amazing job at our company party! He played great music and helped make our party so much fun. He’s such a professional and the entire process from booking to the end of the party was so easy, I didn’t have to worry about a thing. He’s so friendly and entertaining and you can tell that even though he’s technically working, he’s actually just out there having a great time with the rest of us. The photobooth was FANTASTIC! It was a HUGE hit at our event. Brandon is the BEST and would highly recommend him to anyone. He’ll absolutely be my first call the next time I’m in the market for a DJ.", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "117273731243088780061", "name": "Taylor Griggs", "time": 1540354960148, "rating": 5.0, "text": "I think I received more compliments from wedding guests about Brandon than almost anything else at our wedding! Brandon is not only professional, kind, and organized, but also has an amazing ability to read the room. This is so important for a DJ! He was able to conjure the perfect mix of songs to please our diverse wedding guest group, knew when to kick things up a notch, and when to give people a breather. He also wore THE MOST amazing white tuxedo to our wedding. Further more, his timing with important songs was spot on (first dance, etc.) and my husband and I felt like rockstars when we entered the reception, thanks to his control of the music. Brandon executes flawlessly and truly feels out what’s best in the moment. He’s also just freaking cool. If you don’t book Brandon, your event is missing out! :)", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "104499963056528837072", "name": "Elana Jones", "time": 1550240585260, "rating": 5.0, "text": "I simply can not recommend Brandon highly enough!!! As a DJ, he truly goes above and beyond in every single thing he does to make the occasion as special, fun, meaningful, and memorable as he possibly can. He is a true professional and a true delight and I’m thrilled that we were able to reschedule the date of our event just so that Brandon could be there! Thank you Brandon and WellDunn Entertainment for all you do!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "109560778381391579994", "name": "Cindy Campbell", "time": 1527516338119, "rating": 5.0, "text": "Brandon was recently the DJ at our son’s wedding. He was phenomenal! The ceremony music was flawless and the reception was amazing. He is a wonderful emcee as well, easily transitioning to the various phases of the reception and engaging with everyone. A great time was had by all of our guests and exactly what our bride and groom had envisioned for their special day!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "111920687519631369221", "name": "Susan Y", "time": 1551538129714, "rating": 5.0, "text": "Nobody could have out performed Brandon, his brother, or DJ Michael!  Our wedding music and foto booth was perfect both at ceremony and our reception. We, \"Team Snow\", ABSOLUTELY LOVE AND RECCOMEND WELL DUNN ENTERTAINMENT!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "117451086212514230262", "name": "Laura Wesson", "time": 1554719336471, "rating": 5.0, "text": "On time and the best Ever... We love Amarado and Brandon.  They are so kind and the best!!!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "103494505010738837822", "name": "Nicole Kerekes", "time": 1547219247382, "rating": 5.0, "text": "Well Dunn Entertainment is one of my GO TO companies for all events needing music, uplighting, and photo booth services. Brandon is both an incredible DJ who gets any event on their feet and businessman, providing the utmost professional services in a timely and efficient manner.", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "109778019199091311691", "name": "michael thomas", "time": 1525459163675, "rating": 5.0, "text": "I attended a wedding he was the DJ for. He is by far the best in the business. Would highly recommend.", "pics": null, "resp": {"time": 1525460791318, "text": "Thank you for the kind review Michael. We are glad to hear you enjoyed our services."}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "103592148217105766140", "name": "Traci Swanson", "time": 1499371131735, "rating": 5.0, "text": "The Best Dj  Ever very compassionate and concerns about your needs for your Special day. or any occasion.", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "107905901104785930185", "name": "Megan Martin", "time": 1512402481123, "rating": 5.0, "text": "WellDunn Entertain supplied the Bariatric Center at Brookwood Baptist Princeton with hours of wonderful entertainment! Brandon smoothly transitioned announcing events, karaoke and playing a great variety of music to keep the fun happening! We plan on using WellDunn Entertainment for all future events! Thank you WellDunn Entertainment!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "105172995720459564385", "name": "donna nail", "time": 1529358773138, "rating": 5.0, "text": "Thanks Welldunn Entertainment. And Michael Lira For the Great job as DJ for Zac and Kaja", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "115716072267827614172", "name": "Jennifer Hamrick", "time": 1554733930295, "rating": 5.0, "text": "Wonderful to work with!!", "pics": null, "resp": {"time": 1554791699780, "text": "Wonderful! Thank you so much for choosing WellDunn Entertainment"}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "114202600638391906208", "name": "Elena Kulpa", "time": 1624545266333, "rating": 5.0, "text": "Changing States and starting my career back up in Real Estate meant also changing my entire team, choosing the \"right\" photographer is vital in this industry.  I was referred at least 5 photographers and Joe was the first to answer my call.  His adaptability and getting your vision in the first shot is impressive!  Pixel Joe is \"TOP NOTCH\" and is why he is my ONLY choice for photographer in North Alabama. Like they say \" if it's not broke why fix it.\" Give him a call, you won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "104131304197496737316", "name": "Steven Payne", "time": 1624461173930, "rating": 5.0, "text": "Fun and educational! Much appreciated!", "pics": null, "resp": {"time": 1624510833125, "text": "Thanks for coming Steve!"}, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "110220400279779925575", "name": "christina hall", "time": 1622943504536, "rating": 5.0, "text": "Absolutely the best place for any venue needs!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "103803003022946061253", "name": "Thomas Lawless", "time": 1603760874439, "rating": 5.0, "text": "This dude took exactly what I had in my head for my business and made it happen. I couldn’t be more happy with the quality and appearance of the photos I needed.\n\nAbsolutely phenomenal", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "104143428204887567216", "name": "Steven L Payne", "time": 1624510184769, "rating": 5.0, "text": "Super nice setup!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "109102795672237195901", "name": "KAavalon", "time": 1569680089254, "rating": 5.0, "text": "My husband and I hired Joe for our wedding 8/31 to do a highlight video. Joe was AMAZING!!! He assisted us through the whole process helping us select the moments we wanted to capture. He gave us a beautiful video while staying within our budget. He is professional and personable. We had our DJ drop out at the last minute and he assisted us with finding a new one, DJ Scott Blakely was AWESOME!  I highly recommend Joe and Scott and I would definitely hire them again!!! Thank you both so much for helping us make our wedding a party and helping create a beautiful keepsake!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "114884731954220746471", "name": "Kimberly Holmes", "time": 1518198801133, "rating": 5.0, "text": "Joe was Fantastic and easy to work with. Never once got frustrated with us and always had a smile. You can definitely tell Joe is passionate about his work. He did a Fabulous job with our whole team!! I would definitely recommend him.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "114854941382840784237", "name": "Nadine Wormsbacher", "time": 1532815473298, "rating": 5.0, "text": "Joe is a gifted photographer and videographer. He thinks  outside the typical box to create videos and images that are unique and memorable. He created a beautiful video of my horses and farm; he used his drone and the camera that lets him move with the horses and not jiggle. He’s very professional and easy to work with. Although I’d recommend him for anything image related, after seeing my video, I think he would be especially great for outdoor weddings or events.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "113882969702963035749", "name": "John Wood", "time": 1517184820924, "rating": 5.0, "text": "Joe took some headshots for myself and my staff that came out great! Joe had a lot of great tips for posing and took care to always get the best shots he could. Joe's studio was top notch as well as his professionalism and his abilities! Highly recommend!", "pics": null, "resp": {"time": 1517239829093, "text": "Thanks John I enjoyed it. You have an amazing staff and I know you guys will be an amazing all state branch! If anyone needs insurance call these guys!"}, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "107012675560021782345", "name": "Tye Watson", "time": 1505707424106, "rating": 5.0, "text": "Highly creative photos- he can add any theme to create a magical scene. His videos are above the top. Love his work. Would highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "106718618561893959853", "name": "ABC Cleaning and Restoration", "time": 1533649441699, "rating": 5.0, "text": "Joe is the doctor of photography.  He has an eye for the picture and knows the camera like nobody!  Whether it's a headshot, sports action shot or wedding I highly recommend using his vision!  He is also great at making movies so if you'd like to watch that game or wedding over and over he can make it happen!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "111515713004282244226", "name": "Katy Murphy", "time": 1532729877812, "rating": 5.0, "text": "Joe Bullock is an excellent photographer! From headshots to engagement photos to promotional videos, Joe's work is top notch. He is professional and gives 200% to everything he does 📸🎥", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "100096560547750047679", "name": "Brandon Saraceni", "time": 1503714516052, "rating": 5.0, "text": "Joe took some photographs via his drone for me on a roof inspection. He was on time and very professional. I will definitely hire him again. Thanks Joe.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "117225640691016339924", "name": "Lauren Schippers", "time": 1505675033074, "rating": 5.0, "text": "Joe is very professional and took some amazing photos for a friend of mines engagement announcements. They turned out beautiful!!!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "110793175651707402605", "name": "ERICA PRICE", "time": 1508082460020, "rating": 5.0, "text": "Pixel Joe's photography did a great job for us and I will definitely hire him again! Thanks so much pixel Joe!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "108934058374010077336", "name": "Rachel Harchanko", "time": 1532907622867, "rating": 5.0, "text": "Pixel Joe did my head shots for me. Joe was an absolute pleasure to deal with. I was so thrilled with the finished photos.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "100468113882323669988", "name": "Kayla Bullock", "time": 1506294828302, "rating": 5.0, "text": "Joe did a great job with our family pictures and getting 3 wild boys to smile!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "108214166658023055487", "name": "Allison McKee", "time": 1550364592505, "rating": 5.0, "text": "ATTENTION EVERYONE!!\nThis company is the single greatest investment you will make for wedding!!! Tim is worth 10x more than he charges! He has more experience than many wedding planners and made all the difference for our special day!   We even asked him to double as our wedding officiant and he delivered In a spectacular way! He even entertained guests as they waited for their turn in line at the buffet! He’s a triple threat officiant, planner, and DJ in one! This company will be the defining aspect that your guest remember about your wedding!! DO IT!!! You will be entertained! (Ask about his fantastic lighting too!)", "pics": null, "resp": null, "gmap_id": "0x88f56bc9bcdd9a25:0x6abce010b6691fac"}
{"user_id": "108352327867207670549", "name": "Jerrill Whatley", "time": 1556112808022, "rating": 5.0, "text": "Tim did a wonderful job with our special day. I would recommend him for any major event I have moving forward. All my guest raved about how good the DJ Tim did. 5 stars all around.", "pics": null, "resp": null, "gmap_id": "0x88f56bc9bcdd9a25:0x6abce010b6691fac"}
{"user_id": "113709370729410219834", "name": "Joy Sheehan", "time": 1539522948183, "rating": 5.0, "text": "DJ Tim is amazing! We had a great experience for our wedding and reception. Our friends are still talking about how much fun they had. Don’t hesitate to book with this company. You will be glad you did.", "pics": null, "resp": null, "gmap_id": "0x88f56bc9bcdd9a25:0x6abce010b6691fac"}
{"user_id": "101165558518784104289", "name": "James Lewis", "time": 1530036289592, "rating": 5.0, "text": "We were extremely pleased with the professional DJ services provided by The Celebration Crew DJ Tim Cahill.  Tim was very professional and was outstanding.   He really knew how to interact with our audience and had everyone dancing the entire night.  We highly recommend The Celebration Crew.  You will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88f56bc9bcdd9a25:0x6abce010b6691fac"}
{"user_id": "101291674601206259666", "name": "Ashley MacKay", "time": 1522959124618, "rating": 5.0, "text": "Everything about this company is absolutely professional and outstanding! These guys do wonderful work and are always a pleasure to work with! I would recommend them in a heartbeat to anyone! Keep up the great work!", "pics": null, "resp": null, "gmap_id": "0x88f56bc9bcdd9a25:0x6abce010b6691fac"}
{"user_id": "104230966520170644528", "name": "Mike Greene", "time": 1519086434382, "rating": 5.0, "text": "Absolutely the best DJ’s in Atlanta. They played at our wedding reception - very reasonable in price, played great songs, worked with us in advance, showed up early and stayed late. We still get questions to this day, “who was that DJ again?!” Top notch; you won’t go wrong. Promise.", "pics": null, "resp": null, "gmap_id": "0x88f56bc9bcdd9a25:0x6abce010b6691fac"}
{"user_id": "103325647346587667976", "name": "Jimmy Noble", "time": 1521410722282, "rating": 5.0, "text": "We met our wedding DJ, Tim, through DJ Trivia night at Guston's in Woodstock.  When it came time to pick a DJ for our wedding, it was an easy choice!  We already knew how much fun trivia was with Tim, but we were blown away by the great music and professional service at the wedding.  The equipment was top of the line and sounded perfect.  Everybody could hear the service through the wireless mic system, and the reception equipment could probably have blown the roof off if we wanted it to, but it was kept at a perfect level so you could still talk to people around the dance floor.  Clear sound with no distortion whatsoever (and I'm really picky about sound systems, it's part of what I do for a living).  Celebration Crew gets an A+ from me.", "pics": null, "resp": null, "gmap_id": "0x88f56bc9bcdd9a25:0x6abce010b6691fac"}
{"user_id": "100355924766155869400", "name": "Girl Scout Troop 15125", "time": 1519091468072, "rating": 5.0, "text": "Highly recommend this company!!  We hired them for a fundraising event and they did an amazing at keeping the energy up with a wide range of music and helping us to promote our cause throughout the evening without being over the top about it.\n\nTim DJ/MC’d.  He was very responsive during our planning phases, arrived with plenty of time for set up and was an unexpected lovely and fun addition to he evening.  Won’t use anyone else for our future events.", "pics": null, "resp": null, "gmap_id": "0x88f56bc9bcdd9a25:0x6abce010b6691fac"}
{"user_id": "114066573513177417493", "name": "Becky Walker", "time": 1447369936705, "rating": 5.0, "text": "Excellent group to work with if you need professional sound at a great price.  They have worked several  programs for the past four years and never cease to amaze me.  Neat, professional, punctual and cooperative...they do what YOU want for your program.", "pics": null, "resp": {"time": 1447370326060, "text": "Thank you so much Becky! We love doing your program each year and we thank you for the great review!"}, "gmap_id": "0x888a1cea6d790263:0xf47c8d2d579ac772"}
{"user_id": "102594343018294699359", "name": "Kelly Pate", "time": 1489334042100, "rating": 5.0, "text": "Excellent DJ service, Dependable, Up to date on all music etc.!!! Excellent Company to plan your Special Event With!! You will not regret Booking These Guys!!", "pics": null, "resp": {"time": 1539800335078, "text": "Thank you Kelly for the great review!!"}, "gmap_id": "0x888a1cea6d790263:0xf47c8d2d579ac772"}
{"user_id": "102044656298163304201", "name": "Daniel Watts", "time": 1468426064867, "rating": 5.0, "text": "After watching Alex and his crew work wonders at a wedding (DJ'ing, photography, and even DRONE videography), my company decided to purchase a DJI Phantom 4 through his company.  We got a really great deal on the drone and accessories, and Alex even recommended some items, such as blade guards, that I would have never thought of (at least not until after I replaced the blades a dozen times).\n\nAlex and his group are prompt, professional, and I will gladly recommend them to anyone considering...well ANYTHING related to needing a DJ, photographers, videographers, etc.  Great company!", "pics": null, "resp": null, "gmap_id": "0x888a1cea6d790263:0xf47c8d2d579ac772"}
