{"user_id": "117879435719519621690", "name": "Michael Hull", "time": 1457179164913, "rating": 5.0, "text": "The very best craftsmanship. Fred it very professional and takes pride in what he does. Margaret and the staff give the best customer service available. Best part is that they stand behind what they do. I would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88896301cc0f0e3f:0xb35576dd5740ee8e"}
{"user_id": "115475398307250871226", "name": "Randy Arnold", "time": 1545177861221, "rating": 1.0, "text": "They dont do small jobs. Pre paid to have 4 poles driven into river couldnt make it happen.\nWas told it would be couple of weeks. When I called about it they said their contractor had pulled his barge out of the lake and move to Tuscaloosa.I didn’t know they subcontracted their pile driving and had no control over their subcontractors.So after three months I ended up having to get my money back and take an alternate route with somebody else.", "pics": null, "resp": null, "gmap_id": "0x88896301cc0f0e3f:0xb35576dd5740ee8e"}
{"user_id": "105489921722586922521", "name": "Virginia McBurnett", "time": 1490044048552, "rating": 5.0, "text": "Expert work and staff", "pics": null, "resp": null, "gmap_id": "0x88896301cc0f0e3f:0xb35576dd5740ee8e"}
{"user_id": "101315163875592117554", "name": "Aaron Barber", "time": 1604993019125, "rating": 5.0, "text": "Good people,  Integrity,  friendly,  honest,  knowledgeable staff.  Well established company/ supplier that  has what it takes to fix or build any of your marine needs. Good people to work with & for !!", "pics": null, "resp": null, "gmap_id": "0x888c145067027083:0xf5000ca0a8b09d1a"}
{"user_id": "116254377911226042736", "name": "Mickey Andrews", "time": 1569347371097, "rating": 5.0, "text": "Lake Martin Dock recently completed our new pier. We are very pleased with the results. Professional and high quality job all the way.\nEveryone involved in the build were letting us know they wanted to make sure we would be pleased with the project, and we were. We made an investment in quality materials that would last many years. We, also, made an investment in a quality marine construction company that fulfilled our expectations and gained our trust for future projects.", "pics": null, "resp": {"time": 1575481151786, "text": "Thank you for your kind words!"}, "gmap_id": "0x888c145067027083:0xf5000ca0a8b09d1a"}
{"user_id": "102215518634733758925", "name": "boyds Printer", "time": 1570739128983, "rating": 5.0, "text": "I owned my own business for over 40 years so I appreciate employees who are shooting for total customer satisfaction. And that is exactly what I found  dealing with Lake Martin Dock Company. From dealing with Daniel Jackson on the site review and price quote to scheduling the actual work it was better than expected.  I can't say enough good things about Dave Gray and his team of highly skilled Dock Technicians.  These guys know what they are doing!  Dave took the time to explain every step of the process so I understood why he was doing things the way he was.\nThe end result was total satisfaction and a job we are both proud of.\nMany Thanks Lake Martin Dock Company!\n\nJulian R Boyd", "pics": null, "resp": {"time": 1571998697920, "text": "Thank you for the kind words, and as a fellow business owner - you know how positive feedback motivates the team.  Thank you again for your business."}, "gmap_id": "0x888c145067027083:0xf5000ca0a8b09d1a"}
{"user_id": "103947501946624127551", "name": "Lisa Henderson", "time": 1564449726703, "rating": 1.0, "text": "I don’t ever write reviews but felt compelled to do so to help other people making decisions. Lake Martin Dock was more expensive than other quotes we received but we chose them hoping it would be an easy and good experience.  We paid for the dock in cash and after counting it twice in front of us with a calculator and giving us a final paid in full receipt they emailed us later telling us it was short $1000.   This went back-and-forth for 13 days until we were finally told they would just “eat the cost”.  We were then sent a bill for over $500 for a pole they “forgot” to invoice us for.   This was handled very unprofessionally and no way to run a business.", "pics": null, "resp": null, "gmap_id": "0x888c145067027083:0xf5000ca0a8b09d1a"}
{"user_id": "107588931163422185049", "name": "John Sullivan", "time": 1622212791074, "rating": 5.0, "text": "Great company!!", "pics": null, "resp": null, "gmap_id": "0x888c145067027083:0xf5000ca0a8b09d1a"}
{"user_id": "102942872382342693424", "name": "Henry Baker", "time": 1551797828912, "rating": 5.0, "text": "LMDC constructed a sea wall for our property which had a severely eroded water front.  We are very pleased with the quality of their work and the result.  Justin Faulkner and his staff were very skilled, had excellent equipment and they operated efficiently and effectively as a team and got the project done on schedule.  Their response to special requests was extraordinary and their performance exceeded our expectations.  I recommend this group enthusiastically and without reservation.  Henry Baker", "pics": null, "resp": {"time": 1575481241445, "text": "Thank you for your review.  Glad to have you as a customer."}, "gmap_id": "0x888c145067027083:0xf5000ca0a8b09d1a"}
{"user_id": "104905333863574947695", "name": "Alice Herring", "time": 1516754949655, "rating": 5.0, "text": "LMDC exceeded our expectations in their knowledge and expertise. Everyone on site worked together as a team and accomplished the job very efficiently. We were very impressed with the fact that the entire team took a great deal of pride in their work and that their bottom line was to please the customer. This was not a large scale project compared to some they do but we are sure no matter the size that their performance would be the same. Great job and we are very pleased!", "pics": null, "resp": null, "gmap_id": "0x888c145067027083:0xf5000ca0a8b09d1a"}
{"user_id": "109339282262697588989", "name": "Shane West", "time": 1512478278671, "rating": 5.0, "text": "Excellent. Their dock design experts worked with me to design a boat house that works well on my property, and looks fantastic. Workmanship was very good (and I am a very picky customer). Boat lifts are much better than the ones we had at our previous home on Lake Martin. I had a minor issue with one of the lifts a couple of months after the build. They addressed to issue and resolved it quickly. They will not be your cheapest option and it will be a while before they will start on your project, but they are second to none in construction quality and customer service. They exceeded my expectations.", "pics": null, "resp": null, "gmap_id": "0x888c145067027083:0xf5000ca0a8b09d1a"}
{"user_id": "104087727582553699475", "name": "Eva Decker", "time": 1518391792214, "rating": 5.0, "text": "Dave Mcgrit is fair honest and creative.\nI would recommend  him and Lake Martin Dock Company to anyone no project big or small project is to much.", "pics": null, "resp": null, "gmap_id": "0x888c145067027083:0xf5000ca0a8b09d1a"}
{"user_id": "117000840990840241901", "name": "Randy Knowles", "time": 1560039050009, "rating": 4.0, "text": "Great place and good service.", "pics": null, "resp": {"time": 1575481162101, "text": "Thank you Randy"}, "gmap_id": "0x888c145067027083:0xf5000ca0a8b09d1a"}
{"user_id": "114491262952432722225", "name": "Joel Phillips", "time": 1423628081089, "rating": 5.0, "text": "Great to do business with . Larry takes great pride in the work he does and makes sure his customer is satisfied .", "pics": null, "resp": null, "gmap_id": "0x888c145067027083:0xf5000ca0a8b09d1a"}
{"user_id": "101954764963268643112", "name": "Randy K", "time": 1510247562860, "rating": 5.0, "text": "Great experience from initial inspection and proposal, through construction and clean up.", "pics": null, "resp": null, "gmap_id": "0x888c145067027083:0xf5000ca0a8b09d1a"}
{"user_id": "108549191988364476638", "name": "george williams", "time": 1526431855438, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": {"time": 1526432932018, "text": "Thank you George, and thank you for your business."}, "gmap_id": "0x888c145067027083:0xf5000ca0a8b09d1a"}
{"user_id": "104922486435789740272", "name": "David McGirt", "time": 1486672058020, "rating": 5.0, "text": "Premiere dock company", "pics": null, "resp": null, "gmap_id": "0x888c145067027083:0xf5000ca0a8b09d1a"}
