{"user_id": "102151330555940013425", "name": "Misty Campbell", "time": 1595428877977, "rating": 5.0, "text": "Very pleased with Frank, Jamie, and all the great people at Belle Shain!!  I contacted Frank when I was about at my wit’s end with our puppy, Cross.  He was biting/chewing excessively (on me mostly), he was unable to walk on a leash, and he was just not doing well.  Within a matter of weeks, Frank and his team have taught Cross how to behave better, he has learned commands, and he is a more pleasant dog to be around.  I can tell Cross loves being at Belle Shain, too. He enjoys playing with other dogs, running around, and swimming in the river. Definitely helpful for training and burning off all of that puppy energy!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNBkG47pNxuZXkUj9CBBRr-voyFlaKRaPpeoZPu=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a14f0165eea71:0x5aa2e58435435e87"}
{"user_id": "113748168912617365420", "name": "Annie Summers", "time": 1595379417403, "rating": 5.0, "text": "I trained my two dogs Dixie and Maddie with Frank and Jamie at Belle Shain Kennels. It has made a huge difference in how much enjoyment I get from my dogs now they will sit, heel and place. I highly recommend their training facility. My dogs love it there. I still take my  them for kenneling when I travel and day care boarding too. Frank does tune ups on Saturdays at the Woof Bar, I think that’s more tuning up the trainer than the dog🐶. Great people and wonderful property for the dogs to play.", "pics": null, "resp": null, "gmap_id": "0x889a14f0165eea71:0x5aa2e58435435e87"}
{"user_id": "117292286520508546555", "name": "Stacey Bottorff", "time": 1595378462858, "rating": 5.0, "text": "Great training and boarding program! Our dog spent about 3 months with Frank working on general obedience and then progressing from there. He is very knowledgeable and patient, incorporating training sessions with my husband and I throughout the months as well. Our dog enjoyed her time there!\nDuring her time there our dog also required some vet attention (preexisting issue) and Frank did not hesitate to get her into his vet for care. Would definitely recommend Frank and his training program to other dog owners!", "pics": null, "resp": null, "gmap_id": "0x889a14f0165eea71:0x5aa2e58435435e87"}
{"user_id": "108814512340698701460", "name": "Daniel Campbell", "time": 1595432774382, "rating": 5.0, "text": "Frank and the gang at Belle Shain are nothing short of fantastic. They are very accommodating and do a great job at a very reasonable price. Our dog was young, very energetic, and rambunctious. They are successfully turning him into a much better mannered young dog. He gets lots of exercise and loves playing with other dogs and swimming in the river (under supervision). He is excited to jump out of the truck he gets there every Monday morning and is obviously very well treated at Belle Shain. I can not recommend them enough.", "pics": null, "resp": null, "gmap_id": "0x889a14f0165eea71:0x5aa2e58435435e87"}
{"user_id": "111734365464358040515", "name": "Chase Emerson", "time": 1606151251140, "rating": 5.0, "text": "Frank and his crew were outstanding!!\nThey had my dog trained very quickly, and efficiently.\nNot to mention they treat all the animals very well. I will use them in the future over anyone else!!", "pics": null, "resp": null, "gmap_id": "0x889a14f0165eea71:0x5aa2e58435435e87"}
{"user_id": "107988567791643491279", "name": "Kyle Maxwell", "time": 1606151322765, "rating": 5.0, "text": "Frank and his crew did an amazing job training my dog and treated her very well.", "pics": null, "resp": null, "gmap_id": "0x889a14f0165eea71:0x5aa2e58435435e87"}
{"user_id": "100441863622463978090", "name": "Chris Wade", "time": 1595372645491, "rating": 5.0, "text": "No other place I would take my dogs. Frank did an awesome job with both of my dogs. Use him for boarding when we go out of town. Dogs have a blast and get excited when we pull in the driveway!", "pics": null, "resp": null, "gmap_id": "0x889a14f0165eea71:0x5aa2e58435435e87"}
{"user_id": "111292580442856975358", "name": "Abigail Jackson", "time": 1595423487219, "rating": 5.0, "text": "Clipper has had a blast this summer at training and boarding camp. He has learned so much and is now off leash. I have seen a total transformation in Clipper’s behavior and attitude. Frank and Staff are amazing to work with and really get to know and care about your dog. I am forever thankful for BelleShain Kennels.", "pics": null, "resp": null, "gmap_id": "0x889a14f0165eea71:0x5aa2e58435435e87"}
{"user_id": "110230249029111412642", "name": "Dana Andrews", "time": 1622814257979, "rating": 1.0, "text": "The owner was very nice when talking up his services. However, after paying my deposit something unforeseen happened and I had to cancel. It had not even been 1 1/2 hours. He would not respond to my text asking for my deposit back. He never told me the deposit was non-refundable. I'm very upset by this. I could understand if it had been more than a or two, but less than two hours, and he could see the reason for cancelation was out of my control.", "pics": null, "resp": null, "gmap_id": "0x888c2963d3691f6b:0x96c48cac770f9c48"}
{"user_id": "113506644149269654702", "name": "Anna Kate Ingram", "time": 1611355961972, "rating": 5.0, "text": "We have 3 kids and for Christmas Santa brought us a puppy, a year later we had a giant dog that didn’t obey us and jumped on everyone. Michael leash trained him for us, also taught him to sit, stay, heel. And taught us how to continue the training. We were very pleased, after just 4 days we had a totally different dog. A year later he is a joy to walk, and will sit & stay when I need him too.", "pics": null, "resp": null, "gmap_id": "0x888c2963d3691f6b:0x96c48cac770f9c48"}
{"user_id": "105811564207918325643", "name": "Michael Tarrance", "time": 1595649659028, "rating": 5.0, "text": "Dropped my 6 month old son (Rottweiler) off to him a couple days ago. We were greeted with professionalism. Mr Anderson walked us through everything he was going to be doing with our boy step by step. The dogs on site were well mannered and all looked amazing. Welcoming atmosphere. Even his kids were friendly and welcoming to my kids. (They walked off and started playing Minecraft). That was the review of our drop off for personal protection training. Come back in 30-45 days and I’ll let you guys know how everything turned out.", "pics": null, "resp": null, "gmap_id": "0x888c2963d3691f6b:0x96c48cac770f9c48"}
{"user_id": "103685821011623518518", "name": "eric bell", "time": 1595828325852, "rating": 4.0, "text": "Best in the business. Very professional what you ask for you get. Mike is a dog whisperer for sure. I tried everything to keep my dog in the yard and he kept jumping fence. 1 day working with mike and he never left yard. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x888c2963d3691f6b:0x96c48cac770f9c48"}
{"user_id": "106288995416315756866", "name": "candace bartee", "time": 1595866107215, "rating": 5.0, "text": "Awesome quality of service!!! I’ve never seen dogs respond the way they do after spending time with Mike. He’s patient, very responsive, will keep you informed of training, and very easy to work with. I would 110% recommend him to anyone looking for K9 coaching.", "pics": null, "resp": null, "gmap_id": "0x888c2963d3691f6b:0x96c48cac770f9c48"}
{"user_id": "111033547996106884468", "name": "Rafael O'Neal", "time": 1606685398971, "rating": 5.0, "text": "Mike is the best when it comes to handling dogs.  When I find my new additions to the family, Gatekeepers will be my first stop.", "pics": null, "resp": null, "gmap_id": "0x888c2963d3691f6b:0x96c48cac770f9c48"}
{"user_id": "106327383470766486304", "name": "Melissa Bazzell", "time": 1595989223227, "rating": 5.0, "text": "We have 2 dogs, one that can be aggressive due  to anxiety and one that is deaf. We took them to Mike and he helped us with on leash training and off leash training. He helped to “train” us as pet owners as well!  I was amazed at how quickly he was able to get our pups to do what he wanted them to do. I would highly recommend Mike!", "pics": null, "resp": null, "gmap_id": "0x888c2963d3691f6b:0x96c48cac770f9c48"}
{"user_id": "108734538320657852290", "name": "Derek Mayes", "time": 1595862910749, "rating": 4.0, "text": "This is my 2nd time the Gatekeepers k9 provided me with professional,  reliable, and value priced service. Brooklynn(pit bull) was having issues wanting to pull when walking her and jumping up on people. Although she was friendly.  They helped with these issues. Great job!", "pics": null, "resp": null, "gmap_id": "0x888c2963d3691f6b:0x96c48cac770f9c48"}
{"user_id": "110087519958491426396", "name": "Philemon Gray", "time": 1595872522964, "rating": 5.0, "text": "My German shepherd Kennel Holdip Shepherds, has been dealing and depending on Gate keepers k-9 for years now. Mike has trained over 20 dogs for us in the field personal protection , Obedience, service , and Police work . Mike is a Guru at training a dog to do anything . Mike is definitely one of the top trainers in North American . They are professional and extremely effective.", "pics": null, "resp": null, "gmap_id": "0x888c2963d3691f6b:0x96c48cac770f9c48"}
{"user_id": "118008171300652890990", "name": "Nikieyva Johnson", "time": 1596077890631, "rating": 5.0, "text": "VERY PROFESSIONAL  SATISFYING RESULTS\nI RECOMMEND TO ANYONE AND EVERYONE\nWITH A PUP IN NEED OF TRAINING\nGATEKEEPERS K9 DEFINITELY IT!\nMIKE KNOWS WHAT HE IS DOING", "pics": null, "resp": null, "gmap_id": "0x888c2963d3691f6b:0x96c48cac770f9c48"}
{"user_id": "107477471714268191043", "name": "Joshua Williams", "time": 1595859167445, "rating": 5.0, "text": "The type of training and obedience i have seen from the dogs he has is remarkable. My father raised and trained different breeds throughout his life so i have been around dogs since before i could remember so it was very hard for me to look out to find someone to train my dogs because i was like everyone else who believed that knew it all but truthfully i dont and also dont have the time. I was invited to a training course with a German shepherd breed that had so many issues i saw from the video the owner showed me of before his training. The course showed him 20 days later and the obedience this dog showed was truly amazing. I have recently became an owner of 4 pitbulls that will definitely begin training with him as soon as they become of age. Not only is the price very reasonable but the type of advise he has provided for nutrition needs, health, and maintenance of the dogs even without them starting the training yet really speaks to his passion, drive, and character. He has earned a life long customer from me and i would recommend his training above all others. If you're reading this please look no further. You have found what your looking for in this company.", "pics": null, "resp": null, "gmap_id": "0x888c2963d3691f6b:0x96c48cac770f9c48"}
{"user_id": "105454839775945070748", "name": "Garrette Rogers", "time": 1596391043381, "rating": 5.0, "text": "I live in Colorado and found one of Mike's pups through a 3rd party website, Mike was very responsive and helped me with purchasing my pup.  During this covid situation it was tough getting the him out to me, flights were tough to book for shipping dogs but Mike was very diligent and finally agreed for myself to fly to Atlanta and meet so I could pick him up and drive back same day.  Mike did not hesitate and was willing to drive from Alabama to Atlanta and meet me at 130 in the morning so that I could receive my fantastic pup Ruger.  Along with meeting me he provided me with a 50lb bag of the food brand he uses (lol only needed a small bit) and a small crate if I needed it.  The professionalism he showed would make me go back to him for another pup if he ever has them in the future in a heartbeat, thanks Mike again Ruger hes been amazing.  Obedience training has went well maybe not gatekeeper9 standard but he is off leased trained by 7 months and couldn't imagine life without him.  Thanks again.", "pics": null, "resp": null, "gmap_id": "0x888c2963d3691f6b:0x96c48cac770f9c48"}
{"user_id": "101576835461138025456", "name": "jonathan oswald", "time": 1596039052942, "rating": 5.0, "text": "Mike Anderson is Alabama's #1 Dog Whisperer!!", "pics": null, "resp": null, "gmap_id": "0x888c2963d3691f6b:0x96c48cac770f9c48"}
{"user_id": "107576674041587273132", "name": "Sheila Wilson", "time": 1615676817971, "rating": 5.0, "text": "Food and service was excellent, will be back.", "pics": null, "resp": null, "gmap_id": "0x8888c3c7038912cd:0xfd298199f3f2f207"}
{"user_id": "112102322518291570215", "name": "Ehrrensmommy", "time": 1471484252574, "rating": 5.0, "text": "I'm so glad I took the trip to see his dogs.  Please only serious Rottweiler owners and dog lovers need to visit.  This man loves his dogs like family!!!! We love our new puppy.", "pics": null, "resp": null, "gmap_id": "0x888a1c9583fb8adf:0x44f404795c43dfd"}
{"user_id": "107530485026851343816", "name": "Poppi Gee", "time": 1469585004744, "rating": 5.0, "text": "Nyle is a great guy.  He has really good dogs.  A must see.", "pics": null, "resp": null, "gmap_id": "0x888a1c9583fb8adf:0x44f404795c43dfd"}
{"user_id": "109518552127757845793", "name": "rj mcgraw", "time": 1618722203194, "rating": 5.0, "text": "Deborah was very knowledgeable and she truly has a passion for what she does. She routinely checks up to see how the puppies forever home is doing.", "pics": null, "resp": null, "gmap_id": "0x888f699f5bf27cc9:0x13b4658f6c17c517"}
{"user_id": "106933828068433417419", "name": "Renee Becker Bourbeau", "time": 1615945000215, "rating": 5.0, "text": "My family and I give Deborah and Alabama Havanese our highest recommendation. Deborah is the most caring, loving and knowledgeable dog Breeder and she is the reason we have a wonderful pup addition to our family. Thank you Deborah!!", "pics": null, "resp": null, "gmap_id": "0x888f699f5bf27cc9:0x13b4658f6c17c517"}
{"user_id": "117557431855339528253", "name": "Chandi McMillan", "time": 1596466307899, "rating": 5.0, "text": "Deborah is the most dedicated and caring Breeder I have ever encountered. When we decided we wanted a puppy, I received numerous videos and phone calls to make sure we were getting exactly what we wanted. Along the way as we waited for Harley to come home, I received pictures and updates about her personality and how she interacted with the other puppies. Upon pick up Deborah spent a lot of time with me ensuring I understood the schedule and all of the ins and outs on how to care for my Havanese. The schedule is so important. We’ve had Harley less than a week and she is already sleeping in her crate at night. She has had no accidents inside the house. I’ve never known a puppy to be so good at 7 weeks but we sure do have a superstar and it’s all due to Deborah.", "pics": null, "resp": null, "gmap_id": "0x888f699f5bf27cc9:0x13b4658f6c17c517"}
{"user_id": "102374446594236277010", "name": "Kendra Garner", "time": 1628771211837, "rating": 1.0, "text": "Beware of this breeder!! Dogs have parvo. I paid 5000.00 for a two AKC dogs.  One died and he will not return my call. ALSO, he never registered either dog. The day I left with the puppies, he told me he registered them online.   I'm going to have to go to court to try and recover my money. His contract wasn't  honored at all.  Worst experience of my life with a breeder!!! I've had to go through hell dealing with the after effects of the parvovirus.", "pics": null, "resp": null, "gmap_id": "0x8888e3748054bc5f:0xea6abc87e6e955d6"}
{"user_id": "105048686379509835491", "name": "pucci 161", "time": 1620266382225, "rating": 5.0, "text": "Home of the world famous akbarforce Waldo", "pics": null, "resp": null, "gmap_id": "0x8888e3748054bc5f:0xea6abc87e6e955d6"}
{"user_id": "109743347029069443194", "name": "Michael Mitchell", "time": 1598488171737, "rating": 4.0, "text": "Hot ham and cheese. Burgers are not all dry and crunchy..", "pics": null, "resp": null, "gmap_id": "0x8888e3748054bc5f:0xea6abc87e6e955d6"}
{"user_id": "111764342454987168721", "name": "Jason Shafer", "time": 1609294670909, "rating": 5.0, "text": "Great traning", "pics": null, "resp": null, "gmap_id": "0x8888e3748054bc5f:0xea6abc87e6e955d6"}
{"user_id": "103939168986784739031", "name": "Marie Bellas", "time": 1617118679128, "rating": 5.0, "text": "We love our puppy from Rock Springs labs. Ashley was so helpful and extremely knowledgeable about her dogs. Highly recommended.\nKoda's parents from Miami", "pics": null, "resp": null, "gmap_id": "0x8889ea68ba99409f:0x366fede12cfca540"}
{"user_id": "107881738812618577111", "name": "duran chappell", "time": 1610057981174, "rating": 5.0, "text": "They have some great looking lab the people are nice and friendly if you're looking for a lab it is the place to go", "pics": null, "resp": null, "gmap_id": "0x8889ea68ba99409f:0x366fede12cfca540"}
{"user_id": "110910191685678458502", "name": "Ashlee H", "time": 1584830383549, "rating": 5.0, "text": "Very happy I found Rock Springs, they made the process of finding a puppy so simple and they have such beautiful dogs. I could not be more happy with my puppy and his temperament is just amazing. Looking forward to many years and adventures with my new dog.", "pics": null, "resp": null, "gmap_id": "0x8889ea68ba99409f:0x366fede12cfca540"}
{"user_id": "112463861324613490486", "name": "Abby Herring", "time": 1564877619108, "rating": 5.0, "text": "We absolutely loved this place. The kennels were very clean and the pups and parents were up to shots. The owners were very knowledgeable, caring, and loving. Our puppy was very healthy and is a very smart with a great bloodline. We cannot wait to start to start duck hunting with him! Highly recommend this place for all your lab needs!", "pics": null, "resp": null, "gmap_id": "0x8889ea68ba99409f:0x366fede12cfca540"}
{"user_id": "106692915409023530980", "name": "Jeremy (Momsboy32)", "time": 1579733362660, "rating": 5.0, "text": "Love them, great breeder", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPWr4CdeZ0wuC5p2pMphaB7DZA43yDvp8sdaC_X=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMP5bbw5S1yzfsAKwbndmaqrSI8hKl9g6lJAsKo=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889ea68ba99409f:0x366fede12cfca540"}
{"user_id": "106954316683362952093", "name": "Dustin Jacobs", "time": 1501603839771, "rating": 5.0, "text": "They take very good care of their puppies and love them. I would highly recommend that you buy a puppy from rock springs lab their dogs are very smart and loving.  They keep the kennels very clean.I bought a 9 week old puppy yesterday and he follows me everywhere I go. I also taught him to sit pretty consistent in 1 day.If you are looking to buy a lab buy one from rock springs lab. They are also very nice people and answer any question you have about their labs,", "pics": null, "resp": null, "gmap_id": "0x8889ea68ba99409f:0x366fede12cfca540"}
{"user_id": "108275907214491678203", "name": "Bobby Cook", "time": 1520215079388, "rating": 5.0, "text": "My wife and I were looking for a new Puppy after our beloved Black Lab passed away after 14 years.  We looked at quite a few breeders in the southeast and decided to contact Rock Springs Labs.  From the first phone call I could tell I was dealing with a good Man that enjoys what he does.  After a few phone calls and exchanging some information on what we were looking for he had the right Pup in mind for us.\nThe day We arrived to pick up our new Pup We immediately noticed how clean their facility was kept and how happy the dogs were. The Dams and Sires were very happy with plenty of room to roam and play in two different fenced yards as well as their own individual kennel inside the facility.  Roger's Daughter Ashley was very helpful and informative on all of the paperwork as well as what to expect from our new pup \"She even showed us where our new pups favorite scratch spot was\".  We would highly recommend Roger and his family as a great source for your first or your next Lab Puppy.", "pics": null, "resp": null, "gmap_id": "0x8889ea68ba99409f:0x366fede12cfca540"}
{"user_id": "109655038718375333675", "name": "Allyson Marjory", "time": 1503169767341, "rating": 5.0, "text": "Such sweet amazing people and you can tell in the dogs how sweet today. We are absolutely in love with our new puppy Thank you so much Mr Bullard. It was a pleasure meeting you and your daughter :) We definitely will not be using anywhere else to find our labs. We will definitely recommend to anyone in search of a lab 😍😍😍", "pics": null, "resp": null, "gmap_id": "0x8889ea68ba99409f:0x366fede12cfca540"}
{"user_id": "109914846180299769113", "name": "Travis Swanson", "time": 1544482171919, "rating": 3.0, "text": "My yellow male lab purchased there is athletic but at 10 months old is very small and has to be in the crate when I'm gone because of chewing. I'm with him all the time mostly and has a mentor but very unusual genitics in my opinion.", "pics": null, "resp": null, "gmap_id": "0x8889ea68ba99409f:0x366fede12cfca540"}
{"user_id": "110450059091417705025", "name": "Lisa Burns", "time": 1524350121919, "rating": 5.0, "text": "The owner went above and beyond to make sure my son got the puppy of his dreams!! Thanks for blessing my little family.", "pics": null, "resp": null, "gmap_id": "0x8889ea68ba99409f:0x366fede12cfca540"}
{"user_id": "102433776648581667265", "name": "Elizabeth Finsthwait", "time": 1516325326641, "rating": 5.0, "text": "Such a sweet man, Roger Bullard is.  I live in Atlanta, Georgia and this breeder is in Alabama.   Roger (I hope I spelled his name correctly) is the man who raises the puppies.  He’s also so honest!!  He doesn’t take advantage of people, I know this because he did not take advantage of me.  And he very easily could have.  I gave him my credit card 💳 information in order to save a Specific dog 🐾 for my chosen trainer, Jen, to choose from his litter, when My puppy is born.  Jen, the dog trainer in Georgia, is confident that Roger’s puppies/Rock Springs Labs,  will be excellent, you see. So I called him to put a deposit down.\n\nJen  is also aware that, as I have a traumatic brain 🧠 injury.  I’m extremely impulsive.  I feel desperate for a dog, as my Labradore, Love, of 16 years, is no longer alive on this earth.  I’d given him my visa # and Information after talkIng to him only once.\n\nJen talked to him at one point.  She told me he wasn’t going to run my Visa deposit  it yet.\n\nJen, the honest trainer who I’m choosing,  and I and maybe Katie, will drive up to Alabama when the puppies  are born.  Jen tells me she will be there selecting my puppy, using something like 10 different dog assessment tests to choose the exact one that will be  just for me and the puppy will be at something like 8 weeks of age when she’ll Know if any of the puppies are right just for me, after we drive to Alabama one day.🐾🐾🐾🐾🐾🐾\n\nI am so glad that I have chosen Jen as my trainer and have chosen this🐾🐾 Rock Springs Labs 🐾🐾breeder.  He really is a sweet man.  🐾\n\nI believe that Roger is waiting till Jen finds the right dog for me.   I can barely wait to get a therapy dog / service dog in from Rock Springs.   This man, Rock Springs Labs, also knows his dogs 🐾well, Jen says.  (There is also a man named John who is involved at the Rock Springs Labs breeder.  I just talk to Roger because Jen gave me his number.)  I believe this breeder is also helping out veterans with the dogs.  Be sure and ask Rock Springs Labs all about 🐾themselves, they know what they are doing.  I’m so glad I’m trusting Jen and that I’m trusting Rock Springs.  I still miss my 16 year young Black Labrador named Love.   I know no other dog will be exactly like her.   I believe in this breeder and that he has extra excellent dogs.🐾🐾🐾🐾🐾🐾🐾🐾🐾🐾🐾🐾🐾🐾🐾🐾", "pics": null, "resp": null, "gmap_id": "0x8889ea68ba99409f:0x366fede12cfca540"}
{"user_id": "117811528663401702745", "name": "jackson harrison", "time": 1542764276655, "rating": 5.0, "text": "Great place with great service", "pics": null, "resp": null, "gmap_id": "0x8889ea68ba99409f:0x366fede12cfca540"}
{"user_id": "114983896444726772434", "name": "Chris Buffington", "time": 1555278878565, "rating": 5.0, "text": "Great breeder", "pics": null, "resp": null, "gmap_id": "0x8889ea68ba99409f:0x366fede12cfca540"}
{"user_id": "116908281853930668208", "name": "Vivian Kaplan", "time": 1613423100122, "rating": 5.0, "text": "Golden doodle Galore Puppies breeds Happy & healthy puppies  only a responsible Hobby Breeder can offer.  Well Socialized, loved, trained, UTD SHOTS, health guarantee.  Puppies are raised in a immaculate environment.  By far the best breeders!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNYsjO7rwrDGM_jNXDDy0Yt-oH97DAICgepCZRA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN00MQ84v-u6iz5YBr00IdlPLhYijxxwfT7DGVA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPQ57x46mKea4b8Pp17MvvJxozAPx1EVP7R35fl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO3gVqlXmuGXf0vk4zIHeuKh71SXRyV8bvSVeW0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPvcZRy6Gv7YFzf83KlqoTWR9KiLCp8plD7_7F0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOO4vBwGhjmPQYXDRdvSrkQKfPaP44U4-cBEPcn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNYDMNEUaXRiv2ZnCyHlxSXp7-_jqeacO3GWTl0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNPVMF2WpPa_7mN6GFnvDuWerkoM4DKSga151ww=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOCbDTIMhSZI8t1lazSQBmG592O03FxLpRzwRPE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOi7rU5jnE9V-43HTWxinNKJR1eVy51HbZ1Nyx0=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889e7785f728fe5:0x4e9e2b009d4c31d1"}
{"user_id": "106633050980042227473", "name": "Michael Mitchell", "time": 1575693216416, "rating": 5.0, "text": "Really pleasant experience.", "pics": null, "resp": null, "gmap_id": "0x8889e7785f728fe5:0x4e9e2b009d4c31d1"}
{"user_id": "102590565632504306760", "name": "Patricia Pritchett", "time": 1558802501020, "rating": 5.0, "text": "Very good work and report with animals", "pics": null, "resp": null, "gmap_id": "0x888610348f89673f:0x78efc924bc026ff7"}
{"user_id": "106120100982703671232", "name": "Kathy Phillips", "time": 1544806985771, "rating": 5.0, "text": "Lovely woman helpful knows alot", "pics": null, "resp": null, "gmap_id": "0x888a3176b44fbfb7:0x811fa0a817ce0cc4"}
{"user_id": "109424560353728160009", "name": "Cee Wadd", "time": 1628132134349, "rating": 5.0, "text": "Best Kennel I’ve ever seen…Beautiful Dogs… Owner knows his stuff and takes very good care of his dogs… A1 breeder ⭐️⭐️⭐️⭐️⭐️", "pics": null, "resp": null, "gmap_id": "0x888ccc01343dc67f:0x4f64e776ee4ea1b2"}
{"user_id": "110503895052841100824", "name": "Clarence Hunter", "time": 1594503170336, "rating": 1.0, "text": "I don’t want to leave bad comments so I’m just going to give a 1 star", "pics": null, "resp": null, "gmap_id": "0x888ccc01343dc67f:0x4f64e776ee4ea1b2"}
{"user_id": "112656363802016745569", "name": "George Bennett", "time": 1519166019234, "rating": 5.0, "text": "Great breeders and dogs!", "pics": null, "resp": null, "gmap_id": "0x888ccc01343dc67f:0x4f64e776ee4ea1b2"}
{"user_id": "106118153697196592516", "name": "Allen Battle", "time": 1530977400086, "rating": 5.0, "text": "Best dogs in the state", "pics": null, "resp": null, "gmap_id": "0x888ccc01343dc67f:0x4f64e776ee4ea1b2"}
{"user_id": "105993860508485024478", "name": "Joann Loader", "time": 1620070685336, "rating": 5.0, "text": "Harlan & Vicki are the nicest people. They have the cuties full bred hound dogs for sale. I wanted them all.\nHey, they also sell tires (Hilltop Tires)", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNb-5e1ccOmv3IJryH7ajQf01ztwz5UYFOTHXGg=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862f7f792125025:0xf56abb965b14856"}
{"user_id": "105352474289154829659", "name": "Wendy Kaye Dial", "time": 1607195402837, "rating": 4.0, "text": "They have some pretty puppies but most of them are very expensive.", "pics": null, "resp": null, "gmap_id": "0x8889e7a82e655d29:0xec92be01bed5b89a"}
{"user_id": "109588445864159865103", "name": "Randy Byrd", "time": 1584622399641, "rating": 5.0, "text": "I found the puppy I was looking for.", "pics": null, "resp": null, "gmap_id": "0x8889e7a82e655d29:0xec92be01bed5b89a"}
{"user_id": "105060588449626308117", "name": "David York", "time": 1566089209845, "rating": 5.0, "text": "Strongly recommend", "pics": null, "resp": null, "gmap_id": "0x889275468564b245:0xc8389df950cbd700"}
{"user_id": "111087626308693742935", "name": "April Crysel", "time": 1575559360875, "rating": 4.0, "text": "Great looking schnauzers and some beautiful", "pics": null, "resp": null, "gmap_id": "0x88929ec231971a37:0x21e6ee835fe58cd5"}
{"user_id": "104163584435539044032", "name": "Bob Sanders", "time": 1548682153432, "rating": 5.0, "text": "Wonderful family who keeps the dogs and puppies in clean place", "pics": null, "resp": null, "gmap_id": "0x88929ec231971a37:0x21e6ee835fe58cd5"}
{"user_id": "110753734819070363973", "name": "Lynn Rahn", "time": 1572606272599, "rating": 5.0, "text": "Love schnauzer", "pics": null, "resp": null, "gmap_id": "0x88929ec231971a37:0x21e6ee835fe58cd5"}
{"user_id": "109463796924965264261", "name": "Kristen “Mimi” Melendez", "time": 1540253572699, "rating": 1.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x88929ec231971a37:0x21e6ee835fe58cd5"}
{"user_id": "107026521874063446787", "name": "Tanya Stanley", "time": 1621562327307, "rating": 5.0, "text": "The owners are very nice.  They were patient answering all my questions and allowing me time with the pup I was thinking of purchasing w/o pressuring me into a sale.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMsol9gDlc9eIhEzqyqDf3AHD14CamEOoh5Vajq=w150-h150-k-no-p"]}], "resp": {"time": 1621564789349, "text": "Thank you Tanya! We just want any of our babies to be in a loving home and the perfect fit for the family"}, "gmap_id": "0x888a8becae59e539:0xc35cf777dcbad1d6"}
{"user_id": "104150799925535003907", "name": "Shakeita Hendricks", "time": 1618272468023, "rating": 5.0, "text": "Mrs. Holly is the best breeder I know! She was extremely nice and very helpful when it came to getting my Great Dane furbaby! She made the entire process a breeze and now I have a new forever companion! He is so energetic, loving, and beautiful. I would highly recommend this breeder. She really cares about her babies and it shows!", "pics": null, "resp": {"time": 1618273168667, "text": "Thank you so much. If you need anything please feel free to contact me"}, "gmap_id": "0x888a8becae59e539:0xc35cf777dcbad1d6"}
{"user_id": "101439746789556697261", "name": "Crystal Covey", "time": 1620134291754, "rating": 5.0, "text": "We bought our sweet Great Dane Sunni from Hollee , she is a wonderful breeder and has been there for any questions or concerns . I would highly recommend her puppies . Sunni has been such a wonderful addition to our family. She’s such a smart dog with an amazing temperament!", "pics": null, "resp": {"time": 1620134706464, "text": "Thank you so very much!!"}, "gmap_id": "0x888a8becae59e539:0xc35cf777dcbad1d6"}
{"user_id": "101040859031606581730", "name": "Tracey Bishop", "time": 1618234540267, "rating": 5.0, "text": "AWESOME breeder! I've had the pleasure to work with Holly on several occasions and she is the most professional and responsible breeder I know. I'm so thankful for her and her knowledge of the breed. She has answered MANY questions for me over the years. I HIGHLY recommend her and her services. She goes above and beyond her responsibilities as a breeder. She guienaly LOVES all of her furbabies. They are all her babies❤", "pics": null, "resp": {"time": 1618234739390, "text": "Thank you so much!!"}, "gmap_id": "0x888a8becae59e539:0xc35cf777dcbad1d6"}
{"user_id": "101559967879703989791", "name": "Danielle Frost", "time": 1618689358671, "rating": 5.0, "text": "Love her! She was so easy to work with and answered all of my questions and kept me updated with pictures of my new puppy as he grew until time to pick him up! He has the best temperament! Really couldnt have asked for a better dog! He is a big beautiful brindlequin!", "pics": null, "resp": {"time": 1619653817518, "text": "Thank you so much"}, "gmap_id": "0x888a8becae59e539:0xc35cf777dcbad1d6"}
{"user_id": "112637081870591796995", "name": "Cheryl Long", "time": 1619644180295, "rating": 5.0, "text": "I have purchased two of my furbabies from Holly. She  is friendly and makes the process easy. She makes the puppies part of her family for the time she has them and you can tell they have been loved and taken care of when you pick them up. I highly recommend Hollee’s Danes!", "pics": null, "resp": {"time": 1619653844748, "text": "Thank you so much"}, "gmap_id": "0x888a8becae59e539:0xc35cf777dcbad1d6"}
{"user_id": "108447637095181895006", "name": "Robie Lynn Watwood", "time": 1609283942301, "rating": 5.0, "text": "This place is awesome.. Holly has some Beautiful Danes", "pics": null, "resp": {"time": 1619653872804, "text": "Thank you"}, "gmap_id": "0x888a8becae59e539:0xc35cf777dcbad1d6"}
{"user_id": "104047171552848694880", "name": "Roger B.", "time": 1527312481975, "rating": 4.0, "text": "Terry and Holly have a great farm, with a unique experience from goats to bunny rabbits . Dogs, and Hogs, and lots of farm fresh eggs from all the chickens. You definitely can't find any nicer down home folks to buy or learn from. No matter what animal your looking for call them first you will be glad you did.", "pics": null, "resp": null, "gmap_id": "0x888a8becae59e539:0xc35cf777dcbad1d6"}
{"user_id": "103463387145504797791", "name": "Jennifer Andrasko", "time": 1562779208780, "rating": 4.0, "text": "Food was good just expensive. $10 for 1/2 cup alligator. Coupons at alligator alley entrance.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipODJwth-JtjLvBbOHkTB6jMWu5or9brEoOGW-D2=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a56647b0da6fb:0x3a86b2172d7f47c2"}
{"user_id": "104186857667142205186", "name": "Abu Anas", "time": 1559495150995, "rating": 4.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x889a56647b0da6fb:0x3a86b2172d7f47c2"}
{"user_id": "112753005789350929607", "name": "Victoria Hippensteel", "time": 1571217643920, "rating": 3.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x889a56647b0da6fb:0x3a86b2172d7f47c2"}
{"user_id": "117828330202332074232", "name": "Kevin Pych", "time": 1608836384491, "rating": 5.0, "text": "Five star service all the way!   Had an awesome experience with Dominique from CedarBluff Rottweilers.  As a high school football coach in South Georgia time is limited and Dominique was truly as joy to do business with as a first class establishment.  Awesome person and dog breeder. There are some beautiful, strong, and perfect Rottweilers in Alabama at CedarBluff Rottweilers.\nThanks,\nCoach Pych", "pics": null, "resp": null, "gmap_id": "0x888f7dc7ae19f999:0x2ade4abd809c8f0f"}
{"user_id": "113205387716457223824", "name": "Lakendra Cook", "time": 1596026483088, "rating": 5.0, "text": "I would like to thank CedarBluff Rottweilers for the exceptional experience with the purchase of my puppy. Dominique    went over and beyond to ensure I was all around satisfied by providing quality photos, answering all my questions and concerns. I couldn't have found a better place to purchase my puppy. I would recommend CedarBluff Rottweilers for an awesome experience. Thank you.", "pics": null, "resp": null, "gmap_id": "0x888f7dc7ae19f999:0x2ade4abd809c8f0f"}
{"user_id": "108511770808616848184", "name": "Holly Sandbothe", "time": 1595983729125, "rating": 5.0, "text": "We bought our Rottweiler puppy from CedarBluff in May and every moment from the first contact was excellent!! We signed our contract, reserved with a deposit and paid the remaining when we picked him up. It was wonderful getting to meet the whole bloodline and other puppies! We will buy again in the future! Thanks so much CedarBluff for breeding such a beautiful Rottweiler pup!", "pics": null, "resp": null, "gmap_id": "0x888f7dc7ae19f999:0x2ade4abd809c8f0f"}
{"user_id": "114214586754757790590", "name": "Kris Hall", "time": 1595458027623, "rating": 1.0, "text": "This is possibly a scam, in which i'm now having to go through litigation just to receive my  $500 deposit back. AKC also said they have no one by this name registered with them. Take my advice and go with a more professional/reputable breeder", "pics": null, "resp": null, "gmap_id": "0x888f7dc7ae19f999:0x2ade4abd809c8f0f"}
{"user_id": "103962291345897956119", "name": "Jennifer Gordon", "time": 1605374798555, "rating": 1.0, "text": "Poor customer service. I contacted this company via Facebook and the owner opened the message and has not responded. I also posted in the group asking for pictures of his current litter that a deposit has been paid on and I have yet to receive a response. My post was actually deleted. RUN!", "pics": null, "resp": null, "gmap_id": "0x888f7dc7ae19f999:0x2ade4abd809c8f0f"}
{"user_id": "109247583177038652043", "name": "Tina Sims", "time": 1538774062726, "rating": 3.0, "text": "Seems like a great place", "pics": null, "resp": null, "gmap_id": "0x888f7dc7ae19f999:0x2ade4abd809c8f0f"}
{"user_id": "111327306185900622989", "name": "Calem Strother", "time": 1526931706809, "rating": 5.0, "text": "Awesome...great people", "pics": null, "resp": null, "gmap_id": "0x888f7dc7ae19f999:0x2ade4abd809c8f0f"}
{"user_id": "108160379411142943894", "name": "Cassandra Reese", "time": 1515341835000, "rating": 3.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x888f7dc7ae19f999:0x2ade4abd809c8f0f"}
{"user_id": "118085213419341756468", "name": "Amber Goode", "time": 1617683656737, "rating": 5.0, "text": "Drove to Alabama from WI to pick up a puppy. Myranda was very kind and knowledgeable. She was patient and answered all of my questions and concerns.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMOi_9IIz-VWVhSeCm0K2KTr2bvQiPvRByEFRkF=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88929141fdc8f1cb:0xb915f936aebfe15c"}
{"user_id": "100516147121101960237", "name": "Dave", "time": 1614732518297, "rating": 1.0, "text": "RESPONSE TO OWNER:\nSorry didn't realize I was under my husbands google account. Look up messages and comments from Sheila. I bet you'll find me. PS, I never said anything about phone calls, emails, texts, or Instagram...only Facebook.\n\nI'm in the market for another long coat german shepherd but it's been days and they won't respond to any of my facebook messages or the comments I leave on their posts where they advertise available pups. They are active on Facebook so I know they are just choosing to ignore my inquiries. Find a breeder that is actually willing to communicate with you.", "pics": null, "resp": {"time": 1614729608062, "text": "We have received no message or phone call from a dave.  We appreciate your input.\n\nUpdate, I have went back two weeks on messages both Facebook, email, text and Instagram. No messages from a dave.\n\nSecond update, it seems I did respond back it you two times and you never said anything back about the sky and erica breedings. As for your interest with my black male, he was not a good fit for your family. Unlike most breeder if I feel you are not right for a certain puppy we will not sell. Good luck in your search and have a nice day."}, "gmap_id": "0x88929141fdc8f1cb:0xb915f936aebfe15c"}
{"user_id": "106791048803148442799", "name": "Ivica Djordjevic", "time": 1620459730335, "rating": 5.0, "text": "Breeder who knows his job very well and who offers quality that is hard to find", "pics": null, "resp": null, "gmap_id": "0x88929141fdc8f1cb:0xb915f936aebfe15c"}
{"user_id": "103416022249683082602", "name": "Mark Britt", "time": 1601414185005, "rating": 5.0, "text": "Amazing dog breeder!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPYgkQJZGV35R3T_QvTzrYTpDu7a77h812I4VSb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOZyKEF5iCxEEI-JSzvW03Srhnncjmfsn_jdKRL=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88929141fdc8f1cb:0xb915f936aebfe15c"}
{"user_id": "101147239451025712095", "name": "Ryan Hackworth", "time": 1581984643052, "rating": 5.0, "text": "Myranda is highly knowledgeable about gsd, she has a extensive amount of hours in the breed. I researched breeders for hours and couldn’t be more pleased with my new gsd from her. If your in the need for a quality gsd look no further.", "pics": null, "resp": {"time": 1582461432192, "text": "Thank you Ryan and Hannah, it was pleasure working with you guys!"}, "gmap_id": "0x88929141fdc8f1cb:0xb915f936aebfe15c"}
{"user_id": "102911509503552382707", "name": "Charles Gunter", "time": 1606504957398, "rating": 5.0, "text": "Great experience\nAnswered all my questions and then things I hadn't even thought off. I have already ask for a puppy this time next year.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMigF-aOwAYf3g8IQ1mxvsX5--ydR_yHkuDNzwM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPBt4tqogU9WjwqJlMaLmjNB5ELxYRdFeOFl4_X=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889d1bbc914dd55:0xfcf9aa97f5877c4f"}
{"user_id": "114853966741947474075", "name": "Janice Hubbard", "time": 1621271277374, "rating": 5.0, "text": "Bought a fabulous puppy from this lady .  She is a great ,professional breeder.  We could not be any happier with the whole procedure.  Absolutely in love with our  Maggie Mae.", "pics": null, "resp": null, "gmap_id": "0x8889d1bbc914dd55:0xfcf9aa97f5877c4f"}
{"user_id": "109799618878597199722", "name": "Emery Harkins", "time": 1620693437757, "rating": 5.0, "text": "Love their fries", "pics": null, "resp": null, "gmap_id": "0x8889d1bbc914dd55:0xfcf9aa97f5877c4f"}
{"user_id": "104253630246964979511", "name": "Marcia Erickson", "time": 1580433010656, "rating": 5.0, "text": "My mom just got a puppy from here. I live out of state and the owner was always so gracious to let us come out and visit the puppy at Thanksgiving and Christmas when I was in town before my mom brought her home at New Year's. Great owner, great facility,  great training, great pups!", "pics": null, "resp": null, "gmap_id": "0x8889d1bbc914dd55:0xfcf9aa97f5877c4f"}
{"user_id": "110753734819070363973", "name": "Lynn Rahn", "time": 1573593513445, "rating": 5.0, "text": "This my little boy. I miss him he pass away in August 7 his name is Frisco.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNhmDnZax3IvgkdX9DpFQD9d6U0ruRL_JXcA33W=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889d1bbc914dd55:0xfcf9aa97f5877c4f"}
{"user_id": "100214103204547472450", "name": "steve t", "time": 1605967667712, "rating": 2.0, "text": "Left several messages on site and emailed but did not get a response from them", "pics": null, "resp": null, "gmap_id": "0x8889d1bbc914dd55:0xfcf9aa97f5877c4f"}
{"user_id": "102633276163678016806", "name": "Freak 13", "time": 1584376105284, "rating": 5.0, "text": "Got 2 babies from Doris they're just great they've both remained happy and healthy", "pics": null, "resp": null, "gmap_id": "0x8889d1bbc914dd55:0xfcf9aa97f5877c4f"}
{"user_id": "103375042603043859130", "name": "Ben Payment", "time": 1610377589535, "rating": 5.0, "text": "Doris is great!", "pics": null, "resp": null, "gmap_id": "0x8889d1bbc914dd55:0xfcf9aa97f5877c4f"}
{"user_id": "111499636020326286466", "name": "John Bishop", "time": 1515433393355, "rating": 5.0, "text": "Pro breeder of Minature Schnauzers. Been in business for over 20 years. Top of the line. Not a puppy mill.", "pics": null, "resp": null, "gmap_id": "0x8889d1bbc914dd55:0xfcf9aa97f5877c4f"}
{"user_id": "114134735625348049583", "name": "CHERYL MANGINO", "time": 1553813186656, "rating": 5.0, "text": "Very highly recommended.", "pics": null, "resp": null, "gmap_id": "0x8889d1bbc914dd55:0xfcf9aa97f5877c4f"}
{"user_id": "103988546428775738447", "name": "Marissa", "time": 1623880361939, "rating": 5.0, "text": "Jim and Marylee are some of the best people you'd ever meet. They love and care for all of their dogs. Their facility is always clean, you even have to sanitize your shoes before coming in. I got both my dogs from them and they are the best dogs I could have ever asked for. They take great care of my dogs while boarding as well!", "pics": null, "resp": {"time": 1623886766840, "text": "Thank you keep in touch"}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "117288382383426118150", "name": "Blake McCranie", "time": 1586744386580, "rating": 5.0, "text": "We got our Husky a little over 10 months ago from Jim and we can’t say good enough things about the whole experience!  You can really tell they care for the dogs so much and are always available when needed.   Our little Luna is probably the sweetest dog we’ve ever had.  💯% recommend!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM4c24GI5wqhYVFZ2iZiMSKMGsOAWC8cvKKYhzy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOwUUj3vsbG0nKbrZDVe6u66IjKi_ovhBKvWbJX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPKyTNQJ-USytrDzTrclmVrLKNa7P6YwH4MN1l6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMKWIWJi0dKIyYlv2Qu76YqvPemYjKY-qVydU2b=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNzoQo2iwW_6wi0T557LopH0bXBZ4OIGZLfkhmg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOFLEcHt2y6H61fDMYB_WED0x7NmGuw3SMJnymy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOtlFjrcrdM73JHJQVubkVcKAHR23FjO2qEgkiC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPWCFd8P0fnocOw62fZUc6IgKWqZpnZWzP3CO-M=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO9Gnn4w5pyVm_GuaB_1DopEVXREnj4glsv6CV3=w150-h150-k-no-p"]}], "resp": {"time": 1589840399049, "text": "Thanks Blake please keep us informed about your bama husky"}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "104437891973259952479", "name": "Scott Demoss", "time": 1617065556533, "rating": 5.0, "text": "We decided during the start of the pandemic that our 1 year old Siberian husky needed a pack mate. After some research, we landed on Bamahuskies. Although the wait is long, it is worth it. We picked up our newest pack member Friday.  The facility is clean and well kept. We were greeted by the girls as well as Jim the owner. The ease of the whole process was by far the easiest we have experienced. Our newest member got an A+ from our vet along with some spoiling. We will definitely be putting our names on the list again for another pack member when the time is right. I can guarantee you won’t be disappointed!!", "pics": null, "resp": {"time": 1617066507572, "text": "Thanks and keep in touch. We want to see that baby grow up in pics."}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "117564412196388446994", "name": "Lara Reno", "time": 1621630526420, "rating": 5.0, "text": "We love bama huskies! The kennels are clean and very well kept. We have nothing but good things to say about our experience with them.", "pics": null, "resp": {"time": 1621636709098, "text": "Thanks for your honest review we work hard to have a nice place for our huskies."}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "102430023485819908372", "name": "Kobe Robinson", "time": 1608662248391, "rating": 5.0, "text": "We just got our puppy from him, I highly recommend getting a husky puppy from him. He has done a outstanding job by making sure the puppy has been well socialized, potty trained, and well groomed before it goes home. He will even give your dog a nice bath before it goes home which is wonderful. His kennel is very organized & smells great his adult dogs will be happy to greet you as you pull up. If you are in search for a husky puppy please don’t hesitate to contact him about one, his waiting list is kinda long but he will get to your name before you know it and you won’t regret the wait at all. I give you a 10/10 I highly recommend bamahuskies to anyone.", "pics": null, "resp": {"time": 1608668749755, "text": "Thanks for the review and keep in touch. We love seeing our babies go to great families like yours."}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "114140384363111300724", "name": "Ashley S Johnson", "time": 1613141626252, "rating": 5.0, "text": "We love our boy. Bama Huskies breeds healthy dogs.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM7VAxEk9JXw5ayOlOP8seAexwV2TM45J5AKJli=w150-h150-k-no-p"]}], "resp": {"time": 1613145539925, "text": "Thank you and glad your boy is doing great!"}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "112145707511800228768", "name": "Nicole Wilson", "time": 1605727876983, "rating": 5.0, "text": "Bama Huskies is an amazing facility with amazing people/dogs/puppies. My husband and I went on a tour of the facility a couple years ago and decided this was where we were going to get our puppy. The facility was spotless (I mean literally spotless) and the whelping/nursery buildings were so nice! You can tell by the looks of the facility that everyone at Bama Huskies takes so much pride in their work. All the dogs were so friendly and were very well groomed and healthy. Jim was so very nice and explained the process/waitlist. Once we were ready Jim was extremely helpful throughout the process and responsive to my questions. We are patiently waiting to pick up our puppy next month. I can’t say enough wonderful things about Bama Huskies!", "pics": null, "resp": {"time": 1605734779673, "text": "Our pleasure thank you very much"}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "104934875664089227423", "name": "Wolf", "time": 1614653067787, "rating": 5.0, "text": "Great place. Wonderfully clean and tidy. The owners are very kind and open to any questions. They post daily on Facebook and are always willing to answer any questions!", "pics": null, "resp": {"time": 1614968098440, "text": "Thank you."}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "118381151456973326752", "name": "richard fornero", "time": 1614116838856, "rating": 5.0, "text": "Beautiful Huskies and they are the nicest people. If you need a Husky you won't do any better. AND CLEAN as can be.", "pics": null, "resp": null, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "114162429208379736402", "name": "Christine Chambe", "time": 1616802762333, "rating": 1.0, "text": "After putting our name and a deposit down for a puppy we waited for over a year with no puppy. The owner was not responsive and always said they would get back to us but never would. We reached out on numerous occasions but never heard back.", "pics": null, "resp": {"time": 1616808008946, "text": "Sorry but we are very responsive and have a phone number, email, and you could contact us through various social media messaging. I have looked up your name and it was not used to pay a deposit, nor have we corresponded by email through this name. If you are really on our waiting list under a different name please contact us so we can get this resolved. I do not want you having a deposit with us and feeling like you are not getting the service you deserve from us. Calling us will be the best way. I look forward to hearing from you and you updating this review based on how we worked to get this resolved.\n\nUPDATE\nAfter waiting to eagerly help this customer we was not contacted and provided any details so we could get this resolved for this customer. I will have to assume it was fake."}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "111825441873670499180", "name": "Kimberly GRIFFITH", "time": 1604889360840, "rating": 5.0, "text": "Bamahuskies is awesome. We found them June of 2019 after our boxer passed away, got put on their waiting and got our dog Loki on January 5, 2020.  They are wonderful people and truly love all of their huskies. Their huskies are very well socialized, and friendly. We could not ask for a better husky than Loki. He is very smart, doesn't meet a stranger, loves every dog he is around,, and was very easy to housebreak because of the time they spend with their puppies. We are getting another  husky from them in December and we are very excited to have another Bamahuskies", "pics": null, "resp": {"time": 1605009516580, "text": "Thanks so much for the review Kimberly and Loki is a beautiful dog."}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "107881738812618577111", "name": "duran chappell", "time": 1610058617039, "rating": 5.0, "text": "They have a good breed of dogs nice clean place and great people looking for a husky it the place to go", "pics": null, "resp": null, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "110296209831285947689", "name": "Katrina Myers", "time": 1614958653326, "rating": 5.0, "text": "Cleanest kennels, friendliest and knowledgeable people and the happiest pups anywhere", "pics": null, "resp": {"time": 1614968063671, "text": "Thanks so much for the kind and honest review."}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "109336060309825835114", "name": "Hannah Proctor", "time": 1601405654926, "rating": 5.0, "text": "Awesome breeder! Highly recommend them!! Pups are all adorable. You can tell that the puppies are well cared for!! We purchased Asa from them and absolutely love him!!!", "pics": null, "resp": {"time": 1601420584437, "text": "Thank you Hannah and please keep us informed with pics and stories on how your Asa is doing. We love seeing our babies living life and being happy with their families."}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "116349505704710896779", "name": "Larissa Danek", "time": 1586716905672, "rating": 5.0, "text": "I highly recommend this breeder! We LOVE our Lailah! We toured the facility before we considered getting out puppy and the kennel was immaculate—like, I was taken aback with how clean it was. They have a spacious property with more than enough room for the puppers to roam—they even have a pool! There’s also a climate controlled nursery for the puppies, providing full comfort for the newborns. Jim and his wife are very knowledgeable, and genuinely nice people. All the dogs look really happy and excited to greet people, which proves that they’re well socialized and loved. Jim knows every single one of his dogs tremendously well. He answers any questions you may have, even after you bring your puppy home. I can’t say enough good things about BamaHuskies. The dogs are healthy and on an extremely good diet. They come home happy and healthy. And if you ever have to travel, Jim loves having the dogs board with him during your trips.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOdhp1pFNgBBJiLmuHt3H66UVRtKE_YqcVKXeO0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPrtf0pChf7aINNrSih0H8qXIOQZHUPqW3RIin_=w150-h150-k-no-p"]}], "resp": {"time": 1589840435058, "text": "You got a loud mouth girl lol. She is just so sweet."}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "102045082550745386055", "name": "Sarah", "time": 1600526443601, "rating": 5.0, "text": "Very clean and amazing place to meet and get Huskies!! They're very knowledgeable and friendly there too!", "pics": null, "resp": {"time": 1601420635877, "text": "Thank you Sarah."}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "102010566239302153879", "name": "Michelle Soto", "time": 1560123176650, "rating": 5.0, "text": "We have purchased two Huskies from Mr. Jim and his wife. They are a lovely and wonderful couple, their facility is clean and spacious for their dogs. I wouldn't go anywhere else but here, they make you feel like home!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPzhcw1s1DD4HWqEAsDtEpb_hEJ3fSVBjPxiuPX=w150-h150-k-no-p"]}], "resp": {"time": 1560208078901, "text": "Thank you Michelle and we really appreciate your business and confidence to let us be your breeder of choice for your huskies. I know you could have picked a thousand other places."}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "105968403277342475966", "name": "Leah Luke", "time": 1567101543775, "rating": 5.0, "text": "I can’t say enough about Bama Huskies. Jim has top quality Huskies! We took Zeus Jr. (Holly/Zeus) to the Vet and she was super impressed from his shot records to the vitamins and the food he is taking. Bama Huskies put so much love and care for their Huskies and it shows! The kennels are so nice and clean! We love our little guy so much and we thank you so much Jim!", "pics": null, "resp": {"time": 1567119470771, "text": "Thank you for trusting us to be the breeder you got your baby from."}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "116653666638948551701", "name": "Supernatural Mystic", "time": 1611797533487, "rating": 5.0, "text": "Can't wait to visit!", "pics": null, "resp": {"time": 1611846159938, "text": "Thank you we look forward to it also!"}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "103210632195328687939", "name": "Nelson Hua", "time": 1589830681759, "rating": 5.0, "text": "I’ve had my Ellie for about two weeks and I’ve got to say that she is the most intelligent 11 week old Siberian Husky puppy ever! She was easily crate and potty trained in about 2 days, learned commands such as sit and come very quickly and is just a joy to have around! In the two weeks I’ve had her, she’s also learned to be able to climb up and down my stairs by herself which I was very surprised with. The wait list is a little long, I put my deposit down in October of 2019; but the wait was so worth it! Jim always answered my questions and his expertise as a breeder shows in the quality of my Ellie! I recommend bamahuskies even if you aren’t close to them (I’m in Columbus, Ohio) as you will be adding a great puppy to your family!", "pics": null, "resp": {"time": 1589840175670, "text": "Thank you so much for the kind words and please keep us updated on Ellie. She was our baby too and we know she has a great family."}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "103309703151996799640", "name": "zach tolleson", "time": 1509041453793, "rating": 5.0, "text": "Wonderful breeders friendly and helpful, the Huskies are beautiful, we are on the waiting list.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMmjRmphGtM3UsIogu2hUNX8VRGUhQL9c8VoY02=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNS8YqS2awMkASzzwdrtGGhvcpENnYLpfoMGl_8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPC5Bxx7qwtJ70PCr0G0CkQ34yHOvZzDKfFwLL5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNYKBke8Kk-g7Yewk3Y4OzhKDZrzNQshMfvUrxq=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "113743756752346151394", "name": "Randy Ball", "time": 1585155786893, "rating": 5.0, "text": "This is a fine place couldn't be better satisfied the place is very clean and the dogs and pups are very well taken care of", "pics": null, "resp": {"time": 1589840466001, "text": "Thank you Randy. We want the best for our dogs and puppies."}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "115459102784878302198", "name": "Skates Andrew", "time": 1539959124611, "rating": 5.0, "text": "Bama huskies. Let me tell you about them. The day I found the right pet or should I say pets as I have multiple huskies now from them. I have fell in love all over again. Jim at Bama huskies is one Knowledgeable and professional when it comes to Breeding Siberian huskies. His kennel is what you would consider top notch. All the huskies in his kennel are amazing will all sorts of colors and beautiful markings. When you want a pretty huskies pup with champion bloodlines you come here. They will forever have my business and if your in search of a Husky this is the right place to be. My Ari and Marlee are my world!", "pics": null, "resp": null, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "117088185011129391654", "name": "Cara (Cara)", "time": 1584379513411, "rating": 5.0, "text": "Got my baby from here.She is all white blue eyed healthy sweetheart\n.I will recommend bama husky anyday.", "pics": null, "resp": {"time": 1584444932200, "text": "Thank you Cara. Please keep us updated on her progress."}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "113589324089494599408", "name": "Emily", "time": 1560581771870, "rating": 5.0, "text": "We have two BamaHuskies. Jimmy & Mary are great people, they care for the dogs so much & are always so helpful. We went out of town for our babies first birthday and they kept her and took birthday pictures for me. Can’t recommend them enough!!!", "pics": null, "resp": {"time": 1560618398670, "text": "Aww thanks for the kind words we do love all our babies!"}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "111970597636084113455", "name": "Julie Basile", "time": 1557371555504, "rating": 5.0, "text": "Jim is very nice! He is so knowledgeable about his dogs. He answered all of my questions. I will definitely buy my next puppy from him!", "pics": null, "resp": {"time": 1561237451059, "text": "Thank you Julie"}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "115751589609217772333", "name": "Madi Muniz", "time": 1566050255890, "rating": 5.0, "text": "Amazing place! All the dogs looked so happy when I was there and my dog Tantrum who we purchased from them is possibly the sweetest dog I’ve ever had.", "pics": null, "resp": {"time": 1566074496654, "text": "Awesome Madi glad one of our fur babies has made you a sweet dog. Thanks so much for the kind words about our kennels."}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "113380029379656436728", "name": "Zack Qualls", "time": 1545954380152, "rating": 5.0, "text": "An excellent breeder with top notch facilities. Jimmy is very knowledgeable. All the dogs and puppies are very well taken care of and receive the best of everything.", "pics": null, "resp": null, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "100462533153863782773", "name": "Daniel Guinn", "time": 1515866827448, "rating": 5.0, "text": "Great people, and love our new puppy!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPWut87Jxfh7ZfHmGTFQRFyJTJoAaW_Et7INISN=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "103117718475585331569", "name": "Chase Cockrell", "time": 1590351265992, "rating": 5.0, "text": "Fantastic 1st husky purchase", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPlJAbpxdNEeG3-Kr6A2AI-o-0f7tZxphGbJrJY=w150-h150-k-no-p"]}], "resp": {"time": 1590492080620, "text": "Glad you had a great experience."}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "110487688144901738676", "name": "Zavier De'Sine", "time": 1517734975856, "rating": 5.0, "text": "Loving , caring breeder. He is careful with their care, lavishes them with every luxury just an amazing family. The dogs were so well trained and sweet. But I love Huskies so I am biased towards huskies. So very glad I got to meet him. His dogs tend to be show dogs so they conform very closely to the breed specifics that the AKC wants for a show dog.", "pics": null, "resp": null, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "106614757313495848365", "name": "Susan Kay", "time": 1523534015730, "rating": 5.0, "text": "Great people raising/breeding high quality Huskies", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipODYm0LWCxhJ2m6nZ0fPWJF5SV6J0vkSJQBNTGk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOCB0JN4710e5JYhkyospfOxUZcUkGpQZq6BIQb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNKSZR8FSNjlPoQi2Os4QdavNdyUt3_jRxVf86e=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMIs91UfAog7vj7mgRxX06tVHiJ-mmKX1UryaMX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNzzPLc75ai0TwfZrNHFGAFBglu8t7Mr_3mBojH=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "110968370508795825858", "name": "Brandon Phelps", "time": 1516650872119, "rating": 5.0, "text": "After searching for a quality dog at a good price for months I found bamahuskies and drove all the way from Florida to pick him up. I couldn’t be happier with the puppy and the great service from Jim. I’ve only had the puppy from three days and he is extremely healthy, well mannered and you can tell he was well cared for. I’m very happy that I came to get my dog from them and I wouldn’t hesitate to drive this far to get another dog from them. 10/10.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNnQli67HAxvMoVr3Q-dRz1Wc8a48aw_nMYCE2y=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "105302189202301846200", "name": "Landon Rutledge", "time": 1491422380345, "rating": 5.0, "text": "Got my puppy from here. Breeders are so nice and helpful.. always open to a call if I have questions or anything... they also live their dogs. My puppy has excellent temperament, is people and dog friendly, and couldn't be a better companion. Would, and already have recommended bamahuskies to people I've met.", "pics": null, "resp": null, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "102822278942754240290", "name": "Jordan Halpert", "time": 1539880162007, "rating": 2.0, "text": "I contacted Bama Huskies with the hope to purchase a Siberian Husky puppy, I was slightly confused by part of his response and after expressing this misunderstanding, I received an extremely unprofessional and condescending message. As a business, the one who responded should know how to properly respond to potential clients, not talk down to them like they're above and act in a way that treats the potential client like an idiot.", "pics": null, "resp": {"time": 1539904553396, "text": "Have no clue what you are talking about or who you are. I think you must have us confused with someone else as we have never talked to you or sent a message to you. We would never talk down to customers and treat everyone with the upmost respect.  Just check our other reviews and you will see it's not consistent with this persons comments. Also see our reviews at https://bamahuskies.com/about-bama-huskies/customer-reviews/ and our  Facebook page."}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "109129007269422472236", "name": "Lillian Singleton", "time": 1561126545987, "rating": 5.0, "text": "It's was great, my grandsons got there, baby, Husky from there 😁", "pics": null, "resp": {"time": 1561237423797, "text": "Thank you and your family for giving one of our babies an awesome home!"}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "103395744359355017098", "name": "Betty Tidwell", "time": 1540579145031, "rating": 5.0, "text": "Absolutely love the owners and all the Huskies I would recommend them to everyone looking for a excellent husky breeder and a happy healthy puppy", "pics": null, "resp": null, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "107921644680718758836", "name": "Sunshyne Tarver", "time": 1536362639868, "rating": 5.0, "text": "We got our service dog from Bama Huskies. They are great people and the dogs are cared for like little kids. Would highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "113199446597041883521", "name": "Jo Watford", "time": 1602933972000, "rating": 5.0, "text": "Just looking around", "pics": null, "resp": null, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "112740506979069264566", "name": "Cissy C", "time": 1520663497361, "rating": 5.0, "text": "Husky heaven! Clean kennels and healthy fur balls !", "pics": null, "resp": null, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "112919197328313070321", "name": "Paula Hardin", "time": 1580772272505, "rating": 4.0, "text": "Love this place", "pics": null, "resp": {"time": 1581513431988, "text": "Thank you!"}, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "111658836001593454407", "name": "Benjamin Cevallos", "time": 1464668401890, "rating": 5.0, "text": "They sell cute  dogs", "pics": null, "resp": null, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "117284361893227510766", "name": "Brittney Wood", "time": 1499739306945, "rating": 5.0, "text": "Best Husky breeders!", "pics": null, "resp": null, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "114708056053802793156", "name": "Aditia Jawak", "time": 1441450139926, "rating": 5.0, "text": "(Translated by Google) Fiae concentrated too much concentrated too much fiae\n\n(Original)\nGiae miae fiae miae fiae giae", "pics": null, "resp": null, "gmap_id": "0x8889ea662a8ff60f:0x60714e53a123df28"}
{"user_id": "103203151594629357790", "name": "Jessica Creasman", "time": 1607479539458, "rating": 5.0, "text": "I own this. I'm a Doberman and Dalmatian breeder.", "pics": null, "resp": null, "gmap_id": "0x886034c8993df135:0x9c2951dd77e87a0d"}
{"user_id": "118101227635356217657", "name": "Joshua Creasman", "time": 1607281176976, "rating": 5.0, "text": "Great place", "pics": null, "resp": {"time": 1607283895484, "text": "Thank you!"}, "gmap_id": "0x886034c8993df135:0x9c2951dd77e87a0d"}
{"user_id": "112987680528129171856", "name": "Margaret Atchley", "time": 1563227067707, "rating": 5.0, "text": "Best vet around! Staff is friendly and everyone cares about your furbaby!  Wouldn't take mine anywhere else even if I had to drive 3 hrs! LOVE THIS PLACE!", "pics": null, "resp": null, "gmap_id": "0x88890eb25e69b5bf:0x85e329a4fc3fc47"}
{"user_id": "117920154596866413326", "name": "Keith Nichols", "time": 1523339147416, "rating": 5.0, "text": "They are above and beyond most folks experience.will see y'all soon", "pics": null, "resp": null, "gmap_id": "0x88890eb25e69b5bf:0x85e329a4fc3fc47"}
{"user_id": "114573519194864391979", "name": "april myers", "time": 1492158595327, "rating": 3.0, "text": "It has most amazing yard", "pics": null, "resp": null, "gmap_id": "0x88890eb25e69b5bf:0x85e329a4fc3fc47"}
