{"user_id": "108466384586763250993", "name": "Tanya Cardwell", "time": 1500517168445, "rating": 5.0, "text": "Quality pet sitting and dog walking in Denver!  Diana and Nicole take good care of my dogs every time we must leave town.  They have gone above and beyond.  The last time they arrived at my house for the first day visit, they were greeted with a stinky mess on the carpet.  No only did they clean up as best as they could, they contacted me to discuss what could be done to ensure my chow chow felt healthy.  Diana offered to give her dog-friendly over the counter medication to ease her stomach.   They send photos of your dogs, so you feel updated on how they are doing.  Diana was even willing to drive her to the vet, if I thought it would be helpful.  Attentive pet sitters!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMfxpAHDDOX2EJB7dto9BCmHJHEx1_ct_f8tNzC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPrhSUPDwn1YlrQXgZ6e6ROo4dUSI8Rfz1ZQvLN=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8892ec56e1d89d8f:0xd42a94c551051b7a"}
{"user_id": "107627520643556162197", "name": "Lindi Pearson", "time": 1620658909697, "rating": 5.0, "text": "Wonderful play groups and boarding. Great staff and always willing to give me reports no matter how many times I call to check up on the puppies. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "104591547120770070668", "name": "Jennifer Horn", "time": 1575414726621, "rating": 5.0, "text": "CDT isn't our normal boarder, but i almost effed up Thanksgiving by forgetting to schedule Jackie to board. Creative Dog Training came through for us!\n\nI couldn't believe they had room! And when we got there, they were SO NICE. Oh my gosh, i can't remember her name, but she was tiny & had dark hair like me. She was really able to make me feel confident about leaving him in their care.\n\nJack was having some hotspot issues, so she took his medicine & told me they keep a close eye on him. They also were able to put him in a play group for older dogs, which they posted pictures on Facebook every day! They also didn't care that I'm a helicopter dog mom & called every day to check. =)\n\nI was so excited, i burst through the door at the facility & announced i was there to pick up my dog. (I also may have done a little dance.) The little girl from before said Jackie's name before i even got a chance to! They really know & care about their clients!\n\nAlso, when i picked him up, they'd been taking such great care of his hotspots, they were almost totally resolved!! =O\n\n11/10 experience, will DEFINITELY board there again!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMSkfxO5B2ILW4q1t5_BAIcRDcZiQxpR_cPbOE2=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "106652102216028821162", "name": "Keith M", "time": 1566055993768, "rating": 5.0, "text": "Fantastic facility and knowledgeable staff.  They really work well with teaching us and especially our kids.  Can't say enough positive things about this place.  It's the only place to go for dog obedience.", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "100616861630247399043", "name": "Rebecca Whitaker", "time": 1559424783954, "rating": 5.0, "text": "I took my dog here for a class lesson and Mrs. Margaret was absolutely wonderful. She made the lesson easy and fun for my children and has certainly made a difference in my dog. She has a way with training not only dogs, but owners too! I would recommend Creative to anyone!", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "108937254577169480401", "name": "Madison Mindler", "time": 1516679645839, "rating": 5.0, "text": "The absolute best place in town!! I have worked here since 2016 and can only say great things. We take care of every dog like they are our own and have absolutely nothing to hide. You can come in anytime for a tour, talk to a client advisor, trainer, or supervisor. Every person has a passion for dogs and a drive to make Cdt the absolute best. I can’t dream of a better job and watching clients go home happy with their pup\nIs the best feeling ever!!", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "101034158037600406127", "name": "pitna kim", "time": 1574984203507, "rating": 5.0, "text": "My dog loves to go CDT and he seems like too much fun every visit :)", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "101198041656047181447", "name": "Shades Creek Dental Patient Centered Care", "time": 1523793825465, "rating": 5.0, "text": "I can not say enough about creative dog training! Our dog Sandy is always excited to go and play and comes home exhausted from all of the fun. The staff are clearly all animal lovers and take great care of your pets.  Also, if your pet needs any vet care, they work with a vet a couple doors down to take your pet back and forth for appointments! Thanks!", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "115358930161660601767", "name": "Amanda WR", "time": 1531251641076, "rating": 2.0, "text": "They were nice enough at the counter but when we picked our dog up, her paws and legs were soaked in urine and she was filthy. Our backseat had to be professionally cleaned to get the smell out. I don't know how they let the dogs get like that, perhaps not cleaning the play area well. Anyway, I called them and left a voicemail about this and never heard back.", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "112132546307488873353", "name": "chris collins", "time": 1492098891281, "rating": 5.0, "text": "Creative Dog Training is awesome. We bring our dog every Monday for continuing training and play time. He comes home smarter, tired, and happy as ever. We love our friends at Creative.", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "113984302384020257060", "name": "Lucy Phillips", "time": 1533358048127, "rating": 5.0, "text": "Highly recommend Creative Dog Training! They have done a fabulous job training my Siberian Husky and she LOVES doggie daycare! She’s always exhausted when she gets home!", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "110094694614305759377", "name": "DeKayla Sankey", "time": 1550343913106, "rating": 1.0, "text": "Very poor customer service. You have to consistently pester and call them, only to have them take down your name and number with a very empty promise to get back with you. THEY NEVER DO. I have been calling for a week straight and my problem still has not been resolved, but everytime I call they tell me how sorry they are. Tuh. I am a paying customer and feel very undervalued. I’ve been more than patient with them, but at this point I just want what I paid for, so I can be done with them. I will not be returning.", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "110074882337735478689", "name": "Everything Bham", "time": 1544313380046, "rating": 5.0, "text": "The owner and staff really care about you and your animals!  Never have had a bad experience! One of the best family owned businesses in bham! I believe in Birmingham!!", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "106535502830176826089", "name": "Lori Goldberg", "time": 1509328392627, "rating": 1.0, "text": "Do NOT take your dogs here!\nThis place is not sanitary. The workers leave dogs in pee and poop filled kennels for hours before they are cleaned.\nThe dogs don't go outside from 4pm to 7am the next day.\nThey have had 2 cases of kennel cough since spring break, and have still been using the same sponge to clean all of the dog bowls.\nIf your dog is having a health issue while boarding, the workers will not tell you about it if they don't think it's serious. There are dogs who get incredibly sick either from stress or other health problems that result in blood in the vomit and/or stool. The only thing they do is take the dogs food and water away and don't let them outside.\nThe dogs water bowls are only checked at 7am and then again at 4pm. So your dog may be going without water for any number of hours between those times and the workers will ignore it. The bowls are only cleaned once per day, so if your dog is boarding for several days, there's a very good chance that they'll have the same bowl of water over the course of their stay. They have a major rat problem there, so often times there is rat feces in the water bowls.\nThe dogs are left alone all night with the rats, which your dogs could be eating over night, making them very sick and possibly catching diseases.\nThe workers do not have first aid training, so if your dog chokes on the mulch that is outside in the play area, then they are told to \"look up an instructional video\" to help the choking dog.\nThey don't pay attention to what the dogs are doing because they're too busy on their phones to care. So if your dog poops mulch (very bad for his digestive system) then it's because they were eating it from the play area. There are also several dogs who eat poop, so if your dog has that habit, it's probably only getting worse because they think they're allowed to do it while staying there.\nWhen the dogs are playing outside, they are sometimes not given water for several hours due to certain dogs not liking the water hose.\nI have witnessed a coworker giving the wrong dog her medicine. Once that realization was made, still nothing was done about it.\nIf your dog is not good with other dogs, they are set as \"individuals\" where they play by themselves. These dogs are only getting 10 minutes outside to play, and then they get 10 minutes inside to play. They are supposed to have another 10 minutes to play but are usually skipped because the workers want to go home early. So if your dog is boarding over the weekend and they're not good with other dogs, then they're only getting about 20 minutes of outside time every day while the other dogs get over 2 hours.\nThe weekend hours are different, so all of the play groups are shortened and the dogs are left alone for a lot longer than they normally would be.\nTheir medicine is put in pill pockets in their food. If the dog doesn't voluntarily eat the pill pockets, then that dog will not be getting their medicine that day.\nThe dogs only have access to their food for a couple hours a day. So if your dog is a grazer and doesn't eat all of their food at once then they will be eating very little over the course of their stay.\nThe kennels are painted very poorly, paint is always chipping off the walls, usually because dogs are chewing it off.\nWorkers regularly spray dogs in the face with Bitter Apple spray. This spray is supposed to be used for dogs that have problems chewing their fur, and is not meant to be sprayed in the eyes or nose of the dogs, but they are regularly sprayed in the face if they are barking in their kennels.\nIf you request for your dog to be given a bath, they will usually bathe the dogs very early in the day to get it out of the way. Once they're bathed, they are not allowed back outside and their food and water bowls are taken away. So if you dropped your dog off at 8am to be picked up around 5pm, there's a good chance that your dog hasn't been outside or had food or water since about 10am.", "pics": null, "resp": {"time": 1519324162478, "text": "Hi Lori, I wanted to reply here as well since I did not hear back from you regarding this same review you left on Facebook.\nI'm truly sorry this is how you felt about working at CDT.\n\nAs one of the owners, and the person responsible for systems management in the locations I am very upset to hear these things. I'm also very concerned that not once had myself or any of the owners been contacted or told any of these things throughout the course of your employment there.\n\nBecause I can assure you, that not one thing you have said is company policy or are reflective of our systems we've built over 40 years.\n\nThere's nothing I can say to refute your claims because you cannot prove a negative, all I can say is that if you truly felt this way you should have come directly to myself, Margaret or Damian the multiple times we are all there per day whether helping out, working on things or just leaving our own dogs there for boarding or daycare.\n\nAt the end of the day, I'm sorry you feel this way about CDT. We have been doing this for over 40 years at this point, and have thousands of satisfied clients and dogs that I would hope reflect otherwise. If you would like to talk further or share specifics please send me a message because I would like to know details so I can address anything possible."}, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "105452404521353428688", "name": "Daryl Mote", "time": 1551661003225, "rating": 1.0, "text": "I’m glad that I checked on here for reviews before scheduling. The owners responses on here to previous employees are very unprofessional, very telling, and honestly, a complete turn off. You ALMOST had my hard earned money.", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "117630691361924437800", "name": "Elliott Knight", "time": 1561657718226, "rating": 1.0, "text": "Stay far away from this place.\n\nThe dogs here are kept in very unsanitary conditions that resemble a prison.\n\nThe staff here do not get along and the management is even worse. Almost all of the staff quit in one day over horrible working conditions, unfair treatment, and unfair pay.\n\nDo not apply to work here, and do not take your dog here.", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "105637740086396940746", "name": "Tamara Buckley", "time": 1518311249227, "rating": 5.0, "text": "Experts!! Loving, caring, patient! Trustworthy, your puppy to your senior companion will be in excellent care.", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "109114077582857047689", "name": "Michael Morgan", "time": 1513773739895, "rating": 5.0, "text": "Professional and friendly staff providing effective dog training.  Boarding. Day Care. Grooming.", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "108285854654633705365", "name": "Steve H", "time": 1558932101211, "rating": 1.0, "text": "This place reeked of non-neutered dog pee. My wife could smell the odor on my clothes when I came home and I only took a brief tour.", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "105230787488845149539", "name": "Matthew Burford", "time": 1525367368927, "rating": 4.0, "text": "Knowledgeable trainers at a decent price.  Levels of available training levels from puppies to mature adult pet.", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "102531991850936304718", "name": "Susan Halbrooks", "time": 1566788176277, "rating": 5.0, "text": "My dog loves it and so do i", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "114985768022165122511", "name": "Jeremy Crook", "time": 1456630016559, "rating": 5.0, "text": "Eye for an open market, professional, and an expert at what they do. Entrepreneurship at its finest in BHM!", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "107003331986483198646", "name": "Anusheel Gandhakwala", "time": 1562911558762, "rating": 4.0, "text": "Its a good place for dog . But sending your dog for 2 hour and your pet will stinks for until you get him bath .", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "102865653859571449135", "name": "karen lovett", "time": 1525566708258, "rating": 2.0, "text": "It was a good place but the inside kennel smell was horrible and starting pay was extremely low.", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "108488936566522019240", "name": "Jordan Estus", "time": 1505785022065, "rating": 5.0, "text": "Great place with great people!!!! Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "107623016329269836951", "name": "John Phillips", "time": 1497449539920, "rating": 5.0, "text": "They treat me and my dogs like family", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "117809871947436199907", "name": "Gz", "time": 1562654155249, "rating": 1.0, "text": "Dishonest business practices.", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "116078008054499428261", "name": "Hilary schulak", "time": 1581212838863, "rating": 5.0, "text": "Fun place", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "115743207026307460246", "name": "M Be", "time": 1495548671237, "rating": 5.0, "text": "The owner cares about people !! Rare these days", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "106198166040239282930", "name": "Dexter Boyd", "time": 1533842774102, "rating": 5.0, "text": "Great business", "pics": null, "resp": null, "gmap_id": "0x8889197c4f69616b:0xe8dd592a26239482"}
{"user_id": "109507180076859648035", "name": "Ginger Nix", "time": 1618062133332, "rating": 5.0, "text": "So grateful for RedDog! My work schedule is inconsistent, yet they always are available and flexible when things change. They take great care of my Westie, and I look forward to each update they give when I have to be away.", "pics": null, "resp": {"time": 1618062693049, "text": "Thank you very much Virginia!! It’s our pleasure to be of service and we are grateful for your trust and patronage 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "115921998858941265254", "name": "Milk & Honey Baking Co.", "time": 1618061657464, "rating": 5.0, "text": "RedDog has been a lifesaver for me! I have a difficult work schedule, and Karl has worked very hard to find a sitter that can accommodate my unusual schedule. I have used multiple RedDog sitters over the last 2 years, and they have all been very responsible and reliable. It gives me peace of mind to know that my fur baby is taken care of while I’m at work. I particularly like that they send text updates and accept payment via Venmo. They are very flexible and easy to work with. I would highly recommend giving them a chance to care for your fur babies!", "pics": null, "resp": {"time": 1618062638967, "text": "Thank you so much Heather and we are honored to be of service to you 😊 we appreciate your long patronage!!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "114613962693255300636", "name": "Susan DeRamus", "time": 1547321744175, "rating": 5.0, "text": "We have been clients of RedDog Sitting for 7 years and have been unusually pleased with their services for our cats when we are away from home. The reservation process is very convenient, even with last minute travels. The updates and pictures that we receive via texts are a great comfort when we are traveling.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO14vLEYEjW097eUx1bbVoCY3zU-r4aZ85Ddc1p=w150-h150-k-no-p"]}], "resp": {"time": 1547323853880, "text": "We appreciate you! Thanks for this 😊👍"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "112147562966186639705", "name": "Sara Ruth", "time": 1617582412584, "rating": 5.0, "text": "Red Dog is been absolutely wonderful. They’re reliable and always send pictures updates from their visits. My work schedule changes on short notice and they are very flexible with last minute changes. We are grateful to have found a trustworthy dog sitting service for our pup!", "pics": null, "resp": {"time": 1617583588696, "text": "Thank you so much Sara! We so appreciate your words and your patronage 😊 It’s our pleasure to be of service to your sweet pup pup ❤️"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "117133080372902195530", "name": "Gale Jacobs", "time": 1618102781806, "rating": 5.0, "text": "Piper, our 4 yr old Yorkie just loves Lauren!  And, we love receiving daily updates about her walks along with the cutest pictures!  We have used Red Dog for the past four months and simply couldn’t be happier!  They are always so pleasant and go the extra mile to help when needed.  Thanks for loving Piper!\n—Sharon and Gale Jacobs", "pics": null, "resp": {"time": 1618103120937, "text": "Thank you so much 😊 we appreciate you and your patronage and Lauren loves her time with Piper ❤️❤️❤️"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "107471732892007024784", "name": "Karen Kelley", "time": 1617658268899, "rating": 5.0, "text": "This team is amazing, they really care about your pet and go the extra mile to ensure your pet is happy and cared for.  They are very flexible with scheduling from week to week.  Best of all the individuals that care for your pet are highly communicative through texts and photos, highly professional and always provide TLC-my senior dog loves them!!!  If you are looking for a trustworthy team to take care of your furry family member RedDog is the service for you.", "pics": null, "resp": {"time": 1617661837783, "text": "Thank you very much Karen!! We love your pup pup and are always happy to be of service ❤️❤️❤️"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "109482121751766580700", "name": "Brooke Kaplan", "time": 1607105352294, "rating": 5.0, "text": "Highly recommended RedDog sitting! They always go above and beyond treating our pups just like they are their own.", "pics": null, "resp": {"time": 1607106039325, "text": "Thank you so much Brooke! 😊😊😊 we appreciate our relationship with you and family and look forward to many returns!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "114749317733008577932", "name": "Cara Basilio", "time": 1612808831774, "rating": 5.0, "text": "I have had the best experience with them and would highly recommend! They really treated our puppy as if she were their own and we never had to worry about her when they were there. Kayla and Karl are absolutely phenomenal!", "pics": null, "resp": {"time": 1612811109150, "text": "Thank you so much for allowing us to care for your sweet puppy 🐶!! We appreciate you 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "115396414556435198172", "name": "Michelle Simpson", "time": 1613157294796, "rating": 5.0, "text": "Wow! Best customer service, awesome communication, happy animals, happy customer! Two people came to introduce themselves and get familiar with our animals. We went on our trip, no problems at all. I love the idea if one of the caregivers gets sick, another one can step right in. We got updates with photos after each visit. It was so easy and they checked in after our trip to make sure everything met our expectations. They stayed 45 minutes each visit and we got awesome pics and updates of each visit. I will always use them.", "pics": null, "resp": {"time": 1613158209357, "text": "Thank you so much for this wonderful review Michelle! 😊 We are happy to hear you are satisfied and love your crew ❤️ We look forward to many returns!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "106184619255002346441", "name": "Awake Siren", "time": 1606136778311, "rating": 5.0, "text": "If you need a pet sitter, these are the folks to call. 100% trustworthy, reliable, pet loving  people.", "pics": null, "resp": {"time": 1607103724554, "text": "Thank you for this awesome endorsement and validation! 😊😊😊 It helps keep us in business during these trying times"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "115096856191690041968", "name": "Tracie Alvis", "time": 1586813926531, "rating": 5.0, "text": "I use Red Dog to walk my fur baby. They have been great and very reliable. My Dog gets so excited when he sees them for his daily walks. I highly recommend them for your walking/pet sitting needs. .", "pics": null, "resp": {"time": 1590625676108, "text": "Thank you for this wonderful review! It was our pleasure to be of service and we look forward to caring for your pup pup in the future 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "118022814444675646562", "name": "Tim Cebula", "time": 1575074519403, "rating": 5.0, "text": "Our Red Dog experience was wonderful, start to finish. The service is incredibly responsive and well organized. Our sitter was professional, prompt, and caring--we felt we could rest easy knowing Callie and Emma would be in good hands during our trip. We got regular photo updates, and communication was open and easy throughout. We also love that it's a local business, as opposed to regional or national chains. Highly recommend.", "pics": null, "resp": {"time": 1575078227599, "text": "Thank you Tim! Means a lot 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "100281117022071147429", "name": "Taryn Temples", "time": 1567272327495, "rating": 5.0, "text": "We have used Red Dog Sitting since our yellow lab, Cooper, was just a puppy.... He is 9 years old now! Red Dog has been so good to us! They are reliable and consistent, and I love getting pictures/updates during the work day, knowing our boy is being loved on while we are gone. We can have crazy work schedules sometimes, and Red Dog is always able to help us out when schedules change unexpectedly. We are so thankful to have found Red Dog when we first moved to Birmingham!", "pics": null, "resp": {"time": 1567273514094, "text": "Thank you Taryn! We appreciate our long relationship with you and the trust 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "112709108932079442504", "name": "Heather Jamison", "time": 1567714811471, "rating": 5.0, "text": "Whenever we cannot take care of our pups, we use RedDog to take care of them.  We never have to worry about them when RedDog visits because we know that our dogs will be loved, played with, and well taken care of.  We also love getting text updates and seeing how our pups are doing without us.  It makes being away easier on both us and our sweet dogs.  Karl and his sitters go above and beyond to take care of our dogs, and I don't know what we would do without them!", "pics": null, "resp": {"time": 1567766974611, "text": "Thank you Heather! We appreciate you and your trust. We look forward to many returns 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "108960572295611209083", "name": "Rachel Lich", "time": 1575165139169, "rating": 5.0, "text": "My dogs would come home anxious and off for days after being boarded, but with Red Dog I finally feel comfortable leaving town for longer than a day. I don’t have to spend my whole trip worrying about how they’re doing because they send pictures and an update every visit. The sitters who have taken care of my pups always accommodate me, even with my crazy dog mom questions and requests. And most importantly, my dogs always love them!!\nThe owners are such a lovely couple- and so quick to respond. I have no problem trusting they will take care of my dogs and my home.\nI always recommend Red Dog Sitting to every pet owner I know.", "pics": null, "resp": {"time": 1575165608380, "text": "Thank you so much Rachel, we appreciate your kind words. At your service! 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "106168401361040000965", "name": "dk mc", "time": 1546565589539, "rating": 5.0, "text": "The sitters are great!  My pups get such good care while I am traveling.  I completely trust them with my 2 dogs and with my home.  They’ve become part of the family.  It is comforting to know that my babies are well taken care of when I am away!", "pics": null, "resp": {"time": 1546566720007, "text": "Thank you very much Debbie! You are family to us too 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "112942663244946273473", "name": "Melanie C.", "time": 1547135224800, "rating": 5.0, "text": "Karl and his team are great. Very responsive and I know my dog loves to see her sitter everyday. I love that I get updates and pictures throughout the visit. I know my pup is safe with RedDog Sitting. I highly recommend!", "pics": null, "resp": {"time": 1547136020634, "text": "Thank you very much!! We appreciate it 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "115168613864597900562", "name": "Rebecca Leigh", "time": 1554647263183, "rating": 5.0, "text": "I have been using Red Dog Sitting Services for about a year. They have taken away the stress and worry I used to feel when I had to leave my pets.   They are super to easy to work with and I LOVE getting the updates/pics from their visits.  I have 4 cats/2 dogs and I get an update about every single one of them 😊.  I am so thankful for these people and would highly recommend to anyone who is looking for a reliable, caring pet sitter.", "pics": null, "resp": {"time": 1554648454860, "text": "Thank you Rebecca! We appreciate the trust and look forward to many returns 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "113874057436314544893", "name": "Christi Brewer", "time": 1550709637703, "rating": 5.0, "text": "Red Dog Sitting is fantastic! They have cared for my 2 dogs for more than 3 years and have been completely reliable and trustworthy. Every sitter I have had experience with through Red Dog has been awesome. They always send text updates about their visit along with pictures of my dogs. They are also very accommodating to my travel. I try to give as much notice as possible, but there are a few times that they've worked with me on short notice as well. I would recommend Red Dog to any pet owner!", "pics": null, "resp": {"time": 1550710271078, "text": "Thank you for the awesome review! We really appreciate this 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "112259023761764843049", "name": "Dot The Destroyer", "time": 1567279013982, "rating": 5.0, "text": "We have had wonderful experience with boat long vacation stays and day visits. Our pets are happy relaxed and well cared for. 5 stars.", "pics": null, "resp": {"time": 1567282411954, "text": "Thank you Dot! We appreciate your confidence 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "112798690643137106287", "name": "Sarah McMinn", "time": 1548437857663, "rating": 5.0, "text": "We use RedDog for dog walking services. I love that our pup Nola has regular walkers who know her and her needs. They send pictures and a brief update after the walk to let us know how our pup is doing! Owner Karl is so great to work with. I work a varied schedule and Karl checks in with me each week to find out my needs. He is flexible and has been able to assist with last minute schedule changes. I recommend them 100%.", "pics": null, "resp": {"time": 1548445915138, "text": "Thank you for this Sarah!! We appreciate you and love Nola ❤️❤️❤️"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "117995948248050043136", "name": "Cheryl Kersnowski", "time": 1568328701313, "rating": 5.0, "text": "My experience with Karl and Tim at RedDog Sitting Services, LLC has exceeded my expectations.  On the business side Karl is professional and organized, and Tim is a wonderful, reliable and kind sitter for my two pups.  He communicates every day and loves my babies in my absence.  I highly recommend RedDog Sitting Services.", "pics": null, "resp": {"time": 1568330165867, "text": "Thank you for this wonderful review and at your service Cheryl!! 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "106920331192156840965", "name": "Kelly Stanton", "time": 1546576053934, "rating": 5.0, "text": "I cannot even describe how wonderful the dog sitters at Red Dog sitting are! We first contacted Red Dog to care for our 3 older dogs because boarding them was too stressful. Our dogs needed medication multiple times each day and they were just more comfortable in their own home. We knew from the first time we met Cydney and Kayla that we could trust our babies with them. We were thrilled by how much all 3 dogs loved each of the dog sitters who came to take care of them. We could see they were well cared for in the many pictures sent to me after each visit. It was so nice to be able to go on vacation and not worry about our elderly dogs at home.\nNow we have a puppy who we do not want to leave in his crate all day while we are at work.  So we have the best dog sitter in the world come visit him, take him out to potty and a short walk each day. I honestly think Kayla is our puppy's favorite person.  And if Kayla can't visit him one day, Red Dog sitting arranges for another awesome sitter to come visit without me even having to worry about making arrangements. I am so grateful to Red Dog Sitting!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNymTOKSK6yuYshbjcoPOefiQOLbmlKTJ9jBiSh=w150-h150-k-no-p"]}], "resp": {"time": 1546577428332, "text": "Thank you so much Kelly! We appreciate your thoughtful review and it is our pleasure to be of service 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "110002125107460354029", "name": "Tom Williams", "time": 1546964178138, "rating": 5.0, "text": "Been using this pet sitting service for years because they are simply the best.  Reliable, professional, handle pets with medical needs, etc.  Plus, they bring in the mail, newspapers and water plants if requested. Best of all, they send daily texts with detailed updates and pics of your pets and plants to give you the peace of mind knowing that everything is going well back home. We would never consider using any other service!", "pics": null, "resp": {"time": 1546964901132, "text": "Thank you so much! It’s our pleasure to be of service 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "106052785064727597063", "name": "Makaira Casey", "time": 1559230127468, "rating": 5.0, "text": "There aren't enough stars in the galaxy to properly rate RedDog. RedDog managed walks, sits, and assorted other services for my two dogs seamlessly for years. I would venture to say they were more diligent about my pups' care than I. Every service was provided with the most genuine care.", "pics": null, "resp": {"time": 1559231206860, "text": "Thank you for your very kind words Makaira!! It was our pleasure and honor to serve you and your pups 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "106004296406094306179", "name": "Larry Hicks", "time": 1557443928148, "rating": 5.0, "text": "We have used their sitting services several times and have never been disappointed. The sitters are professional and do a great job providing updates and photos after each visit wit the pets. We highly recommend them.", "pics": null, "resp": {"time": 1557445291780, "text": "Thank you for this Larry! We appreciate you and look forward to many returns 👍😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "111534930725269550792", "name": "matt meyers", "time": 1546831010622, "rating": 5.0, "text": "We use RedDog Sitting Services for our two bloodhounds.  The dog sitters are very professional and take really good care of my babies while I am at work during the day.  When I first called RedDog regarding getting someone to come sit with my dogs they were very attentive to my pet care needs and did an amazing job of pairing sitters that fit my dogs personalities. Believe me caring for two young bloodhounds at one time is very challenging, but they have met the challenge and have amazed me every day with how wonderful they are with my babies. I receive daily pictures showing me the days activities and I am always pleased with how happy and comfortable my babies look with the sitters.  This is truly a great service with people who love and care for the well being of your pet.", "pics": null, "resp": {"time": 1546831292721, "text": "Thank you so much! We appreciate you!! :-)"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "103427424313977126374", "name": "Chris Appleton", "time": 1553532427547, "rating": 5.0, "text": "Our experience with RedDog has been exceptional.  Their team allows you to travel without any concern that your fur family will be well cared for and loved.  We have been customers for well over five years and appreciate the promptness and attention to detail their sitters provide.  Incredibly accommodating and trustworthy business to work with.", "pics": null, "resp": {"time": 1553538951871, "text": "Thank you for this wonderful review Chris. We very much appreciate and value our long relationship with you and look forward to many returns!😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "103641185759002119755", "name": "Kristen Hardy", "time": 1547253399920, "rating": 5.0, "text": "I have been using Red Dog dog sitting for two years now and they have been great!! I can now go out of town and leave my babies home and not worry!! I am able to go on a lot more vacations knowing that they are well taken care of!!!!", "pics": null, "resp": {"time": 1547260699476, "text": "Thank you Kristen! We appreciate your patronage 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "113367719614798728063", "name": "Erin Limerick", "time": 1554945551299, "rating": 5.0, "text": "Nikki always does a fantastic job taking care of our 3 dogs when we go out of town. One of them has kidney issues with lots of meds. She does it all perfectly and the dogs love her! Highly recommend Red Dog!", "pics": null, "resp": {"time": 1555034161867, "text": "Thank you Erin 😊 We really appreciate it!!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "107415838621496372758", "name": "Hannah Edwards", "time": 1563162356979, "rating": 5.0, "text": "Incredible service! I have been working with Red Dog almost a month now for daily dog walking/pet sitting and it has been a great experience. I have rescheduled visits a million times due to my unpredictable work schedule and Karl has been nothing but accommodating, even at the last minute. Can't thank them enough for taking such great care of my pup when I can't be there!", "pics": null, "resp": {"time": 1563163069201, "text": "Thank you so much Hannah!! 😊 and, at your service! We appreciate your trust in us 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "105264041372017270802", "name": "Christoph", "time": 1546691227212, "rating": 5.0, "text": "Karl and his associates have done a fantastic time taking care of our dog. They are always available, have never missed a day we needed them, and are extremely professional. Karl consistently reaches out to us about our needs for the upcoming week because we have such variable schedules. They also do a great job communicating with us on the days that they take care of our dogs. I unequivocally recommend them.", "pics": null, "resp": {"time": 1546702282318, "text": "Really appreciate this! Thank you Christoph!!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "100674389603264745601", "name": "Linda Bedwell", "time": 1553352418221, "rating": 5.0, "text": "I never worry about my fur babies when we leave town!  Red Dog is so professional and dependable. They love our pets and allow them to be in the comfort of our home.  Been using them for years!!", "pics": null, "resp": {"time": 1553359296970, "text": "Thank you for this wonderful review. 😊 We appreciate you!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "109587504606720358710", "name": "Sally Mcdonald", "time": 1547058609768, "rating": 5.0, "text": "Red Dog has cared for my pups on several occasions. My dogs love the sitters, and I know that they're in safe, friendly hands. The sitters ALWAYS keep me informed with pictures and texts about the dogs. Too, Karl and Sydney have helped me out at a moment's notice when I've been called away unexpectedly. I will continue to entrust my pets to Red Dog Sitting.", "pics": null, "resp": {"time": 1547064292310, "text": "Thank you Sally 😊! We appreciate your loyalty and trust! And we look forward to many returns"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "102003732424010647497", "name": "Dawn deGraffenried Jones", "time": 1546647908572, "rating": 5.0, "text": "We used RedDog Sitting to take care of our fur babies during the workday and several times when we went out of town.  We knew they were in great hands!  Our sitters were fantastic about sending us texts, emails, and photos documenting their visits, and our pets loved the extra attention when we couldn't be around.  We highly recommend them for your pet-sitting needs!", "pics": null, "resp": {"time": 1546650042103, "text": "Thank you Dawn 👍😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "114111224610136041738", "name": "Tracy Field", "time": 1547680545247, "rating": 5.0, "text": "I have been using Red Dog for several years now to keep my cavalier. She has medical issues so I don’t like to board her. The sitters are wonderful and take great care of Katie. They send lots of pictures and updates so I know she is doing well. I highly recommend them!", "pics": null, "resp": {"time": 1547685570162, "text": "This is wonderful! Thank you Tracy, we appreciate you 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "116077857703778875530", "name": "Perry Pope", "time": 1546996993702, "rating": 5.0, "text": "We have used Red Dog Sitting Services numerous times and they have always taken wonderful care of our dogs. One of our dog is older and has a medical condition that requires medication and we completely trust Red Dog with our pups. It’s comforting to know that when we’re traveling our pets are being taken care of. Shout out to Gina she’s great with our pups!", "pics": null, "resp": {"time": 1546998416437, "text": "We really appreciate the feedback and our relationship with you 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "113444682258689190041", "name": "Carla S.", "time": 1547929302921, "rating": 5.0, "text": "We love Red Dog Sitting Services! They are by far the best in the area. We have used their sitting services for our cats for 7 years and would never use anyone else. The Red Dog owners and pet sitters are wonderful. They are always reliable, professional and caring. Our sitters send a text with photos every visit so we know our babies are safe and well-cared for when we are away. We highly recommend Red Dog Sitting Services!", "pics": null, "resp": {"time": 1547930375404, "text": "This is wonderful! Thanks Carla 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "110987623062923286781", "name": "Tabitha Price", "time": 1553380367176, "rating": 5.0, "text": "I have nothing but positive raves about RedDog Sitting Services. They are great communicators, quick response time, but most importantly, they treat my four legged kiddos as their own. Best service I have used!", "pics": null, "resp": {"time": 1553388095315, "text": "Thank you Tabitha! We’ve really enjoyed working with you and very much appreciate your trust! 👍😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "107099939151676615243", "name": "Janice Warren (Jrocks27)", "time": 1563551088735, "rating": 5.0, "text": "I absolutely Love RedDog sitting, they are amazing, Andrew and Deborah were absolutely Phenomenal! They took such great care of our babies when we were away! What would we have done without this company? Thank you with all of our Hearts.", "pics": null, "resp": {"time": 1563550528128, "text": "Thank you so much Janice! We appreciate you 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "115736575255568178253", "name": "Stephani Shields", "time": 1547919835791, "rating": 5.0, "text": "We have been using them for 4-5 years at least and we are ALWAYS satisfied with the service and care they give our fur babies. They love our babies and the pictures they send make our trips that much better and give comfort and peace of mind. We trust them 100% and wldnt use anyone else!", "pics": null, "resp": {"time": 1547921358477, "text": "Thank you for this Stephani! We appreciate you and your babies 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "107905812528953745574", "name": "Stephanie Fowler", "time": 1548099480431, "rating": 5.0, "text": "RedDog has been a blessing to our family. We recently moved to Birmingham with a 15 year old dog that we are so careful with.My first priority was to find caring people who could care for Reesie like we did. The staff at RedDog has gone above and beyond to meet our expectations and more. So thankful!!", "pics": null, "resp": {"time": 1548100733473, "text": "Thank you Stephanie! We appreciate this and we appreciate your trusting us with sweet old Reesie 😊❤️😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "114414200724778012970", "name": "Ray Foushee", "time": 1546480995722, "rating": 5.0, "text": "Red Dog has been helping my family for 5 1/2 years. We have used them faithfully about 8 or more times a year for extended periods of time. We had two St Bernard’s and a cat. Unfortunately only our cat if still with us. Red Dog has always gone above and beyond for all three of our guys. Our Saints required extra attention which Red Dog was always willing to do whatever they needed. They come twice a day for us to take care of our cat now. They have always been such a blessing to our family. I highly recommend them every chance I get. Can’t thank them enough for everything they have done for our entire family!", "pics": null, "resp": {"time": 1546481909861, "text": "Thank you for the fantastic review, Christie!  :)"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "105085798522144020272", "name": "Kelly Scott", "time": 1564691721064, "rating": 5.0, "text": "Earlier this year, I got a new puppy. And seriously, these folks have helped me raise her when I had to leave her for work and other stuff. They've been great with daily visits and dog-sitting. Even my rescue dog that doesn't like people and lets virtually no one pet him likes the sitters who have come. I'm so glad I found them!", "pics": null, "resp": {"time": 1564693208601, "text": "Thank you Kelly!! We appreciate your trust and are glad to be of service 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "111796132490734343944", "name": "Debbe Stewart", "time": 1554570406839, "rating": 5.0, "text": "I have a senior cat, & when I need to leave town, she can stay at home, where she is safe & comfortable, instead of going to an unfamiliar place to be boarded.  Red Dog Sitting is reliable, & professional.  The sitter sends me texts updates (with a photo!) & I am completely comfortable with them, & more importantly, so is my cat!\n\nBest sitting service I could have choosen!", "pics": null, "resp": {"time": 1554570679239, "text": "Thank you Debbe!!! We very much appreciate your trust and will work hard to maintain that 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "103649661490102784292", "name": "Lia Marie", "time": 1548805832084, "rating": 5.0, "text": "I have been using RedDog for a year and a half for my dog walking derives and they have always provided above and beyond service. They have never missed a visit and are almost always available for even last minute dog walking needs! I know my puppy has been in great hands!", "pics": null, "resp": {"time": 1548806298052, "text": "Thank you for this Lia! We appreciate you 👍😊👍"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "111680558760446225692", "name": "Elisa Mejia", "time": 1547394318670, "rating": 5.0, "text": "Since 2012 RedDog has been a part of my family.  Scheduling is consistent so I can work worry free and get daily texts about my dogs.  They are supportive and and responsive to changes in schedules.  Customer service and caring!!!", "pics": null, "resp": {"time": 1547395960196, "text": "Thank you Elisa! We really appreciate this!! 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "101903298106613901579", "name": "Bethany Roberts", "time": 1548347201384, "rating": 5.0, "text": "I have worked with Karl and Cydney for over 5 years and they have taken wonderful care of my cats since day 1.  They are extremely helpful even when circumstances outside the norm arise and I always feel my cats are getting the best care possible when I am away.", "pics": null, "resp": {"time": 1548359337328, "text": "We love your kitties and thanks so much for this 😻😻😻 We look forward to many returns."}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "106113927264730077431", "name": "jane Elmore", "time": 1547151053799, "rating": 5.0, "text": "Red dog sitting is a life savor.  The walkers and sitters love my dogs as much as I do.  I travel a bit and have 0 concern about leaving my dogs.  They are walked, pampered, and loved while I am gone.  My dogs get so excited when the walkers come.  I can’t say enough great things about them all!", "pics": null, "resp": {"time": 1547153831622, "text": "Thank you very much Jane!! It’s our pleasure to serve! ❤️😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "102118981489948879709", "name": "Jennifer Summar (NextJen)", "time": 1549060319537, "rating": 5.0, "text": "Very reliable and friendly pet sitting service.  Their rates are reasonable, and their sitters are background-checked and reliable.  I love the daily photos and written updates that the sitters send us via text or email while we're away from our fur and feather babies.  Makes you feel good knowing they are being cared for well.", "pics": null, "resp": {"time": 1549061613000, "text": "Thanks very much for this Jennifer! 😊 At your service!!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "115590775792645712983", "name": "Livia Daniel", "time": 1546807939414, "rating": 5.0, "text": "We’ve been using Red Dog to take care of our fur babies when we’re out of town for over 8 years.  You couldn’t ask for better pet sitters.  We HIGHLY recommend them if you are looking for someone to love your babies when you can’t be there.", "pics": null, "resp": {"time": 1546810080787, "text": "Thank you very much Liv!!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "109261908375067869196", "name": "Casey Howard", "time": 1548805561364, "rating": 5.0, "text": "RedDog has done an amazing job taking care of our dog, Rocky! They're consistent, show up on time, and great communicating with us about any issues or changes needed to Rocky's care. So thankful for these guys!!", "pics": null, "resp": {"time": 1548806335876, "text": "This is awesome! Thank you Casey!! 👍👍👍"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "101392892737033477134", "name": "Maelynn Cheung", "time": 1576499370007, "rating": 5.0, "text": "Very responsive and helpful in explaining options and process. My pup had a great sitter and we’ve already scheduled for the next visit.", "pics": null, "resp": {"time": 1576501150269, "text": "We appreciate you Maelynn and look forward to many returns! 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "100111069697507708727", "name": "Barbara Cole", "time": 1547410442984, "rating": 5.0, "text": "RedDog Sitting is the premiere pet sitting service in Birmingham! The RedDog owners and caregivers were organized, punctual, and responsive. Most of all, our caregivers loved my dog family and sent me daily videos and descriptions of the dogs' behaviors and antics during each visit. Red Dog Sitting visited my dogs Monday - Friday twice each day and provided me great peace of mind while I was at work. If I needed to change the visit schedule, this was easily done. In short, I could not have asked for better companions for my dog family. I love RedDog Sitting and will always be grateful for the professional and loving services the staff provided to me and my dogs. RedDog Sitting is the ONLY pet service I will ever use!", "pics": null, "resp": {"time": 1547412812881, "text": "This is wonderful! Thank you so much Barbara!! 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "104569003706291998079", "name": "Marty McArthur", "time": 1546131107508, "rating": 5.0, "text": "They look after cats as well! Excellent excellent service. Well-run business, dependable sitters. They always sent me several texts with pictures of my cat playing or on their laps, would include descriptions of my cat's activities while they were there. They'd scoop the litter box, fill water, add food to the bowl, play with my cat. They would also bring in mail or any packages. They'll even prepare special foods for your pets, so if you have one who needs food cooked etc, they'll be happy to oblige. They are the BEST.", "pics": null, "resp": {"time": 1546131254235, "text": "Thank you so much Marty! Every review here counts a lot for us 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "110638514206509579043", "name": "Susie Tomberlin", "time": 1547499069338, "rating": 5.0, "text": "Excellent service and care for our furry family members throughout the last 6+ years!  They have treated our pets like they would their own.", "pics": null, "resp": {"time": 1547500278549, "text": "We really appreciate this! Thank you Susie 😊👍😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "109652984774470012100", "name": "Alysia Housey", "time": 1556415269255, "rating": 5.0, "text": "We have been using RedDog Sitting for years! I never have to worry about my dogs while we are away. One of our dogs is a rescue who doesn’t trust easily. The first night the sitter visited him, he was in her lap asking to be petted. I was amazed! RedDog is punctual, professional and the best sitters around by far.", "pics": null, "resp": {"time": 1556415946668, "text": "Thank you so much Alysia 😊😊😊 We appreciate our long relationship with you"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "105405144358212296122", "name": "Alicia Baldwin", "time": 1547084096679, "rating": 5.0, "text": "We have been with Red Dog since 2011. They have been a life saver. We started with a “zoo” and now have 3 kitties. They are always available and always responsive to any concerns (which have been very few). I can’t imagine trusting my babies to anyone else!", "pics": null, "resp": {"time": 1547084543853, "text": "Thank you very much for trusting us with your crew for so long! 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "111364789816022843845", "name": "Sally McClanahan", "time": 1546871353301, "rating": 5.0, "text": "We love RedDog because they are 100% reliable and dependable. Our dogs love them and they love our dogs.  They always go above and beyond the call of duty for us and we can always leave town with total confidence that our dogs will be well taken care of.", "pics": null, "resp": {"time": 1546872435512, "text": "Very appreciated! Thanks Sally :-)"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "113197372878098231138", "name": "Tracy Thornton", "time": 1550622630263, "rating": 5.0, "text": "We love RedDog! The sitters treat Fiona & Fern like family. I also look forward to the updates and pictures each day while we are away! The owners, Cydney & Karl, always respond quickly to requests and questions. We are very happy to recommend RedDog Sitting to pet owners looking for friendly and reliable sitters for their fur babies!", "pics": null, "resp": {"time": 1550624331892, "text": "Thank you very much for this 👍😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "118249624927287726133", "name": "Joseph Bradish", "time": 1547085729000, "rating": 5.0, "text": "On many occasions, a RedDog staffer has cared for our dogs and cat. Our animals are played with, petted, pampered, walked, fed, whatever we ask for. The sitter sends pictures and updates on every visit, and we just love that! Our mail and newspapers are collected, trash cans get pushed to the curb, and lights are adjusted. It's just an all-around great, great service for our pets and our home. It is peace of mind that we haven't found anywhere else!!", "pics": null, "resp": {"time": 1547086468953, "text": "Thank you very much 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "113288998276551348509", "name": "Melanie Reno", "time": 1547684537148, "rating": 5.0, "text": "We have used Red Dog for years and do not trust anyone else with our pets.  I highly recommend Red Dog for any pet sitting/walking needs. Great to work with!", "pics": null, "resp": {"time": 1547685541896, "text": "Thank you Melanie! We cherish our long relationship with you and look forward to many returns 😊👍😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "116064731690064568750", "name": "Jon Beling", "time": 1550623292296, "rating": 5.0, "text": "I’ve been a loyal RedDog customer since 2012. Karl and Cyd are wonderful and treat my dogs like their own. RedDog offers me peace of mind knowing my dogs will be cared for when I’m gone, whether its just for a day or a week.", "pics": null, "resp": {"time": 1550624276902, "text": "Thank you Jon! We value your patronage very much 👍"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "113289142601283425745", "name": "Cathy Vinzant", "time": 1547648334183, "rating": 5.0, "text": "I have the best experience with RedDog Sitting Services.  The walkers are phenomenal....very attentive to my dogs and always on time.  I get a picture and a note after each walk. They are able to accommodate my schedule even with short notice.  Karl and Cyd work miracles behind the scenes .   I highly recommend this service for the walkers they have to care for my dogs and the administrative side that does all the coordination.", "pics": null, "resp": {"time": 1547649709938, "text": "This is wonderful! Thanks so much Cathy!! 😊😊🐕🐕"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "114706997636294803287", "name": "Joanna Burleson", "time": 1547056722984, "rating": 5.0, "text": "We love Red Dog!  Our puppets have grown up with Red Dog and they are happy to receive a mid day visit from Red Dog.  Love the feedback and pictures that they provide.  We are very happy with Red Dog and the loving care they give tomLexie and Brooklyn - the golden girls!", "pics": null, "resp": {"time": 1547064242542, "text": "Thank you Joanna! You are like family to us 😊 it’s been almost 10 years, wow!!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "101591280113753593199", "name": "Paul Muntner", "time": 1546912249854, "rating": 5.0, "text": "RedDog Sitting have been taking care of my cats for 10 years and has always done an outstanding job. They are very responsive to my needs and take great care of my cats.  I highly recommend them!", "pics": null, "resp": {"time": 1546912990112, "text": "Thanks so much Paul! You were one of our first clients and we appreciate your trust 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "111636971328378895204", "name": "Donna Dixon", "time": 1546734331351, "rating": 5.0, "text": "This sitting service employs very caring, trustworthy and extremely competent sitters.  Our dogs, over the years, have required administration of many meds and have been \"special needs pups.\"  We have never felt uneasy about leaving them with the RedDog sitters.  They have always provided excellent care.  I recommend them without reservations!", "pics": null, "resp": {"time": 1546735435674, "text": "Thank you very much Donna! We appreciate you :-)"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "106969057747863308835", "name": "Jeanna McNair", "time": 1553569437725, "rating": 5.0, "text": "We have used Reddog for years.  We always know our babies are going to be well taken care of.  I recommend them to anyone looking for a pet sitter.  I love the pictures they take.  We can see our babies a couple of times a day even though we aren't at home.  If you need pet care, there is not anyone better!\nJeanna", "pics": null, "resp": {"time": 1553570489497, "text": "Thank you Jeanna! We cherish our long-time relationship with you and appreciate this very much. 👍😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "111832636029070047244", "name": "Steve Reynolds", "time": 1547679381527, "rating": 5.0, "text": "I’ve trusted the care of my pets with Red Dog Sitting for years. I never have to worry about them when we go out of town, no matter how long the trip. I’m confident that my home is secure and those extra little things like getting the mail, picking up the WSJ from the driveway and being on the lookout for packages are nice. The owners are always prompt when contacted and I never hesitate to get in touch with them with special requests. 5 Star Rating is well deserved.", "pics": null, "resp": {"time": 1547680483050, "text": "Thank you very much for this Steve! We look forward to many returns! 👍👍"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "115748167897803377970", "name": "Elizabeth Kiernan", "time": 1575058402820, "rating": 5.0, "text": "Great service with very involved owners and walkers who are always available and flexible with schedules!", "pics": null, "resp": {"time": 1575062126827, "text": "Thank you very much Liz!! We appreciate you and look forward to many returns. 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "117401003095661097976", "name": "Louise Yoder", "time": 1550623183935, "rating": 5.0, "text": "Love RedDog Sitting services. I have 2 dogs who hate the kennel. RedDog lets them stay at home and they do a great job. Play with the dogs, texts me photos and make the house look like someone is home. Highly recommend!!!", "pics": null, "resp": {"time": 1550624296879, "text": "We appreciate you Louise! 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "108151313626613801300", "name": "Patricia Williams", "time": 1547306278240, "rating": 5.0, "text": "RedDog Is amazing!  They are dependable, will accommodate last minute requests, very flexible and will love your pets to pieces!!  I highly recommend them. I’ve been using RedDog for a year and wouldn’t trust anyone else!!", "pics": null, "resp": {"time": 1547307008943, "text": "We really appreciate this and your patronage- your pups are sweeties and we look forward to many returns 🐶!!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "112722499411243102167", "name": "Pam Johnson", "time": 1547653965460, "rating": 5.0, "text": "I have used RedDog for over 10 years for both my cats and dogs.  I use them frequently and they are so caring and responsive to any needs.  Also, they can do more than just feed/walk your pets, like mail, watering plants, etc.  All of the sitters have been outstanding and Karl and Cydney are passionate about taking care of animals.  I trust them absolutely.", "pics": null, "resp": {"time": 1547655791013, "text": "Thank you for this wonderful review 😊 you were one of our first customers and we really appreciate your trust!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "113636510474174672428", "name": "Rosy Roberts", "time": 1546879336989, "rating": 5.0, "text": "I absolutely LOVE RedDog Pet sitting! I have been using them for about 10 years and I have never been so serene while away. I have several cats and dogs and over the years some of them have had to have medications given. RedDog doesn't charge extra for multiple animals or when meds need to be given. I get pictures and text each time they come to the house. They take care of the cats and dogs, feed fish in the ponds, fill birdfeeders, watch the water level in the pool, etc.  The sitters have even stayed extra during thunderstorms to comfort the pets until the storm passes. At times my flights have been canceled or delayed and I can contact them and get an extra sit or two to cover the unexpected extra time away. The animals love them and are so happy to be home (rather than at a kennel). RedDog is a very professional and caring service that takes the best care of my babies. I have recommended them to several friends who now use them as well. I don't  what I would do without RedDog. If they retire, I'll never be able to travel again! I give them my highest recommendation and have never ever had a pet sitting service that comes anywhere close to how great these people are!", "pics": null, "resp": {"time": 1546880173029, "text": "Thank you for this wonderful review! We appreciate you!!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "107556856291303902569", "name": "joel phillips", "time": 1547007168675, "rating": 5.0, "text": "Karl and his team have been pet sitting for us for a little over a year now and have always done a tremendous job. They give us peace of mind knowing that our dog is being taken care of while we are gone and we love the pictures and updates they send us during each visit. We appreciate how flexible they are with our busy and always changing work schedules. Always very professional and dependable!", "pics": null, "resp": {"time": 1547034714633, "text": "This is really appreciated! Thank you 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "110824980844725587622", "name": "Marybeth Grigsby", "time": 1578103880719, "rating": 5.0, "text": "They always take excellent care of our pets.", "pics": null, "resp": {"time": 1578108529060, "text": "Thank you very much for this Marybeth!! It means a lot and we look forward to many returns 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "113758495134715488027", "name": "michael zinnecker", "time": 1554595412818, "rating": 5.0, "text": "Beaux has the greatest time with Gina, Emily, and Regan.  They are very attentive and he is such a ham!  Red Dog Sitting is always very punctual and receptive when I need to make arrangements on short notice.", "pics": null, "resp": {"time": 1554598052756, "text": "Thanks you for the wonderful review! We appreciate your patronage very much 👍"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "117539667773633890210", "name": "Les Rayburn", "time": 1547270139709, "rating": 5.0, "text": "We have a complicated work schedule, but RedDog always seems to find a way to make it work for us. Their sitters truly treat our pets like babies--which is just what we want. Can't recommend them highly enough!", "pics": null, "resp": {"time": 1547270416564, "text": "Thank you very much! We appreciate this and look forward to many returns 👍👍"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "104885653251934741328", "name": "JR Davidson", "time": 1546575355865, "rating": 5.0, "text": "We’ve used Red Dog for several months.  They’re great with our two labs, one of which has a bad hip and takes a little more time to handle.  They’ve also been easy to contact and very flexible if we have plans change last minute.  Hope to keep using them for a long time!", "pics": null, "resp": {"time": 1546577678482, "text": "Thank you very much JR! We really appreciate this and look forward to continuing to be of service 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "103923216102193419690", "name": "Neha Reddy", "time": 1546913766174, "rating": 5.0, "text": "we love this company so much.  such sweet, caring, good people.  they give our precious fur baby so much love :) :)", "pics": null, "resp": {"time": 1546914307955, "text": "Thank you so much Neha!! 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "117400047019912626870", "name": "Paul Blanton", "time": 1547333784858, "rating": 5.0, "text": "My wife and I have used Red Dog Sitting Services on four occasions to care for our three cats when we've been away on one- to two-week vacations.  Each time, we've been very pleased with the work their sitters have done.  One thing that was especially nice was the text messages (with pictures) after each visit, updating us on how the cats were doing.  In addition to the cat care (feeding, brushing, cleaning litter boxes), our sitters brought in the mail and packages each day and turned on/off lights.  I can't speak highly enough about the quality of Red Dog's services, and we will definitely use them again.", "pics": null, "resp": {"time": 1547338231872, "text": "This is very kind and thank you so much Paul! We very much appreciate your patronage 😺😺"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "101720992566884056275", "name": "Blayne Burgess", "time": 1547131355748, "rating": 5.0, "text": "Red Dog did a great job with both my dogs for 4 years. They were always easy to contact and reschedule a visit. Also they always contacted me if anything at all was wrong.", "pics": null, "resp": {"time": 1547132708663, "text": "Thank you Blayne! We really appreciate it!! 👍"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "105674235716324870783", "name": "Ann D", "time": 1554307859663, "rating": 5.0, "text": "Have used them every vacation for 5 years.  So much easier and less stressful than boarding plus we live for the updates on our furry friend.", "pics": null, "resp": {"time": 1554323149537, "text": "Thank you for this wonderful review! 😊 We appreciate you!!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "118198726379662467256", "name": "Debbie Grabeldinger", "time": 1547050004029, "rating": 5.0, "text": "I love the personal touch my pets receive while I’m away and the pictures that I get showing them safe and happy at home.  They have become extended family to us.", "pics": null, "resp": {"time": 1547051429903, "text": "Thank you so much Debbie! We appreciate you 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "117503843223751987894", "name": "antonio lago", "time": 1548465948764, "rating": 5.0, "text": "Awesome service, caring and always willing to exceed expectations.\nI have use RedDog for a number of years and plan to continue.\nHighly recommended.", "pics": null, "resp": {"time": 1548466501447, "text": "Thank you Tony! We appreciate your patronage very much 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "117002343604274645567", "name": "Laura C", "time": 1546920043517, "rating": 5.0, "text": "RedDog Sitting is incredible. Kind and caring owners, and wonderful sitters! They really care about our cats, and spend time with them, even taking photos while we are away. I honestly think there’s a part of our cats that don’t mind when we’re gone because they love seeing the sitters so much! And after being with them for two years with pretty solid travel (at least one weekend a month, with trips up to three weeks), we have never had one incident or bad experience. Very grateful to have found them! You cannot go wrong with RedDog Sitting!", "pics": null, "resp": {"time": 1546920773655, "text": "Laura, thank you so much! We appreciate you!!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "107283330148162724019", "name": "David Moon", "time": 1553224158958, "rating": 5.0, "text": "I never worried about our pets when Red Dog Sitting was used. The personal is super friendly also.", "pics": null, "resp": {"time": 1553251078606, "text": "Thank you very much David! 👍😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "109095453557409818928", "name": "Lisa Castagna", "time": 1546791711174, "rating": 5.0, "text": "I have been using RedDog Sitting for over a year for my three dogs.  They visit my home every afternoon while I am at work.  They are reliable and even text pictures and messages during each visit.  They have accommodated last minute requests from me when I have needed them on weekends, as well.", "pics": null, "resp": {"time": 1546792028578, "text": "Thank you very much! We appreciate you :-)"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "106475314071941642786", "name": "chris murchison", "time": 1547908729018, "rating": 5.0, "text": "Red Dog Sitting Services has been a fantastic care provider for our 2 dogs and one cat. We have used them since 2013. They are reliable, punctual, friendly and always willing to help us out in a jam. Cydney and Karl run a top-rate business and we would highly recommend their services to anyone looking for the best!", "pics": null, "resp": {"time": 1547908877631, "text": "This is wonderful! Thank you Chris 😊 We really appreciate your long-time patronage and love your furries 😊🐕😺"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "107283668426191379928", "name": "Megan Duda", "time": 1550277306711, "rating": 5.0, "text": "I have been using Red Dog Sitting for several years now and don't know what I would do without their help with my dog, Rosi!  They take her on daily 30 minute walks and I know she's a happier and healthier dog because of it.  Cydney and Karl are very responsive and will get back to you in a timely manner if you have any questions or concerns.  I would highly recommend Red Dog if you need any pet sitting services!", "pics": null, "resp": {"time": 1550278740619, "text": "Thank you very much Megan! We value our relationship with you very much 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "117689918364135132950", "name": "Jason Alexander", "time": 1546900066895, "rating": 5.0, "text": "We never worry about leaving our pets when we go out of town. We know they are in great hands!", "pics": null, "resp": {"time": 1546901960526, "text": "Thanks very much for this!! 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "113362563848983941308", "name": "Laura Heidelberg", "time": 1546703573632, "rating": 5.0, "text": "After a very negative experience with a former dog walker (stole over $2k with four theft charges), I was hesitant to allow another person into my home. RedDog Sitting is a local family owned bonded/insured company and from the first meeting have been nothing but professional and courteous. The same sitters walk your dog and if anyone new is added to the circuit RedDog notifies you immediately, orients them to your dog and their routine, and allows you to meet them in person. The sitters are wonderful and provide daily updates with texts and photos from the walk and truly love your dog as their own. RedDog is additionally very flexible and accommodates last minute changes to your schedule. RedDog comes highly recommended and I trust them in my home, which is a  small miracle given our prior history!", "pics": null, "resp": {"time": 1546703797188, "text": "This is wonderful. Our pleasure and thank you so much Laura!!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "108502350401399430680", "name": "H Todd", "time": 1567273387777, "rating": 5.0, "text": "I absolutely love Reddog!!! I’ve used them for years. I wouldn’t trust anyone else with my pups.  We use Reddog for weekly visits and overnight sits. Our pets stay at their house, no strange  kennels. Reddog is always professional, on-time and friendly.  And the prices are very reasonable.", "pics": null, "resp": {"time": 1567275135512, "text": "Thank you Hope! We appreciate our longtime relationship with you and look forward to many returns 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "102999731463696228483", "name": "Kim Dinunzio", "time": 1548344945063, "rating": 5.0, "text": "We have an 11 year old dog who requires a little more attention because of the medications he needs. RedDog sends two sitters a day to be sure that our Bandit gets all the meds and attention he needs while we are away.  They are wonderful in sending updates and pictures daily/nightly to reassure us that everything is fine at home.  Thank you RedDog for your professionalism and good care!", "pics": null, "resp": {"time": 1548345860996, "text": "Thank you Kim! Everyone loves Bandit and we really appreciate your patronage 😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "115354462550390588459", "name": "Robert Akscyn", "time": 1547237000672, "rating": 5.0, "text": "RedDog provides excellent pet sitting services at a very reasonable cost. I always appreciate the peace of mind they provide while out of town!!", "pics": null, "resp": {"time": 1547237682980, "text": "Thank you Robert! At your service 😺😺😺"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "111630172827562395479", "name": "Sandy Morrison", "time": 1546484158763, "rating": 5.0, "text": "Karl, Cydney & their stellar sitting crew have taken care of my fur babies for many many years. We’ve lost 2, but currently have 5 In our fold. Its clear they are committed to truly caring. Wouldn’t use anyone else.", "pics": null, "resp": {"time": 1546484877755, "text": "Thank you, Sandy, for this awesome review :)"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "116948342641847954640", "name": "Vickie Newman", "time": 1548804464096, "rating": 5.0, "text": "Karl and Cyd have helped me with dog sitting services for over 8 years and have always met my needs.  Local couple with superior customer service.  You can trust them with your most precious furbabies.", "pics": null, "resp": {"time": 1548805342476, "text": "Thank you for this! We cherish our long relationship with you 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "110893893298288973791", "name": "Hope Lewis", "time": 1547168022945, "rating": 5.0, "text": "Wonderful customer service...they have taken great care of our fur babies not just dog and car but guinea pigs and turtles too!", "pics": null, "resp": {"time": 1547168848762, "text": "Thank you very much Hope!! This is really appreciated 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "115724292775322468499", "name": "Amanda Hardin", "time": 1546708069805, "rating": 5.0, "text": "I adore Reddog!!! We travel in spurts and when we do they take care of our Golden Retriever mix. She is very clingy and it's hard to leave her, but knowing she is in such good hands helps so much!!  We have Reddog visit her twice a day and they will walk her, play with her, snuggle with her (anything we need) and we always get pictures and an update on her activities every single time they visit her. It's very reassuring and the best part is that Toffee is so well loved by her caretakers - Nikki, Kayla and Erin - which is awesome too! They are a great group of folks and I highly, highly recommend them (and I have a high standard for customer service). :)", "pics": null, "resp": {"time": 1546708499449, "text": "Thank you, Amanda!!  We love Toffee!!!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "109997521377733297032", "name": "Teresa Minor", "time": 1547923685533, "rating": 5.0, "text": "Hands down the best dog sitting service in Birmingham!  They take excellent care of your babies.", "pics": null, "resp": {"time": 1547927649805, "text": "Thank very much Teresa! We appreciate you! 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "102689014392775744397", "name": "Dany Hollingsworth", "time": 1547911688622, "rating": 5.0, "text": "We love RedDog. Our 60 lb pound puppy didn’t always play nicely with other dogs his size, so when we boarded him, we always had to request play time was with the little dogs. Sometimes these requests were honored, & sometimes they weren’t, and he was grounded and denied play time. With RedDog, and less cost, we know Cosby is happy, and comfortable. We have an electric fence, so he gets to spend the day chasing squirrels and barking at cars, but he still looks forward to his walk, cuddles and dinner when the sitter arrives to bring him, our mail, and any packages inside. We love the pictures she sends us of a happy dog and the text messages about their time together. The sitter turns on random lamps and such, so our home doesn’t appear so ‘They aren’t home’ and Cosby gets dinner and pettting. The sitter comes back in the AM to offer breakfast, more snuggles and ball throwing before letting Cosby out for yard patrol. With a child playing travel soccer, out of town games pop up with little notice, and it’s nice to be able to count on RedDog.", "pics": null, "resp": {"time": 1547912127432, "text": "We really appreciate you sharing all this detail and we really appreciate you!! Thank you for taking the time and we look forward to many returns 😊👍😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "110205721556379596878", "name": "Sierra Phillips", "time": 1547326228745, "rating": 5.0, "text": "Karl has done a great job managing the dogsitting of our two pups. He gets in contact with us well in advance to schedule visits, and is very flexible with when our schedules change at the last minute, which can occur from time to time. All of his dog walkers send detailed updates with photos after every visit, and we can tell our dogs have expended a lot of energy when we get home after they have visited. We would recommend this service to anyone in the Bham area.", "pics": null, "resp": {"time": 1547338175530, "text": "Thank you for this Sierra! We really appreciate it and love the pups ❤️"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "118381445207529290221", "name": "Jeannie Brown", "time": 1550687458301, "rating": 5.0, "text": "Red Dog Sitting Services has been a blessing for my entire family.\nWe have been using their services for many years now and I can highly recommend them.\nThe owners and staff are great, they help take away all the stress and anxiety of being away from your pets because you know that they are well taken care of in their own home! This is huge for me.\nUpdates and pictures with every visit. The mail is picked up, the thermostat and lights adjusted as needed.  Any special instructions, meds or even their flea and tick meds have been administered as needed while I was away. I can truly say that I could not ask for a better service or for better people, this makes me happy. Thank you Red Dog!", "pics": null, "resp": {"time": 1550676254786, "text": "Thank you for this! We appreciate you 😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "101064380405726358615", "name": "James Thomas", "time": 1548272836518, "rating": 5.0, "text": "My wife and I have utilized Red Dog Sitting Services since Karl and Cydney started. After 10 years, hands down we would not trust anyone else with looking after our furry children.", "pics": null, "resp": {"time": 1548273897570, "text": "Thank you for this wonderful endorsement. We value our long-time relationship with you and your trust!! 😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "106848122475362029180", "name": "DAWN OWENS", "time": 1546611141836, "rating": 5.0, "text": "I've used RedDog for about 10 years to care for my babies.  They remain in touch with me if there is even the slightest issue with my pet, provide detailed updates, photos, etc so I don't miss a beat when I'm gone!  I wouldn't trust anyone else!", "pics": null, "resp": {"time": 1546611976334, "text": "This is really valuable, thank you so much Dawn!! 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "109321014824973294801", "name": "Whitney Emery", "time": 1547697413804, "rating": 5.0, "text": "I’m so thankful my neighbor recommended RedDog to us last year because it has been a game changer when we travel. We know our “Furr Kingdom” , as Karl calls it, will be well looked after and all of our babies will get the love and attention they need. Our regular sitter, Jackie, immediately clicked with 3 of ours who are reluctant with strangers. It is more than just taking care of the pets though. Jackie reached out to me after the tragic and sudden loss of my brother. She keeps us well informed while we are gone and sends photo updates. RedDog has been such a blessing and we will undoubtably continue to use them.", "pics": null, "resp": {"time": 1547698299157, "text": "This is wonderful! Thank you Whitney 😊 we are honored to be of service 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "108140012108106437832", "name": "Aine Fox", "time": 1548525144466, "rating": 5.0, "text": "I was so impressed with owner, the responsivness, the professionalism and most of all the wonderful Margaret ann who treated my dogs as her own and sent pictures and videos frequently. A++++++×", "pics": null, "resp": {"time": 1548528748426, "text": "Thank you for this wonderful review!! It is our pleasure to be of service 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "105838379033342816463", "name": "Kathy Lovell", "time": 1547167849340, "rating": 5.0, "text": "RedDog is amazing... They are wonderful!!!! They take such good care of our kiddos!!!", "pics": null, "resp": {"time": 1547168814276, "text": "Thank you so much Kathy!! We appreciate you 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "113874705397270552282", "name": "Eric Schrandt", "time": 1549633953537, "rating": 5.0, "text": "In 3 years of watching our dogs we never had any issues. Someone always came as scheduled and our dogs were happy.", "pics": null, "resp": {"time": 1549640187525, "text": "Thank you for this Eric! 😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "116525403772734796300", "name": "Timothy Gawne", "time": 1553278855107, "rating": 5.0, "text": "Utterly reliable and professional.  They are not just watching the dog, they are a set of eyes and ears for the house as well.  A lifesaver if we are out of town and something goes wrong.  Recommend without reservation.", "pics": null, "resp": {"time": 1553280752710, "text": "Thank you for this wonderful review Tim! We appreciate your long-time patronage and look forward to many returns 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "111365504096184690508", "name": "Joe Jolly", "time": 1546189176645, "rating": 5.0, "text": "We have used RedDog for the past six years, when we first brought home our two english bulldog puppies, Hank and Louie. I had been taking them to my office for awhile, but they got too big and rambunctious. They were still too young to be left alone all day. RedDog was a lifesaver. They took care of the boys, plus the other three adult bulldogs we already had. We have never had less than five dogs at once, which always made traveling or overnight trips a hassle. Boarding that many dogs was expensive, not to mention traumatic for them, having to be away from home. RedDog stepped in there as well, providing overnight service for our crew in our own home! The peace of mind this gave us when we were away is beyond words. Over the years, our crew has grown and changed, adding in granddogs as well. Currently, we have 11 dogs in and out of our home!! This includes 4 new French bulldog puppies! Again, these needed extra attention, and RedDog was there, providing twice daily visits for the pups. We also have a special needs bulldog, who wears diapers at all times, as well as special medications. RedDog never balked. They change Lily’s diapers, give her meds, and whatever else is needed. We get photo updates at every visit, as well as special texts if there are any specific concerns. RedDog has even taken one of our dogs to the vet when a scuffle broke out and she was injured. We cannot say enough about, nor recommend RedDog more highly. They are a part of our family, and we would not trust anyone else with our crew!", "pics": null, "resp": {"time": 1546190812430, "text": "Thank you, Joe, for this amazing review!  We consider y’all a part of our family as well. :-)"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "112326893912772877141", "name": "Therese Laeger", "time": 1549421909669, "rating": 5.0, "text": "We have relied on Red Dog Sitting in various ways to help us be sure that our dog, Suti, is well taken care of when we're out of town or have super busy schedules during the work day.  Each sitter/walker, walked, fed and spent time with him were affecionate, responsible and cheerful in their care.   Communication with sheduling and requests are pleasant and very professional.  We continue to and will continue to trust Red Dog with helping us take good care of Suti.", "pics": null, "resp": {"time": 1549423003166, "text": "Thank you for this Therese! We look forward to many returns 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "111652925613012862313", "name": "Mazie Marchiony", "time": 1547177781465, "rating": 5.0, "text": "Karl and Cydney Buchholz at Red Dog Sitting have taken care of our pets since 2013. We have peace of mind because we know our dearly loved pets are safe and content at home, getting excellent care, love, and attention.  The sitters are great, sending text updates with pictures for each visit.  Karl and Cydney met personally with us before the first visit, getting to know us, our pets, and our expectations.  Cydney schedules visits in a professional manner, taking note of special requests.  On the rare occasions we need to communicate directly while traveling, a simple email gets a quick response.  We highly recommend their services with no reservations.", "pics": null, "resp": {"time": 1547178398473, "text": "Thank you very much Mazie!! We value your long relationship with us 😊😊😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "106512890155810141475", "name": "Cheryl Grissom", "time": 1546484325061, "rating": 5.0, "text": "We’ve been using RedDog for about 4 years now.  We use them weekly for dog walking and also to look after our cats and goldfish when we are out of town.  One cat requires medications daily.  They don’t charge extra for giving meds, it’s included in the visit.  When our cat has hidden we’ve asked them to flip mattresses over, run the vacuum, really whatever to get the cat out from under the bed so she can get her meds.  Once they couldn’t find her and came back later that day to give her meds.  They only charged me for one visit.  The owners Karl and Cydney are always so nice and responsive to requests.  They typically send out the same people so you and your pets get used to them.  Our dog walker Cynthia is the absolute sweetest and even our neighbor commented on how nice she was and how sweet she treats our dog Bella.  I know other people who use them and I’ve only heard great things from them as well.  I’m so glad I found RedDog!", "pics": null, "resp": {"time": 1546485021741, "text": "Thank you, Cheryl, for this amazing review!  We appreciate your business :)"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "111626045155331369049", "name": "Andrea White", "time": 1546483526655, "rating": 5.0, "text": "We use Red Dog to care for my father's cats as he is homebound, frail and cognitively impaired (and has sitters of his own!).  The two Red Dog sitters assigned to care for his cats come Mon-Fri and feed the kitties, give them cuddle time, clean the litter pans and change them out every other week, and take photos with daily messages to me about how they're doing and any issues encountered during the visit.  (A family member takes care of the cats the other 2 days/week.)  The Red Dog team has been great eyes and ears for the cats and also for anything else amiss they notice.  On one occasion when one cat was sick, the sitter offered to take the cat to the vet for me because I was still at work.    Very competent, caring sitters who love animals and will go the extra mile to help the animals be well cared for.  Also of note, working with the owners, Cyd & Karl, has been very nice.  They are very responsive by email and phone and offer great customer service and flexibility.  Can whole heartedly endorse Red Dog for animal sitting!", "pics": null, "resp": {"time": 1546484040582, "text": "Thank you so much for the wonderful review! We appreciate it!!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "106587124285562182114", "name": "Andrew Warnberg", "time": 1546913924025, "rating": 5.0, "text": "I have been using Red Dog right at three years now and they are a God sent. They have truly saved us in last minute situations in taking the absolute best care of our cats (we have three very spoiled cats). At the very start, I met with Karl (one of the owners) who met with our cats to understand their habitat and basically to make sure we were a good fit with them and they with us. Like I said previously, they have helped us in and out of last minute situations. As a cancer patient, I would be checked into hospitals and facilities sometimes out of town and at the very last minute. Having a working relationship with Red Dog has really helped facilitate taking care of our babies if they needed access to the house (they already had a key) or if the babies ran out of food during the unexpected stay and they purchased food till we could get home with a reimbursement. Needless to say, we can sleep a whole lot better at night when we are out of town and get those pictures of our babies at the end of the day that our sitter has sent to us via email or text. Pictures not only of the cats but also any packages that may have come, mail, a clean food area and litter area, not to mention attention given to the babies during the visit including playtime.\n\nRed Dog Sitting Services are absolutely the BEST sitting services that we have ever had and have had no problem recommending them to all of our pet lovers in a heartbeat.", "pics": null, "resp": {"time": 1546914406977, "text": "We appreciate you Andrew!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "102855696604676471121", "name": "Rose Jolly", "time": 1546637048734, "rating": 5.0, "text": "When we added 2 bulldog puppies to our family, we decided to hire a sitting service to let them out with our other dogs at lunchtime while we were at work.  Eventually, we also had to ask for an overnight stay or two.  After more than 5 years, we still use RedDog for our 4 English Bulldogs and 3 French Bulldogs.  Our sitters have always come at the time we expect, given our babies great care and love, texted cute photos to us from the visit, and been extremely trustworthy.  A few years ago when we went on an Alaskan cruise, we were gone for over a week and a bit anxious about leaving our dogs.  RedDog came in the middle of every day and again at dinnertime for the overnight stays.  One of our dogs had a health issue, and our sitter even went by our vet's office to pick up a prescription.  Now that's service!  Our dogs are our \"children\", and RedDog is like family!", "pics": null, "resp": {"time": 1546644289363, "text": "Thank you Rosie!! 😊"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "106180970768373998889", "name": "Sharon Zeng", "time": 1495306336053, "rating": 5.0, "text": "This was my first time using a pet sitting service. I found RedDog through a Google search. From beginning to end, I received exceptional service. On their website, they have all the information you need to get started. The owners, Karl and Cydney, were the nicest and most helpful people. I loved that Karl responded to my calls and texts quickly. I felt comfortable asking him any questions I had. They understood that I was uneasy about letting a stranger in my home, especially when they knew I was far away. Karl and Cydney eased my worries, and quickly got me set up with a meet and greet and all the paperwork.\nAshley was my sitter, and she was just as fantastic! She paid attention to every single little instruction and detail I gave her. She visited during the agreed time and sent me updates with many cute pictures of my 2 cats! Both of my cats LOVED her! Even my shy cat that doesn't like strangers, warmed up to her on the first day.\nBecause of RedDog, I was able to enjoy my vacation worry free! I can tell there was a difference in my cats when I came home; they weren't stressed like they used to be when I left them home alone!\nI'd recommend RedDog to anyone looking for a pet sitter while they are away. They were all so friendly, attentive, and they cared about the wellbeing and happiness of my cats just as much as I do.", "pics": null, "resp": {"time": 1546190858770, "text": "Thank you for this wonderful review, Sharon!"}, "gmap_id": "0x888925e18e0748e3:0x699fedc3f62dbaa3"}
{"user_id": "114884549057545406865", "name": "mary Meyer", "time": 1624848468150, "rating": 5.0, "text": "I love this establishment. They do a amazing job!! Always on point and exceed my expectations. They are amazing with my dog and really care. I will not go to another. They have a amazing booking website and super fast with responses of anything. WOW like wow. I love them.  They even contact you back to make sure you don't need anything after.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "111773111780443111832", "name": "Jan Ellison", "time": 1621440302872, "rating": 5.0, "text": "As this was my furbaby's first bath I was apprehensive about how it would go. They were gentle and made Izzy feel safe. She came home soft and smelling nice. I will definitely take her there again.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "105277734403369165304", "name": "Misty Bonner", "time": 1620690665686, "rating": 5.0, "text": "I can't say enough wonderful things about this business and their employees.  I was very hesitant to leave my puppy anywhere because she was having a hard time interacting with strangers and other dogs.  In no time they had her relaxed and making friends.  The employees would text me pics and videos without me even asking. My pup LOVES going to daycare now. HIGHLY recommend them for your fur babies.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "104347781597279303105", "name": "Jovet Alejandro Sanchez Martinez", "time": 1620525318487, "rating": 5.0, "text": "They treat my dog like one of their own. Prices are reasonable and customer service is amazing.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "100167906163683846616", "name": "Frantina Wilson", "time": 1606846574432, "rating": 2.0, "text": "I have to say I had heard negative things about Piper's from friends, but I continued to use them because we had always had good experiences with them. However, I really can't give Piper's a good review after my 4 babies latest visit over Thanksgiving weekend. We took more than enough of everything that our 2 dogs and 2 cats would need for a stay that spanned from Wednesday night - Sunday night. When we picked them up and got home we noticed left over food for the dogs, we took separate bags for each dog for each day, so was there a day that the dogs were not fed. In addition, MOST of the food we took for the cats was still in the bag...that concerns me as well. My 18 month old cat came home extremely jittery and has been jumping at the slightest noise. I can't say that Piper's did anything wrong, but I will say that our furbies did not come home happy this time. The cats will probably never go back and I will have to think long and hard about taking the dogs back too. The staff, as always, was great in their interactions with me.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "108299346240122722530", "name": "Lydia Higgins", "time": 1614187779357, "rating": 5.0, "text": "We love Piper's Playhouse and have utilized their services when they were at their old location in Saks. We absolutely love taking our pups to them, as they take awesome care of them and provide us with pics of playtime when we are away. We will always take our pups there for grooming and vacation getaways!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "111926228822824614912", "name": "The Lott Spot", "time": 1592229543789, "rating": 5.0, "text": "They were truly a blessing and helped us when we were in a bind. My dog was labeled as aggressive by my veterinarian when I tried to board with them. I called Piper's playhouse and the owner personal helped calm me down (I was furious with my vet for not even really trying!!) and allowed me to come visit the facility and my dog loved them and it was great!! We would of had to cancel our plans to go out of town if I didn't find them. They were awesome to me and with my dog. Forever grateful!!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "105799120183737254174", "name": "The Loc Kingdom By Endless Design Braiding LLc", "time": 1621913933454, "rating": 5.0, "text": "Yess love them", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "116561047404504141497", "name": "Fred Pope", "time": 1608644428042, "rating": 5.0, "text": "Great doggie daycare and Great people !\nI just love this place !", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "112503298034377245857", "name": "Teresa Aguilar", "time": 1560047516379, "rating": 5.0, "text": "We used Piper’s Playhouse to board our dog, and I must say we are very pleased!!  He was so loved and cared for!!  He came home all nice and clean!!!  I would recommend Piper’s Playhouse to anyone who has the need!  A special thank you to Shannon and the other staff for making our boy feel loved and welcomed!!!  We will use Piper’s again!!!  Thank you for being so great and professional!!!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "110476716237317025592", "name": "Charnika Reynolds", "time": 1580306341378, "rating": 5.0, "text": "I love them, and so does my Hemi. They are heaven sent. Not only do they board, they have a daycare center, so my baby is not caged up half the day. They even have an amazing groomer. I can travel with ease, and not have to worry about how my baby is doing 🥰 They're reasonable priced as well.", "pics": null, "resp": {"time": 1583588183157, "text": "We love that handsome yorkie!!! Thank you for the kind words! We can't wait to see you again!"}, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "117011582583399731982", "name": "Bill Kimber", "time": 1599582188799, "rating": 5.0, "text": "Positive experience.  Will definitely board dog there again.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "104590229742410370331", "name": "Marissa Manfre", "time": 1596562289414, "rating": 5.0, "text": "Great customer service always satisfied when I come here.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "113808795803710108571", "name": "Black American Made", "time": 1591917245107, "rating": 4.0, "text": "Great service and its a easy process to drop off and pick up your pup", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "112437041650820876751", "name": "Tiffany Hayes", "time": 1565121412842, "rating": 5.0, "text": "My dogs first day was today and we both loved this place. Very affordable and clean. Best place in town Bailey love his bath", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "111854938501015770810", "name": "Teresa Davis", "time": 1553512241472, "rating": 5.0, "text": "I would like to Thank the Staff at Piper's Playhouse for the special accommodations they gave to me & my babies...Chuck & Rocket! I like to Thank the Owner & Shannon for coming in early to help accommodate my schedule. Again, I truly appreciate the staff for making my babies comfortable while we were here in Anniston, Al. on assignment.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "115766774953868122240", "name": "Kayla Donner", "time": 1551891834461, "rating": 5.0, "text": "I’ve taken my dog here to be boarded three times now and am very happy with the service. I can tell she has a lot of fun with the other dogs and is well taken care of. I love that they post pictures and videos of the dogs every day on Facebook, it really eases my anxiety. I definitely recommend this place over any other boarders in the area.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "105067033443752444555", "name": "Megan Wade", "time": 1579276807944, "rating": 5.0, "text": "Love Piper's they are amazing and always so friendly. My dog always loves going in to be groomed here.", "pics": null, "resp": {"time": 1579280899681, "text": "So happy Theo loves his spa days! We love having him."}, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "108444739649725110691", "name": "Richard Ensley", "time": 1552140771471, "rating": 5.0, "text": "Staff was very friendly. I felt comfortable leaving Andy with them. They try their best to make your dog feel at home. I will definitely be using them again.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "112868629283319038509", "name": "Melita Muhammad", "time": 1417187347916, "rating": 5.0, "text": "As a busy college student at a nearby university, Piper's Playhouse has been nothing but a blessing for my dog and I. I am so thankful for the staff, especially Connie, and the care they take of my dog! The love these people will have your dog is truly unconditional. The prices are extremely affordable and they offer daily deals! I highly recommend Piper's Playhouse!", "pics": null, "resp": {"time": 1417195501377, "text": "Thank you for the great review!!"}, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "104284891656815593011", "name": "Melinda McElroy", "time": 1463522249098, "rating": 5.0, "text": "I have been bringing my puppies, Jazzy and Jagger to Piper's for two years and we LOVE it! We've used grooming, daycare and boarding and we've never had any issues. They are always exhausted after a fun filled day at doggy daycare!  The staff truly care about the animals and do everything possible to ensure the animals are fully taken care of properly. We would never dream of going anywhere else or trusting our pups with anyone else!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "114214258659404389730", "name": "Tia Stambaugh", "time": 1429635733638, "rating": 5.0, "text": "Absolutely fantastic! My Husky's loved the groomers and they did a great job! Very friendly staff and we were given advise on how to properly take care of their coats and such. Great prices and awesome daily deals! Highly recommended!! We will definitely be making this a regular routine!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "111808956783552220006", "name": "Cade Somers", "time": 1459181863391, "rating": 5.0, "text": "Our family dog is well-behaved for our crew that includes 3 kids ages 5-11. He loves to fetch baseballs, run, play, and frolic in the occasional Alabama snowfalls but he doesn't get out to socialize often with other people or dogs, so he can act territorially aggressive when kenneled once or twice a year. We've kenneled him other places before, but he came home the happiest when we used Piper's. He came home clean and happy, and the staff seemed upbeat and positive both at drop-off and pick-up. I know he's likely not the most easygoing dog for which they provide services, but our family appreciates them for their professionalism and care.", "pics": null, "resp": {"time": 1459190581226, "text": "Thank you for the wonderful review! We can't wait until Homer comes to see us again!"}, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "103911857628625098781", "name": "Nicholas Shelton", "time": 1421891719596, "rating": 5.0, "text": "I have three hyper-active brindled rescued dogs that absolutely love this place, they begin going nuts when we are still blocks away. When my dogs are there for daycare, boarding, or day school they come home completely worn out and sleep/lay around for the next two days. They groomers do wonderful work. I cannot begin to express my gratitude to the wonderful people who work there for giving me peace of mind while I am away. I highly recommend entrusting your pet with these wonderful people for all of your pet care needs.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "102414743164202669003", "name": "Tessey Johnson", "time": 1483891756413, "rating": 5.0, "text": "I am very happy with everyone from Piper's Playhouse. They had my babies Casey and Daisy for 3 days, I was able to see pictures of them on their facebook page to see how they were doing. But the most impressive to me was how when my trip home got messed up because of the weather, they stayed late so I could get my babies back instead of having to wait another day. I had missed them so much so this meant the world to me. I would gladly take my babies back to stay with them. Thank you all so much", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "102718991019999599715", "name": "kala mitchell", "time": 1560308949810, "rating": 5.0, "text": "My pup has been going to pipers for almost 3 years now. Even though my pup started daycare at an early age she isnt very social towards other dogs. However she isnt aggressive. The staff at pipers recognized this right away and made accommodations to make her feel safe. While she is visiting she is allowed a safe place to withdraw when the interaction of other dogs is just too much. At the same time she has just as much freedom to join the group and observe or if she is in a really good mood play! The fact that they treat each dog according to each dogs personality and temperament speaks volumes! It is above and beyond and average doggie daycare! My pup is always excited to go to day care! She starts crying from excitement as soon as we turn off quintard. She is always extremely excited to see the staff, especially Alisha! 😉 (her second mom) Thank you to Alisha, Shannon, and all the Pipers staff for 3 years of great service!! 💖🐶", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "101983146291124795588", "name": "Elizabeth Blue", "time": 1517675917925, "rating": 5.0, "text": "They took such good care of my dogs when we boarded them there for a long weekend. As part of their boarding price doggy day care, playing with other size-appropriate friendly dogs, is included!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "100364746246892208090", "name": "Lisa Amerson", "time": 1491622885809, "rating": 5.0, "text": "Good prices, easy to get reservations. Dog is always excited to go. Love that they take pics daily and I can see how Scout is interacting.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPROA8xjOkP-aywts9aryCSqqUTIwVE5oW1c_Rw=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "105169780828862624482", "name": "Stephen Mann", "time": 1502404327719, "rating": 5.0, "text": "They've kept my dogs on several occasions and have always done a great job.  They are also very reasonably priced.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "109876790394024618967", "name": "Jennifer Jackson", "time": 1557002928084, "rating": 5.0, "text": "My fur babies look so awesome after their visit and the staff is wonderful. Found my new groomers", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "118317340174834258627", "name": "Erin Calvert", "time": 1537044473620, "rating": 1.0, "text": "This local Dog establishment is violating multiple heath codes. The owner of this facility and the manager were told on multiple occasions by employees and were aware of the following: Fire extinguishers (they only have 2) being extremely out of date, last checked back in 2015— also no evacuation plan, or safety drills, air vent maintenance doesn’t take place— vents/filters not properly maintained can easily catch fire, this company works with LIVE animals, the safety of your dogs are not being considered as you can tell from the images.... everything is layered with years of dog dander and hair.\nWhen the heater gets turned on the smell of burning hair lasts for days and the company uses wax melts up front to mask the smells. They also stuff the vents they don’t clean with smell good beads to mask the smell.\nEven daycare dogs are kenneled. Employees hang around upfront until around 9 when they decide to start putting dogs in daycare—- this means if you’re paying for a full day or even a half day of doggie daycare starting in the morning your furbabies are missing out on 2+ hours of socialization. This facility doesn’t properly clean the daycare room. And weeks worth of hair is noticeable near the drains in the daycare play areas, this is extremely unsafe for your animals/the employees. The smell in this building that’s separate from the building your drop off your dog is horrific. Dogs are left unsupervised in daycare, and the daycare supervision in maintained outside of the daycare rooms- so instead of dogs getting that one-on-one attention they are only monitored when barking has increased. Because of that, rooms aren’t cleaned right away causing burns on paw pads from dogs playing around in urine. Most dogs have to be ran through Grooming to be spot cleaned before leaving. Bored dogs have started eating the walls of this establishment because of the lack of social interaction they receive. This facility illegally mentioned to employees that they can not pay overtime to them when they have worked 40+ hrs. Because of this, I believe the care of the animals that go there are being affected.\nDuring the recent snow storm an employee managed to chase a already nervous dog around the front lobby of this establishment causing him to run out of the front door. This dog was missing for a week and found with his hip shattered, and he had ate an entire toe off of himself.. this establishment paid his vet bill which included the cost of utilization. Clearly the proper training of employees is not being conducted. This facility also does not clean kennels often and when they do they use a dirty mop to wipe out the kennels. This is probably a factor to the outbreak of kennel cough they are currently battling.\nMany times employees just feed  dogs breakfast without even bothering to clean the kennel first or move the dog to a clean kennel.. that means that they were eating breakfast in their own filth and kenneled with it until daycare started up. In It’s hard enough trusting someone, let along finding out an establishment you’re paying LOTS of money to is neglecting your animal. This establishment recently caused the death of a small 4 lb dog, and they are trying to cover it up. By deleting comments and blocking any negativity they receive. I refuse to be silent. This facility is anything but transparent!!!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "117481193391463817778", "name": "Shannon gilmore", "time": 1463604031614, "rating": 5.0, "text": "I wouldn't take my two babies anywhere else!! They love everyone there! My oldest dog is nervous around strangers and he doesn't hesitate to run up to everyone there. The groomer is amazing and I have never been disappointed. I have a 6 year old male dorkie (dachshund/Yorkshire terrier) and a 1 year old female schnorkie (schnauzer/Yorkshire terrier), who are both rescues. I recommend pipers to everyone", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "106483610856282471562", "name": "Faith Wright", "time": 1510797514421, "rating": 5.0, "text": "Great place for our fur babies! They pups love to play and the staff all take good care of pets.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "111446729338740942535", "name": "Rebekah Shierling", "time": 1473712018853, "rating": 5.0, "text": "They kept my lab for a few days. She has never been boarded or been to doggie daycare. She came back to me just the way I dropped her off. They were very understanding as to her walking for 15 minutes. They posted pictures of her playing daily! They said she enjoyed herself and they loved her. I would bring her back because for the first time in 6 years I didn't worry about picking my dog up and them being under stress, no walked enough, kept in a crate all day, or not being checked on plenty.\n\nThanks to piper's dogowners can rest easy knowing their pups are being pampered to the fullest in a clean environment!\n\nI even called and ask if my lab could stay one more day one the day I was supposed to pick her up from our trip and they were happy to let her stay in her room!", "pics": null, "resp": {"time": 1473712854539, "text": "Can't wait to see Mocha again!"}, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "100598519111238694895", "name": "wild rose", "time": 1592991631715, "rating": 3.0, "text": "It is a daycare ONLY!!!! THEY NO LONGER ADOPT DOGS OUT!", "pics": null, "resp": {"time": 1593012005428, "text": "Piper's Playhouse is a boarding, daycare, training and retail facility, but you are correct about the rescue. We had to close the Piper's Rescue in 2018 due to the lack of income to keep it running. We do work with other local rescues in order to continue helping in the community as much as possible. Piper's also holds drives for the the local animal shelters at least once a year to help in that aspect. Piper's Rescue a"}, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "110809502256626216585", "name": "Rachel Bonnett", "time": 1525126476934, "rating": 5.0, "text": "Wonderful with my Tod his hairstyle always looks amazing.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "103986465175291528978", "name": "Marilyn Hart", "time": 1463532435466, "rating": 5.0, "text": "Piper's Playhouse has been a lifesaver!!! We recently got a very sweet but very high energy rescue...Smokey:)  They were not scared off by his hyper-self and have been a wonderful help in helping me make his entrances and exits not so wild LOL;). I live and work in Gadsden so add 3 hrs and 140 miles to each work day for Smokey to go there...it's worth all that extra effort bc I know he is well taken care of(they welcome me calling to check on him), having fun, and will be toast when I pick him up, which makes nights much more manageable;). This place of business is clean, professional, helpful, loving, and a blessing for dogs and dog owners!!!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "104164033250429318134", "name": "Kate Upchurch", "time": 1514492986333, "rating": 1.0, "text": "Prior to this past visit I'd have written a great review but when I picked my little guy  ( a shih tzu )up on Christmas Eve I was horrified! Shaking, limping and handed dirty bedding with no explanation as to how he was injured, why we weren't informed  when it happened plus finding out he'd been very stressed by being kenneled every night in the large room with the large dogs with big dog barks! When I first boarded @ Piper's 2 years ago I requested that he be kenneled at night with only little dogs and was shown a room off the hall on the right where I was told the small dogs stayed. When I asked why he was put in the big room this time with the big dogs she said \"well, you didn't request that he be separated\". If my file had been consulted I'm sure it would reflect my wishes. There was no I'm sorry we didn't contact you about his injury, etc. He literally had to be carried that night and Christmas day every time to potty, to food bowl, etc. While I understand this may not be the norm @ Piper's, ( had never happened to me before) since it happened this time, I'll be making other arrangements next time. Beware. Things are not always as they seem. Ask to see where your dog will be put at night. I was told they  NEVER allow tours! That's shocking! I've ALWAYS toured where I board my dog. Ask what their policy is if your dog becomes injured or sick. I asked when the owner would be there as I wanted to speak in person with them and was told the owner was never at the Anniston location. Really? So, I've emailed the owner to express my concerns.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "101620411781761026081", "name": "Wilson, Brandon David", "time": 1572417750539, "rating": 1.0, "text": "To fire one on leave seem real... despicable. More care is given to pups than those mental. If you've paid the piper you know who I am. The management's a joke, but current employees are grand.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "117103016751655594621", "name": "Leisa Cole", "time": 1514594323442, "rating": 5.0, "text": "My dog loves this place! People working here are GREAT!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "107932251503996229767", "name": "Alabama Zephyr", "time": 1541370281875, "rating": 5.0, "text": "Wonderful staff and a wonderful doggie day care! Thank you!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "108936122777324938034", "name": "Lawanna Wade", "time": 1497148743351, "rating": 5.0, "text": "Thanks to Pipers Playhouse  for taking care ol Handsome  for the Wades !", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "100705300402653043812", "name": "Shawanda Edison", "time": 1501296271174, "rating": 3.0, "text": "Prices aren't what they advertise. But it's a nice place to take your pet and know they are in good hands.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "103613549259580335544", "name": "Micah Morgan", "time": 1469047340910, "rating": 5.0, "text": "Highly recommended! Never had a complaint! My babies have been groomed here, boarded here and had play dates in daycare! If they were misbehaved I would have them in the training classes as well. There prices are very affordale plus they have just lowered the prices! They always have some new homemade nutritional snack for sale on the counter and tons of things to buy for your fur baby. Ranginger from shampoos to clothes to toys to collars and leashes. You will not be disappointed. Thank you Pipers for making it easier for me to go on vacation without being weary of how my babies are. Yall are awesome!\n\nAlso I would like to add with being a former employee of Pipers Playhouse. Know that your baby is well watched and takenjoy care of. Blankets, kennels and play areas are washed daily with non harmful chemicals.  They have very interactive play during daycare, someone is always watching and spending time with your furbaby. Medicine is well charted and given correctly.  Staff does their very best at making your pets stay as easy and comfortable as possible. The owner is the most compassionate person I have met and treat every animal with respect and love. You must check out Pipers for yourself!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "104661793894494991348", "name": "NameIs Private", "time": 1520093864051, "rating": 5.0, "text": "Great people great service.  Thank you", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "115601214795586323345", "name": "Ms. D.", "time": 1560829224734, "rating": 5.0, "text": "The front desk worker helped me a lot.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "117033767606963075874", "name": "Cory Clifton", "time": 1495721463193, "rating": 5.0, "text": "Great place for doggy day care", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "112934907525103783396", "name": "Toni Bell", "time": 1467750019146, "rating": 1.0, "text": "My dog was boarded the weekend of July 4th. He was picked up today and reeked of urine as well as his bed that was sent. Highly disappointed and will not be using pipers playhouse again.", "pics": null, "resp": {"time": 1467753593594, "text": "I am very sorry you were disappointed with our services. Rudy (still being a puppy) did have accidents in his kennel at night. He also played VERY hard in doggie daycare each day. His bed and blankets were washed each day - but in the rush of dogs leaving today (July 5th) it was overlooked. I have addressed it with my Boarding Supervisor and it will not happen again! We would like to offer him a free full-service bath."}, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "110976692842329565160", "name": "Maia Canning", "time": 1537928994504, "rating": 1.0, "text": "The place smells strongly of urine.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "110680826501288432919", "name": "Teresa Craven", "time": 1470088344982, "rating": 5.0, "text": "The daycare is the best!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "108894095358143086491", "name": "Cindy Palazzo", "time": 1572286348677, "rating": 5.0, "text": "Bought our boy from them. He is very healthy and extremely smart. Totally recommend their pups!", "pics": null, "resp": null, "gmap_id": "0x887d315b2e9b8795:0xc50a8baa572fa3ec"}
{"user_id": "106698733028280693691", "name": "Janet Burnett", "time": 1615469675378, "rating": 5.0, "text": "I've used The Furry Godmother quite a lot and it's always been a great experience! The sitters text on each visit so you don't have to wonder if you pet is being cared for.", "pics": null, "resp": {"time": 1615471472051, "text": "Thank you so much, Janet!"}, "gmap_id": "0x889a431eb9e41ef5:0xa5250aaf851ed764"}
{"user_id": "104937206293796425931", "name": "Laurie Watson McKay", "time": 1603199909106, "rating": 5.0, "text": "Very reliable and did a great job every time I had to travel. Photos and videos texted to me daily and updates with fantastic communication.  Tracy is wonderful and very professional.  I can not recommend her enough.", "pics": null, "resp": {"time": 1615471534456, "text": "Thank you, Laurie!"}, "gmap_id": "0x889a431eb9e41ef5:0xa5250aaf851ed764"}
{"user_id": "105724675183210067560", "name": "Karen Burton", "time": 1600883230297, "rating": 5.0, "text": "Trusted petsitters. They are diligent and truly love animals.  Bonded.  Great system for scheduling \"magical minutes\" to visit, feed, clean, and play with my kitties so I can enjoy a trip out of town.", "pics": null, "resp": {"time": 1615471566958, "text": "Thank you, Karen!"}, "gmap_id": "0x889a431eb9e41ef5:0xa5250aaf851ed764"}
{"user_id": "111545321498938309882", "name": "amie bennett", "time": 1597340152092, "rating": 5.0, "text": "We are forever beyond words of gratitude for Gulf Shores Critter Care. They made it possible for us to allow our precious boy Boxer, Hank the tank, to stay home rather than board him during our long work hours. We knew he was in the best of care and they were always reliable; we trust them 100%. It was so comforting coming home to our boy every night and could tell he loved his caregivers’ walks and company. We recommend their services to anyone who needs their fur babies cared for and look forward to continuing to use their services. Thanks 😊 so much team Gulf Shores Critter Care! We love you! ♥️🍀", "pics": null, "resp": {"time": 1598451366946, "text": "Thank you very much for the kind words.  Sweet Hank will always be in our hearts.  Lots of love to y'all."}, "gmap_id": "0x889a0f86e90525fd:0xa466331de93eaac"}
{"user_id": "108428523027177459926", "name": "Kristi Woods", "time": 1591894555309, "rating": 5.0, "text": "We LOVE Gulf Shores Critter Care. Our babies, Molly & Maggie love them as well. They get so excited when they go on their walk. GS Critter Care is very professional, always on time, and always spending the proper amount of time to make sure our babies are well cared for.", "pics": null, "resp": {"time": 1592049955391, "text": "Thank you Kristi.  We love Molly and Maggie!"}, "gmap_id": "0x889a0f86e90525fd:0xa466331de93eaac"}
{"user_id": "116327972723319132694", "name": "Lisa Bronzi", "time": 1591892120351, "rating": 5.0, "text": "They have always been quick to respond and accommodate me and my 2 cats. They are professional and take the time to visit  with my fur Babies.  They look forward to the next visit.", "pics": null, "resp": {"time": 1592050043200, "text": "Thank you Lisa.  Sami and Beignet are the sweetest kitties in the world!"}, "gmap_id": "0x889a0f86e90525fd:0xa466331de93eaac"}
{"user_id": "111245580689589410718", "name": "Drew Davis", "time": 1438033964458, "rating": 5.0, "text": "Bill has provided excellent care for my dogs - Emma and Sophie. He was at all times professional and provided suggestions on care for Emma, a diabetic and Sophie's (a miniature poodle) grooming and diet (an overweight miniature poodle). I consider Bill to be a friend and a part of my family.  Drew D", "pics": null, "resp": {"time": 1438034547009, "text": "Thanks Drew.  Any critter of yours is a friend of mine."}, "gmap_id": "0x889a0f86e90525fd:0xa466331de93eaac"}
{"user_id": "111773143288799622742", "name": "Tammy Lassere", "time": 1474408083207, "rating": 5.0, "text": "We were visiting Gulf Shores and traveling with our miniature poodle, Sophie, who has terrible separation anxiety and is also diabetic.  We never leave her alone, but wanted to be able to go out a few times to places that were not pet friendly.  We ran across Bill's website and contacted him to see what his rates were and how flexible he was with his schedule.  We were blown away with his whole process.  A website and user account is accessible to schedule appointments and confirm them, as well as a personal email and cell phone provided to contact him.  Sophie got along great with Bill and our only regret was not using him more often!   We had full confidence in him and if something were to happen to Sophie with her diabetes we felt she was in great hands.  We definitely recommend Bill and Gulf Shores Critter Care to anyone looking for a pet sitter!  Reasonable pricing and outstanding service (even on short notice)!  Wish we had a service like this close to us!", "pics": null, "resp": {"time": 1474488360931, "text": "Thank you Tammy.  It was a pleasure taking care of Sophie.  Hope to see ya'll again soon."}, "gmap_id": "0x889a0f86e90525fd:0xa466331de93eaac"}
{"user_id": "104748308144195150562", "name": "Mickey lee", "time": 1517099531804, "rating": 5.0, "text": "Be pet sitter in Baldwin county", "pics": null, "resp": null, "gmap_id": "0x889a0f86e90525fd:0xa466331de93eaac"}
{"user_id": "102429584853075100805", "name": "Debbie Kimble", "time": 1493406004643, "rating": 5.0, "text": "We consider Joseph a great friend as well as an awesome trainer. Our girls (3 Shelties) love him! He knows how to read a dog's unique personality and adjust training methods accordingly.  He incorporates behavior modification for issues such as barking, jumping, and building confidence in a fearful or shy dog.  He goes above and beyond expectations; he has made a free house call and given us helpful information and products even when we were not paying for a class. Top notch!!", "pics": null, "resp": null, "gmap_id": "0x888928a950435121:0x1ad1bdc51a06199"}
{"user_id": "100330268653224486343", "name": "kim keene", "time": 1493496270615, "rating": 5.0, "text": "Skeptic? Well I was too at first. Took me about 5 minutes at best to see that Joseph Honeycutt was truly a very knowledgeable and talented dog trainer. He will blow your mind with knowing your dog within the first 15 minutes and teaching them to do things you never thought were possible. I would recommend Joseph to anyone in need. Dare to be amazed, as seeing is believing.", "pics": null, "resp": null, "gmap_id": "0x888928a950435121:0x1ad1bdc51a06199"}
{"user_id": "116976716169660393075", "name": "Adam Hamaker", "time": 1489265058252, "rating": 5.0, "text": "Had a great experience. My dog loves the staff who is very experienced and are  knowledgeable about what they do. No second guesses about going back I highly recommend going to them and I will be back museld.", "pics": null, "resp": null, "gmap_id": "0x888928a950435121:0x1ad1bdc51a06199"}
{"user_id": "100522455182903773544", "name": "Kenlee's Creations", "time": 1494286283741, "rating": 5.0, "text": "We have been training with Joseph since our GSD was 10 weeks old, she is almost 7 months now. I can't emphasize enough the amount of help he has been. We HIGHLY recommend him to everyone we know.", "pics": null, "resp": null, "gmap_id": "0x888928a950435121:0x1ad1bdc51a06199"}
{"user_id": "100086767631609504911", "name": "Pam Mayes", "time": 1489691760227, "rating": 5.0, "text": "There are dog trainers, and then there is Joseph Honeycutt of CCE.  He goes far beyond the basic commands by recognizing each dog's basic needs. His intuition is incredible, not only with the dogs, but their owners as well.  Amazing experience!", "pics": null, "resp": null, "gmap_id": "0x888928a950435121:0x1ad1bdc51a06199"}
{"user_id": "109526416904272569988", "name": "Laura Tidwell", "time": 1489263656092, "rating": 5.0, "text": "Fezzik and I had our first session today and it was awesome! Not only did Fez learn a lot, I did as well!", "pics": null, "resp": null, "gmap_id": "0x888928a950435121:0x1ad1bdc51a06199"}
{"user_id": "104395015629272514781", "name": "Dana Molan", "time": 1526509183683, "rating": 5.0, "text": "Joseph is the best dog trainer.  He has done a great job with my service dog", "pics": null, "resp": null, "gmap_id": "0x888928a950435121:0x1ad1bdc51a06199"}
{"user_id": "110218083119124848803", "name": "Shannon Latona", "time": 1489268890580, "rating": 5.0, "text": "Joseph is one amazing dog trainer!!", "pics": null, "resp": null, "gmap_id": "0x888928a950435121:0x1ad1bdc51a06199"}
{"user_id": "113335328201335668735", "name": "Alexis Eady", "time": 1620438284410, "rating": 5.0, "text": "Was desperate to find a groomer after reuniting with a pupper that had been lost for some time and quite matted. She took good care of him and did a phenomenal job. Would recommend to anyone. Thank you.", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "112196014401704894215", "name": "Omauri Whotlow", "time": 1607723668629, "rating": 1.0, "text": "She is an extremely rude person. I called and she answered and said \"Hello, I need you to hurry because I have someone in my car\"! Very unprofessional. I wouldn't send my dead dog to her! DO NOT GO HERE!", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "116425821149253559752", "name": "Abby Owens", "time": 1594747829695, "rating": 1.0, "text": "This lady is terrible! I would never send my babies there! I called to ask how much she would charge to do a big German Shepard and a medium sized husky all she said was I can’t see them so I can’t tell you. Then she proceeded to ask me if I was at her house??!! She was extremely rude and unprofessional. She clearly doesn’t care about her customers", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "116750444092010281586", "name": "Brianna Deerman", "time": 1591731742489, "rating": 1.0, "text": "Terrible terrible hair cut on my Pomeranian nicked him 4 times he is terrified to be touched now to fix the chaos of a sad excuse of a hair cut on him. Just don't know how to cut period it looks like he basically is chopped up we're she didn't even try to fix it or fed his neck line down to his chest Worst $40 I've ever spent! Never take your animal here", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "105535281429442817584", "name": "Darlene Rembert", "time": 1414764364460, "rating": 5.0, "text": "Ms. Pam does a great job grooming my dog, Drew.  She has boarded him at her state of the art kennel, as well. And if you get your pet groomed, she offers one free night of boarding, if you board within 30 days.  I completely trust her with my pet and know that she takes really good care of him.  He loves her as well.  I recommend her to anyone who wants to take advantage of her love of animals and expert grooming.  She also has a pet sitting service that I plan to take advantage of.", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "109681033953110803639", "name": "Nikki Rowell", "time": 1414129835418, "rating": 5.0, "text": "I've been using Dirty Dog Saloon for the past 4 years and I Love It!! The quality of her work and just the love and care she shows my dog is rare. Its hard to find a place that grooms and boards your pet and the pet is always glad to see them or wants to go with them. This, to me, confirms that she truly loves and cares for my pet when she is in her care. Dirty Dog is hands down the BEST facility around and I would highly recommend them to ANYONE that truly loves their pet the way I love mine!!", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "106376369580287503365", "name": "F. A. Brown, Sr.", "time": 1556436508102, "rating": 5.0, "text": "Ms. Pam is a Rock Star! She gave our girls, Jacy and Juno the a Royal Custom Cut!. We LoveLoveLove Her! I recommend her to the World!", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "113906997100940722547", "name": "LeighAnn Gray", "time": 1414013679529, "rating": 5.0, "text": "Highly recommend! ALWAYS THERE FOR ME when we need (that need is to know my fur babies are well cared for) and Pam LOVES each and every one that walks through her door! Clean convenient and a lovable environment.", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "104932026173430743570", "name": "Christal Davis", "time": 1414763550916, "rating": 5.0, "text": "I have been using Pam since 2007 and absolutely love her.  She really cares about each and every pet that comes through her shop. I highly recommend her to anyone.", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "106251653879140101309", "name": "Clarence Bigham", "time": 1438377287090, "rating": 5.0, "text": "I have used Dirty Dog Saloon for many years. I am very happy with the work Pam does. I will use Dirty Dog  as long as I have my two Babies(Dogs). She does GREAT work!!", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "109069805970108212911", "name": "Denny Odom", "time": 1579642384996, "rating": 5.0, "text": "Never beed unsatisfied with the dirty dog", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "101137081506994117042", "name": "Glenn Todd", "time": 1414327996884, "rating": 4.0, "text": "Pam is a true professional passionate about her animals,fair prices kennels are spacious  animals are not in cages. If you love your pet let Pam do the grooming.She also picksup and delivery service for grooming. and offers pet sitting.", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "101144079417184375271", "name": "Jessica Costes", "time": 1520170608165, "rating": 1.0, "text": "I'm very unsatisfied with the service I was given. The owner was very short and honestly rude when I explained to her how I wanted my fur baby groomed. She had him from 10am-2pm. He did not smell that great when I picked him up and the worst thing of all she completely butchered his haircut. She left him so uneven it is ridiculous! His haircut basically looks like she cut his fur with her eyes closed!! I would advise everyone to take your fur baby some where else with better customer service and quality!", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "117583767334772848905", "name": "Shawn", "time": 1422376101543, "rating": 5.0, "text": "Great place to talk you dog for all your grooming needs. The owner is so sweet and passionate about the dogs. She always flexible with time and very reasonable $$$. This is the place!!! You have come to the right place!!!!", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "117534420322589801479", "name": "Malcolm Slaughtet", "time": 1538594841152, "rating": 5.0, "text": "My dog name is buddy and everytime he goes to dirty dog salon he comes back looking and smelling wonderful I just love her", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "103258777343186098643", "name": "Sammy Rogers", "time": 1538633857102, "rating": 5.0, "text": "love Dirty Dog Saloon!!. The best groomer in town!!", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "117748613274979485040", "name": "Frances Hilbish", "time": 1414280630966, "rating": 5.0, "text": "Pams dog boarding facility is one of the cleanest places I have been to. She is also an excellent dog groomer as well.", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "107540448311162823192", "name": "Robert W. Lewis", "time": 1414252072047, "rating": 5.0, "text": "I have been taking my one eyed baby to Pam for a while now she is really awesome with dogs her passion shows and she has a huge heart, my Lil maxx loves going to her and she does an awesome job grooming him, I would highly recommend her to anyone, she is always available when I need her, thanks Pam you rock!!!", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "103371327002974652630", "name": "Don Thomas", "time": 1553868832800, "rating": 4.0, "text": "Great job on my dog", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "106284374320384645164", "name": "Aubie9 Chic", "time": 1436540068521, "rating": 1.0, "text": "Dogs were traumatized when they left. You are not allowed to come in the shop, she brings the animals to the fence for you to pick up. It's in her words because of liability but in every grooming shop I've ever been in you go inside. My advise if you can't see where and what conditions your babies will be in just don't do it.", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "114703567666392935668", "name": "Gabriel T", "time": 1412612585277, "rating": 5.0, "text": "I had to go out of town, and couldnt take my dog with me, Pam was very helpful and inmediately connected with my dog, who is a brat. The place was clean and the mood was perfect for my nervous dog. Great place around the Birmingham area to take your pets to!", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "116840216397857241194", "name": "Ed Jennings", "time": 1488425898650, "rating": 1.0, "text": "Took my Yorkie and my Sheltie to Pam two weeks ago. Asked her to only trim paws, ears and butt on my Sheltie.  She trimmed the whole coat!  My Yorkie was basically untouched,  except for her back and her anal area was badly bruised and skinned with deep cuts from the clippers. She still has black bruises and large scabs.  I'm so angry, I haven't decided what to do.  My husband has taken my furbabies in the past to Pam, but I went with him this time.  The yard was nasty and smelled of feces. I would advise no one to go to her shop!", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "101931558365154241619", "name": "Barbara Hicks", "time": 1414015639782, "rating": 5.0, "text": "I have been having my Bichon Frise groomed with Pam Drexler since April 2014.\nI had a bad experience with my former groomer and lost my long time groomer to marriage and moving far away.  I met Pam in Pet Smart and she was so friendly, so when I needed a groomer I called her.  She has been grooming Casper ever since.  She is a very caring, loving groomer to all dogs.   Bichon's are very tedious to shape, blow out and make fluffy. Casper loves his bath and Spa day.  An excellent caring place to take care of your four legged children.", "pics": null, "resp": null, "gmap_id": "0x8888c4faeedf32e7:0xf3c5f7c6b54050a7"}
{"user_id": "112987680528129171856", "name": "Margaret Atchley", "time": 1563227067707, "rating": 5.0, "text": "Best vet around! Staff is friendly and everyone cares about your furbaby!  Wouldn't take mine anywhere else even if I had to drive 3 hrs! LOVE THIS PLACE!", "pics": null, "resp": null, "gmap_id": "0x88890eb25e69b5bf:0x85e329a4fc3fc47"}
{"user_id": "117920154596866413326", "name": "Keith Nichols", "time": 1523339147416, "rating": 5.0, "text": "They are above and beyond most folks experience.will see y'all soon", "pics": null, "resp": null, "gmap_id": "0x88890eb25e69b5bf:0x85e329a4fc3fc47"}
{"user_id": "114573519194864391979", "name": "april myers", "time": 1492158595327, "rating": 3.0, "text": "It has most amazing yard", "pics": null, "resp": null, "gmap_id": "0x88890eb25e69b5bf:0x85e329a4fc3fc47"}
