{"user_id": "102151330555940013425", "name": "Misty Campbell", "time": 1595428877977, "rating": 5.0, "text": "Very pleased with Frank, Jamie, and all the great people at Belle Shain!!  I contacted Frank when I was about at my wit’s end with our puppy, Cross.  He was biting/chewing excessively (on me mostly), he was unable to walk on a leash, and he was just not doing well.  Within a matter of weeks, Frank and his team have taught Cross how to behave better, he has learned commands, and he is a more pleasant dog to be around.  I can tell Cross loves being at Belle Shain, too. He enjoys playing with other dogs, running around, and swimming in the river. Definitely helpful for training and burning off all of that puppy energy!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNBkG47pNxuZXkUj9CBBRr-voyFlaKRaPpeoZPu=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a14f0165eea71:0x5aa2e58435435e87"}
{"user_id": "113748168912617365420", "name": "Annie Summers", "time": 1595379417403, "rating": 5.0, "text": "I trained my two dogs Dixie and Maddie with Frank and Jamie at Belle Shain Kennels. It has made a huge difference in how much enjoyment I get from my dogs now they will sit, heel and place. I highly recommend their training facility. My dogs love it there. I still take my  them for kenneling when I travel and day care boarding too. Frank does tune ups on Saturdays at the Woof Bar, I think that’s more tuning up the trainer than the dog🐶. Great people and wonderful property for the dogs to play.", "pics": null, "resp": null, "gmap_id": "0x889a14f0165eea71:0x5aa2e58435435e87"}
{"user_id": "117292286520508546555", "name": "Stacey Bottorff", "time": 1595378462858, "rating": 5.0, "text": "Great training and boarding program! Our dog spent about 3 months with Frank working on general obedience and then progressing from there. He is very knowledgeable and patient, incorporating training sessions with my husband and I throughout the months as well. Our dog enjoyed her time there!\nDuring her time there our dog also required some vet attention (preexisting issue) and Frank did not hesitate to get her into his vet for care. Would definitely recommend Frank and his training program to other dog owners!", "pics": null, "resp": null, "gmap_id": "0x889a14f0165eea71:0x5aa2e58435435e87"}
{"user_id": "108814512340698701460", "name": "Daniel Campbell", "time": 1595432774382, "rating": 5.0, "text": "Frank and the gang at Belle Shain are nothing short of fantastic. They are very accommodating and do a great job at a very reasonable price. Our dog was young, very energetic, and rambunctious. They are successfully turning him into a much better mannered young dog. He gets lots of exercise and loves playing with other dogs and swimming in the river (under supervision). He is excited to jump out of the truck he gets there every Monday morning and is obviously very well treated at Belle Shain. I can not recommend them enough.", "pics": null, "resp": null, "gmap_id": "0x889a14f0165eea71:0x5aa2e58435435e87"}
{"user_id": "111734365464358040515", "name": "Chase Emerson", "time": 1606151251140, "rating": 5.0, "text": "Frank and his crew were outstanding!!\nThey had my dog trained very quickly, and efficiently.\nNot to mention they treat all the animals very well. I will use them in the future over anyone else!!", "pics": null, "resp": null, "gmap_id": "0x889a14f0165eea71:0x5aa2e58435435e87"}
{"user_id": "107988567791643491279", "name": "Kyle Maxwell", "time": 1606151322765, "rating": 5.0, "text": "Frank and his crew did an amazing job training my dog and treated her very well.", "pics": null, "resp": null, "gmap_id": "0x889a14f0165eea71:0x5aa2e58435435e87"}
{"user_id": "100441863622463978090", "name": "Chris Wade", "time": 1595372645491, "rating": 5.0, "text": "No other place I would take my dogs. Frank did an awesome job with both of my dogs. Use him for boarding when we go out of town. Dogs have a blast and get excited when we pull in the driveway!", "pics": null, "resp": null, "gmap_id": "0x889a14f0165eea71:0x5aa2e58435435e87"}
{"user_id": "111292580442856975358", "name": "Abigail Jackson", "time": 1595423487219, "rating": 5.0, "text": "Clipper has had a blast this summer at training and boarding camp. He has learned so much and is now off leash. I have seen a total transformation in Clipper’s behavior and attitude. Frank and Staff are amazing to work with and really get to know and care about your dog. I am forever thankful for BelleShain Kennels.", "pics": null, "resp": null, "gmap_id": "0x889a14f0165eea71:0x5aa2e58435435e87"}
