{"user_id": "106350767182777437343", "name": "Nicole D", "time": 1572207478628, "rating": 1.0, "text": "I had to call numerous times to talk to my lawyer about my case and all i got was document. It seems like i am just a number not a person. Also  was unable to get any couseling services. I am the victim why do i have to be treated and punish again and again. I will not refer anyone in need to this facility.", "pics": null, "resp": null, "gmap_id": "0x888e8172b97721a7:0x2006b1e8f3981510"}
{"user_id": "102548782099643070514", "name": "Melissa Ortiz", "time": 1474902478386, "rating": 1.0, "text": "The counselor left the room to talk with another counselor and they were talking bad about me, I know this because she didn't close the door and I overheard them laughing about it. I know that swallowing your pride and asking for help is the hardest part but don't do it here unless you want people talking trash about you. This place is the reason a lot of women don't want to ask for help!!!", "pics": null, "resp": null, "gmap_id": "0x888e8172b97721a7:0x2006b1e8f3981510"}
{"user_id": "108535098481422491720", "name": "Stacie Willis", "time": 1618798798507, "rating": 1.0, "text": "I went there and it really was like no one cared about me but only getting their money I had been through so much before I got there I was abused by my boyfriend and abandoned by my own family not to mention I was on drugs ,I had a roommate that was stealing from the center and they punished me not her I had the worst client rep she only cared about the ones who had money.. I left the center and got clean all on my own without their help I mean I tried to ask for help no one wanted to hear my story Brenda just ignored my cry for real help I never relapsed the whole time I was there.. I’d never refer someone to that money making place they don’t care about you only the money....", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "109732978315492363003", "name": "Mandy Armitage", "time": 1597777037718, "rating": 5.0, "text": "I have never met 2 women that have hearts as big and genuine as Mrs. Brenda and Mrs. Malinda... The Lovelady Center changed my life and gave me all the tools to utilize out in the world to remain sober and drug free. My relationship with my kids has been restored and I now have a handsome grandson that I am able to spend lots of time with. Had I not went to The Lovelady Center there is no telling if I would even still be alive. Thank you so much for all that you have done for me Mrs. Brenda and Mrs. Malinda. I am now a much stronger, happier, independent woman and I was able to become this woman with the help that The Lovelady Center gave me. This a picture of my most handsome and wonderful grandson. Thank you Lord for The Lovelady Center!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMl1_QJzBOSS-A_oNytn-77wMXq_hpHLNQmsPri=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "111203269111180148013", "name": "Angela Edwards", "time": 1619257169924, "rating": 5.0, "text": "Man, this place is so amazing!! Everyone is just so nice here, and they love u so much... This place has taught me how to live life without drugs. I learned how to love myself ❤️ I wouldn't wanna be anywhere else. We're one big family, here at the lovelady center it doesn't matter where you come from, They take you in and treat you like family, they even let you have your sweet babies here . We have a church and a kid zone . Transportation and walmart trips 👌🏼 , Im currently in phase 4 of 5 . I'll be forever thankful for the lovelady and staff . N the best part is they are christian based ✝️🙌🏼", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "107169982013563387008", "name": "Gabriel Bruzzi", "time": 1616714852724, "rating": 5.0, "text": "My daughter has some mental issues and addictive drug issues as well. She had been there years ago for what she was going thru back then. They took her back again with open arms as she is going thru allot now. They called me to let me know she got there ok from Amtrak as they picked her up. I pray and hope she gets the help that they can provide for her. Having the word of God is such great help as well.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "113173430954081535174", "name": "Michael Ganey", "time": 1573062558367, "rating": 5.0, "text": "From Hevan was sent the lady's running the love lady center. They have saved and changed my wife's life. And with the power of God backing the ladies, nothing can stop them. God Bless you all. Thank You !!!!!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "101871523091700069988", "name": "Jessica Kuerner", "time": 1563899164344, "rating": 1.0, "text": "We scheduled a donation pickup and they called the day before to confirm, but then never showed up!  For several days we had to haul it out to the driveway and then haul it back in so it wouldn't get rained on, and they were so rude on the phone when we tried to confirm they were ever going to come get it!  Why bother calling us the day before and then not show up?  Luckily there are many other organizations in Birmingham that are responsive and grateful for donations, like The Exchange Club!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "103465405167840657897", "name": "David Melton", "time": 1559971370312, "rating": 1.0, "text": "What a load this place is. I cant recommend using Lovelady to make donations. They’ll call and tell you a truck will be in your area accepting donations for pickup but then they never show up. Then they’ll call you to reschedule, but they still won’t show up. I had several boxes of my mother’s clothes waiting outside for six days for them to pick up. When they finally did show, they picked up a couple small items and left everything else with a note saying they I needed to call again to reschedule. Only problem is, the next few days rain was expected so I had to haul everything back into the house. I’ve called several times since then and they won’t answer, ignore my calls, or send me to voicemail. So exhausting dealing with them. It’s almost like they get off on stringing me along but I’m not gonna beg them to come pick up my stuff. They should be the ones asking me. Oh wait, that’s right they did ask me when they called in the first place. Yeah, right. Good luck with that. I wanted to donate my mother’s clothing. She passed a way a few month’s ago and would have wanted it that way. But I can’t deal with the ineptitude, incompetence, and unreliability of Lovelady.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "106010787554681526423", "name": "Steph Casey", "time": 1549162933246, "rating": 5.0, "text": "Tonia Silas do you not understand what it means to work for your room and board?  Tell me where on Earth (other than jail) that you can go live for free? It is a shame that you are not the first person to come to the Lovelady with that attitude and you probably won't be the last. I've got news for you though; until you get real about living a productive life, supporting yourself and not blaming everyone else for all of your problems your life is not gonna change. There are many people in this world that do not care about you, your circumstances or your salvation, but Miss Brenda and Miss Melinda actually do.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "101754297470100673342", "name": "Stephanie Casey", "time": 1537452926709, "rating": 5.0, "text": "I love the Lovelady! I am grateful that this place exists to help people like myself. I am disappointed to hear people badmouth this place when there are such good people doing their best to cater to our every need. We need a place to stay? We got it. A soft, warm bed? We got it. Food to eat? We've got it. Clothing? We got it. Someone to talk to? (in the form of amazing counselors and client reps)-we've got it. Transportation? We've got it. Healthcare services? We've got it. Family legal assistance? We've got it. Stop complaining! I'm a firm believer that we are a family-a family of survivors...and a family in Christ. Stop talking bad about my family!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "117091323685356040915", "name": "Dennis Turnbaugh", "time": 1528735552668, "rating": 5.0, "text": "First of all I need to apologize to Ms. Brenda and Ms. Melinda for the review I posted 11 months ago! My wife graduated from TLC in January 2018. When she arrived April 2017 she was pregnant, and broken. She was sent on a court order which infuriated me. Neither of us realized how badly she needed to go to The Lovelady! My 2 children went there to live with her in June 2017, and our 3rd baby arrived August 2017. Had she not gone to TLC, she wouldn't have learned to live first for God and the rest would fall into place, nor would I. Even after moving out of the center they are still there for her, they're there for us! The people are amazing people of God and are an amazing support system!! They're still our family and friends and to be honest, we've never known friends, love, and support the way they've shown to our family! God knows what he's doing, and he sent my wife there for a reason. Had he not, I don't know where my family would be today. Many thanks and much love to all of the folks at The Lovelady Center!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "102046184030698226299", "name": "Leah Logan", "time": 1604971916657, "rating": 5.0, "text": "I love it here!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "114176399131309948694", "name": "Brenda Sullivan", "time": 1548176484929, "rating": 5.0, "text": "MY NAME IS BRENDA SULLIVAN McCLENEY AND I WAS SENT TO THE LOVE LADY CENTER BY THE STATE OF ALABAMA ON THE SUPERVISED RELEASE PROGRAM WHERE I SPENT MY LAST 9 MONTHS OF INCARCERATION THERE.. I MUST ADMIT THAT WHEN I FIRST ARRIVED IT WAS VERY OVERWHELMING...AFTER SPENDING SOME TIME WITH THE AMAZING PEOPLE THAT OWN AND RUN THE LOVE LADY THE OVERWHELMING FEELING THAT I HAD WAS REPLACED WITH THE FEELING OF PEACE AND MY WHOLE LIFE HAS BEEN CHANGED BECAUSE OF THIS PLACE!!!MRS BRENDA,,MRS MALINDA AND MY BEAUTIFUL CLIENT REP MRS TAMMY PORTER SHOWED ME MORE LOVE THAN I COULD EVER HAVE IMAGINED AND MADE ME WANT TO BE A BETTER PERSON!! THIS PLACE HAS TAKEN ME FROM PRISONER TO PRINCESS AND I THANK GOD FOR THE OPPORTUNITY TO BE ONE OF MRS BRENDAS MANY LOVE LADY SUCCESS STORIES...", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "112752716654036871874", "name": "Kayla Brown", "time": 1526865602970, "rating": 5.0, "text": "I as well as my daughter lived at the Lovelady center as I went through the program! If a person wants a new life the opportunity is there! Mrs Brenda, Melinda and the rest of the staff were always there to help! My daughter enjoyed the time there as she got to make friends and play as I sometimes worked in the Education and Kids zone! I would recommend this place to anyone seeking second chances and a sober life! Most of all they offer HOPE and LOVE as well as support!!! Assisted me in my court cases and even today I stand strong and sober without my Gods love my will and their “whole-way house” I would not be where I am today! Thanks Mrs Brendan and Melinda for having that vision where women in need may get that last chance to live and have a free life!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "115672259265402741962", "name": "Joseph Willingham", "time": 1504227055896, "rating": 5.0, "text": "Amazing place! This place brings women and children to God and sobriety.  To me that is sacred grounds. Addiction is the filthiest place on Earth and i hear people on here talking about dirty rugs.This is spiritual boot camp not the Hilton. if you have a problem with the rugs or playground then go volunteer. Otherwise just sit back and watch the miracle of God\"s work. This is a huge opportunity for someone that is willing to put forth the work of learning to have a better life.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "114113391770346841933", "name": "Amanda Whitman", "time": 1592419261242, "rating": 5.0, "text": "I have no clue who R is but I am a Lovelady and they have never charged me or my family for my meds.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "118432478298348106591", "name": "joni rogers", "time": 1561803378081, "rating": 5.0, "text": "God favors this place 🙌 my life was changed, giving thanks to all who answered God's calling, I've seen restoration, healing and pure worship.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "104619620964128683846", "name": "Susan Lay", "time": 1567020972251, "rating": 5.0, "text": "I was a resident from December 2006 thru June 2007 ... graduated the program and under the supervision of Hugh Thomas and Ms Brenda I started the Job Placement department.  My name was Susan Edgil at the time.  After graduating I continued to live on the 4th floor working on into 2008... I believe I left in March 2008. They provide EVERYTHING NEEDED TO PREPARE TO LIVE YOUR LIFE CLEAN AND SOBER... BUT YOU HAVE TO WANT IT.  IM STILL CLEAN AND SOBER...13 YEARS AND COUNTING!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "112620993439254436486", "name": "Ashley Head", "time": 1550820415727, "rating": 5.0, "text": "This place has been absolutely  amazing and has already began to work miracles and restoration in my life and with my children from broken to blessed this program truly works if you are ready for a life change and are ready to make that commitment  for yourself then this is definitely  the place to be everyone here is so full of love and support.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "100480615468362853072", "name": "Jennifer Creech", "time": 1568772014191, "rating": 5.0, "text": "Wonderful place and people. Changing lives daily", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "111591041285393662800", "name": "Christina Keener", "time": 1536611963540, "rating": 5.0, "text": "Loved this place!  Great people and wonderful staff that helped me so much!  Mrs. Brenda will always have a special place in my heart for all that she did for me!!!! 💜💜💜💜", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "102297633959894363939", "name": "Tom Dooley", "time": 1506032622337, "rating": 5.0, "text": "As a volunteer on the pastoral team I've witnessed first-hand this amazing \"whole-way house\" holistic program.  Each week I speak with dozens of women who are being transformed from addicts and incarcerated individuals into precious Loveladies.  This is an exemplary faith-based recovery center.  ti works.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "104353787908882036600", "name": "Maranda&Paul Godwin", "time": 1556854813672, "rating": 5.0, "text": "My name is Maranda Harville. I was incarcerated in 2011, 2012 for drug related problems. My life was great BUT I didnt know it! I've been reading what some of the ladies have said about this place so I decided to tell my story!!! THANK GOD! THAT I WAS SENT HERE. My community corrections officer an my mom an dad found this place for me. I was afraid an overwhelmed just like a few others, in the beginning! Not completely knowing what to expect an being away from everything and everyone I knew. That was key tho, an very soon into my journey I would find this out. The date that I am writing this is May2nd2019 an I have been COMPLETELY 100% clean an sober since the day i walked out of this place. 1st an foremost it takes a desire to change. 2nd it takes help. An 3rd it takes a higher power! Speaking for myself and only myself I found all of these things here at THE LOVELADY! God has always been a huge part of my life BUT I refound Him here. You see even tho He never left me I NOT ONLY LOST MYSELF IN MY ADDICTION I LOST HIM. An IN RECOVER YOU HAVE TO HAVE A HIGHER POWER!!! I choose for mine to be God! Mrs.Brenda, Mrs.Melinda, Ms.Brandi, an i definitely cant forget Pastor Lesley an Pastor Mullins! An so many more from admin to exit! I cant say enough good about them all. All of them have made it possible for females like me to learn how to live again. Of course there is some bad BUT all in all it was a great experience FOR ME! I was reading a post from a Ms.Silas an I completely disagree. The foodstamp stuff and the thrift store stuff is completely untrue! This program is Blessed, The Hand of God is on this place because they do so much good! There was a store where you could treat yourself an they do take foodstamps for your convenience. They do try an get you back out into the working world BUT IF YOU HAVE ISSUES THEN YOU CAN WORK WITHING THE FACILITY! Ms.Silas failed to tell you how you do schooling you can have your children here, they can go to school as well. So many good things an I will stand firm on this!!! THANK YOU LOVELADY CENTER! TO ALL WHO WERE THSRE WHEN I WAS THERE AN TO ALL WHO ARE THERE STILL AN NOW... CONTINUE TO DO WHAT YOU DO!!! IF WE WANT CHANGE IT CAN BE FOUND HERE!!!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "111402262849705246235", "name": "Cindy Isaacs", "time": 1530666322179, "rating": 5.0, "text": "I have watched miracle after miracle turn women's lives around.  This establishment is great for any woman that wants to turn her life around.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "100599570625461717481", "name": "Kimberly Pickron", "time": 1546446796516, "rating": 5.0, "text": "This place is truly God's house.. Amazing", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "116740752679350877118", "name": "Lisa", "time": 1550899642887, "rating": 5.0, "text": "I have learned who I was..who I am and who i will become! This place has changed my life and the people here have become my family!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "103974936204841273403", "name": "Rani Chapman", "time": 1478815975929, "rating": 2.0, "text": "There are pros and cons. Some good programs offered. But the mold and mildew make even the staff sick.I called the health dept to no avail. I called the state rep for that area and within an hour my dau. -in-law was kicked out for an offense that wasn't proven.The food is mostly donated expired food that isn't safe to eat.  And they get and keep 100% of each girls food stamps. Item donated  are then sold to the girls. And they charge family members for drugs paid for by medicaid and medicare.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "103580591423669844110", "name": "shirley mccord", "time": 1528072520286, "rating": 5.0, "text": "I called the Center last week to report a problem with a patient. The operator said she would have someone call me and I could tell her what happened. The return call never came. I have been a supporter for this center for years, am a christian countsler for girls with hurts and hang ups. This is very disappointing to me since this young lady has been in several faclities  including Love lady several time.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "103669534343350527826", "name": "Lily Roberson", "time": 1527348027176, "rating": 5.0, "text": "This place helped me and my mom develop a better relationship and it helped her with responsibility and a lot more", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "102824848429769577982", "name": "Laura Diane Bailey", "time": 1499346234798, "rating": 5.0, "text": "They helped my sister Karen brewer ,she is now drug and alcohol free, Thanks for all your help and support that you all did for her,GOD BLESS THE LOVELY LADIES CENTER,\nTHANK YOU,LAURA BAILEY", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "107405898633468998043", "name": "Lisa Hester", "time": 1408299673995, "rating": 5.0, "text": "Miss Brenda and her loveladies helped my sister become free from her addictions and got her to start believing in God, trusting in Him and following His ways! I will be forever grateful to this center for changing a woman we thought would never change. I pray nothing but the best for your success in helping the lost become found and changing the worst into the best! Thank you so much to all the loveladies at the Lovelady Center in Birmingham AL.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "105761249101982271604", "name": "Steve Pruett", "time": 1512518100637, "rating": 1.0, "text": "Lady at the desk was cold and non-receptive..\nDis not have any ideas how to help us with a family member.\nThey wanted $ up front (non-refundable) if our relative runs 2 days in, we lose it all!!\nNo acceptance letter or contract until theu get $...\nWe will go else where.\nOh btw, ive I've served in ministries helping people with addictions for many years.  I was sad to see such a cold lady to talk to!!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "109236546804545718844", "name": "Sheena King", "time": 1516907412980, "rating": 5.0, "text": "I love this place because this is where i found what ive been searching for....GOD", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "106860945439081303528", "name": "Susan McDonald", "time": 1457398868066, "rating": 5.0, "text": "GOD TRULY TRANSFORMS AT THE LOVELADY CENTER!! THANK U GOD FOR THE LOVELADY CENTER!!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "104066046471091803554", "name": "Janet Caldwell", "time": 1558875515665, "rating": 1.0, "text": "From visiting this place and observing it is a hazard and the poor kids that are there having to live in there is horriable who would put children with over 400 drug addicts coming in off the streets they get there cash assistance a d food stamps from these kids I hope it gets shut down or at least the kids will get taken out of there", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "115802036508042552842", "name": "Nelta Cox", "time": 1422820050107, "rating": 5.0, "text": "Save my life! Tks miss Brenda spann for answering gods calling:)", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "115355125222852794225", "name": "Brenda Kirksey", "time": 1422866815862, "rating": 5.0, "text": "Awesome place to be I was there in 2010-2011. I'm going back there tomorrow", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "107769261148041912161", "name": "Jerry Ippolito", "time": 1619031791964, "rating": 5.0, "text": "//////Gynarchy now!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "108084572461159663409", "name": "Ginger Tunnell", "time": 1522511391861, "rating": 5.0, "text": "Wonderful place", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "104612211716134179961", "name": "Courtney Woods", "time": 1513857026578, "rating": 5.0, "text": "This is an amazing place", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "103062729592318738830", "name": "Michael Witt", "time": 1476817799000, "rating": 4.0, "text": "Because my Sister is going there to get help for addiction problems.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "102949831934362286668", "name": "Bad Babies", "time": 1490059859368, "rating": 1.0, "text": "This place needs to be shutdown!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "104641463898667381099", "name": "jacob Fleming", "time": 1462685416305, "rating": 5.0, "text": "It the best it nice to be a love lady", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "113964637315498172481", "name": "Brett Rogers", "time": 1471391148674, "rating": 1.0, "text": "this place is a hoax/scam. a bunch of greedy, hypocrites.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
