{"user_id": "108452318216825960510", "name": "Chris F", "time": 1613760104075, "rating": 5.0, "text": "Friendly people in good service.And they  always have what I need", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "111629201481998458747", "name": "BJ Lawrence", "time": 1598628466675, "rating": 4.0, "text": "Very friendly, helpful, needed a board cut in two to haul and they cut with no charge.  Price was reasonable.", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "110637748586957343285", "name": "Deborah Perry", "time": 1598722770036, "rating": 5.0, "text": "Great service . Prices very reasonable . Courtious staff.", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "104508036459440389575", "name": "Patrick Erb", "time": 1577991419001, "rating": 5.0, "text": "They have really stepped up their game. Increased inventory a new-look on the interior with expanded products", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "111189521876633652396", "name": "Sandi Stephenson", "time": 1552754928754, "rating": 3.0, "text": "The young boy help in us was really clueless about everything we asked and the guy at the register was rude like he didnt want to be there. Other than that it was ok.", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "112552503212451880129", "name": "Danny Roberts", "time": 1540833581289, "rating": 5.0, "text": "If you need building materials and appliances at low prices check here first you will be back if you go anywhere else", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "102199070504581052250", "name": "Rodney Walker", "time": 1543781892163, "rating": 5.0, "text": "They have anything and everything you could want for home repair", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "106311822894182759034", "name": "Rodney Hopkins", "time": 1544925279169, "rating": 4.0, "text": "Good prices.", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "103378604934309790815", "name": "Claire Clune", "time": 1602094444315, "rating": 1.0, "text": "We were given a 5 week timeline for installation. After taking a half down payment ($3100) we haven’t heard back. After 7 weeks, my husband called a few times before they bothered to answer, saying they have no way of knowing when the windows will be done. It’s been 9.5 weeks now and no one will answer my calls or return them. I certainly understand delays are sometimes out of our control, but it is absolutely unacceptable that they are not staying in communication with us. A simple call with ‘so sorry, still in production!’ would go a long way here! I will absolutely not be recommending this company to anyone else. I welcome window depot to try to reply to this post; might be the only way I can get in communication with them. I will update if we ever hear back or get our windows installed.\n\nUPDATE: Finally did receive a call back (After leaving messages last Wednesday and then again today) and they seemed more than a little peeved I expressed that I was unhappy with their lack of communication. Regardless of COVID as an excuse for slow production, communication of the delay should have been a given.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "103281940355097742566", "name": "Joseph Carton", "time": 1484258483861, "rating": 1.0, "text": "Ordered windows on 7/30/16, install date was 10/11/16. Windows came in with internal grids that were not even, screens missing or damaged, one window measured wrong, installers damaged tube in master bath, windows in living room came with no grid. As of 1/12/17, still waiting them to finished installation. Very hard to give a good rating based on this service they provided.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNqnzqmJVYxbbIPuseWcb3fMkzzpHQlb4e1S9Qx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOHsY2K1L33y4K3bMHdb6iJtj4V46ZAe3PreR4P=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPGGgL8zEoMbjeZLuU2_Y6iOL1GeFM4mQ5F9Ej4=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "117807943614443149322", "name": "Dominique Ponder", "time": 1603296674000, "rating": 1.0, "text": "Wouldn't recommend anyone to use this company. We paid a deposit on our windows on June 1st, we were told it would be 8 to 10 weeks before they were installed. Called after 10 weeks  told the production company had delays. I had to call multiple times to find out this information. Never once did they call to inform me about any delay. So I waited another 4 weeks and called back. Got the same run around. Called back 2 to 3 weeks later and told them that they had a couple of days to figure something out or we would seek legal action. Miraculously a few days later they called with a confirmed ship date. The windows finally shipped and we had an appointment for install the next week. So TOTAL time from paying deposit to install was 19 weeks and 5 days.\n\nAfter they installed the windows and my wife paid them, I get home from work to see trash in the driveway and the yard. I call Zach the owner and told him about the issue. Luckily they hadn't left town yet and were able to come back and clean up their mess.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "108549765126962472556", "name": "Jason Hunter", "time": 1535347860580, "rating": 5.0, "text": "I'm extremely glad that I chose Window Depot to replace my windows. The customer service from Bill  the salesman a retiree was an honest straight shooter. He did not try to sale you anything that you did not need. Zach the installer took really good measurements. He also explained in details how the windows would be installed and he answered all questions. Saving the best for last is Josh and Mike. The are the actually installers. Words cannot express about there workmanship. This is the best two man crew I have seen. They showed up on time ready to work. They did not take any lunch breaks except water breaks. They also explained the how's and why's of how they had to install the windows. On top of that Josh also fix my Doors from some previous installers. They are extremely detailed and the work can speak for itself. On a scale of 0-10 I would give them a 10 and recommend them. I will be calling them for future work if they can do it.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "100919254530584997605", "name": "Kelly", "time": 1540384129917, "rating": 5.0, "text": "We are very pleased with the windows we had installed by Window Depot. We were given lots of information and helpful advice on finding the perfect windows for our project. The installation crew was incredibly courteous and went above and beyond with getting a date set for our windows to go up .If you're rearching companies in the area for your next home project, no need to look further. Go with this company.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "102242320992876172972", "name": "Pavlos Honderich", "time": 1513643169337, "rating": 5.0, "text": "I had 4 bids to install 16 total existing windows original to a 3 year old house.\n\nWe wanted to install 3 slider windows where we currently had a total of 4 single hung and 3 picture frames (2 sets of 2 and a set of 3 respectively).  The remainder of the single hungs would be replaced by double hungs and the 3 remaining picture frames would be replaced with picture frame windows.\n\nOnly Bill from Window Depot would listen to us and provided honest feedback some of which may have actually resulted them taking a few hundred dollars the less from us.  They also gave us an honest price since we went with our own financing.\n\nIt was the complete opposite than what we experienced with Champion who insisted on bells and whistles we didn't need or want and cost $2000 more for the same style and quality windows.  Champions sales pitch was also high stress (must sign today shtick to get special demo offer).\n\nWindow World had come recommended from a few friends but they insisted we go with double hung in all but the one picture frame over our bay window.  They insisted it would cost too much and wasn't worth it vs their recommendation for 15 double hung and 1 bay window.  Customer always knows best and Window World lost the job from the get go for that mistake.\n\nThe quality of the Window Depot installation job is also visibly much better compared to friends who have had Window World windows installed.\n\nBill in sales and Zach were great to work with.  Josh and his crew did an amazing job installing the windows.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "110730501645668626104", "name": "Jo Dumas", "time": 1524002057503, "rating": 5.0, "text": "Thank you Josh and Mike for installing our new windows! Really good job!! Love them! Thanks for clearing up everything and helping me take down the blind brackets!", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "102171617803775214912", "name": "Donna Smith", "time": 1487465432840, "rating": 3.0, "text": "Had one window installed, the person who installed very nice, although he installed a damaged screen which I saw and he had to replace it. The inside of the window looks nice but outside appearance did not meet my standards. Contacted owner regarding the issues but  not all were resolved. I have contracted with another window company to finish the project and install the remaining 7 windows.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "113731716665582127811", "name": "Billy White", "time": 1509769284864, "rating": 5.0, "text": "I dealt with Bill, Zack, and Josh and one other I think his name was Matt.  They were all very polite and helpful.  They did the job on time and as promised.  11/1/2017.  I had 4 windows replaced and plan to have more replaced in the future.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "113054961893537445624", "name": "Sam Woodson", "time": 1532557293621, "rating": 4.0, "text": "New Vinyl Replacement Windows installed May 2013, it's over 5 years now and they are holding up well.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
