{"user_id": "109181901050086478555", "name": "Randy Griffin", "time": 1479855602969, "rating": 5.0, "text": "Love being here for our customers.  We will treat you like family. ..", "pics": null, "resp": null, "gmap_id": "0x888de98abe7db2e9:0xcc3c5e693539d42"}
{"user_id": "117772474659194766937", "name": "James G", "time": 1564775600048, "rating": 1.0, "text": "This location is permanently closed as of this review on 7-31-19.", "pics": null, "resp": null, "gmap_id": "0x888de98abe7db2e9:0xcc3c5e693539d42"}
{"user_id": "101073502921077473569", "name": "Susan Brazell-Allen", "time": 1548700840510, "rating": 5.0, "text": "Great steaks", "pics": null, "resp": null, "gmap_id": "0x888de98abe7db2e9:0xcc3c5e693539d42"}
{"user_id": "106890606239815739930", "name": "Sherry Cross", "time": 1550200913401, "rating": 2.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x888de98abe7db2e9:0xcc3c5e693539d42"}
{"user_id": "114542778491079641632", "name": "Mandy Nall", "time": 1462559744766, "rating": 5.0, "text": "I've been a loyal patron of Country's BBQ since they opened their door for business on Zelda Road. It's truly the BEST BBQ locally.  Everything on the menu is homemade.  They offer everything from the best variety picks of vegetables (sweet potato is the bomb and HUGE, fried okra, corn on the cob, great fried green tomatoes are so yummy, field peas, mashed potatoes, cabbage… all recommended). The Q stew, i.e.:Brunswick stew is a winner. ALL PORK AND BEEF platters, inside or outside chopped, served with 1 or 2 sides,  French bread or cornbread will fill you up with a to-go box for sure. The ribs fall off the bone,  and I truly recommend the chef salad.  All dressings are homemade. Price per person is about $10-14 for a full meal. Homemade lemonade and sweet tea are outstanding. Don't forget dessert.  The pecan pie and lemon pie are the best around. If you've got the time to wait, their steaks are excellent too. Chopped steak is my favorite, the fried chicken fingers are so crisp and tender. My kids love them. They cater too, and do a very good job. Try a nearby Country's,  you won't be disappointed,  I promise.", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "110739396585456113769", "name": "Jeremy English", "time": 1465559004894, "rating": 4.0, "text": "Had the special, pulled pork plate. It was honestly great, sauce was pleasing and not too sweet. The sweet tea was outstanding, service was good, it wasn't crowded at all when I went. A little pricey at $13+, though.", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "113129167941233813751", "name": "Linda H", "time": 1436532291736, "rating": 5.0, "text": "I am very impressed with the owner of this establishment. If for some reason you have any problem, he will immediately take care of it for you. I suppose any of us can have a less than favorable experience, anywhere, at any time. I know first hand that Mr. Powell appears to care that his customers have a favorable experience!", "pics": null, "resp": {"time": 1436279242320, "text": "Dear Linda H, I greatly apologize for your experience this weekend with Country's Barbecue. That is not how I want our customers to be dining on a holiday! Please call me at the corporate office so I can make it up to you. Sincerely, Mark Powell 271-2017"}, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "117787135185957968669", "name": "Cynthia P", "time": 1441476234223, "rating": 5.0, "text": "Can't wrong with Country's BBQ.  I've never ordered anything I didn't enjoy.  They have a great club Sammy, a great (big) salad, great chopped pork, delicious sides and so much more!!  If you don't give them a try, you will be missing out on a great meal.", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "106277995931947969487", "name": "UnicornPoo OnU", "time": 1458439006323, "rating": 1.0, "text": "This is the second time me and my girlfriend have eaten here. The first time it was ok but nothing to write home about and tonight made the first time seem like a great experience. She got the pulled pork sandwich and fries. The pork was tough and cold and the fries were cold and covered in grease. I got the Larry's Special which is supposed to be tenderloin marinated in special sauce, and fries. The meat came out just slightly warm and the fries were cold and covered in grease. When they refer to their special sauce, what the menu should say is that the meat has been swimming in Dale's Sauce for about a week and is almost too salty to eat. The waiter asked how the food was, which was obviously a formality because when I told him he acted as if I'd said the food was great and walked away. That's the last $30 this place will ever get out of me.", "pics": null, "resp": {"time": 1459485225574, "text": "Hi Jonathan, I am sorry you were less than happy with your recent experience at our Zelda Rd. location. Everyone can have a bad day and maybe you caught us on one of ours. Please call me at the corporate office (271-2017) so I can make it up to you. I hope you'll give us another try. Sincerely, Mark Powell - Owner"}, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "109518478969520651741", "name": "Brian Wilson", "time": 1444258319233, "rating": 5.0, "text": "Loved our experience at Country's BBQ on Zelda Road in Montgomery!  Highly recommend to anyone for some of the best BBQ in the River Region.  Wife and I thoroughly enjoyed the food and the sauces were to DIE FOR!", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "105759821881878353132", "name": "K&A GrassBusters", "time": 1465069832789, "rating": 2.0, "text": "Ordered to go at Zelda Rd. I give a 2 star only because the stew and the tea was good.  My fiance order was messed up she ordered Okra and got fries cold fries at that also we didn't get the bread with our order. We changed from the Atlanta Hwy location to Zelda Rd because ATL Hwy messed our order up big time with my whole family it took us months to eat at Country's again probably will just cook my own from now on seeing the one place that had it together when I was growing surely doesn't have it any more", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "103207699313615503607", "name": "Jessie Godfrey", "time": 1455928302916, "rating": 5.0, "text": "The food was fantastic and the service was spot on! Had the chef salad with homemade ranch with pulled pork with bacon! Yes, it was as amazing as it sounds!", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "106885371602688721228", "name": "Kaleigh Flatt", "time": 1424818068872, "rating": 5.0, "text": "Great place for lunch.  I always get the vegetable plate or the brunswick stew.  And of course a giant sweet tea!", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "103515859303709220506", "name": "Tech Man", "time": 1440844799196, "rating": 5.0, "text": "2 or 3 times a year I drive from Atlanta to Mobile and back, this is my halfway point. I do not miss stopping in for lunch in both directions! Always great food and smiles!", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "111638515888197219056", "name": "Jacob Sterrett", "time": 1457900867175, "rating": 5.0, "text": "Absolutely delicious, we had the barbeque platters with two of the sides from the infinite selection. Meat was great, they had wonderful sauces as well. Would reccomend 5/5!", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "103089516401362879900", "name": "Pamala Howell-Paoli", "time": 1448837580507, "rating": 2.0, "text": "We were travelling through and looked on our phone to see what BBQ places were here. To my enthusiasm n surprise, Country's BBQ. I grew up in Columbus, Ga and go back from time to time. And EVERY TIME I do go back 1st place I stop is Country's. I LOVE Columbus Country BBQ and longed for it. About 3pm when we first walked in, the Mgr told us \"to walk over there, grab a menu and seat where ever we wanted\". There was 2 other couples in dining area. The waitress was outstanding!! I don't remember her name, but she was super bubblely. But we were so disappointed with the food. I ordered my usual; pulled pork platter. Husband ordered his usual; 1/2 chicken. Well the pork was drowned in chutney n coleslaw juices, which totally ruined the taste mainly b/c I don't like chutney. I used a numerous amount of napkins to dry up the juice. Husband's chicken looked liked it was cooked the day before or real early that morning. The BBQ sauce was dried and skin was wrinkled up and some spots were burnt. It was very dry. Husband informed waitress and she was very helpful and offered another one, fresher or something else. He ordered another chicken. The 2nd chicken was a more moist but didn't compare to the taste of Country's in Columbus. If Jim is affiliated with this establishment, he would be ashamed. Also, the Mgr had fixed a plate for herself and sat and ate. Not once did she come over to ask about why we sent it back.  How convenient it would've been since we travel through Montgomery often and it's closer than Columbus for us. Needless to say, we won't be coming back or if by some chance we do, we will hope to remember and not order the same thing.......", "pics": null, "resp": {"time": 1448860779322, "text": "Dear Pamala,\n\nI am so sorry to hear about your recent experience at our Zelda Road location. I am glad your waitress was wonderful, but I am disappointed to hear about your food experience. Thank you for bringing these issues to my attention so I can address them immediately. I would like to make it up to you! Please give me a call at the corporate office... 334-271-2017\n\nSincerely,\nMark Powell, Owner"}, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "109210997291833774763", "name": "Jim Davis", "time": 1440809190470, "rating": 5.0, "text": "My wife and I have been stopping at Country's for over 25 years when traveling between Atlanta and Pensacola FL. The BBQ is excellent, sweet potatoes are hugh, the backfire slaw is tangy, and the fried green tomatoes are outstanding. We love this restaurant.", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "114701525511725945888", "name": "MARJORIE BAKER", "time": 1440787039596, "rating": 4.0, "text": "Excellent, excellent barbecue, great brunswick stew, top notch chef salad and good southern sweet tea.  Would just ask them to work on appearance of restaurant, particularly the drive thru area.  Needs a bit of cleaning at the window, outside and inside.", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "115791191175952538925", "name": "Robert Smith", "time": 1424814646691, "rating": 2.0, "text": "This was the first time we have eaten at (take out) Country's BBQ (night of 23 Feb 2015).  I am not sure if the staff was just busy at time of order or what.  While calling in the order the person taking the order seemed inpatient. We picked up the order 10 minutes later and noticed there was only one person dining in Country's BBQ, 4 staff in the kitchen and one or two staff in the dining area. About 4 orders were picked up while we waited 10 more minutes (added item to order) for our order. After getting home I realized my 1/2 and 1/2 order of fried pickles and onions was far from being fried.  In fact it was very clear they had gone straight from the container to my take out container. Not cooked what-so-ever. I was soo disappointed. Was really looking forward to trying the side dishes. Now I travel a lot and have been to great BBQ places across the US and outside the US and this is definetly not one of them. Anyone who says Country's BBQ is great has not had good BBQ. Aside from the poorly prepared side dishes the BBQ (chicken and beef) was just okay, definetly not worth mentioning. Being that the food was just okay at best there was no reason to call and complain as we would have only gotten more phone attitude.  Would not recommend this place.", "pics": null, "resp": {"time": 1425420647795, "text": "Dear Robert,\nPlease allow us to apologize. We get a lot of good comments about our marinated barbecue onions. We have garnished our plates with these for 33 years. We only started frying these a short while ago. I have found the ticket for that evening and it is obvious that we filled the order with or regular marinated onions not fried… The order the chef got reflected barbecue onions and pickles, not fried or half-n-half. A simple miscommunication.  Please feel free to call the corporate office anytime you are not satisfied. 334-271-2017. I would be glad to forward you a replacement coupon or a refund. Thank you for taking the time to advise us.  Your business is sincerely appreciated.\nSincerely,\nMark Powell, Owner"}, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "116443395988788423660", "name": "Heather Jaquis", "time": 1424814217077, "rating": 4.0, "text": "Very good southern barbeque. Not overly expensive and not a chain which was nice to have on a business trip.", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "107242715372323426894", "name": "Aaron Dettling", "time": 1396064088401, "rating": 5.0, "text": "I love this place and try to eat here every time I'm in Montgomery.", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "109184865380870437193", "name": "Joe Birdwell", "time": 1467655787345, "rating": 4.0, "text": "The Sweet Tea and the CFS can't be beat.", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "111487101007019644288", "name": "Paul Sullivan", "time": 1440782104906, "rating": 5.0, "text": "Favorite BBQ in Capital City. Monster chef salad is two meals in one order. Always nice staff.", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "103633674314236372714", "name": "Amazin Vermazen", "time": 1459372345365, "rating": 5.0, "text": "Very good I'm out of town and stopped there and it reminds me of home", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "107178256830774637591", "name": "Cathy Parcell", "time": 1469707315480, "rating": 1.0, "text": "Fries were cold and chopped pork was super dry Mac n chesse couldn't even eat..sweet tea only thing got that was food", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "108866406472225587589", "name": "J Rabbit", "time": 1472448133494, "rating": 1.0, "text": "Smh", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "116043652500081300286", "name": "LaCheryl Lacour (2 Sweet 2 Be 4Gotten)", "time": 1467926861326, "rating": 3.0, "text": "Good bit so expensive.", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "113914868291124134456", "name": "Cleveland Stallworth", "time": 1467235007243, "rating": 4.0, "text": "Very good bbq meals", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "112787552006761260376", "name": "Danny Day", "time": 1466181935016, "rating": 5.0, "text": "Larry's special is PERFECT", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "115623463845091385136", "name": "franklin jones", "time": 1453333233205, "rating": 5.0, "text": "Best chef salad in town", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "115431361798449243322", "name": "stacey M", "time": 1445624087422, "rating": 5.0, "text": "Best Barbecue in Montgomery Alabama", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "100371977631267098144", "name": "Samaria Ivery", "time": 1455072486541, "rating": 5.0, "text": "It has great food", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "108329103873183846733", "name": "Crysta MzKitty Smith", "time": 1411250782035, "rating": 4.0, "text": "Give u your money worth", "pics": null, "resp": null, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "102903728461016685543", "name": "Al carl", "time": 1387334162866, "rating": 1.0, "text": "Customer service was horrendous.  Our bill was double it should have been, and though we disputed it, they basically wouldn't honor the prices that the waitress had CLEARLY quoted us. Skip it, people.", "pics": null, "resp": {"time": 1387554825537, "text": "Al carl, Please allow me to apologize, We certainly don’t want to overcharge anyone. Please contact us at the corporate office by e-mail or telephone, Mpowell@montgomerybbq.com or 334-271-2017. We get a lot of good comments about our service and food, but we also make our share of mistakes. Please give us a chance to correct our actions."}, "gmap_id": "0x888e81c3f76d90f3:0x34347714fabe9d0f"}
{"user_id": "112715675690624590499", "name": "Linda Schwemin", "time": 1622052531093, "rating": 5.0, "text": "Good food. Clean restaurant. Pleasant staff.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "115096641364222287042", "name": "Stephanie Mitchell", "time": 1615401567339, "rating": 5.0, "text": "Amazing chicken fried chicken! Great atmosphere, cute decor and a nice location.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOXfILHppg8VRzvc0Tdza48YCDBsRTt4EevtNas=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "116186165053334801183", "name": "Lynn Neal", "time": 1612984828093, "rating": 5.0, "text": "Food and service is always great. Staff is very friendly. Love their home cooked food and atmosphere is so nice. Beautiful place. Eat there often", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "115504570242067597150", "name": "Elizabeth Taylor", "time": 1597867547252, "rating": 5.0, "text": "We have been there twice now and both times was a fantastic experience. The first time I had their country fried chicken and this time I had the Rodeo Burger. Food was phenomenal!!! They have a pear salad that is amazing. Their fries are wonderful. The server is fabulous with a great attitude. The building gives off a great atmosphere. GREAT lunch stop off the beaten path.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "106487125828851083056", "name": "David Hardy", "time": 1621805000496, "rating": 5.0, "text": "This was absolutely delicious to love the environment in the waitress was really sweet", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "106729561546983142213", "name": "Appledroplarry", "time": 1612896845296, "rating": 3.0, "text": "Food was good. Mistakes on bill. Charged $3.90 for one canned coke. Waitress forgot salad dressing.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "107832780164867240493", "name": "Sandra Lindsey", "time": 1616937150183, "rating": 5.0, "text": "Great southern food! Great service & real southern hospitality!", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "106250390718162054122", "name": "Pamela Hadley", "time": 1609287401185, "rating": 5.0, "text": "The food was delicious!  This was our first time and we will definitely  dine there again!", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "113263425351825830132", "name": "Nancy Thompson", "time": 1571319727565, "rating": 5.0, "text": "Got the Wednesday special- chicken & broccoli chowder; very good & filling; perfect for the rainy day! Was 2nd customer luckily as place filled up fast; seats 46. All the food is made from scratch. Had to have the apple pie for dessert; outstanding! Crust was flaky, buttery & delicious! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "105781969731276202205", "name": "Julie Litzinger", "time": 1599075466543, "rating": 5.0, "text": "The food was delicious.  Our waitress, Tammy was friendly and the best!!!", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "114938869297026623163", "name": "Christy Blanton", "time": 1603657566667, "rating": 5.0, "text": "Service, atmosphere and food all very good", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "100629619971267293241", "name": "Cheryl S", "time": 1561745686771, "rating": 5.0, "text": "I had the fried fish and shrimp basket w/ double Lima beans. Very good.  I prefer the cornmeal breading like this to the usually flour coating.  It was a little salty but delicious just the same.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "109690646993326037435", "name": "Sherree Brush", "time": 1609970298910, "rating": 5.0, "text": "The best!", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "113210900009596585863", "name": "Nina Cooper", "time": 1551649021501, "rating": 5.0, "text": "The food was delicious! The restaurant very clean. I highly recommend Country Queen Cafe for good home cooking. We will be back.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "104440279155108370034", "name": "Veronica Godwin", "time": 1524075753033, "rating": 5.0, "text": "My mom and I stopped in today for the first time after hearing about how good it was from a friend. Let me tell y'all they did not disappoint. The staff was very friendly and the food was great!! Their meatloaf was one of the best I've ever eaten. My mom got the beef drip sandwich and will definitly be back for another.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "114995385900621638898", "name": "Stephen Eubanks", "time": 1544820990426, "rating": 5.0, "text": "Awesome service! Cozy and warm atmosphere. Very clean and delicious food", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "107666325122640938319", "name": "phyllis buchholz", "time": 1550604810300, "rating": 5.0, "text": "We had about 12 people.  The service was fast and excellent.  The food was delicious.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "102430095103380561336", "name": "Jeanett Lehamann", "time": 1593105697286, "rating": 5.0, "text": "Great food and staff.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "117956126139598339769", "name": "Tony Brown", "time": 1568830058981, "rating": 5.0, "text": "Good service and good food.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "100099809772712543262", "name": "Diane Inscore", "time": 1557259233588, "rating": 5.0, "text": "Very good!  Fresh food and good service.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "113763361370729615775", "name": "Dee. Dee Brandt", "time": 1613092034052, "rating": 5.0, "text": "Great!", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "115327717958909776706", "name": "Ed Voelpel", "time": 1497982943587, "rating": 5.0, "text": "This is real home cooked food. Limited hours, but you will love the quality! Out of the way location, but well worth the drive.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "115716556887063159340", "name": "Pam Williams", "time": 1549850223575, "rating": 5.0, "text": "The food is excellent and with very friendly service..We are so glad we found this place.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "105970180903940619541", "name": "Annetta Fortin", "time": 1521142613412, "rating": 5.0, "text": "The best Patti melt and fries. Cooked to complete perfection. Great service atmosphere and prices. A local favorite for sue.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "111608953103981875917", "name": "Bo Klug", "time": 1547667880913, "rating": 5.0, "text": "This place is a Hidden Gem for Fairhope the food was amazing the owner is  super nice everything on the menu is highly recommended", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "105999228819840716467", "name": "Robin Dixon", "time": 1551717324077, "rating": 3.0, "text": "I found it to be really expensive for a vegetable plate. It took a really long time to get our food. Food was good.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "105651031746053523602", "name": "Gloria K", "time": 1522369696576, "rating": 4.0, "text": "Food good. It takes a little to get your food, but it's worth the little wait. Prices fair.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "104104297758563299200", "name": "Lee Mccall", "time": 1535487531021, "rating": 2.0, "text": "Very warm inside. We were the 2nd table in the place and it took 45 minutes to get a salad that was warm and a patty melt.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "108190013214390750971", "name": "Jenny Hatfield", "time": 1537128551111, "rating": 5.0, "text": "Great service and one of the best hamburger steaks around with REAL mashed potatoes. This will be a regular eating place of ours from now on.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "115661072734908475220", "name": "John Wayne", "time": 1543794710642, "rating": 5.0, "text": "This place was awesome you can't beat great food and nice and friendly service the people there really know how to take care of you", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "113867380362926244149", "name": "Chuck Turner", "time": 1515085573510, "rating": 5.0, "text": "Very good Cuban sandwich, also country fried steak with gravy very good. Small place with good country cooking.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "107306626910231106872", "name": "Andy Henderson", "time": 1501683280764, "rating": 5.0, "text": "If you like country down home cooking, you will love this place.  Great swiss & mushroom hamburger.", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "111373574776117844610", "name": "Lynn Long", "time": 1557094378198, "rating": 5.0, "text": "Great place to eat , food is  delicious!", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "112977397783382884839", "name": "Kim Tracey ella", "time": 1504990401784, "rating": 4.0, "text": "It was really good wish they delivered", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "102147509625665773181", "name": "Kyle Lyles", "time": 1563132402883, "rating": 5.0, "text": "Really good Cuban sandwich", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "106411101311529049444", "name": "Beth Brooke", "time": 1539802426011, "rating": 5.0, "text": "Loved the food and atmosphere", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "112092088083953816141", "name": "Lottie Barrett", "time": 1537060673973, "rating": 5.0, "text": "Great food and service", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "101373355950093509976", "name": "Spring Clark", "time": 1505066219285, "rating": 5.0, "text": "The drip beef sandwich is AMAZING!", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "112530518175788334844", "name": "Justin Pierce", "time": 1514485865086, "rating": 4.0, "text": "Good quiet place to eat", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "104941579312990266813", "name": "Carol Howard", "time": 1501187106022, "rating": 4.0, "text": "Very good food!", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "118223420990982634039", "name": "jaymes urbanek", "time": 1576785074038, "rating": 5.0, "text": "Excellent!", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "114132952741163973430", "name": "Lisa Melton", "time": 1531876455814, "rating": 5.0, "text": "Really good home cooking", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "110231193039662624009", "name": "David Berga", "time": 1506706718606, "rating": 5.0, "text": "Very good", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
{"user_id": "110682272991600017096", "name": "fortworth steeler", "time": 1479962856824, "rating": 4.0, "text": "Not bad", "pics": null, "resp": null, "gmap_id": "0x889a3f8c77f29a93:0x550300c2410b2cde"}
