{"user_id": "110650588788552812811", "name": "Lynn Bradley", "time": 1626450874921, "rating": 5.0, "text": "Tom Austin is an incredible human being! Not only did he provide exceptional drafting services, he went above and beyond when I ran into issues with my contractor. He provided outstanding advice, recommendations, and points of contact to help get my project back on track and schedule. I HIGHLY recommend him and the team at Butcher Drafting Service. Simply amazing!!", "pics": null, "resp": {"time": 1626704849553, "text": "Thank you so much for the 5-star review, Lynn!  We enjoyed working on your detached garage and hope you will send us pictures when it is complete--we would love to see it!  Thanks again for your business!"}, "gmap_id": "0x886268884cf67f55:0x2db12dbaf753176"}
{"user_id": "116469226220027158155", "name": "Paula Austin", "time": 1623973848571, "rating": 5.0, "text": "Tom Austin and the entire team at Butcher Drafting\nare professional and courteous. They do what they say they will do, they show up on time. They produce Designs in a timely manner , prices are fair and reasonable. My husband and I not only use them for our own personal projects , we also recommend them to all of our clients.\nI think Tom Austin is a very gifted Architect and he is extremely dedicated to drafting your space exactly the way you want it in a timely manner.\nPaula Austin\nDurable Designs\nand Zeriss Realty\n\n( No relation, we just happen to share the same last  name) 😊", "pics": null, "resp": {"time": 1624024145535, "text": "Thank you so much for taking time out of your day to leave us a review Paula!  We appreciate your continued business and referrals!"}, "gmap_id": "0x886268884cf67f55:0x2db12dbaf753176"}
{"user_id": "102715469934373219277", "name": "Betsy Gifford", "time": 1625920029478, "rating": 1.0, "text": "Pathetically slow and non communicative with my builder. Tom visited with my builder at the end of May for an addition on my current home. He stated it would be a week or two for the first draft after he has received the blueprints on the home, which he had within the next couple of days. Over 7 weeks later there has been no communication with the builder or me and no first draft has been presented. The builder has chased with emails to no avail. Tom will now likely cost that company well north of $100k in revenue with seemingly no care. Perhaps this job was just a bit too small for him, in which case he should not have accepted it.", "pics": null, "resp": {"time": 1626709610607, "text": "Thank you for taking the time to leave us a review. All feedback is important to us, good and bad. We use the reviews to learn how we can improve and continue doing business. I do apologize for the delay in your project. This is completely my fault. As I mentioned to your contractor, it was very challenging. The space it would require would take up most of your study, making it practically useless. It is almost impossible to get the stairs in without them obstructing your front windows. I sent him three options, the day before you left your review. I had no way to contact you directly. Please know that this is not the standard in which we normally operate our business. I sincerely apologize for the delay in your project.\nThank you,\nTom Austin, Owner"}, "gmap_id": "0x886268884cf67f55:0x2db12dbaf753176"}
{"user_id": "100382801732562431202", "name": "donna d mccrary", "time": 1621888267828, "rating": 1.0, "text": "My husband and I contact Butcher Drafting to draw plans for an addition on our house October 2020.  I paid them half of the cost as they required on September 24, 2020 with the remainder due upon their completion of the drawing.  The first architect started on the project and after a few months we received a tentative drawing requesting our changes/comments.  We sent those back and did not receive a response.  In December 2019 we were told the delay was due to someone being sick.  January 2021 no response; February 2021, I called/emailed spoke with Tom Austin and was told they had not worked on our plans due to the loss of my husband’s sister.  This was really reaching, not sure how our loss impacted them.  In March 2021, Emily took over and she also failed to complete our drawing.  On May 12, 2021 I emailed her and she inquired about the location of the outside door.  I responded with, place it wherever it will fit.  I inquired about a timeframe for completion and she never responded.  Finally, I requested a refund on May 24, 2021 due to their continuous delays,  dishonesty, unprofessionalism and failure to communicate.", "pics": null, "resp": {"time": 1621974639917, "text": "We always aim to deliver a great experience, and we are gutted when we don't meet our customer's expectations. We have looked into this matter and can see where you feel let down. We are working to make sure this type of miscommunication does not happen again.  In our attempt to be respectful and give your family time to grieve instead of burdening you with design questions, we came across as non-communicative.  We appreciate your patience as our offices were impacted and closed twice due to our employees contracting Covid-19.  Thank you for taking out the time to leave a review and we certainly apologize that our service did not match your expectations. We wish you much success moving forward."}, "gmap_id": "0x886268884cf67f55:0x2db12dbaf753176"}
{"user_id": "104000457366744670868", "name": "B Bradley", "time": 1611543155379, "rating": 5.0, "text": "Butcher Drafting Services is an exceptional company. Tom was very easy to work with and his team of experts were able to produce amazing work for my detached garage within four days. I highly recommend there services to anyone that needs drafting services.", "pics": null, "resp": {"time": 1611583837808, "text": "Thank you so much for your review!  It was a pleasure to work on your project; feel free to send us photos of the project when it is complete!"}, "gmap_id": "0x886268884cf67f55:0x2db12dbaf753176"}
{"user_id": "116498124922978874692", "name": "Cathy McNeely", "time": 1626305996088, "rating": 5.0, "text": "Outstanding personalized service from an extremely knowledgeable staff!", "pics": null, "resp": {"time": 1626704949322, "text": "Thank you Mrs. McNeely!  We appreciate you taking the time to leave us a review!"}, "gmap_id": "0x886268884cf67f55:0x2db12dbaf753176"}
{"user_id": "114994446358425678119", "name": "Tori Bunch", "time": 1571095711917, "rating": 5.0, "text": "Butcher Drafting is beyond the best company to work with. The plans were done in a timely manner and for my boyfriend and I to be first time home builders they were there to help every step of the way. I give this company 5 stars hands down and wouldn’t have it any other way. I will definitely recommend them to anyone and everyone looking to build there own home.", "pics": null, "resp": {"time": 1571948533048, "text": "Thank you for taking the time to leave such a kind review, Tori! We're glad your experience was satisfactory. It was a pleasure working with you, as well! Please stay in touch. We look forward to seeing your new home, once construction is complete!"}, "gmap_id": "0x886268884cf67f55:0x2db12dbaf753176"}
{"user_id": "107271517859449854400", "name": "EVERYTHING CHILDERS", "time": 1590090021816, "rating": 5.0, "text": "Professional & Attentive.\nHandles clients business needs with sincerity & integrity.\nThankyou, Butcher's Drafting", "pics": null, "resp": {"time": 1590094293471, "text": "Thank you so much, Mrs. Childers! It means a lot that you've taken the time to write a review. It was a pleasure meeting and speaking with you. Please let us know if we can be of further assistance!"}, "gmap_id": "0x886268884cf67f55:0x2db12dbaf753176"}
{"user_id": "116187985877039429202", "name": "L A", "time": 1552937500524, "rating": 5.0, "text": "The team at Butcher’s Drafting were very professional and easy to work with. Great service and the price was reasonable.   Will use them again if future projects arise.", "pics": null, "resp": {"time": 1582736071208, "text": "Thank you for such a kind review, Latoya! It was a pleasure working with you, as well. We look forward to the possibility of working with you again!"}, "gmap_id": "0x886268884cf67f55:0x2db12dbaf753176"}
{"user_id": "111141522203121572896", "name": "John Dattilo", "time": 1553047322451, "rating": 5.0, "text": "Tom Austin and his company are fabulous to work with.  They are innovative and dependable.  I trust him to service my clients and I will soon trust them to design of my personal home.", "pics": null, "resp": {"time": 1582735875778, "text": "Thank you for writing this kind review, John! We are glad that your experience was a positive one. We look forward to working with you again in the future!"}, "gmap_id": "0x886268884cf67f55:0x2db12dbaf753176"}
{"user_id": "111943028654997666040", "name": "Chris Skinner", "time": 1552938651608, "rating": 5.0, "text": "Butcher Drafting Service does great work. They do a fantastic job dimensioning their floor plans. Which is extremely helpful in the field.", "pics": null, "resp": {"time": 1582736036238, "text": "Chris, we're glad to hear that your experience with us has been satisfactory! Thank you for taking the time to write such a thoughtful review."}, "gmap_id": "0x886268884cf67f55:0x2db12dbaf753176"}
{"user_id": "115855096455885938991", "name": "Tyler Rice", "time": 1502410765640, "rating": 5.0, "text": "Usually in any circumstance that requires me to hand off money I'm not a very positive person, but, dealing with everyone at Butcher Drafting has been an absolute pleasure. They are professional and very fast. I'm pretty sure if it wasn't for me making changes Logan Marston could have done my plans in 3-4 days possibly less. I would definitely recommend them to anyone wanting to build.", "pics": null, "resp": {"time": 1582736248067, "text": "Tyler, it was a pleasure working with you! Thank you for taking the time out to write such a thoughtful review. We truly appreciate your recommendation!"}, "gmap_id": "0x886268884cf67f55:0x2db12dbaf753176"}
{"user_id": "115085477685840494016", "name": "Amanda B Q", "time": 1552963878569, "rating": 5.0, "text": "They were awesome to work with! Very sweet people and did a great job!", "pics": null, "resp": {"time": 1582735949346, "text": "Amanda, thank you for taking the time to leave this review! We're happy to hear that you were pleased with our work and service!"}, "gmap_id": "0x886268884cf67f55:0x2db12dbaf753176"}
{"user_id": "110004774562649558591", "name": "Jerry Robinson", "time": 1552955434820, "rating": 5.0, "text": "Wonderful group of people that take care of your drafting needs.", "pics": null, "resp": {"time": 1582735995100, "text": "Thank you for this review, Jerry! It was a pleasure working with you!"}, "gmap_id": "0x886268884cf67f55:0x2db12dbaf753176"}
{"user_id": "105525198793427948437", "name": "Brittany stanford", "time": 1520429288734, "rating": 5.0, "text": "Great staff they always seem to be doing something new and imteresting. Very clean.", "pics": null, "resp": {"time": 1582736186256, "text": "Thank you for taking the time to leave this thoughtful review, Brittany. We're glad that your experience was a positive one!"}, "gmap_id": "0x886268884cf67f55:0x2db12dbaf753176"}
{"user_id": "101629945719503561967", "name": "Faye Robinson", "time": 1312034420543, "rating": 5.0, "text": "Tom has been a business associate for many years.  His professional experience allows him to design residential and commercial plans that meet code and are easy to follow.  Give Tom a call if you have any need for plans even if it is a sunroom, addition, garage or a new home or business.\nFaye Robinson, Meridianville, AL", "pics": null, "resp": {"time": 1582736298972, "text": "It warms our hearts to read your kind review, Faye! Thank you for taking the time to write something so thoughtful. And thank you for your continued support!"}, "gmap_id": "0x886268884cf67f55:0x2db12dbaf753176"}
{"user_id": "102936758836233818452", "name": "Trevor Cole", "time": 1552996159253, "rating": 5.0, "text": "Great folks to work with.", "pics": null, "resp": {"time": 1582735910714, "text": "Thank you for taking the time to leave this review, Trevor! It was a pleasure to work with you, as well."}, "gmap_id": "0x886268884cf67f55:0x2db12dbaf753176"}
{"user_id": "101145405627728326190", "name": "Shanna Jennings", "time": 1620822866300, "rating": 5.0, "text": "I am very happy with the stock plan that we purchased and had amended. Initially it was going to be a few small changes, and it turned into a much larger project than anyone anticipated. Throughout all the changes, the team was responsive and quickly turned changes around for approval. They even worked with my builder to finalize a few details that he needed to show for permit purposes. I am hoping that we are building our forever home, but if not, I would not hesitate to use ERDD again. Money well spent.", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "115610796077373046229", "name": "Holland Dixon", "time": 1619004878007, "rating": 5.0, "text": "They took our vision and produced a work of art allowing me to refine my future building project. Correcting things we didn't see or hadn't thought of and highlighted useful addition needed to be functional. Very professional, always responsive and overall a GREAT company to work with!", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "105120994784252943306", "name": "Renée Dates", "time": 1618932877895, "rating": 1.0, "text": "Multiple phone calls and messages left for a job. All calls are screened and no one will follow-up with repeated requests for assistance. The poor reviews are absolutely correct - THEY DO NOT CALL OR FOLLOW-UP! BEWARE OF THIS COMPANY!", "pics": null, "resp": {"time": 1618934221293, "text": "You are a customer of our client Bama Sheds. We have been in contact with Bama Sheds.  If  they have not been in contact with you that is not something we can control."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "103880698808308487788", "name": "Kristie Potts", "time": 1599105422850, "rating": 1.0, "text": "Absolutely terrible. I paid a deposit for future home plans. I was very descriptive when speaking to Christy about my plans- One level barndo, specific interior layouts and sq ft. She explained to me that they certainly could design my plans. I paid a deposit, sent the EXACT exterior structure of what I wanted, along with additional interior layout and door. I heard nothing for several weeks, with many phone call attempt. I received a random email apologizing for the delay, that a family member had an illness. Weeks go by again with no returned calls. Finally, I requested they return my deposit and I would outsource a more reliable designer. I recently received another random email with some generic sketches that were nothing of mine. I responded and asked them if they were able to adequately provide services.- NO RESPONSE. I have since then called multiple times, left multiple messages in request to have my deposit refunded. As of today, I have reported them and contacted my bank. After reading reviews and doing further research( I should have prior to hiring them)I see the EXACT same scam happening over and over. What a waste of my time, money and energy!", "pics": null, "resp": {"time": 1602576522982, "text": "The project was delivered late but we did provide two options based on the client provided sketch and exterior she was looking for."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "105766203325923846337", "name": "Brent Timmerman", "time": 1612743464910, "rating": 1.0, "text": "BEWARE! DO NOT DO BUSINESS WITH THESE PEOPLE!\n\nI will spare the specifics of my experience, However I will warn any prospective person interested to please read the reviews. They ( The bad reviews)are highly accurate !\nThese people will take your money, and disappear from communication.  With the exception of lying to you through messenger app.. And then when you are able to contact them from a different phone number that they are not screening,  they will blame you for their VERY UNETHICAL business dealings . With that being said, I have nothing to gain from this review,  however I am out 400.00 for services that I never received,  And based on reviews that I have now read. Christy ( The Owner ) will counter this review saying she refunded my payment, which she lied about on the phone with me , because I followed up with Discover ( My financial source ) and Square ( Her financial source  ) and both confirmed to me that no such transaction had taken place!  These people use every excuse in the book to get away with taking your hard earned money and giving you ABSOLUTELY NOTHING IN RETURN.\n\nSTAY AWAY!!!!\n\nLOOK BELOW TO OWNER'S RESPONSE\nITS ALL LIES TOO !!\nTRUST. ME", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "105858571544200180137", "name": "Joe Wilson", "time": 1618968445218, "rating": 5.0, "text": "Very nice people who do excellent work at fair prices.\n\nI plan to use them again soon on another project.", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "116843509127231600011", "name": "Chris Gourley", "time": 1527360652830, "rating": 5.0, "text": "We are happy with our plans from ERDD. They did their best to help us to design our forever home and we are happy with the end results. They were willing to make many changes to the original design which shows they are willing to go the extra mile to make their customers happy. They came to our home initially to see where the house would be built and we had our finished plans within 2 1/2 weeks. They could have finished much quicker but my wife and I made a lot of changes so we went thru about 11 drafts to get to the finished project. The fact that they were willing to work with us to this extent means we would use them again if we ever need an architect again.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNkQ3GjaU-mEYsaZJkzzmhzC7RPd34rObYZd-TT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP4fuc1vYck4ppxJwgTkr6_RH4SDclN6lYZXrgP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPJ3hqXCu98M0hpDACWafyJyIoVqKYbX-JXQ6lp=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "116462465451882637890", "name": "Jackie Wirth", "time": 1603419986300, "rating": 1.0, "text": "Not an actual client, but based off the repeated and disappointing testimonials of others... I would suggest avoiding this company.  The accusations, articles, and evidence provided are so concerning that these individuals should be investigated.", "pics": null, "resp": {"time": 1603420680268, "text": "The others that have make claims against us have either been refunded or they did receive their plans and still asked for refunds. There are two sides to every story. I will gladly share any evidence supporting our side of these claims as well if you would like. Our email is listed on this page and my cell phone is (256) 595-1574 If you like further information."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "113897147587663313137", "name": "Jessica Logan", "time": 1601305558847, "rating": 5.0, "text": "Amazing to work with! They took our general ideas and produced our dream home! Highly recommended!!", "pics": null, "resp": {"time": 1603403247240, "text": "Thank you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "108893244794006776925", "name": "Tina Johnson", "time": 1603452142325, "rating": 5.0, "text": "Some people have growing pains and are not always right in the way they handle things. Yes Elaine Roberts Drafters and Designers May I made mistakes. But they delivered my plans to me and in a reasonable time. Not everyone is perfect. Some people only want to bash people with negative reviews.", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "107524635065726496476", "name": "Drue Poynter", "time": 1602510380640, "rating": 1.0, "text": "TERRIBLE TERRIBLE SERVICE! We have tried to get in contact several times after sending our deposit. It has been 4 weeks and they have not been able to give us anything. After posting a bad review on Facebook they told us we would have our plans by the end of the week and NOTHING! I would not recommend them to anyone! After reading more reviews this seems to be very a common thing for them!", "pics": null, "resp": {"time": 1602576507155, "text": "Sir you are not even a customer of ours."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "108698223108757046173", "name": "Yvette Moss", "time": 1582268363900, "rating": 5.0, "text": "We love these guys! They were very helpful and wanted us to achieve the dream home we were after and never complained about how many times I called! =) I will use then again for other projects if we ever need this type of service!!", "pics": null, "resp": {"time": 1603403258966, "text": "Thank you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "113035287779586737864", "name": "Jennifer Parent", "time": 1586810129240, "rating": 5.0, "text": "Super helpful with the design and floor plan of my 1500sq foot barndominium style stick built home. Very patient with my multiple requests for desired changes. We are very grateful and would greatly recommend.", "pics": null, "resp": {"time": 1603403251987, "text": "Thank you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "116938191468292914766", "name": "Kat Lange", "time": 1582038200154, "rating": 5.0, "text": "Our construction plans came in today and I am beyond excited to start working on building our home together! Elaine Roberts Drafters & Designers went above and beyond to make every single edit to our plans and help us design our perfect dream home. If you know anyone needing house plans this is hands down the best people to go to on all aspects, I cannot say enough about how blessed we are to have worked with them for our barndo design!! Thank y’all!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOUZ6QtW5q8qHmwEpmpyBFaH_nP-XwmAcNy1kxW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNI_RPmon2GolG1Egqgd6_TuAoSXGEmpIXj1y2M=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "106692338295826863736", "name": "Kieth Dunn", "time": 1582033489202, "rating": 1.0, "text": "Reading all these bad reviews reminds me of my experience, which has been going on for four months so far with no resolution. I have had all the same difficulties that the others have described and then some....way too may to list here. I cannot express strongly enough how disgusted I am with these people who proclaim christian doctrine in their emails and website. By the way, the good reviews are from the Parker family, which is another name that they go by.", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "108582921054818107002", "name": "Jaycie Phillips", "time": 1603399902986, "rating": 1.0, "text": "Awful customer service! They will not respond even after payment of house plans!", "pics": null, "resp": {"time": 1603403211775, "text": "I do not believe that you are an actual client, but friends with Derrick Loftis. Mr. Derrick Loftis has been issued a refund per his request, he also received plans/drawings in the past.\n\nThank you\nJimmy Parker"}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "109296448497964462244", "name": "Luke Barker", "time": 1602577004200, "rating": 5.0, "text": "Highly recommend Elaine Roberts Drafters and Designers for all your design needs.", "pics": null, "resp": {"time": 1603403236626, "text": "Thank you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "115541182831429788307", "name": "Barbara Gray", "time": 1575589704428, "rating": 1.0, "text": "I would have to say this is the worst attempt of blueprints I have ever seen. Nothing was to scale, there was no detail information at all, and was not the design we had ask for. Measurements were not all noted. We have had a hard time trying to figure out what we need but thanks to Shaw Building Supply they had to basically redraw in order to estimate the material. These people are not draftsmen at all.  This was just a waste of $1500. I could have drawn this plan better than they attempted to.", "pics": null, "resp": {"time": 1575522527782, "text": "Ms. Gray, I am sorry you were not satisfied with the plans you received from us. You approved the design and layout prior to the completion of the plans. Per our contract you were allowed to make additional changes as you need/wanted. If you had made attempt to reach us over the discrepancy in the plans we would have address and worked with Shaws on any changes or information that was needed. We provide cad files to all building suppliers per there request on a regular basis. None of which was made by Shaws or yourself."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "107368239673350922978", "name": "Kelsie Norris", "time": 1602623112965, "rating": 5.0, "text": "Elaine was a pleasure to work with on our recent home designs..", "pics": null, "resp": {"time": 1603403229733, "text": "Thank you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "100275128980831193854", "name": "Andrew Bales", "time": 1600380460022, "rating": 1.0, "text": "These guys are big no shows! Wasted three or four weeks of my time and did nothing. If you are looking for extra stress, headaches and to p-off your client, then call Elaine Roberts drafting.\n\nREGARDING ELAINE ROBERTS REPLY. That is right I gave you the project told you its urgency and instead of saying \"we are too busy to take on projects\" you said nothing until weeks had passed and my emails went unanswered. This outfit needs to grow up and learn some business ethics.", "pics": null, "resp": {"time": 1575295159871, "text": "Mr. Bales,\nIt is hard for us to be late on a project we were never hired for. We provided us informaton for a quote and timeline for your project. We sent several emails to you and your office for clarification on a few items, all with no response. It is not our fault that your lack of communication caused your client to be upset with you. Nor could would have completed work on your project without the proper go ahead from you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "107978936229458934943", "name": "Creekside Designs", "time": 1527361203504, "rating": 4.0, "text": "We have been working with Jimmy off and on for six months now & he has been very quick and professional. I had to make several changes and Jimmy was prompt and delivered the correct drawings that we needed. I would highly recommend Elaine Roberts Drafters and Designers", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "106448052808753561964", "name": "David Vermeulen", "time": 1578017111810, "rating": 1.0, "text": "We paid a deposit and had a verbal contract to design drawings for permit ready construction plans on 2/3/2019\nI received zero updates from ERD&D, we reached out dozen of times per email & phone only to be given the run around. Actually spoke once with Elaine Roberts herself I believe and still no follow up or follow through. As of today 12/11/2019 we are still waiting on a response or communication of any kind. I called and left a message today, lets see if we get any response\n--------------------------------------------------------------------------------------------------------------------\n\nResponse from the owner 3 weeks ago\nMr. Vermeulen.\nI am sorry that you feel like you slipped though the crack somewhere. We made numerous attempts to contact you thought out the year with no response from you. I will gladly refund your deposit if you would like. Response from the owner 3 weeks ago\n----------------------------------------------------------------------------------------------------------------\n\nAfter leaving a review, an email and voicemail with my contact info on 12/11/19 and requesting a refund, I am still waiting for Elaine Roberts to get back to us.\n2nd request 1/2/20 - Elaine please refund our deposit.", "pics": null, "resp": {"time": 1576074908630, "text": "Mr. Vermeulen.\nI am sorry that you feel like you slipped though the crack somewhere. We made numerous attempts to contact you thought out the year with no response from you. I will gladly refund your deposit if you would like. I will be in touch with you this morning to work out the solution that works best for you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "101763881385564984591", "name": "Christy Leigh", "time": 1554842626084, "rating": 5.0, "text": "They are amazing! Loved the whole process and they made it so easy and wonderful. Very accommodating to all our changes.", "pics": null, "resp": {"time": 1555383687030, "text": "Thank you for the kind words. We enjoyed working with you on your home."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "109859671819636961055", "name": "Paul Hines", "time": 1603203267985, "rating": 5.0, "text": "Great people to work with.", "pics": null, "resp": {"time": 1603403223036, "text": "Thank you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "108615516573729085777", "name": "Jimmy Parker", "time": 1530038351334, "rating": 5.0, "text": "Great small little design firm. Husband and wife team that works hard on each project. They are not perfect and have flaws but the work and designs they produce are top notch.", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "111713600234971474209", "name": "Mark Hamm", "time": 1521645892343, "rating": 4.0, "text": "Great work at a reasonable price.  Having some delays in the delivery of the plans is the only reason for not getting a 5.", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "109043575819100981984", "name": "Nona Muss", "time": 1539501642562, "rating": 1.0, "text": "So last year I found a business on a local small business group Facebook page - Elaine Roberts Drafters and Designers. I paid them a deposit of $250. As of today, the work has not been delivered. It was promised 10 days after payment. As of today, they are 100 days past due. I posted an honest review on their Facebook page, starting off by saying I hoped I could change it to a positive review in the near future. They changed their Facebook template to not allow reviews so mine could no longer be seen. They always say they are working on my plan and they will have something in a few days. Then I don't hear from them and nothing is ever delivered. Their Facebook page has photos they post- and therefore imply that the work depicted is their own. Through reverse photo look up I found photos they had \"lifted\" from other sites and I contacted the owners. Indeed they did not have permission to use the photos and it was not their work. When I tagged the owners in the misused photos they were promptly deleted from the Elaine Roberts drafters Facebook page. One of the owners of the business from which they had plagiarized the photos of others' work, did know Jimmy Parker - one of the owners of Elaine Roberts Drafters. He told me specifics of how the owner (Jimmy) of Elaine Roberts Drafters worked for him previously and had stolen from him, and described him as one of the biggest con-men he has encountered. Perhaps occasionally they deliver a product enough to keep up an image, I don't know, but after my own experience and what I heard from Jimmy Parker's previous employer, I sure wouldn't trust him with my money again!\n\nAlso look at their other reviews. Jimmy and Christy Parker are the husband/wife team that “own/operate’ this business they call Elaine Roberts Drafting and Design. (These are their respective middle names.)  Previously they operated under the name “Creekside Designs.” I guess they had to give up on that name after they accumulated so many bad reviews. You can google it. Anyway, three of the other reviews for this business are from the owners themselves (Christy Parker, Jimmy Parker, and their old business named Creekside Designs. A fourth is from a family member - Sheila Parker. So half of the reviews contributing to their “4.1” rating are ones THEY CREATED RATING THEMSELVES! They did the same thing on Yelp until I reported them and Yelp notified me they had removed those reviews because they violated their terms.", "pics": null, "resp": {"time": 1520985386952, "text": "Mrs. Hall,\nI am terribly sorry for the poor customer service that we provided.  We are not scammers, crooks, or anything of that nature.  We simply took on to much work at one time. It is not an excuse but we are still learning how to deal with our blessing of growing pains.  We are human and make mistakes.   I am terribly sorry that your project fell through the cracks.  In regards to your refund we asked for a mailing address to process you refund and I have not yet received it.\n\nAgain we are sincerely sorry for the poor customer service and wish you all the best in the future.\nRespectfully,\nChristy Parker"}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "117275097344007566653", "name": "Christy Parker", "time": 1576361452991, "rating": 5.0, "text": "The team at Elaine Roberts is very professional and there work is top notch", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "114306547208163059081", "name": "Tony Densmore", "time": 1619543675576, "rating": 5.0, "text": "Matthew was recommended by our builder. This guy is top notch and his prices are competitive. We enjoyed working with him. We couldn’t figure out how we wanted the bathroom designed and he was able to get it perfect with very little input from us. We took him a very basic layout, he changed everything to our specs without a lot of back and forth. The initial visit and one more for minor modifications is the only times we had to go over details. Great architect!!", "pics": null, "resp": {"time": 1619544407038, "text": "Thanks for letting me help on your forever home.  Looking forward to seeing the progress photos!!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "112574549322514878259", "name": "J Klatt", "time": 1574213708681, "rating": 5.0, "text": "Matt helped us with custom house plans recently and did a great job. Nice office, comfortable friendly and very competent. I would definitely recommend him!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOAK-u7tQx6cs6NBJryRJiy_6PrKTaJ7e-3oxzN=w150-h150-k-no-p"]}], "resp": {"time": 1574217524371, "text": "Looking forward to watching your house get built!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "112631218977266923737", "name": "Dustin Wear", "time": 1621260978602, "rating": 5.0, "text": "Glidden Drafting is top notch! They provide fast service and great communication. Matt was more than willing to answer questions and offer design suggestions. I would highly recommend them to draft your house plans.", "pics": null, "resp": null, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "100041297845396323994", "name": "debra woodall", "time": 1621011189763, "rating": 5.0, "text": "Building a new home can be very stressful but choosing to work with Matthew Glidden was THE best decision we've made thus far. He's reliable, easy to work with, and provided us with exactly what we wanted/needed in our home plan. He took our basic idea and turned it into our dream home. Thanks, Matthew!", "pics": null, "resp": {"time": 1621013285091, "text": "Thanks again for letting me help you on this custom design. Looking forward to getting some progress photos!!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "103990461370590982565", "name": "Lee Reese", "time": 1611163640020, "rating": 5.0, "text": "Glidden Drafting Services was recommended to me by a friend in the home construction business. Once we made contact Matt Glidden made the process fast and painless as possible. He was extremely helpful with suggestions and worked on the fly to make changes as requested before finalizing the design. Although this method is a little more expensive up front than the online retailers the service and accessibility to help cannot be matched. I can't say enough about how helpful, friendly and professional Matt has been. I would highly recommend his company to anyone wanted to design a custom home.", "pics": null, "resp": {"time": 1614355131418, "text": "Enjoyed working on this project"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "110208046527662114004", "name": "Lucas Teske", "time": 1616941084639, "rating": 5.0, "text": "First off, we would highly highly recommend Glidden Drafting Services to anyone who would ask with absolutely no reservations. We are in the process of building a custom home and he was fantastic.\nWhy?\n1) Communication. He is truthfully the most responsive professional I have ever worked with. His responses are prompt and genuine. We had no difficulties communicating at any point in the process, which is critical when designing a custom home.\n2) Personality. When we were looking for an architect, we had interviewed some strongly opinionated architects that tried to push their ideas onto us as opposed to working as a team. Matt somehow matches the perfect blend of offering opinions when we needed help or were stuck, but not questioning our design desires and ideas.\n3) Product: We are very happy with the final design product. It is professionally done and exactly what we wanted. Our builder has worked with Matt several times in the past and his work translates perfectly into the actual construction process. We were provided plans with extensive dimensions, room labeling and elevations for our house. A+\n4) Price. This shouldn't necessarily be an area where you should be making a significant sacrifice at the cost of quality, but it does always need to be considered. The cost of designing plans for our custom home and all of the subsequent changes/revisions was incredibly reasonable. He is up front about how he charges and there were no hidden surprises. We actually felt like we underpaid for his work and customer service!\nIn summary, you will not be disappointed in Glidden Drafting Services; we certainly weren't.", "pics": null, "resp": {"time": 1617361740130, "text": "I enjoyed working on these plans and watching your dream come to life.  Thanks again for the opportunity to earn the business and I’m looking forward to watching the progress on this one!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "111416427856791142985", "name": "Logan Beaman", "time": 1611155920702, "rating": 5.0, "text": "Matthew helped us design our dream home! He made us feel very comfortable with the process, despite being first time home builders. He was very easy to work with and answered all our questions. He responded to all our emails quickly and made any changes we asked for.", "pics": null, "resp": {"time": 1614355144628, "text": "Looking forward to seeing photos of this one"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "105324223318927450447", "name": "Lynn Key", "time": 1617329096827, "rating": 5.0, "text": "Matt was very professional and quick. I would recommend him to others and will definitely use him again on my other building projects.", "pics": null, "resp": {"time": 1617361647080, "text": "Thanks for the review.  We enjoyed working in your project"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "108834120679853024597", "name": "Rakeshia Ransaw McKinney", "time": 1600137557273, "rating": 5.0, "text": "Matt is AWESOME!! Excellent customer service, knowledgeable, calming presence.  He was super patient with ALL the changes we made to get to our final drawings. Having house plans drafted can be overwhelming for a first timer, but Matt made the experience easy and fun, and the completed drawings are amazing! We look forward to working with him again in the future!", "pics": null, "resp": null, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "112718436258647777426", "name": "Denise Sullivan", "time": 1602010538670, "rating": 5.0, "text": "Working with Matthew was a pleasure. This has been our first attempt at a custom build so the process was all new to us. He was always very prompt,  responded quickly to all queries, and the final product is superb. We can't wait to show him the final product!", "pics": null, "resp": null, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "114476327888034167020", "name": "Allison Glover", "time": 1611266520230, "rating": 5.0, "text": "We highly recommend Glidden Drafting! He is easy to work with, very quick to respond and caters to your needs with no problem!", "pics": null, "resp": {"time": 1614355119982, "text": "Thanks for letting us help you!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "114988896186206501829", "name": "Janet E", "time": 1594930655077, "rating": 5.0, "text": "Matthew was so great to work with.  He was very patient with this first timer on helping me slowly work through all the angles of my house plan, listening to my wishes and giving needed advice on what could and couldn't be done and finding ways to accommodate what he could.  From taking my favorite parts of several plans, melding them together, tweaking the interior to get just the things I wanted and in the sizes I wanted, then doing the same on the exterior, I finally got the house I wanted and Matthew was a patient guide all along the way.", "pics": null, "resp": null, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "109964249086481916996", "name": "Casey Stafford", "time": 1584753682408, "rating": 5.0, "text": "Matt was recommended by a friend to draw up our custom house plans. We are so happy we got to work with Matt. He was able to take an idea we had and turn it into a great house plan. He was able to meet with us quickly and was available to talk or email to get our plans exactly right. We probably would've only had to meet once, but my wife and I kept adding things that we forgot upfront. There were also some things that we couldn't quite picture what it would look like, and Matt was able to provide solutions and show us with his 3D drawings. We can't wait to get our forever home started and I definitely recommend Glidden Drafting Services to anyone wanting custom home plans. Thanks again Matt!", "pics": null, "resp": {"time": 1589533338009, "text": "Looking forward to seeing photos of this beautiful home!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "112738311007257661323", "name": "Kristin Christian", "time": 1595345962267, "rating": 5.0, "text": "We got to work with Matt on a custom  home plan; He is very professional, answered every question we had, and was very quick with responses/drafts. We are extremely happy how the plans turned out and would recommend his expertise to anyone looking for a drafting service!", "pics": null, "resp": null, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "117368719686185216163", "name": "Shamario Young", "time": 1602026562070, "rating": 5.0, "text": "Glidden Drafting Services is the best in the business. Exceptional work and fast response time. I highly recommend Glidden.", "pics": null, "resp": null, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "115599658351260292930", "name": "Chris Erwin", "time": 1589508211693, "rating": 5.0, "text": "Working with Matt was a smooth and easy process.  His experience provided us with ideas that we hadn't even considered.  His knowledge allowed us to make some awesome changes to our plans.  Working with someone local is highly recommended and I would definitely recommend Glidden Drafting Services.", "pics": null, "resp": {"time": 1589533125990, "text": "Looking forward to seeing some progress photos!  Thanks for letting me help!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "101324195154165258049", "name": "chantal D", "time": 1597327494114, "rating": 5.0, "text": "So easy to work with and discuss all your desires and needs for homeplan. Honest and realistic and will draw your dream in the end. Could not have asked for a better drafter.", "pics": null, "resp": {"time": 1597334209797, "text": "It was a pleasure working on this project with you!   Looking forward to getting build photos of this house"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "103744642059656523869", "name": "David Calvert", "time": 1580525915505, "rating": 5.0, "text": "Matt did a great job drawing up our custom house. He was very patient with all of our changes and went above and beyond to help us visualize certain areas of the house. He has great knowledge of the construction of the house, which helps in planning and drawing up plans. I highly recommend Matt!", "pics": null, "resp": {"time": 1580560899424, "text": "Looking forward to watching this build!’"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "103474198784430911812", "name": "Brent Watson", "time": 1586207453125, "rating": 5.0, "text": "Matthew did an awesome job! I could not believe how quickly he got the plans done. I highly recommend him if you are looking for someone to develop your house plans!", "pics": null, "resp": {"time": 1589533268197, "text": "Tag me on any social media about when you start building.  I’d love to follow along on the build process #gliddendrafting"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "116651315844374849976", "name": "Lauren Stafford", "time": 1582580365462, "rating": 5.0, "text": "I cannot say enough about the wonderful experience we had working with Matt. He explains things clearly, highly experienced, patient, listens, and is very approachable and responsive in his communication. He has drawn up the house of our dreams, and we cannot wait to see it come to life when building is complete! I will definitely recommend Matt to all my family and friends!", "pics": null, "resp": {"time": 1582588389241, "text": "It was my pleasure. Loved working on this house!!  Looking forward to the build."}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "106414941939881518735", "name": "Derek McCulley", "time": 1587311955871, "rating": 5.0, "text": "Matthew did an excellent job on our house plans. He was very fast and knowledgable. We made several changes and we were very satisfied with his service.", "pics": null, "resp": {"time": 1589533214230, "text": "Thanks again for letting me earn your business it was a pleasure working with you!!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "101916077471446757075", "name": "nate woodall", "time": 1587340898074, "rating": 5.0, "text": "Matthew was very responsive to any questions and changes that came up while drafting our home plans. We reached out to him with numerous questions about changes and he was always very helpful and available to help us when needed. We would definitely recommend him to others looking to draft their home plans.", "pics": null, "resp": {"time": 1589533175226, "text": "#gliddendrafting when you start building this beauty.  Thanks again!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "112332571904761678135", "name": "Rhonda Daly", "time": 1579447494182, "rating": 5.0, "text": "Matt was amazing to work with!   He was easy to communicate with and worked really hard to make my house fit on my lot while keeping all the amenities that I wanted!  He was full of good ideas and had great expertise at figuring out how to reconfigure spaces, etc!", "pics": null, "resp": {"time": 1579470510705, "text": "Thank you for giving me the opportunity to work on this house and keeping an open mind for the cuts we needed to make :-)"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "109361715533506477763", "name": "Brittany Lamb", "time": 1584752388052, "rating": 5.0, "text": "Matt is amazing!  He perfected my plans and got them to me extremely fast.  Can't recommend him enough!", "pics": null, "resp": {"time": 1589533360744, "text": "Glad I was able to help.  Thanks for the business!!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "112817010959664766290", "name": "Ty Stafford", "time": 1582577009676, "rating": 5.0, "text": "Matt is awesome to work with.  He's extremely smart and patient.  He helped us design a custom home and we couldn't be happier with our experience.  He's the man.", "pics": null, "resp": {"time": 1582588278630, "text": "Looking forward to seeing photos of this house go up!!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "109917648954175039887", "name": "Christy Lee", "time": 1571786911253, "rating": 5.0, "text": "We had a Great experience with Matt and Glidden Drafting Services on our new house plans. He is very friendly and easy to work with. Also, he had our plans drawn and back to us in a quick time frame and worked with us on any changes we requested. We highly recommend Glidden Drafting Services and know you will be totally satisfied when you do!\nAaron and Christy Lee", "pics": null, "resp": {"time": 1573095993347, "text": "Thanks for letting me work on your project!!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "104152458946108318526", "name": "Lee Herring", "time": 1570138663370, "rating": 5.0, "text": "We were introduced to Matt through our builder while preparing to build a custom house to move my wife's mom and my dad in with us. Our builder showed us the perfect house but there were a few things we needed changed to better accommodate our parents who both have health problems. Matt not only worked the plans to adjust for this but went above and beyond in making the plans far better than we could have ever thought of. If you've ever wondered \"Should I hire an architect?\", Matt is the reason the answer is yes. Great to do business with, professional, patient, and understanding of our particular needs.", "pics": null, "resp": {"time": 1570140566678, "text": "Looking forward to seeing your house get built :-). Thanks again!!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "113496941393024698627", "name": "Paul Cooper", "time": 1571107225492, "rating": 5.0, "text": "Matthew was recommended to us and we are so glad he was. The entire process from the initial meeting to discuss our wants to the final plans everything was as promised or better(faster). We would highly recommend Matthew to anyone needing house plans drawn.", "pics": null, "resp": {"time": 1573096023846, "text": "Thanks again for letting me help with this project.  Send photos when you get started!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "106773379780679129112", "name": "George Yandric", "time": 1563460989382, "rating": 5.0, "text": "Matt is nothing short of great and helpful.  We walked out of that office happy and completely satisfied with the service.  i would recommend him to anybody needing to design a house. We had so many questions and concerns. Matt was able to answer all those questions and explain things to make this process understandable and enjoyable.", "pics": null, "resp": {"time": 1566671526567, "text": "Looking forward to seeing this one go up and eating some bbq"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "107262464185903092378", "name": "Sharon Andrews", "time": 1552935693324, "rating": 5.0, "text": "I had two house plans drawn by Matt.  The first one ended up being too big (my fault - over ambitious dream house).  The second worked out and will be the one we build.  Both times Matt was very patient with all my changes and I received very quick responses to my emails.  He made some very good suggestions which I know we will appreciate once the house is built.  I would highly recommend using Glidden Drafting Services when you need a house plan drafted.", "pics": null, "resp": {"time": 1570273833174, "text": "Ready to see this one rise from the ground"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "118155841962879710108", "name": "Joseph P", "time": 1591992865191, "rating": 5.0, "text": "Matthew did a great job with our detached garage plans! Very responsive!", "pics": null, "resp": {"time": 1592185270080, "text": "Glad I could help!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "102961487539359219153", "name": "Jay Ragan III", "time": 1527627978308, "rating": 5.0, "text": "Matt was so easy to work with and we couldn't be happier with the end results.  He made our project feel like it was the only one he was working on.   Matt provides very responsive communication through phone and email.  He is very knowledgeable and detailed oriented.  We really appreciated that costs for services were clear up front and there were no surprises.  I hope I can find a builder who is as great as Matt.  He provided us with great service that was quality and in a timely manner.  I would recommend him to anyone!", "pics": null, "resp": {"time": 1529089720026, "text": "Looking forward to your build!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "105058192838340306633", "name": "Jeff DeMange", "time": 1592267281813, "rating": 5.0, "text": "Matt was very helpful during our initial visit. He was very responsive regarding any changes we requested.", "pics": null, "resp": {"time": 1593952402666, "text": "Looking forward to seeing photos of this beautiful house go up!!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "100280670231993127646", "name": "Sandra Brown", "time": 1556203687345, "rating": 5.0, "text": "I was very impressed with Mr. Glidden.  He took my sketched plans from a small note and turned them into the exact home I was wanting in only three visits.  His pricing was very reasonable and he was very professional.  I will certainly recommend him to my friends.", "pics": null, "resp": {"time": 1556205085271, "text": "I’m excited for you and I love how the house came together thank you again"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "107012020000290149540", "name": "Christy Eiland", "time": 1566670189924, "rating": 5.0, "text": "We enjoyed working with Matt on our home plans.  We presented a drawing and within days had our preliminary.  He was patient, professional and always prompt to reply.  We love our home plans, and would certainly use Glidden Drafting Services in the future.", "pics": null, "resp": {"time": 1566671506871, "text": "Thank you very much for giving me the opportunity to work with you and getting your plans ready to build!!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "100463787433662085934", "name": "Jared Latham", "time": 1570193065549, "rating": 5.0, "text": "Glidden Drafting Services was extremely helpful in every aspect of making and designing our dream home. He took our ideas and ran with them to create what we had envisioned. I cannot recommend him enough!", "pics": null, "resp": {"time": 1570273776022, "text": "Looking forward to this build!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "115654564786581849510", "name": "Vanessa Gonzalez", "time": 1552410064135, "rating": 5.0, "text": "We are building our first home and Matthew Glidden made this process so easy for us.  We had first decided on one plan then ended up changing to a completely different plan.  He was very patient and had the plans ready and available exactly when he said he would.  He was very easy to communicate with. We would highly recommend Glidden Drafting Services.", "pics": null, "resp": {"time": 1552420771916, "text": "Looking forward to seeing your home go up. Let me know if you need anything in the future."}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "106956813626188127811", "name": "Nikki Shockley", "time": 1579621203011, "rating": 5.0, "text": "Definitely would recommend Glidden Drafting Services to anyone needing house plans drawn.  Easy to work with and speedy.", "pics": null, "resp": {"time": 1579706037284, "text": "Looking forward to seeing photos of your new home :)"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "101458395343810989908", "name": "M Harris", "time": 1556200572447, "rating": 5.0, "text": "We ran across Glidden Drafting Services on Houzz and are we glad we did. Matthew was extremely professional, patient, helpful and easy to work with. He took our ideas for our dream home and placed them on paper. He also offered suggestions/inputs that made our vision come to fruition. We are excited to build this plan... and highly recommend Glidden Drafting Services!!!", "pics": null, "resp": {"time": 1556205024204, "text": "Looking forward to seeing this beauty go up. Thanks again for letting me work on this project."}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "116955986877669261078", "name": "Lindsay Vann", "time": 1529088401535, "rating": 5.0, "text": "Matthew made designing our new home an easy process. We brought him a floor plan we loved and he was able to help us make it our own in a very short amount of time. Texts and emails were always returned quickly. Matthew was always very professional and made us feel that our plans were his priority. I would definitely recommend Glidden Drafting Services to anyone looking to design their next home.", "pics": null, "resp": {"time": 1529528505564, "text": "It was a pleasure working with you guys. I’m looking forward to seeing the progress.  #gliddendrafting on instagram so I can follow along."}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "100886240825821471714", "name": "Taylor Gibbs", "time": 1556288690060, "rating": 5.0, "text": "Matt did an excellent job of taking our simple plans and quickly turning them into very detailed, accurate plans our builder could utilize. He was able to give us the final product way sooner than expected and for much less than we anticipated. We definitely recommend using Glidden Drafting Services!", "pics": null, "resp": {"time": 1556289824010, "text": "Looking forward to watching this house go up. Thanks again"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "106046969076286474567", "name": "Kelli Jo Terrell", "time": 1516506729827, "rating": 5.0, "text": "We reached out to Glidden Drafting with a hand drawn sketch and Matthew turned our vision into an actual plan, creating blue prints for our builder.\nHe is obviously knowledgeable, making changes needed to meet building code requirements and professional suggestions that benefited us.\nMatthew was reasonable and upfront about how much his services would be and all charges were discussed in the beginning.  We were very pleased with his work ethic, as he worked late to make sure our plans were completed in a timely manner and to our satisfaction. Also, our builder was impressed with his work.", "pics": null, "resp": {"time": 1516507460164, "text": "Looking foreword to getting photos of the construction. New memories are soon to be made!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "104899600222995694914", "name": "Titan Stiltner", "time": 1500239397585, "rating": 5.0, "text": "So much professionalism and expertise!  I recommend Matt Glidden to handle any of your drafting needs. Matt knows how to listen to the customer and understands the importance of detailed communication. Matt treated the design of our home as if he were designing his own. Matt never let us down. He's an honest, hard working, talented professional with whom we will gladly and highly recommend.", "pics": null, "resp": {"time": 1500646495680, "text": "Thanks for the opportunity to help you!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "108927779129286814806", "name": "Jamie Brooks", "time": 1573101225111, "rating": 5.0, "text": "Mathew was awesome he gave us exactly what we wanted we made several changes during the whole process he promptly made the changes we asked for without hesitation we would gladly recomend him to anybody wanting to design their dream home", "pics": null, "resp": {"time": 1579470389834, "text": "Looking forward to seeing photos of the build"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "107366100368855011380", "name": "Bradden Pippin", "time": 1513729646312, "rating": 5.0, "text": "Matt is hands down the best in the business in this area! Throughout the whole process he was extremely detail-oriented, quick to respond, intuitive, and churned it out within the expected time.\n\nHe is extremely hard working, and very good at what he does. Would highly recommend to anyone. We were very pleased with him and Glidden Drafting Services from beginning to end!", "pics": null, "resp": {"time": 1513730382533, "text": "Thanks for the opportunity to help on your project. It was a pleasure!!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "100257074744632540772", "name": "Neli Howard", "time": 1517520442297, "rating": 5.0, "text": "Matthew was wonderful to work with! He drew a completely custom floor plan for us - he listened to our wants and offered great advice, making sure that our requests were according to building code! He is attentive to detail, responds quickly to emails, and is the best in his field in the area.\nEven though we had a lot of additional requests on the plans along the way, he completed our plans within the expected timeframe. The drawings were precise with a lot of detail, even our builder was impressed with them. We were impressed with the quality of work! We highly recommend his services to anyone wanting outstanding turn-around time and great professionalism! It was a pleasure working with him, and we have already recommended his services to other friends. Thank you for designing our dream home with such care!", "pics": null, "resp": {"time": 1517597112909, "text": "Thanks for letting me draw your home.  Looking forward to seeing the progress photos"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "106686765882664848565", "name": "Mason Boisseau", "time": 1556138428708, "rating": 5.0, "text": "I would definitely recommend Glidden Drafting Service. We have been working with Matt for a few years now and has been nothing but positive. He’s very quick to reply and does great work.", "pics": null, "resp": {"time": 1570273802497, "text": "Thank you"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "117806892988693685510", "name": "William Palmer", "time": 1524773683376, "rating": 5.0, "text": "Matthew is a true professional! He listened to and addressed every one of our requests. Matthew was patient, very detailed, and extremely efficient. His rates are more than fair. The process was absolutely seamless and Matthew was truly a pleasure to work with. I highly recommend him and will be using him for future endeavors!", "pics": null, "resp": {"time": 1524775346662, "text": "Thank you for letting me earn your business. Looking forward to the plans coming to life!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "109859499677778051189", "name": "Myra Bryson", "time": 1529460535601, "rating": 5.0, "text": "We were very pleased with the service Mathew Glidden provided us in drawing up our house plans.  He quickly responded to my emails and did numerous changes to our plans.  The more we studied our plans and thought through things, the more changes we had.  He quickly made our changes and got our plans just like we wanted them.  We would highly recommend Matthew Glidden to draw up or make changes to your plans. Thank you, Matthew for such a great job!", "pics": null, "resp": {"time": 1508448514755, "text": "Thank you so much for the opportunity to create your home looking forward to seeing the finished product."}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "117506380167367399990", "name": "Allin L. Whittle II", "time": 1541621801645, "rating": 5.0, "text": "Glidden Drafting Services is an awesome company that provides drafting services from cradle to grave. Matthew listened to every detail during our initial and subsequent meetings and developed a wonderfully designed home for us.  He is very professional and down to earth and managed to continued to work our plans, even with construction being done on his own property.  All plans drafts were emailed to us in a PDF for approval or changes as required.  Once we went final on the plans, he emailed us a copy of the final plans for approval as well as our builder.  Great company that I would definitely work with again to build a custom home or other properties!", "pics": null, "resp": {"time": 1541629110629, "text": "Thank you very much for the opportunity to draw you’re new home. I look forward to seeing the progress of your home"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "108470760099134801900", "name": "Linda Steakley", "time": 1549167102737, "rating": 5.0, "text": "Matt always got back with us in a timely manner. He never made us feel we were imposing on his time. He listened and worked with us no matter the request. I would recommend Matt to anyone needing house plans.", "pics": null, "resp": {"time": 1549717315563, "text": "It was a pleasure working with you and your family.  The house is going to be beautiful sitting on that lake.  Enjoy the many memories!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "100598087923933133002", "name": "Art By Anne", "time": 1561202870027, "rating": 5.0, "text": "Matthew was great to work with!! He took parts we found in plans online, and made it into the house we want! I look forward to building our new house!!", "pics": null, "resp": {"time": 1566671628167, "text": "I enjoyed getting to work with you. Looking forward to seeing your house go up"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "115841472678254246382", "name": "Jennifer Moore", "time": 1535407403126, "rating": 5.0, "text": "Matthew Glidden was great to work with.  We brought him a plan that we had drawn up and he brought our vision to life.  Any questions we had were answered quickly and our plans were completed in a very timely manner.  We highly recommend Glidden drafting.", "pics": null, "resp": {"time": 1537192301009, "text": "Thanks so much for the opportunity to draw your house plans. Tag #gliddendrafting during your build. I’d love to see the progress!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "102696981366288584467", "name": "Stephanie Schultz", "time": 1561215367348, "rating": 5.0, "text": "Matt is great, we did a custom plan with him and I was very picky and changed so much. He was very patient and great to work with! Would highly recommend!", "pics": null, "resp": {"time": 1566671570189, "text": "Thanks again for letting me working on getting your house plans ready to build"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "100432912792746131758", "name": "Melissa Williams", "time": 1543621611866, "rating": 5.0, "text": "Working with Matthew was a pleasure. He was very kind and patient with us over the process of drawing our house plans. He was quick to respond to any questions we had and any changes we desired. Overall, we were very pleased to get to work with him.", "pics": null, "resp": {"time": 1546289285192, "text": "It was a pleasure working with you guys!  Thanks so much for the opportunity to draw your plans."}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "105462780019731254339", "name": "lmallstars", "time": 1579394549818, "rating": 5.0, "text": "Matthew did a great job on our house plans.. it was a pleasure working with him!!!", "pics": null, "resp": {"time": 1579470468010, "text": "Safe travels when you move into Huntsville.   Thanks for giving me the opportunity to work on your projects and meeting on FaceTime:-)"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "112723527851164138845", "name": "Cathy Gibson", "time": 1563161315341, "rating": 5.0, "text": "Matthew Glidden (Glidden Drafting Services) is very professional, prompt, easy to work with, and reasonably priced. I would not hesitate to recommend him to anyone needing his services.", "pics": null, "resp": {"time": 1566671542116, "text": "It was a pleasure working with you!!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "107083216895435327224", "name": "Andrew Colee", "time": 1509592869464, "rating": 5.0, "text": "Matt showed great professionalism and expertise with our project. He respected our wants but also offered great advise and solutions to functionality challenges of our plan. I would strongly recommend his services to anyone wanting great service with outstanding turnaround time and reasonable rates. Thank you Glidden Drafting Service for making our dreams a reality!", "pics": null, "resp": {"time": 1509593680484, "text": "It was a pleasure working with you and your wife.  I know your family will make a lot of great memories in your new home!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "110991988918226493643", "name": "Chelsea Colombo", "time": 1526562688138, "rating": 5.0, "text": "Matthew was fantastic to work with in the design phase of our new build. He was attentive to our request, imaginative in designing exactly what we wanted and timely in getting us the final product.  Would recommend to anyone looking to design a custom build!", "pics": null, "resp": {"time": 1529089759982, "text": "It was a pleasure working with you guys!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "103496488887190694793", "name": "Jeff Korotky", "time": 1500328036498, "rating": 5.0, "text": "Matt does outstanding work and has excellent turn times on edits.  I used him for my personal home and have been very pleased with the results from the initial sketch on paper to the finished product.  I highly recommend!", "pics": null, "resp": {"time": 1500646403954, "text": "Happy to help.  I can't wait to see the finished product!!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "102095289641371291327", "name": "Robert Payne", "time": 1559677907177, "rating": 5.0, "text": "Awesome job on our plans!!! Highly recommend them for any of your drafting needs!! Matt is very easy to work with and very knowledgeable!!", "pics": null, "resp": {"time": 1559678661431, "text": "Thanks for trusting me with your new house.  Can’t wait to see it go up"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "116479706582894620674", "name": "Caleb Waters", "time": 1526674324240, "rating": 5.0, "text": "Matthew applied his expert knowledge to every aspect of my project design, and improved on it immeasurably.  He visited the house and took measurements to reproduce the existing plan exactly. He then produced every detail of the re-envisioned design and delivered the final drafts days before I needed them.  I look forward to working with Matthew again on future projects.", "pics": null, "resp": {"time": 1529089738381, "text": "Thanks for letting me work on this project!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "117895102750578827888", "name": "Nikia McCormick", "time": 1500232319800, "rating": 5.0, "text": "I can not put into words how wonderful Matthew is to work with. He was very attentive to our needs when drawing up our house plans. He was so prompt in answering all of our emails (there were tons) and very patient with me as I was very indecisive on a few things. His work is amazing and he is very professional. I would recommend Matthew to any and everyone!", "pics": null, "resp": {"time": 1500646625978, "text": "It was a pleasure working on your house plans. Looking forward to seeing it built!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "116014149721138326992", "name": "Dennis Blythe", "time": 1523835541851, "rating": 5.0, "text": "Mathew was awesome! He is very knowledgeable and was very attentive to our custom design. We defiantly recommend  Glidden Drafting for anyone that wants a house plan done.", "pics": null, "resp": {"time": 1524862547970, "text": "Thanks for letting me work on your home. Looking forward to watching the progress"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "106852975736271561367", "name": "Michael Robertson", "time": 1549290137791, "rating": 5.0, "text": "Matt's attention to detail and ability to think critically to forsee and propose solutions to resolve potential issues siginificantly decreased the number and time of having to re-work the house plans.  After our initial meeting we told him our ideas and gave him our intent, then he went to work.  During the initial meeting he ask questions and would provide suggestions.  He came back very quickly with a product which exactly what we wanted.   Drafting the plan with Matt was extremely easy and stress free.\n\nI absolutely reccomend Matt for anyone looking for a knowledgeable and professional drafter.\n\nThanks!!!", "pics": null, "resp": {"time": 1549717261208, "text": "Looking forward to watching your house go up!  Thanks again!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "117098040706995477498", "name": "Jeri Williams", "time": 1546194438845, "rating": 5.0, "text": "Highly recommend!! Prompt, professional. Very responsive. I love my house plan!", "pics": null, "resp": {"time": 1546289249728, "text": "It was a pleasure creating your house plans. When the building process starts please #gliddendrafting."}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "118127745969096011832", "name": "Jenifer Motes", "time": 1500585327717, "rating": 5.0, "text": "Matthew Glidden draws all of our plans at North Alabama Construction Specialists. All of the customers we've referred to Glidden Drafting have been very pleased. He is easy to work with, very professional and always quick to respond.", "pics": null, "resp": {"time": 1500646363797, "text": "Thanks for the partnership it's always a pleasure working with you guys!!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "100138216229579054982", "name": "Jason Freeman", "time": 1502723783485, "rating": 5.0, "text": "Matthew Glidden of Glidden Drafting, has been excellent to work with. He fully took our ideas and created an amazing house plan... Highly Recommended", "pics": null, "resp": {"time": 1502724524492, "text": "It was a pleasure working with you and your wife.  I can't wait to see your home finished!!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "117098040706995477498", "name": "Jeri Williams", "time": 1546194438845, "rating": 5.0, "text": "Highly recommend!! Prompt, professional. Very responsive. I love my house plan!", "pics": null, "resp": {"time": 1546289249728, "text": "It was a pleasure creating your house plans. When the building process starts please #gliddendrafting."}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "102512527965883874002", "name": "Steven Black", "time": 1509374631387, "rating": 5.0, "text": "Had been waiting on another firm to get back with me with no results on drawings for\nA pool house my wife and I wanted.Talked to Matthew and sent him a rough drawing and he had\nThe finished drawing done by the next afternoon. Would definitely use again.", "pics": null, "resp": {"time": 1509376359586, "text": "Mr.Black it was a pleasure working with you.  I’d like to see a photo of the pool house when you guys get it finished."}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "110368864227761410597", "name": "Lori Cribbet", "time": 1510337218227, "rating": 5.0, "text": "We had an awesome experience with Matt. His expertise and intuition into every detail, even where the light switches would go, was priceless. Thanks for designing our home with such care.", "pics": null, "resp": {"time": 1513730356765, "text": "Thanks for the business. Looking forward to see the plans come to life."}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "107418531131854848030", "name": "Rachel Brown", "time": 1500217055849, "rating": 5.0, "text": "Excellent service. Great attitude. Matthew has designed many Floorplans for my company and as a home builder I appreciate his swift attention to detail and desire to design an economical but beautiful Floorplan for my customers!", "pics": null, "resp": {"time": 1500646653758, "text": "Thanks for the business!!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "105751139396680492637", "name": "Keri Nguyen", "time": 1525789113737, "rating": 5.0, "text": "Mr. Glidden was very professional, quick in response to emails, completed project in a timely manner, and was very patient with our many changes.", "pics": null, "resp": {"time": 1526083276970, "text": "Thanks so much for letting me help on your project"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "112259557419926533284", "name": "John Williams", "time": 1517596448045, "rating": 5.0, "text": "Matthew was great to work with, very responsive and provided a great product with great service.  I'd recommend to anyone wanting house plan.", "pics": null, "resp": {"time": 1517597140201, "text": "Looking forward to this house going up."}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "110314546700559486001", "name": "David Britton", "time": 1515030735176, "rating": 5.0, "text": "Matthew created our custom house exactly as we envisioned it.  Highly recommend Glidden Drafting Services.", "pics": null, "resp": {"time": 1515033646752, "text": "Thanks again for the opportunity to draw your home"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "103580848253759281518", "name": "Cindy Yeary", "time": 1508963512901, "rating": 5.0, "text": "Matt shows great professionalism and skill.  He is a pleasure to work with.", "pics": null, "resp": {"time": 1521305456683, "text": "Thank you!!!"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "116841472893298548767", "name": "Joshua Fowler", "time": 1509737006391, "rating": 5.0, "text": "Excellent service and quick response time.", "pics": null, "resp": {"time": 1513730333133, "text": "Thanks for the business"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
{"user_id": "106854498479805320434", "name": "Larry Carleton", "time": 1501006140782, "rating": 5.0, "text": "Great experience and very insightful.", "pics": null, "resp": {"time": 1501007666801, "text": "Thanks for the opportunity and I'm looking forward to seeing the house go up"}, "gmap_id": "0x88626b5699d40a41:0xbb26a3bff0293309"}
