{"user_id": "118282753136650315537", "name": "Sullivan Edwards (Sully)", "time": 1592187325175, "rating": 5.0, "text": "Abraham and his crew were professional, courteous, and performed everything that I expected, while keeping me informed if anything unexpected came up.\n\nThey fixed some major drainage and erosion issues in the back yard (see before and after photos) by burying downspouts, building a French drain that went out to the road, and tying the downspouts into the drain. It is super satisfying to watch tons of water just pouring out of the drain into the street after a heavy rain.\n\nThey also graded and re-sodded the yard with Zoysia for less than it would have cost me to personally buy the Zoysia and lay the sod myself. I highly recommend Legacy for your personal landscaping project.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOP9LLSa1FkSJ1SEPZpCGsOwAl6myjUPrUxR1F0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN98dNwL0edkoD6b89zP9wyvyor9iFBLkHJENx4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOcwqfMq36dQbjBEMG-GqPL2swoLWdU3AmyRSHr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO99bXwaTyRCuh9LNFMCJmsZDz1rJYqdFCWDXsF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPCymUBkm2VhA4pNs7oSkMAuAvH0JvuOHZkssMb=w150-h150-k-no-p"]}], "resp": {"time": 1595192916558, "text": "Mr. Edwards,  We would like to take the opportunity to thank you so very much for the positive review.  Abraham enjoyed working on your drainage project and we are truly blessed to have such great people working with us to help solve issues that our customers may be having.  Have a great summer!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "100681058269140551242", "name": "Rene' Holt", "time": 1599235633883, "rating": 2.0, "text": "I never like to leave bad reviews and always try to keep them positive, but I contacted this company to help with some backyard design and remodel. I had a meeting scheduled with Jacob this past Wednesday and when he was 30 minutes late, I called the office to make sure nothing was wrong. Jacob called back and offered no apology for being a no-show but we rescheduled for today. It's a hour last our appointment time and he didn't show up again with no call and didn't answer his phone. If you can't be professional enough to keep scheduled appointments, twice, you're not a company I want to work with.", "pics": null, "resp": {"time": 1599268358031, "text": "Rene', thank you so very much for letting us know about the appointment issues.  This rarely happens, let alone 2 times.  Jacob inadvertently kept the same time from last week's appointment on his calendar and received a notice this morning that you cancelled the appointment, assuming it was this afternoon.  We regret that we were not able to be of assistance with your backyard project and appreciate again the review so that we can strive to do better, even in such a crazy year!    Tami"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "104106105688529962394", "name": "Neva Turner", "time": 1593643378877, "rating": 5.0, "text": "Our experience with Legacy truly deserves 10 stars. From first contact they have been the best company we have ever worked with. Everything was done timely and professionally. Quality is top notch. They have shown quality of work ethic beyond measure. We highly recommend this company. During this difficult time with Covid 19, working with everyone at Legacy has been inspiring and uplifting.\nGreat company !!", "pics": null, "resp": {"time": 1595192603424, "text": "Neva, getting to know you and your husband has been one of the highlights of our year.  You are such a pleasure to work for and your appreciation and kindness have not gone unnoticed.  The crew always enjoys working with you on your projects and we look forward to seeing what else you may have in store for your beautiful home!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "101345560364732262291", "name": "Heather Meacham", "time": 1606402094566, "rating": 5.0, "text": "Paul and Tami are so great to work with.  They pay attention to every detail and our patio is just perfect.  Very professional!!!", "pics": null, "resp": {"time": 1606504910070, "text": "Heather, it was such a pleasure to work with you on your patio project.  I absolutely love the color of the concrete,  it was an excellent choice.  Thank you again and enjoy your new patio!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "113215240688685991775", "name": "Jason Comfort", "time": 1595108518120, "rating": 5.0, "text": "First let me say that my wife and I are extremely pleased with the work.  More importantly, Abraham and his crew were phenomenal.  They were cognizant of the fact that my neighbors and I are all working from home and kept the noise at a minimum.  They went out of their way not to leave a mess after the first day after asking what our HOA restrictions were.  When they were finished, they had filled in the large hole my dogs had dug and placed down a few pieces of sod to cover some bare spots.  Truly outstanding service.\n\nLastly, when they were finished, and before they left, your team saw one of my neighbors struggling to unload a trailer.  They offered to help unload the heavy item for him.  They were truly great ambassadors for the company.\n\nWe have some pretty grand plans for our back yard that will stretch over the next couple of years.  After this experience, I guarantee that we will be reaching back out to Legacy Outdoor Services.", "pics": null, "resp": {"time": 1595192427066, "text": "Jason, Thank you ever so much for the review!  Your patience as we worked on your project was very much appreciated as the wet weather  makes drainage work even more challenging.  We are very blessed to have great teams working with us and we can't wait to see what else you have in store for your home.  Have a great summer@"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "112641626804551730969", "name": "debi frankowski", "time": 1566673144178, "rating": 5.0, "text": "We are so pleased with the work that Legacy Outdoor Services just completed at our house.  They installed and sculpted the most beautiful waterfall feature in our mountainside back yard, along with up-lighting that really looks awesome in the evening.  Additionally, they put in a flagstone patio with a gas fire pit, with beautiful natural landscape features and mulch beds all around.  We have had many compliments on it, and it is surprisingly low maintenance too!  We just love it!\nWe had several unforeseen complications which were out of Legacy's control, related to our gas line installation and inspection,  that Legacy patiently and proactively worked through.  We appreciated their high level of customer service and commitment, and will certainly use them again in the future!", "pics": null, "resp": {"time": 1567096986076, "text": "Debi, We absolutely loved working with you both!  You have such a nice home and we were so happy to be able to help you design an outdoor living area that accented your already existing hillside.  You have been so very patient as we worked towards getting your gas issue resolved.  Now you can sit back and enjoy all the elements together that make for a very relaxing getaway!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "111137092066572068365", "name": "Jacquelyn Pletcher", "time": 1592770708261, "rating": 1.0, "text": "Make sure your quote is EXTREMELY detailed, and that you’re home and watching every step they take for quotes involving construction. Otherwise you’ll end up with new concrete that is uneven (that will forever pool water TOWARDS your home), concrete paint that is already permanently stained with mud BEFORE they leave/finish, deep tracks in your sod because they will drive a concrete truck in your backyard, ground/grass that isn’t graded back the way it was before construction and therefore leaving extremely uneven muddy hills all over your yard, nails and cigarettes in your yard WEEKS after they leave, and a final structure that is uneven, sealed poorly, with paint drips that have dried.\n\nWould not refer.", "pics": null, "resp": {"time": 1595193209813, "text": "Jacquelyn,  We just wanted to thank you for taking time out of your busy schedule to leave us a review.  It is always important for a business to strive to grow in their professionalism and communication skills.  That growth is hindered if someone does not express their concerns that arise during and after a project.  Thank you again!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "113838961780293246456", "name": "Aurora Marmolejo", "time": 1598412397716, "rating": 5.0, "text": "I had some pavers placed around my back screen porch and a flower bedding put in front of my home. They did awesome work always done within two days and they cleaned the area really good. I highly recommend Legacy outdoor services.", "pics": null, "resp": {"time": 1596206972369, "text": "Aurora, Thank you so much for taking the time to leave us a review!  The crews commented on how very kind you were to them while they were working and that means a lot.  We are excited for you to be able to use your new space and look forward to helping you in the future!\nTami"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "100748477103684685549", "name": "Susan Tuck", "time": 1549400602185, "rating": 5.0, "text": "We hired Legacy Outdoor Services for a drainage issue.  We quoted several other companies as well.  Not only did Legacy provide a detailed quote with the scope of work to be performed it was very priced very competitively.  The entire staff is to be commended.  I was kept informed as to when the job would be started without having to follow up.  When the crew arrived they were well prepared and ready to work.  This is by far the best crew I have seen.  They worked extremely well as a team.  This was a messy job to say the least.  The clean up was amazing.  When they left you couldn’t even tell they had been there!  I would highly recommend Legacy for your outdoor needs.", "pics": null, "resp": {"time": 1549428935298, "text": "Susan, thank you ever so much for the positive feedback.  We appreciate greatly the opportunity to help you with your drainage issues and we are glad that we were able to meet your expectations!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "109072573966849415490", "name": "Madeline Ortiz", "time": 1579308883532, "rating": 5.0, "text": "Great experience, really pleased with the result Good communication and work complete on time. Definitely will do business again. Highly recommend this business", "pics": null, "resp": {"time": 1579384645515, "text": "Madeline,  thank you so very much for the positive review.  It was such a pleasure to meet with you and to design a landscape you can enjoy for many years to come!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "115955243844226744303", "name": "Diane Cooper", "time": 1568841843519, "rating": 5.0, "text": "Legacy Outdoor helped me get a couple of trees planted in my bare back yard.  They look nice and the hummingbirds are already checking the Japanese Maple out.  Tammy and I worked together to find the perfect trees, exactly what I wanted.", "pics": null, "resp": {"time": 1595193111358, "text": "Diane, you have been so great to work with over the past several years.  We appreciate the opportunity to help you with new projects and look forward to many more in the future.  Thanks again!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "101461821337101273629", "name": "J M", "time": 1597024440968, "rating": 3.0, "text": "My yard is really uneven in places after having new sod laid and the length of time for them to get my project done is what gives them three stars. Otherwise, they did a good job.", "pics": null, "resp": {"time": 1597526895729, "text": "Your feedback is greatly appreciated!  This year has been rather frustrating as covid, weather, and supply issues have caused delays that we have not had to deal with in the past.  Nonetheless, we are grateful for your patience and we wish you a safe and healthy rest of the year."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "109396638207751190191", "name": "JB Robins", "time": 1560557782341, "rating": 5.0, "text": "Legacy Outdoor Services did a most beautiful job landscaping my front yard.  They installed a stone border around my flower beds and perfectly matched the stone with the stone on my house.  They added so much color to my yard with yellow, red and green shrubs and added even more color with flowers.  It is outstanding and I am extremely pleased.  The landscape workers are very professional and polite.  They were always on time and did what they promised each day.  The owner, Tami, came by most days to ensure that I was happy with the way the job was going.  They are very flexible and allowed me to do add-ons as we progressed.  I plan to re-landscape the back yard next and I will be using Legacy.  Their work is excellent!!!!", "pics": null, "resp": {"time": 1560657270577, "text": "Ms. Jan, thank you so very much for the great review!  We very much enjoyed helping you with your landscape project and we can't wait to see what new ideas you will have for us in the future!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "108150526745578549771", "name": "Patrick Miller", "time": 1567880827619, "rating": 5.0, "text": "We are very happy with the work that was done. Owners and workers were extremely professional and courteous. Work was done on time and within budget. We can highly recommend this company.", "pics": null, "resp": {"time": 1567988196795, "text": "Patrick,  it was such a wonderful experience to work with you and your wife on this project.  To be able to add more outdoor area for you to enjoy while adding a functional walkway was our goal.  It was rather hot and your attention to our crew was appreciated.  Again, thank you for your review."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "109547156616978257415", "name": "Joy Fitzpatrick", "time": 1565783180842, "rating": 5.0, "text": "Loved working with Legacy on my landscaping and hardscaping.  They have a lot of creative ideas and deliver as promised. Their employees were respectful and pleasant to work with. I'll be contacting them again when I install a pergola and some additional projects.", "pics": null, "resp": {"time": 1567097194046, "text": "Joy,  Thank you so much for the encouraging review!  You had such great ideas that were not like most cookie cutter landscapes you might see.  It was so much fun finding unique plants and I have to admit there are more \"tropical\" options for this area than I thought.  You are great to work with and I hope that we have the opportunity to help you again in the future."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "116412605110655843432", "name": "Carol Johnson", "time": 1537409321880, "rating": 5.0, "text": "We chose Legacy Outdoor Services to implement the first phase of a multi-year landscape plan for our new house. It was an excellent experience all around and we are very, very pleased with the results. Everyone there is a pleasure to work with. Paul walked through the project with us when he did our estimate, and proposed several changes to our designer’s plan that were improved solutions to fix our yard’s drainage challenges. Jessica, the office manager, was always responsive to questions, and Tami did a great job hunting down the plants we selected — which wasn’t that easy in September. When they couldn’t find the specific plants on our plan, she collaborated with us to select acceptable substitutes.\nAustin, our project manager, and his crew were wonderful. They are great guys, hard workers, and do an amazing job. Even the installation was a collaborative experience. Austin suggested an additional dry creek bed on the side of the yard to deal with the excess water that funnels into our yard from the neighbor’s driveway. We are looking forward to working with Legacy again next year when we install the next phase of our landscape plan!", "pics": null, "resp": {"time": 1537447808248, "text": "Carol, you were such a pleasure to work with and everyone agreed that your design was just beautiful!\nWe can't wait to see what the next phase has in store.  Thank you again."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "112026042859733791059", "name": "Dana Williams", "time": 1551914985325, "rating": 5.0, "text": "I had drainage work done and these guys did great. Paul and his crew got on the work quickly and worked hard to complete the job through some very difficult conditions. Austin ran the crew and he was an expert at his work and went well beyond to finish a french drain, grading and downspout pipes to the street. Austin is a fine person to work with as well as his second in charge Abraham.", "pics": null, "resp": {"time": 1551985735501, "text": "Dana, thank you so very much for the encouraging words!  You are right, sometimes the wet weather makes drainage work rather challenging.  You were both so very patient and helpful during the whole process and we are so very thankful for the opportunity to help you with your drainage issues."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "113949714652133284084", "name": "Joey Borders", "time": 1554999936331, "rating": 5.0, "text": "If you need landscaping done give Legacy a call. They do all kinds of work, but we personally had hardscaping done. They came out, viewed our patio, designed a new layout, tweaked it a few times to get it within our budget, and completed the work. I even reached out to several other companies in the beginning stages. Legacy gave us the best design with the best cost. We worked with David the majority of the time. He and the company are professional. Extremely courteous and will answer any questions/concerns. Two thumbs up.", "pics": null, "resp": {"time": 1555079634538, "text": "Joey,  We absolutely loved your design, it was unique and functional for your family.  You were such a pleasure to work with and we appreciate the opportunity to help you with your hardscape project.  Have a great spring!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "103767282675903416009", "name": "Diane Moore", "time": 1547788128837, "rating": 5.0, "text": "Legacy Outdoor Services has a great team of people and are so easy to work with.  We hired them to do some ground prep work before we installed our above ground pool.  The workers were very courteous, polite, and always showed up on time.  We couldn’t have asked for a better job and highly recommend them!", "pics": null, "resp": {"time": 1547827275608, "text": "Diane, thank you ever so much for letting us know about your experience!  As always, it was a pleasure working with you and we look forward to more projects in the future!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "102804315426935822342", "name": "Lisa", "time": 1460758438235, "rating": 5.0, "text": "Legacy Outdoor Services is the only service of this type that I will use.  They have done multiple projects for me over the course of the last few years.  Their workers are always respectful and courteous. As a woman with workers on my property, that is very important to me.  They truly go the extra mile in making sure that I am completely satisfied with their work.  Whenever the opportunity arises, I am happy to recommend Legacy to anyone who needs work done, and I do so with the utmost confidence in the caliber of work that they will provide.", "pics": null, "resp": {"time": 1463678866334, "text": "Ms. Lisa,\nIt has been the utmost pleasure to work with you on all of your projects.  Your ideas are unique and beautiful and it has been a wonderful experience bringing those ideas to life.  Customer relations is very important and we are so grateful for the opportunity to be involved in meeting your expectations."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "108483660875607420822", "name": "Tami McGhee", "time": 1538179639652, "rating": 5.0, "text": "I chose Legacy Outdoor Services for a flower bed landscaping project last year and recently for a drainage project.  The owner, office staff and workers were all very knowledgeable, professional and a pleasure to work with.  I was very pleased with the work as well as the follow-up to ensure my satisfaction with the projects.", "pics": null, "resp": {"time": 1538412473747, "text": "Tami,  It was such a pleasure helping you with your project!  Drainage issues can be overwhelming and costly if not taken care of, we are so very pleased that we were able to help you with your issues and look forward to any future projects you may have."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "115395017058219405457", "name": "Ch Carter", "time": 1536679832009, "rating": 1.0, "text": "Called and tried to get an estimate to install landscaping in the rear of our newly purchased home and we're told we're outside \" Legacy's service area\" I wasn't looking for weekly lawn service I was searching for a one time landscape install.  Their website says they provide this type of service, and their office says they service parts of Owens Cross Roads, but don't cover where  I live in Meridianville.  A check of Google maps shows it's basically the same travel distance.  Must be nice to be doing so well that Legacy can afford to turn down a job, sight unseen.", "pics": null, "resp": {"time": 1536691877822, "text": "Thank you for your response.  You are correct in that we have a set distance of service from our location.  When our office is given an address of service, we then check to see if that address is within the distance we have set for our service area.  Each address is unique and may fit into our service area whether it be in Owens Cross Roads or Meridianville.  It is necessary to have perimeters in order to provide the most cost effective price for both our potential customers and our company.  Good Luck on your project."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "112498271920360270383", "name": "Mike Gordon", "time": 1547498421601, "rating": 3.0, "text": "Don't bother calling them if you are locating over the mountain in the Hampton Cove area. They even say they serve the \"Huntsville\" area, but I guess not. I'll take my business elsewhere.", "pics": null, "resp": {"time": 1547506880999, "text": "Mike, thank you for your feedback. You are correct in that we have a set distance of service from our location. When our office is given an address of service, we then check to see if that address is within the distance we have set for our service area. Each address is unique and may fit into our service area whether it be in Huntsville or Hampton Cove. It is necessary to have perimeters in order to provide the most cost effective price for both our potential customers and our company. Good Luck on your project."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "116464768980852366180", "name": "Grant Patten", "time": 1493326199889, "rating": 5.0, "text": "Amazing work! Went above and beyond, we were very satisfied. We had them come out for lawn service / hedge trimming / tree trimming / bush removal as well as lawn mowing, and we would definitely use Legacy Outdoor Services again in the future.", "pics": null, "resp": {"time": 1515601890434, "text": "Thank you so much for allowing us to help you with your project!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "102247343157860787735", "name": "Mark Bailey", "time": 1537295229665, "rating": 5.0, "text": "I had Legacy install a partial fence for our backyard.  The work was performed quickly and well done.  Very satisfied.", "pics": null, "resp": {"time": 1537448121165, "text": "Mark,  Thank you ever so much for allowing us to help you with your fence project.  We know you will enjoy the privacy for many years to come!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "102613479039580587098", "name": "Wes G Smith", "time": 1459540121771, "rating": 1.0, "text": "I would not use this contractor again, nor would I recommend them to anyone else.  They did a drainage project for me where I explicitly described the design I wanted and it incorporated solid PVC pipe.  On the day of the job, the workers showed up with corrugated pipe.  When I called the owner, he stated that PVC would be $800 more, so feeling like I didn't want to start over with another contractor, I told him to go ahead.  Then I found out that a portion of the water to be drained to the street running from the downspout  was going through perforated corrugated pipe (pipe with holes).  They assured me that the water would be moving and would not leak out into already saturated ground (yeah, right).  Then I came home to find that the grate to catch water coming off the sidewalk was about 1 and a half to 2 inches away from the sidewalk, requiring the water to run over dirt before entering the grate.  The owner tried to tell me that it would be no problem and the bare dirt would not erode despite water constantly running over it.  I insisted that concrete be put between the sidewalk and grate to keep the water from washing out the dirt.  When I came home, I found they had used a type of caulk between the grate and the sidewalk, and had done a messy job of it, I don't know if that much caulk will ever cure.  After two days it is still soft.  Additionally, where they cut through the curb, the re-concreting was extremely poorly done.  It looked like they didn't even use a trowel, much less a curbing tool.  It looked like they basically packed the concrete on with their fingers and left it.  Part of the contract called for doing a brick border along the sidewalk.  After I paid them for the portion of the contract for the drainage, they informed me that they were waking away from the contract and that I needed to find someone else to do the edging.  The pity is, the subcontractor they had lined up to do the masonry work actually sounded very competent.  Bottom line, this is a company that, in my opinion, cut corners at every opportunity, poorly designed the project, provided shoddy workmanship, and then walked away with nearly half of the contracted work unperformed.", "pics": null, "resp": null, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "112627625497851587477", "name": "Matthew Buxton", "time": 1540823978606, "rating": 5.0, "text": "My experience with Legacy Outdoor Services was great from start to finish. Austin and his crew did a great job, furthermore everything was cleaned up before they left.", "pics": null, "resp": {"time": 1542752671590, "text": "Matthew,  It was such a pleasure working with you on your project!  Austin and the crew were so very thankful for your help during the process and we are so happy we were able to help you with your drainage issues!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "114140904219899268546", "name": "Cindy McCrary", "time": 1539029376692, "rating": 5.0, "text": "Very satisfied with the landscaping and drainage work Legacy has done at our house.  Their honest and friendly crew was always a pleasure to work with.", "pics": null, "resp": {"time": 1539279886556, "text": "Cindy, thank you so much for allowing us to help you with your projects.  It has been such a pleasure to be able to work with you over these past several years!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "109399262948912963856", "name": "Carey Rosenblum", "time": 1465960466598, "rating": 5.0, "text": "Legacy outdoor has serviced my home grounds for several years. They installed a designed row of arborvite trees along my rear property line that are very healthy and provide a natural green screen of privacy. Otherwise they have come out annually to do some re-mulching in my flowerbeds and have given them thst extra spark in appearance. If you have some landscaping issues or need suggestions I would recommend them. They are honest and do good work.", "pics": null, "resp": null, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "117947770864316007014", "name": "Jennifer Benavides", "time": 1537324665297, "rating": 5.0, "text": "Dependable, honest and hardworking! Thank you Legacy for a great job once again.", "pics": null, "resp": {"time": 1537447929235, "text": "Jennifer, thank you so much for allowing us to help you with your project.  Can't wait to see what your next project will bring!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "101586645822953159514", "name": "matt demuro", "time": 1532362506140, "rating": 1.0, "text": "This company gave me probably the worst experience that I have had with a company that has done work for me. I contracted with them to do drainage work, a sprinkler system and landscape lighting.\n\nI was told this would take 3 weeks to complete, with each phase occurring on consecutive weeks. The project as a whole took almost 12 weeks to complete, and this was only because I hounded them with calls multiple times per week.\n\nThe drainage work was the first part, it seemed to be fine, though the French drain was not placed the complete length that was discussed originally. Also the fingers of river rich were put in to stop erosion, but almost no grass seed was put in afterwards, so nothing but weeds grew in between the river rock.\n\nThe second piece was the sprinkler system. This was put in during a day, but the ground was not backfilled properly and they needed to come back out to fix it. We were told that they would put down grass seed after the lighting job was completed. The lighting work was not completed for another 8 weeks, and there wasn’t any seed put down afterwards. They were also supposed to aerate and oversees the lawn, but since they could not get their mower into our backyard, they told us they would come back with a smaller mower to pull the aerator later. This never happened.\n\nI had to call them 2-3 times a week for 8 weeks to get them to complete the lighting. Part of it was landscape lighting, the other portion was putting in a fan and spotlight in/on our screened patio. The wiring was placed so shallow, that it came out of the ground within a week and they had to come back to fix. The light and fan was supposed to be put in by an electrician, but was just put in by the owner and his friend. They put a cheap conduit over the electrical wire that didn’t even cover the wire.  They sent an electrician out to fix the wiring, but he just rigged another kind of conduit on the bare wire to cover it up.  The uplighting for the trees was sold to us at $65 a light. I just found the lights online for $45 for a 4-pack of lights.\n\nWe just gave up with this company and figured we would just be stuck with this work. Over the last year, I kept burying and covering up the wire as it came out of the ground and have been trying to repair the grass in the area where they did sprinkler and drainage work. We are still fighting massive weeds from the lack of follow through on planting grass after their work was completed.\n\nI am writing this review today after I just finished replacing 3 lights that stopped working and half of the wiring that was put in for the landscape lights. Turns out they believe that wire nuts are not necessary and you only need to tape wires together with electrical tape before putting it in the ground.\n\nIf you are looking for a company to do landscaping work for you, stay very far away from this company. You will only be sorry if you choose them.", "pics": null, "resp": {"time": 1533529694432, "text": "Thank you for bringing all of this to our attention.  Unfortunately scheduling can be a challenge when dealing with different elements and sometimes issues arise.  For example the drainage was delayed due to an unmarked water pipe, flooding the drainage trenches.   The ceiling fan was installed by a certified electrician, as was the wiring for the fan, flood lights and outdoor switch.  We would be more than happy to provide the name of the electricians that provided these services.   The contract states that there is a year warranty covering defects in workmanship and materials.   Is regrettable that we did not have the opportunity to fix the issues that you were having with your lights, thus alleviating some of your frustration.  If we had only known of the issues we would have been more than happy to fulfill the contact’s one year warranty.  Again thank you for your comments and we will take them all into consideration to better our services."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "108670955347642886754", "name": "Stephen Rice", "time": 1463175075861, "rating": 5.0, "text": "I highly recommend Legacy Outdoor Services. Our neighbors compliment our yard all the time and these guys have helped with minor and complex issues on our property. We trust them 100% and most of all, they are super professional for a service company.", "pics": null, "resp": {"time": 1463678652280, "text": "Mr. Rice,\nIt has been a pleasure working with you and we appreciate the opportunity to meet your lawn care needs."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "106141751648914846395", "name": "Jim Wittenborg", "time": 1524758298468, "rating": 1.0, "text": "I would like to have used this company for a drainage installation job, however, when I called and gave my address (near Hampton Cove), I was told that I lived too far away for their business.  I guess companies just don't go that \"extra mile\" for business anymore.", "pics": null, "resp": null, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "105383289762301934437", "name": "Richard Brown", "time": 1592346320110, "rating": 5.0, "text": "Good company to work with", "pics": null, "resp": {"time": 1592496094177, "text": "Thank you so much for allowing Legacy to help you with all of your projects.  It is always a pleasure to spend time with you both!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "113949290174597058316", "name": "Jeff Roquet", "time": 1627921831641, "rating": 5.0, "text": "Jen and the team at The Plumbers LLC are fast, friendly, and won’t break the bank. I would recommend them to family, friends and anyone in need of anything plumbing related. 5 Stars isn’t high enough for this company!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "113672523187704516534", "name": "Angela Cummings", "time": 1629419698668, "rating": 5.0, "text": "Did a really good job! The issue was not apparant at first, but technician kept looking for the problem using a process of elimination. We would call again if needed.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "108895037627206225709", "name": "Frank Mullinax", "time": 1623684715972, "rating": 1.0, "text": "Do not use this plumber.  The owner does not stand behind his work.  I had him come out for a Master bath remodel to replace a tub valve and re-route/rough in plumbing to a walk in shower.  His plumber that came out to do the initial work did not turn the new valve to the bath tubs water on, and after tiling up the shower and trying to turn the bath water on, there was no water.  Had to go back in through the tile and found out the valve was never turned on/tested to the tub.  The rough-in work to the shower ended up being so poorly done, we are having to hire another plumber to come out and go in through the wall to fix the shoddy work that was done.  The plumber that came out to do this initial work was too concerned with having to leave early to officiate a soft ball game.  The worst thing about it is the owner is not standing behind his work and fixing himself. He has repeatedly blown me off and will not come back out.  I could also go in to how he threatened legal action if I didn't pay him for partial work before the job was completed, but that is another story.  If he is that concerned about needing money before a total job is completed, not a reputable plumber.  Beware", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "100471872745315618700", "name": "Katherine Surrett", "time": 1611781364536, "rating": 5.0, "text": "Highly recommend The Plumbers! They have done two jobs for me in the last two months- fixed a leak with our toilet and installed a new water heater. They did a great job with both! Their customer service has been wonderful, everyone I’ve spoken with has been very helpful and respectful, and they came out quickly and did a quality job. I will definitely continue to use them!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "105228963036381545759", "name": "Meredith Peters", "time": 1596225150764, "rating": 5.0, "text": "Wow, best experience with a plumber in a long time! They were here the next day as a second opinion to fix a flange on a toilet seat. We had previously been quoted almost $1000 to fix this issue, but these guys did it for $225! They were professional, courteous, and fixed it well. Definitely would use again and will recommend to anyone from now on!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "100536477405397121802", "name": "Heather Lofthus", "time": 1596136262815, "rating": 5.0, "text": "Fast, affordable service! Jen got us on the schedule as soon as I called and the next day Ransom and Jared were out to fix our issue. Very knowledgeable and polite! Will be calling these guys for all future plumbing needs!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "118423908659117090464", "name": "Family Savvy", "time": 1522691914899, "rating": 5.0, "text": "I've used Mike Myers and his team~The Plumbers~for more than 5 years. They did all plumbing on a recent home renovation, and Mike did an excellent job installing a pedestal sink atop an antique piece with marble (photo below). Whenever I text Mike, he responds quickly (often same day) and has always been more than fair in his pricing. My #1 choice for all of my plumbing needs.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO4DKqf-8TvNH6JrGg12peCn5-mymKHghDWQk-4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipORWkhgUXt4ArGk9GcwA0uGAD7qlpEUVL4-5KF2=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "102858978908850956142", "name": "Tyler Disharoon", "time": 1596559411916, "rating": 1.0, "text": "By the far the worst experience with a plumber. Came out and gave a quote and said he would return 2 days later and begin the work. Never showed. Called to follow up and he committed to coming that afternoon. Never showed.  Called again to get him to come out. Said he’d be there the next day. Now he won’t answer or return calls. If you would like someone to start a job and never finish and leave you with water running everywhere...call these folks and they will leave you ya hangin.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "108558886778844128581", "name": "Kim Akridge", "time": 1573776593263, "rating": 5.0, "text": "Came out on short notice. Fair price to replace hot water heater. Very professional. Definitely would recommend.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "116368463106041625479", "name": "Daniel Dyson", "time": 1602393310020, "rating": 5.0, "text": "Hands down the best experience I have ever had with a plumbing company or service company in general. Call these guys!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "112779160186450525351", "name": "Major Tom", "time": 1556809740120, "rating": 5.0, "text": "Great service at a fair price. Called Mike with a water leak in the wall at 7:00am. He had at truck at my house by 9:00. The tech was very knowledgeable and did a fantastic job. Will definitely use The Plumbers again if the need should arise", "pics": null, "resp": {"time": 1573670177953, "text": "Thank you for the wonderful review. Call us anytime with any problems and will be there as quick as possible. We look forward to serving you again."}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "110763218095878900735", "name": "Cindy Partlow", "time": 1567535102571, "rating": 5.0, "text": "This is the second time that I have used The Plumbers LLC - great service both times. Mike is easy to work with. Very knowledgeable and professional. Good clean up after the work. Will use again.", "pics": null, "resp": {"time": 1573669181890, "text": "Thank you so much for your feedback Cindy. We appreciate your business and kind words and hope you are doing well."}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "108481586427300588137", "name": "Rachel Beasley", "time": 1581622924799, "rating": 1.0, "text": "After $350 and several visits over the course of a week including removal of fixture and scoping the lines, our toilet issue was still not resolved and began leaking blue liquid from the tank onto the floor, causing a mess for us to clean up. Hate to muddy the 5 star reviews, but $350 for multiple interruptions (and messes) and zero fix to a seemingly straight forward issue isn’t ideal for our schedule nor budget.", "pics": null, "resp": {"time": 1581641080032, "text": "Im sorry to hear this mrs beasley, i am looking into the matter , since we ran the camera down the drain i will have video evidence of that, also of the final product when we finished the job. I have the file from jan 23 ."}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "109678879373314166686", "name": "Lauriann Loveless", "time": 1559320555633, "rating": 5.0, "text": "So we had 5 leaks we patched, kept leaking. Had enough, called the pros.  They were here less than 2 hours, all fixed and to be honest less expensive than our patch jobs .  Trever was awesome.  They were respectful and neat. We live on a farm and they were good around the horses and dogs.  Will never do another patch job. Highly recommend. Thanks guys.", "pics": null, "resp": {"time": 1573670106977, "text": "Thank you Lauriann. Your business is very important to us. We look forward to serving you again."}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "109882145467130419807", "name": "Erik Brown", "time": 1536962177224, "rating": 5.0, "text": "Trevor and Brian came over and did a excellent job! Very friendly and hard working. Great job! I highly recommend them! Thanks!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "104625050976105400827", "name": "Marie Adams", "time": 1596126856865, "rating": 5.0, "text": "They were on time and did a great job.  I would use them again.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "113243534937632806676", "name": "Daryl Russo", "time": 1585149808736, "rating": 1.0, "text": "My office hired The Plumbers, LLC., to replace a gas water heater yesterday.  Today we all walked into the office and there was an obvious gas leak.  We called them back and opened all our doors to air out the fumes. When they arrived, they could smell it as well and found the leak.  A leak they told me was caused by their installers who did NOT check their work after moving the water heater into place.  With something as dangerous as natural gas, this level of incompetency is unacceptable.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "101199769171875663660", "name": "Robin H", "time": 1525993962665, "rating": 5.0, "text": "Prompt, VERY CLEAN, honest and conservative, priced very well, answers urgent issues day or night. I HIGHLY RECOMMEND them and have used them for more than 5 years for a wide variety of Services at my home and other properties. Mike is worth the wait even if he’s booked!  I trust him and his team. Very personable!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "102213513662387927131", "name": "Dionne Lovett", "time": 1525441756949, "rating": 5.0, "text": "Mike Myers first fixed my washing machine that was backing up when no one else could about 10 years ago.  I have used him since over the years for everything from toilets that wouldn't flush to leaky kitchen faucet to most recently a dangerous gas leak in my fireplace!  He is the best!  Prompt, courteous and reasonable.  I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "105645433058465548988", "name": "Tam Kay", "time": 1536458857454, "rating": 5.0, "text": "Very satisfied! Team of 2, came out today to install our hot water tank. They got the job done very quickly, no mess left behind, Affordable, no complications! I will definitely recommend them to everyone I know and contact them in the future!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "105053267060628910747", "name": "Susie Shaffer", "time": 1521576489617, "rating": 5.0, "text": "Great response time from Michael Myers’ team of 2 men. Same day service for kitchen and laundry room pipes backing up.  Pipes were unclogged in less than an hour, and as a bonus got some tips on how specific cleaners and chemicals  can actually add to the problem rather than eliminate and on how to do some easy preventive maintenance to keep the drains/pipes clear and cleaner in the future. Thanks for a job well done.  I’ll be calling on you all again as needed!!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "106231527431488551016", "name": "Steven Scrimpshire", "time": 1549480044012, "rating": 5.0, "text": "I don't give 5 star reviews. Nobody's perfect. However, we had a serious grease clog in our drains from years of neglect from previous tenants of our house. These guys came and did an excellent, efficient and thorough job of making sure our problem was fixed completely. The price was very reasonable and Robert and Brian were very courteous and professional, keeping us informed as they worked.\nI highly recommend.", "pics": null, "resp": {"time": 1573670413725, "text": "Thank you for the wonderful review!"}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "101215877036600941425", "name": "R Boyd", "time": 1524090064634, "rating": 5.0, "text": "Have used this company several times. Always on time, courteous and gets the job done. My husband was here the last time they came and they explained everything they were doing or had done to correct our problem. I would recommend these guys for any of your plumbing work.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "103137542480133646258", "name": "Matt Hadaway", "time": 1565575997707, "rating": 5.0, "text": "Had a leak on Saturday. Came out within the hour and had it fixed in two. Very prompt, efficient, clean, and friendly! Will use again!", "pics": null, "resp": {"time": 1573670048119, "text": "Thank you Matt. We look forward to serving you again!"}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "101707355518720941376", "name": "Suzanne Blocker", "time": 1522722401324, "rating": 5.0, "text": "Mike was responsive to my call. I had gotten his name from my son who had used him for a new hot water heater installation. He was pleased and I have been as well. I had a noisy pipe problem.  Mike did not stop until he resolved it   He also replaced a small behind the sink pump downstairs.  Trustworthy and dependable", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "110361892019956140590", "name": "Leigh Ann Gilbert", "time": 1548970043602, "rating": 5.0, "text": "Excellent service! Very timely and professional and fair . I would recommend to everyone.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "105064315486062318872", "name": "Holly Webb", "time": 1529448509969, "rating": 5.0, "text": "WONDERFUL experience with The Plumbers LLC! Kevin King came out to fix our sink and he was FUNNY and VERY professional at the same time!!! Definetely will be calling back when needed!!!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "103112639651111571987", "name": "Liliya Sims", "time": 1520813658374, "rating": 5.0, "text": "Mike is a phenomenal, professional, and efficient plumber. He went above and beyond to ensure our new water heater is installed and working properly.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "118259698484888469178", "name": "Robert Duff", "time": 1520191818632, "rating": 5.0, "text": "I have been using \"The Plumbers\" for over 10 years. Mike and his team are always quick to respond to whatever plumbing needs I may have.\nTry them once and I guarantee you'll hold on to their number!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "115337633936261530722", "name": "Indian Springs First Baptist Church", "time": 1549047022814, "rating": 5.0, "text": "We had a great experience with The Plumbers LLC and would highly recommend them to any company or residence.\nJoAnne Marsch - ISFBC Building and Grounds Chairperson", "pics": null, "resp": {"time": 1573670523135, "text": "Thank you for your wonderful review!!"}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "101321443884089083116", "name": "Deana Wells", "time": 1526947458643, "rating": 5.0, "text": "Mike and his crew did a great job with the plumbing on our new bathroom renovation!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "106625310940364449927", "name": "Eboni Austin", "time": 1533408262881, "rating": 5.0, "text": "Great plumbers with excellent customer service!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "112877850151143160261", "name": "Amber Lee", "time": 1525995100856, "rating": 5.0, "text": "Excellent service and very friendly! They went above and beyond at my house!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "112913865248646511015", "name": "Amberly Mitchell", "time": 1532129099544, "rating": 5.0, "text": "Very prompt and professional! I highly recommending them and will be using them again!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "100048761325860203170", "name": "ROBERT PATRICK", "time": 1616069956121, "rating": 5.0, "text": "Wolf Plumbing performed a whole house replumb due to deteriorated copper lines. Shaun, Glen, and Billy worked non-stop a couple days to complete the project. Outstanding quality install and amazing how their experience and professionalism overcame many challenges. THANKS GUYS !!", "pics": null, "resp": {"time": 1616076630774, "text": "Thank you we really appreciate your business and kind words"}, "gmap_id": "0x888bc6b4afdfa621:0x593d7df005e715c7"}
{"user_id": "116834436516157698109", "name": "Jennifer Allison", "time": 1604886971824, "rating": 5.0, "text": "We are new home owners and have bought our dream home.   It had set for over a year before we bought it. It has come with some issues  and we choose Wolf Plumbing since we were new to the area.  We have used them twice and they have been Awesome and fixed both of our issues.   They explained in detail what was going on.   I  trust them to handle any of our future Plumbing issues...", "pics": null, "resp": null, "gmap_id": "0x888bc6b4afdfa621:0x593d7df005e715c7"}
{"user_id": "108051337680668230077", "name": "Elysia Bailey", "time": 1503524233130, "rating": 5.0, "text": "I have used wolf several times now. They are fast friendly and honest. He will tell you up front what is wrong and won't charge you for what doesn't need to be done! Great fast service I will use them every time!", "pics": null, "resp": null, "gmap_id": "0x888bc6b4afdfa621:0x593d7df005e715c7"}
{"user_id": "115763499862629249721", "name": "Lillie Shepard", "time": 1627258350183, "rating": 5.0, "text": "I had previously used Weaver Septic for a bad smell in our house after it rained and they capped our septic tank. We had to call over and over for 5 weeks to get them to come back and finish the job by capping the tank after their first visit. When the problem kept happening we called them again and they wouldn’t come out for several days, so we contacted Ultimate Plumbing and Septic who were able to come out the very next day. Brian was able to fix a pipe under our house that had a hole in it and five minutes after he left Trey called and came over to check out the septic tank. He immediately diagnosed the problem, which was the job done by Weaver. They had not sealed the caps to the tank or bolted them down, but only placed it down and covered it with dirt. This was allowing water to flood our tank every time it rained. Trey from Ultimate was able to replace caps and properly seal them and also fix an issue with the pipe leading to the tank. I couldn’t have asked for anyone to be more reliable, honest, trustworthy, and hardworking than Brian and Trey. I would strongly encourage anyone needing plumbing or septic services to give these guys a call. I could only give them a 5/5, but they are definitely a 10/10. Would highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "106907864137778108626", "name": "Kathy Vaughn", "time": 1626825721629, "rating": 5.0, "text": "USE THIS COMPANY!! USE THIS COMPANY!!\nThey deserve more than the 5 stars allowed.\nI live in Gadsden and I knew I was in the right place when I called and spoke to an actual person about my plumbing issue and not someone's voicemail. Plumbers using voicemalil to run a business is not a good look for me.  Customers are left wondering if you got the message or if you can help them.  As a result, I will definitely use and highly recommend Ultimate Plumbing for any future plumbing issues based on my experience with them. My plumber Brian and his helper were awesome!  They were totally professional, courteous, and very helpful in answering my questions. I was impressed by the quality and efficiency of their workmanship in replacing my sewer line. I am totally pleased!  Thank you Ultimate Plumbing and Septic Services  for providing good old fashioned customer service. I don't usually give reviews but I just had to applaud this company.   The owner of this company knows what it takes to have a successful business .  He has a business model that a lot of other companies could benefit from.", "pics": null, "resp": {"time": 1626826404465, "text": "Thank you so much, Kathy!!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "109073744487366887400", "name": "Gene Repp", "time": 1625096764734, "rating": 5.0, "text": "I talked to Megan in the office explain my situation she was right on it Trey came out gave me an estimate on my inside and my septic tank Trey came out did the inside few few days later Jaden and Brady came out and did my septic they did an awesome job I highly recommend ultimate Plumbing for your plumbing services they were awesome great guys very respectful did a fantastic job", "pics": null, "resp": null, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "108063150708061201874", "name": "Rebecca Parks", "time": 1618887493297, "rating": 5.0, "text": "They did a great job pumping my septic tank. The problem was the flap at the bottom of the tank. They fixed it and only charged 300 dollars. A really good price according to other places i priced. Now we are flushing away with no problems. Give these guys a call for your flushing problems.", "pics": null, "resp": null, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "118350072335548955108", "name": "Cody Land", "time": 1621863783290, "rating": 5.0, "text": "Professional, courteous, and finished the job in a timely manner. Highly recommended for any plumbing/septic needs!", "pics": null, "resp": null, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "112619268104382482591", "name": "Dianne Luker", "time": 1613829995955, "rating": 5.0, "text": "This week my pipes froze and burst.  I called Ultimate Plumbing and he was here within 30 minutes. He did a great job and I would highly recommend him and will definitely use him again.", "pics": null, "resp": {"time": 1613967059512, "text": "We love to hear this kind of feedback! Thank you so much."}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "101038717086491377357", "name": "John Murphy", "time": 1605740698983, "rating": 5.0, "text": "I called these guys at 10am with a emergency water leak. They told me they would hurry up and put me ahead of schedule. They kept their word & was out to my house in less than 30 minutes. I spoke with Trey over the phone & he was very patient. The work was great also. They are great!!\n\nThank you Ultimate Plumbing & I’m so glad there are still companies like you out there. 5 stars for you guys!!", "pics": null, "resp": {"time": 1605740927762, "text": "Thank you for the great review. We really take pride in our work & really appreciate the business!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "113170372910668560837", "name": "Matthew Lively", "time": 1610332030042, "rating": 5.0, "text": "#1 Plumbing & Septic company. I called multiple companies before I called Ultimate Plumbing & Septic. They sent a young man out very quick & he fixed my problem with a very reasonable price. 5 star from me. Thank you", "pics": null, "resp": null, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "110228394131874354751", "name": "Beverly Hogan", "time": 1619817353525, "rating": 3.0, "text": "After scheduling an appointment to occur between a designated 4 hour time span, I offered for the technician.plumber to attend to a problem closer to his current location. While he cannot help that he encountered a mess and that it was me who invited him to out my appointment off til later, I never heard back from him as promised. When I reached out to their office receptionist/customer service specialist, they apologized but did not offer me a \"make-up\" appointment. Rather, they indicated they were scheduling people (customers calling after my missed appointment) already into the following Tuesday and it would be after that date. They told me they had been scheduling others since my appointment and it would be 2-3 days before they could work me back in. I would rather bail buckets of water to my back porch for the rest of the week than do business with a company that accepts this as customer service. Thus, I cancelled my interest in following through with the repairs. There was also an issue with price discrepancy. The web listed free estimates. It seemed reasonable however they would charge $60.00 to come from the Gadsden to Leeds area but the technician indicated it would be $89.00. He did offer to honor the price but it was dishonored by not showing up or calling. It is of course unclear if this was the intent. I will say they were all very nice if you just want to talk to nice and seemingly knowledgeable people about plumbing.\n\nAddendum: \"I see that a reply has been offered by the owner, \"I'm sorry, call and we will make it right\" Before spending more time talking about the idea of services, I would need to know how this would be made right. For instance, if I have received the repairs elsewhere (since this was well over a month ago), will I receive some reimbursement for such? I cannot imagine someone being so generous as to do such a thing.\nOr if I have not had the repairs done, will I receive an offer no one could possibly refuse in exchange for the prior bad service. Maybe if I have an idea about whether the call is worthwhile vs a pre-scripted customer service response, I might call. Thanks for responding though.", "pics": null, "resp": {"time": 1618442927832, "text": "We are sorry for the misunderstanding. Please give us a call & we will make it right! Thank you."}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "114048970936159787237", "name": "Kyler Adams", "time": 1605749891882, "rating": 5.0, "text": "Very professional and care about their customers which goes a long way with me. They show up on time. Do quality work and do what they can to help you out. I don’t know what else you need in hiring a plumber. Recommend\n\nThey pumped my septic tank, replaced my septic tank pump and various other piping.", "pics": null, "resp": null, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "107420452726977440516", "name": "Roger C.", "time": 1617739080816, "rating": 5.0, "text": "Great service.  Austin took care of me.  Will never use another service again.", "pics": null, "resp": {"time": 1618442854384, "text": "Thank you for you business!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "109995956312035348156", "name": "K.C. Oswalt", "time": 1620053238396, "rating": 5.0, "text": "Very kind, professional service.  Would recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "115471625921138858158", "name": "S Coleman", "time": 1605395686884, "rating": 5.0, "text": "I originally contacted Threatt Plumbing to repair my hot water heater. Someone scheduled a appointment for the following day, however there was a no-call /no-show. I then contacted Ultimate plumbing. They were very responsive, the technician David came during the time frame I was given. He was very professional ,and explain everything he was doing the entire time. He fixed my problem, and cost to repair was very reasonable.\nKudos to David!! Other companies should take note and hire better quality technicians like David.\nThank you Ultimate plumbing!!", "pics": null, "resp": {"time": 1605391920821, "text": "Thank you for the feedback. We are very happy you chose us!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "101827769318312430909", "name": "Kolby Slick", "time": 1602075832163, "rating": 5.0, "text": "I called multiple companies & Ultimate Plumbing was by far the best one. They showed up looking professional. They showed me everything that was wrong & made it very clear what needed to be done. They completed the job very quick. They also cleaned up their mess. You can’t be their prices either. I love this company!! Thank you so much.", "pics": null, "resp": {"time": 1602115233864, "text": "We love this! Thank you for choosing us!!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "116128354389582735076", "name": "Eric Martin", "time": 1613657429374, "rating": 5.0, "text": "I called and they were at my house within 30 minutes. Very professional and did very good work. If and when I need plumbing work done again I will definitely be calling them. .", "pics": null, "resp": {"time": 1613662439540, "text": "Thank you for trusting Ultimate! We really appreciate your business."}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "106890390879591004809", "name": "Fred Luhn", "time": 1600967123248, "rating": 5.0, "text": "I called Ultimate Plumbing and Septic to change out 2 toilets, two sinks, install hot and cold shutoff valves on two supply lines and repair a leak. They came when promised and completed all work in only a few hours for a little LESS than they quoted me! Trey is a man of his word and Skip is an amazing plumber. I would definitely recommend them without hesitation. Thanks so much!", "pics": null, "resp": {"time": 1600967800045, "text": "Thank you for your business sir!!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "108428972809359805604", "name": "Lucrezia Garcia", "time": 1598303636781, "rating": 5.0, "text": "Skip and Ethan were the technicians that came to our house. Both were very professional, polite and went right to work and in no time found the problem. We now have water pressure for a fair price. We are very thankful they did a great job. We highly recommend Ultimate Plumbing.", "pics": null, "resp": {"time": 1598294214700, "text": "Thank you!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "106060489861000879872", "name": "Sarah Noland", "time": 1602773418626, "rating": 5.0, "text": "Originally  called company on Sun when toilet would not flush at all! First person came Sun, exploratory dig crew here Mon, and by end of day Tues, complete new septic tank and line replacement complete! This is prompt and excellent service. Very professional and polite. Would recommend to anyone!", "pics": null, "resp": {"time": 1602774613363, "text": "Thank you for trusting Ultimate Plumbing & Septic Services! We really appreciate your business😊"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "117635075734121306078", "name": "N. Alan White", "time": 1602252984940, "rating": 1.0, "text": "DO NOT HIRE THIS COMPANY! They were hired to connect a trailer to septic after the trailer was moved.  None of the \"drops\"  were connected.  Both toilets drained on the ground. The sinks drained on the ground. No one can figure out what they actually connected to, but they did connect something to the septic tank. It may be the electrical conduit, but it certainly is NOT plumbing that the septic line is connected! The entire system will have to be redone. Thousands of dollars wasted. Two different companies said this job was improperly done, and that we should try to get our money back.\nREPLY TO reply: BEFORE you bid the job and were hired,  it was explained to your technician what work needed to be done by a professional that moved Mobile Homes and knew what needed to be done.  His advise was ignored.  The reason I lifted the STOP PAYMENT on the check was on the council  of an attorney, who explained that by signing your document without truly understanding that the job on the contract was NOT the job I  had hired you to do, I was now legally bound. I should have known when you threatened to bill my elderly mother-in-law for a \"FREE ESTIMATE\",  I was making a mistake. I will be contacting the Better Business Bureau to see if they can warn others about your Ultimate \"Plumbing\" and Septic Services, sir, and, unlike you, am a man of my word.", "pics": null, "resp": {"time": 1602075377285, "text": "Sir, you moved a trailer that had no plumbing. There is plastic underneath the trailer with a plumbing connection. You hired us to run a main line from the trailer to the septic tank. You didn’t hire us to repipe the trailer. After the job was completed you called us back to tell us that you also wanted us to repipe the trailer. We offered to come back and do that but it wasn’t within the price of the job we already done. On our invoice we wrote down all that needed to be done. We stated that all we done was run a main line from the trailer to the tank. We are sorry for the misunderstanding & if you would please give us a call we would love to make things right. Thank you!\n\nReply: Your mother wanted us to come out and run a new line from the house to the tank. We came out at 8pm & stayed for 2 hours trying to find the tank. We brought our equipment to complete the job. After we done that she wanted to wait so we charged her $60. We are sorry you think that is over priced. Thank you."}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "116194150480988626917", "name": "Jessica Adams", "time": 1601438516024, "rating": 5.0, "text": "Ultimate has been amazing to me! As a single woman and first time homeowner, they treated me right. Very responsive, repaired everything, and they did it quickly. They are a great team and the owner is very well skilled and knowledgeable (which makes for a smart crew). Ultimate is very respectful and unlike other companies, they do not take advantage of their customer’s by doing un-necessary repairs. Hands down, 10 out of 10 for me.", "pics": null, "resp": {"time": 1601438999408, "text": "Thank you so much!! We really appreciate you."}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "100032968785993433593", "name": "Chris Spears Music", "time": 1601254266130, "rating": 5.0, "text": "Absolutely HIGHLY RECOMMEND these guys. Very professional, punctual and Great work to boot. They came out on a Sunday to get my daughters shower back up and going. Give Trey and his crew a call for all your plumbing and septic needs.", "pics": null, "resp": {"time": 1601254413892, "text": "Thank you for trusting Ultimate!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "115235896062166476563", "name": "The McInerney Family Adventures. McInerney", "time": 1602833488801, "rating": 5.0, "text": "Very professional and courteous. Called them around midnight and they drove from Lincoln to Albertville. They were very knowledgeable and efficient....they didn't even wake up our twelve-year-old. Thank you Trey and Hunter,if we ever need you we will definitely call you again. Thank you.", "pics": null, "resp": {"time": 1603070486742, "text": "Thank you!!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "103553920795510403837", "name": "Regina Yager", "time": 1606252330035, "rating": 5.0, "text": "David worked tirelessly on our complicated shower and toilet problems.  Thanks so much for being such a kind lighthearted, professional.\nWe appreciate your service!", "pics": null, "resp": {"time": 1609475255236, "text": "Thank you for your great feedback!!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "106348848088566795840", "name": "Linda Matthews", "time": 1601260174337, "rating": 5.0, "text": "Ultimate Plumbing & Septic Services is GREAT!! They were the first company to answer, they showed up on time, you can't beat their prices either! They installed all new water lines at my house. I will forever use them. HIGHLY RECOMMEND.", "pics": null, "resp": {"time": 1601260520377, "text": "We love to hear this kind of feedback. We take pride in our work & we strive to make sure every customer is happy. Thank you so much!!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "116342477875262015533", "name": "Shannon Booth", "time": 1598810010696, "rating": 5.0, "text": "These guys are so professional and the best around!   We were in desperate need of someone on a Saturday to come fix our bathroom.  We had a bad clog in our bathtub.  Skip and Ethan made sure to take care of it.   I will never use anyone else. Both were very nice, and kept reassuring me it would get fixed.", "pics": null, "resp": {"time": 1598830872866, "text": "Thank you ma’am!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "112104994240928758767", "name": "Lisa Micheal's", "time": 1603070318378, "rating": 5.0, "text": "I called Ultimate Plumbing & Septic on a Sunday. They showed up in less than 30 minutes of me calling. They fixed the problem in no time and didn’t charge a lot at all. They just earned another customer because I will always use them! I highly recommend this company for all your plumbing & Septic needs!! 5 star!", "pics": null, "resp": {"time": 1603149213811, "text": "Thank you for letting us earn your business!!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "110163869477429075588", "name": "Joy Molock", "time": 1607518774004, "rating": 5.0, "text": "They got to me when they said they would.  The two gentlemen that came were polite and cleaned up after they were finished. I will use them again in the future.", "pics": null, "resp": {"time": 1607829684241, "text": "Thank you for everything!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "106678801593542207559", "name": "Caren Brown", "time": 1605818258000, "rating": 5.0, "text": "They actually answered the phone, and scheduled with us to come out. Called the morning of the job, told me when he would be here and that he would call 30 minutes prior to let me know he was on his way and he did exactly what he said he would do. We had him to repair something that had been improperly installed by someone else. He did a great job and got everything fixed for us.", "pics": null, "resp": {"time": 1605835703365, "text": "We strive to hear feedback like this. Thank you for choosing Ultimate!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "113875816788551452608", "name": "LeeAnn Harrison", "time": 1603816748555, "rating": 5.0, "text": "Awesome professional fast service. Will use this company from now on. Installed new water heater and removed old one very quickly and correctly.", "pics": null, "resp": {"time": 1603817476998, "text": "Thank you for allowing us to earn your business!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "117135873869320431338", "name": "Scott Ariail", "time": 1606847971787, "rating": 5.0, "text": "Great service, very prompt and professional.  I would and will recommend this company in the future.", "pics": null, "resp": null, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "116699367119483573271", "name": "Logan Sharpe", "time": 1598294300141, "rating": 5.0, "text": "Trey was awesome, stayed on the phone with me walking me through my issues before he even arrived. Trey and Jayden showed up exactly when they told me they would and fixed my issues within minutes. Checked, double checked, and triple checked their work before leaving. Very professional. Will continue to use them from here on.", "pics": null, "resp": {"time": 1598298074912, "text": "Thank you for your business sir!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "107003055953986026532", "name": "Michael Jenkins", "time": 1603241589820, "rating": 5.0, "text": "Showed up in an emergency later in the afternoon unclogged two toilets and ensured the problem was fixed. Hopefully don't have to but use again. Definatly recommend.", "pics": null, "resp": null, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "116484732309107813791", "name": "Katie Couch", "time": 1605048450305, "rating": 5.0, "text": "I couldn’t be more impressed by the professionalism of this company. The punctuality and quality of work was astounding, not to mention great guys to work with, whom are very knowledgeable in their work!", "pics": null, "resp": {"time": 1605377003114, "text": "Thank you, Katie!!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "105295808106385489049", "name": "Taylor Eubanks", "time": 1600456417871, "rating": 5.0, "text": "Great owner, he is very professional in everything he does and will provide the best services you can ask for. Would recommend to anyone.", "pics": null, "resp": {"time": 1600623625883, "text": "Thank you! We love feedback like this!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "104641973291120123249", "name": "Kline Keith", "time": 1598209185034, "rating": 5.0, "text": "Thank you Skip and Ultimate plumbing for coming out on Sunday and fixing my “good work” 😂😂 would highly recommend this company! Friendly guy,does great work!", "pics": null, "resp": {"time": 1598212905077, "text": "Thank you for your business sir!!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "108769589845229204654", "name": "Bruce Keller", "time": 1581212953914, "rating": 5.0, "text": "Trey with Ultimate came out and replaced my cast iron main line. They were very responsive & very polite. For the amount of work they had to do the price wasn’t bad at all. I’ll always call this company for all my plumbing and septic issues.", "pics": null, "resp": {"time": 1581213214363, "text": "We are happy to earn your business! Thank you."}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "118290968509234105865", "name": "Mason Chumbler", "time": 1595204837029, "rating": 5.0, "text": "Mr. Snyder and his crew were very friendly, and very professional. ive seen, and had other plumbing work done and this is the best company i’ve ever dealt with! i highly recommend these guys at Ultimate Septic & Drain cleaning", "pics": null, "resp": {"time": 1595205506063, "text": "Thank you for your business!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "109840055501227519815", "name": "Austin Fox", "time": 1595184381260, "rating": 5.0, "text": "You can not beat their prices and quality of the work they do. Ultimate Plumbing & Septic has my business from now on. 5 star!!", "pics": null, "resp": {"time": 1595205522976, "text": "Thank you for your business sir!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "107135515414739528190", "name": "Madison Burgess", "time": 1595204947055, "rating": 5.0, "text": "just want to say these guys did an amazing job! i highly recommend these guys for all your septic, drain, and plumbing needs", "pics": null, "resp": {"time": 1595205493298, "text": "Thank you!!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "107406063741390564539", "name": "Tammy Hartline", "time": 1586629011701, "rating": 5.0, "text": "I called them with a problem about septic coming up in the yard, immediately answered, and was very knowledgeable. Also didn’t try to rush me off the phone, made sure to ask plenty of questions. They then finished the job they were on and came straight to my house, and fixed my system even when it was raining! They are amazing! If and when I need anything else done septic wise, I know exactly who to call!", "pics": null, "resp": {"time": 1589543059317, "text": "Thank you!! We really appreciate your business."}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "107809741132149713849", "name": "Dillon Dodd", "time": 1605311205022, "rating": 5.0, "text": "Trey and his crew are great. They go above and beyond to help there customers!", "pics": null, "resp": {"time": 1605377020179, "text": "Thank you for your feedback, sir!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "103441353199070227522", "name": "Brandy Smith", "time": 1595184060333, "rating": 5.0, "text": "I will forever use this company. They are great!! Thank you so much Ultimate.", "pics": null, "resp": {"time": 1595205532445, "text": "You’re welcome. Thank you!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "101331644378354901027", "name": "Mario Murillo", "time": 1607727993928, "rating": 5.0, "text": "I called this company at 12:15pm and at 1:15pm they were unloaded and digging! Very professional and knowledgeable big thanks guys great job!", "pics": null, "resp": {"time": 1607829669266, "text": "Thank you for the business sir!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "112803229965780836829", "name": "Thomas Robertson", "time": 1580957837484, "rating": 5.0, "text": "I called them because I had sewage in my yard. They came out in no time and pumped my tank. The line going from the tank to the field lines was broke down. They repaired it in no time. Very affordable prices. Will recommend to anybody that ever needs plumbing or septic work!! 5 stars!", "pics": null, "resp": {"time": 1580958124845, "text": "Thank you for you feedback! We are happy about your great experience with us."}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "101335885611655138937", "name": "Lisa Carnes", "time": 1592334660460, "rating": 5.0, "text": "Got on the job quickly. He worked with his crew until 2 am to get it Done!!! Knowledgeable and hard working bunch. Thank you!!", "pics": null, "resp": {"time": 1592335315612, "text": "Thank you!!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "109449882132221550553", "name": "Beth Clifton", "time": 1592608691986, "rating": 5.0, "text": "Skip did a great job on my clean out blockage. Very much appreciated! Thank you!", "pics": null, "resp": {"time": 1592612727963, "text": "Thank you so much for the feedback! We really appreciate your business!!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "110447127464977204343", "name": "Jackie Renoylds", "time": 1585075772687, "rating": 5.0, "text": "They sent Trey out and repaired our plumbing.  They were very professional & did a outstanding job. Very knowledgeable. Highly recommend.", "pics": null, "resp": {"time": 1589543071457, "text": "Thank you!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "113398320590831422288", "name": "Christy Wright", "time": 1599614192425, "rating": 5.0, "text": "Jayden is the Man!!!!.Very respectful guy.Thank you for all of your help.", "pics": null, "resp": {"time": 1599655018606, "text": "Thank you so much! We really appreciate your business!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "108389088567809743036", "name": "Kelly Brown", "time": 1557515830786, "rating": 5.0, "text": "Mr. Snyder came straight out to fix my septic issues within an hour of my call.   He was very knowledgeable and helpful with my problem.  He fixed it quickly and saved me a lot of money compared to other prices I had gotten.  I am so thankful that he was honest and didn't take advantage of a single mother. I recommend him to anyone who needs this type of service. Thanks again for your great service and professionalism!", "pics": null, "resp": {"time": 1564538405899, "text": "We are happy to hear this. Thank you for your business"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "110890281084926824777", "name": "Tina Hines", "time": 1618509560918, "rating": 5.0, "text": "Great service and quick", "pics": null, "resp": {"time": 1618510549814, "text": "Thank you for the awesome feedback!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "105383866300756470715", "name": "Daniel Edwards", "time": 1581449105446, "rating": 5.0, "text": "They were great! Called and they were out within a couple of hours. Trey was the tech and did a great job and was very personable.", "pics": null, "resp": {"time": 1581449428108, "text": "We are happy to earn your business sir! Thank you"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "107030725780662681654", "name": "Brandon Schaffer", "time": 1594667621584, "rating": 1.0, "text": "Called and they sent a young man out.  He was very rude and charged an arm and a leg.  Will not be calling them back.", "pics": null, "resp": {"time": 1594736023703, "text": "This is a fake review from a competitor."}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "108966876058386834507", "name": "Jimmy Kellly", "time": 1572716879313, "rating": 5.0, "text": "My wife called Ultimate Septic and Trey came out very quick. He explained everything to us and saved us a lot of money. This company is great!", "pics": null, "resp": {"time": 1572717337194, "text": "We are happy to have your business. Thank you sir."}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "110724568619734049781", "name": "Warren Alexander", "time": 1557479608750, "rating": 5.0, "text": "These guys are amazing! Very professional, great price for the job and their work was excellent. It didn’t take them long to fix my clogged drain problem. I definitely recommend them.", "pics": null, "resp": {"time": 1564538377327, "text": "Thank you for giving us business!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "105885328080995628948", "name": "Kaidyr", "time": 1577863377152, "rating": 5.0, "text": "Ordered a driveway grading from them and it looks nice and professional. A very spot on job by Trey and Logan! I'd certainly reccomend their services to anyone in the future.", "pics": null, "resp": {"time": 1577969895300, "text": "Thank you for the feedback sir!!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "116205932246605273384", "name": "Logan Beadles", "time": 1585684450734, "rating": 5.0, "text": "One of the best plumbing companies I’ve ever dealt with. Highly recommend!!", "pics": null, "resp": {"time": 1589543082114, "text": "Thank you sir!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "110906589805935401402", "name": "Teresa Cecchetti", "time": 1574426962367, "rating": 5.0, "text": "Knowledgable, hard workers.  My septic tank was covered with and invaded by roots from a huge tree we'd had cut down right after we moved here recently. The tank was also covered by bricks put down ages ago by the previous owner and Jamie picked them all up and stacked then neatly by our driveway. Trey and Logan de-rooted the tank and put in new ground access with lids. Very satisfied with their work and price.", "pics": null, "resp": {"time": 1574429505512, "text": "Thank you for the positive feedback ma’am. We are happy to have your business!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "103747759146021232816", "name": "James B", "time": 1564467782899, "rating": 5.0, "text": "If you ever need to have your sewage or septic problem fixed, it's worth the call to Ultimate. I had a  sewage pump blow out on my house and backed up into my yard. I called and Trey put me on the schedule right away but he also explained to me what may be the problem and he came out and took care of the problem. Worth the time and worth the GREAT RATING. Fair price, knowable, and great customer service. Thank You from Lakeview Circle", "pics": null, "resp": {"time": 1564538264706, "text": "Thank you for the positive feedback. We look forward to future business with you."}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "105049091689735665398", "name": "Dale Cordell", "time": 1578686775648, "rating": 5.0, "text": "Excellent company to use for all your plumbing needs.Very respectful and did a awesome job.Would recommend them for all your plumbing needs.", "pics": null, "resp": {"time": 1578695062261, "text": "We appreciate your business sir!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "110533528373165816877", "name": "Marti Short", "time": 1595207918027, "rating": 5.0, "text": "Great business, good work done in a timely manner!", "pics": null, "resp": {"time": 1595257619659, "text": "Thank you!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "104452880061988092774", "name": "Emma Whitmore", "time": 1561779363726, "rating": 5.0, "text": "Excellent service! They arrived on time, we’re so very polite and so affordable! Highly recommend this company to anyone needing any work!", "pics": null, "resp": null, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "110100591880912258630", "name": "Vernon Lambert", "time": 1561863744647, "rating": 5.0, "text": "Came to our house on a Saturday night at 9 p.m. to correct our problems. These guys were super nice and very knowledgeable. Would highly recommend.", "pics": null, "resp": {"time": 1564538555047, "text": "Thank you sir!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "114159900477129736607", "name": "danielle burton", "time": 1581899146364, "rating": 5.0, "text": "Excellent service and very knowledgable. Trey and Logan are the best in the business.", "pics": null, "resp": {"time": 1581902039648, "text": "Here at Ultimate we strive for feedback like this. Thank you ma’am for your business!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "114863562712917742269", "name": "Julie Sizemore", "time": 1562184400278, "rating": 5.0, "text": "Very knowledgeable and professional. Fixed my problem quickly for a reasonable price. Highly recommended if you have septic issues.", "pics": null, "resp": {"time": 1564538531023, "text": "Thank you for your business. We are happy to hear this."}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "109948925949356563172", "name": "Patrick Brown", "time": 1561501572278, "rating": 5.0, "text": "Excellent work! They have very affordable prices and arrived on time. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "102157044950657170951", "name": "Rachel Gibbs", "time": 1562021002383, "rating": 5.0, "text": "Wonderful to work with. Very fast and accommodating. I would highly recommend!", "pics": null, "resp": {"time": 1564538540591, "text": "Thank you!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "105938887053972514875", "name": "Jamie Crutcher", "time": 1570470679356, "rating": 5.0, "text": "I highly recommend Ultimate Septic & Drain Cleaning if you ever have any septic & drain cleaning needs!", "pics": null, "resp": {"time": 1570489578191, "text": "Thank you sir"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "106185521675314489530", "name": "Jacob Fuller", "time": 1600822094649, "rating": 1.0, "text": "Quoted a ridiculous price for repairs.  Way too high priced!  Steer clear!", "pics": null, "resp": {"time": 1600866294414, "text": "Sir, we do not have you on our files. Please give us a call. We would be more than happy to fix your problems & give you a good price. Thank you!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "101093433681723249985", "name": "Janice Williams", "time": 1598144237090, "rating": 5.0, "text": "Very professional, Did a great job!!", "pics": null, "resp": {"time": 1598146352707, "text": "We really do appreciate your feedback! Thank you for your business."}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "116811988830267567368", "name": "Beverly B", "time": 1558712008394, "rating": 5.0, "text": "So I had a septic tank problem the toilet wasn't flushing and backing up into the bathtub,  they explained the problem of how the pipelines and house were connected and what the main problem was. Came on time and was proffesional during appointment. Would definitely reccomend, No negative feedback at all.", "pics": null, "resp": {"time": 1564763343543, "text": "Thank you for choosing Ultimate Septic & Drain Cleaning!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "103636938607087515125", "name": "Mellisa Wood", "time": 1576176362718, "rating": 5.0, "text": "If you're in the Gadsden or surrounding areas I highly advice you to use this company!! 5 stars!!", "pics": null, "resp": {"time": 1576180425850, "text": "We love to hear this. Thank you ma’am!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "115706405635425511194", "name": "Cody Fowler", "time": 1562591191571, "rating": 5.0, "text": "Great guy. Great pricing. Would reccomend to anybody.", "pics": null, "resp": {"time": 1564538309387, "text": "Thank you."}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "110904383904842557639", "name": "Brady Gowens", "time": 1557525113796, "rating": 5.0, "text": "Was very professional, easy to reach and got the job done in a great time frame! 10/10", "pics": null, "resp": {"time": 1564538415257, "text": "Thank you sir!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "108535365459698599404", "name": "shelia muse", "time": 1557590393950, "rating": 5.0, "text": "Great service & Affordable prices. Highly Recommend", "pics": null, "resp": null, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "109683513709622324070", "name": "Brenda Arrington", "time": 1600448519338, "rating": 1.0, "text": "My septic tank was running over, review said they had cleaned lines for someone else, had to get another company to empty the tank my expense only option was an aerator well that didn't work at all had to call another company to fix", "pics": null, "resp": {"time": 1600452675239, "text": "I reviewed your invoice from 12-5-2019. You were given 2 options.\n\nOption A: Install 180ft of field lines.\nOption B: Install an aerator\n\nYou chose the aerator for financial reasons. We offered to take 50% off of the price. On the invoice you signed it says customers choice. As we discussed on 12-5-2019 your field lines were in bad shape & this aerator would only give you a little more life. It helped for 10 months which was about the estimated life we predicted they would last until you decided to replace the lines. I’m sorry about your experience ma’am & if you give us a call we would be more than happy to come back out and help. Thank you ma’am!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "114794300600641620574", "name": "Timothy Nicholson", "time": 1572725687631, "rating": 5.0, "text": "Great experience! Thank you, Ultimate.", "pics": null, "resp": {"time": 1572725808091, "text": "We care a lot about our customers. Thank you sir."}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "108867866614455758829", "name": "John Cheatwood", "time": 1562971467232, "rating": 5.0, "text": "GREAT service; less than two hours passed between my phone call and servicing! Price was below other quotes, too!", "pics": null, "resp": {"time": 1564538298110, "text": "Thank you for the great review."}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "117102340335530141952", "name": "Taylor Simpson", "time": 1602258649463, "rating": 5.0, "text": "Highly recommend!!", "pics": null, "resp": {"time": 1602258830687, "text": "Thank you 😊"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "102332309546994423141", "name": "Linda Baldwin", "time": 1561505264629, "rating": 5.0, "text": "Wonderful person, pleasurable business.", "pics": null, "resp": null, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "102483952722689984872", "name": "Destiny Strawn", "time": 1576605122966, "rating": 5.0, "text": "Great Service!!", "pics": null, "resp": {"time": 1576605481488, "text": "Thank you for your business!"}, "gmap_id": "0x888af70032d77115:0x711e0a384f5687a2"}
{"user_id": "111022823856562138716", "name": "Keith Krininger", "time": 1500837713933, "rating": 5.0, "text": "We would like to acknowledge what a wonderful experience we had working with Alabama Landscape Creations.  Their management is knowledgeable, friendly, and prompt.  We had a large project with a large seawall, double waterfall, and 2 flagstone decks, not to mention the beautiful  landscaping job they did.  We get compliments every time someone visits, even from boaters passing by.    Most importantly, they stand behind their work and if you have a problem, they will fix it.  We highly recommend them!!  Keith and Kay K.", "pics": null, "resp": null, "gmap_id": "0x888ecde8558086ab:0x4b420a673611a607"}
{"user_id": "116138046102982294502", "name": "David Wilson", "time": 1423276199903, "rating": 5.0, "text": "ALC came up with a plan that solved a very challenging erosion problem on my steeply sloped lot that fit my budget, looks fantastic and was completed ahead of schedule.  Jake and everyone I met was very professional and I recommend them highly.", "pics": null, "resp": null, "gmap_id": "0x888ecde8558086ab:0x4b420a673611a607"}
{"user_id": "113170001855592911569", "name": "M M", "time": 1591301210960, "rating": 5.0, "text": "They came to our home began replacing some sod and bushes on our property that had died from the city doing some work. The city did send out a team to repair the damage, but the work was shoddy. We didn't realize it was shoddy until we saw SuperiorScape come out and fix everything. They properly planted the bushes and trees, instead of packing in clay dirt around the root. They placed the sod, fertilized it, rolled, and watered it. The lawn looks great now. The men were kind and when we spoke to the manager he even gave us tips on our other plants on proper pruning. He really listened to us and helped. The whole team did a fabulous job", "pics": null, "resp": {"time": 1594742360379, "text": "Thank you for the kind words; we sincerely appreciate your feedback. We shared your review with the team that came out to make the repairs in your yard.\nSuperiorScape, Inc. strives to provide excellent customer service. Therefore, it is nice to hear from our customers when the job is done well."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "110359515344276713504", "name": "Linda Guetschoff", "time": 1589815495172, "rating": 5.0, "text": "Superior did a small job in my yard. I was impressed by their professionalism and the quality of their work. I would recommend their team of employees.", "pics": null, "resp": {"time": 1594742489334, "text": "Mrs. Guetschoff:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service. Please let us know if you need additional landscape construction work completed."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "117493206350182024953", "name": "Amy Nesbitt", "time": 1565958437580, "rating": 5.0, "text": "We had an excellent experience with SuperiorScape. We needed a retaining wall built at the end of a sloping driveway, and they did an amazing job. Chris was easy to get in touch with and was able to come out and give an estimate within a few days. We were put on the schedule and not only did they actually come at the scheduled day, they were able to start a few days earlier! We had a few questions at the beginning of the project and Chris was very easy to get in touch with and was prompt to reply to our questions. The retaining wall is quality built and beautiful. The project was done precisely as discussed and we could not be happier with it. This company exceeded all of my expectations. I would highly recommend them.", "pics": null, "resp": {"time": 1594742553952, "text": "Mrs. Nesbitt:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service. Please let us know if you need additional landscape construction work completed."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "107209389829011551764", "name": "Beth Law", "time": 1558715390265, "rating": 5.0, "text": "So impressed with this company!  We got several quotes for landscaping at our house - they were significantly less expensive than another local company.  Very easy to work with and the final work they did was wonderful.  Very honest and hard working - would highly recommend!", "pics": null, "resp": {"time": 1594742980280, "text": "Mrs. Law:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service. Please let us know if you need additional landscape construction work completed."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "108691910154311646718", "name": "Elizabeth Long", "time": 1558732803878, "rating": 4.0, "text": "Chris was great to work with.  We needed work done at property we are selling (and we live out of state).  He did the estimate very quickly, worked with us on a payment plan and kept us updated on start, progress and finish.   Definitely would recommend this group.", "pics": null, "resp": {"time": 1594741758670, "text": "Mrs. Long:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. We strive to provide excellent customer service. Please let us know if you have additional landscape construction needs."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "117380344196876657370", "name": "Lindsey Fagan", "time": 1558558625089, "rating": 5.0, "text": "Superiorscape built a small retaining wall and sidewalk at my home.  They did an excellent job and I would highly recommend them!  They were also a pleasure to work with; they were accommodating when it came to scheduling and quite helpful with the information I had to turn into my HOA.", "pics": null, "resp": {"time": 1594743023094, "text": "Mrs. Fagan:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service. Please let us know if you need additional landscape construction work completed."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "101899679334085631233", "name": "Kevin Weber", "time": 1558526940600, "rating": 5.0, "text": "I want to thank Chris for doing a fantastic job replacing my flagstone patio and steps!!  I wish I would have used SuperiorScape 10 years ago. Bottom line you get what you pay for. Would highly recommend.", "pics": null, "resp": {"time": 1594743090962, "text": "Mr. Weber:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service. Please let us know if you need additional landscape construction work completed."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "112728551480887665743", "name": "Robert Chapman", "time": 1590238267403, "rating": 5.0, "text": "They do what they say there going to do. They show up as promised and do excellent work. A pleasure to work with.", "pics": null, "resp": {"time": 1594742459500, "text": "Mr. Chapman:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service. Please let us know if you need additional landscape construction work completed."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "108329044835946594473", "name": "Blair Kelly", "time": 1537988764413, "rating": 5.0, "text": "We recently had Supeiorscape give our backyard a complete overhaul. They were very professional and their timeline was right on target. They were able to fix our ongoing flooding problem which was a huge relief. We now have a backyard we want to enjoy instead of ignore. Overall, we are very pleased and highly recommend their service.", "pics": null, "resp": {"time": 1596038720342, "text": "Thank you, Mrs. Kelly, for your business, as well as your feedback. We strive to always show professionalism and provide excellent customer service. Please let us know if you need additional landscape construction in your yard."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "104165179825294701435", "name": "Ryan Henderson", "time": 1543081440771, "rating": 5.0, "text": "The Office Manager is wonderful. She has a terrific attitude, unselfish, and is very passionate about the company! Very dedicated and is a pleasure to work with.", "pics": null, "resp": {"time": 1596038464097, "text": "Mr. Henderson:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "115209955868794034889", "name": "Roland “Ron” Montgomery", "time": 1541628361110, "rating": 4.0, "text": "They did a good job for us.  Professional and polite.  Worked hard. Would recommend them.", "pics": null, "resp": {"time": 1594741798024, "text": "Mr. Montgomery:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. We strive to provide excellent customer service to our customers. Please let us know if you have additional landscape construction needs."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "114520468905177855492", "name": "Mark Haughery", "time": 1558974803235, "rating": 5.0, "text": "Right on time and Excellent work from start to finish.  Highly recommend Superiorscape!", "pics": null, "resp": {"time": 1594742570121, "text": "Mr. Haughery:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service. Please let us know if you need additional landscape construction work completed."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "118259764199177206568", "name": "Sarah Beth Wertz", "time": 1528424425769, "rating": 5.0, "text": "We are beyond thrilled with our recent courtyard renovation by SuperiorScape. The guys worked hard, were professional and completed the project in just a few days. We were also really pleased that they took the time to clean up each day after a hard day of work. The process from start to finish was professional and easy. We highly recommend SuperiorScape!", "pics": null, "resp": {"time": 1596039112933, "text": "Thank you for your business, as well as your feedback. We strive to provide each customer with excellent customer service. Please let us know if you have any additional landscape construction projects; we will be happy to come out again."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "116701168202425059416", "name": "phillip bromley", "time": 1547502601886, "rating": 5.0, "text": "This company is outstanding. They came when they said they would and did excellent work.", "pics": null, "resp": {"time": 1594743171503, "text": "Mr. Bromley:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service. Please let us know if you need additional landscape construction work completed."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "103553431879871169518", "name": "Don Johnson", "time": 1558718913330, "rating": 5.0, "text": "Love the work and the great group of guys", "pics": null, "resp": {"time": 1594742666101, "text": "Mr. Johnson:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service. It is always good to hear that our team members are working to meet your expectations."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "117057714328552790301", "name": "Jarrod Patterson", "time": 1510165860645, "rating": 1.0, "text": "1 star only because 0 stars is not an option.\n\nI just moved to the Birmingham area. The only item needing attention from our home inspection was a failed retaining wall. SuperiorScape provided a quote for the repair, which we used to close on our house (had money held in escrow based on SuperiorScape's quote).\n\nAbout a week prior to the scheduled start date for the work to begin, the sales agent came out with another team member to look at the existing wall. That afternoon, the sales agent called me and said that due to personnel issues they couldn't do the job. I tried to get back in touch with SuperiorScape to say we were willing to wait until they settled their personnel issues but that we would like them to honor the quote they gave us. They have not responded to any of my or my realtor's attempts to contact them.\n\nI believe the sales agent misquoted the job, came out with the actual worker who told him it was too cheap, and rather than owning the mistake, talking it out, and honoring the quote they backed out of the job and refused to speak with me again.\n\nTerrible customer service.", "pics": null, "resp": {"time": 1594741469357, "text": "Mr. Patterson:\nAlthough your review was posted in 2017, I would like to apologize for the experience you had with SuperiorScape, Inc. In March of 2018, we hired a new Sales Manager, with a great deal of knowledge in the landscape construction field. SuperiorScape, Inc. is dedicated to our customers and we strive to provide great customer service. I apologize for not being able to provide you with better service."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "100719653768094018527", "name": "James E. Dean", "time": 1550843306966, "rating": 5.0, "text": "Great People!", "pics": null, "resp": {"time": 1594743139867, "text": "Mr. Dean:\nThank you for the kind words. We appreciate your help with our IT issues."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "118045740458175825402", "name": "Mike & Stephanie Freeman", "time": 1548777177538, "rating": 5.0, "text": "We first called the company “Critter Capture” and had them come out to get rid of a squirrel that had made his nest in our gutter. After checking our attic and seeing that the squirrel had not yet made an entrance into our house, they told us there was nothing they could do.  The guy didn’t even have a ladder to check our gutters!\n\nSo we call Jim from Exclusive Wildlife & Pest Control.  He laughed when I told him the previous encounter with the Critter Capture company and then proceeded to get his ladder (that he brought himself!) and take a look at our gutters and ensure that the squirrel had not damaged our roof yet and also took the time to double check our attic. No damage was noted except for the fire pit cover we caught the squirrel tearing up the previous weekend.\n\nJim gave me two options on how to get rid of our furry new houseguest; we could capture him alive and release him elsewhere or set a trap similar to a rat trap that should kill him instantly. After much discussion my husband and I decided on the rat trap since the evenings here have been very cold and the poor squirrel may freeze to death in a live trap. Jim was so very patient as we weighed our options and was able to give me the pros and cons on both methods.\n\nAfter one failed attempt to trap him (the trap caught his tail instead of his neck) Jim text me throughout the evening to reassure me that he would get him the next day and that all would be OK. Jim returned promptly the next morning, set the trap again and was able to get the squirrel instantly. He disposed of everything and cleaned the nest out of the gutter.\n\nJim was so very pleasant to work with I will definitely be calling again if any other squirrel decides to make his home here!\nI would recommend Jim and Exclusive Wildlife to anyone who is looking for good, quality, and prompt service.\n\nThank you Jim!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMBbVC-1NoRZZKkz46lqwpMR0kKMUXVSo0HNWyH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOpMImbqi6WT6TFmbGFntrWu9R1ePdVJL0QITRP=w150-h150-k-no-p"]}], "resp": {"time": 1548888877159, "text": "Thank you Mike & Stephanie Freeman, it was my pleasure helping you rid your home of your unwelcomed guest and it was nice meeting you."}, "gmap_id": "0x889a1b2dea85547d:0x4c0bde02d4614206"}
{"user_id": "103366309176078943651", "name": "Jim R.", "time": 1561308658309, "rating": 5.0, "text": "Wow, what a professional service! From the meet and greet to the finished job. Neet and clean and thorough. 100% satisfied!", "pics": null, "resp": null, "gmap_id": "0x889a1b2dea85547d:0x4c0bde02d4614206"}
{"user_id": "113379450846746276634", "name": "Lynne Casey", "time": 1499700139906, "rating": 5.0, "text": "They came on a Sunday afternoon. Very professional. Did a wonderful job inspecting under a trailer in the mud.  Stayed with it for hours until a huge dead possum was located and removed. I will definitely recommend this company to anyone and everyone. From large to small insect, animal, rodent prevention, inspection or removal. JIM RICHARDS is your man.", "pics": null, "resp": null, "gmap_id": "0x889a1b2dea85547d:0x4c0bde02d4614206"}
{"user_id": "107950158733247526469", "name": "Leslie White", "time": 1557423805901, "rating": 5.0, "text": "Friendly and informative", "pics": null, "resp": null, "gmap_id": "0x889a1b2dea85547d:0x4c0bde02d4614206"}
{"user_id": "101991404990833177193", "name": "Dazzling Mystic", "time": 1617393607313, "rating": 5.0, "text": "They came out and tried their best to fix the problem we had. They even tried to find our main drain clean out. Their tools was just to big to go the only way they knew how to do it without the main drain clean out. They where polite and did not take a dime even when I offered to pay something for their time they spent and for trying. Very good company and will be hiring them to have a main drain clean out put in later and for my plumbing issues after.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "117745307531163994125", "name": "brandon green", "time": 1567188830532, "rating": 1.0, "text": "July12,2019,I had an invoice from Glenn Jennings for $480.00.  They fired Glen Jennings after I agreed to the quote. I agreed to it. I didn't hear from the company at all.They sent another plumber and he stated he didn't know anything about the previous quote and stated he couldn't honor it. The date was around August 21. After waiting a week to get a response about the quote, I called the Roto-Rooter back and asked to speak to the manager. The manager whom never returned my called. I think this was bad busy. I called another company  called Machen Plumbing who took very good care of me. And they gave me a cheaper quote 0f $295.00. They showed me the parts prices and the problem to all of my concerns. Here are all the pictures to prove. Please trust me, Do Not Go Though Roto Rooter At All!!!!!!!!!!!!You will be very disappointment.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNHCzcHmD5TmHEEojthHiD-Kl2t6BqnAoiwyr1b=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPf4n8V7Dh_gxnyzdIvhMuVwSjQSIN2ihpgt_7U=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNi62-IqeNYGvm8wIXsBYi3gaY7t8Z0WA4orAvp=w150-h150-k-no-p"]}], "resp": {"time": 1567191300407, "text": "Hi Brandon, thanks for the feedback.. I am sorry for dropping the ball on your job. We have corrected both the manpower and process so we can do a better job next time. Randy"}, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "111200673333883452518", "name": "Linda Sufficool", "time": 1620436522921, "rating": 5.0, "text": "I have had the pleasure of meeting TJ Woods twice, even though I never wanted to see him again haha (who likes plumbing issues?). Both times he was punctual, kind, and he listened to what I had to say. Although he was not able to fix my issue (city main sewer line) he was extremely helpful. He is the nicest repair man and I never want to need him again, but if I do, I know exactly who I will trust!", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "113898772272955445943", "name": "Melanie Gurley", "time": 1618364813810, "rating": 5.0, "text": "Justin was knowledgable and professional.   Very pleasant. Played", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "113237379117068526729", "name": "Tommie Goggans", "time": 1618081858749, "rating": 5.0, "text": "TJ was awesome! He did a very good job. He went above and beyond! Thank you!", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "115944921447430390804", "name": "larry wise", "time": 1617747023874, "rating": 5.0, "text": "Very prompt good service and explained price before service so there was no hidden fees", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "101948260751314355714", "name": "Jeff Gaither", "time": 1621950907129, "rating": 5.0, "text": "Technician was friendly and worked steady until the job was done.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "108096288398741457646", "name": "Judy Kretzschmar", "time": 1617660247912, "rating": 5.0, "text": "The gentleman was very efficent and completed the work quickly  after letting me know what the problem was and where.  I will definately use Roto-Rooter again should I need plumbing work done in the future.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "103034432063081631766", "name": "Tom Brown", "time": 1606507094638, "rating": 5.0, "text": "Pete did an outstanding job. On time, professional,  extremely fair price, and fixed the problem . Its rare in today's society. To find someone of this caliber. You made a life long customer. Thank you", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "101592782548129864168", "name": "Rick Moreland", "time": 1609786829418, "rating": 5.0, "text": "Great job clearing drain pipe to septic TJ was very professional", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "103600163470121484679", "name": "eric49401", "time": 1611864579276, "rating": 5.0, "text": "Thank You. Pete did a great job on my septic pump.", "pics": null, "resp": {"time": 1611865254326, "text": "Thank you!"}, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "103569796746279901617", "name": "Aleathia Sales", "time": 1604076974347, "rating": 5.0, "text": "The Tech was very prompt. Was expect him later be he arrived 30 mins after I call for service. He waa very nice and did the procedure twice to make sure everything was fixed. Great Job.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "114671159166812466137", "name": "Tara Howard", "time": 1610941606926, "rating": 4.0, "text": "We got an estimate on a mainwater pipe etc. The man was very helpful and knowledgeable. Only issue we had was communication with  the appointment, but we did get it worked out.", "pics": null, "resp": {"time": 1611865251391, "text": "Thank you"}, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "100221102450193081316", "name": "Rolf Johnson", "time": 1598898155160, "rating": 5.0, "text": "Repairman arrived on time and was very polite and did an excellent job.  No problems since his visit.  5 Stars to him.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "106005152525674981077", "name": "Vicki Langley", "time": 1609177532515, "rating": 5.0, "text": "Travis was my technician and he was fantastic!  I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "109204509304384823947", "name": "Jamie Girot", "time": 1589496922143, "rating": 5.0, "text": "Elijah was very friendly and made sure everything was working properly before he left.  He explained everything and gave us a senior citizen discount, which was very much appreciated.  I will definitely recommend Roto Rooter and Elijah and they will be my first call if we have any problems in the future.  Thank you!!", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "107569946189108443577", "name": "Linh Hayes", "time": 1606252659956, "rating": 5.0, "text": "Elijah was very professional and knowledgeable. Everything was as quoted and even with some hardships, he fixed the problems right away for us!", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "105162058851275856302", "name": "Danny Murphree", "time": 1597071137348, "rating": 5.0, "text": "Chris came out and unstopped a line and was very respectful. I would recommend this group to any of my family and or friends.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "117014877517024889162", "name": "valjeanne jeffers", "time": 1575862249577, "rating": 5.0, "text": "They are very professional and competent. Jeff arrived at my house within 30 minutes, and resolved my plumbing issue within less than an hour. The price was also very reasonable. This company has great service and prices!", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "100271822627821101150", "name": "Pamela Gunter", "time": 1619021333385, "rating": 5.0, "text": "Great friendly and quick repairs", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "105838330648328486425", "name": "Joanne White", "time": 1590445935815, "rating": 5.0, "text": "Excellent fast service. I called them out on memorial day and they showed up fast and was very professional.  I would highly recommend this service.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "109937433270461165048", "name": "Chris Daugherty", "time": 1622574969664, "rating": 5.0, "text": "Keith was awesome.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "114562892935189929486", "name": "Kim Heath", "time": 1617996146841, "rating": 5.0, "text": "Justin was knowledgeable, kind, and fast.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "114211981804573807311", "name": "katina higgins", "time": 1603242524466, "rating": 5.0, "text": "They got the job done and was so nice.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "102766870406093886239", "name": "Hilton Wiggins", "time": 1590526336633, "rating": 5.0, "text": "I hadn’t been able to do laundry for several weeks. They came out and diagnosed the problem, fixed it in no time at all and had me back up and running very quickly. For a reasonable price as well. Thank you", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "100587945497473067521", "name": "Tony Cavitt", "time": 1592934273927, "rating": 4.0, "text": "The tech did a good job, in a reasonable amount of time. He was courteous and professional.\nI do think $153 is rather steep for 30 min to snake/clear a grease clog.\nI was put off one day from the original scheduling, which happens.\nthe only negative parts are: (1) when the tech called to reschedule the first appointment, i requested that he call me when he was on his way so that i could lock my watchdogs in the back BEFORE he got there. I also requested the same of the lady who called afterward to verify the appt change. Neither called before he arrived, dogs went ballistic when he turned in the drive and it was MUCH harder to get them kenneled. Very aggravating after asking both people!\n(2) The tech came to my door with NO mask on expecting entry and I had to send him to his truck for a mask. We are elderly and my wife has COPD. That is irresponsible and surprising in the middle of this pandemic. It should be a mandatory requirement for Roto-Rooter...", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "100034048026526962214", "name": "Sandra Persons", "time": 1584731396347, "rating": 5.0, "text": "The tech was great!  Kept updating me on what was going on.  Was honest with me about what was causing the problem.  Got everything going again.  Highly recommend them.  Great service.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "107933376255736753390", "name": "CEM CEM", "time": 1570654033557, "rating": 5.0, "text": "Justin was marvelous in his performance draining my stopped up tub and installing a new trim lever. He was prompt, hard working, extremely knowledgeable of the task before him. He also did an excellent job informing step by step what he was going to do in the repair process!!", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "105761694881361755965", "name": "Lori Crabtree", "time": 1586119299745, "rating": 5.0, "text": "He was extremely nice, helpful, and informing.  He was letting me know everything he was trying.  I appreciated that!", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "111533760437608663004", "name": "katina hawkins", "time": 1590771988567, "rating": 4.0, "text": "So far I have only had a estimate.  The tech was friendly and  observant . I am waiting to see how the actual  service go. My appointment is soon.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "102580220398857320012", "name": "Tina Williams", "time": 1589327527727, "rating": 5.0, "text": "The plumber was very respectful and explained everything to me. I will definitely be recommending you all.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "103808609670205515471", "name": "Sandra F", "time": 1586194226085, "rating": 5.0, "text": "They came out as promised. In a timely frame. Very professional and polite. Took precaution.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "102258847131229189618", "name": "Brooke Brewer", "time": 1568768614585, "rating": 5.0, "text": "Chris was amazing! He was very thorough with the job and explained everything in great detail. He made sure we knew what was good and bad for our drainage system, and solved our issue quickly.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "111985789353991172294", "name": "Dewayne Klebine", "time": 1577137094097, "rating": 4.0, "text": "Might be a little pricey but definitely worth the money. They were very responsive. Got here quickly. Make sure everything was working well before they left. Thanks for the service!", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "102572544926733979473", "name": "Ramona Thompson", "time": 1591040755910, "rating": 5.0, "text": "Elijah went far and beyond to fix my problem.  He was knowledgeable, on time and very professional..I was extremely pleased with Roto-Rooter and will be using them again as needed in the future...Thank You, Roto-Rooter.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "110784660181638638463", "name": "McKenna Sheppard", "time": 1604426589609, "rating": 1.0, "text": "Called them and was put on hold for an extended period of time.  The receptionist was very rude and acted like they didn’t even want my business.  Never again!", "pics": null, "resp": {"time": 1604513994126, "text": "Ms. Sheppard, thanks for letting me know about your experience. I did review your call and we did leave you on hold for an extended period of time for which I am sorry. I am working with our team to correct this problem. Again, if you have a plumbing need I hope you will give us another chance to earn your trust. Randy Anderson Owner."}, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "107322792048663983919", "name": "Albernetta Johnson", "time": 1576542106502, "rating": 5.0, "text": "He came here spotted the problem in less than 10 minutes. We’ve had multiple companies come out plan to dig our yard up and still couldn’t tell us the problem. He was very knowledgeable of the job he was doing.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "118247650106945822648", "name": "mark cassity", "time": 1589496066581, "rating": 5.0, "text": "Professional and on time.  I will use again if needed.  T.J. you da man!", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "103835634488060024789", "name": "sharonda mallory", "time": 1588267637793, "rating": 5.0, "text": "TJ Woods was very informative and professional. My service was on time and my expectations were exceeded.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "105509820040287795589", "name": "Sue Stalnaker", "time": 1588031279627, "rating": 5.0, "text": "Awesome and honest people to do business with, at a very reasonable price", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "109822108777406536475", "name": "Ronald Burton", "time": 1595284722103, "rating": 5.0, "text": "The worker TJ was awesome and helping up", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "113506727012740346521", "name": "Kelly G", "time": 1550517857351, "rating": 5.0, "text": "They were very personable, polite and professional. He answered all the questions that I asked and was very knowledgeable. He made sure he answered all I asked. He fixed all my problems. I will definitely use again. I recommend them to everyone.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "118441902861721010143", "name": "Misty", "time": 1576506227460, "rating": 5.0, "text": "Easy scheduling on-line. Arrived when scheduled. Professional. I will use again.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "105937706873333041961", "name": "Jaclyn Robinson", "time": 1545876939772, "rating": 5.0, "text": "Plumber was very professional in interactions.  He came out before to provide an estimate with no pressure.  He showed up when he said he would and pretty much did what he said he would.  He kept me informed of any changes or new developments and provided me with multiple options to pursue.  I definitely left with a positive image of Roto-Rooter and will look to use them again in the future.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "101464573627872797431", "name": "Arleen Krizka", "time": 1581977630940, "rating": 5.0, "text": "He was on time, quoted me a price and did the work the same day. Very pleased and would not hesitate to use them again.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "109461161296488744894", "name": "Kameron Mizzell", "time": 1571181413162, "rating": 4.0, "text": "When I called I had someone here within 45 minutes. Very informative, very professional, and most importantly they care about their customers.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "117882017885677165829", "name": "David Fuller", "time": 1615517500601, "rating": 5.0, "text": "Extremely professional, friendly & competent technician. Michael did a great job & I would be happy to call on him again should my family have a plumbing need. Thank you.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "108653986855572368744", "name": "Mike Pollard", "time": 1587155793966, "rating": 5.0, "text": "Home owner was very pleased with the results and of the young man who performed the service,", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "116477320197938423745", "name": "Randy Stevens", "time": 1586811808662, "rating": 5.0, "text": "TJ worked the drain problem until it was fixed. I am very pleased with the results.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "114828868768016834884", "name": "LaDawn P - SANE", "time": 1575050846183, "rating": 5.0, "text": "We had a Thanksgiving day football accident that resulted in a busted water line. Roto Rooter was awesome and got us all fixed. :)", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "115366376344051214772", "name": "Elvin Perez", "time": 1609108422206, "rating": 5.0, "text": "Extremely professional and knowledgeable", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "107904569989185575985", "name": "Odessa Macon", "time": 1551401375575, "rating": 5.0, "text": "I’ve dealt with this company before several years ago but it was a different owner and I decided to call a again. The receptionist was nice took my information and told me the time and who would be coming to fix the problem. The service personnel contact me and arrived on time to go over what was needed to be done and the cost of repair. Every thing went well and I was pleased with the service.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "104421034345569711690", "name": "DEMARION Whiteside", "time": 1552297176350, "rating": 5.0, "text": "Roto Rooter was very professional and quick. The job was done very quickly .Thank you! I would recommend anyone to you guys.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "114941330335685898155", "name": "Steve Daingerfield", "time": 1590020732886, "rating": 1.0, "text": "Don’t know what they are doing with water damage.", "pics": null, "resp": {"time": 1590027542797, "text": "Hi Steve, I am sorry you had a bad experience but I don’t have any record of our company doing any work for you. Could you have us confused with someone else?"}, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "111452222370167059674", "name": "TheUS ofLeland", "time": 1537308556994, "rating": 5.0, "text": "Hunter Stephens came by. Very knowledgeable and very professional and when it came time for payment, I still got to keep both my arms and legs!! Roto Rooter cost me approximately $50 less than the lowest quote I had received, regarding this job! Thanks!! If I need plumbing services again, I know who to call!", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "115946446251963867841", "name": "Syd", "time": 1572122590068, "rating": 5.0, "text": "Great Experience. Was here in no time to fix issue.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "111480477702343014650", "name": "Roxannie Hutto", "time": 1545353227611, "rating": 5.0, "text": "They sent 2 great men who didn’t give up to figure out what’s problem. I definitely will give a call again if there’s problem. Friendly and willing to discuss about the situation clearly. Many thanks!!", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "103969657799366764272", "name": "Faye McMillian", "time": 1589068281223, "rating": 5.0, "text": "The Young Man Was Very Professional And Polite, He Solved My Problem With Ease. Thank You! Roto Rooter!!", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "107367130072696399303", "name": "Mike Yeager", "time": 1537394794584, "rating": 5.0, "text": "Hunter contacted me and showed up at the agreed time. Asked a few questions and gave me a estimate which I ok'd and he got right to work. Was very professional and polite. Job well done in record time. I definitely recommend these services.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "105612247302499765765", "name": "Melissa Wilson", "time": 1585568467672, "rating": 5.0, "text": "Very fast response and easy to work with.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "109785883674579688784", "name": "Jeff Bost", "time": 1534527585543, "rating": 2.0, "text": "The service man that met me at the house was 10 min late which is no big deal.  He was friendly and was 6-7 out of 10 for his knowledge of well systems.  I chose to use home advisor to contact professionalplumbers for me because it was advertised that I was to receive a free estimate for any repairs and/or services.  I then was informed at the end of his time at the residence that I would be responsible for a $122 service call fee.  Honestly it feels like a scam.  I would have never given permission for roto rooter to come here knowing this.  He was here for about an hour and 10 min. and I helped by running back and forth opening valves and turning off power to the pump.  Information is the key to good reviews and making money off of honest people...otherwise businesses are cheats and dishonest.  You have to decide as a business which you desire to be.  You will only be able to fool people who don't know any better.  It's a sad day for consumers when businesses drop to this type of low.", "pics": null, "resp": {"time": 1534532149514, "text": "Hi Mr Bost, thanks for your feedback.. I reviewed this with our Plumber and while he did perform the service he charged you for, he did not get your written approval to do the work. As such, I have removed the bill from your account. We are in the service business, our folks are trained to solve your problem.. As you said we invested over an hour of our time doing the job for you. All the best. Randy Anderson President."}, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "101885698926114687787", "name": "Vernon Marable", "time": 1545097227091, "rating": 5.0, "text": "The guys were very nice and professional.  They diagnosed the problem and explained it to me where I could understand what was going on. I highly recommend Roto-Rooter Plumbers.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "118052209017486232094", "name": "Brittany Hendrix", "time": 1530885428742, "rating": 5.0, "text": "JP truly did an amazing job fixing the two leaks my home had in the kitchen and bathroom. He had the job finished the same day he came out to do my inspection. Within just a few hours, he was finished and the work he did looks amazing!! Could not be more happy with the end results!", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "105516390856486707202", "name": "Alan Miller", "time": 1548538616410, "rating": 5.0, "text": "Glenn was more than professional. He did everything possible to fix my plumbing problems. I am very satisfied. I recommend Roto-Rooter for your plumbing problems.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "100940361416023581762", "name": "Emily Conover", "time": 1570308961744, "rating": 5.0, "text": "T. J. was professional and thorough  - friendly and polite.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "116521467496531881153", "name": "daniel Shelton", "time": 1545773649086, "rating": 5.0, "text": "Very good service and attitude. Even on Christmas day Glenn Jennings went above and beyond. Definitely recommend and will use in the future.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "117824855090591756735", "name": "Shila Abney", "time": 1558787912381, "rating": 1.0, "text": "Didn't show till hours later and lady on the phone was rude", "pics": null, "resp": {"time": 1558807966799, "text": "Thanks for your feedback.. I reviewed the dialog and found that we were late in servicing your needs. I have taken steps to improve our level of service. Please accept my apology. Randy Anderson"}, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "116749455311279832875", "name": "Robin Woolsey", "time": 1622837016084, "rating": 5.0, "text": "Appreciate the speedy and professional service.  Glenn is always so helpful and candid about what needs to be done to solve my plumbing issues in the most economical but thorough way.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "103344931188501020651", "name": "Stacey Spears", "time": 1540996168633, "rating": 5.0, "text": "Even though we had a few issues with our \"special\" hot water heater, Tim was very professional and knowledgeable in the replacement.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "117155602836686502541", "name": "Eunice C", "time": 1537889580539, "rating": 5.0, "text": "A picture text was sent to me before the Tech arrived. Technician was on time. He was professional both in appearance and in the way he communicated with me.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "111014039694844849859", "name": "Renee Blair", "time": 1547842928124, "rating": 5.0, "text": "Technicians were knowledgeable and friendly. They thoroughly explained the problem and were able to repair this issue quickly.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "117455260421334280419", "name": "Angela Glass", "time": 1576368880012, "rating": 5.0, "text": "The technician alerted me when he was on his way. He was very professional and worked hard to get the job done. He cleaned up afterwards as well.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "110083316014817824999", "name": "Ellen Peck", "time": 1537033392080, "rating": 4.0, "text": "The plumber that came out was great- very knowledgeable and efficient, explained everything clearly. My only complaint is that I called early in the morning and he couldn’t get here until after 4pm.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "111272327842749104748", "name": "Matthew Weathington", "time": 1546067066973, "rating": 5.0, "text": "Glenn Jennings was my technician (plumber). Before he arrived I received a text notifying me that he was on his way, and a picture of him so that I knew whom to expect. His appearance and attitude were extremely professional. Glenn is an excellent communicator who kept my expectations as a customer, right where they needed to be. An honest man with a work ethic like Glenn’s is not only a rare treasure, it was inspirational. He always answered his phone if I had a question. It was a pleasure to listen to his knowledge and expertise. I really can’t say enough good things about this man and the company for whom he works. I would recommend Roto-Rooter and/or Glenn Jennings to anyone with any plumbing/water/etc. issues. He is certainly an irreplaceable asset to any of Roto-Rooter’s potential customers. I will definitely call Roto-Rooter/Glenn Jennings first with any plumbing needs I have in the future. Needless to say, they both come HIGHLY recommended.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "116171386613015531740", "name": "April Kennedy", "time": 1541697599957, "rating": 5.0, "text": "The tec was real professional. Did the job in a timely manner. I will have Roto-rooter do all my plumbing needs", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "116847632827403778853", "name": "Gary Shelton", "time": 1530314189665, "rating": 5.0, "text": "Everything went very well, if the  sink stays unclogged I consider that well spent money. And with the guarantee in sure that I will stay very satisfied.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "113843632545222564238", "name": "Andy Nevala", "time": 1534274686467, "rating": 5.0, "text": "Cameron spent three days working on our pipes in a difficult situation - saw it through to the end.  I will always call these guys first. The bill came in way less than I was anticipating for all the work they did. I used a local guy at first and He charged almost as much just to spray water in my clean out. Rotorooter came in, identified the problem, and corrected it.\n\nAlways go with the Nationaly licensed and insured company. Worth every penny.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "111871152251787620329", "name": "Katrene Chatman", "time": 1548915514955, "rating": 5.0, "text": "The technician was timely,  friendly,  and professional.  He repaired my problem and was very knowledgeable about his work.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "114709507125090200011", "name": "Daniel Prater", "time": 1554755596136, "rating": 5.0, "text": "TJ was very professional and nice, he does great work!", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "106266862284800508767", "name": "Linda Smith", "time": 1543743673712, "rating": 1.0, "text": "Believe all the bad reviews,  I will be writing a second review after review our cameras. 2 visits, 1st friendly techs, 2nd visit head tech absolutely unprofessional to the point his helper had to apologize, worst in class in all areas. I wish I took the time to read the reviews. #Criminals #Crooks #Thieves #Liars #LowClass #LackingSkill #Unprofessional #DoomedToRepeat #DefinitionOfInsanity", "pics": null, "resp": {"time": 1543939386147, "text": "Hello Linda Smith, first I am sorry you had a bad experience. I would love to resolve it but I am unable to find you in our services database. We send out Google review requests to all our customers after service but your review did not come through that process. If you would please respond with your service address or call our office then I can work to resolve your issues. Thanks Randy\n\nPart 2, No response from Linda Smith, no record of doing work for you.. we did discharge a plumber with the last name of Smith for dishonesty with a customer, so we can assume that you are related and your complaint is the result of his discharge."}, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "110042904492591180639", "name": "Patrick McGinnis", "time": 1541873698475, "rating": 5.0, "text": "Service was great technition was on time professional and polite would recommend them to anyone who needs a plumber", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "110352856524983319864", "name": "explorethejourney", "time": 1532368235208, "rating": 5.0, "text": "Great job! Proficient and on time. Definitely use them again!", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "114967327239084595629", "name": "Derric Lewis", "time": 1535823774571, "rating": 5.0, "text": "Glenn was very informative about the service being performed before serving the appliance", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "117482043184177465395", "name": "Pielikeme", "time": 1524007474680, "rating": 1.0, "text": "Made an appointment they told me they would come between 1pm-5pm and never called or showed up. I called the office and they called me a liar and totally disrespected a loyal customer. Corporate should revoke their franchise.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "104268856312685115456", "name": "Tina Diamond", "time": 1617406794354, "rating": 5.0, "text": "Good efficient service an solved the problem.  Price wasn't over the top.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "111119738765017848333", "name": "Angie Strickland", "time": 1545004913908, "rating": 4.0, "text": "Once the plumber was able to get here, service was awesome! Get him here was sad!", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "115833680016781771178", "name": "William Thompson", "time": 1539643099542, "rating": 5.0, "text": "Very polite and professional pleased doing business with you thank you", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "108213527886697986553", "name": "MichaelS Green", "time": 1554391548584, "rating": 5.0, "text": "Very respectful will use them again", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "101982422344984163412", "name": "Ardelan Shabani", "time": 1527979194315, "rating": 5.0, "text": "Quick fix great job also 30 day warranty.  A ++", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "104573634283304039815", "name": "Ron", "time": 1567063074388, "rating": 1.0, "text": "Have mold after they tried cleaning up water.", "pics": null, "resp": {"time": 1567088470057, "text": "Hi Ron, I am sorry you are having a problem but we don't have a record of working for a \"Ron\" in the last weeks. Please contact our office at your earliest so we can resolve your issue. Randy"}, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "105456875083156028357", "name": "David Turley", "time": 1579548897649, "rating": 5.0, "text": "Friendly", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "111409189765133424263", "name": "Verna Seals", "time": 1567624462749, "rating": 5.0, "text": "Excellent service", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "102851371153180942226", "name": "Kingsley Harbor", "time": 1593900180353, "rating": 5.0, "text": "Excellent", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "116253049922310531129", "name": "Macius Darkwood", "time": 1527716651641, "rating": 5.0, "text": "Thank you for the timely work.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "100356531557668631261", "name": "Terri Smith", "time": 1546360652658, "rating": 2.0, "text": "Prices are to high..\nWould not recommend or refer anyone.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "111289679507180539334", "name": "christi mullins", "time": 1515719141118, "rating": 5.0, "text": "Great people!", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
{"user_id": "117623808952424420700", "name": "Randall Chance", "time": 1534346091541, "rating": 5.0, "text": "Great fast service.", "pics": null, "resp": null, "gmap_id": "0x888bb394cec8c6e9:0x497830eceafe680f"}
