{"user_id": "104545352891521674525", "name": "Crystal Hulskotter", "time": 1603392937986, "rating": 4.0, "text": "Great job and very reasonable price.", "pics": null, "resp": null, "gmap_id": "0x8886027362c8e879:0x4b6650305da2e1b7"}
{"user_id": "107961455088291438717", "name": "Roderick Martin", "time": 1595619757496, "rating": 5.0, "text": "Very Friendly And Professional Service", "pics": null, "resp": null, "gmap_id": "0x8886027362c8e879:0x4b6650305da2e1b7"}
{"user_id": "117951108868919689029", "name": "Margaret Martin", "time": 1568760128913, "rating": 5.0, "text": "Best price you can ask for very nice worker", "pics": null, "resp": null, "gmap_id": "0x8886027362c8e879:0x4b6650305da2e1b7"}
{"user_id": "108931570773550599791", "name": "Lissa D", "time": 1561040192317, "rating": 5.0, "text": "Friendly staff, reasonable prices, and prompt service too!", "pics": null, "resp": null, "gmap_id": "0x8886027362c8e879:0x4b6650305da2e1b7"}
{"user_id": "107162808896865978899", "name": "Demetria Cass", "time": 1533328449391, "rating": 5.0, "text": "High quality work and very affordable. Color me impressed.", "pics": null, "resp": null, "gmap_id": "0x8886027362c8e879:0x4b6650305da2e1b7"}
{"user_id": "108206941046389520167", "name": "Debra Bell", "time": 1569368636018, "rating": 5.0, "text": "Friendly and very professional", "pics": null, "resp": null, "gmap_id": "0x8886027362c8e879:0x4b6650305da2e1b7"}
{"user_id": "115440975983490410315", "name": "Donita Cox", "time": 1614030053803, "rating": 5.0, "text": "Christina is a very good seamstress. She always calls to let you know that your garment is ready and it is done in a timely and professional matter. She doesn’t over charge for her service. She is my go to lady when I need something fixed or custom made.", "pics": null, "resp": null, "gmap_id": "0x889a0e16c2ed7d2b:0x5cddc6f062df4b9"}
{"user_id": "107166548155242951437", "name": "Max Jay Weston", "time": 1606413154636, "rating": 5.0, "text": "Owner is very personable and conscious. Alterations were done before time promised and work was excellent.", "pics": null, "resp": null, "gmap_id": "0x889a0e16c2ed7d2b:0x5cddc6f062df4b9"}
{"user_id": "105158168719372378825", "name": "Heather Jackson", "time": 1548319564847, "rating": 5.0, "text": "This is our go to seamstress in Foley! She has great turn around time, extremely fair prices and her work is amazing. I have no idea why there are so many negative reviews! We’ve had a great experience for the 2+ years we’ve used her. She has altered cheer uniforms, regular clothing and formals for us.", "pics": null, "resp": null, "gmap_id": "0x889a0e16c2ed7d2b:0x5cddc6f062df4b9"}
{"user_id": "102255813927408041498", "name": "Debra Desverreaux", "time": 1569584420778, "rating": 5.0, "text": "Great work! I have had her do formals, jeans, dresses. She is amazing", "pics": null, "resp": null, "gmap_id": "0x889a0e16c2ed7d2b:0x5cddc6f062df4b9"}
{"user_id": "115843702105391920479", "name": "Sarah Stack", "time": 1485090704184, "rating": 1.0, "text": "I dropped my wedding gown off to Christine a month before my wedding. She planned to \"let out 3 inches\" of the waistline. I called her shop to check the status of my gown the day I was told it would be finished and she implied to me that she hadn't even started altering it yet. She asked for 3 more days (making it 10 days before my wedding day). 3 days later I went to try on my dress and I could not even remotely zip up the entire top half of my dress ( which was not the case when dropped it off to her..I could not comfortably zip it up and maybe had 1\" that I couldn't zip). I believe she took it in 3\" instead of letting it out. After informing me there was no fabric left to let it back out, she then proceeded to embarrass me in front of other people in her shop. She asked if I could find better undergarments to \"suck all of that in\". When I replied that apart from removing a rib or two this is as good as it gets for me, she said \"honey...there is more than just ribs going on here.\" She said \"I can't think of anything to fix this. If I do, I will call you in the next two days.\" I did everything I could to leave as fast as possible so I could get in my car and cry. Thank goodness for Dillard's having formals and I found a decent replacement the next day (9 days before my wedding). Regardless of her skills as a seamstress on other projects, I will not recommend or return to Christine.", "pics": null, "resp": null, "gmap_id": "0x889a0e16c2ed7d2b:0x5cddc6f062df4b9"}
{"user_id": "117157464757153902903", "name": "Debbie Desverreaux", "time": 1573162155659, "rating": 5.0, "text": "I have had many things altered by her and have been happy with everything she has done. I recommend her !!!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a0e16c2ed7d2b:0x5cddc6f062df4b9"}
{"user_id": "108545504210582499203", "name": "Christy Davis", "time": 1571334658076, "rating": 5.0, "text": "Very helpful and quick turn around time!", "pics": null, "resp": null, "gmap_id": "0x889a0e16c2ed7d2b:0x5cddc6f062df4b9"}
{"user_id": "111527115623972294779", "name": "John Westendorf", "time": 1544746963002, "rating": 5.0, "text": "This lady is great and full of personality.  HIGHLY RECOMMENDED", "pics": null, "resp": null, "gmap_id": "0x889a0e16c2ed7d2b:0x5cddc6f062df4b9"}
{"user_id": "103112675393633852426", "name": "Brxken Hexrt", "time": 1503429130230, "rating": 1.0, "text": "I had done business here before so I went there in July for a September wedding it's August 22 just got suit back first time it was supposed to be ready she had not started it so we waited again when we went to pick it up the plate on left side of pants was folded over and sewn to the part that covers zipper. Instead of addressing the error she wanted to argue with me very rude in front of other customers that came in and my kids trying to make me look like I was the problem only to admit she did so it when my husband took the pants off and i began examining the alterations and threads hanging that she didn't trim off which matched exactly the threads used to sew the plate to the zipper cover even after admitting this wanted to insist I was rude I'm lije no ma'am I kept trying to ask you about this and told you it wasn't like that before she tried to say someone else must have done that I said no ma'am it's never been altered before coming here. The alteration was mainly to take in the seat and well needless to say it wasn't done right she still charged me full price and he can't wear this suit without further alterations. I'll never go back there she's ugly person has no idea about alterations on a suit.", "pics": null, "resp": null, "gmap_id": "0x889a0e16c2ed7d2b:0x5cddc6f062df4b9"}
{"user_id": "118216180320864768567", "name": "Alabama Coast", "time": 1517530592514, "rating": 5.0, "text": "Christine is a lifesaver. Embarrassed by having to bring my \"consignment store\" gown in at the last minute, she smiled and said \"I will take care of you!\". What a blessing!!", "pics": null, "resp": {"time": 1536875550257, "text": "Thank you very much for taking the time to leave your feedback. We value your business."}, "gmap_id": "0x889a0e16c2ed7d2b:0x5cddc6f062df4b9"}
{"user_id": "102197223712572569017", "name": "Melissa F", "time": 1436388057866, "rating": 1.0, "text": "I needed a bridesmaid dress taken out a little and hemmed, when I arrived she rudely told me to put the dress on so she can see what we have to work with, when I came out of the dressing room she was grabbing at the sides of the dress and acting like it was the most stressful task she had ever encountered. She kept saying \"oh, I can't do ANYTHING with this\" and \"Can you lose any weight before the wedding?\" By the time I left her establishment, I was in tears... As I was leaving she looked at me with pitty and told me she \"will pray for me\".  No thank you, I don't need your \"prayers\", I need my dress fixed.\nTwo good things did come from this awful experience- First- I did find an amazing friend that was able to corset the back of my dress and make me feel wonderful in it. And second... I learned how to sew so I could fix my own clothes without ridicule.\nI do NOT recommend this woman... Not after the way she made me feel about gaining a few pounds.", "pics": null, "resp": null, "gmap_id": "0x889a0e16c2ed7d2b:0x5cddc6f062df4b9"}
{"user_id": "115295593253109766276", "name": "matsi hound", "time": 1357752558335, "rating": 2.0, "text": "This woman's carelessness resulted in ruining the only wedding that I will ever have. She is extremely unorganized. She took my wedding dress home to work on (says she doesn't work on formals in her shop) and then put it in her unlocked car overnight and it WAS STOLEN TWO DAYS BEFORE MY WEDDING!!!! Or so she says. I think she just messed up on it or procrastinated and didn't do her job so she just made a phony report and cashed in on her business insurance. Either way, no I will never be back and if you do business with her, I pray that she does not shatter your dreams like she did mine.", "pics": null, "resp": null, "gmap_id": "0x889a0e16c2ed7d2b:0x5cddc6f062df4b9"}
{"user_id": "100779397085453122914", "name": "Denise Wood", "time": 1521996223855, "rating": 1.0, "text": "Had an expensive, sleeveless blouse taken up in the shoulders.Tried it on at  Christine's where she pinned it.When I got it back she took it up twice as much as pinned and it was not wearable.My arms could not move in it.", "pics": null, "resp": null, "gmap_id": "0x889a0e16c2ed7d2b:0x5cddc6f062df4b9"}
{"user_id": "100734923312528273151", "name": "Angela Wingard", "time": 1498855529001, "rating": 1.0, "text": "Holy crud....she is so unprofessional, very rude...", "pics": null, "resp": null, "gmap_id": "0x889a0e16c2ed7d2b:0x5cddc6f062df4b9"}
