{"user_id": "110406628034835889541", "name": "David Sanders", "time": 1626402525012, "rating": 5.0, "text": "My experience with this school has been top rated. All instructors go above and beyond to make sure you get your CDL certification. They make you feel at home and make sure that you know that once you commit to this school…your more than a student….your part of the family!! I love this school and if your thinking about getting CDL certified …this is definitely the school you want to go to!!!!!!!!!!!", "pics": null, "resp": {"time": 1627307326536, "text": "Thank you David for the kind words and other than training you to becoming a successful and safe Truck Driver we thrive on trying to make everyone feel like family. Thank you for choosing Premier Driving Academy to obtain your Class A CDL and good luck."}, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "105592371893876678580", "name": "David Prescott", "time": 1627196400949, "rating": 5.0, "text": "Great CDL training program. The training staff are amazing and willing to help you obtain your CDL. If your thinking about or wanting to attend a CDL class this is the place to go! Hands down the best! Call and go by Premier and talk to them about the training courses they have to offer.", "pics": null, "resp": {"time": 1627307032549, "text": "Thank you David for the kind words and choosing Premier Driving Academy to obtain your CDL. Good Luck!"}, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "112583407431493835616", "name": "Rebuut Liberty", "time": 1622148633954, "rating": 5.0, "text": "My name is Ruben Quartana. I started Premiers Driving Academy accelerated program on May 22nd a Monday. It’s May 26th a Thursday and I just obtained my CDL Class A drivers license. Russel, Josh, Wayne and the rest of their staff is responsible for training me and 3 other fellow pipeline employees which subsequently garnered us a commercial drivers license. 3 DAYS and tested on the 4th day.. I’ll say that again 3 DAYS. and tested on the 4th day. We passed. Collectively we had ZERO experience driving a tractor/trailer. With their professional knowledge and their ability to work one on one with us, stay late on their own time with us, and allowed us to draw from their experience we sit here today CDL Class A Driver’s. Folks this is a testament to this companies ability to teach lifetime skills for a lifetime job. The proofs in the pudding. They put knowledge into action and succeeded with us 3 pipeliners. I’m amazed. I’m floored and I’m forever greatful to the Premier Team in Theodore Alabama", "pics": null, "resp": {"time": 1623849142143, "text": "We strive to do the best we can but, ultimately it is up to you guys. We thank you for all your hard work and time you put in when you are with us. It is students like yall that make us enjoy what we do. Good Luck and again thank you for choosing Premier Driving Academy."}, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "108425338524165710793", "name": "Josh Harden", "time": 1605679859713, "rating": 5.0, "text": "I had a great experience here. Everyone is friendly. The front desk staff are very helpful. I have never in my life had teachers as invested in my success as the ones I had here. You cannot go wrong if you choose to attend this school. They will get you your CDL.", "pics": null, "resp": {"time": 1605731230646, "text": "Thanks so much for the kind words. We strive to be the best we can. We like to have fun but work hard to. Good Luck!!"}, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "101713101554395096749", "name": "Crystal Farris", "time": 1615728840689, "rating": 5.0, "text": "My brother and I . Did the one week course as we already had permits and some experience . They showed us a lot of tips and things to watch when driving . Worth the money . Thanks  Chris , Russel, and Tim .", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "112507189168798335647", "name": "John Bellard", "time": 1617812697241, "rating": 1.0, "text": "This place claims that a 40 hour driving course is required by law to road test for a CDL. This is not true and they are only trying to sell their program to unwitting new drivers. You dont need anything but a permit and to provide your own truck to test for your CDL and do not have to pay any school for instruction. Do your homework people and dont let people like this lie to you.  To be fair however, if you need instuction, on site testing, and evaluation, a driving school is the place to go. Just be aware it is not required by law.", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "105662675291273557942", "name": "Chris Ingram", "time": 1617154137387, "rating": 5.0, "text": "Great instructors they make you feel like you are the most important person and really make you feel like family.", "pics": null, "resp": {"time": 1617198622066, "text": "Thank you Chris! We really enjoy what we do. It's a family ran Academy and we strive to make everyone feel like their part of that family."}, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "107976323589007526683", "name": "Fearless Christian", "time": 1595437079468, "rating": 5.0, "text": "Great family atmosphere in which I really enjoyed. Relaxed feel but at the same time serious about teaching you what you need to know to get your CDL. I loved it. If you need to find a training program that is focused on getting you started in truck driving and want to have fun while doing so I would definitely recommend Premier driving academy.", "pics": null, "resp": {"time": 1605221782282, "text": "I am so glad you enjoyed your time with us. We try our best to keep it family friendly but also work hard. Good Luck out there. Like we say at Premier Keep the shiny side up!"}, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "114169228370710004403", "name": "Tonya Sykes-Bilbo", "time": 1592575091357, "rating": 5.0, "text": "GREAT TRAINING FROM THE INDIVIDUAL TRAINERS.  THEY TEACH YOU THE FEDERAL RULES AND REGULATIONS AS WELL FROM THERE PERSONAL EXPERIENCES. YOU WILL FINISH THIS COURSE WITH A BETTER VIEW ON DRIVING. WHETHER WOMAN OR MAN AFTER TAKING THIS COURSE YOU WILL HAVE THE DETERMINATION TO BE A PROFESSIONAL DRIVER.", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "118204081111647637336", "name": "clairy kengeye", "time": 1592599080564, "rating": 5.0, "text": "If you want to drive proper,this the place to go. The instructors gives you Quality and proper hands on learning, honest you can stop research from here, next step is to start class here on Monday 😃 you will thank me later.", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "106364563651594448483", "name": "Jacob Patterson", "time": 1592522817249, "rating": 5.0, "text": "Their staff are worth their weight in platinum. If you are willing to show up and learn, they will do whatever it takes to get you prepared to test for your commercial driver's license. By the end of my run here, I felt like I had earned not only a cdl, but a family that truly cared for me and my future.", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "101505050941098188521", "name": "Timothy Dixon", "time": 1592586529157, "rating": 5.0, "text": "Excellent school.  The instructors are experienced,  patient, and willing to answer any question you throw at them.  It is hard work but you will get your CDL if you go here.", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "111293572046401204761", "name": "anthony cerillo", "time": 1579120824834, "rating": 5.0, "text": "not only did they get me my class A cdl license but I also had a great time in school. The instructors care about you and want you to succeed .  I made friends, had a lot of laughs and enjoyed my time there. They even have recruiters visit and you can line yourself up a career before you even get your license.", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "104960768257332666962", "name": "DACIA LEIGH PRINE", "time": 1547566814520, "rating": 5.0, "text": "This place and the people that work here are amazing people! They teach you everything you need to know and have fun while doing it! They don't rush you to get out because they know everyone learns at a different pace. If anyone wants to earn a CDL and have job placement after graduation,this is by far the best place to go!", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "108197363505054436435", "name": "Jacob Malone", "time": 1581031770535, "rating": 5.0, "text": "Every last instructor they have is the absolute best. They got me fully trained in less than 4 weeks. I had fun every single day I was there. I also want to add that the tester is a very good guy. The director Mr. Russell is truly a god given person who will work with you every single step of the way. Josh an instructor is also one who make sure you dont leave the yard until you have the skills. My favorite of all time is Mr. Dave a.k.a push push I will always remeber those moments. I cant leave out Wayne Mike And Mr. Bill. I truly thank all yall for your help.", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "108528026385332178604", "name": "Glenn Oller", "time": 1595040671736, "rating": 5.0, "text": "Good school cares about students that cares about learning!", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "104963171068957375350", "name": "Tiffany Lazzell", "time": 1601577988046, "rating": 5.0, "text": "Great instructors fun environment", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "115518835655388019953", "name": "Darnell N", "time": 1560253142826, "rating": 1.0, "text": "Worst school ever. If I could give them a \"0\" star I would. Don't teach you anything. Don't teach pretrip, students learning on there own, and to expensive. Paying these guys $5300.00 for nothing just to use their truck. I recommend ESD.", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "107465813898031079855", "name": "Chris Burt", "time": 1569878299180, "rating": 5.0, "text": "My wife went through and loved it..now we team together", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "106688482962302800207", "name": "Nathalie Valley", "time": 1399657273623, "rating": 5.0, "text": "I hired Mr. Johnson, the president, to coach my daughter prior to her driving exam. We spent a total of 4 hours over a period of 6 weeks driving and practicing the exam requirements. She passed the first time. We know she could not have done so well without Mr. Johnson's help. He is patient, knowledgeable, and corrects mistakes right away. I strongly recommend Mr. Johnson's expertise to other parents and their young drivers.", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "106393294805396439974", "name": "Slavic Kozyuk", "time": 1498236266581, "rating": 5.0, "text": "Great staff that cares for it's students, never a dull moment with Russell. Truck driving requires serious attitude, if you want to learn and earn a new career path I highly recommend PDA!", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "118052335378945253999", "name": "Wayne Simon", "time": 1543063694618, "rating": 5.0, "text": "They set up my son for school and now he driving. The made he didn't have any problems getting his license.", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "112995713288081481831", "name": "ms crum1", "time": 1529471881966, "rating": 5.0, "text": "Was fun and was able to get my certificate and CDL in 7 wks. Now if your a quick study and at school everyday I've seen people do it in a week!", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "106796302900865035508", "name": "Tiffany Curry", "time": 1531253451021, "rating": 5.0, "text": "Great school ..fun and great experience..I meet my Husband there 2011 and now its 7 years counting. Fav teachers: Buster(rip), Wayne, Russal Marshall MR JESSIE😀 and Ms Sandra in the front office..Great staff!", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "108522953009729071062", "name": "Thomas Phillips Jr", "time": 1542999960534, "rating": 5.0, "text": "They help me get my cdl and was very helpful throughout my entire time I was in  school and didn't rush me through it", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "100618296729005165141", "name": "King Jay", "time": 1464731976855, "rating": 5.0, "text": "Great driving academy for your cdl. They teach you the correct way and really care about your success. Awesome place.", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "109976110479349284397", "name": "一Lee", "time": 1495019340195, "rating": 5.0, "text": "Excellent staff, overall experience was great! :D", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "109698919245530967197", "name": "RUSSELL PILLING", "time": 1543002700165, "rating": 5.0, "text": "I like the family atmosphere", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "111457985419895871018", "name": "reginald wheaton", "time": 1529457863344, "rating": 5.0, "text": "Successful training program.", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "105298315802339542962", "name": "Kenneth Curtis", "time": 1473458179487, "rating": 5.0, "text": "Great rus got that", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "110810278176579241551", "name": "Alison", "time": 1549071459997, "rating": 5.0, "text": "Grate friendly staff...", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "107502576923237230026", "name": "Nereus Jackson", "time": 1449104981840, "rating": 5.0, "text": "Awesome school", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "100097772095906838392", "name": "Crooked Smile", "time": 1480386751150, "rating": 5.0, "text": "💯👌👀", "pics": null, "resp": null, "gmap_id": "0x889bb44ec8467863:0x336c4d33a27a676"}
{"user_id": "116762184284296041317", "name": "jason tidmore", "time": 1524604719985, "rating": 5.0, "text": "Ann is an amazing recruiter, also learned a lot from the whole team of instructors to set me up for my class a CDL.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOCIOz7dO-9GQw_GG_HH2De3sPlGRIDrG0kYXss=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMFkvSP70irPoReuL9cTsYkOLMz4Qmcg3g2ii7T=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNn1C6m2c7P4dCiWp_Olk-MM318crgvwu65eC8q=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88881fcd92df533f:0x92fd611066ae530c"}
{"user_id": "111429456163465796004", "name": "David Waldrep", "time": 1596415459068, "rating": 5.0, "text": "Good place to train ..thanks to all the teachers in March 2014 ...went by today and seen darell's son ...", "pics": null, "resp": null, "gmap_id": "0x88881fcd92df533f:0x92fd611066ae530c"}
{"user_id": "103230841209028663627", "name": "MickeyBeLit IGY6", "time": 1575831638749, "rating": 1.0, "text": "Get ready to pay close to 7k for broken and unusable trucks. Limited instructors to help teach. Inadequate training time due to the faulty equipment. And on top of that if you fail you have to pay $150 to retest. It's not worth it! And good luck getting a hold of them on the weekend, no one knows how to answer their phones. Got some cool instructors tho and of course racist ones too. 🤷🏾‍♂️🤷🏾‍♂️🤷🏾‍♂️", "pics": null, "resp": null, "gmap_id": "0x88881fcd92df533f:0x92fd611066ae530c"}
{"user_id": "106068323933295886587", "name": "Bubba Buford", "time": 1564928043871, "rating": 5.0, "text": "I got my CDL so I am happy. There equipment is very poor  but will work . And had a little drama going on between teachers . 2 were fired while I was there. But I think this is the norm with a lot of truck driving schools..", "pics": null, "resp": null, "gmap_id": "0x88881fcd92df533f:0x92fd611066ae530c"}
{"user_id": "112228624604502021016", "name": "Apostle Schwegman", "time": 1570062195623, "rating": 5.0, "text": "Not a driver but these people are awesome here. It's a close family environment. The instructors are great and treat you with respect. The owner and the rest of the office staff are awesome people and they want you to succeed in getting your CDL license. They will go the extra mile with you to help you obtain your CDL license. I very highly recommend this place for your CDL training.", "pics": null, "resp": null, "gmap_id": "0x88881fcd92df533f:0x92fd611066ae530c"}
{"user_id": "109556504505316829726", "name": "Tiffany Griggs", "time": 1548697510867, "rating": 5.0, "text": "They are a really great company to go through if you want to get your CDL. All the people there are very nice and helpful with everything. The thing about this company that meant so much to me is they all want you to succeed no matter what!", "pics": null, "resp": null, "gmap_id": "0x88881fcd92df533f:0x92fd611066ae530c"}
{"user_id": "101327377018238088589", "name": "Simon Brier", "time": 1503957780923, "rating": 5.0, "text": "Currently enrolled and love it.  Recommend this school to anyone seeking a CDL career.  The ladies in the front office are terrific.  Instructors are great and take care about each student.  Keep up the great work ATDT", "pics": null, "resp": null, "gmap_id": "0x88881fcd92df533f:0x92fd611066ae530c"}
{"user_id": "105788717387996285920", "name": "Timothy Blair", "time": 1524995735412, "rating": 1.0, "text": "Do you need just driving license and the cdl permit how do it works i got my drive license I'm trying to find a good school to go to and learn about trucks cause I'm now I'm a floor tech a Baptist hospital and I want to be come a truck driver", "pics": null, "resp": null, "gmap_id": "0x88881fcd92df533f:0x92fd611066ae530c"}
{"user_id": "106098771998297944446", "name": "youknowit158", "time": 1376921409355, "rating": 2.0, "text": "Their trucks that you learn in don’t work right half the time. You wait in line for sometimes HOURS just to spend a few minutes driving a truck, and it’s a good day if you get to drive a truck 4 times in the 9 hours you are there.  The training is a joke, what I mean is you are trained by other students who have been there 1 WEEK longer than you. You will hear that some people paid anywhere from $2800 to $5500 for the SAME TRAINING!  They tell you that you can get your CDL in 15 days, I guess that’s possible if you pay an extra $150 to take you're test early. Most of the people I know of took about 6 weeks to get their CDL. They do tell you that they will help get you a job and that’s part of what your paying them for, well I guess they do but the help is faxing an application, the same application you could fill out online. Overall a few of the trainers are good, however a few good trainers can only get you so far when the equipment doesn’t work right.  If I could do it over again I would not have gone to this school, I would have gone to the CDL school in Guntersville, al. This is just my 2 cents.", "pics": null, "resp": null, "gmap_id": "0x88881fcd92df533f:0x92fd611066ae530c"}
{"user_id": "113271626944219444904", "name": "Cynthia West", "time": 1541733042508, "rating": 1.0, "text": "You have a couple of great teachers but the other ones scream and make a scene Do not go here", "pics": null, "resp": null, "gmap_id": "0x88881fcd92df533f:0x92fd611066ae530c"}
{"user_id": "103020825865891927683", "name": "Michael Brown", "time": 1623561506190, "rating": 1.0, "text": "I went to this school in 2017 and was one of the lucky 5000 people who gotten their CDL cancelled bc the owner is a fraudologist. Been driving a semi for almost 4 years with no points or pull overs and over a million miles under my belt, but still have to take the road test again, after calling and asking the company how they plan on helping me retake this road test, there was nothing they could do!!!! THEY ARE THE CORRUPT MFS WHO GOT MY LICENSE CANCELLED WHY CSNT THEY PROVIDE A WAY TO GET THEM BACK AND SHOW HOW A TRUE TRUCKING FAMILY WORKS, THEIR GUILTY OF THEIR BS IS WHY", "pics": null, "resp": null, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "101979618835212756068", "name": "professor Snape", "time": 1614184893285, "rating": 1.0, "text": "This place has no standerd all to make a quick buck no real concern for education or saftey", "pics": null, "resp": null, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "105150465461066870825", "name": "Kristi Hill", "time": 1559678065915, "rating": 5.0, "text": "This school is so laid back. They give you all the information you need to be successful in this field. They didn't rush me in my training and let me test when I was confident in my driving skills. I would recommend this school to any one that's serious about getting a class A permit and CDL.", "pics": null, "resp": null, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "100871280718443621624", "name": "ncsouth", "time": 1598404337286, "rating": 4.0, "text": "A good place to learn to drive Semi trucks", "pics": null, "resp": null, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "104716044997204144372", "name": "John Thomas", "time": 1561507822965, "rating": 5.0, "text": "I been there on fourth week and learned a lot , u get out of what u put in it , I have successfully completed the course and now fixing to test in one month. Very knowledgeable people and staff. Thanks 😊", "pics": null, "resp": null, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "110083217725686934526", "name": "Darius Neal", "time": 1569294235419, "rating": 3.0, "text": "Just got a letter in the mail saying I have to take all my test over again after I have been driving almost 4 years.... great school but you might be taking your test twice.", "pics": null, "resp": null, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "117487928436183161081", "name": "Michael Artis", "time": 1569438678264, "rating": 1.0, "text": "CRST sent me to this school back in August of 2017 and I see the then owner has been indicted on bribery and wire fraud. Now because of his actions anybody who went through this school from 2/15 to 4/18 will have to retest....I've been driving 2yrs now and have to retest....I'm currently looking into seeing if CRST can be held accountable for sending me to that school.", "pics": null, "resp": null, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "108923158829581587432", "name": "T Harding", "time": 1572608713956, "rating": 1.0, "text": "I also received a letter today and learned that I have to take the entire skills test over having had my CDL A for 5 years bc this school was fraudulently paying the inspectors to pass their students. Terrible that is students have to pay for their fraud.", "pics": null, "resp": null, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "105210683636149770193", "name": "Ben Bezley", "time": 1539787586132, "rating": 1.0, "text": "Were should I even begin. First this place is a scam, the owner Jim Welburn  drives around in his little exotic car and acts as if he is untouchable. The place is ran down I wouldnt recommend anyone go here. Just read a few of the reviews and you will get a feel of what actually goes on . Ive had friends that told me about this place and i thought it would be a good try due to them giving you a job as soon as you graduated. But not how it goes one small mistake and you will have to be in court . the owner sues everyone that he can he is a money hungry selfish person . He doesn't care if your broke and are trying to come and get a cdl to provide for your family all he worries about is how he can take every penny you have . American Truck Driving Academy scale of 1to10. Your a -10", "pics": null, "resp": {"time": 1540302653044, "text": "Mr. Bezley, it was unfortunate to read your review.  We have researched our records and could not find any record of your attendance.  We have been in business for over 23 years and yes, we have had Students not pay for their training, after being trusted to do so.  So if you were in fact here, under a contractual agreement and you did not fulfill your contract, what other options does a business have?  I know when you complete a weeks works, you expect to be paid.  Well, we are no different, and when we complete those services or meet our contractual agreement, we too, expect to be paid.  Interesting. I was stopped on the road rendering service to a disabled driver, when one of my former Students of about 15 years past, stopped and offered his assistance as well.  He ask, how is business, naturally I said good, but sometimes I just feel like closing it down, with all the negativity......He said, think of all the people you have helped, literally thousands, so you are always going to have someone to take a dim view and it's usually someone who owes you money....keep the faith, and above all keep helping those who sincerely want to become a Truck Driver."}, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "116740641449482461598", "name": "Josh Davis", "time": 1537999442625, "rating": 1.0, "text": "I falled a drug test there , left the next day.This school has charged me 6185.00 for going there and falling a drug test. There scam artists and this is not a good school for people to go to. Don't get scamed, they force you to sign paperwork and don't give time to read it before you sign them. They put you in a ran down hotel in a bad area, charge you for food when you get there, plus there raciest flags everywhere. Black people and white people, this is a scam !!!!", "pics": null, "resp": {"time": 1540303355541, "text": "Mr. Davis, you failed a Drug Test, which you freely admitted.  The paperwork you mentioned is straight forward and further explained.  The Hotel, we had no control over, as this was the Company you had an agreement with, which sent you to our school.  Regarding our flags, we fly the American Flag, Alabama State Flag, and a Retired Veterans Flag.  Please visit our photos to view.  Again, it is unfortunate you were not able to complete your training, but I am sure you will agree, no one from American Truck Driving Academy assisted you in your indulgence to have a foreign substance placed in your body, causing you to fail a Drug Test."}, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "102169377363638804031", "name": "Krispy", "time": 1473256717105, "rating": 4.0, "text": "Look if you go there to learn and get on with your life, this is the place for you. If they can train you on sub par equipment you can succeed anywhere in life. Too many people showed up and treated it like it was a game because it wasn't luxurious. Show you're serious about it and instructors match it. At least that's how it worked for me. 24 days and I was outta there.", "pics": null, "resp": {"time": 1524705556443, "text": "We're glad that you were satisfied with your experience. We are continually working to improve our facility and training equipment to enhance the learning experience of our students. We try to train students in older equipment to prepare our students for any possible challenges. We do maintain a serious environment, because we want all of our students to be safe and successful upon leaving our training program.\nBest wishes!"}, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "114956611176062410641", "name": "Casey Brumbelow", "time": 1460553902751, "rating": 3.0, "text": "So I went here to get my cdl and I notice a few things wrong.\n\n1. The instructor in the classroom won't teach you everything that you need to know. Went on a Thursday and failed the whole test. So I studied for retest on my own and went back on Friday and passed 2 out of 3.\n\n2. Classroom is falling in.\n\n3.busses have more problems\n\n4. Will be in older trucks on the backing field\n\n5. They are rude people.\n\nSo rethink about it", "pics": null, "resp": {"time": 1524705678175, "text": "We're sorry that you were not completely satisfied with your experience. We are continually working to improve our facility and training equipment to enhance the learning experience of our students. We try to train students in older equipment to prepare our students for any possible challenges. We do also encourage our students to ask our instructors questions if there is anything unclear in the training to pass the tests. We do maintain a serious environment, because we want all of our students to be safe and successful upon leaving our training program.\nBest wishes!"}, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "117877986378245720036", "name": "admin istrator", "time": 1512529979411, "rating": 1.0, "text": "Something seemed fishy from day one. I was sent here by CRST and they had me teaching other students from my first day on the yard. I was mistreated gor asking for better training. And I believe they had rackets set up with their third party testing facilities and the hotel that students were placed in. I saw students who could not drive get their license with no problem while drivers who could drive failed multiple times. I have a very detailed idea as to what the deal was. I saw enough in the 3 weeks I was there tk leave after failing the first time. I should not have failed... I have driven cdl before and I was training the other students who passed. I was tested on a different field than other students and the tandems were moved so far forward that I had a 14 ft overhang to do a true 90 alley dock... Mathematically impossible... When I challenged it, my next test date was moved more than 20 days away... When I questioned the decision I was told I had no right... The FBI closed them down today... I will be a witness against them if I am asked! I was able to gain insight fron some instructors and other students... There were instructors who didnt even have cdl licenses..... I could write a book on the violations I witnessed while attending this school... Our lives were risked repeatedly by these people. And we were treated like prisoners at a school we were paying for.... Insanity is what it was....", "pics": null, "resp": {"time": 1524706220581, "text": "All Third Party Examiners are Monitored by their respective State, your accusation is unwarranted and unfounded.  According to your account, you should not have been here as it appears you knew everything, but yet you were a Student.\n\nOur Instructors are licensed by the State of Alabama and State of Georgia, and their resumes are on file with the Alabama Department of Post Secondary Education.\n\nThe question one may ask of you.....is why everyone else passed but yourself?  They were trained by the same Instructors, yet you claim to be an experienced driver.\n\nI always tell my Student's should you not pass your DOT Skills Test, try not to place blame on someone for any shortcoming, just look in the mirror.....\"you\" are..... and..... \"were\" the driver during the Test and responsible for the articulation of the steering wheel, who controls the movement of the Tractor and Trailer.\n\nWe have been in business for over 23 years, still open, and yes, we have had Students not pay for their training, after being trusted to do so.  So if you were in fact here, under a contractual agreement and you did not fulfill your contract, what other options does a business have?  I know when you complete a weeks works, you expect to be paid.  Well, we are no different, and when we complete those services or meet our contractual agreement, we too, expect to be paid.  Interesting. I was stopped on the road rendering service to a disabled driver, when one of my former Students of about 15 years past, stopped and offered his assistance as well.  He ask, how is business, naturally I said good, but sometimes I just feel like closing it down, with all the negativity......He said, think of all the people you have helped, literally thousands, so you are always going to have someone to take a dim view and it's usually someone who owes you money....keep the faith, and above all keep helping those who sincerely want to become a Truck Driver.\n\nWe're sorry that you were not satisfied with your experience. We are continually working to improve our facility and training equipment to enhance the learning experience of our students. We try to train students in older equipment to prepare our students for any possible challenges. We do also encourage our students to ask our instructors questions if there is anything unclear in the training to pass the tests. Our facility is actually cooperating with the FBI in their investigation into the practices of Dr. Edwards, who has arrested for falsifying US DOT records, so we are open for business. We do maintain a serious environment, because we want all of our students to be safe and successful upon leaving our training program.\nBest wishes!"}, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "108199090153030798013", "name": "Chris Hanson", "time": 1415931689053, "rating": 1.0, "text": "This place will not teach you anything and will take your money. The only way students learn here is from other students. Don't go here!", "pics": null, "resp": {"time": 1524705706687, "text": "We have been in business for over 23 years and yes, we have had Students not pay for their training, after being trusted to do so.  So if you were in fact here, under a contractual agreement and you did not fulfill your contract, what other options does a business have?  I know when you complete a weeks works, you expect to be paid.  Well, we are no different, and when we complete those services or meet our contractual agreement, we too, expect to be paid.  Interesting. I was stopped on the road rendering service to a disabled driver, when one of my former Students of about 15 years past, stopped and offered his assistance as well.  He ask, how is business, naturally I said good, but sometimes I just feel like closing it down, with all the negativity......He said, think of all the people you have helped, literally thousands, so you are always going to have someone to take a dim view and it's usually someone who owes you money....keep the faith, and above all keep helping those who sincerely want to become a Truck Driver.\n\nWe're sorry that you were not satisfied with your experience. We are continually working to improve our facility and training equipment to enhance the learning experience of our students. We try to train students in older equipment to prepare our students for any possible challenges. We do also encourage our students to ask our instructors questions if there is anything unclear in the training to pass the tests. We do maintain a serious environment, because we want all of our students to be safe and successful upon leaving our training program.\nBest wishes!"}, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "108751520787758326228", "name": "Eddie Hill", "time": 1557179067879, "rating": 5.0, "text": "Great place to get your CDL!!", "pics": null, "resp": null, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "110380504880427069887", "name": "Grady Brogdon", "time": 1569160478697, "rating": 1.0, "text": "It's awful funny that the owner was on here replying to everybody's review but now he is in legal trouble for the exact things that students were accusing him of so if you go there beware that you may have to retake all of your test again.", "pics": null, "resp": null, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "112844042929050099028", "name": "manjunath akki", "time": 1479911595913, "rating": 5.0, "text": "HI i am veeresh from india, karnataka i wanted to learn the truck driving so what is the first step to come to us", "pics": null, "resp": {"time": 1524705917030, "text": "Hello Veeresh. Unfortunately, we do not offer sponsored visas for international students, but feel free to contact the Indian International Education Specialists on how to obtain a student visa.\nBest wishes!"}, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "109230014319795699627", "name": "Anthony Dyches", "time": 1552250596110, "rating": 3.0, "text": "If you take getting your CDL training serious they will take you serious", "pics": null, "resp": null, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "109435654774222178763", "name": "John Logan", "time": 1548545653278, "rating": 5.0, "text": "If I did it so can you.", "pics": null, "resp": {"time": 1548889511924, "text": "Thanks for your positive review! We're glad that you were satisfied with your experience and we wish you all the best in your future endeavors."}, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "115278418497055679900", "name": "BAND VIDZ", "time": 1549387884353, "rating": 1.0, "text": "Worst experience ever", "pics": null, "resp": null, "gmap_id": "0x888cdd55ae97943b:0xeac526f016a3fd6d"}
{"user_id": "112944537092539549099", "name": "Daniel Allen", "time": 1619722844093, "rating": 5.0, "text": "My training there with my instructor Glenn was awesome he was very clear and concise it really help me improved and weak points such as parallel parking as well as reverse entry parking I would highly recommend their services in training.", "pics": null, "resp": null, "gmap_id": "0x888905bc00adfd5d:0xf883fdafe8efcfc9"}
{"user_id": "105393090545568227704", "name": "Ms Boss Ragland", "time": 1599700397941, "rating": 5.0, "text": "Glen was very nice and patient. I really enjoyed my lesson today", "pics": null, "resp": null, "gmap_id": "0x888905bc00adfd5d:0xf883fdafe8efcfc9"}
{"user_id": "116094733766283944861", "name": "Crystal Cox", "time": 1624499358436, "rating": 5.0, "text": "We drove from Fayetteville, TN each week and it was well worth the drive.  My son enjoyed his lessons and he has become a more confident driver.  And as his mother I feel less nervous about his driver's license test coming up in August.  Thank you so much!", "pics": null, "resp": null, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "104260779771512909124", "name": "Huan Le", "time": 1614187443664, "rating": 5.0, "text": "Joe is a good teacher and a very professional communicator. 5/5 would recommend to anyone in the Huntsville area.", "pics": null, "resp": null, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "104771178416177946851", "name": "Yaraliz Pagán", "time": 1572994345715, "rating": 5.0, "text": "Awesome instructor! Highly recommend. Took his time with my son. My son felt very comfortable around him and he did an awesome job 💯 My son passed and now has his Driver's License. If you want someone go here.", "pics": null, "resp": {"time": 1574437011736, "text": "Thanks Yaraliz!"}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "111891843044493876804", "name": "Kelly Merritt", "time": 1564009083799, "rating": 5.0, "text": "Richard was patient with my son and gave him the confidence that he needed to pass his test. Very professional and responsive to calls and text messages. I will highly recommend him to others!", "pics": null, "resp": {"time": 1565965789507, "text": "Thanks Kelly!"}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "116665030020175969281", "name": "MF C", "time": 1560507947646, "rating": 5.0, "text": "Excellent instruction and time behind the wheel with Rico gave my daughter so much more confidence behind the wheel. Completely worth the money for the peace of mind and seeing her so excited about where she drove after each lesson. Highly recommended!! Thank you!!", "pics": null, "resp": {"time": 1561682082774, "text": "Mr Rico is an excellent instructor. He treats every child as if they were his. Alabama Driving Academy takes pride in making Alabama the safest streets in the Nation one driver at a time."}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "101373297922994757919", "name": "Dyneesha Head", "time": 1503513665630, "rating": 5.0, "text": "I can, with great honor, suggest taking driving classes from Mr. Richard. He is very accommodating and a very good teacher. He makes sure you are comfortable and gives clear concise instructions. He was not only patient, but very firm and direct with his instruction. He really cares about his students and wants you to feel and be safe on the road as you are driving. He was awesome and I definitely suggest anyone in need of driving classes/instructor to give Mr. Richard a call. He is the best. Again thank you for your time, patience, and care.", "pics": null, "resp": {"time": 1503603668278, "text": "Thanks Dyneesha! Students like you make my job a lot easier! You were a joy to work with."}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "113261814939787633094", "name": "wae awetwer", "time": 1549327293299, "rating": 5.0, "text": "Instructor with great experience, really straightforward and superb overall. Started taking classes on a Wednesday without any previous experience and that same Friday I already had my license; got a 100 on the driving test. Totally recommend", "pics": null, "resp": {"time": 1549838636417, "text": "Thanks Wae! You were a very quick learner."}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "111574048022677247591", "name": "M N", "time": 1557671322037, "rating": 5.0, "text": "My daughter loved Mr. Richard so much she wanted to invite him to her 16th birthday party!! 😁 he was very calm and reassuring to her and gave her confidence behind the wheel, which she needed. Worth every penny!!", "pics": null, "resp": {"time": 1557717638514, "text": "Thanks Michelle I would have definitely attended. Sixteen is a very special year. Please wish her a happy birthday from me."}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "103162115392187026767", "name": "Carter Castle", "time": 1490975810655, "rating": 5.0, "text": "My daughter recently took 8 hours of instruction from Richard and their time together, and his guidance were invaluable.  With his patience and kind manners, she is now a more confident driver.  She passed her driving test the first time she took it and feels elated!  I highly recommend the course, and Richard as an instructor, to anyone who is learning to drive.", "pics": null, "resp": {"time": 1491224437939, "text": "Thanks Carter! Willa is a very special young lady and a joy to drive with."}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "105143391214150061054", "name": "Sashae Deer", "time": 1547420766521, "rating": 5.0, "text": "I say this with high standards, Mr. Richard is by far the best driving instructor there is. He takes you from a non-driver to being one of the most confident driver there is. He makes you feel relaxed and his instructions are very clear. He is very patient and he also is very gentle with you asking him to explain whatever it may be that you dont understand.  If you do as he says then you will become one of the most safest and confident driver there is to be and I will forever put emphasis on that. Thank you for everything Mr. Richard.", "pics": null, "resp": {"time": 1548469353870, "text": "Sashae you are very kind. Thank you for your thoughtful review."}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "100728117291301477896", "name": "mom Ali", "time": 1575338701846, "rating": 5.0, "text": "I’m so excited for learn how I can drive the car", "pics": null, "resp": null, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "102024750093379846621", "name": "Jeffrey Cutler", "time": 1426400027461, "rating": 5.0, "text": "The instructor a former state trooper, was phenomenal!  My daughter had delayed driving until age 20 and had built up some anxiety.  He had an instant rapport/ connection with her.  He put her at ease. She said he was an amazing instructor.  He kept us informed of her progress and after the allotted lessons she passed the road test.  We live in Birmingham and carefully selected this school.  it was well worth the travel to Huntsville.  I give the instructor and this school the highest recommendation both from us parents and our daughter..", "pics": null, "resp": null, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "110611334737773014975", "name": "Rachel Ford", "time": 1448222413798, "rating": 5.0, "text": "The idea of driving and getting my license has been a great source of anxiety in my life, as driving has always made me nervous. I am 28 years old, and just now getting my driver's license. I never got it as a teenager, and then spent many years in NY, and did not need it. Now I spend a lot of time in AL for work, and it is very difficult to get around without driving. I  have taken lessons here and there in NY over the last few years, but still did not feel comfortable. I came to Huntsville for a weekend to take lessons from Richard Suttle, and in that time, I progressed more in my driving ability than I ever have before. He really made me feel like getting my license and being a safe and confident driver this late in the game is possible.\n\nI wish that when I was 15 years old and first trying to learn how to drive, that I had been able to take lessons from Richard, as I would have gotten my license in no time. He is an excellent teacher, and is a great combination of being calm, but firm, which really helped with my nervousness. He teaches you about driving in a methodical way, but still manages to seem easy going. I couldn't recommend him highly enough. I think of him as my driving guru :)", "pics": null, "resp": null, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "107570075647689828263", "name": "Benicia Harrison", "time": 1492545124029, "rating": 5.0, "text": "My driving instructor, Richard, was very informative and helpful. He's very patient and can work with any novice driver. I have been trying to get my license for the last 3 years and have failed the test twice, but with his guidance and expert advice I was able to get a perfect score. He will work with you one on one until you have the necessary skills to drive on the open road.", "pics": null, "resp": {"time": 1492612497314, "text": "Thanks Benicia. It was a joy teaching you."}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "100508581934991083072", "name": "AYANANTA GANGULY", "time": 1425085398236, "rating": 5.0, "text": "Alabama driving academy is an awesome one. The instructor is really good. He helps you to leave your fear behind you. Teaches you all the driving fundamentals properly. When I started with him initially I used to be scared to drive but, now I just love to drive. He listens to all your questions with absolute patience and answers them properly. I was never sure of getting the driver license on my own. His training made it possible today ! I got my license today.", "pics": null, "resp": null, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "107416628160514374085", "name": "Tonya Robinson", "time": 1534110222287, "rating": 5.0, "text": "I am so thankful to have found an instructor like Mr. Suttle. He cares about the students as if they were his own. He was able to work with my child on many things as well as help her to pass the road test. Thank you Mr. Suttle for all your hard work.", "pics": null, "resp": {"time": 1534519569235, "text": "Thank you for your kind words Ms. Robinson. I take pride in making sure my students are safe, courteous and responsible drivers."}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "115229535943076195544", "name": "Wendy Chappell", "time": 1510423578622, "rating": 5.0, "text": "My daughter is more confident on the road!  A huge “thank you” to Mr.Richard for his patience. I would highly recommend this driving academy.", "pics": null, "resp": {"time": 1511415784224, "text": "Thanks Wendy!"}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "105036058454996957361", "name": "Tyler Longsworth", "time": 1508526471966, "rating": 5.0, "text": "I was a very anxious driver before I came to this driving school. The instructor was very friendly, informative, and helped me develop confidence in my driving. I couldn't have passed my test without him. Thank you!!", "pics": null, "resp": {"time": 1508527357038, "text": "Thanks Tyler! You were a joy to teach!"}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "117516935261621550340", "name": "Kehla Picart", "time": 1531430364428, "rating": 5.0, "text": "Great instructor who was patient and gave great instructions! Would recommend for all new drivers 👍🏾", "pics": null, "resp": {"time": 1533436150720, "text": "Thank you young lady you were a joy to teach."}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "104092223395178061052", "name": "Akshay Madhukar", "time": 1506823937954, "rating": 5.0, "text": "Mr. Richard is a very good teacher. He is very knowledgeable and friendly. I highly recommend his driving classes.", "pics": null, "resp": {"time": 1506875241072, "text": "Thanks Akshay!"}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "114556517656655697358", "name": "Taz", "time": 1542403163785, "rating": 5.0, "text": "Very nice and patient. A great teacher !", "pics": null, "resp": {"time": 1542598107173, "text": "Thanks Emerald you were a joy to work with. Continue to work hard and great things will happen."}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "101719186386433803602", "name": "Nathaniel Stepp", "time": 1424107632188, "rating": 5.0, "text": "I never got my drivers license while I was in high school due to a combination of how busy I was at the time, family issues, and a crippling anxiety about driving. This caused me to procrastinate learning how to drive late into my college years. Finally, I decided this needed to change when I realized I was limiting my future career opportunities by not being able to travel.\n\nA friend recommended Alabama Driving Academy of Huntsville for a quick and safe way for me to learn, speaking highly of the driving instructor's experience (former state trooper) and ability to work with people of all backgrounds. After contacting the instructor and beginning the lessons, I was not disappointed!\n\nHe was very calm during lessons, friendly, and boosted by confidence as a driver greatly. As a student, he also greatly worked with my schedule. He not only taught me the proper foundational skills of driving, but also gave me a lot of advice/skills on how to be a safe and defensive driver.\n\nWithin two weeks of periodic lessons with him, he took me to the DMV, helped me through the paperwork, and allowed me to use his car to take my road test (I made a 100!). I now have my license, feel much more confident on the road, and have the driving skills necessary to keep me safe.\n\nIf you want to learn how to drive or want to refine your driving skills, do not hesitate to contact Alabama Driving Academy of Huntsville!", "pics": null, "resp": null, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "115546207320488891642", "name": "Cinderella Vassell", "time": 1525966227167, "rating": 5.0, "text": "Thanks to Richard who help me receive my license, I had a good time throughout my sessions I would 1000% recommend him to anyone.", "pics": null, "resp": {"time": 1526327843938, "text": "Thanks Cinderella! You were a joy to work with."}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "117346901452766817881", "name": "Lisa Young", "time": 1469298908624, "rating": 5.0, "text": "My daughter had a lot of anxiety about driving.  Richard helped her overcome her fear of driving and obtain her license.  He was very professional and went the extra mile to make sure she received the best instruction possible.  I highly recommend the Alabama Driving Academy!", "pics": null, "resp": {"time": 1469377797480, "text": "Thanks Lisa!"}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "111930581914438507973", "name": "Reana Thompson", "time": 1550188746958, "rating": 5.0, "text": "Coming into driving, i was unexperienced and scared. However, Mr. Suttle was patient and he took his time. Dealing with a person like me is not always good, but he handled himself well. Coming from a big city, I was scared to drive, but taking lessons from Mr. Suttle was comforting. There were times  where he had to instill in my thick brain to get it together with tough love and I did just that. He was hard on me, but I appreciate the constructive criticism because I needed it. He was assuring, patient, and firm. I passed my test today and I want to thank him because we came a longgggg way from Day 1 to now. Thank you so much Mr. Suttle, I appreciate your services and this was a fun experience for the both of us..... See you soon!", "pics": null, "resp": {"time": 1551188169130, "text": "Thanks Reana! It was a fun experience and you were a joy to work with."}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "101265046415935643976", "name": "Tamara Thomas", "time": 1506521312297, "rating": 5.0, "text": "Mr. Suttle was a wonderful teacher. Taking his courses helped me achieve a very important self in my young adult life.", "pics": null, "resp": {"time": 1506875296132, "text": "Thanks Tamara!"}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "110260329954600424000", "name": "Michelle Ruff", "time": 1497526105006, "rating": 5.0, "text": "Mr. Suttle worked with my young adult son, giving him the tools to be a safe driver and helping him pass the driver's test. Thank you, Mr. Suttle, for your professionalism, guidance and patience!", "pics": null, "resp": {"time": 1497641078296, "text": "Thank you Ms. Ruff, James was a joy to work with!"}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "112139167729766678030", "name": "Josh Nay", "time": 1471958933723, "rating": 5.0, "text": "I felt safe the entire time I was being taught, I knew that if I made a mistakethat he would make sure that nothing bad would happen and he would teach me what to do next time. Richard definately wants the best for the students and to him it's not about the money, it's about what his students learn so they can be safe drivers. I would definately recommend his driving academy to anyone! You won't regret it!", "pics": null, "resp": {"time": 1473215184014, "text": "Thanks Josh!"}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "106592392880311889758", "name": "Kierra Denise", "time": 1519774214357, "rating": 5.0, "text": "He is very patient i was very afraid to drive but working with him caused me to\nBe more comfortable driving and more importanly a safe driver... Thanks to this program i am a licensed driver.!", "pics": null, "resp": {"time": 1524848487927, "text": "Thanks Kierra!"}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "111261577012434617524", "name": "King R", "time": 1461264257785, "rating": 5.0, "text": "Alabama driving academy was Completely awesome I will recommend anyone Richard helped me with my fears and I gain complete confidence", "pics": null, "resp": null, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "100853424058286383951", "name": "Nguyen Hoang", "time": 1411617031711, "rating": 5.0, "text": "Yeah, I passed today and got my driver license! Thanks Alabama Driving Academy school. It's nice to work with you.", "pics": null, "resp": null, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "107957143130289185792", "name": "Hardik Patel", "time": 1449092031281, "rating": 5.0, "text": "awesome teacher ever.....thanks for making me drive car so confidently.....", "pics": null, "resp": null, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "109477797271930578491", "name": "Ammar Bandukwala", "time": 1486064925500, "rating": 3.0, "text": "live here", "pics": null, "resp": {"time": 1487779573821, "text": "Mr. Bandukwala you have rated Alabama Driving Academy without attending any classes or ever speaking with anyone at the Academy. We take pride in providing 5-star rated instruction and if you give us a chance I'm sure we can prove that to you.\nThanks,\nRichard Suttle\nDirector"}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "104108894174094695621", "name": "Nikki Knott", "time": 1503147865403, "rating": 5.0, "text": "Worth it!", "pics": null, "resp": {"time": 1503603481345, "text": "Thanks Nikki!"}, "gmap_id": "0x8862701df8eed643:0xddd9da159367f51c"}
{"user_id": "116374499947089941341", "name": "Chadd Goosmann", "time": 1506209614024, "rating": 5.0, "text": "Wold class instruction at a world class facility. Cass Whitehead and the other instructors really want you to have fun but push you to improve from whatever starting point you bring to the class.  To be able to drive Porsche's latest cars at a place like Barber Motorsports Park is something you must do if you love high performance cars.\n\nMy driving skills improved significantly during the Performance 2 - Day Course.  There is a great mix of track laps and skills development on the skid-pad and autocross course.  I enjoyed it so much I went back a year later for the Masters 2 - Day Course.  Everything  from the first course came back to me quickly and after the open lapping sessions on day one I was feeling confident but had a lot of places to improve.  Open lapping on Day 2 things really started to come together.  I enjoy watching the HD Video of my laps from each session and comparing them to see how much faster and smoother I became throughout the course. The open lapping sessions during the Masters Class are really something special.  Driving highly spec'd Porsche's with feedback on every lap you drive really is a great recipe for quick driver development.  And it is a ton of fun!\n\nI would highly recommend this school for any level of driver.  They have something for everyone and their instructors can make anyone a better driver.  I also really enjoyed the accommodations at the Grand Bohemian Hotel. Very nice atmosphere and they really take care of the Porsche Sport Driving School attendees.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN74pOJKqo_LSzcHBEd8oy9C2iaLPQKXvyOwJ8G=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOYS1JlUp5dzXoxu6-nS-xoRSVkvXrvkE1ak0If=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMoXv5PMsT7U9jY4gUOY7exYzqaUAOmKVVZnuu9=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888912dd9f25760b:0xebc0f09147b1bf99"}
{"user_id": "102503968026628157189", "name": "R.L. Mitchell", "time": 1565400865216, "rating": 5.0, "text": "Incredible school to learn high performance driving. Great instructors!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN1DsL4R8nfvvYXI1xZFjac62r41cO1NsPzK1Zs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOhUAKfUNAvSGE3hmxAqe4LNeryD-qi-nIzg2CF=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888912dd9f25760b:0xebc0f09147b1bf99"}
{"user_id": "111051609186329170582", "name": "David Leach", "time": 1580306946186, "rating": 5.0, "text": "Just returned from spending probably the most fun two days I have spent behind the wheel in 25+ years of racing, driving, instructing and sliding on most of the tracks throughout  North America.   The facilities are absolutely first rate, the cars are simply spectacular and the instruction and seat time that you experience are second to none.  Barber Motorsports Park is a spectacular facility and after a relatively short but very informative classroom session, they take you to the track, show you the flow of the 2.38 mile 16 corner course and have you driving at speed in what seemed to be no time at all.  They split you up in separate groups, some going to the track while others run very helpful and fun exercises, including a diabolical skid pad and high-speed autocross where you get the feel of just how far you can push the car before it breaks away.  As I think back on it, I’m still amazed at how much seat time you get on the track  while experiencing the other exercises including a short off-road deep-woods session in the Porsche Cayenne’s.   The cars are exquisitely maintained and you are invited to drive almost everything in the fleet, including the amazing Porsche 911Turbo S.  Driving hard lap after lap and never once did I get even the slightest hint of brake fade.   Following a brief heel and toe shifting lesson you can also lap  the track in 911’s equipped with manual transmissions - the purists loved that.  They also rotate the instructors so you get some experience and information from their entire line of true professionals.\nIn my opinion, bang for the buck, there is no better Experience to be had if driving fast in a safe, beautiful  environment is what you’re looking for. The accommodations, hotel, food  and of course the vehicles are all world class.  Porsche along with Jeff Purner and Cass Whitehead have set the bar high for any other driving experience to try and come close.   The hot laps at the end along with the tour of the most spectacular motorcycle and Lotus museum in the world is like sensory overload. I enjoyed every moment of them.  If you don’t already drive a Porsche, I could almost guarantee that after this experience you will be shopping for one. For those that don’t have a fair amount of track time, try and find some or possibly take the one day course first because when you arrive for the two day performance course it is definitely “Game On”!", "pics": null, "resp": null, "gmap_id": "0x888912dd9f25760b:0xebc0f09147b1bf99"}
{"user_id": "112752492263057285144", "name": "John Hennessy", "time": 1574099661885, "rating": 5.0, "text": "I just completed the Masters course in Birmingham and I couldn’t be more pleased. The instructors were world class(professional, fun and true masters of their craft), the track spectacular and the program a great combination of fundamental skill development and high performance driving. My expectations were exceeded and I will definitely attend additional programs in the near future!", "pics": null, "resp": null, "gmap_id": "0x888912dd9f25760b:0xebc0f09147b1bf99"}
{"user_id": "107902935942921732408", "name": "Paul Panik", "time": 1618913636892, "rating": 5.0, "text": "It is a beautiful venue and a well laid out track.", "pics": null, "resp": null, "gmap_id": "0x888912dd9f25760b:0xebc0f09147b1bf99"}
{"user_id": "106395279219841557971", "name": "Andrew Tychsen", "time": 1582381503338, "rating": 5.0, "text": "Unbelievable. Instructors are all incredibly skilled and knowledgeable. They are mostly pro racers. I learned so much and spent 90% of the time in a high performance 911 which was so fun. Adrenaline rushes galore!", "pics": null, "resp": null, "gmap_id": "0x888912dd9f25760b:0xebc0f09147b1bf99"}
{"user_id": "116993564530752258081", "name": "Lou Katzerman", "time": 1591400998901, "rating": 5.0, "text": "Great time! Unbelievably fun....", "pics": null, "resp": null, "gmap_id": "0x888912dd9f25760b:0xebc0f09147b1bf99"}
{"user_id": "115625370015370885881", "name": "Jeanette Sauer, Realtor Pennington Luxury Group", "time": 1489258819661, "rating": 5.0, "text": "I just had the most incredible experience and elevated myself to an entirely new level, not to mention a new profound passion to drive fast cars around a track.  The driving coaches exceeded my expectations and I'm still on cloud 9!  Thank you guys for pushing me beyond my own limits.  It was exhilarating coming in First place as the only girl (and a girly girl) in class out of 20 guys!  Coming back for masters.  Can't thank you enough for making this a 5-Star experience and gave me a new passion to enjoy with my 27 year old son!", "pics": null, "resp": null, "gmap_id": "0x888912dd9f25760b:0xebc0f09147b1bf99"}
{"user_id": "102978796493537883321", "name": "Jason Schall", "time": 1581221135463, "rating": 5.0, "text": "Phenomenal. I'm still smiling thinking about it.", "pics": null, "resp": null, "gmap_id": "0x888912dd9f25760b:0xebc0f09147b1bf99"}
{"user_id": "112206662681328866646", "name": "Mark U", "time": 1496096888789, "rating": 3.0, "text": "Okay but they definitely have trouble communicating effectively, in terms of building skills. Basically, in the \"beginner\" course, you get four opportunities to drive around their track. They separate you into groups, and it's luck of the draw. Then they reorganize the groups, based on no clear criteria, and you get to go again. It can be very frustrating. You'll need to rent a car if you want any ability to go outside the hotel/resort for meals or just to get away.", "pics": null, "resp": null, "gmap_id": "0x888912dd9f25760b:0xebc0f09147b1bf99"}
{"user_id": "101281928199241241374", "name": "Andrew Pharo", "time": 1523459415655, "rating": 5.0, "text": "What an amazing experience. Unique in so many ways. Incredible instructors, course, and cars. I’d do it again in a second.", "pics": null, "resp": null, "gmap_id": "0x888912dd9f25760b:0xebc0f09147b1bf99"}
{"user_id": "116387870390695735466", "name": "Yury Kholondyrev", "time": 1551923497678, "rating": 5.0, "text": "Amazing cars and amazing track.", "pics": null, "resp": null, "gmap_id": "0x888912dd9f25760b:0xebc0f09147b1bf99"}
{"user_id": "118345692495717527743", "name": "Josh Caddis", "time": 1566173767077, "rating": 5.0, "text": "Mr. Sexton was an awesome instructor for our son. We will be using him again for the rest of our children. They learn a lot of invaluable information from him. Would not hesitate to recommend him to anyone!", "pics": null, "resp": null, "gmap_id": "0x888601fa71a7814b:0x623cf3dac71a2e09"}
{"user_id": "113312892103605463832", "name": "Candis Traeger", "time": 1548035962102, "rating": 5.0, "text": "Really good instruction. It has helped my daughter so much. I could not imagine how much she has improved in only one lesson.", "pics": null, "resp": null, "gmap_id": "0x888601fa71a7814b:0x623cf3dac71a2e09"}
{"user_id": "107872501568885544341", "name": "zz tan", "time": 1595705188619, "rating": 1.0, "text": "I got my license after not using him as instructor", "pics": null, "resp": null, "gmap_id": "0x888601fa71a7814b:0x623cf3dac71a2e09"}
{"user_id": "107485710901158230357", "name": "Happy Melon", "time": 1497988382315, "rating": 1.0, "text": "Would only take my daughter out on Saturday morning downtown, when there was hardly any traffic.  Not nearly comprehensive enough.  Very expensive and to this day has not gotten her license.  He said she was safe on the road, but I have had to grab the wheel from her and slam on the horn more than once.  I have never let her change lanes or go on the highway. ..still searching for a better instructor.", "pics": null, "resp": null, "gmap_id": "0x888601fa71a7814b:0x623cf3dac71a2e09"}
{"user_id": "109276692629324238604", "name": "Beth Chapman", "time": 1462037623064, "rating": 5.0, "text": "Our son took lessons from Mr. Sexton, a few years back and he definitely benefited!  Mr. Sexton put the finishing touches, on his driving before he aced, the drivers test!!👍🏻😄🚗. We now have a daughter, that we are about to schedule with Mr. Sexton, for his expert driving lessons!!  🚙👍🏻😄", "pics": null, "resp": null, "gmap_id": "0x888601fa71a7814b:0x623cf3dac71a2e09"}
{"user_id": "107349489702254055353", "name": "Lilshay6 Gaming", "time": 1590858343940, "rating": 4.0, "text": "Is this man still in business Bc I try to call and wouldn’t answer??????", "pics": null, "resp": null, "gmap_id": "0x888601fa71a7814b:0x623cf3dac71a2e09"}
{"user_id": "117644622120504447751", "name": "Eman Smith", "time": 1535878544406, "rating": 1.0, "text": "He never answers the phone", "pics": null, "resp": null, "gmap_id": "0x888601fa71a7814b:0x623cf3dac71a2e09"}
{"user_id": "104010032384461413477", "name": "rl caj (rl)", "time": 1434999457275, "rating": 1.0, "text": "this brings it back to UA... this is not the right number!!", "pics": null, "resp": null, "gmap_id": "0x888601fa71a7814b:0x623cf3dac71a2e09"}
{"user_id": "116903518238209213835", "name": "Robert Howell", "time": 1614739462244, "rating": 5.0, "text": "The instructor was friendly, knowledgeable, helpful and understanding.  I recommend that you not get into trouble (like I did) so that you need them, but if you do, they will help.", "pics": null, "resp": null, "gmap_id": "0x889a4d9ac65230a7:0x8c8c3cbeffbbc2e4"}
{"user_id": "114960135707285067953", "name": "Big Boy Locs", "time": 1616085739713, "rating": 1.0, "text": "Terrible at responding to emails n gettin fax!!😡😡", "pics": null, "resp": null, "gmap_id": "0x889a4d9ac65230a7:0x8c8c3cbeffbbc2e4"}
{"user_id": "100779554295711579521", "name": "Brother Smitty", "time": 1602255743215, "rating": 5.0, "text": "Had to go for a traffic ticket. Loved the teacher. Good info in a timely manner!", "pics": null, "resp": null, "gmap_id": "0x889a4d9ac65230a7:0x8c8c3cbeffbbc2e4"}
{"user_id": "115881699137433522190", "name": "nduncan79", "time": 1598119896729, "rating": 5.0, "text": "I got to be honest. I didnt know how class was going to be. But, My Instructor was informative, engaging, friendly. He kept the class intresting while we learned. Thank you Mr Hunter.", "pics": null, "resp": null, "gmap_id": "0x889a4d9ac65230a7:0x8c8c3cbeffbbc2e4"}
{"user_id": "116137646977228743513", "name": "Letitia Trenier", "time": 1591979032841, "rating": 5.0, "text": "Steve Scarcliff was a wonderful instructor.  Worth the money.  He was very sincere.  Thank you", "pics": null, "resp": null, "gmap_id": "0x889a4d9ac65230a7:0x8c8c3cbeffbbc2e4"}
{"user_id": "114495744967335640822", "name": "y williams", "time": 1595558281607, "rating": 5.0, "text": "George Hunter was a good instructor.  Kept the class interesting", "pics": null, "resp": null, "gmap_id": "0x889a4d9ac65230a7:0x8c8c3cbeffbbc2e4"}
{"user_id": "117133931679896955415", "name": "Mackenzie Richardson", "time": 1582996351890, "rating": 5.0, "text": "Had John Cousins for an instructor on a 4 hour course and actually enjoyed the time here. He made something boring and tedious really entertaining.", "pics": null, "resp": null, "gmap_id": "0x889a4d9ac65230a7:0x8c8c3cbeffbbc2e4"}
{"user_id": "102863368213715210852", "name": "Gene Warren", "time": 1525469684171, "rating": 5.0, "text": "Why am I giving a 5-Star review to a driving school?  This should have been a miserable 4 hours of forced internment brought about for a minor traffic violation.  Instead it was 4 hours of highly engaging and entertaining learning lead by the gregarious John Cousins.  He immediately put the class at ease with his well-suited demeanor and kept the entire class involved and interested throughout.  If you are going to be forced into driving school I highly recommend you do it here and with John.  Top notch!", "pics": null, "resp": null, "gmap_id": "0x889a4d9ac65230a7:0x8c8c3cbeffbbc2e4"}
{"user_id": "100201901308327017401", "name": "Alex Calder", "time": 1464365268337, "rating": 1.0, "text": "The one thing I can say is the ASI director is a very pleasant gentleman who was quick to fix a very bad situation. First off; I received my first speeding ticket and I needed to sign up for traffic school. I called with no idea of how ASI or traffic school worked and asked if they had any Saturday classes; they did. I work all day Friday's so the Saturday 8 am class was perfect. After I arrived there and the gentleman in the class called the names out, I realized my name wasn't called. When I asked him about this he was very kind and told me to come pick up my certificate of completion first thing Monday. I was confused, but I assumed it was a simple error. When I went up there Monday and explained what happened, the two kind ladies at the front went to their \"supervisor\" or whatever in a desk behind the glass in the front. I could see everything that was being said and her facial expressions. She walks out there and says \"Um, you were signed up for Friday at 9am and you missed that class.\" I was shocked at this time. I explained to her that's impossible, because I had no idea they had a Friday class and that I was told Saturday at 8 am, how would I know to show up at that time Saturday if that is not what I was told? She rudely scoffed and rolled her eyes and told me it was my mistake and that there was a missed class fee. I refused because this was NOT my error. She eventually walked back there slamming stuff around and basically shoved my certificate to me. Now the two ladies at the front were quiet at this time, and were very kind when I left. However, that other wicked witch was the complete opposite. It was clearly their mistake, and she stood there trying to make me feel like an idiot and trying to force me to pay a missed class fee that I really did not miss. Her lack of common knowledge and grammar was quite frightening, and next time I'll just pay the ticket to avoid that lady.", "pics": null, "resp": null, "gmap_id": "0x889a4d9ac65230a7:0x8c8c3cbeffbbc2e4"}
{"user_id": "101162943595328604149", "name": "d tara", "time": 1358235846738, "rating": 2.0, "text": "Older male instructor for the defensive driving class is very nice, class is as pleasant as it can be. However, the woman who teaches DUI class is a complete witch- didn't even take her class- but she had an attitude when she was simply asked a question. Avoid this crazy witch if you can!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d9ac65230a7:0x8c8c3cbeffbbc2e4"}
{"user_id": "107785915787383520638", "name": "Daniela Werner", "time": 1429800599202, "rating": 5.0, "text": "Everyone here is welcoming and the standard defensive driving class is a useful discussion about how we can be safer drivers.", "pics": null, "resp": null, "gmap_id": "0x889a4d9ac65230a7:0x8c8c3cbeffbbc2e4"}
{"user_id": "103211131105585330789", "name": "S Stout", "time": 1426255998573, "rating": 4.0, "text": "This place would have gotten 5 stars had I not heard one of the clientele discuss how she lost her virginity in the parking lot....other people have to use the parking lot too.  I just hope the other cars don't get an STD.", "pics": null, "resp": null, "gmap_id": "0x889a4d9ac65230a7:0x8c8c3cbeffbbc2e4"}
