{"user_id": "113386719745345859105", "name": "Marisol Galindo-Wright (Mari)", "time": 1614723057137, "rating": 1.0, "text": "Summary: Over Priced, Took too long, Vehicle returned damaged/needs further repair.\n1) Vehicle was not returned in timely manner (took three weeks. Dropped off on 2/11. Initially returned even worse on 2/26 (left car to be fixed) and picked up on 3/1)\n2) Transmission cooler was damaged by mechanic in the process of fixing a dripping leak in the O ring/transmission line  (initial problem). Mechanic CLAMIED that the damage to the transmission cooler WAS the cause of the initial problem (dripping leak in transmission line).\n3) Husband wanted to fix the transmission cooler himself. Mechanic said that there was a small leak in the cooler. Picture below tells a different story. Leak went from a few drops every few minutes to gushing all over the engine with the entire fluid contents of the transmission basin on the ground within a minute.\n4) Had to pay for full price for parts/labor for their \"mistake\" to my transmission cooler  (that is no longer manufactured) on top of the parts/cost to fix the initial problem.\n5) Mechanic took my orange funnel from my engine and left trash in my engine.\n6) Mechanic also damaged my engine somehow. The engine made a horrible high pitched noise when I turned on my car (3/2) this morning to go to work.\n\nI NOW have to take the car back to this mechanic so they can AGAIN fix the damage THEY have caused to my vehicle. Unacceptable as my husband has known the owner for 20+ years and the company he works for takes their company vehicles here for maintenance and repair. Disappointing.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNAdYQ4VCpvD5kECFedT0x1dWNxnl6zEhSeGro1=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "118253154321805403659", "name": "Chopper's Drywall Braet", "time": 1622041525753, "rating": 4.0, "text": "Good customer service. Very professional", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "100720421782425098037", "name": "Carl Davis", "time": 1621910723571, "rating": 5.0, "text": "Great customer service, helpful and professional", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "103978228120526837264", "name": "B P", "time": 1602683715674, "rating": 1.0, "text": "Part 1 Missing parts! Took my truck in to get a radiator leak fixed was told it would be done at the end of the work day on Friday so I would have to come get it the following week. I call to let them know I’m in route and they told me my truck still isn’t done. And would be finished by the afternoon. I got there and picked it up before I had to rush to work because of the Inconvenience. Got to work and actually popped the hood to see what has been done and the first thing I notice is a bolt holding the radiator is missing along with three other bolts to hold other various things in the front down. Further investigations leads me to find no COOLANT in the reservoir. Idk what kind of show they are running down there but if you care about your Vehicle  being put back together correctly don’t go here. I am now scheduled to go back to correct their problems so stay posted for part 2.", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "118251341023751877791", "name": "Rodney Whitfield", "time": 1616206214628, "rating": 1.0, "text": "Sent email requesting info no response", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "108868095227860095485", "name": "Steve Stewart", "time": 1569505959358, "rating": 5.0, "text": "We have been using Mann Automotive and Diesel for 15+ years for commercial vehicles and the work is accurate and done  in a timely manor! Anytime I call with a problem someone has always assisted me with the problem. This covers anything from bring the vehicle in or broken down beside the road!!", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "108001115583827018231", "name": "Aden Seay", "time": 1613992756636, "rating": 5.0, "text": "Will this place do diesel tuning?", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "109285306908376999231", "name": "Anne McLean", "time": 1563301649345, "rating": 5.0, "text": "I was extremely pleased with the work recently done on my automotive a/c. It was very involved because of having to replace the evaporator as well as compressor. The task was very tedious but the technicians were very professional, polite and set my mind at ease. They were able to get the work done in a timely manner and my vehicle has done great.", "pics": null, "resp": {"time": 1563470141700, "text": "We appreciate your business and look forward to serving you in the future."}, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "110698008158873646569", "name": "Simon T", "time": 1569360012364, "rating": 1.0, "text": "Extremely dishonest. Told me it would only be three days, every day I checked in after that they said it was being worked on, had been worked on, he even quoted conversations he was having with the technician about how small the driveline was, laughing about how difficult it was to do. Finally I got a call from the technician himself, where he told me That he hadn’t started yet but was going to have a problem that he needed to address before hand because they weren’t going to be able to do the work after all.\nJust picked up two untouched drivelines, and now have to go figure out where else to get them Customized. Also pretty sure they write their own positive reviews", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "115935484662353396567", "name": "jimmie horton", "time": 1579809927607, "rating": 5.0, "text": "Very professional got me back on the road very quickly.", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "104025759749706007704", "name": "Jessica Rees", "time": 1574096850622, "rating": 2.0, "text": "Took a week just too look at my car then they were totally wrong about what it was. PLUS I CALLED THEM AND TOLD THEM HOW MUCH I COULD GET THE PART FOR CAUSE THEY WERE TAKING FOREVER TO FIND THE PARTS HE STILL COULDNT GIVE ME A COST ON LABOR!!! I just went and got my car!", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "103543746769495314760", "name": "Jkb", "time": 1569547532165, "rating": 5.0, "text": "We depend on Mann’s to maintain our company vehicles and get us out of jams when the unexpected happens.  When the owner of the company is willing to go wherever, whenever to get your trucks going, you know you’re dealing with a great company.", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "115384531171078436726", "name": "Dajun Godwin", "time": 1569505959630, "rating": 5.0, "text": "Here at Unifirst in Dothan, Al. we use Mann Automotive for servicing and repairing not only our service trucks, but also on our Fleet side as well! We are more than pleased with all they do for us and Mann Automotive meets all our expectations and beyond!  -Dajun Godwin, Service Manager Unifirst Corporation", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "110343866583128865081", "name": "Vanessa Wren", "time": 1549939656020, "rating": 5.0, "text": "We have used Mann Automotive for several years and could not be more pleased with their work and service. They have never attempted to do any unnecessaary work in order to inflate the charges. If additional issues are found, with our car, they always contact us to make sure we know about them. The most amazing thing is that I can describe what my car is doing or mimick a sound it makes and Foy or Jeff usually know immediately what the problem is. The quality of the work performed by Mann's team is exceptional.  We usually have them service and inspect our car before a long trip. I never leave there concerned about the state of my car. They have worked on diesel as well as gasoline engines for us with quality work on both. We have recommended Mann's to family and friends who are equally satisfied. When we need work done on any of our vehicles, we don't even consider anyone else because we have full confidence in the work that will be performed as well as the integrity at Mann's.", "pics": null, "resp": {"time": 1563470267009, "text": "We appreciate your loyalty to Mann Automotive. It is our pleasure to keep your vehicles in top condition. Thank you for your kind words and repeated business."}, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "107166378953135343122", "name": "Nakia Peterson", "time": 1542202110496, "rating": 5.0, "text": "Exceptional service , very helpful ,informative about diagnostics and timely management on projects I've had to have help with or mainly Mann Auto (mainly do what they can to help with any situation)", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "109325174735973813575", "name": "Whit Hewes", "time": 1573672241336, "rating": 5.0, "text": "Very dependable and have been for years", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "112603673781623131814", "name": "hayne hollis", "time": 1569514875370, "rating": 5.0, "text": "These guys are great. I had a lingering generator problem and they fixed it!!!", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "110282595514904275152", "name": "James Mcpherson", "time": 1569498095647, "rating": 5.0, "text": "Great guys!  Excellent work!", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "112603673781623131814", "name": "hayne hollis", "time": 1569514875370, "rating": 5.0, "text": "These guys are great. I had a lingering generator problem and they fixed it!!!", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "110282595514904275152", "name": "James Mcpherson", "time": 1569498095647, "rating": 5.0, "text": "Great guys!  Excellent work!", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "100089007433897591362", "name": "J Steverson", "time": 1548087466308, "rating": 1.0, "text": "I am saddened that it has become commonplace to mislead or better put lie either for convenience or ineptitude. Took my driveshaft to this establishment the first week of december knowing the stub on the front was bent. After a couple of weeks i called and was told that it was being worked on and that parts that had been ordered had not come in.  Called a few days later and was told that one little part was still on order.  The next week i called and was told the shaft was chucked up and they were doing the runout on it and they would call when it was done.  Got no call. Called the next week and was told that they weren't  going to lie to me and that while working on it they bent it and would have to order another shaft and would call when they had it done. No call. Called the next week and was told it was back togeather and was chucked up doing a balancing check and they would call when done. No call. Finally i went and retrived the driveshaft. Nothing had been done. No new parts. No tooling marks indicating any work whatsoever had been done.  Six weeks they had the drive shaft. A lot of grief for what? To have said we cant fix it or whatever the reason would have been the right thing to do. The drive shaft was not touched!!!!", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "111489449380705750550", "name": "Terry Money", "time": 1424110759510, "rating": 1.0, "text": "Seems like if you have experience you should be able to give an estimate on something. It's called an estimate......i could go on but ....What a Joke  should sum it up", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "114741111579380717358", "name": "Mike Robbins", "time": 1590526976761, "rating": 5.0, "text": "Great mechanic", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "108754393605213290695", "name": "Gregg Howell", "time": 1565346125280, "rating": 5.0, "text": "The Best!", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "113053956218798598675", "name": "Mark Smith", "time": 1620218138774, "rating": 5.0, "text": "😀😀", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "104720911111235089856", "name": "powerline junkie", "time": 1542975949633, "rating": 5.0, "text": "Best mechanics all around", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
{"user_id": "103112362531474538928", "name": "Terry Pearson", "time": 1542241547928, "rating": 4.0, "text": "Fast", "pics": null, "resp": null, "gmap_id": "0x88929306ae9054ef:0x4f85e49c1df5eff0"}
