{"user_id": "104188429364953354238", "name": "Michael Jensen", "time": 1541876603743, "rating": 3.0, "text": "It was so good I didn't even have to go.", "pics": null, "resp": null, "gmap_id": "0x88892f4b50d45ff7:0xcba78fef9e63da08"}
{"user_id": "118253419155033024611", "name": "service mo", "time": 1504195806366, "rating": 5.0, "text": "Excellent job looking for these services I recommend them", "pics": null, "resp": null, "gmap_id": "0x88892f4b50d45ff7:0xcba78fef9e63da08"}
{"user_id": "103049092821875707481", "name": "Kesler Olivas", "time": 1504195720462, "rating": 5.0, "text": "Great job, they must undoubtedly contract these services", "pics": null, "resp": null, "gmap_id": "0x88892f4b50d45ff7:0xcba78fef9e63da08"}
{"user_id": "112182402736386063383", "name": "Marissa Umphrey", "time": 1540698982061, "rating": 5.0, "text": "Great service well put together company", "pics": null, "resp": null, "gmap_id": "0x88892f4b50d45ff7:0xcba78fef9e63da08"}
{"user_id": "103623176160330570768", "name": "Robbie Rodehaver", "time": 1548048288351, "rating": 4.0, "text": "Good folks fine Business", "pics": null, "resp": null, "gmap_id": "0x88892f4b50d45ff7:0xcba78fef9e63da08"}
{"user_id": "108797341395866503542", "name": "Marissa Umphrey", "time": 1540529024502, "rating": 5.0, "text": "Great job", "pics": null, "resp": null, "gmap_id": "0x88892f4b50d45ff7:0xcba78fef9e63da08"}
{"user_id": "104019342457391786580", "name": "Drew Edmondson", "time": 1567314379826, "rating": 3.0, "text": "Contractors", "pics": null, "resp": null, "gmap_id": "0x88892f4b50d45ff7:0xcba78fef9e63da08"}
{"user_id": "114562030162523517711", "name": "servic ne", "time": 1504892512132, "rating": 5.0, "text": "God Job", "pics": null, "resp": null, "gmap_id": "0x88892f4b50d45ff7:0xcba78fef9e63da08"}
{"user_id": "108571912436770068353", "name": "Paul Dugan", "time": 1487902123963, "rating": 5.0, "text": "Not Chinese drywall", "pics": null, "resp": null, "gmap_id": "0x889a1b3197e2c587:0x624c2c08b9d45ce6"}
{"user_id": "107776859616254274446", "name": "Patrick Perdue", "time": 1620951212426, "rating": 4.0, "text": "Good contractor!", "pics": null, "resp": null, "gmap_id": "0x888ed1f70634c471:0xa6b994e618239d50"}
{"user_id": "106368151788652562839", "name": "Mackenzie Wanyo", "time": 1599776682089, "rating": 1.0, "text": "So many things closed or animals not in their habitat. Over priced.", "pics": null, "resp": null, "gmap_id": "0x888ed1f70634c471:0xa6b994e618239d50"}
{"user_id": "118167002983890484543", "name": "Jon Freund", "time": 1606059985315, "rating": 5.0, "text": "They did great work building me a deck. I had them do some painting in a couple of rooms as well and they did fantastic work. They are reasonably priced and very professional. I will continue to use them and highly recommend M & J Handymen.", "pics": null, "resp": null, "gmap_id": "0x888a33d5c316823d:0x82f9339efe7f848a"}
{"user_id": "115237380820691648216", "name": "Pam Lembke", "time": 1604764172337, "rating": 5.0, "text": "Jay and Mike were great. They were very professional and did excellent work. Their prices are reasonable and a good value for the quality of work they do. They always make sure we are happy with everything before they leave. I  have used them for painting, home repairs, and they built me a deck.I highly recommend them.", "pics": null, "resp": {"time": 1604765546374, "text": "Thank you for the review it's always a pleasure doing business with you and your family. Hope all is well in these trying times. Stay safe!"}, "gmap_id": "0x888a33d5c316823d:0x82f9339efe7f848a"}
{"user_id": "114916971807718111803", "name": "Cadence Dart", "time": 1606060649373, "rating": 5.0, "text": "Jay and Mike Built me a 20x20 deck and did an excellent job. They are very informative and helpful to all questions and concerns. They really put you at ease. They are about mid range on pricing but give you high end quality. They dont leave until they make sure you are happy with their work. I definitely recommend they for any of your projects.", "pics": null, "resp": null, "gmap_id": "0x888a33d5c316823d:0x82f9339efe7f848a"}
{"user_id": "107362696215759284419", "name": "Curtis Lewis", "time": 1604742237108, "rating": 1.0, "text": "I had a less then 4x8 area of damage on my roof.  2 hrs was the max or would take to repair but they quoted me a day and a half. I  worked at home improvement centers for several years and knew their cost was ridiculous.", "pics": null, "resp": null, "gmap_id": "0x888a33d5c316823d:0x82f9339efe7f848a"}
{"user_id": "108521383715339781574", "name": "Aiveen Kahalley", "time": 1615842111975, "rating": 5.0, "text": "We have been working with RD Lowes for over 10 years.  Consistent quality, timely response and all around a great company to work with.  Robert and his team do a fantastic job!", "pics": null, "resp": {"time": 1616269119560, "text": "Thank you for all of your business over the years.  We look forward to another 10 with you!"}, "gmap_id": "0x889a4d58159f75c5:0x600174ebd31f1062"}
{"user_id": "103820272252574883237", "name": "Nancy Wilson", "time": 1510691924622, "rating": 5.0, "text": "They do great painting and powerwashing.Very nice and professional work.", "pics": null, "resp": {"time": 1616269141034, "text": "Thank you!"}, "gmap_id": "0x889a4d58159f75c5:0x600174ebd31f1062"}
{"user_id": "107361112754181082258", "name": "Brent Walker", "time": 1598814822828, "rating": 5.0, "text": "He’s been finishing Sheetrock for over 50 years and it shows.  The man is a perfectionist", "pics": null, "resp": null, "gmap_id": "0x889a096838d56037:0x8658fa972a01059"}
{"user_id": "106447936867849466548", "name": "Robert M Pollock", "time": 1505443930431, "rating": 5.0, "text": "Best drywall contractor in Baldwin County.", "pics": null, "resp": null, "gmap_id": "0x889a096838d56037:0x8658fa972a01059"}
{"user_id": "118437865605089602928", "name": "Houston Barnhill", "time": 1601555793087, "rating": 1.0, "text": "No response", "pics": null, "resp": null, "gmap_id": "0x889a096838d56037:0x8658fa972a01059"}
{"user_id": "115953199413974710674", "name": "Mike Williams", "time": 1567811281605, "rating": 5.0, "text": "Very good", "pics": null, "resp": null, "gmap_id": "0x889a096838d56037:0x8658fa972a01059"}
{"user_id": "115684338898093899586", "name": "Derek Herscovici", "time": 1625097313321, "rating": 5.0, "text": "The first thing that let me know I had picked the right general contractor was Jordan Latimer’s attention to detail. Other GC’s weren’t willing to take the extra measurements, or recommend quality parts, or go the extra mile to make sure this project was done right.\nWhen the renovation process began, he communicated the process every step of the way. He let me know where there were issues and promptly set about fixing them with almost no time lost. He helped me achieve my vision for this bathroom and shower remodel and brought in a team of specialists and experts to see it through to completion. He does nothing halfway and values your input too, instead of overriding your ideas. I have gotten to know Jordan a lot during this process, and he is not only a fabulous contractor, but a man of great heart and compassion. He understands people as well as he does home remodeling and does not skimp on either. I cannot reccomend him enough. YOU WILL NEVER NEED ANOTHER CONTRACTOR AGAIN.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOdPBBaWk3njDZF003k-d9vs7pfz6PZN4_eQYGb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipODw-rGTd6-DT3DHfAMCNU1x_8hVE8s5C3MXiVY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNWwsNKZhlc4mIDi3FU1lSanRNnZlhqValPmNO_=w150-h150-k-no-p"]}], "resp": {"time": 1625100981142, "text": "Thank you Derek! That was very kind of you to say those words. I take a lot of pride in my work and I will never take a shortcut to jeopardize the integrity of a job. It has been wonderful getting to know you and I look forward to the continuing work we have going forward from here. Once again your kind words are very much appreciated."}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "113761444590318659955", "name": "Anthony Spina", "time": 1617832784974, "rating": 5.0, "text": "Jordan is a top notch contractor. He went well out of his way to make sure all of our needs were taken care of. He even fixed things we never asked him to fix at no additional cost. Jordan is a perfectionist and pays attention to every detail of his work. I would highly recommend him.", "pics": null, "resp": {"time": 1617839933202, "text": "Anthony, thank you so much for the kind words! I really enjoyed working for your great family and if you ever need us we are always here for you. Thanks again!"}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "111367446420738321926", "name": "Ben Burnett", "time": 1600099560656, "rating": 5.0, "text": "Jordan and his crew did a magnificent job.  Jordan is a honest guy, and his attention to detail in his work is second to none.  I trust him and his craftsmanship.  I knew it from the first time he came to do an estimate.  I would not want anybody else to do my work.  Our kitchen that they did is really beyond words.", "pics": null, "resp": {"time": 1600123490022, "text": "Thank you so much Ben! We are so very thrilled to know that y’all are happy with the kitchen. Looking forward to the future jobs and will get you guys some adjusted numbers just as soon as we can."}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "115787643806721794140", "name": "Tracy Witte", "time": 1620855297792, "rating": 5.0, "text": "Jordan does excellent work and really prides himself in getting a job done correctly. We have hired his company for several jobs over the past 4 years and have always been extremely pleased with his work.  Unlike many local contractors, who are hard to track down, Jordan communicates so well, which makes it easy to work with him. He is *so* responsive by phone, text, etc. We recommend him highly to all of our local friends and will hire him again in a heartbeat for any future repairs/remodeling.", "pics": null, "resp": {"time": 1620863666952, "text": "Tracy, we are so thrilled that you are happy with the outcome of your new front door. It goes so well with everything on the house and this whole project has been a major transformation. You guys are some of my favorite people to work for and thank you so much for the kind words!!"}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "102615839456427204727", "name": "Steve Sforzini", "time": 1615056897331, "rating": 5.0, "text": "Jordan recently did a countertop installation for us.  It was not a huge job but did require some creativity and ingenuity for this particular job.   Jordan came up with a way to do the job and communicated with us every step of the way.  I would describe Jordan as a very conscientious and dependable professional home remodeler.  We are ready for him to do our next job.", "pics": null, "resp": {"time": 1615057688423, "text": "Thank you Mr. Sforzini! We really appreciate the kind words and we will get you an estimate for the next job as soon as we are able."}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "106372914318406106945", "name": "Belle Winful", "time": 1613532917719, "rating": 5.0, "text": "I don' t even know where to begin with this review. I wish I could provide all pictures of our home before and after the complete renovation to see how amazing of a job that was done. JL Remodeling & Home Repair made our home more beautiful than we even envisioned. What I love most about Jordan, the owner, is that he will not improvise the integrity of work being performed by cutting corners. He Is extremely detailed and takes so much pride in his work! You will see it the moment you hire him. He is trustworthy, resourceful, and extremely professional. From how fair and detailed our estimates were in the beginning, to our home being left spotless at the very end; you can have confidence in all work that is done. This is so important because you do not want just anyone handling something as valuable as your home. We are very grateful for him and his company and we will use them for any future remodeling or home repair needs.", "pics": null, "resp": {"time": 1613585842278, "text": "Thank you Mrs. Winful. We really appreciate your kind words and enjoyed working with you guys so much during such an exciting time for your family."}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "104361709111885164596", "name": "Seth Donaldson", "time": 1596741247241, "rating": 5.0, "text": "JL remodeling was a great group of guys to work with. The flooring was done quickly, it looks incredible, and Jordan was very open and easy to communicate with. If I ever need any other repairs done, this will be the first place I go.", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "101898632317564346667", "name": "S Gitter", "time": 1592938932195, "rating": 5.0, "text": "We've had Jordan do several jobs for us. He has always done a great job. We are always more than satisfied with the work and service that he and his team provide.", "pics": null, "resp": {"time": 1592943903576, "text": "Thank you so much Mr. Gitter! It’s been a long time since we have heard from you so I hope you and the family are well! We sure have grown quite a bit since the last time we’ve done anything for you, but would be glad to help you on anything in the future no matter how big or small. Thanks again, as your review is much appreciated!"}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "106018302572371561814", "name": "Emily Joyner", "time": 1584148398225, "rating": 5.0, "text": "I highly recommend Jordan and his group. Every interaction I have had with him has been professional and he is always willing to go above and beyond to make sure I am happy with his work. I recommend him for any work you need done!", "pics": null, "resp": {"time": 1584217543885, "text": "Thank you so much for the kind words Emily! We look forward to working with you again in April!"}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "108204650543647335324", "name": "Rena Cannon", "time": 1561709640043, "rating": 5.0, "text": "Jordan prepares very detailed quotes in a very timely manner. Jordan replaced the mini gutters on my mobile home in Auburn. He did a fantastic job! He also replaced the master bath tub and surround. Again, he did an excellent job. I highly recommend Jordan and will continue to do business with him.", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "117689713259256770977", "name": "A Duke", "time": 1571010679873, "rating": 5.0, "text": "Jordan did an exceptional job remodeling our kitchen. There was an extensive mold issue when we bought our house so he basically gutted the whole area and made sure the mold was completely out.  Overall, I am very impressed with his work and absolutely love our new kitchen!! Jordan was awesome to work with, paid attention to the details, and went above and beyond to make our vision come to life. I would highly recommend him to anyone who is doing a major renovation. He is excellent!", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "105980454704524975478", "name": "Will Miller", "time": 1565570434565, "rating": 5.0, "text": "Jordan at JL Remodeling is the most honest and conscientious contractor we have ever worked with. He was thorough and always kept an open line of communication with us throughout the remodel. He does a very professional job and finished the project in a timely manner. We highly recommend Jordan and found that there's no job he can't do!", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "110141762078877313252", "name": "Margie Rush", "time": 1553558229864, "rating": 5.0, "text": "\"Thank you for helping us with our bathroom remodel. We are very pleased. Great work. Very dependable and professional. Detailed estimates and will use again if needed.\"", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "106084934866979419675", "name": "Colleen S.", "time": 1566080166947, "rating": 5.0, "text": "Replaced an existing tub/shower with a shower.  Great job, impressive work ethic, excellent value.   Highly recommend  you give them a look.", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "112241814163773453683", "name": "Pat Margreiter", "time": 1560557573199, "rating": 5.0, "text": "We have used JL Remodeling for 3 very different projects for our property in Auburn. All have been done professionally, on time and at a fair price. We highly recommend him and will most definitely use Jordan again.", "pics": null, "resp": {"time": 1560559174613, "text": "Mrs. Margreiter, you guys have been a pleasure to do business with and we will gladly take on anything you may have in the future. We’re always just a phone call away!"}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "114289751674439498901", "name": "CHERYL HALE", "time": 1546877344506, "rating": 5.0, "text": "JL Remodeling did a wonderful job on our home in Auburn, AL.\nThe mold remediation and repair of the leaky ceiling has been a success for a year now. We hired them again this week to do more renovation projects around the home. Very knowledgeable, professional, efficient, timely proposal, reasonable pricing and attention to detail. I Highly recommend this company for all of your repair/renovate needs in Auburn area.", "pics": null, "resp": {"time": 1546994962719, "text": "Mrs. Hale, you’ve been a pleasure to work with and we will gladly take on any projects you ever have."}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "117762930173050630356", "name": "Carolyn Mitchell", "time": 1556044561596, "rating": 5.0, "text": "I recently had my master bath remodeled, and the transformation is amazing.  Since I was at home during the work period, Mr. Latimer consulted me frequently about the details making sure everything was done to my satisfaction. I am very pleased with the workmanship and cost of the project -- Well Done!", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "110522838957337927003", "name": "Brenda Woods", "time": 1558796001408, "rating": 5.0, "text": "Jo remodeling & home repair did an excellent job remodeling our kitchen and bathroom. We are very pleased with the results and would recommend them highly.", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "117433545430271442612", "name": "Daniel Smith", "time": 1618621138058, "rating": 5.0, "text": "Fast place to unload", "pics": null, "resp": null, "gmap_id": "0x88626be396a39ac5:0xa0062bfeb4d6b0cc"}
{"user_id": "105935908789139725703", "name": "Frederick Jones", "time": 1603746191224, "rating": 5.0, "text": "This place is the best hands down❤️❤️❤️", "pics": null, "resp": null, "gmap_id": "0x88626be396a39ac5:0xa0062bfeb4d6b0cc"}
{"user_id": "107130690262869174492", "name": "Captain Tillman", "time": 1547140414961, "rating": 5.0, "text": "Very helpful and knowledgeable", "pics": null, "resp": null, "gmap_id": "0x88626be396a39ac5:0xa0062bfeb4d6b0cc"}
{"user_id": "103460973053303479449", "name": "d jones", "time": 1435157325110, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x88626be396a39ac5:0xa0062bfeb4d6b0cc"}
{"user_id": "108588369286405910337", "name": "Walter West", "time": 1517787334500, "rating": 5.0, "text": "4930 University Square NW, Huntsville, AL 35816", "pics": null, "resp": null, "gmap_id": "0x88626be396a39ac5:0xa0062bfeb4d6b0cc"}
{"user_id": "102904645922518757008", "name": "Michael Lafreniere", "time": 1617139359271, "rating": 5.0, "text": "Unloaded very quickly,but must be here before 3pmcst or they'll make you wait until the following day. I got here at 2:30 lol", "pics": null, "resp": null, "gmap_id": "0x889a526e041ae003:0xec73d23c3fd2e900"}
{"user_id": "113112090124441062070", "name": "Douglas Reeder", "time": 1601590284947, "rating": 4.0, "text": "Great place with great service. Prompt and courteous.", "pics": null, "resp": null, "gmap_id": "0x889a526e041ae003:0xec73d23c3fd2e900"}
{"user_id": "115514753202525201497", "name": "Joseph Deloach", "time": 1613407254756, "rating": 2.0, "text": "Did not have what I wanted, and didn't know wind they would have any.", "pics": null, "resp": null, "gmap_id": "0x889a526e041ae003:0xec73d23c3fd2e900"}
{"user_id": "100367873977925869403", "name": "Herewego- again", "time": 1592574782949, "rating": 5.0, "text": "Been business with them for years. Good people", "pics": null, "resp": null, "gmap_id": "0x889a526e041ae003:0xec73d23c3fd2e900"}
{"user_id": "112768771252064153211", "name": "Matthew Van Norman", "time": 1537304370404, "rating": 5.0, "text": "The customer service provided by Henry at the L & W Supply in Mobile, AL has been beyond exceptional.  He goes above and beyond to take care of his customers. Go see him at their store here in Mobile for any of your drywall, insulation and roofing materials. You will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x889a526e041ae003:0xec73d23c3fd2e900"}
{"user_id": "110181129910474838550", "name": "David Puzar", "time": 1553819719433, "rating": 4.0, "text": "Need to arrive before 8 am to get offloaded quicker.  Public has proirity. Staff was accondating and worked dilegently to do the best they could.", "pics": null, "resp": null, "gmap_id": "0x889a526e041ae003:0xec73d23c3fd2e900"}
{"user_id": "105705973681774126519", "name": "Dede Rought", "time": 1608740686481, "rating": 5.0, "text": "Very slow at unloading", "pics": null, "resp": null, "gmap_id": "0x889a526e041ae003:0xec73d23c3fd2e900"}
{"user_id": "100756451621433454993", "name": "Deanna Odom", "time": 1520694894888, "rating": 5.0, "text": "I can’t say enough about L&W especially Henry! He was there anytime to help solve any problems and he and his guys made it happen. I wish other sale reps were that concerned about their customers at all businesses! Thanks again Henry", "pics": null, "resp": null, "gmap_id": "0x889a526e041ae003:0xec73d23c3fd2e900"}
{"user_id": "117788803187601122003", "name": "Erik Nist", "time": 1600893421749, "rating": 5.0, "text": "We had a new condo in our rental program that needed a makeover. Candace and Gene totally came through and did an amazing job on a very short time frame. I was blown away about how great they were in all aspects of getting the job done. Timely, cost effective, thorough . . . I could go on and on. Bottom line, I'll be calling Island Services when my clients need the job done right. Thanks y'all!", "pics": null, "resp": {"time": 1596573491747, "text": "Thanks Erik! Glad we could help out. Popcorn removal is always a big improvement. 👍"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "102744480065288446463", "name": "Michael Overton", "time": 1422982208234, "rating": 5.0, "text": "I have known Gene and Candace a long time and they have always been extremely professional and just plain nice to be around.  Over the years we have both been clients of each other.  Island Services has got to be without a shadow of a doubt one of the top choices in the whole southern Baldwin County and Gulf Island Areas.\n\nYou will be happy you chose them and decided to eliminate frustration and stress.\n\nM.O. WebFocus Marketing Group", "pics": null, "resp": {"time": 1422984331881, "text": "Thank you!"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "105281299784549195965", "name": "Bellezza Photography of Alabama", "time": 1422983993172, "rating": 5.0, "text": "Great Company, Great Service, Great Results,\nThat's 3 Greats... What else do you need to know?\nHighly recommended.", "pics": null, "resp": {"time": 1422984445928, "text": "Thank you!"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "112379345089725188905", "name": "Aaron Aasen", "time": 1422982699109, "rating": 5.0, "text": "Great people who pay close attention to detail.  Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "105550016850619951416", "name": "Kaytrielle Jones", "time": 1423616403803, "rating": 5.0, "text": "Honest, good hearted people! You can count on quality service", "pics": null, "resp": {"time": 1423618188918, "text": "Thank you Kaytrielle!"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "114405505271778312721", "name": "Iris Meyer", "time": 1423583503418, "rating": 5.0, "text": "Highly satisfied with Island Services! They provide outstanding workmanship and are very professional!", "pics": null, "resp": {"time": 1423584064108, "text": "Thank you Iris!"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "115978587226826137962", "name": "Robert Schwarze", "time": 1422533529689, "rating": 5.0, "text": "Very honest and upright people.", "pics": null, "resp": {"time": 1422572928888, "text": "Thank you!"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "103220891827753950407", "name": "Joshuah Bryant", "time": 1422978466142, "rating": 5.0, "text": "Detailed oriented company. You want go wrong be choosing them for your home repair needs.", "pics": null, "resp": {"time": 1422979157623, "text": "Thank you!"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "104505869960681609073", "name": "Jessie YOUNG", "time": 1616796289664, "rating": 1.0, "text": "No response from them.", "pics": null, "resp": null, "gmap_id": "0x887d49daaaaaaaab:0xfbc83f23eaad57c1"}
{"user_id": "114098857373360298144", "name": "Lorinda McCutchen", "time": 1461987966596, "rating": 5.0, "text": "Very professional and courteous. Extreme attention to detail. I have and will always use Mark Forsythe Painting. They are trustworthy and honest.  They stay on budget and usually finish before deadline. You cannot go wrong hiring this company. We are totally satisfied customers.", "pics": null, "resp": null, "gmap_id": "0x887d49daaaaaaaab:0xfbc83f23eaad57c1"}
{"user_id": "101394250499243931377", "name": "Brandi Clark", "time": 1487684487370, "rating": 5.0, "text": "Mark Forsythe Painting is the best in town! Always showed up, and did an impeccable job. The crew was patient with me when I ran into some paint color issues. They were extremely nice and polite, and they made sure that the job they did was one I would be more than happy with. Thanks to Mark and his team!", "pics": null, "resp": null, "gmap_id": "0x887d49daaaaaaaab:0xfbc83f23eaad57c1"}
{"user_id": "103231627725120979426", "name": "Deborah Parrott", "time": 1461879567561, "rating": 5.0, "text": "Mark Forsythe Painting undertook a huge job and did it beautifully. They removed old electric heaters, patched and painted the drywall as well as repaired popcorn ceilings in an older home. My house looks awesome. I will call Mark for all my painting needs---very reasonable price too!", "pics": null, "resp": null, "gmap_id": "0x887d49daaaaaaaab:0xfbc83f23eaad57c1"}
{"user_id": "104604042614624056228", "name": "Justa Cracka", "time": 1462506398682, "rating": 5.0, "text": "Very honest and dependable. Takes  pride in what he does, and that's something you don't see a lot of nowadays. I would highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x887d49daaaaaaaab:0xfbc83f23eaad57c1"}
{"user_id": "110547651454161212330", "name": "Patrick Patterson", "time": 1448543717828, "rating": 5.0, "text": "Mark and his staff are incredibly honest, hard-working, friendly and reliable. Their prices are ultra-competitive. They were highly recommended to me and deservingly so.", "pics": null, "resp": null, "gmap_id": "0x887d49daaaaaaaab:0xfbc83f23eaad57c1"}
{"user_id": "111992350505711190435", "name": "Rickey Morris", "time": 1594386913757, "rating": 5.0, "text": "Dose a great job", "pics": null, "resp": null, "gmap_id": "0x887d49daaaaaaaab:0xfbc83f23eaad57c1"}
{"user_id": "108969579279603322887", "name": "Kelsey Lindsey", "time": 1461724042412, "rating": 5.0, "text": "If you want one of the best painters in the shoals area call Mark Forsythe. He's one of the best I've seen!", "pics": null, "resp": null, "gmap_id": "0x887d49daaaaaaaab:0xfbc83f23eaad57c1"}
{"user_id": "104378838507977027743", "name": "laurence allen", "time": 1579592606381, "rating": 1.0, "text": "Horrible experience to be professional builders", "pics": null, "resp": null, "gmap_id": "0x862831bfb7129e77:0x633afefdb0cc9cbf"}
{"user_id": "100872051604800994421", "name": "Berta Mexidor", "time": 1531252831023, "rating": 4.0, "text": "Good quality work", "pics": null, "resp": null, "gmap_id": "0x862831bfb7129e77:0x633afefdb0cc9cbf"}
{"user_id": "103233750565246896475", "name": "Gene Montecchie", "time": 1534905323396, "rating": 5.0, "text": "Phillips scraped, patched and retextured a kitchen ceiling for us in Gulf Shores.  They showed up when they said would. They protected the floors and cabinets. They finished on time and within budget. What else could you ask for?", "pics": null, "resp": {"time": 1541128347046, "text": "Thanks for the review! Happy to help with your Sheetrock repair project in Gulf Shores!"}, "gmap_id": "0x889a0f57da1efc93:0x4cbe1e4def3cfab3"}
{"user_id": "110571431380800321627", "name": "Steven Riley", "time": 1617104336387, "rating": 1.0, "text": "I would not recommend this company. They did not show up when they were supposed to. Cesar would have young teenagers in our corporate building and not be there to supervise. They got paint on equipment, doors, windows, carpet, furniture. It was a mess. They ripped our baseboards off and never came back to repair them and would not answer my calls or texts. Will be reporting them to the BBB. Stay away!!!", "pics": null, "resp": null, "gmap_id": "0x88892861d8cccd1b:0xf8f06654462984b2"}
{"user_id": "102806780271286571098", "name": "Cindy Locarno", "time": 1612104382256, "rating": 1.0, "text": "Would not recommend this company. They started a job of repairing dry wall and painting. They never showed up when they said they would. They would come late and work a few hours and leave and then they never came back to finish the job. Left a mess in my house. I’ve called, they wouldn’t answer. Left messages and texts.  No response. The worst.", "pics": null, "resp": null, "gmap_id": "0x88892861d8cccd1b:0xf8f06654462984b2"}
{"user_id": "103487842586056385279", "name": "Kenia Nieto", "time": 1566955033977, "rating": 5.0, "text": "I just got my house painted by Cesar and his team polo painting it was very clean and neat and they do everything you ask. I highly recommend them. They are very nice", "pics": null, "resp": null, "gmap_id": "0x88892861d8cccd1b:0xf8f06654462984b2"}
{"user_id": "112684848711060805168", "name": "Jon Clarke", "time": 1561434346688, "rating": 5.0, "text": "Mr. And Mrs. Polo were great to work with on our painting project!  There crew did a great job painting the exterior of our house and staining our deck.  Thank you for giving our home a new look and for the great recommendations on paint color!", "pics": null, "resp": null, "gmap_id": "0x88892861d8cccd1b:0xf8f06654462984b2"}
{"user_id": "114756505904637326317", "name": "Abby Smith", "time": 1566955840889, "rating": 5.0, "text": "Just got the outside of my house painted by Cesar. He did a great job. I would recommend Polo Painting for any painting you need done.", "pics": null, "resp": null, "gmap_id": "0x88892861d8cccd1b:0xf8f06654462984b2"}
{"user_id": "113708465106246537723", "name": "Michelle Washington", "time": 1566956419282, "rating": 5.0, "text": "Last week they came to hang and finish  drywall in my basement. They kept everything clean and the quality of work was wonderful. Great job.", "pics": null, "resp": null, "gmap_id": "0x88892861d8cccd1b:0xf8f06654462984b2"}
{"user_id": "110310239848127797189", "name": "Madison Prokop", "time": 1559245164090, "rating": 5.0, "text": "If any of you are looking for drywall or painting, I HIGHLY recommend Polo Painting and Drywall. They just got done scraping our ceilings, prepping and repainting(🤢) and everyone warned me how gross it would leave our house. Cesar had his team plasticed  off everything before scraping and thoroughly cleaned the areas before leaving each day. Today was their last day and he left two ladies to pretty much deep clean my house before leaving. I cannot find an imperfection in his work and he was incredibly priced. Two huge thumbs up!", "pics": null, "resp": null, "gmap_id": "0x88892861d8cccd1b:0xf8f06654462984b2"}
{"user_id": "116033814014981537781", "name": "Jenny Beasley", "time": 1555732024224, "rating": 5.0, "text": "The best painting company that I have ever used! Their attention to detail was incredible. They were so professional, fast and reliable. I would HIGHLY recommend!!!", "pics": null, "resp": null, "gmap_id": "0x88892861d8cccd1b:0xf8f06654462984b2"}
{"user_id": "107201341493675436396", "name": "Chris S", "time": 1607894919177, "rating": 5.0, "text": "William did an awesome job painting our entire house's exterior. Even though we surprised him with a last-minute change in the main color choice, he was able to help us pick a new color that fit within the original budget and still looked great. It really changed the house's look for the better! His attention to detail and careful prep work ensured that everything came out looking as best as possible. Would definitely work with him again.", "pics": null, "resp": {"time": 1607895706673, "text": "Thanks Chris!"}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "102635029809824525762", "name": "Tajale McClam", "time": 1601429116622, "rating": 5.0, "text": "William did such a fantastic job on painting two of my bedrooms as well as my ceiling. He did an accent wall to each room and they both look absolutely amazing. He is very professional and his work is very superb. My ceiling was very hard to paint. It is a popcorn style ceiling. He really wanted to make sure it was done right and paid great attention to detail.  I was very pleased with the results. I look forward to using him again. Thank you!", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "106720207921957234165", "name": "Adrian Brown", "time": 1600623574870, "rating": 5.0, "text": "William painted our interior - in hard to reach high places, and ceilings, and some dry wall repair. He did an excellent job and cares about getting the job done right, does not cut corners. He was a great find and will use him in the future and have already recommended to others!", "pics": null, "resp": {"time": 1600627318663, "text": "Thanks Adrian! Enjoy the new colors."}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "114570658738051028416", "name": "Ming Sun", "time": 1617831523108, "rating": 5.0, "text": "Great work with very reasonable price done in 2017!", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "110066629227037526875", "name": "Kathy Gereski", "time": 1600017089963, "rating": 5.0, "text": "William did an exceptional job power washing our driveway, sidewalk, back porch and steps. He also repaired drywall in our basement and painted all of our exterior railings that were showing wear after 8 years.  I highly recommend his services.", "pics": null, "resp": {"time": 1600020767878, "text": "Thanks Kathy."}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "113717490511225147937", "name": "Avery Nagata", "time": 1601591600492, "rating": 5.0, "text": "William power washed and stained my fence. It took him less than a week to finish it. He was super responsive and very professional.", "pics": null, "resp": {"time": 1601597320549, "text": "Thanks Avery. Enjoy it"}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "107992931084418505572", "name": "Jason Freeman", "time": 1572112176197, "rating": 5.0, "text": "Performed an entire interior painting.  Excellent quality.  Great attention to detail.  Takes pride in doing it right.  I would highly recommend this company.  I would hire this company again for the same job and will consider them for more jobs in the future. Very satisfied with the finished product!", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "111295191319822859862", "name": "Susan Bachle", "time": 1566930070042, "rating": 5.0, "text": "Wonderful experience!  I had just purchased a new home and hired William to repaint the entire house.  He did a fantastic job at a very reasonable price!   Everyone that comes into my home comments on how precise the painting is - which speaks volumes!", "pics": null, "resp": {"time": 1566931460371, "text": "Thanks Susan. Glad I was able to transform your new home. Enjoy it!"}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "116968192793239162521", "name": "Jessicalynnsman Hardy", "time": 1486832210637, "rating": 5.0, "text": "This painter is HIGHLY RECOMMENDED. He truly stands behind his work and gets the job done. Very satisfied with the work he did in our house. I would definitely use his services again. I promise I will get the good paint next time though. Thank you William for a job extremely well done.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "111597922471708172223", "name": "Archella George", "time": 1463363082951, "rating": 5.0, "text": "William did an awesome job painting two rooms in our new home! We hired another painter to paint our nursery and not only was the job not satisfactory but the color was too dark for a nursery. William came in and repainted the room and we love it!! He also painted our office for us as well! He was was very detailed and clean and quick! Would definitely recommend him and work with him again!", "pics": null, "resp": {"time": 1464409535124, "text": "Thank you!"}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "100501390529140460568", "name": "Mich S", "time": 1473128750569, "rating": 5.0, "text": "William painted the inside of a house I'm putting on the market and did a fantastic job. House looks wonderful. He patched several rough spots and a crack so well that you couldn't tell they existed. He was neat while doing his work, and he cleaned up after himself when he was done. He also pressure washed my fence (looks like new and I was gobsmacked at how good it looked) and painted my front rails and back deck. I would highly recommend him and do plan on using him again.", "pics": null, "resp": {"time": 1473130846368, "text": "Thanks for the kind words and good luck with the sale!"}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "104064375591025959776", "name": "Christopher Lawson", "time": 1530976561111, "rating": 5.0, "text": "I've had my whole house painted, but the room this company did for me was superior and excellent. I wish I had hired them for the whole house and will be hiring them in the future. They were friendly, responded to my questions in a timely manner, and were reasonably priced. They worked me into the schedule in a very timely manner as well.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "104880882379355850379", "name": "Daniel Lewis", "time": 1456762148052, "rating": 5.0, "text": "William did a great job painting and pressure washing for us. The paint makes our interior look so much better! Our fence and deck look brand new! He was able to get us on the schedule quickly and went above and beyond to help us meet a deadline. I highly recommend him!", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "114786564483144362565", "name": "Emily Pauli", "time": 1483754892987, "rating": 5.0, "text": "William painted two rooms, trim, and repaired and painted what I thought was a dry wall ceiling but was the original 1946 plaster. He did an amazing job on all of it!!!  He is professional, very neat, and cleaned each evening and at the ending the job.  Even with the unexpected plaster on the ceiling, William finished on time and budget!  His skills and attention to detail are exceptional. I will use him again - the outside needs an update when the weather warms.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "108586724734828739774", "name": "RUTH RICHI", "time": 1481059211248, "rating": 5.0, "text": "Very professional, reasonably priced. Beautiful work, very neat and clean. Our home needed a lot of caulking, nothing was missed. The paint job is beautiful. I am very satisfied and will call him back the next time I need a painter.\nOz and Ruth", "pics": null, "resp": {"time": 1481064850086, "text": "Thanks for the kind words guys. I enjoyed watching your house transform.  Great customers!"}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "108736025073883773521", "name": "Belinda Wolfe", "time": 1435331559873, "rating": 5.0, "text": "I was very satisfied with the work that William of Color Life Painting provided. His work was very high quality and done with in the time frame given. He replaced and painted rotten siding, replaced and painted some eaves and built a lattice panel. He also painted windows, steps, and garage etc. His prices were very reasonable and He was very professional. I would highly recommend using his services.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "102103611698318318790", "name": "Alex Britt", "time": 1463622685082, "rating": 5.0, "text": "William was way more than impressive. He was professional, timely and his skill set really exceeded are expectations. He painted our front door, half bath and a few accent walls. He will definitely be our choice for our next project!", "pics": null, "resp": {"time": 1464409480166, "text": "Great Customers, Enjoyed the work."}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "106203523501962384497", "name": "Lisa Carter", "time": 1433116926446, "rating": 5.0, "text": "William did an outstanding job repairing my screened porch. Also he pressure washed the siding on my house for the most reasonable rate I'd found!  Excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "104637731270475855669", "name": "Arielle Cain", "time": 1484360714980, "rating": 5.0, "text": "William did a phenomenal job on our nursery. He was super polite and informative during our inital phone call. After talking about what we needed done, he accommodated our schedule by coming a day in advance and picked up the paint for us. When he showed up at our home, he was everything he portrayed via our phone calls. A very trustworthy and personal guy. And not only is he the kind of painter that you feel comfortable leaving alone to paint, he does an incredible job with his attention to detail. We recommend using William for any paint job and will be using him to finish our home in the near future!", "pics": null, "resp": {"time": 1484367899377, "text": "Thanks very much for the kind words.  Enjoyed meeting you and looking forward to the future work!"}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "102287906250692812179", "name": "John Klingel", "time": 1512932234181, "rating": 5.0, "text": "William did a fantastic job at a GREAT price and held schedule.  He worked with us and was flexible.  We would certainly recommend him for your painting needs.", "pics": null, "resp": {"time": 1512933077728, "text": "Thanks John. Enjoyed the work! Nice to meet you guys."}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "103755464699806227776", "name": "Chris Helton", "time": 1453915608845, "rating": 5.0, "text": "William did a great job. He has a unique approach to business.... He shows up when he says, and charges the amount that he committed to. Weird concept, but worked pretty well for me!\nHe painted my deck, handrails, and concrete floor and I was very satisfied. I will use him again.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "107760606175945116091", "name": "Tom Byrne", "time": 1432936336749, "rating": 5.0, "text": "William did a GREAT job. Lots of attention to detail, very neat. Completed the job ahead of schedule. Did I say he did a GREAT job AAA++", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "111710700697882384233", "name": "Meghan Darby", "time": 1474312141886, "rating": 5.0, "text": "William painted the trim, interior walls, and ceilings of our new (older) home. He was expertly meticulous and all finishes were perfect. We could not be more pleased with the outcome. He also stuck to our timeline, budget, and was extremely trustworthy.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "111598096345510143650", "name": "Darrell Stokes", "time": 1437078637419, "rating": 5.0, "text": "William has painted a fence, bedroom and bathroom for me.  His prices and especially his quick response and flexibility has allowed me to finish some jobs around the house in a minimal amount of time and cost.  He has always been quick to give me an estimate and even quicker to get out and get the work done.  I will be using him again!", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "116993977556717171688", "name": "Matt H", "time": 1435198033505, "rating": 5.0, "text": "Great job staining my deck! Great attention to detail.  Would definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "105665867873962940163", "name": "Hal Wilson", "time": 1432939792135, "rating": 5.0, "text": "William: hard worker, and went out of his way to be helpful. The paint job on the side of the house? You've only gotta ask the neighbors. Plus, plus.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "107428630824410232121", "name": "Jerrell Reynolds", "time": 1441281384636, "rating": 5.0, "text": "Our eves on the house were peeling really bad. I called William and he was able to come out at MY convenience and take care of them. he went the extra mile by scraping off all the old paint to prevent it from peeling again. William did a great job and at a great price. No paint in places its not suppose to be and real clean lines. Rain came in but he came back out on the next day when there was no rain and finished the job. He did such a good job we had him paint our garage door while he was there. defiantly calling him back to do our fence in the near future. A+ job and very professional guy.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "111069269092817540180", "name": "Marsau Scott", "time": 1477600889546, "rating": 4.0, "text": "I have had the pleasure of dealing with the owner today. He and I didn't see eye to eye at first, we both communicated our frustration, and in the end we resolved our differences in a healthy manner. People and businesses make mistakes but the mark of a true businessman is how he/she is accepts responsibility for their actions and continues to make positive changes.\nThank you William, I look forward seeing your company progress.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
