{"user_id": "115384531171078436726", "name": "Dajun Godwin", "time": 1621269470798, "rating": 5.0, "text": "Not only the customer service, but the all around positive vibe you experience here at Western Star of Dothan is top notch! They have great mechanics and are great honest people to do business with! Stan and Christy run a great outfit! I would recommend anyone in need of any trucking needs come visit them!", "pics": null, "resp": null, "gmap_id": "0x889293bf45f2127f:0x1907252ec4c781ec"}
{"user_id": "107539229081798948793", "name": "Carlos Millas", "time": 1571855351687, "rating": 5.0, "text": "Nice.and good experience  service efficiency  fair $$$ parts and very good service.\nVery recomend.\nT.you to Rodney in parts dpt, service mgr.Dwyne Secretary .", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN-GLVSiLPBFVJ2tahMjjZ108Dbk0J5pTvPiqJZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNRxpiizGyRwtR1ILHYmWoAEaFSai-QqECKV85W=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN_PDwygysyTrR9cW1n-vMqONrvMmw4UHRmD-rD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipORoohtTBZqI5FHgJ804kxkrJp9Qsef565LdfRJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNJJE5xlE2tWsf3crtq4iPQ0i5sWaEnNT6Xc846=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPU0d9D5G0K_qD4T7LjSLq2PXRD2UQkIvskSYFf=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889293bf45f2127f:0x1907252ec4c781ec"}
{"user_id": "114512858369905941941", "name": "Melissa Ard", "time": 1536351709951, "rating": 5.0, "text": "Great place and great people wouldn't take our truck anywhere else.", "pics": null, "resp": null, "gmap_id": "0x889293bf45f2127f:0x1907252ec4c781ec"}
{"user_id": "115239955534095764873", "name": "Jou Moer", "time": 1493935659210, "rating": 5.0, "text": "If you want your truck repairs done right. This is the place to go. They are Profesional helpful and knowledgable. Stan will go out his way to help. Any Detroit work I'll go out of my way to bring it here. Nice people to deal with.", "pics": null, "resp": null, "gmap_id": "0x889293bf45f2127f:0x1907252ec4c781ec"}
{"user_id": "115224009992860559271", "name": "Charles Andrews", "time": 1609288817565, "rating": 5.0, "text": "Friendly staff.", "pics": null, "resp": null, "gmap_id": "0x889293bf45f2127f:0x1907252ec4c781ec"}
{"user_id": "109655854900661884066", "name": "bruce cochran", "time": 1533562730720, "rating": 5.0, "text": "Great service..  awesome staff....best truck dealer in Dothan Al.", "pics": null, "resp": null, "gmap_id": "0x889293bf45f2127f:0x1907252ec4c781ec"}
{"user_id": "116810894409425081121", "name": "David Brown", "time": 1522527531090, "rating": 5.0, "text": "Great place to be very friendly staff will go to extra mile.", "pics": null, "resp": null, "gmap_id": "0x889293bf45f2127f:0x1907252ec4c781ec"}
{"user_id": "116652654937533550339", "name": "William Carter", "time": 1520256853095, "rating": 5.0, "text": "Great mechanics. That usually get right on your truck.", "pics": null, "resp": null, "gmap_id": "0x889293bf45f2127f:0x1907252ec4c781ec"}
{"user_id": "108176547811629069585", "name": "Robert Atkinson", "time": 1559406811845, "rating": 5.0, "text": "Very friendly and helpful", "pics": null, "resp": null, "gmap_id": "0x889293bf45f2127f:0x1907252ec4c781ec"}
{"user_id": "106530739054160143566", "name": "Michael Wallace", "time": 1511157460996, "rating": 5.0, "text": "i have been dealing with them over 15 years its a pleasure.they always take care of my service needs", "pics": null, "resp": null, "gmap_id": "0x889293bf45f2127f:0x1907252ec4c781ec"}
{"user_id": "113675839062393152128", "name": "Beth Scott", "time": 1537742881726, "rating": 5.0, "text": "Love these people like family!!!", "pics": null, "resp": null, "gmap_id": "0x889293bf45f2127f:0x1907252ec4c781ec"}
{"user_id": "110670755539274814933", "name": "Wesley Mccafferty", "time": 1621989281309, "rating": 2.0, "text": "This place is no longer the location for Warrior Tractor Company.", "pics": null, "resp": null, "gmap_id": "0x88628ba4a9442dcd:0xe1ef71c61a8d407b"}
{"user_id": "107417237407074755060", "name": "Bradley Carwile", "time": 1594305837234, "rating": 5.0, "text": "New Grayson Carter and Son Contracting location", "pics": null, "resp": null, "gmap_id": "0x88628ba4a9442dcd:0xe1ef71c61a8d407b"}
{"user_id": "104547137208826963769", "name": "Jay Bolton", "time": 1554023712126, "rating": 4.0, "text": "Nice friendly helpful service.", "pics": null, "resp": null, "gmap_id": "0x88628ba4a9442dcd:0xe1ef71c61a8d407b"}
{"user_id": "108062893508860136211", "name": "Kim Kimbrough", "time": 1540406652206, "rating": 5.0, "text": "Great people", "pics": null, "resp": null, "gmap_id": "0x88628ba4a9442dcd:0xe1ef71c61a8d407b"}
{"user_id": "112193099661968814708", "name": "Marcus Pigford", "time": 1621811997028, "rating": 5.0, "text": "I have been to Peach State in Georgia several times, received the best service at this location. Justin very attentive and extremely helpful. I live much closer to two other dealers but would definitely come back to this one.", "pics": null, "resp": {"time": 1621973216961, "text": "Thank you,  Marcus. We are so glad you are a happy Peach State Truck Centers Customer and we appreciate you taking the time to share your experience in our Tuscaloosa shop and the five-star review! We'll let Justin know about your shout on the job he did for you, we always love to hear when we succeed in creating a great customer experience. We value you as our customer and thank you for your loyalty. Safe travels Marcus.\n\nCheers,\n\nAlabama Freightliner & Western Star"}, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "102146792338210032984", "name": "Jj", "time": 1560005731153, "rating": 5.0, "text": "A good place to get your truck serviced.  Good location and fast service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOS1-u-fNqcN_v1hzqGMqo2kACwoC2Uzj5zSky7=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP2-35U8dnVHYV8frQ_PB7hOLeaZuPUoMPMxvHG=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "117928301840694787725", "name": "Latiqua London", "time": 1616960360138, "rating": 5.0, "text": "I Usually don’t do many reviews but these guys are awesome! I have a 26ft Box truck that they diagnosed for me and got right down to the issue! They also make you feel very comfortable at there location in Tuscaloosa. I had my 5 years old son with me who they were very kind and accommodating to. They also stayed over and helped me with an emergency issue with my Reefer. They go beyond with the effort and u understanding customers. JT and his crew are great! Service representative is also sweet! Highly recommended", "pics": null, "resp": {"time": 1617122341067, "text": "Thank you,  Latiqua. We are so glad you are a happy Peach State Truck Centers Customer and we appreciate the five star review!\n\nCheers,\n\nAlabama Freightliner & Western Star"}, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "108748644928493512674", "name": "Mr.Michael Hatten Sr", "time": 1623092600446, "rating": 1.0, "text": "They need more mechanics because it takes to long to get the work done had my truck for 3weeks and still not fixed", "pics": null, "resp": {"time": 1623098659732, "text": "Hi, Mr.michael Hatten, we are sorry to hear about your experience at Peach State Truck Centers in Tuscaloosa. We have reviewed our records and we can not find a truck that has been in our shop that long nor can we find any information under this name. We value our customers and would like to learn more about your situation. Can you please email us at ServicesupportRM@peachstatetrucks.com and tell us more about your experience? We look forward to hearing from you.\n\nThank you,\n\nAlabama Freightliner & Western Star"}, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "107358278520501986007", "name": "J_ D", "time": 1544509355166, "rating": 5.0, "text": "A true bunch of professionals from front to back. Called them up after they opened told them I was a couple hours away and asked if they’d be able to get me in that day when I showed up. The kind young lady in service told me they would so I hammered down. Got there and they had couple trucks in front of me that beat me in but was still told someone would look at my truck at least before they closed. 3 pm Roll Tide around and tech comes tells me to pull in front of his door. Dude was a true professional and very knowledgeable and even stayed past the time he was supposed to get off at just to get me back on the road that night. Needless to say I’m satisfied and recommend at least giving them a call. Oh ya and Roll Tide", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMdDSDcPakx539N7D8nvxJlGNR_N6o-7e-3AlxU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "112317522662383039486", "name": "Anita Russell, Bottom Line", "time": 1619658189743, "rating": 1.0, "text": "We were out of work for 3 weeks for a job that we were told took a few days.  Doesn't help when we walk to our truck to see mechanics laughing and watching YouTube videos.  Worst of all...after thousands of dollars the truck broke down again. The sad thing about it this seems to be the norm when dealing with Freightliner repair shops.    This is disgrace!", "pics": null, "resp": {"time": 1620858460714, "text": "Hi, Anita Russell, Bottom, we are sorry to hear about your experience at Peach State Truck Centers Tuscaloosa. We value our customers and would like to learn more about your situation. Can you please reach out to us with the vehicle vin number and provide more details about your experience at servicesupportRM@peachstatetrucks.com? We care about you as our customer and we would like to further assist you.\n\nWe look forward to hearing from you,\n\nAlabama Freightliner & Western Star"}, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "105616183440390180467", "name": "Pastor Preston Davis", "time": 1602185790215, "rating": 5.0, "text": "Where do I start? I limped in unannounced and sat in the parking lot, read the reviews and thought OMG!!! What have I gotten myself into? Upon entering the shop I was greeted, got to the counter was greeted again, 45 minutes later my truck is in a bay, less than 2 hours repairs are made and I am beginning to think, those reviews COULD NOT have been about this location!!!! If ever I have a problem in this area and I can not limp in I WILL HAVE IT TOWED here!!! These guys were class 1 people!!! They kept me in the loop of EVERY STEP of the way. I strongly recommend Alabama Freightliner for all your truck needs\nJustin at the service counter, man you ROCK!!! BUT MY FAVORITE was Bug Josh, you are the man .....THANK YALL SO MUCH FOR GETTING ME BACK ON THE ROAD....you all lived up to your motto today!!!! Super honored to have met you, again thanks a bunch.\nSkywalker w/ Hawk Logistics!!!", "pics": null, "resp": {"time": 1602269993407, "text": "Thank you,  Pastor Preston. We are so glad you are a happy Alabama Freightliner Customer and we appreciate the great review! Please reach out if we can help you again in the future.\n\nCheers,\n\nAlabama Freightliner"}, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "102692671500219957945", "name": "Tigers Are My Totem", "time": 1591901131829, "rating": 5.0, "text": "Good job!  I was seen in the  first  90 minutes for assessment and repairs were done in 1.5 days.  Definitely a good place to go for repairs", "pics": null, "resp": {"time": 1592319092478, "text": "Thank you,  Tigers Are My Totem. We are so glad you are a happy Peach State Truck Centers Customer  and we appreciate the five star review! We love our customers and we work super hard to keep you up and running. Thank you for trusting us. Safe travels.\n\nCheers,\n\nAlabama Freightliner</div>"}, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "111407589157788051502", "name": "Tyrone Husbands", "time": 1549477315996, "rating": 5.0, "text": "Came in with at 7 am with adifferential oil leak... they got me in and out by noon. Great job and appreciate you making me a priority knowing I was under an expedited load. 5 stars to Service manager service reps and the mechanic whom I didn’t get name. Thanks", "pics": null, "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "104834655209150995033", "name": "Todd Montana", "time": 1571095116822, "rating": 2.0, "text": "They finally fixed my bunk heater. It took about 20 minutes to fix. I arrived@ 7 a.m when they opened. They finally got me in the shop by 215 p.m. I asked before 11am about waiting 4 hours and other trucks coming in after me and having their trucks serviced before me. I was told everyone had to go to lunch  They had me drop my trailer even though they didn't have to raise my truck to get to heater. I could have nosed the truck in. Before I left, I had to go back and find my hammer that was taken out of my truck. Advice to other truckers. Plan to spend most of the day there and bring your lunch and maybe supper. Check your truck before you leave for anything missing. Don't plan on driving far after spending all day there for a simple fix", "pics": null, "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "112271787633392308751", "name": "JC WC", "time": 1571185427501, "rating": 5.0, "text": "Fixed my truck in 3 hours best turn around in my 12 years of driving.", "pics": null, "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "103353273454410164473", "name": "Walter Dean", "time": 1536792991753, "rating": 5.0, "text": "Service department and their team kept me updated on the status of our truck the whole time it was down for repairs. They also went above and beyond what I expected for a large dealer repair shop. I highly recommend their services.", "pics": null, "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "117736693046963959577", "name": "April Rodney Gibson", "time": 1617061943351, "rating": 4.0, "text": "Good", "pics": null, "resp": {"time": 1617122204532, "text": "Thank you,  April Rodney. We are so glad you are a happy Peach State Truck Centers Customer Alabama and we appreciate the great review!\n\nCheers,\n\nAlabama Freightliner & Western Star"}, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "117594064341466187090", "name": "Chad W.", "time": 1517667536544, "rating": 5.0, "text": "Going on 10yrs and my 3rd truck as an owner operator so it's safe to say I've seen my fair share of shops. I want to congratulate the whole team \"apologies up front if I forget anyone\" (Mary, Dalton, Justin, J.T., Josh H.) for their dedication to quality and customer service. I would and will be highly recommending this shop.", "pics": null, "resp": {"time": 1517865912484, "text": "Thank you so much for taking the time to show your appreciation of our Alabama Freightliner team, Chad! Come back any time!"}, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "113264368022674525282", "name": "Lone Ranger", "time": 1541622043353, "rating": 4.0, "text": "The young guys could use some help on customer service skills but did a great job finding the part that I needed and had me on the road fast", "pics": null, "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "113472039246368480655", "name": "Monique Santoyo", "time": 1529015194987, "rating": 5.0, "text": "Got right in and they fixed my truck the same day! Everyone very nice. Thank you", "pics": null, "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "113943422197549610315", "name": "Big Gene McKinney", "time": 1580298936450, "rating": 5.0, "text": "Had to have my truck work on.", "pics": null, "resp": {"time": 1580302729421, "text": "Thank you,  Big Gene. We are so glad you are a happy Peach State Truck Centers Customer and we appreciate the 5 star review! We thank you for your business.\n\nCheers,\n\nAlabama Freightliner"}, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "106358956546936309908", "name": "Gary Wheat", "time": 1481558728085, "rating": 5.0, "text": "They were very responsive and courteous. Had to keep RV over night for parts. Had me back on road early next day.\n\nGary", "pics": null, "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "105257128164352559407", "name": "Sharen Cooke Lewis", "time": 1514495192415, "rating": 1.0, "text": "Poor customer service. I walked in to the counter and there was a young lady at the desk and a young man. Neither of them greeted me as a customer they just looked at each other then the guy decided to ask how could he help. Upon me picking up my part which was fairly heavy the guy sat a heavy dusty box on the counter and said alright? If a customer spends almost 500.00 at your business you could have at least carried it to the car or at least opened the door. Everyone seemed as if they didn't want to be bothered. I'll never go back unless I. Returning the part I bought.", "pics": null, "resp": {"time": 1514907953403, "text": "Hello, Sharen. I'm very sorry about the experience you had at our Tuscaloosa store. We always strive to provide the best customer service in the areas we serve. Please reach out to me at your earliest convenience so that I can see if there's anything we can do to make your next interaction with us more enjoyable. Thank you for taking the time to leave us feedback, as we are always looking for ways that we can improve in the future."}, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "109824697215492246562", "name": "Joshua Schwartz (BloodPoolBoy)", "time": 1550755608105, "rating": 1.0, "text": "The reviews were right. They don't even answer the phone", "pics": null, "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "105550571086231140785", "name": "Liz Fields", "time": 1535384026284, "rating": 1.0, "text": "I was going to immediately post a review because I was so angry when we picked our RV up from them but I waited and did my research (which I should have done before I used them) and now I am posting my review. My husband and I are fulltime RV'ers so our RV is our home and my husband travels for work. So when we found out that our exhaust manifold was cracked we needed someone quickly. So without proper research we took it to these guys. They gave us a crazy estimate but was told that it was JUST an estimate, that it really depended on how hard the exhaust manifold was to remove and if any bolts broke as they were removing it. We dropped it off on a Thursday morning at 8:00 a.m. On Monday at noon my husband was informed that the parts were still not in. Then on Monday at 4:00 p.m. my husband was told that it was ready to be picked up. Since we were over an hour away we told them we would pick it up on Tuesday. My husband was also told that the final bill was $2,990.00. WHAT??? We were flabbergasted because they had told my husband that the exhaust manifold came off easy and that no bolts had broken. My husband talked to the service manager and disputed the bill but the service manager would not budge so in order to get our RV back we had to pay it. Then I did my research and talked to several other diesel mechanics and also talked with some other freightliner and cummins mechanics and was told that they seriously overcharged us for the work that is shown on the bill. The bill states the following \"Pulled unit in shop. removed turbo and exhaust manifold. Cleaned the head and the turbo. Installed and torqued new exhaust manifold and turbo with all new gaskets and bolts. Cleaned inside and out. Ran unit. Checked for leaks none found. Parked unit.\" They charged us $175.00 an hour and claimed 14 hours worth of work for a total labor cost of $2,450.00. No mention of any problems whatsoever in removing the exhaust manifold. In my talks with other diesel mechanics I was quoted anywhere from $1,200.00 to at the most (from another freightliner mechanic) $125.00 an hour for labor. And that it should not have taken 14 hours to do the job if there had been no problems. Another mechanic I spoke with said that if the parts were not there at noon but it was finished at 4:00 then it took them at the most 4 hours to \"install and torque the new manifold and turbo with all new gaskets and bolts. Clean inside and out. Run unit. Check for leaks and park the unit.\" That would leave 10 hours for them to remove the exhaust manifold and that is overboard, especially since there were no issues in removing it. I was given some great advice and I am pursuing this. I was told that in order to hold the Freightliner name that they have to abide by a \"Labor Guide\" and to ask to see it (but we had already paid and picked the RV up so I was too late in doing that) so I have requested the labor guide requirements for this type of job. I have also requested quotes from other diesel mechanics based on what they said they did via the bill. And have contacted the main Freightliner offices. It is sad that we as consumers can not completely trust that we won't be screwed when we take our property to people.\nOn top of all of the above, when we were ready to leave my husband asked for the key and lo and behold they had lost it. They could not find the key to our RV. Really?? What kind of business that works on vehicles loses keys? It was a good thing that we had another key with us. I would recommend to do your research before you make a quick decision like we did.", "pics": null, "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "103530428961931396900", "name": "Scott Dockham", "time": 1523804708753, "rating": 3.0, "text": "Very low key Frightliner. They did get a good price on a radiator.", "pics": null, "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "117024522276679517080", "name": "Gerald Booker", "time": 1518647193906, "rating": 1.0, "text": "Didn't greet me when walk thru door. Phones just ring while on personal phone list goes on. Worst service every @ this location but great job on my truck.", "pics": null, "resp": {"time": 1518727040005, "text": "Sorry about the customer service at our store, Gerald. Feel free to reach out to me directly to further discuss this matter. Thank you for your feedback, as we are always striving to offer the best customer service at all of our locations."}, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "107037004952455980078", "name": "Kathy Morrison", "time": 1563545095460, "rating": 3.0, "text": "Truck in shop from Thursday to Tuesday with DEF issues. Replaced one box and next day same issues came back. Another freightliner shop replaced the DEF sensors and problem went away. Also, closed on weekends.", "pics": null, "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "110365789136251914961", "name": "Casey Tarantino", "time": 1514482226669, "rating": 1.0, "text": "I don’t want to give them one star. They hurt us financially in the worst way. They are liars and thieves. My husband went to work for WTI in Alabama. Their repair shop is in cahoots with the Freightliner in the same town of Tuscaloosa. Just after a 90 day inspection my husband switched to WTI. They immediately on first day said there he needed over 6000.00 in repairs on his truck. We had no choice st the moment but to get it repaired where he could start work. Freightliner started repair on it. Finished it in THREE WEEKS!! So my husband was out of work for over 4 weeks due to this scam. After he was up & running again here in Pensacola we had to put it in the shop at Freightliner. After a week they found out that none of the parts had been replaced or were either old parts. It took another week to get it approved to not have to pay for the parts and labor on what was done! Then the manager in Pensacola found out that the Work was not even done by a licensed Mechanic in Tuscaloosa!!  Then of course the Pensacola Freightliner found some more things wrong of course. Like they always do. Sigh * we were out of work over 6 weeks due to this. I contacted the owner of the three Freightliner owned by him. One in Tuscaloosa and two in Atlanta area. He wouldn’t call me back at all. If we had had the money and time we would’ve had an attorney. Stay away from WTI in Tuscaloosa & FREIGHTLINER in Tuscaloosa. For the most parts there are is a lot of crookedness at Freightliners some more than others but TUSCALOOSA is the worst!! STAY AWAY!!!", "pics": null, "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "103696411596572281378", "name": "clifton dawson", "time": 1555990607098, "rating": 5.0, "text": "Fantastic place Great help", "pics": null, "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "105273071842883308269", "name": "Nikki Autumn", "time": 1532497645637, "rating": 1.0, "text": "Service was terrible absolutely no help what so ever", "pics": null, "resp": {"time": 1532524966000, "text": "Hey Nikki, can you please reach out to me directly so I get an understanding of what was unsatisfactory about your experience. Thanks for your feedback and I look forward to hearing from you. Thank you!"}, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "106630505869302382834", "name": "Cristina Cruz", "time": 1507911387856, "rating": 5.0, "text": "Very good service, fast and friendly I recommended", "pics": null, "resp": {"time": 1508172790195, "text": "Thanks so much Cristina! Come back any time."}, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "105782507101620321007", "name": "Ademir Dizdarevic", "time": 1530271894706, "rating": 1.0, "text": "If it's not an emergency don't bother coming here.\n\nI would contact you if you give me a way to.", "pics": null, "resp": {"time": 1530214299266, "text": "Sorry you feel that way, Ademir. Please reach out to me directly if you'd like to discuss your experience further. Thank you for your feedback and I look forward to hearing from you."}, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "106117879169302092965", "name": "Chuck Jones", "time": 1519333420731, "rating": 5.0, "text": "Everyone was nice and helpful.good service.", "pics": null, "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "108770241098998460789", "name": "William T Seibl", "time": 1544029576221, "rating": 1.0, "text": "Way over priced, don't about your  Schedule. They did not repair my vehicle!! Left the same as came.", "pics": null, "resp": {"time": 1544039070031, "text": "Sorry about your experience at our Tuscaloosa location. Please reach out to me directly so that I can get some additional information about your case and do all that we can tot make the situation right. Thank you for your feedback and I look forward to hearing from you."}, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "117457035655766598223", "name": "Kathy Hopkins", "time": 1509371394900, "rating": 1.0, "text": "Long wait very long wait", "pics": null, "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "112951542375384444369", "name": "liza dam", "time": 1506533254615, "rating": 1.0, "text": "Drivers take y truck somewhere other then this bad bad bad place service is bad been waiting on my truck for 5 days, close sat head manager no help ,fine a other place for y truck, or plain to be hear 6 days slow no help😓", "pics": null, "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "101166276432610780519", "name": "G Scott", "time": 1528238442763, "rating": 3.0, "text": "Lack of communication, waiting for no reason.", "pics": null, "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
{"user_id": "109169985647041288331", "name": "Liosbel Rojas", "time": 1573151182032, "rating": 1.0, "text": "(Translated by Google) Don't come to nothing, they don't have parts of anything\n\n(Original)\nNi vengan a nada no tienen partes de nada", "pics": null, "resp": null, "gmap_id": "0x888602110a7b0ed1:0xc685b4618fec7c7e"}
