{"user_id": "104689430984962161431", "name": "Darion Sexton", "time": 1624632053507, "rating": 5.0, "text": "Super friendly and super helpful and really fast. Love this place", "pics": null, "resp": {"time": 1624974943050, "text": "Hey Darion!! We appreciate your kind words and thank you for taking the time to let us know how we are doing!!"}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "114026264905967215792", "name": "Jay Jones", "time": 1621368605761, "rating": 5.0, "text": "Great place to deliver. They put me right on a door and started unloading. I was only there a little over 30 minutes and they have inside restrooms that can be used.", "pics": null, "resp": {"time": 1622064245956, "text": "Thank you so much Jay! We love to read reviews like this!"}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "100643557015592761672", "name": "Jagjot Singh Mann", "time": 1616415473528, "rating": 5.0, "text": "Nice people...fast in nd out......washrooms for truck drivers available👍🏻👍🏻", "pics": null, "resp": {"time": 1616506787420, "text": "Thank you so much for this awesome review!!!"}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "114757200502642770953", "name": "Sofía Uribe", "time": 1598028466155, "rating": 5.0, "text": "One of the best warehouses we have delivered to.  We knew we were going to be late for the appointment so I called and talked to Misty. She was very kind and friendly and told us to try to not be later than certain time. Finally the driver got there and they unloaded him really fast. . Thank you for your great staff, and friendly response.", "pics": null, "resp": {"time": 1598265314202, "text": "Thank you for your awesome review and for letting us know about our Misty! She's an absolute gem!"}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "102775983157493201278", "name": "lan Can", "time": 1575297583060, "rating": 5.0, "text": "Huge cross dock service in this area.\nEasy in & out.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP7f0mUixUFo9Qn092TOkkN0SDPfS6-72yXN0Qs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPIpJ9J_kB4LOIHZ0VlkebhEySAaGvVneYHoAld=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMWvrYdBRfLytghcUVvWet20lLn1bODv8SNLSrX=w150-h150-k-no-p"]}], "resp": {"time": 1578863889069, "text": "Ian Can!! Thank you so much for your awesome review and kind words!!!"}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "104105427992535315861", "name": "Joe Maddox", "time": 1599220927335, "rating": 5.0, "text": "Great place to drop off. Fast in fast out. Friendly employees, and can somebody give Shawn some coffee. ☕ 😎 TGIF", "pics": null, "resp": {"time": 1599594375196, "text": "Thanks Joe!! We appreciate the awesome review! We will totally give Shawn some coffee! ha!"}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "115225140611495439558", "name": "Tony Fichter", "time": 1580144009915, "rating": 5.0, "text": "Our company is located 1500 miles from our customer in Anniston, Alabama.  We depend on Misty, Will, Cristi and the rest of the good people of BR Williams to receive, stock, pick and deliver our product accurately and timely.  They are all a joy to work with and the level of service they provide is second to none.  I highly recommend BR Williams for your logistics needs.", "pics": null, "resp": {"time": 1580237699387, "text": "Tony, what great words about our great people!! We appreciate this review!!!"}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "106241979675043714508", "name": "Christine LaMar", "time": 1579883906407, "rating": 5.0, "text": "Great company to work with! They always respond quickly to any questions we may have, and always willing to go the extra mile to provide us with the best service possible. One of the best public warehouses we work with!", "pics": null, "resp": {"time": 1580237772826, "text": "5 Stars...THANK YOU!!! Christine, we appreciate you taking the time to give us this awesome review!"}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "106223300537383007777", "name": "Jon Douglas", "time": 1521484731407, "rating": 5.0, "text": "The service and support that our company gets from BR Williams is vital to our day to day business operations.  Without this service it would be very difficult to maintain the level of support we do with our customers along with the on time deliveries we provide.  BR Williams has truly been a blessing to our company and is integral in the growth we have experienced over the past several years.", "pics": null, "resp": {"time": 1560342244559, "text": "Thank you so much Jon!!! We love the awesome words!"}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "108383374549284925976", "name": "Crystal Roberts", "time": 1579886807420, "rating": 5.0, "text": "Our company has been using BR Williams services for several years.  The staff is super friendly and always willing to do whatever it takes to accommodate our needs in a very timely manner.", "pics": null, "resp": {"time": 1580237745819, "text": "Crystal...THANK YOU for your great review!!!"}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "108368422472965613697", "name": "William Waldrop", "time": 1600707812804, "rating": 4.0, "text": "Good people, quick unloading", "pics": null, "resp": {"time": 1601035907704, "text": "Thank you so much William!!! Your review means so much to us!"}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "110244226730010081003", "name": "Karmen plays", "time": 1564366756589, "rating": 4.0, "text": "My grand son works there good people", "pics": null, "resp": {"time": 1565691996038, "text": "Thank you Gloria!! We are happy to have him on our team."}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "115151447859361770511", "name": "Mike Carter", "time": 1501261085496, "rating": 5.0, "text": "BRW has been exceptional for our storage needs.  The staff is flexible and awesome to work with!", "pics": null, "resp": {"time": 1560342151155, "text": "Thanks Mike!! We really are glad we could be a great partner for you!"}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "101545897209669205935", "name": "Constance Ramsey", "time": 1533772949831, "rating": 5.0, "text": "my mom works there and its a good job for her", "pics": null, "resp": {"time": 1560342028769, "text": "Thanks for the 5 Star Review!! We appreciate your mom!"}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "105315805134508799626", "name": "Robert Stoner", "time": 1595281452083, "rating": 4.0, "text": "Ok, but kinda slow.", "pics": null, "resp": {"time": 1595414144427, "text": "Thank you for your honest feedback Robert! We will work on streamlining our process for a more timely response."}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "107539229081798948793", "name": "Carlos Millas", "time": 1499694392363, "rating": 2.0, "text": "By appointment!!😯😔😬😠", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPnDTxa7rWO_l4rdwtBlf41PuGoDA5u1i_zrkKR=w150-h150-k-no-p"]}], "resp": {"time": 1560342289749, "text": "Carlos, thank you for taking the time to review us! Please let us know how we can improve customerservice@brwilliams.com"}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "111001154895854806532", "name": "james moon", "time": 1521329133479, "rating": 5.0, "text": "Great place they get you in and out", "pics": null, "resp": {"time": 1560342123318, "text": "Hey James!!! We appreciate the kind words!!"}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "108222316202792805380", "name": "Lori Edwards", "time": 1487281344083, "rating": 5.0, "text": "My son works here.", "pics": null, "resp": {"time": 1560342346249, "text": "How in the world did we miss this awesome review! We apologize and thank you for taking the time to write this!!"}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "115909157418819236544", "name": "Matt Phillips", "time": 1519841334977, "rating": 5.0, "text": "In & out", "pics": null, "resp": {"time": 1560342170704, "text": "Thanks Matt!!"}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "111960997001598644424", "name": "Samantha CWG Madison (KID)", "time": 1507648908277, "rating": 1.0, "text": "(Translated by Google) Idek\n\n(Original)\nIdek", "pics": null, "resp": {"time": 1560342219120, "text": "Samantha, we hate that we caused you to give us a 1 star review. Please let us know how we can improve customerservice@brwilliams.com"}, "gmap_id": "0x888bb17849d462af:0x4a8d58584aeca590"}
{"user_id": "103681007746796562672", "name": "Debra Smith", "time": 1612220132866, "rating": 5.0, "text": "The Quickbooks product is excellent and we have received excellent service from Chris.  Chris has been a huge asset from purchase to install. We have multi-stores and his expertise in our field as been so beneficial. I would highly recommend Chris to anyone and anywhere in the county. Thanks for all your great support Chris.", "pics": null, "resp": {"time": 1612273428439, "text": "Debra, thank so much for the review!  We at Barons' love Chris too...great guy personally AND professionally!  SO glad you had a GREAT experience! Please let us know how we can serve you in the future!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "115184016981435573311", "name": "Karen Sherman", "time": 1548282187470, "rating": 5.0, "text": "Barons' INC has helped me on my three businesses over the past five years. I feel they were indispensable when is came to setting up the books for one of the new ventures. Also,  I had my credit card machines purchased through them and they did a wonderful job with managing that for me.\nThese people are reliable, prompt, professional, and very informed.\nI trust them.", "pics": null, "resp": {"time": 1548288790924, "text": "You're AWESOME Karen, NOT just our customer, but our friend! Always a pleasure to work with you! Thank you SO MUCH for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117068110860688416954", "name": "sherry ramsey", "time": 1568382780678, "rating": 5.0, "text": "They are hands down the number one Quick Books and accounting firm of all times.  I have never worked with anyone so knowledgeable and easy to work with in all my years.  Very satisfied customer!", "pics": null, "resp": {"time": 1577827863036, "text": "Wow Sherry, thank you so much for the rave review."}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "100173678078828747649", "name": "Nhat Truong", "time": 1549393903872, "rating": 5.0, "text": "Very knowledgeable, excellent communication. Brandon goes the extra mile to get things accomplished. I’ve been working with him to bring value to his clients, but he has in turn provided me exceptional value. I definitely recommend his expertise in all realms of Intuit Products.", "pics": null, "resp": {"time": 1553713989445, "text": "Nhat, you my friend are a ROCKSTAR!  We appreciate the GREAT review and is always a pleasure to work with you!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111823807177511452049", "name": "Laser Beauty", "time": 1547941528421, "rating": 5.0, "text": "Barons, inc is very professional and and helpful in all aspects of QuickBooks management. I have been a client for over 15 years. I love working with Sharon. She always returns my calls and goes out of her way to fix any problems or help with questions. My business would not be where it is today if it were not for her expert knowledge and genuine caring attitude.", "pics": null, "resp": {"time": 1548287929987, "text": "Thanks Jacqueline!  I've appreciated working with you as well, you've been a joy to work with! Thank you for the GREAT review! ~Sharon"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111277116250474484410", "name": "Tamla Masters", "time": 1550259881800, "rating": 5.0, "text": "Barons has been truly wonderful to work with. Very knowledgeable and extremely receptive with any of my business needs. I consistently get excellent customer support from the Baron’s team. They go out of their way to help me solve any issues I have with Quikbooks which gets me quickly back on track. Their services are extremely valuable for my business.", "pics": null, "resp": {"time": 1553712085351, "text": "Tamla, our Club Z! friend! Thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "112115929266158956995", "name": "RxMaster Pharmacy Software", "time": 1553551376745, "rating": 5.0, "text": "Sharon is very knowledgeable and professional. I trust her with any Quickbooks problem or question I might have, she always gets back to me within a short time frame. I have been a satisfied customer for 14 years. I would recommend Baron's to anyone.", "pics": null, "resp": {"time": 1553711651174, "text": "Rhonda, thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "105829907665835612779", "name": "Claude Stone", "time": 1559922161010, "rating": 5.0, "text": "I am not sure 5 stars gives one the right magnitude of the service Morse Farm has receives from Barron's, Chris Metzler. His support of each of our employees gives them the confidence to integrate Quick Books Point of Sale in the the Morse Farm infrastructure. We would love to make a sugar maker of him.", "pics": null, "resp": {"time": 1559924617504, "text": "Thanks Claude for your business! We feel the same way about Chris!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117317254217504116074", "name": "Helene Cerise", "time": 1593114531105, "rating": 5.0, "text": "Excellent service - helped me all weekend to convert from Desktop to Online.", "pics": null, "resp": null, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "103553518053420410499", "name": "Teresa Bradford", "time": 1552933235427, "rating": 5.0, "text": "Sharon was an absolute delight to work with! Besides being very knowledgeable, she was very personable and quick to respond to every question and need that I had.  I am elated to have found such an expert!", "pics": null, "resp": {"time": 1553711770753, "text": "Teresa, it was a delight to work with you!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110992099580609457605", "name": "Josh Drummond", "time": 1562364103306, "rating": 5.0, "text": "Baron's Inc is a great company with excellent service and lots of business knowledge for quickbooks and more. They service me here in Arkansas all the way from Alabama! Great folks and friendly to deal with. Highly Recommended!", "pics": null, "resp": {"time": 1562368437165, "text": "In true Rockstar fashion, thanks buddy!  Love doing business with you"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "106571462612984588457", "name": "Jeanne Grimes", "time": 1551808299303, "rating": 5.0, "text": "Baron's is your go-to for all things accounting and Quickbooks.  Sharon McCauley is extremely knowledgeable and a pleasure to work with for our end-of-year bookkeeping, financial audits for contractor licensing and any new business piece that we need to add in Quickbooks.  She is a wizard at all of it.  Truly don't know what we would do without her expertise.", "pics": null, "resp": {"time": 1553711955993, "text": "Thank you so much Jeanne!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111276108849508523867", "name": "Regina Daniels", "time": 1549997944652, "rating": 5.0, "text": "Wow! We have been using Barons Inc since 2008!! I would spend hours trying to figure out how to “fix” something in QB, because you know it has to be easy😊, then I’d call Sharon and she would tell me in 5 seconds. They have made our lives so much more organized by teaching us & being fast at answering our questions!!", "pics": null, "resp": {"time": 1553712253531, "text": "Regina, yes WOW...thanks, yup kind of a long time...we love working with y'all!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "107962674414500317604", "name": "Jc’s Outlet", "time": 1547820153796, "rating": 5.0, "text": "Baron’s is an asset to my business. They have a lot of business insight, super friendly, and super helpful whenever I have a business need. Utilize their services and you won’t go wrong!", "pics": null, "resp": {"time": 1548288960720, "text": "Justin, you are a ROCKSTAR business owner as well as a great friend!  We value your friendship and your business!  Thanks for the review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "105263527778344374868", "name": "Kathy Vance", "time": 1548196933696, "rating": 5.0, "text": "I have been a client of Barons' Inc for over 10 years. Sharon and Brandon are great to work with. They are quick to return phone calls and follow through to get your accounting or qb issues resolved. I highly recommend this company!", "pics": null, "resp": {"time": 1548288200223, "text": "Thank you PEBBLES! We love working with you and we love you!  Absolute rock star professionally and personally!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "113723871616249817164", "name": "Will Perry", "time": 1550027401626, "rating": 5.0, "text": "My clients buy their QuickBooks software from Barons'. They do an excellent job of taking care of my clients. My clients and I have been doing business with Barons' for several years and they have always provided prompt service without any problems. I highly recommend Barons' Inc.", "pics": null, "resp": {"time": 1553712166569, "text": "AND...we appreciate you and your clients Will, thank you!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "116988780458405924345", "name": "Joanne DelBalso", "time": 1549742497328, "rating": 5.0, "text": "The team at Baron's Inc has top notch customer support.  They are very knowledgeable with all things Intuit product based.  If you have any questions on which product to purchase for your accounting software, POS system or Merchant services make sure you give Barron's a call!!", "pics": null, "resp": {"time": 1553713654918, "text": "Joanne, thanks for the GREAT review and thanks for being a friend and long time member of the Accounting Success Group!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "101823155699672483707", "name": "Jimmy Stewart", "time": 1547771723343, "rating": 5.0, "text": "Very great company with very knowledgeable staff. Highly recommend them to anyone. They will be a tremendous asset to your company.", "pics": null, "resp": {"time": 1548289095065, "text": "Jimmy, you're a great friend and appreciate the RAVE review!  So many years of  friendship and business..."}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "115522262429313184268", "name": "Jim Dinwoodie", "time": 1551997598578, "rating": 5.0, "text": "I have had the pleasure of working with Barons' for over fifteen years.  They were instrumental in helping me create and manage the financial foundation of our small business, and for educating me (a marketing person, no less) in the use of QuickBooks.  I have found their entire management team at Barons' to be professional, responsive and a delight to work with.", "pics": null, "resp": {"time": 1552063327425, "text": "Jim, you, my friend are another that started as a customer and left as a friend!  We value our relationship with you and much appreciate your review...THANK YOU!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "116162691382124930775", "name": "Michael Jordan", "time": 1566223941263, "rating": 5.0, "text": "Chris Metzler is a top notch professional. He took great time and care making sure our point of sale system was properly set up .", "pics": null, "resp": {"time": 1577827906641, "text": "Hey Michael thank you so much for the review. We think the same thing of Chris... Thanks again for the review I will make sure Chris sees this."}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "101168821075903408179", "name": "Ernest Cook", "time": 1549952778489, "rating": 5.0, "text": "I've know Brandon for almost a decade. He and his team provide top notch support for customers. I am happy to refer customers to his team because I know they will be treated right.", "pics": null, "resp": {"time": 1553712333969, "text": "A DECADE!? DUDE! Thanks for the great review Ernest!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "104588604249400463226", "name": "maria johnson", "time": 1549037440435, "rating": 5.0, "text": "My experiences working with both Brandon and Sharon has been a pure pleasure. Their expertise and dedication to help me achieve my business objectives surpassed my expectations.", "pics": null, "resp": {"time": 1553714191881, "text": "Thanks Maria, for the great review and the friendship over many years!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "101872866175889778924", "name": "Yvette Shaw", "time": 1549347316705, "rating": 5.0, "text": "Barons Inc. always give us excellent service and support. They are extremely helpful and knowledgeable. I would recommend them to anyone. Thanks Brandon and Sharon for stellar service and always giving us the support we need!  Yvette from YMS Bookkeeping Services, Inc.", "pics": null, "resp": {"time": 1553714057944, "text": "Yvette, you always so kind...we love working with you and having you on the ASG team as well!  Thanks for the GREAT review"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "114328140259736151845", "name": "Cason Smith", "time": 1549394513032, "rating": 5.0, "text": "Brandon is trustworthy, skilled and creative to customize an experience that is tailored to meet your exact needs. Plus! He’s a great guy who has a passion for helping people and businesses!", "pics": null, "resp": {"time": 1553713881226, "text": "Thanks Cason, you hit the nail on the head...we ROCK! LOL Seriously, thanks!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111564339020835713042", "name": "April G", "time": 1551914491919, "rating": 5.0, "text": "Professional and customer service excellence! They are always my go to people when I have questions about Quickbooks. Thank you for your kindness and support dedication!", "pics": null, "resp": {"time": 1553711926151, "text": "Hey April! Thanks for the GREAT review...see you at QuickBooks meetup"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "100158609571642394133", "name": "Erik Wolff", "time": 1548111734313, "rating": 5.0, "text": "Baron's have eliminated ALL the headaches I had with Quickbooks and payroll. I have 5 different business, from Corporations to LLC to Non-profit. They set-up my Businesses from day one to run flawlessly and I'm still having success 10 years later because of what they continue to do. I would encourage any Business to give Barons Services a try. You'll wish you did it sooner.", "pics": null, "resp": {"time": 1548288095787, "text": "ROCKSTAR review Erik! Thank you SO much!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "102916626435739492516", "name": "Angie Johnson", "time": 1555437518731, "rating": 5.0, "text": "Barons' Inc is the best. Sharon is amazing, she can always help me with any issues I may have. I highly recommend them.", "pics": null, "resp": {"time": 1577827964169, "text": "Thanks Angie! Sharon is awesome, we agree... I'll make sure she sees this."}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "106630557942804063758", "name": "Nick Goedereis", "time": 1549483940100, "rating": 5.0, "text": "Barons is the best at what they do, I highly recommend them in every Accounting /Quickbooks/ Technical situation, simple or extremely difficult. They WILL find the answers and ease any stress or confusion you find yourself in. Always up to date with newest regulations or technology. Very courtious,professional and prompt.", "pics": null, "resp": {"time": 1553713836850, "text": "Nick & Lauren...thank you so much for the GREAT review...we love working with you guys!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "107638663752361238902", "name": "Sharon Ramey", "time": 1549993463359, "rating": 5.0, "text": "Sharon McCauley and Brandon Morris are excellent at what they do.  They are professional, knowledgeable and very easy to work with. I highly recommend them.", "pics": null, "resp": {"time": 1553712266880, "text": "Sharon, thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "108444596400790262303", "name": "Robin Boyer", "time": 1550232908721, "rating": 5.0, "text": "Barons, Inc. set are company up with quickbooks over 10 years ago. Made my life so much easier. Extremely knowledgeable. Sharon always ansrewed  my calls when I needed help which was a lot. Very sweet and professional. I would recommend them to everyone", "pics": null, "resp": {"time": 1553712111695, "text": "Thanks Robin...much appreciated"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117365559143113529977", "name": "Tricia Estes", "time": 1549231417557, "rating": 5.0, "text": "Sharon and Brandon are incredible!! Their knowledge, quick response and patience is second to none! I would highly recommend them to anyone needing help with Quickbooks.", "pics": null, "resp": {"time": 1553714148718, "text": "Thank you Tricia...you guys are always a joy to work with!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "106432421922678528479", "name": "Gina Rodkey", "time": 1549677222570, "rating": 5.0, "text": "Working with Baron's is a pleasure. Brandon is very professional, he knows my needs and is pro active in making useful suggestions. Anytime I have had a question or needed help he has been there.", "pics": null, "resp": {"time": 1553713738564, "text": "Gina, the pleasure is ours for sure! Thanks for being a friend and long time member of the ASG group!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "114086011900714284722", "name": "Nicole Donohue", "time": 1547741172940, "rating": 5.0, "text": "Brandon and Sharon have been building this business for 16 years and are extremely knowledgeable and passionate about what they do! I am beyond thrilled to be working with them both!", "pics": null, "resp": {"time": 1548287726699, "text": "Thanks Nicole! We agree, WE are absolutely thrilled to be working with you as well!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "112724701068644125891", "name": "Kyle Crabtree", "time": 1547748464005, "rating": 5.0, "text": "Brandon from Barons' Inc is my go to guy for all things accounting software. He bring not only the wealth of knowledge from being a Quickbooks expert but also the understanding of how business is ran.", "pics": null, "resp": {"time": 1548289176501, "text": "From you, Kyle that means a lot, you know a lot of people...GREAT review, thank you for the kind words as well!  Appreciate your friendship even though you bailed on me here in Mobile! lol"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "116450211628548719754", "name": "Jaguar Cleaners Inc.", "time": 1548438873716, "rating": 5.0, "text": "QuickBooks Gurus!  Look no further,  these guys do it all!  All of our accounting systems are now automated and integrated.  Our office now functions with ease.  We couldn't thank them enough!", "pics": null, "resp": {"time": 1548442729841, "text": "LOVE this review! Thank you Christina! Both you and Thomas are great people, work hard, and have a phenomenal business...thank you again for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "105433879793598619825", "name": "Wende Burdick", "time": 1553706121978, "rating": 5.0, "text": "Brandon and Sharon have been trusted Club Z! partners who have delivered exceptional support and training for many years. I don't know what we would do without their responsiveness and expertise to keep our franchisees out in the field and not stuck in their back office struggling with operations headaches! I always recommend them first over the other options available.", "pics": null, "resp": {"time": 1553707098417, "text": "Wende, thank you for this GREAT review!  We appreciate you and the Club Z! franchise!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111935659508903591533", "name": "KC ProAdvisor", "time": 1549314660505, "rating": 5.0, "text": "Brandin has been a valuable source of information and has great solutions customers.\nGreat follow through and professional standards", "pics": null, "resp": {"time": 1553714123201, "text": "Jim, thanks for the GREAT review...much appreciated...love having you on the ASG team especially for the number of years we've been able to work with you!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110328737941233817676", "name": "Nursery Texas Teacups (Texas Teacups)", "time": 1556730981793, "rating": 5.0, "text": "Chris Metzler is somewhat of a rockstar! I have had a very hard time getting everything installed properly and setup and every time I call and ask a question he always answer! Even when traveling he opens his laptop in the airport and walks me through step-by-step on how to get it done! Thank you Chris!", "pics": null, "resp": {"time": 1556810390681, "text": "We agree, Chris is kind of a BIG DEAL...but SO ARE YOU Becky...we appreciate your business and even more appreciate the time you took to brag on Chris...THANK YOU for your business!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "104664991626861162361", "name": "Tracy Johnson", "time": 1548692203037, "rating": 5.0, "text": "Have had great experiences with Barons' Inc. They have gone above and beyond to help me have the knowledge and tools I needed for my business. They really care about our success!", "pics": null, "resp": {"time": 1553714606930, "text": "Thanks Tracy, for the GREAT review"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110625825839017936804", "name": "Coral Tree", "time": 1548347388057, "rating": 5.0, "text": "We have always had a positive experience working with the team at Barons' Inc. and would highly recommend them to anyone considering their services.", "pics": null, "resp": {"time": 1548348872058, "text": "Hey CORAL TREE, MUCHO thanks for the review! You guys are TRUE rockstars and appreciate your friendship and your products...great addition to our services! Thanks again!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "114403797920020902926", "name": "Ron Brown", "time": 1548275320315, "rating": 5.0, "text": "We Have been working with Sharon McCauley & Brandon Morris for close to 5 years. Excellent speedy and accurate service for our Quickbook needs, also all of our general accounting, payroll, and CPA work. If you are a Contractor you will  be amazed at the detail and experience they can bring to your firm.", "pics": null, "resp": {"time": 1548288684964, "text": "Thanks Ron for the AWESOME review! We love working with you guys. Give Turk a rubdown from us!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117819026071038224553", "name": "Benita Drew", "time": 1547751358006, "rating": 5.0, "text": "Brandon really knows his stuff! He stays current on all the software has to offer and customizes it to fit what I need it to do for any new business venture I come up with.", "pics": null, "resp": {"time": 1548289526765, "text": "Thanks Benita...for the YEARS of business and bantering back and forth as well as bossing me around for photo shoots that the family has forced me into :) Not just a customer, but a friend!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "106317578164941275975", "name": "Becca Bodiford", "time": 1549951742595, "rating": 5.0, "text": "Brandon has always went above and beyond to help us out.  Fair price for excellent service.  Thanks for always taking care of the carpet store when we need you.", "pics": null, "resp": {"time": 1553713429223, "text": "Becca, it's always been our pleasure...cool that we get to work together after going to middle & high school together for all those years :)"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "113390311494774903268", "name": "Connie Armer", "time": 1548112625959, "rating": 5.0, "text": "Baron's has been wonderful to work with. If I didn't know the answers they always did.  Thank you for being there for us.", "pics": null, "resp": {"time": 1548289591675, "text": "Thanks for the GREAT review Connie, it is MUCH appreciated!  I have enjoyed working with you as well, both with your practice as well as with the church!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "107385354572352553890", "name": "Sabrina Johnson", "time": 1548369439285, "rating": 5.0, "text": "Brandon has always been friendly,  informative and professional. I highly recommend this company.", "pics": null, "resp": {"time": 1553712580077, "text": "Thanks Sabrina, much appreciate the review...hope all is going well!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "107413259219398428581", "name": "Marcie Hill", "time": 1552496039221, "rating": 5.0, "text": "Great at what they do.  From teaching to solving the problems.  Very informative and Great service!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMzi5-HkJUX9MT6YqsCLN6oikNIUYejh4ZTZw2t=w150-h150-k-no-p"]}], "resp": {"time": 1553711812284, "text": "Marcie, thanks for the GREAT review! Love hearing from long time clients!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "115243769015594441761", "name": "Janette Armstrong", "time": 1548186647755, "rating": 5.0, "text": "Barrons is so helpful and always available with any questions. Definitely recommend their services!!", "pics": null, "resp": {"time": 1548289722189, "text": "Thanks Janette for the GREAT review...ALWAYS enjoyed working with you both at the tractor store as well as 101 Livestock! Thanks!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "116827982663756002412", "name": "joealzate", "time": 1548368888368, "rating": 5.0, "text": "Love the personal attention they give. Friendly and knowledgeable staff.", "pics": null, "resp": {"time": 1553714685541, "text": "Hey Joe, thanks for the GREAT review..."}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111367301631481325443", "name": "David Gotsche", "time": 1549986955624, "rating": 5.0, "text": "If you need ANY help with QuickBooks, this is the best resource available. The team will answe any questions you have and work to get you the total solution for your accounting needs!", "pics": null, "resp": {"time": 1553712302953, "text": "Thanks David, yeah...we are the TOTAL PACKAGE! :) LOL"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111414255168103229315", "name": "Andrea Roy", "time": 1549378051626, "rating": 5.0, "text": "Very helpful for all of our Quickbooks needs and we always have a great experience!  I highly recommend!!!", "pics": null, "resp": {"time": 1548288513175, "text": "We highly recommend OPC and you are always a pleasure to work with as well Andrea! Thanks for the RAVE review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "102114284254594159971", "name": "Russell Guy", "time": 1553096302080, "rating": 5.0, "text": "Barons has helped me with my small business since 2011.  Their general accounting support and QuickBooks expertise has been of great value to me…and Sharon is such a joy to work with, I appreciate them greatly!", "pics": null, "resp": {"time": 1553711743589, "text": "Russell, thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "109648838740866766564", "name": "Treasurer Salem UMC", "time": 1549652371583, "rating": 5.0, "text": "Always helpful and professional. This is the best way to help your business be successful.", "pics": null, "resp": {"time": 1553713795685, "text": "Thank you for the great review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117967001023013505741", "name": "Bill Beyer", "time": 1551460330490, "rating": 5.0, "text": "If you use Quickbooks you need Baron's on your team. I have them on speed dial!", "pics": null, "resp": {"time": 1553711998228, "text": "Thanks Bill, one of these days we'll go see the Wizard (of ads) together! :)"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "101255129352709315425", "name": "Patrick Flanagan", "time": 1548739717756, "rating": 5.0, "text": "Extremely knowledgeable, professional and service driven. I would absolutely recommend Barons Inc for any business owner.", "pics": null, "resp": {"time": 1553714596385, "text": "Thanks Patrick, for the GREAT review"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117700248905227186794", "name": "Robert Button", "time": 1550625951511, "rating": 5.0, "text": "Baron',s Inc is spot on when it comes Quickbook set up, sales and support. Sharon is extremely knowledgeable and has helped me manage my Quickbook accounts for over 12 years. Her expertise in the QuickBooks program is outstanding. Because of Baron',s Inc. My tax preparation was cut in half at the CPAs office saving time and money. I would highly recommend the Baron',s team!", "pics": null, "resp": {"time": 1553712053775, "text": "Thanks Robert!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110997975562732227490", "name": "Pam Bohall", "time": 1553377632279, "rating": 5.0, "text": "Very knowledgeable and great service!! Would highly recommend Barons", "pics": null, "resp": {"time": 1553711680149, "text": "Thank you Pam, we appreciate your business"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "116843428936314117303", "name": "Elizabeth Crowder", "time": 1548272430869, "rating": 5.0, "text": "Baron's Consulting are amazing, very professional, loved working with them, they always knew what I needed for my self storage business. Thank you for always taking care of me", "pics": null, "resp": {"time": 1548288435097, "text": "Thank you so much Elizabeth with the GREAT review!  You are pleasure to work with!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "106483038404408750591", "name": "Jamie Delveccio", "time": 1549909501173, "rating": 5.0, "text": "I've had the honor and opportunity to know and work with Brandon Morris and the Barons' Inc team as their QuickBooks Channel Manager here at Intuit QuickBooks for over 5 years. Barons' Inc. is one of our fastest growing and highest valued QuickBooks Solution Providers, providing excellent service to our QuickBooks customers, and mentorship to our fellow QuickBooks Solution Providers. He also serves as a member in our QuickBooks Advisory Council, working directly with our QuickBooks leadership and product developers to lend his experience and feedback. I can't say enough about Brandon and Barons' Inc, we're incredibly fortunate to have him on our team!", "pics": null, "resp": {"time": 1553713591194, "text": "The honor and opportunity is all ours Jamie!  We love being in the QSP program, and love the direction and advice that you provide as well!  Thanks for all that you do!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "115261229787112019533", "name": "Lori Rogers", "time": 1548110690270, "rating": 5.0, "text": "I learned so much about QuickBooks from Barons' I would absolutely recommend them. They provide personal service and are very knowledgeable!", "pics": null, "resp": {"time": 1548288025153, "text": "Lori, Thanks for GREAT review!  We've LOVE working with you and we miss your face! :)"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "102258092652910121459", "name": "Marcella Parson", "time": 1549378413658, "rating": 5.0, "text": "We have used Barons' Inc for years and have always been happy with them.", "pics": null, "resp": {"time": 1553712482123, "text": "Marcella, thanks for the GREAT review! We've enjoyed working with you over all these years"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110657316619835389026", "name": "Jessie Puryear", "time": 1550091268102, "rating": 5.0, "text": "Trustworthy, Honest, and Kind. They have gotten me out of some big jams.", "pics": null, "resp": {"time": 1553712137519, "text": "Jessie, thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111034602315809179296", "name": "Ross Rodden", "time": 1548859689522, "rating": 5.0, "text": "I’ve used Barons for many years in my small business. Their service, support and expertise in Quickbooks has been invaluable.", "pics": null, "resp": {"time": 1553714307507, "text": "Thanks Ross, we've enjoyed working with you guys as well...much appreciate the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "109832571006216266309", "name": "Paul C", "time": 1601059161204, "rating": 5.0, "text": "Great to work with.", "pics": null, "resp": null, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111514335252727309845", "name": "Mason Schirmer", "time": 1549674552731, "rating": 5.0, "text": "Brandon it's knowledgeable and responds quickly!", "pics": null, "resp": {"time": 1553713760291, "text": "Mason, thanks for the GREAT review - much appreciated!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "107366794749859003835", "name": "Tammy Hubbard", "time": 1548791181965, "rating": 5.0, "text": "Barons helped me with my pos system and when I started my business and is so helpful when I have any questions that come up. Which is probably more than the average person but I always get answers.", "pics": null, "resp": {"time": 1553714548914, "text": "TAMMY, you're a rockstar...thanks for the great review..."}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110109097986193427933", "name": "Joe Delacruz", "time": 1548972602831, "rating": 5.0, "text": "Sharon McCauley did a great job.", "pics": null, "resp": {"time": 1553712442387, "text": "Joe, thanks for the GREAT review! Hope your rental business is going well!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "113087742610922079601", "name": "ravindavid", "time": 1553200625185, "rating": 5.0, "text": "Top Quality Service-ALL the time,EVERY time", "pics": null, "resp": {"time": 1553711716228, "text": "HARK! Thanks Dave...your work is always top quality as well!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117611259330163789194", "name": "Faith Lessly", "time": 1552213906437, "rating": 5.0, "text": "They are very knowledgeable and eager to help!", "pics": null, "resp": {"time": 1553711879568, "text": "Thanks Faith (Bill) - GLAD you noticed our knowledge...and we ARE eager to help :)"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "107538613512321785609", "name": "TEAM VISION LLC", "time": 1548890928158, "rating": 5.0, "text": "From the owner to the agents. Nothing but great service and professional 😊😊😊😊", "pics": null, "resp": {"time": 1553714232271, "text": "The same could be said about you Kevin...thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117762228844796233439", "name": "OnCall Email", "time": 1548954026545, "rating": 5.0, "text": "Very professional and extremely prompt.", "pics": null, "resp": {"time": 1553714205790, "text": "Thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "114894900767987371896", "name": "Stefanie Herrick", "time": 1548692321302, "rating": 5.0, "text": "Very knowledgeable and helpful. I would definitely recommend them.", "pics": null, "resp": {"time": 1553712513323, "text": "Stefanie, thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "100637001887715834985", "name": "Jenny Flicker", "time": 1549720026059, "rating": 5.0, "text": "Very responsive and helpful.", "pics": null, "resp": {"time": 1553713706108, "text": "Jenny, GREAT review, THANK YOU...glad to have you with Accounting Success Group!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "112616152128960672894", "name": "Annie Stieler", "time": 1548275194834, "rating": 5.0, "text": "The best of the best.", "pics": null, "resp": {"time": 1548288324024, "text": "Thanks for the GREAT review Annie! Truly appreciated!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110663857155948949731", "name": "Amy Michaels", "time": 1623166778801, "rating": 1.0, "text": "DO NOT ORDER FROM COTTAGE FARMS!!!\nI received my order in late April, 2 plants were missing, half of the remaining ones were dead.  I called on 5/6/21 to notify them of the missing plants.  Another order was generated for those plants, I was told 2-3 weeks delivery. Fast forward to 6/7/21, called CF to check on the new order, was told it will ship soon. WHAT??? I called back the next day (6/8) since Customer Service never called me back when I asked to speak to someone.  I was told the order just shipped. Another 2-3 weeks delivery, now we're almost in July.  Who plants in July? CF will not work with me.  They never addressed the fact that half of my plants arrived dead. Southern hospitality, right!", "pics": null, "resp": null, "gmap_id": "0x889bca44d90667cf:0x173d8401b20cf46"}
{"user_id": "110543304233539094478", "name": "Pamela Thompson", "time": 1618344584864, "rating": 1.0, "text": "I bought a Knock Out Rose last spring. It arrived dead....nothing but a pile of dried dirt, empty pot and emaciated rose bush came out of the box. I tried calling immediately but was constantly put on hold. I called again last month and got through. They sent me a replacement that was 1/5 of the size pot the original plant came in and it too was dead. I emailed right away and their response was thanks for contacting us. Will not buy from Cottage Farms again. This is not the first dead plant(s) I have received over the years.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPDE41GAZO1S9IrkCm09Qab8kPo4PMAJ60UQier=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bca44d90667cf:0x173d8401b20cf46"}
{"user_id": "112962063689475642801", "name": "Patricia Shockey", "time": 1621349428625, "rating": 2.0, "text": "Having problems with my replacement tree from company thru QVC. Probably not order online from Cottage Farm again. Customer service is nice but no tree.", "pics": null, "resp": null, "gmap_id": "0x889bca44d90667cf:0x173d8401b20cf46"}
{"user_id": "104773884916549814693", "name": "J Swag", "time": 1620859171065, "rating": 1.0, "text": "$60 for these 4, yes 4 plants via QVC. Would you walk into a nursery and drop $60 on this? 1st time and def the last time I deal with them. I reached out to CS and they obviously have a cut and paste response.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNHNsGDUFtwgJ64QC2ZymaSS1eXjZGewZzymEr3=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bca44d90667cf:0x173d8401b20cf46"}
{"user_id": "113176675631098356355", "name": "Carol Thomas", "time": 1617492136409, "rating": 5.0, "text": "Ordered online 3 years ago.  Excellent!  My lilies are still blooming!", "pics": null, "resp": null, "gmap_id": "0x889bca44d90667cf:0x173d8401b20cf46"}
{"user_id": "109565311161679472497", "name": "Kelly A. Hoffman-Pitt", "time": 1623178491459, "rating": 1.0, "text": "I ordered 16 mini rose bushes from cottage farms via QVC.  The plants arrived in horrible shape.  Most looked dead.  QVC refunded my money and told me to toss the plants in the trash.  I won't ever order live plants from Cottage Farms again.", "pics": null, "resp": null, "gmap_id": "0x889bca44d90667cf:0x173d8401b20cf46"}
{"user_id": "113237337014847047395", "name": "Sabrina Barnes", "time": 1623468322522, "rating": 1.0, "text": "So I should have googled reviews first before buying.  Total disaster, shipped plants, lost plants, reship plants, plants turn out to be the FIRST PLANTS.  DEAD ON ARRIVAL.  AND no matter how many photos I sent if there was one green leaf..it was viable to them..NO REFUND.", "pics": null, "resp": null, "gmap_id": "0x889bca44d90667cf:0x173d8401b20cf46"}
{"user_id": "107909022940228059338", "name": "Chris Krieger", "time": 1617215703958, "rating": 5.0, "text": "Also enjoy my purchases. Healthy products.", "pics": null, "resp": null, "gmap_id": "0x889bca44d90667cf:0x173d8401b20cf46"}
{"user_id": "110904316070171859922", "name": "Santiago Nieves", "time": 1589380495298, "rating": 1.0, "text": "I order the live tiki party tropical hibiscus plant through Zulily.. The box that the plant came in looks like a car ran over it .damage open from both sides,ripped and the plant looks like it went through hell and back !!!!the leaves look dead..... very disappointing!!!UNACCEPTABLE!!!!Would not recommend it to anyone. I’m pretty sure it was Pack professionally but The way I received it was bad. When I received it I picked up the box and the plant went rolling down the stairs because the bottom  was opened.........VERRY BAD!!!!!", "pics": null, "resp": null, "gmap_id": "0x889bca44d90667cf:0x173d8401b20cf46"}
{"user_id": "113477471454154716056", "name": "catarific sue", "time": 1566946795669, "rating": 5.0, "text": "We ordered a desert rose which was intact upon delivery.  We replanted it and it is thriving.  Would reorder from this company again.", "pics": null, "resp": null, "gmap_id": "0x889bca44d90667cf:0x173d8401b20cf46"}
{"user_id": "101245558980857082872", "name": "Lerone Wilson", "time": 1550521786208, "rating": 2.0, "text": "I had a mini rose damaged in transit which died a week or two after arrival.  Beware of the Cottage Farms Direct's replacement policy.  If the item is nolonger in stock you have to wait an entire year for the replacement rather than just getting a refund.  Having replaced the item with one from another retailer rather than waiting for Cottage Farms Direct I can say with all honesty that you'll pay a little bit more elsewhere but it's very much worth it in terms of higher quality items/shipping and superior warranty/replacement plans.", "pics": null, "resp": {"time": 1550585034555, "text": "Ms. Wilson - Our replacement policy states that If for any reason you are dissatisfied or your plant does not perform as expected, we will replace it at no charge. Perennials are warranted for one-year and annuals, are warranted for ninety days from time of shipment.  Since your request for replacement came in after our shipping season ended, we advised that your replacement would ship the following season.   We are so sorry to hear that you are not satisfied and have canceled your replacement, however, we are still happy to replace the rose when your shipping zone opens this season.   Please let us know if we can be of further assistance."}, "gmap_id": "0x889bca44d90667cf:0x173d8401b20cf46"}
{"user_id": "108913709431044325691", "name": "patricia sheets", "time": 1562851797321, "rating": 1.0, "text": "I ordered the sun patience from cottage farms via QVC. I ordered them at 2 different times about 3 weeks apart. The 1st two I ordered are barely making it after reaching maybe 3 inches in height. Then my 2nd ordered arrived which I ordered 6, I only have 2 living out of that 6 these came nowhere close to being as large and buetiful as they were shown to get on their shows, the 2 I have left are maybe 3\" high by 4\" wide.bi will never by them from them again. I babied these plants mainly because I put 4 of them at my mailbox at the road, they r pittiful", "pics": null, "resp": null, "gmap_id": "0x889bca44d90667cf:0x173d8401b20cf46"}
{"user_id": "104510441638959640778", "name": "Brad Henderson", "time": 1542732810183, "rating": 5.0, "text": "Joel was very helpful in supplying some nice sized azaleas that are hard to find in the Fort Walton Beach area. Beautiful plants.", "pics": null, "resp": null, "gmap_id": "0x889bca44d90667cf:0x173d8401b20cf46"}
{"user_id": "116672329639577810546", "name": "Lynn Russell", "time": 1557922943558, "rating": 1.0, "text": "When I first ordered from cottage farms through QVC,  they were the best plants money could buy and grew..for the most part as described on tv. For the past 2/3 years, however, the products have gone downhill considerably!! The sunpatiens I received this year weren't nearly the quality as in the past! They were so tiny that i couldnt even plant them until they grew! Some ive still not planted. Needless to say, I'll NEVER order again! Also their logo about customer being satisfied...well.. I had perennials that didn't come back. It took couple of tries calling and finally yesterday my plants arrived. They were slimy and yellow. Only time will tell if they will grow! Now..I'll  have to say customer service was always attentive and courteous. I'll  not be ordering from this company again!", "pics": null, "resp": null, "gmap_id": "0x889bca44d90667cf:0x173d8401b20cf46"}
{"user_id": "101686419585678590137", "name": "The Monroe Family", "time": 1555790466353, "rating": 5.0, "text": "Everything is really nice", "pics": null, "resp": null, "gmap_id": "0x889bca44d90667cf:0x173d8401b20cf46"}
{"user_id": "101094930589118909455", "name": "N S", "time": 1610660326681, "rating": 5.0, "text": "Excellent work, exactly what I wanted. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114261246968034770738", "name": "Jason Elmer", "time": 1582761393136, "rating": 5.0, "text": "Web Detail has been great to work with. Being a small business, I did not have the budget for a full-scale website. Jerimy and his team were there to listen to my specific needs and helped develop something that was just what I was needing for right now that can be built upon. From start to finish the process was very quick.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "104913583038605846920", "name": "Sue R", "time": 1594581970239, "rating": 5.0, "text": "WebDetail has done a fantastic job designing our website!  Jerimy and his team are very responsive if we need to make changes and outstanding to work with! We are very happy clients of WebDetail!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "116205120835683811979", "name": "Sean Lee", "time": 1579616634524, "rating": 5.0, "text": "WebDetail does a great job designing and setting up websites.  They have a lot of good ideas.  Jeremy is very responsive and easy to work with.  I will continue to utilize WebDetail for all our needs.  Thanks for a job well done!\nSean", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "115996356981222899046", "name": "SHANNON MCKEE", "time": 1582832316864, "rating": 5.0, "text": "Jerimy does an OVER THE TOP JOB!  He designed a website above and beyond what we had in mind.  Very professional, reasonably priced and excellent quality.  Would highly recommend him!  Very Very Happy Customer!  thefootclinic.us", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "109190100812205585954", "name": "Haley Baron", "time": 1583159740278, "rating": 5.0, "text": "Jerimy and his team have been phenomenal. One of the things I love most\nabout WebDetail is how quick they are in responding to emails AND how quick they make the adjustments you need on your website. I would recommend to anyone!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "106718618561893959853", "name": "ABC Cleaning and Restoration", "time": 1564612648089, "rating": 5.0, "text": "Jerimy has helped with various marketing strategies and insight on helping our business continue to grow its online presence. It’s been great working with him and his team. Certainly recommended!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "118284671236130426430", "name": "Michael Owens", "time": 1591295730241, "rating": 5.0, "text": "WebDetail LLC designed a professional webpage for our counseling practice in Alabama. We would strongly encourage talking with them if you want to take your business/webpage to the next level!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "108932407904691001085", "name": "Ashok Mahbubani", "time": 1560725021883, "rating": 5.0, "text": "Enjoyed working with Jerimy Lee on improving and updating our websites. He was attentive, informative and offered thoughtful ideas & options. He responded well to our requests for change and helped us meet challenging timing goals.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "107726332193636795174", "name": "Kenneth Winton", "time": 1579619285732, "rating": 5.0, "text": "WebDetail has done a fantastic job with our business website.  It is constantly updated and optimized to give our patients the best online experience and information.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "110626101940050352084", "name": "John Conway", "time": 1581698289524, "rating": 5.0, "text": "Jerimy was very easy to work worth and did a fantastic job!  I highly recommend WebDetail for website development!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "100373388406679517445", "name": "ironsclad", "time": 1579616530589, "rating": 5.0, "text": "Complete rebranding of my business - Irons Distillery - was done by WebDetail.  After having a attic webpage for over 4 years, it was time for a total makeover of my website.  WebDetail was able to take what I discussed with them and turn it into real product - and more than “eye candy” - it was a webpage that tells our entire story and allows excellent interaction with customers.  Check it out at ironsone.com - excellent work!!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "112934247421951823378", "name": "RAE RAE", "time": 1522766325827, "rating": 5.0, "text": "This company does a wonderful job managing and helping me with my company website.  They are patient, courteous and professional and always have time to help me with questions about the site, as well as update me on the newest and latest thing that I need to be doing.  I'm not that computer savvy so it's nice to have someone to count on.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "106803349109772970855", "name": "Matt T", "time": 1560863700511, "rating": 5.0, "text": "Extremely happy with the WebDetail team.  We hear from all our customers how much they like our site and how easy it is to navigate.  Five stars!!!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "105234704733787751409", "name": "Ellen Cozelos", "time": 1561738193154, "rating": 5.0, "text": "They did a WONDERFUL job on my new website!  Have had such a great experience with them", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "102387596088737912825", "name": "Bob Benton", "time": 1560362932614, "rating": 5.0, "text": "Webdetail is my \"go-to\" resource for all things web and social media. Their professionalism, combined with deep experimental knowledge and integrity guarantee me the best possible outcome for my clients, regardless of the size of scope of the project. Sincerely Bob Benton - CRE8IVE Branding.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "116108691609514910280", "name": "jenny mitschelen", "time": 1561399306657, "rating": 5.0, "text": "Jerimy & his staff are the best. We received incredibly friendly & professional service. Jerimy was always available to answer questions during the building of my website. Our planning meetings were fun & efficient. The staff understood my brand & vision & brought it to life. I definitely recommend the investment in having WebDetail polish up your online image!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "110337181174330128258", "name": "Russ Russell Commercial Real Estate", "time": 1560435277137, "rating": 5.0, "text": "Jerimy and crew go the extra mile to ensure you have the best quality service and product available!  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "118309393381061308054", "name": "Brent Hunt", "time": 1560426679691, "rating": 5.0, "text": "My business recently needed to update our website, and after much consideration and research, I decided to try WebDetail.  From the beginning, Jerimy and crew were very patient with me.  Together, we were able to capture exactly what I had in mind from the beginning, plus some added bonuses that were suggested to me by WebDetail.  Everything was done on-time and for a very reasonable price.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "116334689896599768559", "name": "david houser", "time": 1555603649238, "rating": 5.0, "text": "Web Detail did an awesome job on our website and is always very helpful.  They are great to work with.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "111472132666586962898", "name": "SWEET ROCK BAPTIST CHURCH", "time": 1518810263302, "rating": 5.0, "text": "Very nice company to do business with.  Jerimy has been very attentive to our needs and does a great job any time we ask for any changes to our site. Outstanding service and very happy with the service they provide.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "108974017083196184930", "name": "Helen McNamara", "time": 1471967972641, "rating": 5.0, "text": "Great and very detailed service. So very happy with everything he has accomplished with my business. So excited to see how far WebDetail will grow my business. Always completes task super fast. Best company ever!!!", "pics": null, "resp": {"time": 1472573566585, "text": "Thank you Helen!!  It's truly been a pleasure working with you thus far!  You have a fantastic and fun business, and I'm proud to be helping you take things to the next level :)"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "100675740381714374023", "name": "Chuck Bailey", "time": 1560481328198, "rating": 5.0, "text": "Alabama FairTax needed a website several years ago, so the hunt for a web designer ensued.  We needed a comprehensive site to get the word out on the national FAIRtax, and of late, The Alabama Economic Freedom Act.  The result was consultation with Jerimy Lee and kick-off of the site design.  He is easy to work with and backs up the work he accomplishes.  The work was successfully completed In good time and the site successfully launched.  Further, Jerimy “services what he sells” and that is much appreciated.  Trust Jerimy with your digital design needs.  We do!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114707576224750382190", "name": "JoAnna Wright", "time": 1507814790550, "rating": 5.0, "text": "Awesome group! WebDetail has been an immense help to my company's website, social media platforms, and digital marketing. They offer experienced insight and are willing to go the extra mile to get the job done. Highly recommended!", "pics": null, "resp": {"time": 1510669238612, "text": "JoAnna, thank you!  It's been great working with you on SO many projects :)  LOTS more are in the works currently and queued up afterwards!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "113710098397437759369", "name": "Mike Murdock", "time": 1500667270709, "rating": 5.0, "text": "I've been working with Daniel Horton since before he joined WebDetail, and always enjoyed collaborating with him. Daniel really \"gets it\" and has helped us promote our organization to the whole community. I'm always pleasantly surprised by the response that Daniel's work elicits.", "pics": null, "resp": {"time": 1509109703176, "text": "Mike, thank you for the comments!  It's been an absolute pleasure working with you and the team at Huntsville STEAM Works!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "118226670515846768597", "name": "Brooke", "time": 1579636223583, "rating": 5.0, "text": "WebDetail has been such an asset to the development and ongoing production of our website and online marketing plan.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "111054440623475764212", "name": "Jeremy Lihte", "time": 1560362021334, "rating": 5.0, "text": "The group at WebDetail has been a life saver on countless occasions for myself and the organization that I would with. I am an on the ground marketer for a group of health centers in the SouthWest. Without Jerimy Lee and the incredible team at WebDetail, my job would be impossible. Thats not even mentioning the incredible work they have done for us with our online platforms.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "103199170697977985185", "name": "Yvette “Fanci” Kelley", "time": 1495137547326, "rating": 5.0, "text": "It's great! This site helps you locate Businesses as well as promoting yours", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "103899886446719253667", "name": "Brad G", "time": 1501271976446, "rating": 5.0, "text": "WD helps a number of my organizations get their social media handled in a manner that's both creative and efficient. Would recommend their team for your next marketing endeavor.", "pics": null, "resp": {"time": 1510669125545, "text": "Brad, it's been great working with you thus far, and it's only the start of many more incredible opportunities!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114286044098706377322", "name": "Toni Eberhart", "time": 1501272463415, "rating": 5.0, "text": "WebDetail, LLC. is fantastic digital marketing agency to work with. They completed a video project for our organization and it turned out wonderfully. It communicated our story in a visually pleasing and captivating way. The turn around was very quick and reasonably priced. I recommend working with Daniel and Jerimy.", "pics": null, "resp": {"time": 1509109840743, "text": "Toni - we have had an amazing time working with you and Urban Engine!  Excited to see Urban Engine continue to bring great things to the community!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "111446099134632256156", "name": "We Run Huntsville", "time": 1501273877686, "rating": 5.0, "text": "Webdetail is great! They have not only guided us through some challenging times, but have also produced a video that reflects the  essence of our company.  I have been pleasantly surprised at the amount of insight that they have in to the workings of internet marketing. This is a valuable resource that is not to be discounted. Thanks for a great job guys!", "pics": null, "resp": {"time": 1509109915108, "text": "Gregg, we have had a blast working with you on the video projects!  You are doing some fantastic work with We Run Huntsville!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "111020432325955845497", "name": "Greg Austin", "time": 1518127301083, "rating": 5.0, "text": "Jerimy Lee and his team are the best! Friendly, cooperative, super-intelligent, and hard-working, WebDetail will design you a great website and help you perfect it! I couldn't recommend them more highly.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "109534575083022206545", "name": "Andy Johnson", "time": 1480608976682, "rating": 5.0, "text": "WebDetail has been awesome! Jerimy Lee is extremely professional and easy to work with. Always seems to be available when needed. Great company that I would recommend to anyone needing an amazing website.", "pics": null, "resp": {"time": 1480610590149, "text": "Andy, many thanks!  It's been great working with you guys as well!  I'm looking forward to seeing IES grow and succeed!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "100147673057330676819", "name": "Brooks Bryant", "time": 1464206473277, "rating": 5.0, "text": "Jerimy at WebDetail is very professional and easy to work with. The website he created for my business has helped me immensely!", "pics": null, "resp": {"time": 1464213017557, "text": "Thank you Brooks!  Certainly glad we are able to help, and we appreciate your business!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "113316583948192656382", "name": "Nelson Alvarado", "time": 1562602254409, "rating": 5.0, "text": "The staff is awesome and  very professional.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "118026746030869170702", "name": "Brian Hughes", "time": 1500497169568, "rating": 5.0, "text": "I was using a different web designer in the past that was not meeting the needs of my business. Since switching to Webdetail, everything has been smooth and reliable. Jerimy is a skilled and efficient designer and very easy to work with.", "pics": null, "resp": {"time": 1501080165631, "text": "Thank you Brian, I appreciate your business and it's been great working with you guys as well!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "104455046540160577381", "name": "Beth Jett", "time": 1464909157763, "rating": 5.0, "text": "Jerimy is an excellent web designer and very knowledgeable of all of the online strategies to attract users to our website. We are complimented often on how nice our site looks and how easy it is to navigate. He's very proficient and stays current with the constantly changing algorithms of the popular social media venues, teaching us how to and assisting us in capitalizing on SEO. Highly recommended!", "pics": null, "resp": {"time": 1464967479920, "text": "Thank you Beth! It's been a pleasure working with you, not only with updating the new website but also working with you on the SEO and social media side of things!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "110964270584795483257", "name": "Ronnie Kimbrough", "time": 1500480683023, "rating": 5.0, "text": "Great company, we have worked with Jerimy and his staff for last 3 yrs, very pleased with their service!", "pics": null, "resp": {"time": 1501080114467, "text": "Hey Ronnie - many thanks!  It's really been fun working in such an exciting industry - archery and hunting!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "113111821263432371281", "name": "Kenny Wood", "time": 1521566528707, "rating": 5.0, "text": "The folks at WebDetail do a great job.  They live up to their name and focus on the Details.", "pics": null, "resp": {"time": 1521567591806, "text": "Thank you Kenny!  We try to ensure everything is as it should be lol!  Always fun working with you!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114527104744488595419", "name": "mark Barlow", "time": 1498794292084, "rating": 5.0, "text": "I am impressed with Jerimy, more business professional, Marketing savvy than a typical \"web\" man!", "pics": null, "resp": {"time": 1499121147242, "text": "Mark, it's been great getting to know you and  your business!  I look forward to a long lasting business relationship!  Appreciate your business!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114068053410951848338", "name": "Marie Constantinou", "time": 1483656316602, "rating": 5.0, "text": "There are companies out there that make promises they just can't keep.  WebDetail is NOT one of those companies.  Their friendly and professional service is a breath of fresh air.  The results we have had since linking with WebDetail are outstanding and, quite frankly, unbelievable.  I would recommend WebDetail to any business; big or small.", "pics": null, "resp": {"time": 1483824514602, "text": "Thank you Marie!  It's always exciting working with you as well!!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "111293686069620554703", "name": "Donna Robinson", "time": 1464199124662, "rating": 5.0, "text": "WebDetail designed and developed a website for our local chapter of an international non-profit organization and the results were exactly what we wanted.  Jerimy Lee is excellent to work with - very patient and easy to understand for a web novice like me.  When the website was ready to go, he trained several of us on how to make edits on our own so we don't have to bother him all the time.  The way the website was developed makes it very simple and easy for us to edit and add data.  We highly recommend WebDetail for any web development or modifications you need.", "pics": null, "resp": {"time": 1464212981766, "text": "Thank you Donna, for the kind remarks!  As always, we very much appreciate your business!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "106008081027680808414", "name": "Kathey Hamer", "time": 1522087223152, "rating": 5.0, "text": "Executive Women International, Huntsville chapter, was fortunate to learn from Jerimy and Sio'Bhan as our March meeting program/speakers.  WebDetails gave an excellent program on social media platforms. They\nhad EWI members totally engaged as they gave interesting statistics, great advice and information regarding which platform would best meet our needs.  They left us all eager to learn more!  EWI of Huntsville has found a social media, webpage, etc., Connection. We highly recommend WebDetails.  Thank you, Jerimy & Sio'Bhan\n\nEWI BOD\nState Farm, Lara B. Sterling\nJ.R. Enterprises, Margaret Watson\nChamber of Commerce, Pammie Jimmar\nWoody Anderson Ford, Kathey Hamer", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114744844077008166521", "name": "John Molnar", "time": 1480622197799, "rating": 5.0, "text": "Working with a great company is always a good experience, but working with great people is what really makes for a good relationship.  I am so lucky to find both together, here at WebDetail. Jerimy has been both a seasoned professional and a good friend, he is always there for us to answer any question and gives great advice.  Thanks Jerimy!", "pics": null, "resp": {"time": 1482438731272, "text": "Thank you John!  I cannot believe we've been working and dealing together for almost 10 years!!  Thank you again and I wish you all the best!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114268678467562339658", "name": "C Marino", "time": 1480708535931, "rating": 5.0, "text": "Jerimy at WebDetail is awesome  and a total professional Webmaster.\nyou can count on him.\n\nC Marino    Chicago IL", "pics": null, "resp": {"time": 1482438626629, "text": "Carlos, thank you and it's always a pleasure working with you as well!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "117338195291034601019", "name": "Karol M.", "time": 1467824474292, "rating": 5.0, "text": "WebDetail worked well with us to design our business' web-site.  We were extremely specific in what we wanted and Jerimy worked very hard to make sure our needs were met.  We have had great results what few times we've needed maintenance performed on the site.  The site designed by Webdetail is very functional and can be edited easily by our staff to keep it our company's information current.", "pics": null, "resp": {"time": 1467905810688, "text": "Thank you Karol!  It has truly been a pleasure to work with you, Ray and your staff over the years!  Tempforce epitomizes character and values, and it shines through with how successful you have been!  I'm glad to have been able to help where we can.  Again, many thanks!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "111006006727255089842", "name": "Bob Williams", "time": 1500309709056, "rating": 5.0, "text": "I have had several other websites and I have been working for 5 years with Jerimy of WebDetail as my webmaster for multiple sites. He has been very professional and also personally helps me in many other ways.  We are producing a large worldwide marketing program that covers almost all needed for a very productive site. He also handles the SEO, E-commerce, et al. And we are in different states!", "pics": null, "resp": {"time": 1501080051464, "text": "Thanks Bob!  It's been a fun ride working on all the various projects throughout the years!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "116031216443385728740", "name": "Joe Shinkle", "time": 1498687381139, "rating": 5.0, "text": "Jerimy is very skilled, efficient, and great to work with! I will do business with WebDetail again!", "pics": null, "resp": {"time": 1499121111230, "text": "Thank you Joe -- Always a pleasure working with you!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "105870028499102857029", "name": "Larry Marsili", "time": 1464968829254, "rating": 5.0, "text": "I've been very happy with WebDetail's handling of multiple sites for me.  Not only do I use them for my law practice, but also for an unrelated business venture.  I've found Jerimy to be very prompt in responding, as well as knowledgeably and helpful in advising what steps I need to take to optimize my website's effectiveness.  I would recommend Jerimy and his team at WebDetail to anyone looking to start up with a website from the ground up, or anyone that is looking to improve their overall web presence.", "pics": null, "resp": {"time": 1465843125479, "text": "Thank you Larry!  Always a pleasure working with you -- on your numerous business ventures!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "116836471428552388808", "name": "John Crocker", "time": 1466087795559, "rating": 5.0, "text": "The design and quality our office has received from Webdetail for our website needs is simply excellent. I highly recommend Webdetail for all of your company's Webdesign needs. They are simply the best.\nJohn Crocker", "pics": null, "resp": {"time": 1466444222169, "text": "Thank you John!  I've certainly enjoyed our working relationship and certainly appreciate your business!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "101340839177883447969", "name": "Shelley Fraser", "time": 1555079596412, "rating": 5.0, "text": "Webdetail created and manages our company website. Any issues that come up are handled quickly and professionally.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "102917796381484163708", "name": "Lewis DeCarlo", "time": 1614171751646, "rating": 1.0, "text": "Amazon returns not allowed at an Amazon owned company ( Whole Foods) anymore but Kohl's was happy to accommodate.    We ended up leaving whole foods spending $0 and spent over $100 at Kohl's since we were there.  Which company is making smart decisions?", "pics": null, "resp": null, "gmap_id": "0x88626cb08fd76777:0x2b06504088330c"}
{"user_id": "109646113784033320833", "name": "Scott Seeley", "time": 1572751560891, "rating": 5.0, "text": "Enter your code and pop .... and the door opens and you get your stuff. Good for those who can't be home or need it before UPS runs.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOZ_D444S69iD-XdK6NpprkpAsUsg_EtVPVfSwk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cb08fd76777:0x2b06504088330c"}
{"user_id": "116301755906028135766", "name": "Kristaleen Bellamy", "time": 1582987496836, "rating": 5.0, "text": "Great place to get quality groceries and much more. The girl at the bakery counter was super helpful. Her purple hair was awesome. She helped me pick out just the right cake.", "pics": null, "resp": null, "gmap_id": "0x88626cb08fd76777:0x2b06504088330c"}
{"user_id": "114585673555044441274", "name": "James W. Ricci, Jr.", "time": 1594231509031, "rating": 5.0, "text": "Nice and easy access plus it's inside the Whole Foods Huntsville.", "pics": null, "resp": null, "gmap_id": "0x88626cb08fd76777:0x2b06504088330c"}
{"user_id": "108568317713713313055", "name": "Linda King", "time": 1590121631681, "rating": 1.0, "text": "I don't know. I've never been there and never even heard of the place!", "pics": null, "resp": null, "gmap_id": "0x88626cb08fd76777:0x2b06504088330c"}
{"user_id": "100844676062064156369", "name": "Tim Long", "time": 1591136921311, "rating": 5.0, "text": "VERY NICE.🙂", "pics": null, "resp": null, "gmap_id": "0x88626cb08fd76777:0x2b06504088330c"}
{"user_id": "112159644957002301079", "name": "Tus Nanda", "time": 1566310870768, "rating": 5.0, "text": "Smooth", "pics": null, "resp": null, "gmap_id": "0x88626cb08fd76777:0x2b06504088330c"}
{"user_id": "101225568014923026395", "name": "Frankie Hereford", "time": 1602734114786, "rating": 4.0, "text": "Good service, well lit at night. Friendly staff", "pics": null, "resp": null, "gmap_id": "0x8889194155555597:0xa85c140c052c176"}
{"user_id": "102261500396149393647", "name": "Llerret Pordlaw", "time": 1503179263648, "rating": 5.0, "text": "They had the #eclipse glasses I was searching for.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPbs7cDzX7tk6U6Hoptl-YL4Y0uOZ-dh0WTamMp=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889194155555597:0xa85c140c052c176"}
{"user_id": "116095296449765377806", "name": "Jason Gibson", "time": 1532968866223, "rating": 1.0, "text": "Single person bathrooms that were dirty, had no paper towels, and the door and lock were broken. Refilling stations did not have fluid or towels in the windshield washer bins. Terrible station to stop at.", "pics": null, "resp": null, "gmap_id": "0x8889194155555597:0xa85c140c052c176"}
{"user_id": "102819924902103601919", "name": "Mike Rapp", "time": 1553016650976, "rating": 1.0, "text": "Slowest card processing I have ever experienced. Literally.", "pics": null, "resp": null, "gmap_id": "0x8889194155555597:0xa85c140c052c176"}
{"user_id": "116381525675205866660", "name": "Code Smith", "time": 1535906592746, "rating": 1.0, "text": "Terrible gas station. Forces you to listen to stupid ads while you are paying for your gas. If I am paying good money for gas, I don't need you to waste my time with slimy advertisements. Avoid this place, and avoid chevron.", "pics": null, "resp": null, "gmap_id": "0x8889194155555597:0xa85c140c052c176"}
{"user_id": "103617457726780987016", "name": "Job Wachira Mbugua", "time": 1565658452477, "rating": 5.0, "text": "Being open 24/7 and the services👌", "pics": null, "resp": null, "gmap_id": "0x8889194155555597:0xa85c140c052c176"}
{"user_id": "114089027063582733911", "name": "F. S.", "time": 1495863326711, "rating": 1.0, "text": "The short and skinny Indian looking dude that's always there is a pervert!", "pics": null, "resp": null, "gmap_id": "0x8889194155555597:0xa85c140c052c176"}
{"user_id": "112612841325141422224", "name": "J. G.", "time": 1458873433355, "rating": 1.0, "text": "Dirtiest bathroom ever!!", "pics": null, "resp": null, "gmap_id": "0x8889194155555597:0xa85c140c052c176"}
