{"user_id": "108836661559085779151", "name": "Eric Smith", "time": 1610991935730, "rating": 5.0, "text": "Very clean and all protocols were observed (Covid-19), they were very efficient and I was in and taking my national exam in under 15 minutes.", "pics": null, "resp": null, "gmap_id": "0x889a4d0ae57a7d61:0x8b1da057c6d2150a"}
{"user_id": "112150629877176228640", "name": "Jessica Davis", "time": 1607481319756, "rating": 5.0, "text": "The two employees working were fantastic and the facility was very clean.", "pics": null, "resp": null, "gmap_id": "0x889a4d0ae57a7d61:0x8b1da057c6d2150a"}
{"user_id": "104975559468335964182", "name": "Amanda Shanahan", "time": 1591919624997, "rating": 5.0, "text": "They were great.  Friendly and clean.  Comfortable testing areas.", "pics": null, "resp": null, "gmap_id": "0x889a4d0ae57a7d61:0x8b1da057c6d2150a"}
{"user_id": "107712864936056779328", "name": "Christy Ross", "time": 1612298827204, "rating": 5.0, "text": "Great staff, very clean,  and professional", "pics": null, "resp": null, "gmap_id": "0x889a4d0ae57a7d61:0x8b1da057c6d2150a"}
{"user_id": "107602840420322876740", "name": "Tiffany Dortch", "time": 1595003109525, "rating": 5.0, "text": "We had such a positive experience with Sylvan in Montgomery, AL. The owner, staff and teachers are all wonderful!", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "113003993805946009866", "name": "Cameron Sheffield", "time": 1565381020930, "rating": 5.0, "text": "Sylvan made school work during the summer fun!! The staff is very caring and friendly. They were able to accommodate our busy schedule and most importantly help our children master the needed course work.", "pics": null, "resp": {"time": 1569246851349, "text": "Thank you for your feedback, Cameron!  I'm so proud of your children and all of their hard work this summer!"}, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "117246863388269659024", "name": "Heidi Ingraham", "time": 1574127528428, "rating": 1.0, "text": "My children tried the after school Robotics program for 2 months. The concepts they learned had very little to do with robotics, mostly coloring sheets. Also, on the final day we intended to participate, the staff emailed at 1:45pm that they would not have the after school program due to staffing shortage and that parents should pick their children up at 3pm. When I inquired about my refund for that date they indicated  that there wouldn't be one because the program was a subscription. So even though they made it impossible for me to use my subscription for the day they refused me a refund for that day.  I do NOT recommend this location.", "pics": null, "resp": {"time": 1575326956218, "text": "Greetings Ms. Ingraham.  First of all, thank you for sharing your lovely children with us for after-school Robotics.  We had so much fun with that bright group of little learners!\nCoding is very heavily involved in Robotics.  It is important to introduce new skills and concepts in a way that is best for the students to understand and grow their basic working knowledge.  At times, it is necessary to use unplugged activities to set each student up for success in these new coding concepts, especially in such a young group of engineers.\nAs for the subscription / final session:  We have been conducting after-school programs since the beginning of the school year for this particular school.  We charge a flat subscription fee no matter the number of weeks included in the month.  Some months had 5 sessions and some had 4 making it even out in the end.  Canceling the last session in the month was a worst case scenario for us.  We regret it was unavoidable due to mass sickness, leaving us with no teaching options.\nI believe in what we do and I'm so proud of how we do it!"}, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "117129150128969149226", "name": "Joel Stephens", "time": 1569026744424, "rating": 1.0, "text": "They guaranteed that my son would receive one on one tutoring,  and he never ever received one on one tutoring at all. The people that work here are very pushy and rude. Every parent that I talk to that has used Sylvan states the exact same thing. Please save your money and time and headaches and go elsewhere. We were referred to Huntington Learning Center,  and they are absolutely the best ever. They are one on one as described and very professional.", "pics": null, "resp": {"time": 1569246788352, "text": "Good morning Joel.  Thank you for your feedback.  Will you please confirm this occurred at the Montgomery location on Lomac Street?  We strive to give the very best service and this doesn't sound like our level of service.  Please give us the opportunity to make this right if it is, in fact, us in Montgomery.  Please feel free to contact me directly.\nMisty Mitchell\nEducation Director\nSylvan Learning Center\n334-262-0043 md@montgomerysylvan.com"}, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "108952846401498897697", "name": "Delane Alexander", "time": 1610751726937, "rating": 1.0, "text": "No stars if I could ... Enough said", "pics": null, "resp": {"time": 1611069943345, "text": "Your student accomplished so much in her time here!  I am amazed at her progress and mastery of skills and concepts.  I have no doubt she will continue to be successful.  She overcame a substantial obstacle, and for that, I am extremely proud!  I am sorry you feel the way you do about our organization.  We give chances and options where there often aren't any options left.  I wish you shared the same positive feelings as us as we cheered her on during her time here.  Thank you for your feedback."}, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "104391823304518753595", "name": "Karen Jones", "time": 1606786233592, "rating": 5.0, "text": "Great tutoring facilities!", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "113848128360815880609", "name": "Misty Mitchell", "time": 1437496514212, "rating": 5.0, "text": "Both of my children took the Math EDGE course over the Summer.  They loved their teacher, Ms. Shan, and loved the math games they played as a group with their peers.  We are looking forward to the after school robotics classes coming this fall!  The newly renovated building is nice too.", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "103771973521769588525", "name": "Keith Wheeler", "time": 1520968257880, "rating": 5.0, "text": "Daughter really likes her teacher, flexible hours, great staff.", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "117978169329440241304", "name": "Andrea Cheatham", "time": 1497563444952, "rating": 4.0, "text": "The staff and teachers are amazing.", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "100361476421749680803", "name": "bob smith", "time": 1624027460381, "rating": 1.0, "text": "Management sucks. The job is a very good job, management just sucks. Devin and Angie have poor communication skills.", "pics": null, "resp": null, "gmap_id": "0x888918b9afb6c883:0xedf9b9a955398bad"}
{"user_id": "115771900675003907785", "name": "kirsten McNair", "time": 1597591799307, "rating": 3.0, "text": "Good if you are fresh out of college. I personally wouldn’t consider this a permanent job.", "pics": null, "resp": null, "gmap_id": "0x888918b9afb6c883:0xedf9b9a955398bad"}
{"user_id": "101410311223568137358", "name": "Kendrick Abrams", "time": 1559147650260, "rating": 5.0, "text": "I've worked for the company nearly 10yrs and I've enjoyed my time with the company. The relaxed environment, flexible schedules,  and competitive pay make a great choice for anyone looking for employment.", "pics": null, "resp": null, "gmap_id": "0x888918b9afb6c883:0xedf9b9a955398bad"}
{"user_id": "107275055251502717879", "name": "Sharon Calhoun", "time": 1574363024086, "rating": 2.0, "text": "They don't know how to treat everyone with respect. They play big time favorites.  Turn over is high", "pics": null, "resp": null, "gmap_id": "0x888918b9afb6c883:0xedf9b9a955398bad"}
{"user_id": "105444631750125470103", "name": "LaSandra Abercrombie", "time": 1525019597333, "rating": 5.0, "text": "The atmosphere is laid back", "pics": null, "resp": null, "gmap_id": "0x888918b9afb6c883:0xedf9b9a955398bad"}
{"user_id": "105429798320152689734", "name": "Angi Whatley", "time": 1621097660320, "rating": 5.0, "text": "My husband and I stopped by this store while we were in Huntsville for some new toys. The blonde sales lady that helped us was excellent. One of the toys we purchased malfunctioned that same evening. The store was closed the next day and we were traveling home (5 hours away) so I called the store on the following day to get a replacement. I left a message with my information. Never heard a word from the store. I called back and I was told I could bring the toy back and they would troubleshoot it and/or replace it. I explained that I live 5 hours away. The sales lady said she would have the manager call me back that same day. I haven’t heard a word from the manager and I am very disappointed in their customer service. I was originally told that the product I purchased had a year warranty and if I had any issue at all to let the store know. This toy was expensive! Buyer beware!!!\n\nUpdate: the owner of Sultry reached out to me and was wonderful! My toy will be replaced and I am satisfied! This is a very nice store.", "pics": null, "resp": {"time": 1621095678880, "text": "Hello Angi,\nI’m so sorry you experienced any issues with covering the warranty under Sultry’s 30 days. We tried to follow up the day of (May 7th) but we were informed you were at a graduation and you would not be able to answer. Tiffany  contacted you the next day (May 8th) and left a message on your voicemail that we could ship out the replacement with no issues due to the distance.\n\nI’m sorry there was a hiccup but we always try to make things right for our clients. If you would like to call and continue with the options we left on your voicemail we will gladly follow through with the warranty exchange.\n\nPlease contact Tiara to further assist 2568804884.\n\n* Called and left a message today May 15th to provide more assistance.\nThank you"}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "102026082832118376186", "name": "Throttlebuff", "time": 1622042870758, "rating": 5.0, "text": "Great folks that make you feel comfortable and are a lot of help.  As a matter of fact, my girls favorite toy came from here by recommendation  by the hottie behind the counter ..", "pics": null, "resp": null, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "103699721701951618079", "name": "Sonya Mae", "time": 1609181617248, "rating": 5.0, "text": "I love Sultry. The staff and owner are the most knowledgeable I have ever met. They truly go out of their way to help. Never trying to sell, just making sure I have what I truly need or want. The education is by far the main reason I keep going back.", "pics": null, "resp": {"time": 1609254094449, "text": "❤️ Thank you ❤️"}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "100156075553134599473", "name": "Sonya", "time": 1609182354468, "rating": 5.0, "text": "Excited for NYE now that I have something gorgeous to wear under my dress. As well as a little something for later for my man. I love this store! PS - my man likes this store too and comes to get stuff for us as well.", "pics": null, "resp": {"time": 1611329037489, "text": "THANK YOU!"}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "103251489706955475925", "name": "Amanda Champion", "time": 1580613423937, "rating": 5.0, "text": "I can't say enough wonderful things about Sultry! Tiara was absolutely lovely to work with. She helped my friend find the most amazing outfits for her boudoir session coming up. It was wonderful to be able to go into an adult store and be overwhelmed with the options in our size to try on. I'll definitely be back for all my sexual wellness needs.", "pics": null, "resp": {"time": 1580617496832, "text": "Thank you Amanda for your kind words. We are so happy you and your friend had a great experience at Sultry. 💕\nWe can’t wait to see you guys again :)"}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "116527122472662769164", "name": "Angel Iddings", "time": 1570491690492, "rating": 5.0, "text": "I was unsure of what I wanted and unsure of myself when I walked in. The owner dropped what she was doing and after talking to me for just a few seconds she knew exactly what I needed (even though I didn't) she made me feel comfortable, gave me advice and built my confidence. Everything was very good quality,  the shop was classy and the owner and employees were professional.", "pics": null, "resp": {"time": 1570501275656, "text": "Thank you for the kind review Angel. We are so happy you had a great experience.  You are beautiful in and out.\nThank you for giving Sultry and opportunity.\n:)"}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "116797010551126489514", "name": "Jason O'Neal", "time": 1562362387877, "rating": 5.0, "text": "Hands down the most professional and inviting adult store I’ve ever seen. Owner and staff are amazingly caring as they guide and provide superior service. Go here and take your relationship to the next level!!!", "pics": null, "resp": {"time": 1564177112171, "text": "Thank you ;)"}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "100017208011576615379", "name": "Lindzee Hamel", "time": 1543965859486, "rating": 5.0, "text": "Wish I could give this place more stars. The owner is so nice and she knows her stuff! She makes you feel so relaxed and went through like a hundred different outfits with me. Seriously, the best!", "pics": null, "resp": {"time": 1543969848244, "text": "Lindzee thank you so much for the kind review.  I thank you for giving me the opportunity to help. You are beautiful in and out.  I hope to see you again ;) 😍♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️"}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "102532256833101143271", "name": "Jimmy Cockrell", "time": 1501725702055, "rating": 5.0, "text": "This place and the owner Tiara are truly amazing. They go far above and beyond to get exactly what their customers want. So easy to talk to. Very knowledgeable about all their products. my wife and I would recommend sultry to anyone looking for a great experience with awesome people. Not to mention the great selection of products.", "pics": null, "resp": {"time": 1501730191303, "text": "Jimmy, thank you for the kind words! Customers like you are the reason we are in business. At Sultry, we will continue to provide sexual wellness, education and quality products at competitive prices to the Huntsville area. We understand that discretion is key when dealing with intimate matters."}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "111698366478298723303", "name": "Jacob Ball", "time": 1549822210639, "rating": 5.0, "text": "My wife and I visited this establishment yesterday. The owners were extremely polite and most importantly knowledgeable of the products they had. Already we know that we will be going back. Thank yall so much.", "pics": null, "resp": {"time": 1549840730710, "text": "Thank you for visiting Sultry. We are so happy you had a great experience.  We look forward to seeing you both again.\n-Tiara"}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "103197850019538764163", "name": "Brandon Spears", "time": 1580783269736, "rating": 1.0, "text": "I was looking for something for my wife but I felt I wasn’t being listened to.", "pics": null, "resp": {"time": 1580847107796, "text": "Hi Brandon. Thank you for your review. We apologize you felt as if you weren’t being listened to. For we at Sultry have so many options to bring in items for our clients. We would love to make your experience a better one. You May contact us at info@sultry-hsv.com.\n*"}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "106084778288043573352", "name": "Cheyenne Tucker", "time": 1518831309211, "rating": 5.0, "text": "The staff are very knowledgeable and helpful! I found everything I was looking for and more. Great selection, even for a plus size girl like myself! Thanks Sultry!", "pics": null, "resp": {"time": 1518832119431, "text": "Thank you for your kind review Cheyenne. We at Sultry believe EveryBODY is sexy. Thank you for visiting Sultry Adult Boutique.  We look forward to seeing you again love."}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "113775650472554395100", "name": "Stephanie Woodlan", "time": 1519113576619, "rating": 5.0, "text": "I visited Sultry on 2/15/2018.  Best customer service. Made me feel really comfortable.  Great lingerie and toys selection.  I found my new go to shop.", "pics": null, "resp": {"time": 1519963915253, "text": "Thank you for visiting Sultry Stephanie.  We are ecstatic to have you apart of our clientele.  See you again soon."}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "103696025419201686866", "name": "erika smalley", "time": 1484262222447, "rating": 5.0, "text": "Owner is very helpful. Makes you feel very comfortable and like one of her best friends! I'll be back!", "pics": null, "resp": {"time": 1484266680548, "text": "Thank you dear! It was a great time! Thank you for letting me help you and thank you for letting me know what you would like to see more of in the store! That helps a great deal. SEE YOU AGAIN SOON."}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "118302354255226529410", "name": "Brad L.", "time": 1583300339681, "rating": 5.0, "text": "An informative experience.", "pics": null, "resp": {"time": 1584600451707, "text": "Thank you for your feedback. We are happy you enjoyed your visit. :)"}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "112634883880185957186", "name": "Tori Trudeau", "time": 1503073185049, "rating": 5.0, "text": "Sultry is the best place around with great prices. Sultry offers so much to include educational classes and I can't wait to attend tomorrow nights class.", "pics": null, "resp": {"time": 1503074008023, "text": "♥️"}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "109458054940157019427", "name": "Katie Sunshine", "time": 1473944321111, "rating": 5.0, "text": "Tiara and her shop are both absolutely *amazing*! The shop has a good selection, and Tiara told us if we are interested in anything else, all we have to do is ask. For interested vegans, Sultry provides a nice selection of vegan-friendly products and gear. I love the convenience of having it \"right next door\" versus ordering online---and being able to see/touch items before buying is super awesome. We will definitely be back! :)", "pics": null, "resp": {"time": 1538450475336, "text": "♥️"}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "113519492421796512541", "name": "Tianna", "time": 1467507110601, "rating": 5.0, "text": "Extremely helpful and very knowledgeable. Would recommend Sultry to anyone!", "pics": null, "resp": {"time": 1538450486137, "text": "♥️"}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "105535578913484903471", "name": "Amy Cockrell", "time": 1501725750885, "rating": 5.0, "text": "Customer service is fantastic , staff is very helpful as knowledgeable and would recommend this to anyone !", "pics": null, "resp": {"time": 1501729929198, "text": "Thank you so much for taking time out of your busy schedule to write this review. At Sultry we pride ourselves on the customer experience.   Sexual wellness, education, a wide selection of enhancement products and discretion are paramount. Please let us  know how we can further your experiences."}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "105877040047207517322", "name": "Lindsey Smith", "time": 1519963129754, "rating": 5.0, "text": "Great selection of products and the owners are very informative and helpful! Will be returning!", "pics": null, "resp": {"time": 1519964244622, "text": "Hey Lindsey, thank you for the kind review. It was a pleasure assisting you today and hope to see you again soon love. -Tiara"}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
{"user_id": "105004345190338003828", "name": "Laura Morgan", "time": 1535135557263, "rating": 5.0, "text": "Very nice and great selections", "pics": null, "resp": {"time": 1536545124536, "text": "Thank You Tyler for your kind review. :)"}, "gmap_id": "0x88620d5bbf2857d7:0x21e0646547bb37dc"}
