{"user_id": "108639220642260996903", "name": "Jolene Bethke", "time": 1624141261758, "rating": 5.0, "text": "Friendly, caring people who answer all questions and provide guidance.", "pics": null, "resp": {"time": 1624454680161, "text": "Thank you. It was a pleasure to meet you and assist with your life."}, "gmap_id": "0x8889cbb8b9d7a36b:0x49e5f0657cfa5531"}
{"user_id": "106708779202925730278", "name": "Carolyn Dietrich", "time": 1465479404093, "rating": 5.0, "text": "I have gotten to know Elizabeth Bonner at C. Blake West, over the last year.  Each and every week, I hear her talk about different situations that could happen in one's life and the serious repercussions if you don't have a plan in place.  As a business owner, homeowner, caregiver, you need a plan.  Similar to insurance, you hope you never need it, but you're glad you do, if something happens!  Elizabeth is extremely knowledgeable, explains things in a way that anybody can understand, is incredibly nice and a fabulous person to know.  I recently had a real estate deal and C. Blake West represented my client's Medicaid needs.  A wonderful, stress-free experience!  I look forward to her helping my family with POA's and medical directives, etc.  She is truly worth the call.", "pics": null, "resp": {"time": 1465482250383, "text": "Thank you."}, "gmap_id": "0x8889cbb8b9d7a36b:0x49e5f0657cfa5531"}
{"user_id": "108639220642260996903", "name": "Jolene Bethke", "time": 1626640588410, "rating": 5.0, "text": "Excellent counselor. Very helpful.", "pics": null, "resp": null, "gmap_id": "0x8889cbb33ebc452f:0xb847be04d254d89e"}
{"user_id": "104124674473373510566", "name": "Steven Studdard", "time": 1580732190502, "rating": 3.0, "text": "If we were not still waiting on month 7 after being told it would take about 6-8 weeks along with no one ever calls you back they would get 5 stars. Nice and knowledgeable people but I feel like ive had to do more calling and making sure stuff was done after I paid $1200 for them to handle.", "pics": null, "resp": null, "gmap_id": "0x888a3ea43cc99ae5:0x513015c497600772"}
{"user_id": "102115526731176243536", "name": "Maryann Studdard", "time": 1583854102946, "rating": 1.0, "text": "Was advised our case would take 6-8 weeks to close out once we had court date, 6 months later we are still being jerked around and can not get a return call. If I want to know what is going on with my case I have to make an appt only to be told it's one more thing that needs to be done. Now he has filed extensions without notifying us first. I am filing a complaint with the Bar Association. I would not recommend him.", "pics": null, "resp": null, "gmap_id": "0x888a3ea43cc99ae5:0x513015c497600772"}
{"user_id": "110671702402165400335", "name": "Jonathan Duckworth", "time": 1523126620135, "rating": 5.0, "text": "Incredible attention to detail and very attentive. They took there time to work with me and delivered in a very timely manner. If you need real estate legal work done then look no further!", "pics": null, "resp": null, "gmap_id": "0x888a3ea43cc99ae5:0x513015c497600772"}
{"user_id": "106437266824903567824", "name": "Wes Sutton", "time": 1488486881258, "rating": 5.0, "text": "I've dealt with Jim, Matt, Mike and Elizabeth all professionally and they've all been more than helpful, prompt and efficient. I recommend their firm for real estate or any other legal matter.", "pics": null, "resp": null, "gmap_id": "0x888a3ea43cc99ae5:0x513015c497600772"}
{"user_id": "113535264289069168614", "name": "John Doe", "time": 1447432567974, "rating": 1.0, "text": "Mr. Inzer is nothing less than a criminal. If I would do what this man has done I'd be in prison. He should be disbarred. And to think he's been a City Judge..... What a crook...... I really don't know how he sleeps at night.", "pics": null, "resp": null, "gmap_id": "0x888a3ea43cc99ae5:0x513015c497600772"}
{"user_id": "112908220235556416143", "name": "Nicky. Rowe", "time": 1530495530832, "rating": 5.0, "text": "Excellent service great lawyer", "pics": null, "resp": null, "gmap_id": "0x888a3ea43cc99ae5:0x513015c497600772"}
{"user_id": "114789036087068887103", "name": "Slymm Gilbert", "time": 1512694100215, "rating": 5.0, "text": "One of the best lawyer's in Gadsden", "pics": null, "resp": null, "gmap_id": "0x888a3ea43cc99ae5:0x513015c497600772"}
{"user_id": "116047942398961220474", "name": "Bradley Tribble", "time": 1496846538937, "rating": 5.0, "text": "Very courteous and helpful.", "pics": null, "resp": null, "gmap_id": "0x888a3ea43cc99ae5:0x513015c497600772"}
{"user_id": "100223822991006352351", "name": "Sandra Wood", "time": 1614895917782, "rating": 5.0, "text": "This is hands a great law firm.  Steve Heninger and his paralegal Pamela were phenomenal from start to finish.  Steve took our complex case, and was responsive/empathic throughout the entire process.  He was able to reach a successful resolution without having to proceed with a trial.  We were very pleased with the outcome, and would not hesitate to use this firm in the future.  Would highly recommend.", "pics": null, "resp": {"time": 1615248295893, "text": "Hi Sandra, thank you for the great review. We always put our clients first, and it’s excellent to see that you had a five-star experience with us."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "117448887259587661989", "name": "Jack Simpson", "time": 1621350993699, "rating": 5.0, "text": "Eric has been working  on a case for me for awhile now. He’s always communicated with me about the case and was always looking out for my best interests. I would recommend them to anyone who’s looking for a great attorney. Thanks you sir for all you’ve done for me and always going the extra mile.", "pics": null, "resp": {"time": 1621364096973, "text": "Thank you for your review, Jack! Communication is a top priority when it comes to serving our clients at HGD."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "104068073877662004616", "name": "Jessica Shackelford", "time": 1614702477089, "rating": 5.0, "text": "Working with Nada and Jackie was a dream! They always made themselves available to answer questions. They explained things clearly to me that allowed me to make the best decision for me. They never stopped fighting for my case to ensure I received what was deserved. I can truly say they have changed my life!", "pics": null, "resp": {"time": 1614888219410, "text": "Hi Jessica, thank you for leaving us a great review! We’re here to give our clients the best representation and it’s fantastic to hear that you received top-quality legal support."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "100931808633067923799", "name": "Neal Owings", "time": 1624460239058, "rating": 5.0, "text": "Excellent Law Firm, Anna Carroll did her due diligence and exceeded my expectations. Thank you!", "pics": null, "resp": {"time": 1624460931185, "text": "Thank you for the 5-star review, Neal!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "103514086294878354306", "name": "MsBooFish", "time": 1627771472452, "rating": 5.0, "text": "Consummate and compassionate professionals! I highly recommend this firm!!", "pics": null, "resp": {"time": 1627911376679, "text": "Thank you for your kind words!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "107388512022129772614", "name": "Dustin Mccombs", "time": 1611773710890, "rating": 5.0, "text": "During my experience with Heninger Garrison Davis, I have been shown courteous, personalized, and prompt coordination in our relationship. I am never left in the dark and am always included step by step in progress and decision making along the way! They have been an excellent firm to work with!", "pics": null, "resp": {"time": 1612230062991, "text": "Hi Dustin, thank you for the great review. We always put our clients first, and it’s excellent to see that you had a five-star experience with us."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "112910142062003713756", "name": "Jonathan Lusk", "time": 1615469332047, "rating": 5.0, "text": "As a practicing attorney myself, I was well aware of this law firm's excellent reputation before I selected them to handle a lawsuit on behalf of my family. The firm lived up to its reputation and more.  Attorneys Tim Davis and Mark Ekonen handled our case. They both worked tirelessly all the way through to a successful settlement. My family and I could not be more pleased with their legal expertise and consummate professionalism. Moving forward, I will refer clients to Heninger Garrison Davis without reservation. Take it from an attorney who knows the difference between average and superior legal representation -- if you have been wronged and need a top flight law firm in your corner to achieve the best possible result, contact Heninger Garrison Davis.", "pics": null, "resp": {"time": 1615471606817, "text": "Thank you so much for your kind words, Jonathan! It means so much coming from a fellow member of the legal community. All the best to you and your family!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "108263681152454855991", "name": "Jacklyn Stegman", "time": 1614369530401, "rating": 5.0, "text": "After our bad accident (a semi truck merged into us at 65mph) myself and my mother-in-law were referred to Heninger Garrison Davis as the people who could help us the best. Let me tell you, they were right. The people we worked closest with were Mark,  Eric, and Beverly, and they are all so friendly and helpful.\n\nEven considering that I moved to a different timezone shortly after the accident, I still felt that I was able to easily communicate with them about any questions or concerns I was having (they respond with most efficiency to email in my experience).\n\nDuring negotiations with the other party (which lets face it, thats the part all of us care about the most) I was shocked by how willing this practice was to work with us and help us obtain the settlement we needed to finally put this ugly event behind us. While I sincerly hope that I am never in another situation that would call for it, I would happily use this law firm again and/or refer them to any friend or family member in need of legal representation.", "pics": null, "resp": {"time": 1614815223284, "text": "Hi Jacklyn, thank you for leaving us a great review. We’re here to give our clients the best representation and it’s fantastic to hear that you received top-quality legal support."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "103328392431722193625", "name": "Lisa Jones", "time": 1607621476590, "rating": 5.0, "text": "I truly had a pleasant experience working with Anna. This was a very sensitive matter for me & my first legal issue. Anna came highly recommended to me, and I would recommend her to someone else. I really appreciate you representing me.", "pics": null, "resp": {"time": 1611161443872, "text": "Thank you for your recommendation, Lisa! We are lucky to have clients like you and want to do everything we can to support you and get the outcome you deserve!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "100202754459755523423", "name": "Kam Pugh", "time": 1616170997721, "rating": 5.0, "text": "Erik persevered and kept me updated through a process where an insurance company tried to draw things out as long as possible. I would highly recommend Erik and his team to anyone who has a need in this area.", "pics": null, "resp": {"time": 1616185702960, "text": "Thank you for your review, Kam! Communication is a top priority when it comes to serving our clients at HGD."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "109858388818703864714", "name": "Matt Sato", "time": 1611761673606, "rating": 5.0, "text": "Unfortunately we had an accident where my wife was injured in a car accident and we needed to seek representation.  The process is already stressful and difficult but Brandy Robertson and her team at Heninger Garrison Davis, LLC provided knowledgeable and excellent service that brought acceptable resolution to our case.  Especially during the current COVID environment and with the courts being backed up it was great to see this Firm adapt to the current situation and get our case settled.", "pics": null, "resp": {"time": 1612230107811, "text": "Hi Matt, thank you for leaving us a great review! We’re here to give our clients the best representation and we are honored to have been able to work with you and your family."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "112005915573678205669", "name": "Cassie Gilbert", "time": 1611780890408, "rating": 5.0, "text": "Mr. Leonard is a very kind and  caring person. He has handled everything quickly and professionally.", "pics": null, "resp": {"time": 1612230040171, "text": "Hello, Cassie – thank you for the great review! We will pass along your kind words to Mr. Leonard as well."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "109618002338938492867", "name": "Brian Kinsley", "time": 1603217498179, "rating": 5.0, "text": "Henninger Garrison Davis is a great firm that works hard for their clients.  They are leaders in the legal community and results driven. I have worked on projects with them for years and enjoy collaborating with them.", "pics": null, "resp": {"time": 1603397732071, "text": "Thank you so much, Brian. We enjoy collaborating with you as well!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "100135860165502881183", "name": "Jeannie Nabers", "time": 1615241875739, "rating": 5.0, "text": "For anyone in need of professional, caring advice or representation, I highly recommend Heninger Garrison Davis, LLC.", "pics": null, "resp": {"time": 1615248269478, "text": "Thank you for leaving us a five-star review, Jeannie. Having you as a client has been a pleasure!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "109827643183457029276", "name": "Melissa Williams", "time": 1603392002144, "rating": 5.0, "text": "Ive had a great experience with them and I will be working with them in the near future for other cases if needed..", "pics": null, "resp": {"time": 1603397677166, "text": "Thank you for the kind words, Melissa. We are here for you if you ever need us."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "111836952100666997166", "name": "susan belcher", "time": 1589478689421, "rating": 5.0, "text": "I would highly recommend this firm. They are a very experienced, ethical, professional team which provided me with excellent legal advice for a complex issue. Thank you Beverly and Erik!", "pics": null, "resp": {"time": 1589502970482, "text": "Thanks, Susan. Great clients lead to great results!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "118124565530071795128", "name": "Megan Miller", "time": 1613176897165, "rating": 5.0, "text": "Knowledgeable, professional and thorough attorneys and staff", "pics": null, "resp": {"time": 1614045764895, "text": "Thank you for the thoughtful review, Megan!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "115769008729721991113", "name": "Laura Coe", "time": 1572910601807, "rating": 4.0, "text": "My husband and I are in the midst of a class action, medical device failure, we believe the manufacturer of the product is liable for his 15 year, ongoing medical battle with the device. Even though we have not met face to face with the attorneys,  HGD has always been quick to return phone calls, answer our call, the first time, not after days and days of leaving voicemails. Our contacts are busy doing all the leg work, representing other clients in court, etc. They are professional, keep you informed, and answer your questions quickly and honestly to the best of their ability. Sometimes the answers aren't what you want to hear, but sometimes the truth hurts. Their experience , willingness to work ethically as a team shows! I plan on writing another review down the line as our case proceeds through the judicial system.", "pics": null, "resp": {"time": 1572915821542, "text": "Thank you so much for your kind words, Laura! We really appreciate you taking time to share your experience with us! We are so glad that your needs are being met by our team and that we are keeping you updated on your case. We count ourselves lucky for clients like you and your husband! Please feel free to reach out to anyone on our team at any time should you need our assistance! Thanks again"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "117813000061196327661", "name": "colette Jones", "time": 1565891295396, "rating": 5.0, "text": "This is a highly reputable firm with highly knowledgeable attorneys. The staff are warm and caring. Highly recommend!", "pics": null, "resp": {"time": 1565891590285, "text": "Thank you for the great review! We are here to help you anytime."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "116724168243060263378", "name": "Stephen Orr", "time": 1617988559066, "rating": 1.0, "text": "Grossly misled, ignored and overcharged!", "pics": null, "resp": {"time": 1617993523719, "text": "Dear Stephen,\n\nThank you for taking time to post a review for us. We are sorry to hear that your experience was not what you expected. We set a high standard for ourselves and we’re so sorry to hear this was not met in your interaction with our business. We do pride ourselves on our clear communication and full disclosure of all fees at the beginning of any client relationship. For that reason, we would like the opportunity to talk with you and investigate your feedback further. Please feel free to reach out to me directly at 205-327-9121 at your convenience so we may discuss how to possibly resolve your issues. Thanks again.\n\nT. Gauldin – Firm Admin"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "103367730960486795057", "name": "Linda Bond", "time": 1578765196010, "rating": 5.0, "text": "I recommend this attorney, he works hard for his client’s best interest.", "pics": null, "resp": {"time": 1580337074375, "text": "Thank you for your recommendation! We are lucky to have clients like you and want to do everything we can to support you and get the outcome you deserve!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "113802985391468570626", "name": "Bill Freise", "time": 1572975913938, "rating": 5.0, "text": "Bill Bross is the greatest. I have never dealt with any one who is more helpful professional or caring I recommend them 110 pct", "pics": null, "resp": {"time": 1572982930898, "text": "Thank you for the great review, Bill! We could not agree with you more about Bill Bross. He is the best of the best! We are also very thankful for great clients like you! Thank you for putting your trust in us and we look forward to our continued partnership with you!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "114487378074814080881", "name": "Mark Phillips", "time": 1584291222506, "rating": 5.0, "text": "I can't say it would be a conflict of interest. Just kidding these guys are very professional and there's a whole team of them there they get it done thanks guys", "pics": null, "resp": {"time": 1589502994161, "text": "Thanks so much Mark! We appreciate working with people like you!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "114007062462287616139", "name": "John Smith", "time": 1619300763618, "rating": 5.0, "text": "Great people", "pics": null, "resp": {"time": 1619442704008, "text": "Thank you, John! It is always a pleasure helping clients."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "108516747051589409617", "name": "Bentley Schoening", "time": 1539708503403, "rating": 5.0, "text": "We have worked with HGD for many years. They are a very reputable firm with exceptional attorneys and staff. Highly recommended!", "pics": null, "resp": {"time": 1565891651641, "text": "Thank you for the kind review, Bentley. We have enjoyed our partnership with you as well."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "112544730905252623315", "name": "Kewanee Fox", "time": 1558353981216, "rating": 5.0, "text": "Nice office.", "pics": null, "resp": {"time": 1565891623846, "text": "Thank you for taking time to review our firm! We hope to see you soon."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "116909536351440176650", "name": "Bobbie Payne", "time": 1497800149532, "rating": 5.0, "text": "They are great lawyers", "pics": null, "resp": {"time": 1536772384282, "text": "Thank you for the kind words!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "113387965465072167795", "name": "Wanda Smith", "time": 1613415668249, "rating": 5.0, "text": "Great lawyer merrill VERY willing to help in any situation,and VERY CARING about what your going through 👏", "pics": null, "resp": null, "gmap_id": "0x888bb3befe31c2e5:0x6ec0d055da097452"}
{"user_id": "107935249538157259915", "name": "ken moore", "time": 1600969486770, "rating": 5.0, "text": "Good people.   Would recommend to anyone", "pics": null, "resp": null, "gmap_id": "0x888bb3befe31c2e5:0x6ec0d055da097452"}
{"user_id": "100677240391595878739", "name": "rachel reynolds", "time": 1519162934122, "rating": 3.0, "text": "Everything went fine until a year later and I find out the lawyer I used here did not get the papers signed by the judge. I had to drive 2 hours to get it signed and the clerk at the courthouse took pity on me and had it signed", "pics": null, "resp": null, "gmap_id": "0x888bb3befe31c2e5:0x6ec0d055da097452"}
{"user_id": "117589882664973447529", "name": "Amanda Kerr", "time": 1542893273403, "rating": 5.0, "text": "Very informative", "pics": null, "resp": null, "gmap_id": "0x888bb3befe31c2e5:0x6ec0d055da097452"}
{"user_id": "106218255529532069754", "name": "barry kennedy", "time": 1610321846961, "rating": 5.0, "text": "Great team of professionals.  Used their services several times over the past 28 years.", "pics": null, "resp": null, "gmap_id": "0x8861d62d04b64ee9:0x6bb7bc14d9eb8c9a"}
{"user_id": "116160218251854017635", "name": "jose rosales", "time": 1597201014976, "rating": 5.0, "text": "Always get the help I need, I recommend David and Sheila for just about any real estate matter", "pics": null, "resp": null, "gmap_id": "0x8861d62d04b64ee9:0x6bb7bc14d9eb8c9a"}
{"user_id": "110719852565858864470", "name": "Anita Massey", "time": 1470612441356, "rating": 5.0, "text": "J.David Dodd has been exceedingly helpful with handling various things for my mother after my dad's death! He is a true Southern gentleman and high in the customer service area! I would highly recommend him for all your legal needs!\nI grew up in Fort Payne, but have been living in Florida most of my adult life and it is a reminder, dealing with Mr. Dodd , how great it is to live in a southern town with caring professionals! J. David Dodd is the best!", "pics": null, "resp": null, "gmap_id": "0x8861d62d04b64ee9:0x6bb7bc14d9eb8c9a"}
{"user_id": "107545608487785060955", "name": "Ana Wood", "time": 1552611230614, "rating": 5.0, "text": "I am going to be new in town and I have been so fortunate to of found a truly amazing and knowledgeable attorney for our business!!!", "pics": null, "resp": null, "gmap_id": "0x8861d62d04b64ee9:0x6bb7bc14d9eb8c9a"}
{"user_id": "112605432090379663099", "name": "Brenda Keller", "time": 1527471441342, "rating": 5.0, "text": "David Dodd did fantastic job in helping David an I update our will.  Answered all our questions an helped with advice.", "pics": null, "resp": null, "gmap_id": "0x8861d62d04b64ee9:0x6bb7bc14d9eb8c9a"}
{"user_id": "110650320383304217041", "name": "Krystal Price", "time": 1550454751007, "rating": 5.0, "text": "Eric is great, takes time to actually listen and helps with anything you need.", "pics": null, "resp": null, "gmap_id": "0x8861d62d04b64ee9:0x6bb7bc14d9eb8c9a"}
{"user_id": "114919635659067086678", "name": "Mariam Hunt", "time": 1549761515156, "rating": 5.0, "text": "Great law firm sweet and understanding people to help you with what you need done!!!  =^..^=", "pics": null, "resp": null, "gmap_id": "0x8861d62d04b64ee9:0x6bb7bc14d9eb8c9a"}
{"user_id": "115290191340818024427", "name": "Darlene Williams", "time": 1603741936220, "rating": 5.0, "text": "Great attorneys", "pics": null, "resp": null, "gmap_id": "0x8861d62d04b64ee9:0x6bb7bc14d9eb8c9a"}
{"user_id": "116398742803353060106", "name": "Becky Hicks", "time": 1622860838279, "rating": 5.0, "text": "Won cases over and over for me. Unbeatable cases he slammed dunked it. From criminal to family court Chip is the best. I've recommened himself to my brother and cousin which all won their cases as well. You dont have to worry when hiring this attorney. If you need a win pay alittle more and you wont regret it. When all other lawyers say theres no hope, call Chip he will find a way for you.\n\nWish he practiced in all states because I could use a lawyer like himself right now in Gatlingburg TN.", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "104685048074420088723", "name": "Haley Lyckman", "time": 1611879307430, "rating": 5.0, "text": "When I got hit by a drunk driver that totaled my car and racked up thousands of dollars in medical bills I was so overwhelmed. I took my case to Jonathan at the Cleveland Firm and he handled everything. He kept me informed every step of the way and was so easy to speak to. He took care of every worry I had. 20/10 would recommend for any legal issue you have.", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "109340672119456126203", "name": "Josh Bowman", "time": 1605207073538, "rating": 5.0, "text": "Very impressed with the professionalism and guidance I received while trying to work my property case with the help from Mr. Jonathan Wynn. Jonathan went above and beyond to make sure everything was in order so it could go as smooth as possible when settling this case. I didn’t feel rushed or confused on anything I came across with this for Jonathan’s willingness to help and walk me through the procedures and what all we had to do. Any future case that I will need settled will DEFINITELY be through the Cleveland Firm, LLC. Strongly suggest Jonathan Wynn!", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "100000174414182321947", "name": "James Wright", "time": 1597899036379, "rating": 5.0, "text": "Helped me on a wreck involving a man that hit me from behind .we made a deal out of CT.honest man got more than I asked for.played 🏈 at the same school as my half brother.", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "117458056153669587296", "name": "Virginia Green Nowling", "time": 1580248359251, "rating": 5.0, "text": "Great colleague.  Highly recommend Chip and his staff.", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "112466944963592535396", "name": "Jen Blozik", "time": 1538062997060, "rating": 5.0, "text": "There aren't words for how well the whole staff has and still treats us. We are going though the most important time in our lives and they have truly been there for us. I can't ever imagine anyone fighting harder and treating us like we matter and our case matters to them .", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "113923206433117986533", "name": "KatyPerry Isahologram", "time": 1560695652077, "rating": 1.0, "text": "This guy is a joke.  He has people working at other law firms feeding him info on clients.  He only wants your money.  This guy needs to be disbarred and should be sued for malpractice.", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "116323598659863386547", "name": "Flat Earth Florida", "time": 1569098566833, "rating": 5.0, "text": "The earth is flat. Youtube \"Eric Dubay\"", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "101977308534558765548", "name": "Josh Yates", "time": 1511278187050, "rating": 5.0, "text": "Highly Recommend for divorce, final Will, and legal consult for small business.", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "107561874209889157433", "name": "Kristen Eaves", "time": 1506701731601, "rating": 1.0, "text": "They didnt even take the time to actually look at the case . I would not go to this law firm for any reason !!!", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "115755996092392989683", "name": "Kenneth Wallace", "time": 1623698931695, "rating": 4.0, "text": "Pretty well organized the lawyers seems very helpful the receptionist was very helpful and nice", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "103514265552640542213", "name": "Bobby earhart", "time": 1623107223084, "rating": 5.0, "text": "ONE OF THE BEST LAW FIRMS IN ALABAMA!", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "100432544266529477784", "name": "Jose Rodriguez", "time": 1621896694960, "rating": 4.0, "text": "They really do get everything in order and help u threw anything you give them what you got and they do the rest", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "101711220989435912831", "name": "Geneva Burton", "time": 1551572891921, "rating": 1.0, "text": "I visited this law firm with the intention of establishing a Will, Power of Attorney and an Advanced Health Care Directive.  When I initially set up my appointment I was uninformed of how the process worked as well as what items I could include. Unfortunately, when I left the appointment I was still uninformed about how the process work and the items I could include.  The appointment lasted approximately 15 minutes. I felt as if I was ushered in and out of Mr. Pettey's office in an effort to move on to someone or something more important.  Afterward, I choose not to continue with their services and received a bill in the amount of $375 for services rendered for a DRAFT of a Will, Power of Attorney, and Advanced Health Care Directive. Will not be recommending this firm to any of my friends.", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "106456949975824239912", "name": "Emory Daniel", "time": 1530314760666, "rating": 5.0, "text": "Very helpful and I highly recommend them. If in need of an attorney at least give they a try before you make the decision.", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "106562742900986380804", "name": "Tim Chambliss", "time": 1490906723137, "rating": 5.0, "text": "Everyone at Samford & Denson are exceptional. Quick, concise and experienced. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "115510910853009528258", "name": "Sarah Meloy", "time": 1473420164947, "rating": 5.0, "text": "We had a wonderful experience with the team at Samford and Denson, LLP, specifically Jennifer Chambliss and Donna Kilcrease. It was a comfort to have Mrs. Chambliss by our side on some of the most important days of our lives. She always made sure to cover all bases and kept a level head on all issues. She is very much an honest and straightforward attorney who always took the high road to ensure our best interest in every situation. Jennifer Chambliss is highly recommended by our family.", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "103326764959457889556", "name": "billy chapman", "time": 1502079914767, "rating": 5.0, "text": "Dedicated lawyers, worth every penny!!!", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "116368384403840021994", "name": "Amanda Hecker Dasinger", "time": 1613699523699, "rating": 5.0, "text": "Fantastic experience with Janette at Pierce Ledyard refinancing our home. Great communication, attention to detail and a smooth transaction. Great to see an office in Baldwin County. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4d6d338fe827:0xf4bac42445ddf599"}
{"user_id": "116294415060196312993", "name": "mary margaret", "time": 1592328054407, "rating": 1.0, "text": "the actual closing went fine, but you had better hope you never need a copy of the paperwork. i've been calling for over a month trying to get a copy of my closing paperwork. they do not keep electronic records (in\n2020) for some reason and they have not been able to provide any real answer as to why they can't find it.  i have no idea how it is possible to run a business without the ability to do something as simple as sending an email copy of paperwork.", "pics": null, "resp": null, "gmap_id": "0x889a4d6d338fe827:0xf4bac42445ddf599"}
{"user_id": "109665539949181201334", "name": "Ali Zeidan", "time": 1626371969534, "rating": 5.0, "text": "Nice law firm", "pics": null, "resp": null, "gmap_id": "0x889a4d6d338fe827:0xf4bac42445ddf599"}
{"user_id": "106443371981399859336", "name": "Jonathan Shepard", "time": 1593695025642, "rating": 3.0, "text": "Tried to work with them to get an entity set up and initial contact was great but after that it was a week before anyone else reached out to begin the process.", "pics": null, "resp": null, "gmap_id": "0x889a4d6d338fe827:0xf4bac42445ddf599"}
{"user_id": "107242288219690103002", "name": "Brittany Liesch", "time": 1532747021030, "rating": 5.0, "text": "Linda Sims and her title team are on the ball. Thank for all of your help today. They are extremely knowledgeable and answer any questions you have along the way. Great teamwork!", "pics": null, "resp": null, "gmap_id": "0x889a4d6d338fe827:0xf4bac42445ddf599"}
{"user_id": "106435090699370075839", "name": "Wendy James", "time": 1557141967943, "rating": 5.0, "text": "Super friendly and easy to work with on our closing. This real estate agent will be recommending.", "pics": null, "resp": null, "gmap_id": "0x889a4d6d338fe827:0xf4bac42445ddf599"}
{"user_id": "117798070177936808227", "name": "Stephanie Jenkins", "time": 1578629604822, "rating": 4.0, "text": "My attorneys visit went well. Helpful also.", "pics": null, "resp": null, "gmap_id": "0x889a4d6d338fe827:0xf4bac42445ddf599"}
{"user_id": "107308814377170470836", "name": "Cheryl McCoy", "time": 1567735730948, "rating": 5.0, "text": "Shari Summers-- knowledgeable and professional.", "pics": null, "resp": null, "gmap_id": "0x889a4d6d338fe827:0xf4bac42445ddf599"}
{"user_id": "101235147298346896504", "name": "Susan Sconyers", "time": 1599178697175, "rating": 5.0, "text": "John was very instrumental in helping me work my way through obtaining VA assistance with our fathers memory care expenses. He was professional and a joy to work with. I highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88892390d1867b59:0x8136c407fa0ecca5"}
{"user_id": "105692055799240265017", "name": "Pamela Cartright", "time": 1568992536640, "rating": 5.0, "text": "Excellent service,  also working with husband VA benefits", "pics": null, "resp": {"time": 1594238556869, "text": "Thank you, Pamela.  We hope you and your husband have peace of mind with your plans now."}, "gmap_id": "0x88892390d1867b59:0x8136c407fa0ecca5"}
{"user_id": "100414962580672885110", "name": "Becca", "time": 1535460171137, "rating": 1.0, "text": "If you want an attorney that you can only communicate with through emails he's your guy.", "pics": null, "resp": null, "gmap_id": "0x88892390d1867b59:0x8136c407fa0ecca5"}
{"user_id": "115139841745672383441", "name": "Lisa Landry", "time": 1494034356241, "rating": 5.0, "text": "Mr. Jim Holliman is an excellent attorney with decades of experience.   I highly recommend him to anyone in need of an attorney in family law.", "pics": null, "resp": null, "gmap_id": "0x88892390d1867b59:0x8136c407fa0ecca5"}
{"user_id": "109508891376347745467", "name": "Vanessa White", "time": 1541331346918, "rating": 5.0, "text": "They are a great law firm. Everyone is friendly and polite.", "pics": null, "resp": null, "gmap_id": "0x88892390d1867b59:0x8136c407fa0ecca5"}
{"user_id": "108472388821255500699", "name": "Tom Ogletree", "time": 1567117043032, "rating": 5.0, "text": "John is first class!!!!! Pointed our family in the right direction!!!!", "pics": null, "resp": null, "gmap_id": "0x88892390d1867b59:0x8136c407fa0ecca5"}
{"user_id": "110284836908518845091", "name": "William W.", "time": 1565205572919, "rating": 5.0, "text": "Mr. Nolan was quick with a response to my inquiry. Although he was unable to help due to the location, he still provided me with some other ideas that might help me in my situation. He also provided me with a recommendation for a elder law attorney who is closer. I can only hope this attorney is as easy and professional to deal with as Mr. Nolan has been. Thank you Mr. Nolan and staff!", "pics": null, "resp": null, "gmap_id": "0x8889223000000001:0xda229ba4ccf4be47"}
{"user_id": "100699598631399366543", "name": "Carol Brown", "time": 1503965712172, "rating": 5.0, "text": "When we had to move Dad from Hospital to Nursing Home with an expectation of long term Medicaid needs, I needed good advice fast. Somehow I came across Bill’s first blog, where he said he saw himself as an elder advocate. Sounded like a nice guy, so I moved on to his main website and left a contact request over the weekend. When he returned my inquiry early on Monday morning he didn’t disappoint. So kind and helpful! Our situation was so simple it could really be handled by downloaded documents without an attorney. He offered an overview of the Medicaid process with really helpful insights that were not among the info I had unearthed in hours and hours of search and reading.  I feel I can handle the Medicare and Medicaid application process with more confidence now. I am so grateful for his willingness to take 20 minutes to answer my questions. His answers really changed everything.", "pics": null, "resp": null, "gmap_id": "0x8889223000000001:0xda229ba4ccf4be47"}
{"user_id": "107108090026277029963", "name": "Freddy Edgerton", "time": 1570655986676, "rating": 5.0, "text": "Very helpful,  knowledgeable and up to date in all the estate planning laws. Really helped in preparation of our estate plans. Answered all our question", "pics": null, "resp": null, "gmap_id": "0x8889223000000001:0xda229ba4ccf4be47"}
{"user_id": "105455062300893771772", "name": "Jon Lewis", "time": 1438555528191, "rating": 5.0, "text": "Bill Nolan is a seasoned elder law attorney who can help families properly navigate the complex issues which arise when families are attempting to protect their assets and determine the proper ways to take care of loved ones.  Bill can help with trusts, Medicaid, Medicare, Home Care and assisted living issues.  Bill is also the go-to attorney for your estate planning needs: wills, trusts, powers of attorney, and advance directives (living wills).  I highly recommend Bill if you have any estate planning or elder care legal needs.", "pics": null, "resp": null, "gmap_id": "0x8889223000000001:0xda229ba4ccf4be47"}
{"user_id": "105460508060915000754", "name": "Cam Lemmon", "time": 1483061908562, "rating": 5.0, "text": "Knowledgeable, experienced, and easy to work with. The staff is incredibly helpful. Bill Nolan is helping me sort through things that I've not had access to which will protect my family's future.", "pics": null, "resp": null, "gmap_id": "0x8889223000000001:0xda229ba4ccf4be47"}
{"user_id": "110860448399331072407", "name": "Tanner-Gean Dowell", "time": 1627084015936, "rating": 5.0, "text": "Ian and Thomas ARE MY TEAM! They were amazing! Made my divorce quick and easy! Very responsive and professional! Will look to Ian for all my legal needs from now on! Held my hand through it all and still responds at the quickest call or E-mail!!! Cannot say how much I am at ease knowing I've got a lawyer team that works FOR me!", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106808053877852743200", "name": "Lewis McCluer", "time": 1619279026738, "rating": 5.0, "text": "I'm involved in a landlord-tenant dispute and realized I was over my head and needed help. I contacted the Powell Law Firm and got a consultation with Thomas that day. He was very attentive and professional and let me know my options in plain, no nonsense terms. He also let me know that the firm was always available should the matter get to the point that representation became necessary. When I had further questions as the situation progressed, I called back, but was unable to reach Thomas immediately, as he was in court that day. I left a message with their front desk,  and received a call back from Melvin later that day as Thomas was still in court. He listened intently and further advised me as what I needed to do, and even returned another call in regards to my issue. Both Thomas and Melvin were extremely helpful in what was to me new territory as I had never been in a situation like this before. They stood ready to assist any way they could to include retaining their services should the need arise. As a retired Marine with 26 years service I know professionalism when I see it. Hope I don't need to retain an attorney for this current situation but I have full confidence in them should that need arise. I highly recommend that you contact them in the event you fell you may need the services of an attorney/", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "113487847135832316301", "name": "Lisa Edwards", "time": 1626804915412, "rating": 2.0, "text": "I had a 10am appointment to see Mr. Thomas today. It was the worst meeting i have ever had with this company. The young lady at the front desk was more interested in talking to her friend on the phone then greating me when i walked in. after standing there for a few minutes i was told to go have a seat in another room to wait again. as I'm waiting i can hear Mr. Thomas instructing another young associate to go and tell someone to do something and make sure they get it done because that was his money. I'm pretty sure that conversation should not have been discussed in front of a potential client. As I am sitting there explaining to Mr. Thomas why I am there seeking hes services he was more interested in picking the sores on his leg then paying any attention to anything i had to say, and while he was showing me the bruises from his recent jet ski accident all he could tell me was to seek an attorney immediately. I believe that's what I am here. What he ment was i needed a court appointed attorney because I could not afford him. So with Very unprofessional! My family has dealt with Powell Law firm for many years my aunt has know Mr. Thomas sence hes graduation year in 07. They have been wonderful people always willing to help with a smile. till now. So with no help from Mr. Thomas all I can do now is sit back and hope a friend doesn't pass away in lockup because she has a rare condition that causes her to have seizures. I am so disappointed in the actions of Mr. Thomas and the rudeness of the employees at Powell Law Firm.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "100902628666946632693", "name": "Gregory Dalzell", "time": 1626453525916, "rating": 5.0, "text": "My sister-in-law and wife were trying to figure out what to do with issues related to their father’s estate. It was especially difficult because they are in Virginia and the estate is in South Alabama. They called several South Alabama law firms seeking help and the reactions ranged from lack of response to disinterest in their concern. They called Powell Law Firm and spoke with Mr. Melvin Dixon. Mr. Dixon listened with patient understanding to their problem and did what he could for them with direction from his senior partner. They are very grateful.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "118330176431002688600", "name": "Karen Ulrich", "time": 1624466088769, "rating": 5.0, "text": "I just needed my questions answered to make sure I was making the correct decision on an eviction process.  He listened and answered all my questions and even offered to help me again.  I am so thankful he was willing to help me without the expectation of money.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "107951597291764037125", "name": "Patric Landrum", "time": 1616011996713, "rating": 5.0, "text": "I would definitely definitely recommend Ian and the Powell Law Firm to anyone. Ian has assisted my business partners and I on several task for our company.\n\nThe professionalism and service level we reviewed from this team was outstanding. We will absolutely be doing future business with this awesome team.\n\nHighly recommend!\n\nRespectfully,\nGulf Coast Security LLC.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106691410347904209936", "name": "Cassandra Karcz", "time": 1616448238393, "rating": 5.0, "text": "I called the Powell Law Firm about a situation that had me in a panic. They were able to get me in quick, and handled my situation immediately! Thomas is great, and put my mind at ease (and gave me a good laugh, while doing so). Their staff is amazing!", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106786266679158786639", "name": "Sarah Reynolds", "time": 1606271564946, "rating": 5.0, "text": "Thomas handled my case with utmost professionalism and concern for my needs and especially for my children's needs.  He was accessible and always willing to answer my questions directly and honestly, no sugar coating.  This law firm will fight for you as long as it takes. The office staff, especially Kimmie, was always ready to answer my calls and help me with whatever I needed to get accomplished at the time. During the most horrible time of my life, Thomas and Riley stood by my side until the end of this difficult process. I can't thank them enough.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "109304266640833108957", "name": "Julie Roberts", "time": 1594672264622, "rating": 5.0, "text": "I really really like Thomas Hughes, after meeting with him, and the entire staff they all made me feel comfortable, straight to the point!\nAbsolutely THE BEST LAW FIRM I HAVE EVER DEALT WITH!!!!!! Needs a 10 Star! 👍🏼", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "101476228033013696220", "name": "Valerie Coulter", "time": 1602176984211, "rating": 5.0, "text": "Outstanding crew... They were very Professional, kind, and nice to work with!!", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "102289647367991014496", "name": "FRANK RENTZ", "time": 1584737985155, "rating": 5.0, "text": "The Powell Law Firm did wills for my wife and me. They were very professional and thorough. The work was done in a timely manner. I certainly would recommend them to others. I was very pleased.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "110280103903710786743", "name": "Amber Middleton", "time": 1565722778130, "rating": 5.0, "text": "The Powell Law firm and their staff have been fantastic through out my divorce and custody issues. Riley Powell has been there to answer any questions I've had and I've sent plenty of emails to his firm and they have all been responded to and in detail.I am always kept up to date and I always feel comfortable in court and in knowing myself and my children's best interest are put first. They truly care and always make sure things are going okay for us!  Riley Powell and Thomas Hughes are hands down the best!", "pics": null, "resp": {"time": 1566253743656, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "112804854970169096855", "name": "Lydia Franz", "time": 1567184014137, "rating": 5.0, "text": "Riley told me the best thing I have ever heard about Attorney's.\n\"You pay an Attorney to worry for you\"\nNot only did he worry for me, he brought my case to the best possible outcome we could achieve. No one ever really wins when you have to take it to court, but the advice and representation that I received made my life better, and we were able to at least bring things to a acceptable conclusion.\nI would highly recommend the Powell Law Firm.", "pics": null, "resp": {"time": 1568451270274, "text": "Thank you for leaving us a review. We appreciate it!"}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106260565649116410204", "name": "C.C. Moreno", "time": 1595297372723, "rating": 5.0, "text": "Both Thomas and Riley are consummate professionals. With their combined advocacy, I would trust them with anything I needed handled.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "103890901319725228077", "name": "Doug Jacobs", "time": 1565726681016, "rating": 5.0, "text": "5-Star Performance!  I had a case that took over two years to get completed but it was all worth the effort. Riley Powell has a photographic memory and it pays off in the courtroom. Thanks again for a great job to Riley, Thomas and Kimme!", "pics": null, "resp": {"time": 1566253724942, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "117118563722722065792", "name": "Ashley Hall", "time": 1537728035194, "rating": 5.0, "text": "Riley Powell and staff are amazing. He is more than just an intelligent, skilled, driven, and experienced lawyer although those are noteworthy attributes; he is someone who cares and is passionate about fighting for you. He knows what to say and what to do, and I am grateful God saw fit to put him in my path. I highly recommend Riley Powell.", "pics": null, "resp": {"time": 1566253752448, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "111447719194241910969", "name": "Peggie Montgomery", "time": 1587768374913, "rating": 1.0, "text": "Costly and he did not represent our son as promised.  A lot of hot air!", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "112634507670671020646", "name": "Earl Suhre", "time": 1575327795549, "rating": 5.0, "text": "Mr. Powell & Thomas were Amazing in the case they were handling for us !!!! We cannot Thank Them enough ! They went above & beyond . The Best Attorneys Ever !", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "102927331386640173175", "name": "Serendipity Sharra", "time": 1529039036799, "rating": 5.0, "text": "Met with the owners on a job interview and I can honestly say they were two wonderful, friendly, honest, and smart men. I didn't get the job but they were kind and honest with that too. I would highly recommend them and will certainly go see them if ever I am in need of a lawyer.", "pics": null, "resp": {"time": 1566253778635, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106713700146633879124", "name": "Amy Elliott", "time": 1565811262181, "rating": 5.0, "text": "Riley Powell and the attorneys at the Powell Law firm are professional, knowledgeable, honest and will fight for you!  I appreciated them being so caring, and keeping me informed during my case.", "pics": null, "resp": {"time": 1566253715758, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "111700835149697040103", "name": "Donna Michelle Wade", "time": 1528082860564, "rating": 1.0, "text": "Absolutely horrible representation . I gave them $1800 cash for a simple divorce, asked for no desperation of assets, no children involved. Simple divorce that was us mail paperwork, and showing up for final dissolution court hearing. Now they are trying to extort another $625 out of me. Maybe they are \"great\"  for their rich and privaledged clients, but have no heart or soul for your everyday person. I ran home from an extremely abusive relationship and chose them because they were close by. My mistake . Do your homework and chose a attorney based on your needs, not their's.t", "pics": null, "resp": {"time": 1566254154668, "text": "Thank you for taking the time to leave us a review. Although it is difficult to hear negative feedback, without receiving reviews we can't improve our services in order to provide the best legal services for our clients. From your review, we looked at how we communicate expectations of fees with clients in more detail so there are no surprise fees from filing. We truly appreciate you took the time to leave us a review and hope you are doing well."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "103180079001744797172", "name": "Arjen Meter", "time": 1529355941422, "rating": 5.0, "text": "The Powell Law Firm has always handled any issue, question, or legal concern my family and I have came to them with quickly. I couldn’t imagine using anyone else.", "pics": null, "resp": {"time": 1566253761952, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "110012305343759381325", "name": "Christi Wallace", "time": 1565723246415, "rating": 5.0, "text": "Highly recommend Powell Law Firm. And the staff is very friendly.", "pics": null, "resp": {"time": 1566253733407, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "104770225365755219357", "name": "Ray Ainsworth", "time": 1504141749277, "rating": 5.0, "text": "Awesome attorney!! Always there when you need them. Recommend to everyone we know.", "pics": null, "resp": {"time": 1566253809574, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "103194917123923915953", "name": "Sherry Lucas", "time": 1553786294559, "rating": 1.0, "text": "Absolutely horrible attorney for custody disputes. Made my case an absolute nightmare because of no communication with me unless he wanted more money.", "pics": null, "resp": {"time": 1566254006822, "text": "Thank you for bringing this to our attention. While no one likes to hear negative comments, we sincerely need to know when we fall short in our clients eyes. Our goal is to achieve Justice for every client and provide excellent representation. From your suggestion, we have looked at how we streamline communication with clients and this is why feedback is so important. Thank you for taking the time to leave us a review."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "111708988510646622173", "name": "Liberty Avera", "time": 1502310460290, "rating": 5.0, "text": "Very professional and helpful attorneys! Would recommend them to anyone!", "pics": null, "resp": {"time": 1566253816322, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "111245771268094104840", "name": "Judi Grant", "time": 1495462706390, "rating": 5.0, "text": "Great attorney!!! I would definitely recommend him!", "pics": null, "resp": {"time": 1566253827858, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "112069465183014736856", "name": "Jennifer “Dixie” Phillips", "time": 1445644656960, "rating": 5.0, "text": "Great attorney", "pics": null, "resp": {"time": 1566253836686, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "117754750229986567956", "name": "Nathan Laney", "time": 1579741070670, "rating": 5.0, "text": "This past spring our John Deere 6110m unexplainably burnt completely to the ground. Brian and his team were extremely helpful in negotiating with JD on our behalf and getting our family farm a new tractor to keep us working. Their customer service and the communication throughout the experience was wonderful and speedy. Big Thanks to the Braswell Murphy team!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "112742623177894298621", "name": "Katie Driskell", "time": 1581459273429, "rating": 5.0, "text": "Kasie Braswell has represented me on multiple occasions. She is not afraid to show up in court, that is actually where she shines.  Her demeanor is calm, but don’t let her fool you. She is the attorney you want on your side. I could not imagine using anyone else. She is a force to be reckoned with! Katie Clark", "pics": null, "resp": {"time": 1582123661828, "text": "Thanks for kind words Katie!"}, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "116524506299609613537", "name": "John Bedsole", "time": 1583006208596, "rating": 5.0, "text": "Great attorneys!  Wonderful to work with, aggressive when need be, and very smart.   As a professional who has worked with them over the years their work ethic is superb.", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "111803001841440061157", "name": "BRADLEY DOWNEY", "time": 1564450845196, "rating": 5.0, "text": "I called and hoping and praying to find someone who could help me and found the most compassionate, professional, and impressive help I have had in a very long time. I have worked with the public for over 10 years. I have been in the military for almost 20. I was in sales for 5 years. I can say without a doubt I would recommend this firm and it’s amazing team to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "105285204615472138235", "name": "Brian Phillips", "time": 1547035924497, "rating": 5.0, "text": "What can I say?  Everything that I have brought to Kasey and Brian has been handled promptly and satisfactorily.  even when my case was not within their scope of practice, they are so networked that she named several attorneys right off the top of her head.\n\nI have recommended and will continue to recommend them to everyone I know.", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "116836213024426918182", "name": "Josh Laney", "time": 1580298474286, "rating": 5.0, "text": "Trustworthy and responsive. It’s a relief when you can hand your issue over to a team like Brian’s and feel confident they are handling it.", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "106551587963128267160", "name": "Mike Rogers", "time": 1546650237001, "rating": 5.0, "text": "I highly recommended this law firm. They were very professional and provided excellent representation and delivered results. They took the worry out of the legal process. I would highly recommend this law firm to anyone in need of outstanding representation.", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "110506536829638191661", "name": "Shelia Moore", "time": 1547659376006, "rating": 5.0, "text": "I used Braswell Murphy years ago and they were so good that I called them again last year when I was told that I had a bad medical device that had to be removed. Once again, they went beyond my expectations. I’m so happy I have them looking out for me. Recommend them to everybody!", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "117823030481012159749", "name": "Katrina Frazier", "time": 1503003861011, "rating": 4.0, "text": "Braswell & Murphy is a wonderful law firm.  The attorney's at this firm take pride in the service they provide.  You will not feel like just another potential client.  They will make your insurance claims seamless and stress free, no need to worry about dealing with difficult insurance companies.", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "116720671084237995809", "name": "Grant Saltz", "time": 1581090545219, "rating": 5.0, "text": "Great lawyers and great people. Highly recommended firm.", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "113549786998747329446", "name": "Stoney Boatman", "time": 1546883668777, "rating": 5.0, "text": "Braswell Murphy LLC are very professional and friendly law firm. They have been very helpful to my family. Thank you for the great service.", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "107673748852666470438", "name": "Cathy Lightcap", "time": 1581084048669, "rating": 5.0, "text": "Responded quickly and very helpful with car accident.", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "111644886996262629488", "name": "Chambless Trucking", "time": 1546643493176, "rating": 5.0, "text": "Highly recommend Kasie Braswell. Very professional. She made some issues of ours go away completely stress free.", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "100516684221113795721", "name": "Cody Chambless", "time": 1546644261519, "rating": 5.0, "text": "Kasie Braswell is the best attorney I’ve ever used. Good help is hard to find these days and she’s it.", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "108947324861866640812", "name": "latina benard", "time": 1546876106745, "rating": 5.0, "text": "I have used this firm and they were excellent! I recommend them to everyone.", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "111444685345717589787", "name": "Kristen Birdsong", "time": 1518714521914, "rating": 5.0, "text": "Kasie Braswell and Braswell Murphy Law were nothing but wonderful during our entire process. Kasie handled everything to ensure we didn’t have to worry with all the ins and outs of our case. She and her team took care of our family and in our case made sure that we were not taken advantage of in any form. I could not recommend a better law firm!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "117967968074055295586", "name": "renea&robert raley", "time": 1554397196986, "rating": 5.0, "text": "I just want to say the attorneys at Braswell murphy law firm in mobile al are the best all around!!! From the first conversation to the last Mr Brian murphy helped me every step of the way always informing me about the next steps in my case. These fine people at Braswell murphy law firm go above and beyond to get justice for myself and my family  I highly recommend Mr Brian murphy he's the best thank you Braswell murphy keep up the great work.", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "110375554972545562319", "name": "Cullen Millsap", "time": 1546897423305, "rating": 5.0, "text": "I would recommend Brian Murphy with Braswell Murphy to anyone.  Very professional and knowledgeable!", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "118276903719150596615", "name": "Mally Morgan", "time": 1501279336596, "rating": 1.0, "text": "Not helpful . Says they are a personal injury attorney but I just got told on the phone after ten minutes of explaining myself , that they don't do that kind of stuff and to have a good day. That's the only thing the woman said to me ! Terrible. Do not recommend.", "pics": null, "resp": {"time": 1501516038218, "text": "Ms. Morgan, I am sorry you were disappointed with your phone call to our law firm.  Our ethics rules prohibit me from discussing any of the details of your situation in public so please give me a call at (251) 438-7503 and we can discuss further.  Thanks.  -Brian"}, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "111942695237432140364", "name": "Kimberlie Stokley", "time": 1546877256518, "rating": 5.0, "text": "I would refer anyone and everyone here . Kasie was efficient and effective. I couldn't have been happier with this law firm !", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "102850989784201294590", "name": "Kevin George", "time": 1546636414046, "rating": 5.0, "text": "Great law firm!!! Very professional and excellent service.", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "107318910478890917218", "name": "R M", "time": 1518109031393, "rating": 5.0, "text": "I refer all of my personal injury clients to Kasie Braswell. She’s the best in town.", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "107127608164482893315", "name": "Shelia Moore", "time": 1344007161733, "rating": 5.0, "text": "I hired Kasie Braswell to represent me in an auto accident where I had been rear ended.  She was excellent!!!  She met with me and really listened to all of my problems from the accident.  She was able to get the insurance company to pay policy limits (they only offered me $500 before I hired Kasie) and got my medical bills reduced.  I refer all of my friends and family to Kasie - she was a blessing!", "pics": null, "resp": null, "gmap_id": "0x889a4fd715036c53:0xfc92b2c509513de6"}
{"user_id": "101847791969887155682", "name": "Ana Sandoval", "time": 1598402584143, "rating": 5.0, "text": "Excellent lawyer. Very friendly and professional", "pics": null, "resp": null, "gmap_id": "0x889a408ffc1f5569:0xd10afaf9163d4a37"}
{"user_id": "105192768623282835757", "name": "Miranda McGregor", "time": 1568243960746, "rating": 5.0, "text": "James is very personable, friendly, professional and a wealth of knowledge!  Anita is friendly, helpful and a delight to speak with.", "pics": null, "resp": null, "gmap_id": "0x889a408ffc1f5569:0xd10afaf9163d4a37"}
{"user_id": "112861873367403794982", "name": "Donna Sessions", "time": 1509393324534, "rating": 5.0, "text": "James is very professional, efficient, and knowledgeable about the law.  He delivers a fast, friendly service. Job well Done!", "pics": null, "resp": null, "gmap_id": "0x889a408ffc1f5569:0xd10afaf9163d4a37"}
{"user_id": "111739903695044129926", "name": "Jennifer Vestal", "time": 1509333739465, "rating": 5.0, "text": "Simpy the best! James is friendly, welcoming, and easy going. He is efficient, organized and and effective. A++", "pics": null, "resp": null, "gmap_id": "0x889a408ffc1f5569:0xd10afaf9163d4a37"}
{"user_id": "105221926639928289884", "name": "Phoebe Minardi", "time": 1527004561147, "rating": 5.0, "text": "James Dorgan was very kind and informative when dealing with my legal issue. His office gave me quick and efficent service while charging a very reasonalbe fee. I would highly reccommend him to anyone needing legal services.", "pics": null, "resp": null, "gmap_id": "0x889a408ffc1f5569:0xd10afaf9163d4a37"}
{"user_id": "114382261619049109652", "name": "Taylor Zinner", "time": 1507642997818, "rating": 5.0, "text": "Great Guy! Easy to work with!", "pics": null, "resp": null, "gmap_id": "0x889a408ffc1f5569:0xd10afaf9163d4a37"}
{"user_id": "102884497210438357671", "name": "K-BARR 1400 bLOCC", "time": 1553644712702, "rating": 5.0, "text": "Mrs. Ford is super professional and very thorough in her approach for justice. I highly recommend her. -Shawn Hammonds", "pics": null, "resp": null, "gmap_id": "0x88626919d250f559:0x65207342b9a68859"}
{"user_id": "110119210494621888180", "name": "Susan Reed-Killingsworth", "time": 1609831712943, "rating": 5.0, "text": "My favorite attorney in Huntsville!!!", "pics": null, "resp": null, "gmap_id": "0x88626919d250f559:0x65207342b9a68859"}
{"user_id": "105036202230840468441", "name": "Shawnna Williams", "time": 1565746225873, "rating": 5.0, "text": "Very thorough and attentive", "pics": null, "resp": null, "gmap_id": "0x88626919d250f559:0x65207342b9a68859"}
{"user_id": "108277000271192068486", "name": "Dawn Cornish", "time": 1620157423469, "rating": 5.0, "text": "Very happy with his service. And if you  are looking for a lawyer that will do the job right. Don't search. This is him", "pics": null, "resp": null, "gmap_id": "0x887d45f3b4d89e6d:0xdcff6243e9957e16"}
{"user_id": "110551898117204713538", "name": "joe maner", "time": 1607648711501, "rating": 5.0, "text": "This man makes Perry Mason look like a newbie. Judge Smith is a Magic Man. Should be awarded the Nobel peace Award.", "pics": null, "resp": null, "gmap_id": "0x887d45f3b4d89e6d:0xdcff6243e9957e16"}
{"user_id": "104834810672791836131", "name": "Shanna Jean", "time": 1592689437259, "rating": 5.0, "text": "His secretary was so very nice.\nIm so glad I called his office.\nShe eased my mind and relaid great advice to me. Very professional !", "pics": null, "resp": null, "gmap_id": "0x887d45f3b4d89e6d:0xdcff6243e9957e16"}
{"user_id": "115658356814231865066", "name": "Derek Sizemore", "time": 1593197366845, "rating": 5.0, "text": "Been going through a situation for a couple years and chad has been there every step of the way. Available anytime I've needed him ! Fantastic lawyer, could not ask for better.", "pics": null, "resp": null, "gmap_id": "0x887d45f3b4d89e6d:0xdcff6243e9957e16"}
{"user_id": "103170846848471601303", "name": "Edith Olson", "time": 1578277504529, "rating": 5.0, "text": "Mr smith is one of the nicest attorneys I've every met he's easy to talk to and always stays in touch and let's you know what's going with your case", "pics": null, "resp": null, "gmap_id": "0x887d45f3b4d89e6d:0xdcff6243e9957e16"}
{"user_id": "111308844591024782504", "name": "Sandy F.", "time": 1567089892120, "rating": 5.0, "text": "Very kind and professional services. Everyone in the office is great. Will definitely be using again in the future should the need arises.", "pics": null, "resp": null, "gmap_id": "0x887d45f3b4d89e6d:0xdcff6243e9957e16"}
{"user_id": "110348523004875008412", "name": "jason bailey", "time": 1579572200124, "rating": 5.0, "text": "Great guy and great attorney he is honest and will shoot you straight", "pics": null, "resp": null, "gmap_id": "0x887d45f3b4d89e6d:0xdcff6243e9957e16"}
{"user_id": "116411074637788614231", "name": "toby davis", "time": 1573694322198, "rating": 5.0, "text": "Chad is a straight Ford upfront guy if he can help you he will let you know if he cannot he will let you know that also", "pics": null, "resp": null, "gmap_id": "0x887d45f3b4d89e6d:0xdcff6243e9957e16"}
{"user_id": "117338544297224213843", "name": "Scott Mason", "time": 1559330386453, "rating": 4.0, "text": "Very Nice, Courteous And Professional , Waiting To See Results From My Case Before Giving 5 Stars !", "pics": null, "resp": null, "gmap_id": "0x887d45f3b4d89e6d:0xdcff6243e9957e16"}
{"user_id": "103741295403146136684", "name": "Trudy Bamburg", "time": 1564200040572, "rating": 5.0, "text": "Cjad is down to earth, speaks in terms to be understood as well as exploring options! Love this man!", "pics": null, "resp": null, "gmap_id": "0x887d45f3b4d89e6d:0xdcff6243e9957e16"}
{"user_id": "111367556190473732370", "name": "Dewayne Matlock", "time": 1582685179292, "rating": 5.0, "text": "Very dependable. Treated us like family.", "pics": null, "resp": null, "gmap_id": "0x887d45f3b4d89e6d:0xdcff6243e9957e16"}
{"user_id": "106683605759618617232", "name": "Micah Holt", "time": 1598286045177, "rating": 5.0, "text": "Very nice and informative staff", "pics": null, "resp": null, "gmap_id": "0x887d45f3b4d89e6d:0xdcff6243e9957e16"}
{"user_id": "108211362599729972462", "name": "Matt Horton", "time": 1544076857345, "rating": 5.0, "text": "He is amazing very friendly and very straight forward. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x887d45f3b4d89e6d:0xdcff6243e9957e16"}
{"user_id": "115836624837697399086", "name": "Jerry Brackin", "time": 1607629624593, "rating": 5.0, "text": "Great attorney", "pics": null, "resp": null, "gmap_id": "0x887d45f3b4d89e6d:0xdcff6243e9957e16"}
{"user_id": "106066613036172930641", "name": "Alexis Morris", "time": 1553734076449, "rating": 5.0, "text": "One of the Best Attorney in Alabama.", "pics": null, "resp": null, "gmap_id": "0x887d45f3b4d89e6d:0xdcff6243e9957e16"}
{"user_id": "101718606303424874001", "name": "Mike Griffin", "time": 1531337382820, "rating": 5.0, "text": "Great attorney", "pics": null, "resp": null, "gmap_id": "0x887d45f3b4d89e6d:0xdcff6243e9957e16"}
{"user_id": "108009807715477185209", "name": "Thomas E Chaney", "time": 1498278004600, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x887d45f3b4d89e6d:0xdcff6243e9957e16"}
{"user_id": "117402066651670144458", "name": "Candice Harris", "time": 1621777956130, "rating": 5.0, "text": "👍", "pics": null, "resp": null, "gmap_id": "0x8889178504e1da3d:0x38c64b68ca1c98bb"}
{"user_id": "115180004775621706138", "name": "Nikki Wilkerson", "time": 1499457820694, "rating": 5.0, "text": "Bob is so passionate about what he does and has a genuine heart for his clients. He always goes above and beyond.", "pics": null, "resp": null, "gmap_id": "0x8889178504e1da3d:0x38c64b68ca1c98bb"}
{"user_id": "103215001719643956771", "name": "Joe Dunnam", "time": 1499450172470, "rating": 5.0, "text": "Great working with Bob.  Very prompt and thorough attorney.", "pics": null, "resp": null, "gmap_id": "0x8889178504e1da3d:0x38c64b68ca1c98bb"}
{"user_id": "116779858954291378718", "name": "Lana Cornelius", "time": 1507321159491, "rating": 5.0, "text": "Cornelius & Talley are the lawyers you want to choose when you need legal advice concerning special needs children and elderly parents.", "pics": null, "resp": null, "gmap_id": "0x8889178504e1da3d:0x38c64b68ca1c98bb"}
{"user_id": "103946918082859258160", "name": "Stephen Foster", "time": 1558051555891, "rating": 5.0, "text": "Really cares about his clients", "pics": null, "resp": null, "gmap_id": "0x8889178504e1da3d:0x38c64b68ca1c98bb"}
{"user_id": "114304613011332178479", "name": "Joy Steiner", "time": 1565539010033, "rating": 5.0, "text": "Jason is the best of the best! He goes above and beyond for his clients. He is not only the definition of professionalism but compassion. He treats his clients with respect and understanding. I recommend Jason to anyone who is looking for an attorney who will give them 110% of his attention and see the case through till the end.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "116183860817643019519", "name": "Meredith Gonzales", "time": 1562425179011, "rating": 5.0, "text": "After my auto accident, I needed help dealing with the insurance companies and healthcare providers.  I'm glad I chose The Hadley Law Firm as they went above and beyond.  Jason never backed down, stuck with it to the end, and made sure I was given the facts to make informed decisions during the whole process.  There's no doubt he has your best outcome in mind when handling your case.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "115903811930070579191", "name": "mauricedallastx", "time": 1547407100842, "rating": 5.0, "text": "The Hadley Law Firm was very professional, friendly and honest when I used them for two traffic violations I received in Bay Minette.  Jason and his staff were dependable and able to get done what I requested with ease.  I give Jason and his team two thumbs up.  FIVE STARS", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "116508195431461017782", "name": "Lee Lee", "time": 1598919882827, "rating": 5.0, "text": "He has been good to me", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "117529433990824390027", "name": "Kim Sinclair", "time": 1571716593387, "rating": 5.0, "text": "Jason is very professional and has provided excellent service! I would highly recommend The Hadley Law Firm.\nThanks again for doing a great job!", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "116227572432356133996", "name": "danny cox", "time": 1562812152126, "rating": 5.0, "text": "Jason handled a very difficult motor vehicle accident for my family. What a great man and attorney. I would not hesitate to recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "100365515552180493794", "name": "Ashley Tuberville", "time": 1546999957177, "rating": 5.0, "text": "Very Professional! Best all around Attorney in the area! He sincerely cares about each of his clients and not just his payment for your case like most Attorneys. If you are looking for the best and most honest Attorney , Mr. Hadley is the one!!!", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "100628431226722367255", "name": "Janna Mosley", "time": 1561954823923, "rating": 4.0, "text": "I really  like them there,they all are nice  and friendly  and they  have a nice  office.I really  hope he can help me.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "116737967030244112660", "name": "Jody Conway", "time": 1529443783641, "rating": 5.0, "text": "Very nice,  handled my vehicle accident claim very well.  Keep me update on what was going on and always responded to my emails when he could.  I would use Jason again if I ever need (and I hope I don't)  a attorney again, he will be the one I call.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "107672768044917480399", "name": "BLAKE COLEMAN", "time": 1536934908442, "rating": 5.0, "text": "THE ABSOLUTE BEST!!! I COULD NOT HAVE BEEN HAPPIER WITH MY CASE! THIS MAN CARES ABOUT HIS CLIENTS AND GOT ME WAYYY ABOVE AND BEYOND WHAT I WAS ANTICIPATING THE OUTCOME TO BE!!", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "116778476373173714145", "name": "Mark Link", "time": 1530043530900, "rating": 5.0, "text": "Jason handled a personal injury case with me and I found that he was very knowledgeable about the legal issues involved in the case.  Mr. Hadley was very attentive to our particular needs and I would highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "115783283928509425387", "name": "Rocky Langham", "time": 1529447333307, "rating": 5.0, "text": "Jason was very detailed in handling my claim he gave me a lot of useful information I thought I had no leg to stand on he let me know he was going to do everything he could to help me ! I would recommend him to anyone with an accident claim", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "103935127809470610959", "name": "Ernest Walker", "time": 1529378699815, "rating": 4.0, "text": "Very professional and helpful staff there. Mr. Hadley is currently representing me in a vehicle accident claim and as of date I am very pleased with everything.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "113536626796489248141", "name": "Stephen Williams", "time": 1528488715181, "rating": 5.0, "text": "Outstanding Attorney.  Impressive record.  Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "114388024242109666645", "name": "Freda DuBose", "time": 1589771974362, "rating": 5.0, "text": "Nothing bad to say", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "103764959238313961608", "name": "Joyce Lambert", "time": 1550716784275, "rating": 5.0, "text": "Very honest. Trustworthy.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "117366158679796009563", "name": "C Riddick", "time": 1524881959932, "rating": 5.0, "text": "Professional, reliable & organized. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "118410199404825866695", "name": "Patti Anderson", "time": 1514013196148, "rating": 5.0, "text": "Great first meeting. Conscientious attorney.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "108890373709654654689", "name": "Connie Whatley", "time": 1565984923801, "rating": 5.0, "text": "Best Law Firm in Bay Minette I recommend it", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "112184667197473743101", "name": "Pamela Ferguson", "time": 1617658393822, "rating": 3.0, "text": "He is grouchy", "pics": null, "resp": null, "gmap_id": "0x8861d7d34dab5ed3:0xcc2643a4ebcfaa29"}
{"user_id": "105323925382603092733", "name": "Stephenn Will Hamm", "time": 1507786325285, "rating": 5.0, "text": "PROFESSIONAL AND SINCERLY CARING ATTORNEYS A RARE COMBINATION.", "pics": null, "resp": null, "gmap_id": "0x8861d7d34dab5ed3:0xcc2643a4ebcfaa29"}
{"user_id": "103549972757114519055", "name": "D Man", "time": 1544280764518, "rating": 5.0, "text": "Good ATTORNEYS", "pics": null, "resp": null, "gmap_id": "0x8861d7d34dab5ed3:0xcc2643a4ebcfaa29"}
{"user_id": "109294345574201031499", "name": "Tommy Blansit", "time": 1550869868794, "rating": 5.0, "text": "Won the case", "pics": null, "resp": null, "gmap_id": "0x8861d7d34dab5ed3:0xcc2643a4ebcfaa29"}
{"user_id": "115044474494045170121", "name": "Charles Dean", "time": 1522621962502, "rating": 4.0, "text": "Great help!!", "pics": null, "resp": null, "gmap_id": "0x8861d7d34dab5ed3:0xcc2643a4ebcfaa29"}
{"user_id": "104598349455747143663", "name": "Porkchopranch", "time": 1555369993236, "rating": 5.0, "text": "Good helpful folks", "pics": null, "resp": null, "gmap_id": "0x8861d7d34dab5ed3:0xcc2643a4ebcfaa29"}
{"user_id": "109327672206404821508", "name": "Ron Troxtel", "time": 1499863327863, "rating": 4.0, "text": "Very good people", "pics": null, "resp": null, "gmap_id": "0x8861d7d34dab5ed3:0xcc2643a4ebcfaa29"}
{"user_id": "110535149471193178401", "name": "Kindra Morris", "time": 1623328351297, "rating": 5.0, "text": "First visit I was very nervous going in. After sitting down with Russell he made me very comfortable. He laid everything out on the table for me and told me what he could do. He reassured me that I had a great possibility of getting a great outcome on my case. He also had a great sense of humor. I walked out feeling very relieved. I knew he was the right person to help me. The staff were always nice and responsive as well. My attorney did everything I asked for, answered all of my questions and more. I barely had to call in, I just sat back and let the work get done. My results….I did not have to go to court and my case is now closed. I had a pending felony charge that will now be expunged from my record! Look no further, I highly recommend Russell and his amazing staff to help you! Best wishes! Thanks Russell!!!", "pics": null, "resp": {"time": 1623346906478, "text": "Well, God Bless you for those sweet words, Kindra. The first half of your comments represents my favorite part of my job - providing hope and reassurance. We appreciate the opportunity to help you resolve your legal issues and are very pleased with the results. We are all wishing you the best moving forward. Again, thanks. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "100066907347606392276", "name": "Huntsville Shred Service", "time": 1575430852688, "rating": 5.0, "text": "Attorney Russell Crumbley was very easy to work with, I liked his knowledge, and sense of humor.  I had a lot at risk, he explained what he could do at our first meeting and it went like clock work.  I would certainly use and recommend him again. I must also mention his office staff, first class.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNv0ypd-RdwYgvYIKJCmSfLZX7x_2MB1EaTkGZ9=w150-h150-k-no-p"]}], "resp": {"time": 1556638502326, "text": "Thank you \"Big Shredder\"! And, thank you for noticing our help. We could not do what we do without them. And, yes, I think they are a great crew. We appreciate the opportunity to help folks just like you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102862716345224178195", "name": "Joe Dean", "time": 1613672423802, "rating": 5.0, "text": "From the first meeting onward Russell was professional, and straight forward. He laid out everything on how it would be handled and kept to his word. We had complete confidence in him and felt reassured along the way. It went exactly as he said and are extremely satisfied with the results.  The cost was worth every penny. If you want the best possible defense attorney look no further.", "pics": null, "resp": {"time": 1614783373411, "text": "Thanks Joe. Much appreciate the kind words. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114763522428853564897", "name": "Butch Roberts", "time": 1616539295602, "rating": 5.0, "text": "I really liked Michael Morella. He actually watched the video and told me not to plead guilty.  He did not charge me extra $ for it.. I did nothing wrong and he made me feel better about the whole situation.  I felt comfortable with him throughout the whole situation. I really don't trust lawyer's, but I trust him.", "pics": null, "resp": {"time": 1617381871444, "text": "Outstanding! Thanks. And, so you know: he didn't charge you extra because that was a part of our job. We simply did what we were supposed to do. I already passed this on to Mike. He smiled. God Bless! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111653090118119005103", "name": "marcus washington", "time": 1619560886725, "rating": 5.0, "text": "The lawyers were professional and well prepared. My case was small, they handled it like a major one. Highly recommended.", "pics": null, "resp": {"time": 1619719497260, "text": "Thank you Marcus! Your \"small\" case was probably big to you. That's how we try to handle them here because, while our attorneys may have been there thousands of times, many of our clients have never been through it. We are all thankful that you chose US to help you through this. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "112454722157584852975", "name": "Danny Wanny", "time": 1621649409436, "rating": 5.0, "text": "Russell Crumbley is an outstanding attorney. Upfront regarding cost. Highly recommend.", "pics": null, "resp": {"time": 1622129564492, "text": "Danny, I appreciate your thoughts and kind words. Hope things are well. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "106939112161124137464", "name": "Bellamy Gibbs", "time": 1616073262797, "rating": 5.0, "text": "From the very beginning Tyra the receptionist was very professional, sweet and understanding. Mr. Crumbley done an amazing job on getting my DUI and License dropped and renewed. They worked with me on payment plans. I highly recommend this law firm. You don't get judged, they help you with any issue or problem. You don't wait days on a response. You get the nothing but the truth and they are very serious about their cases and care about their clients.Ty all for everything you done for me.", "pics": null, "resp": {"time": 1617381707705, "text": "Well, we certainly appreciate your kind words and no, we don't judge. Our attitude, frankly, is that there is a \"judge\" for that. Our job is to represent you, the client. Thanks for noticing and I will pass on the praise to Tyra. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114554079115095767008", "name": "Ray Hurst", "time": 1616888913066, "rating": 5.0, "text": "Mr. Crumbly is very easy to work with. Well versed in the Huntsville legal system. Definitely someone you want on your side.", "pics": null, "resp": {"time": 1617382036378, "text": "Ray: I'm just a Huntsville boy. That makes it easy to be easy. It was a pleasure to work with you and I certainly appreciate your kind words. We all wish you nothing but the best moving forward. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110277441533126080165", "name": "Alan Richards", "time": 1617892342490, "rating": 5.0, "text": "Did a great job for me after a DUI....\nI have never had the need for a criminal defense lawyer – until I did!  I hired Mr. Russell Crumbley based on two recommendations from persons who work in the legal business.  Now, I am the one recommending Russ and his team at Crumbley-Blackwell & Associates to anyone reading this.  Just hours after my arrest, I was able to make an appointment before my first visit to the court.  Having never been in this situation before, this was very important to me.  Russ was with me every step of the way.  In the end, my case was dismissed thanks to this fine law firm.\nThere were many court appearances, so I was able to observe his interactions with other defense lawyers, prosecutors, and two judges.  It was obvious to me that he is well liked and, more importantly, well respected in the legal community.  It takes more than just navigating the legal system (which Russ did with ease), it also takes relationships.\nAgain, I highly recommend Mr. Crumbley and will never forget what he did for me.", "pics": null, "resp": {"time": 1617914270694, "text": "Thank you, so much, Alan for those kind words. It was a privilege to represent you and I am really glad it worked out for you. It was quite stressful for you but it is behind you now. Best wishes for you moving forward. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "106897533072813692894", "name": "Hunter Bright", "time": 1611109013163, "rating": 5.0, "text": "Micheal was very professional about his job. He made sure I knew what to do and when to do it. I had a 1st offense DUI case and he got it dismissed. I would recommend Russell Crumbley to anyone. A special thanks to Michael for helping me win my case.", "pics": null, "resp": {"time": 1612451153626, "text": "Thank you Hunter. I will pass along the kind words to Michael. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "107997308596256463257", "name": "Eric Marion", "time": 1614958899673, "rating": 5.0, "text": "I had a great experience dealing with and being represented by Mr. Crumbley.  My legal situation was handled professionally and I was able to have my situation get resolved with the best possible outcome.  I would strongly recommend this firm to anyone who is in need of legal representation.", "pics": null, "resp": {"time": 1615579510838, "text": "Thank you, Eric! We ALL appreciate your kind words. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "106898732574227796161", "name": "J. B.", "time": 1619715978948, "rating": 5.0, "text": "I would like to publicly thank Crumbley-Blackwell & Associates, specifically Michael Moranilla and Richard Crumbley. They are true professionals from start to end and made sure to include me in all discussions about my case. Excellent work everyone! Thank you all so much for everything. I will definitely be recommending and referring Crumbley-Blackwell to anyone in need of a kind and professional law firm. Once again, thank you for everything!\n\nJB", "pics": null, "resp": {"time": 1619719291485, "text": "Well, thank you very much for those very kind words! Our doors remain \"always open\" to our clients to be as involved as they need to be in their case. We are happy to know that you were pleased and satisfied in, not only the results, but also (and, just as importantly) the experience along the way. I will pass on the kind words to the others here and please know that we are ALL wishing you the very best moving forward. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105831430521633911850", "name": "Katina Coleman", "time": 1615341364650, "rating": 5.0, "text": "Even thought, they couldn't help me in my case, I received alot of good information, explained to me so I could understand it. Also so they where very professional, especially Tyra upfront, made us feel very welcome.", "pics": null, "resp": {"time": 1615579593494, "text": "Sorry we couldn't \"formally\" help you but it sounds like our staff took care of you anyway. I am glad to hear this and I will pass on the kind words. Thank you and good luck! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105393247228638069085", "name": "Rob Lyon", "time": 1606934811796, "rating": 5.0, "text": "Mrs. Amy Alexander was phenomenal in dealing with an ugly custody fight involving mental health issues. From the moment she took the case, problems vanished and we could finally see results. This lady is a complete professional, and a credit to her firm.\n\nI have custody of my kids, they're finally safe, and I owe this entirely to our attorney and her staff. I am grateful for their work on our behalf.", "pics": null, "resp": {"time": 1581428089479, "text": "Thank you Rob! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111317775072035747763", "name": "Christopher Fitzgibbon", "time": 1617334636907, "rating": 5.0, "text": "Chris F.\n\nI was arrested nearly 2 years after a bar fight for felony assault, had never been arrested before and both a family friend and the bail bondsman recommended Crumbley-Blackwell. I hired Mr. Crumbley as my lawyer and he did everything he could. They tried to get me to take a plea for a misdemeanor and 2 years probation and Mr. Crumbley easily could of just told me to take it, as he was already paid and could of dumped me off and move on, but he insisted we take it to trial because he thought wasn't right what was happening and i never should of been arrested or charged for defending myself when I was attacked. He believed we could win and so I went with his advice. In the end right before the trial he got all charges dismissed and even court fees waived and I just had to pay a small restitution fee. Hiring Mr. Crumbley was the best decision I could have made and am extremely thankful to him and his firm for everything. Hopefully I never have any use for him again but if I'm ever in a bad way again he'll definitely be my first call.", "pics": null, "resp": {"time": 1617382187908, "text": "Chris: I felt strongly about your case. I hated you had to go through what you did. It took guts on your part so kudos to you, sir. You stood strong. I just stood beside you. Be blessed! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103903528244662804209", "name": "Mary Windham", "time": 1610665658964, "rating": 1.0, "text": "About the same as Hodge. My brother recommended Crumblee. I have made three attempts. Each one has been the bums rush. Strike three, you're out.", "pics": null, "resp": {"time": 1610724269489, "text": "Bums rush? Three attempts? You really don't provide me with much to go on here but if you have a legal matter with which we can help ... that is what we do! If you need to speak with me please TEXT ME at 256-503-1185 and I will personally call you from my cell phone and help you decide if you have a case with which we can help you. Whatever your frustration, that is not our purpose here. I really don't know what else I can say ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109884756515514124925", "name": "Christopher Drouilhet", "time": 1598973915201, "rating": 5.0, "text": "Eleven months ago I found myself in a terrible situation I never thought I would be in. The charges against me were overwhelming to say the least. I retained the services of Crumbley-Blackwell and associates, and it was the best decision I could have made. When I was at my lowest they brought me hope, and provided me with a means to get all charges dismissed. If anything I was skeptical at the ease of the process, but that's just my nature. They definitely are top notch in my book. If you need a good defense attorney look no further. They delivered!", "pics": null, "resp": {"time": 1602011933131, "text": "While we appreciate your kind words we appreciate, even more, your confidence in us on the front end when you were deciding who to hire to represent you. We appreciate that confidence. We appreciate knowing that you are happy with our efforts. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "112028310010741024801", "name": "Cedric Marks", "time": 1606219632057, "rating": 1.0, "text": "Took my 200 fee and didn't even attempt to help. Pretty funny if all Lawyers charge a fee Mr Dutton from Lawrence county didn't charge me a dime not one red cent! So stop!!", "pics": null, "resp": {"time": 1606148628424, "text": "Our attorneys charge a consultation fee for cases involving family law and/or DHR. You were told in advance that your consultation would cost $200.00. You agreed and paid the fee. To maximize the value of that consultation, my staff gave you a list of items (in advance) to bring to the meeting for the attorney to evaluate for you. After meeting with you, our Sr Attorney advised you on how he could move forward on your behalf to accomplish your goals. He explained the fee structure and gave you the opportunity to retain us to move forward on your case. You chose not to hire us. That closed the matter. Please feel free to share Mr. Dutton's phone number here for those who, like yourself, would prefer a free consultation. I will not be offended by that at all. I wish you and Mr. Dutton nothing but the best. - Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114039286009170564583", "name": "Dan Flohr", "time": 1603807854203, "rating": 5.0, "text": "Sometimes life throws you a curve ball or you just flat out make a mistake.  Russell Crumley was able to show me there was a light at the end of the tunnel.  He used his experience and expertise to guide me through the complicated legal system.  Now my problem is solved and no longer an issue weighing heavily in my life.", "pics": null, "resp": {"time": 1604589137175, "text": "Thank you Dan! God Bless! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103055754604186752407", "name": "Caleb Campbell", "time": 1623815234494, "rating": 1.0, "text": "Very very dishonest don’t use!", "pics": null, "resp": {"time": 1623854619022, "text": "This is a very odd review. I notice (by clicking on your name) that you gave the EXACT same review on another law firm's site. We contacted them and, like us, they have never heard of you. Your name does not register in a name search for either of our offices. Since their name is VERY similar to ours, I am left to conclude that perhaps you called one of us, didn't like what you were told and weren't sure who to review. I literally have NO IDEA what this is about. In either event, I have been practicing law for 23 years. My partner has been practicing for 24. \"Dishonest\" is not a word I would EVER expect to be used to describe either one of us. We bend over backwards to take care of our clients. If you are actually a client, you should call me (or TEXT ME: 256-503-1185). In my experience fair, open and honest communication usually resolves misunderstandings. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103523752939750585881", "name": "George Whitmire", "time": 1596023448186, "rating": 5.0, "text": "Highly recommend Crumbley-Blackwell & Associates, P.C; completely in awe of the professionalism, responsiveness, quality and value that I received. Mike, Nicole and Mr. Blackwell are experts in their field and care about their clients and justice. First Class in all they do.", "pics": null, "resp": {"time": 1598880581977, "text": "Thank you George. We talk about what is needed around here often. Our attitudes are: We are professionals - BE professional. The rest will take care of itself. I really appreciate you praising the entire team. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109727442591205007124", "name": "Amber Nunley", "time": 1589410678634, "rating": 5.0, "text": "Nicole was absolutely, without a doubt,  one of the best decisions I could have made in my case. She got me exactly what I hoped for and it was the best possible outcome in my case. I can’t thank Nicole and this law firm enough for all their hard work!!", "pics": null, "resp": {"time": 1598880295307, "text": "Thank you Amber! I will certainly pass your comments on to Nicole. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "112341360060418524601", "name": "Lisa Miller", "time": 1582059990951, "rating": 5.0, "text": "As a native of Huntsville, I was familiar with Mr. Blackwell and his reputation as being a man of integrity and fighting hard for his clients. I found he and his staff to be very knowledgeable and compassionate.  They take a no-nonsense approach and are straight forward. I would highly recommend this firm for legal or domestic issues.", "pics": null, "resp": {"time": 1598879691057, "text": "Thank you Lisa! You are correct. Jon is very good at what he does and is highly thought of in this community. We appreciate your kind words. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105624286577909969550", "name": "Christopher Domskie", "time": 1598968690172, "rating": 5.0, "text": "Johnathan Blackwell is a great attorney. He is very dedicated passionate and knowledgeable about the law and helping on your situation", "pics": null, "resp": {"time": 1602011792388, "text": "Thank you Chris! We are quite fond of Jon ourselves. I will pass your kind words on to him. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "104186385138467433632", "name": "Julie Ertman", "time": 1580718338123, "rating": 5.0, "text": "Kyle Clark and Amy Bryant of Crumbley-Blackwell & Associates did a fantastic job to help me win my case. They were very professional and thorough from the very beginning until the very end of my case. They kept me informed on all matters and worked diligently throughout the whole process. They are the best! Thank you!", "pics": null, "resp": {"time": 1581428076074, "text": "Thank you for your comments. I have passed this on and they are very pleased that they met all you r expectations. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114986702029375134487", "name": "Alisha Fowler", "time": 1568043710240, "rating": 5.0, "text": "When you hire a lawyer the most important thing is trust, you must trust what they are telling & selling you! Jon told me from the day I walked in and before I paid what he was going to do. I remember how confident he was, and I was like…. Really??? I was so nervous! I called Chelsea all the time asking the same questions over and over, she was so patient & understanding though 😊 My cases were an A-2 DUI, Failure to properly yield, & No Insurance (which I had). We pled not guilty, the case was continued three times, and the fourth time we went to trial in district court. Not guilty all 3 counts!! So impressed! So the whole team is just wonderful to work with, I am so pleased with the friendly educated passionate service I received. Grateful", "pics": null, "resp": {"time": 1568049555431, "text": "Thank you SO MUCH, Alisha, for those kind words. We will certainly make sure everyone involved knows how you feel about them and how they made you feel. Sounds like EVERYONE did their job - the way it is supposed to be done. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "112468619035155765803", "name": "Mark", "time": 1562873030493, "rating": 5.0, "text": "Attorney Crumbley and one of his partners, Attorney Hess, helped me through a situation that could have affected every area of my life. They helped streamline the process and gave wonderful advice and insight. On top of it all, I feel I have two new friends. I highly recommend each of these men. The synergy in this firm is superb. They have the best of the best and work together to help their clients. Very thankful to have met them and worked with them.", "pics": null, "resp": {"time": 1568032994625, "text": "Mark: Thank you for that. This certainly was a \"tag team\" effort on all our parts. And, it did turn out very well. Hope things continue to work out that way for you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111503498398426133443", "name": "dancin fool", "time": 1577848413510, "rating": 5.0, "text": "Russ Crumbley and his team did a great job defending me! He spent plenty of time with me going over legal matters and helped set my mind at ease with his experience and knowledge of the law. He fought in my defense and got the case dismissed. Thank You!!!", "pics": null, "resp": {"time": 1581430797994, "text": "Thank you \"fool\". I guess you're really \"dancin\" now. LOL! Thanks for the opportunity you gave us to fight for you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111980433170111516148", "name": "Francisco Chavez", "time": 1582855137028, "rating": 5.0, "text": "Going here was the the best decision I made after my DUI. Not only were they there for me in my time of need, they even got my case dismissed. The whole staff was professional. I have been here for all my legal needs and will continue going in the future if need be.", "pics": null, "resp": {"time": 1598879851673, "text": "Francisco: ALWAYS here for you man! Thank you for letting US help you through this legal battle. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "100536755537518873135", "name": "David S", "time": 1585593113006, "rating": 5.0, "text": "I've utilized Mr. Crumbley's services on a couple occasions and he did not disappoint!  He was able to get my charges dismissed and now hopefully expunged, and far exceeded my expectations!  The office staff is very helpful, and hiring Mr. Crumbley will give you the peace of mind that you have the best representation available in northern AL!", "pics": null, "resp": {"time": 1598880245998, "text": "Thank you David for your kind words. Rest assured, we will continued to work hard for you if, and when, needed. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "107090998275280638550", "name": "Wesley Cantrell", "time": 1584979654858, "rating": 5.0, "text": "Mr. Crumbley was highly recommended to me by a friend and he did not disappoint.  The office staff was always helpful and polite.  Mr. Crumbley was able to get my case dismissed and got the best possible outcome for me.", "pics": null, "resp": {"time": 1598879981173, "text": "Wesley: Thank you! Thank you for you comment and thank you for trusting in us to handle your legal matter. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108143992796859544311", "name": "Steve Hallet", "time": 1572412493570, "rating": 5.0, "text": "When confronted by the long arm of the law, it is absolutely imperative you have someone in your corner you can count on. With Mr. Crumbley and his associates on your side, you can relax in even the most stressful of situations. He and his team will use their vast expertise and legal maneuvering to find you the best possible options given your circumstances. Extremely professional and understanding.", "pics": null, "resp": {"time": 1572623908701, "text": "Steve: We certainly appreciated the opportunity to work with you. As much as I enjoy solving legal problems, it may bring even more satisfaction when I know I have reduced the stress associated with these situations. I am extremely pleased that you feel like we delivered for you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109954877396229766791", "name": "JW Wryta", "time": 1591135699809, "rating": 5.0, "text": "I am a male 37 year old honor discharged protected veteran who holds a Masters Degree and has never had any issues with the law prior to my DUI in 2017.  While my charges were from 2017, I was not arrested until 2019 because I was sent to the hospital on the date of the offense instead of jail and diagnosed with Sudden Traumatic Shock exasperated by alcohol.  Being arrested was completely out of the norm for me.  I did not know where to begin, what to expect, and was consistently imagining the worst possible outcomes and scenarios.  Based off my charges, my bail agent highly recommended that I contact Mr. Crumbly for counsel.  I had an initial meeting with Mr. Crumbly within a week from the first time I contacted him.  The initial meeting did not take longer then an hour and during that time Mr. Crumbly was able to explain all my available options to include representation options, payment options, court expectations, and expected timelines.  Perhaps the most beneficial thing Mr. Crumbly discussed in the initial meeting was the overall stress of the situation.  He told me that it was human nature to imagine the worst possible outcomes and to not worry about that as it was him and his teams job to make sure those outcomes don’t happen.  He was absolutely right and ,during the entire course of my case, I constantly imagined the worst possible scenarios; however, I always made myself think back to that initial conversation with Mr. Crumbly and remembered that is why he is there.  After that initial meeting, Mr. Crumbly and his team handled everything for 6 months up until my court date with the Judge.  Before I even had to go before the Judge, Mr. Crumbly had secured a deal with the DA for me to enter the Pre-Trial Intervention Program (PTIP) and have charges dropped following the completion of the program.  I was more than happy to enter PTIP as it took all uncertainty and stress off the table and I was able to hold everything going forward in my own hands.  As of May 2020, I have successfully completed the PTIP program and am currently working with Mr. Crumbly on having my charges expunged.  I am very pleased with the services I have received from Mr. Crumbly and his team and would highly recommend them.  While I am not going to put personal information on here for obvious reasons, Mr. Crumbly has my full permission to give my number to prospective clients who would like a recommendation.", "pics": null, "resp": {"time": 1598880390721, "text": "JW: It was a pleasure to work with/for you. And, YOU sir, did a great job yourself. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "101081062130182874227", "name": "Ecstatic Diddy", "time": 1571800958930, "rating": 5.0, "text": "Russ Crumbley and his team did a great job defending my daughter!  He spent plenty of time with us going over legal matters and helped set our minds at ease with his experience and knowledge of the law.  He fought in defense of my daughter and got the case dismissed.  Thanks!!!!!!!!", "pics": null, "resp": {"time": 1571867681837, "text": "Thank you \"Diddy\". As a dad (and grandfather) myself, I understand the extra layer of stress that is added when matters involve your child. Thank you for trusting us to take care of what is, undoubtedly, that which is most important to you - family! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "115737704635699699620", "name": "Weston Smith", "time": 1574195850618, "rating": 5.0, "text": "Russ Crumbley represented me and through some lawyer magic got all my charges dropped.  I thought my life was ruined when I got a DUI and he got me off without community service.  He is an incredible lawyer and I highly recommend him to anyone wants a quick and efficient way to get your life back on track.", "pics": null, "resp": {"time": 1574708654090, "text": "Westin: You are too kind. Thank you for those kind words and I am most pleased that we were able to get this matter resolved for you as quickly as we did. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "113829132892636933168", "name": "Refer a Neighbor", "time": 1574713258547, "rating": 5.0, "text": "Mr. Crumbley made the whole experience smooth and easy. As scary as the situation was, he assured me to trust him and he would do the rest. He was able to have my charge dismissed..I will definitely recommend him..Thanks, William Scott", "pics": null, "resp": {"time": 1581430850483, "text": "Thanks neighbor. We really appreciate that you gave us the opportunity to serve you in your time of need. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111957113840165874947", "name": "Adnan Elkhaldy", "time": 1571153020193, "rating": 5.0, "text": "Russell Crumbleyl and his office provided excellent service, demonstrating professionalism and personal attention to all details of my problem. “I hired Mr. Russell to help out with my domestic violence problem because of something that wasn’t my fault. I was worried I should lose everything but Russel got us sorted out from the first meetings. Mr. Russell made us feel a lot better while he worked. I’d hire him again\nAdam", "pics": null, "resp": {"time": 1571867404125, "text": "Mr. Elkhady: It was an absolute pleasure assisting you in your legal matter. Thank you for choosing me to assist you. I hope everything goes smoothly for you as you move forward from this. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "107400676344064036948", "name": "John Clark", "time": 1560344510944, "rating": 5.0, "text": "After reading many of these reviews there is not much else to add. His service was better that I could have hoped for and the relationship is one of empathy and not judgement. They truly want to help you out whatever your situation. Do what he says, follow through and you too can see those wonderful words \"Dismissed\"", "pics": null, "resp": {"time": 1561641473973, "text": "John: That was a very gracious note. Thank you so much for that. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108564363418122658261", "name": "Cameron Loew", "time": 1553006276236, "rating": 5.0, "text": "I contacted Crumbley the day after I got released from jail for a DUI charge. I received a consultation from him and decided that he was my best bet. I was not mistaken. The best result came out of the case and I wouldn't recommend anyone else. Everything was handled and I was secure in good hands. My only qualm was that I wasn't given more time to weigh my options when I took a plea bargain. But that is just about my personal comfort because the best possible scenario occurred. Thank you!", "pics": null, "resp": {"time": 1555694036194, "text": "Cameron: Thank you for your honesty. You had a couple of hard choices to make and I can tell you, without question, you DID make the right choice. Thank you for letting us help you make those decisions. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "101078835591643491952", "name": "Bo Spragins", "time": 1564515311231, "rating": 5.0, "text": "Russell provided me unsolicited guidance and direction that was 100% spot on. He helped me because he knew what to do, wanted to help, and I think he just thought it was the right thing to do. He cared about my personal and families well being which is hard to find these days.\n\nPeople these days don't care about each other. Russell is a good man and lawyer and I appreciate he cared enough to step up as a man and say something.\n\nI recommend Russell Crumbley! Tell him your story. If he can help you he will, and FAST.", "pics": null, "resp": {"time": 1564600392569, "text": "Bo: Thank you for that! Sometimes, it is the simplest things that can make the biggest difference. Glad I was there to help. Glad you had the boldness to follow through and make it work. God Bless you and your family! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103623278570606273626", "name": "Scott", "time": 1582838407942, "rating": 5.0, "text": "I read many reviews on other law firms in the area before deciding on Mr. Crumbley to handle my legal matters. From the first visit until the case was dismissed, he and his staff were very polite, professional, caring and able to keep me informed throughout the entire process and provided all the guidance to secure the results I needed. I never had doubts of his knowledge of the legal system. I'm grateful to have such a good lawyer by my side and will most definitely return to Mr. Crumbley for any future legal needs.  Stop reading and call Crumbley!", "pics": null, "resp": {"time": 1598879777334, "text": "Wow! Thanks Scott. Really happy to hear that you are just as pleased with our staff as you are your attorneys and the results. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108360140141941602983", "name": "Greg Cole", "time": 1560336976782, "rating": 5.0, "text": "I liked how from my first consultation he was very straightforward and honest. No sugar coating he told me his plan and the long term goal and followed through exactly on his word. It was a very serious mistake I made and definitely put me in a position I will never get in again. Thanks to Russell and his team all charges were dismissed and I can put that worry behind me. I would definitely recommend this law firm to everyone I know.", "pics": null, "resp": {"time": 1561641583231, "text": "We appreciate those words, Greg, and we are very happy to have been able to get these results for you. An isolated \"mistake\" should never define a good person. Your's won't! Than you for choosing us! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "100301755535499115798", "name": "Richard Walker", "time": 1572375509621, "rating": 5.0, "text": "Very professional, precise, and dedicated to seeing all parties are satisfied.  and staff is very helpful as well. I will and would recommend them to anyone with any legal issue.", "pics": null, "resp": {"time": 1572623743556, "text": "Thank you, Richard, for the kind thoughts. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110783023668418023055", "name": "Joe Larson", "time": 1567778803131, "rating": 5.0, "text": "You can't go wrong here.  If you're in a DUI situation and don't know what to do, be confident that Russell and his firm will get you the best possible outcome.  His firm is always available and ready to guide you through the process of DUI dismissal.  Retain and sit back.  Give it some time and watch everything work out for the best.  Worry all you want but there's no need.  This is coming from someone with a DUI as a first offense and smear against an otherwise clean record.  I did not know what to do and worry was my only option at the time, but after meeting with Russell Crumbley, it was clear he would get me the results I was after.  Dismissal!", "pics": null, "resp": {"time": 1567805702902, "text": "While I appreciate the very kind words, you actually offer good advice here. When you hire a lawyer, know that it will take a minute. It is a process. Let your lawyer do the worrying and do his or her job. We appreciate your confidence. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114260931223415324032", "name": "Angela Carobene", "time": 1565629877550, "rating": 5.0, "text": "Mr. Crumbley is very professional and takes the time to answer all questions and has the ability to put you at ease. His knowledge and sense of humor are assets to his practice. His staff is very friendly. I would recommend him to anyone looking for an attorney.", "pics": null, "resp": {"time": 1566420706180, "text": "Thank you, Angela! I will pass on the kind words to my staff. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102965939881991180847", "name": "Terrial White", "time": 1604532221662, "rating": 1.0, "text": "Can't afford !!! $200.00 just to tell me that they was real, really to _ _ _ m HIGH", "pics": null, "resp": {"time": 1604589108137, "text": "I don't even know what to say to anyone who takes issue with the fact that we charge for our services. Best of luck to you! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102666891835687377340", "name": "Jane Doe", "time": 1574353535612, "rating": 5.0, "text": "Russell was completely professional and put me and my husband at ease.  He was able to get our domestic violence case dismissed with prejudice and now it is being expunged.  We would recommend to anyone.", "pics": null, "resp": {"time": 1574708596372, "text": "Thank you so much! We appreciated the opportunity to take care of you! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111342205787467498063", "name": "Aaron McCray", "time": 1566842046595, "rating": 5.0, "text": "Mr. Crumbley and his staff were utmost professional in a quick manner representing my interest with a legal case. The initial consultation explained the process and was represented well. I would recommend and hire his legal staff in the future!", "pics": null, "resp": {"time": 1567805557986, "text": "Thank you, Aaron. We appreciated the opportunity to handle your legal needs. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117564245435677995145", "name": "Jonathan Shewell", "time": 1557602584319, "rating": 5.0, "text": "I had 2 DUI charges against me in Huntsville, AL and hired Russell Crumbley to defend me on these in court. Thanks to his excellent defense team both charges were dismissed. I was greatly relieved and highly satisfied with his abilities as an attorney. I would recommend him to anyone in need of an attorney.", "pics": null, "resp": {"time": 1557867350640, "text": "Thank you Jonathan! It was a pleasure working with you. And, as always, we appreciate your recommendation. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108290936878454055498", "name": "nazarieh@aol.com nazarieh", "time": 1510288683380, "rating": 5.0, "text": "My husband and I have known Mr. crumbly as a personal friend for many years. In the past few years we have gotten to know him on a professional level, as well.  Mr. Crumbly assisted a few close friends. He was very thorough and personable. He was also available to answer all of their questions and he was successful in resolving their case. We would highly recommend Mr. Crumbly and his Law firm!", "pics": null, "resp": {"time": 1520519176801, "text": "Nothing like having great friends! And, you guys are great friends. I appreciate your kind words and I appreciate the opportunity to represent people who matter to you as well as the confidence you continue to show me and my firm."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110795611122238939274", "name": "Ethan C", "time": 1549037259237, "rating": 5.0, "text": "Mr. Crumbley was very enthusiastic to help me. He keeps it real with you on what the worst case scenarios are but gets the job done. He comes in with the facts and gets straight to the point. He definitely knows what he is doing and I would recommend to anyone.", "pics": null, "resp": {"time": 1555690108579, "text": "Thank you Ethan. Your lawyer's job when you hire one is to take control and focus on what matters. And, it is your lawyers job to know what matters. And, in addition to the facts, and the law, our clients matter. Thank you for your \"enthusiastic\" review. It was appreciated. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105467789044303671869", "name": "Vikki Franz", "time": 1582914718023, "rating": 5.0, "text": "Incredible experience! Mr. Crumbley is absolutely phenomenal at what he does! I was charged with making a false police report for trying to help a family member who had passed out on the floor and was not breathing, while I was on the phone with emergency services my family never had regained consciousness and woke up, when the EMT’s and police had arrived she was up and able to explain to them she was okay but the officer did not want to believe what we were saying and arrested me. The first day I went to see Mr. Crumbley I told him how worried I was and that I felt completely taken advantage of, he assured me that this was going to be beaten. He took the time to get the recording of the 911 call and the body cam of the officer and reviewed it all. He had his last visit with me before court and he showed me what he was going to present to the court and what he was going to say and when I left I felt very confident that this was going to be the win we needed. So we went to court and sure enough he got everything dropped and cleared. I highly recommend Mr. Crumbley . Very amazing and welcoming! Thanks you Mr. Crumbley for working so diligently on my case!", "pics": null, "resp": {"time": 1598879939482, "text": "Thank you Vikki for that amazing comment. We really just did our job. Really happy it worked out for you the way it did. Thank you for believing in us. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "106911410184869117808", "name": "D Stewart", "time": 1567553635461, "rating": 5.0, "text": "Good Job\n\nI would highly recommend Mr. Crumbley as an attorney.  He was able to get me through my case successfully.  He knows his stuff.", "pics": null, "resp": {"time": 1567805612273, "text": "You are kind. Thank you and wish you the best moving forward. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114556389167760874246", "name": "Richard Castillo", "time": 1563405378570, "rating": 1.0, "text": "ABSOLUTE WASTE OF 5,000 DOLLARS. MR CRUMBLEY SAYS IT'S 3,000 FOR AN ASSOCIATE TO REPRESENT AND 5,000 FOR HIM TO REPRESENT A CLIENT( TOTAL LIE , HE DID NOT SHOW UP AT MY COURT AN ASSOCIATE DID AFTER PAYING 5,000). ABSOLUTELY NOTHING WAS DONE TO HELP ME THAT THE JUDGE WOULDN'T DO FOR ME WITHOUT A LAWYER... DO NOT HIRE THIS FIRM YOU WILL REGRET IT", "pics": null, "resp": {"time": 1563471590182, "text": "Richard: we got your case dismissed with conditions after about two court appearances. You did designate me to try your case in front of a jury if it went to that. Fortunately for you, we were able to avoid that with minimal court time for you. Further, you specifically authorized my associates, in writing, to be with you in court on the court dates that they were there. It would have actually been difficult for us to have done a more effective and efficient job for you. You are welcome to schedule an appointment to come have another look at the paperwork you signed. If issues remain after that I will do everything I can to make you feel like you were treated fairly. ~Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117425560384147665302", "name": "John Mastoris", "time": 1551824565509, "rating": 5.0, "text": "I am very pleased with the professional courtesy and service I received from  this law firm.  I was kept well informed of the progress of my case, and received sage advice from the attorneys.  I am happy with the outcome they achieved for me and strongly recommend them.", "pics": null, "resp": {"time": 1555689937769, "text": "Thank you John. We enjoyed working with you. Thanks for that opportunity. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111996371078087582186", "name": "J Mac", "time": 1599747987123, "rating": 3.0, "text": "They can help help you.  Their staff is very friendly.", "pics": null, "resp": {"time": 1602011997109, "text": "Thank you for your kind words, J Mac. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "113668275720600982936", "name": "vincent mari", "time": 1529973439240, "rating": 5.0, "text": "I came to Mr. Wisda for help in regards to a custody case I was going through. It's a very trying experience and Mr. Wisda and his team were fantastic from beginning to end making me feel comfortable with everything and explaining thoroughly when I had questions, and I had a lot of questions. That being said, either Mr. Wisda or his assistant Amy were always available when I needed them which was incredibly helpful.\nI am incredibly grateful to Mr. Wisda and his staff for the resolution and outcome we achieved in the matter and will forever be indebted to Mr. Wisda and Amy.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108785837336988881649", "name": "Michael Hearst", "time": 1581359612193, "rating": 1.0, "text": "The staff is very rude and disrespectful. When asked about any information I was put on hold ,and when returned to call staff was extremely rude. Couldn't get the simplest of answers. Never got any return calls. Dont feel that they gave 100% of ability.", "pics": null, "resp": {"time": 1581428011384, "text": "I would simply invite ANYONE to call my office and see how you are treated. I am confidant that it will be courteous, competent and friendly. And, KNOW THIS: we appreciate your business! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "107571240726693434286", "name": "Matthew Mullins", "time": 1560810407145, "rating": 5.0, "text": "Mr. Crumbley is a professional in this business and highly experienced. He always strives and pushes for the best possible outcome which is something you want. Highly recommend.", "pics": null, "resp": {"time": 1561641437744, "text": "Thank you Matthew! We have a great support staff and team of lawyers here and we are very thankful that you gave US  the opportunity to serve you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "116031131112077643019", "name": "John Doe", "time": 1572278369363, "rating": 5.0, "text": "I got pulled over with a small amount of marijuana in rural Alabama. I was issued a citation for Possession of marijuana in the 2nd degree and not arrested. Attorney Crumbley and his team were able to get this citation dismissed within about 5 months, and I never even had to go to court. I simply had to pay court fees and attorney fees, which were well worth the outcome. Everything was handled in a timely manner, and my calls were always returned within 24 hours. The fact that I did not even have to go to court, or plead guilty, for a marijuana charge in rural Alabama is a miracle. Mr. Crumbley is a legal Wizard and is very professional.", "pics": null, "resp": {"time": 1572278733969, "text": "It was a pleasure working with you \"John Doe\". And, for others reading this, these cases obviously don't always go quite THIS well. It was a great outcome for us both. In either event, best luck to you moving forward as you work toward making your future great! I know you will. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117850612540911524935", "name": "Ruth Ridley", "time": 1572784607616, "rating": 5.0, "text": "Mr Crumbley did a wonderful job for me. The court appointed lawyer told me i didn't have a chance and that I should just plead guilty and try to get probation. Mr. Crumbley met me in court to ask to continue the case so to have time to prepare. The judge refused and we had to go to trial immediately. His cross examination of the arresting officer and plaintiff was brilliant. The judge's verdict was NOT GUILTY! I recommend Russell Crumbley because he's the best.", "pics": null, "resp": {"time": 1572886891690, "text": "Sometimes, EXPERIENCE is the only weapon you have. When backed into a corner you can't really have \"too much\" of that. Experience always matters but in a situation like yours it can truly make all the difference. I have been there 1000's of times. You haven't. I commend your courage and cool under those circumstances. Congratulations on your victory and thank you for giving me the chance to fight that fight for you. And, thank you very much for those kind words!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "118136172571615590513", "name": "John Everett", "time": 1568665719144, "rating": 5.0, "text": "I never write reviews online, but Mr. Crumbley, his associates and staff have gone above and beyond for my case. Being arrested is a nightmare, but having these folks in my corner made the whole process seem simple and worry-free. This speaks not only to their legal wherewithal -- but also to their willingness to listen and answer questions that might not matter in the long run, but are important to you and your own piece of mind. Right from the get-go, Mr. Crumbley moved aggressively to have my case thrown out, which was ultimately successful! I have no reservations fully recommending this firm to anyone up against a criminal charge. I got the best outcome possible. Thanks Russ!", "pics": null, "resp": {"time": 1570655103647, "text": "Well THANK YOU, John, for taking a moment to share your experience! It matters to us and it matters to others who are considering who to hire as their legal team. We appreciated the opportunity to help you with your most important issues. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102365533365975299553", "name": "CrimsonStorm1968", "time": 1531076836380, "rating": 5.0, "text": "If you need a really good criminal defense lawyer ,hire these guys . As with any lawyer it is not going to be cheap , but these guys got the job done for me with what I can honestly say was the best possible outcome and without having to go to trial. Mine was a case where I had to defend myself against an attacker where I got the better of the attacker, enough said there  . I am pleased with the job they did handling my case  and with the outcome  .Russell is a no nonsense guy and he tells it to you like it is be it good news or bad news .He does not sugar coat anything . If you are looking for a lawyer that will be on the up an up with you and look out for your best interest ,I would give my recommendation . He took care of my matter and I could not have asked for a better outcome …   Thanks guys !", "pics": null, "resp": {"time": 1529327238378, "text": "Thank you CS! We enjoyed the opportunity (and, thanks for that) to work with you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110803216469063896100", "name": "Kelley Denson", "time": 1486535632177, "rating": 5.0, "text": "I don't even know where to begin.  Russell is not only an attorney, he is a friend.  He takes his work very seriously, and has a huge heart that most attorneys just make you feel like a number and only care about your money, but he is not at all that way.  He really cares about his clients,and appreciates each and every one.  There is no one that I know that has the heart and knowledge of law that he does. He is genuine, kind, ambitious and most of all caring.  He is a family man with kids, and he knows how important it is that he takes care of you.  My words are only from my heart about this man.  You have to give him a chance to understand for yourself that what I say about him is nothing but honest and loyal.  But I do want and need to add something to my review about Russell..he is not only caring, ambitious, and knowledgeable, he is also very direct, will always be truthful to you and you need to be truthful with him.  He can not help you if you are not.  He is humble and kind...but he can not help if you will not open up to him, because how can he help you if you are not giving your all to him.  I recommend Russell to everyone that I run in to.  He has helped me in the past and God knows he has helped my son in the past.  My son would be in prison if it weren't for Russell.  But thank God my son has turned his life around.", "pics": null, "resp": {"time": 1489523876762, "text": "Thank you, Kelley. That was heart felt."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102172519892304368618", "name": "Dennis Brock", "time": 1471031501571, "rating": 5.0, "text": "I'd like to recommend Mr. Crumbley and his staff. They have worked with me for 3 years to resolve my case in a just and discreet manner. Even though it took longer than I expected their professionalism, diligence and caring attitude paid off to get my difficult case dismissed. They helped me with my concerns and spent several hours to answer all my questions and charged a fair price. I am very grateful for their service.\nDennis", "pics": null, "resp": {"time": 1489526235838, "text": "Thank you, Dennis. Your kind words are reassuring, even, to us. We are grateful for you as well."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "106546393724626297985", "name": "Albert Solberg", "time": 1551986973101, "rating": 5.0, "text": "Russell is amazing. He is very professional and hard working. He handled my case better than expected. He will be very straight forward about what the expectations are.", "pics": null, "resp": {"time": 1555690291454, "text": "Albert: God Bless you for those kind words. There was much gratification associated with getting things taken care of for you. It was obvious from the very beginning that it was very important to you and your family how things would turn out. Great resolutions are even more satisfying when it matters as much as it did. Thank you! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111430062774485148286", "name": "Drew Rose", "time": 1562881578369, "rating": 5.0, "text": "Mr. Russell Crumbley helped me on a serious case. I had a burglary and theft charge that would have led me to serious jail time. Not only did they reduce it all down to just theft of a lower degree they also kept me out of jail and only did probation. I am very pleased with how professional and reliable they are.", "pics": null, "resp": {"time": 1568032904993, "text": "Thank you Drew. We are very happy we were able to get this result for you. Hope things are well. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "116076671159022054708", "name": "Chris Young", "time": 1548294758366, "rating": 5.0, "text": "Mr. Crumbley was extremely professional and spoke clear and precise in what possible outcomes could be. I am extremely satisfied with the results from him and his team. I personally have never had the privilege of hiring an attorney until him and would trust him and his team in the future. Highly recommended!", "pics": null, "resp": {"time": 1555690535908, "text": "Thank you Chris! We are thankful for the opportunity to have helped you handle your situation. And we will ALWAYS endeavor to continue to earn your trust. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "116112112573223931917", "name": "Computer Lady", "time": 1565211528731, "rating": 5.0, "text": "Worked With Us All The Way\n\nAttorney Crumbley worked with us from the first consult all the way to the end of our case.  He was thorough as well as offering a personal touch.  I would highly recommend Attorney Crumbley.", "pics": null, "resp": {"time": 1566420078420, "text": "Thank you \"computer lady\". Nothing like being told you were nice on top of everything else. This would make my mother smile. Thank you! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109064773891093508091", "name": "Rebecca Pullen", "time": 1570637695867, "rating": 5.0, "text": "I called to make an inquiry. They were courteous and helpful on the phone. If I need their services in the future, I won't hesitate to call this firm.", "pics": null, "resp": {"time": 1570655187687, "text": "Thank you, Rebecca. I guess we couldn't help you at this time but it is great to know that our people are kind and courteous from the outset. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103490079885113467437", "name": "sheree Roden", "time": 1528938893606, "rating": 5.0, "text": "Thank you to Russell Crumbly and associates...! If you need fine representation and very educated lawyers, then Russell  Crumbly and associates are who you should call. I couldn't be more pleased with my outcome. Thanks once again to Micheal the lawyer Russell thoght was best for my case. I would say job well done!", "pics": null, "resp": {"time": 1529007786831, "text": "Sheree: We appreciate that you chose us to represent you. We, too, are pleased with the way things worked out for you and wish you the best moving forward."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103092720700724297427", "name": "Mike", "time": 1565215772719, "rating": 5.0, "text": "Mr. Crumbley was very enthusiastic and straight forward with me. He kept it real with me on what the worst-case scenarios were and what options I had. He literally stopped me from making a career ending choice.  He knows what he is doing. Mr. Crumbley was extremely professional and spoke clear and precise in what possible outcomes could be. I am extremely satisfied with the results from him and his team.  A shout out to the associate I dealt with Michael Morenilla. He was extremely professional and spoke clear and precise on what possible outcomes could be. I am extremely satisfied with the results from him. The office staff is top notch! They are polite, professional and always treat you with respect. I personally have never had the privilege of hiring an attorney until him and would trust him and his team in the future. They are a high-quality legal firm that is always professional and client-focused.", "pics": null, "resp": {"time": 1566420400382, "text": "Mike: I REALLY appreciate your acknowledgement of the important people that make up our team here. I have shared your appreciation of their efforts with them. It is important for them to know their efforts were both appreciated and valued. It is important to me that they did a good job for you. We wish you nothing but the best moving forward. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "100273756705627447536", "name": "sherry steele", "time": 1538586141645, "rating": 5.0, "text": "Mr. Crumbley restored my faith attorneys. Well maybe not all attorneys but he really treated me and my family like we were family.  He did excellent in representing us and won our case. This man is genuine and empathetic. I highly recommend him!", "pics": null, "resp": {"time": 1541012423728, "text": "Sherry: Your family mattered very much to me AND my team. It was an honor and a privilege to stand in the court room with you and give you the fight you so much deserved. I wish nothing but the best for you and your family moving forward. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114555436326154743391", "name": "Anon Ymous", "time": 1551388043412, "rating": 5.0, "text": "Mr. Crumbley always helped me with any questions I have had at anytime and was always readily available to provide his assistance in anyway necessary. He is kind, professional, and knows what he is doing. I highly recommend his professional help when/if the time arises.", "pics": null, "resp": {"time": 1555694105007, "text": "Those were very kind words and they are much appreciated! Wish you the best. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105280047219991312620", "name": "D M", "time": 1534363459970, "rating": 5.0, "text": "Mr. Crumbley and his legal team are some of the most professional and personal individuals I've ever had the pleasure of working with. Not only did they handle my case exceptionally (the best possible outcome for me was achieved) but they also made me feel safe and secure about my circumstances. They understand everyone makes mistakes, and they'll do everything they can to ensure you get a second chance. I honestly can't think of one bad thing to say about my experience with this firm!", "pics": null, "resp": {"time": 1541010818774, "text": "DM: Thank you! Your case mattered to us. YOU mattered to us. I am glad that you were able to see that to some degree. I have said it many times that solving legal problems is only PART of what we do here. Thank you for letting us do all we do for you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103375649268074761315", "name": "william pierce", "time": 1536887168730, "rating": 5.0, "text": "Mr. Blackwell (and his secretary!) were very helpful in getting my criminal case dropped.\nVery minimal contact, did what they assured me they would do.\nI HIGHLY recommend this firm, as it was HIGHLY recommended to me.", "pics": null, "resp": {"time": 1541011751492, "text": "William: Jon does great work. And, yes, he does what he says he will do. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "116685256068896938490", "name": "Teles Walker", "time": 1555528174558, "rating": 1.0, "text": "Attention when hiring an attorney make sure you get a Contract!!! just because you meet with a lawyer an he tells about a case he have beaten make sure you ask him about the cases he lost they will forget to mention those case.?Its a drought on good lawyers not cop out lawyers here in Hsv!!!! When your so call lawyer is bickering with you an he is a paid lawyer an he tells u that’s a good deal an supposedly working for you... get rid of him if you can but if you can’t afford another attorney  make sure u but the word out on him lawyers talk the talk to get your money but don’t walk it don’t be afraid to tell your lawyer how you feel an what’s real they have they picks an chooses!! all I’m saying make sure your lawyer is a stand up type of guy this lawyer firm ain’t Upper echelon as they appear from my experience.", "pics": null, "resp": {"time": 1555689431449, "text": "Teles: I am extremely disappointed but not at all surprised that you feel this way. And, no, we don't win every case. But, sometimes, winning has to be defined only after considering ALL the surrounding circumstances. Given the details of ALL we were working with in your matters, we got you an extraordinary result. I am sorry you are unable to recognize that. And, by the way, you did get a contract, you signed it and initialed it in all the places which directed this office how to proceed on your behalf. In either event, as always, I wish you nothing but the best moving forward.  ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "100696620345288904647", "name": "D W", "time": 1534967297272, "rating": 5.0, "text": "Very professional.  Took care of my case and arranged dismissal.  Micheal took time to explain all information and reassuring me through my case with good advise out eating options that resulted in best outcome for me.\n\nThank You,\n\nDebbie", "pics": null, "resp": {"time": 1541011114074, "text": "DW: Thank you for your feedback. We are pleased to know you were happy with our services to you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105097266447472004443", "name": "Arian Imaei", "time": 1565538608609, "rating": 5.0, "text": "Mr. Crumbley is absolutely the best criminal defense attorney in this area without a doubt and I would never hesitate to recommend him to any friends or family. Any time I ever think of THE BEST criminal defense representation in our area, I instinctively think of Russell Crumbley with no doubt. If you want to receive the best results, please go with Mr. Crumbley. He has gotten me 3 separate dismissals on cases that I was undoubtedly guilty on. His representation is worth the top dollar that you will be paying and just know that you truly do get what you pay for so definitely don’t think twice about him if you’re seeking the best result that you could possibly get in North Alabama. There is a reason why his billboards are so frequent around the area. How do you receive the best outcome in a criminal defense matter? Easy. Just hire the best.", "pics": null, "resp": {"time": 1566420621725, "text": "Wow, Arian! If I ever decide to toot my own horn I will just copy and paste this review. I am humbled. Thank you for letting us take care of you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114056241937881540325", "name": "Kyle Mystery", "time": 1528998775197, "rating": 5.0, "text": "Extremely professional and knowledgeable. Used him a few years back for a case i had that carried multiple charges(Domestic Violence, Disorderly conduct, public Intoxication and resisting arrest) and would have been very bad had Russel not been on my side. Results of that case was way better than I could have expected. Got a reckless driving ticket recently and I wouldn't have even considered using anyone else. I recommend him to everyone.", "pics": null, "resp": {"time": 1529007899437, "text": "Thank you, Kyle! There is probably no better compliment than the fact that you would hire me again. I appreciate that you did. I will give my best for you again."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103646039949591004792", "name": "JustOneAnonymoose", "time": 1488406951811, "rating": 5.0, "text": "I've used Russell twice in the courtroom and both times he fought for me and worked with me in ways far exceeding that which you would anticipate.  He and his partners go above and beyond to make it work.  Russell's a great guy with great work ethic that shows in and out of the courtroom.  Highly recommend making the easy choice here and letting him represent you.", "pics": null, "resp": {"time": 1489523072352, "text": "Sure wish I knew who you were. Perhaps you will call me and let me know. In either event, those were very kind words and I thank you for them. And, if you are going to use an anonymous name, at least yours is a cool one."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "107020111037941479514", "name": "misthe king", "time": 1574521871193, "rating": 1.0, "text": "Avoid like the plague. This law firm is about taking money and providing incompetent service.", "pics": null, "resp": {"time": 1574708274140, "text": "The legal advice we gave you was not only proper, it was necessary that we advised you as we did considering your legal situation because anything else would have constituted legal malpractice. While a client is not obligated to follow our advice, it IS necessary for us to give advice within the law and consistent with court oders. As far as your unpaid retainer balance, don't worry about it. We still wish you nothing but the best moving forward. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105021783760886312588", "name": "Jeff Slaten", "time": 1510197508000, "rating": 5.0, "text": "The staff here is phenomenal.  I have used this firm for a personal injury case and other legal matters for over a decade. If you need any legal services or advice please feel comfort in knowing this firm is here to help.", "pics": null, "resp": {"time": 1520519752829, "text": "Thanks, Jeff. You have been great and everyone here loves you. Hopefully, you won't ever ask me for frequent flyer miles. LOL!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110933880804343832478", "name": "Randy Bice", "time": 1548201971906, "rating": 5.0, "text": "Mr Crumbley did a wonderful job for me and my family. I would strongly recommend him to anyone looking for a good lawyer.  I will use him again if need in the future", "pics": null, "resp": {"time": 1555694183813, "text": "Randy: Thank you! I am glad things turned out the way they did. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "100001489763440455594", "name": "Anthony Hamlet", "time": 1487436773259, "rating": 5.0, "text": "Would like to say Russell is a very good attorney he has help me many of times over the years. He is the type of attorney that will fight for you till the end not only that he is fair. Russell will work with you anyway he can he is honest at everything he does so if anyone needs a good attorney I highly recommend Russell. Thanks Russ for everything you have done for me", "pics": null, "resp": {"time": 1489523243794, "text": "Thank you, Anthony. You have always been a pleasure to serve. You are very kind and considerate ... online AND in real life!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102579146077324859420", "name": "Jessa Harris", "time": 1553654712535, "rating": 5.0, "text": "Long and challenging process but a satisfied outcome thanks to this team. Appreciate all the hard work. JH", "pics": null, "resp": {"time": 1555690443469, "text": "Jessa: Thanks for choosing us and, yes, I tell people all the time that it is a process and you need to hang in there. No one knows though until they have been through it. Your outcome depended on your strength as much as it did ours. Thank you for your comments. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "112657718156076932005", "name": "Hondamilo@gmail.com phillip", "time": 1528852310893, "rating": 5.0, "text": "The firm assisted me with 2 traffic tickets I got in Madison County. It may not seem like a big deal, but I have not had a ticket in well over 5 years and I did not want the points on my license. Mr. Blackwell was able to get both tickets dismissed! Court started at 9:00 am and I was out by 9:30.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117795247924031198201", "name": "M T", "time": 1533088623227, "rating": 5.0, "text": "I highly recommend hiring Russell Crumbley. He helped to get my DUI charge and a violation charge dismissed.  And, my drivers license was not suspended. His office helps with that too. His services are reasonably priced as well. He and his office team are very professional and work efficiently and effectively and communicate with you along every step of the way. They make the process comfortable and seamless. I was very pleased that I chose Russell Crumbley as my defense attorney!", "pics": null, "resp": {"time": 1541008603592, "text": "Thank you, MT, for those kind words and your \"virtual\" referral. Hope things are much better now. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111804762259424765362", "name": "Victoria Jeffries", "time": 1467997082559, "rating": 5.0, "text": "I must say that the Crumbley Law Firm, P.C. is fabulous and in my opinion they are the best in town! Mr. Crumbley is very thorough and intelligent and most of all he does not talk or look down upon anyone for anything. His staff is very nice and knowledgeable and they all are willing to help out in the best way they can. I highly recommend this Law firm!!", "pics": null, "resp": {"time": 1489520685238, "text": "Thank you, Victoria, for those very kind words. You are very gracious."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110855024109985701550", "name": "matt hall", "time": 1527096417165, "rating": 5.0, "text": "I would like to recommend Mr.Russell Crumbley to all for all types of Legal Representation. He did a wonderful job for a Family Member. He came Highly recommended and I would do the same to anyone", "pics": null, "resp": {"time": 1529007063782, "text": "Thank you, Matt!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117266550208073248588", "name": "Stacey Newlander", "time": 1549924927160, "rating": 5.0, "text": "I hired Mr. Crumbley as my attorney for a traffic offense. I was concerned about the outcome as I did have priors on my record that could, without doubt, prove unfavorable for me. I was truly surprised at the actual outcome of my case and was very pleased! Thank you, Mr. Crumbley!", "pics": null, "resp": {"time": 1555694252079, "text": "Stacey: We will ALWAYS try our best no matter what. Things did work out well for you and we couldn't be happier. Thank you for your kind words. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111718594347750736837", "name": "Preston Taylor", "time": 1537472617774, "rating": 5.0, "text": "OUTSTANDING! Mr.Crumbley is by far the best attorney that Huntsville has to offer. I would highly recommend him, and will be hiring him for any future needs. He is very nice, and easy to talk to. Something not every attorney has, but Mr.Crumbley knows his stuff, and is extremely knowledgeable with various laws and regulations. Overall just a great guy, and attorney!", "pics": null, "resp": {"time": 1541012109404, "text": "Thank you, Preston! That was quite awesome! You probably have made me sound better than I am but I will have to find a way to live with that. But, I WILL say that I am quite easy to talk to …. That is one of the better parts of life. A little small talk makes EVERYONE feel better … ME included. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117667437375334000636", "name": "Elizabeth Williams", "time": 1557849609973, "rating": 5.0, "text": "I was arrested for a DUI 2 weeks before I moved out of state about a year and a half ago. The experience was terrifying and Crumbley assured me that I could move forward with my move and he would take care of things here in Alabama. My court case was continued for quite a while, a strategy that was used to wait for the right opportunity to get my case dismissed. After a year of patience and taking a quick 2 day DUI awareness class, my DUI was dismissed to court costs and I am now in the process of filing for an expundgement. Everyone at this office has a wonderful professional attitude and are very gracious with any help they can provide. I have no desire to be in a position to need Mr. Crumbley's help again but to anyone out there needing help, he's 100% worth the price!", "pics": null, "resp": {"time": 1561641659371, "text": "Thank you Elizabeth. We were honored to be chosen to help get you back on the path you desired. Wish you nothing but the best moving forward. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109887107714376880537", "name": "Sandra Hopper", "time": 1483725642057, "rating": 5.0, "text": "I have used Mr.Crumbley on several occasions to represent my husband. Upon our first meeting I was kind of taken back because he would stop me in mid sentence and ask a question. I thought man he is not listening,but he was already processing the case. He has a special swagger that works magic in the court room. He is  smart and confident and the court room is his home away from home. He walks in gives you a beaming smile and goes to work. I highly recommend his services. Super excited about his new partners as well that's a lot of experience in one building.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "107932078767390069454", "name": "Brian Hodges", "time": 1556829711710, "rating": 5.0, "text": "I want to tell you that Crumbley-Blackwell is the #1 law firm in the entire Huntsville/Madison and surrounding areas. Mr. Crumbley is very thorough, professional and you can not beat his long years of experience in the field, plus he can make you laugh when your not up to laughing. To add, his staff(Misty), is patient and follows through on all requests. I can not recommend this office enough. They helped me through a very difficult case and I can never thank them enough. If you need help, then call Crumbley, it can save and preserve peace in your life because he is a man of law and fights for his clients and he will always present you with the best option so trust him! Call them!", "pics": null, "resp": {"time": 1557265468787, "text": "Thank you, Brian for those amazing words. You have actually encouraged me, through that testimony, to try even harder for people like you. I hope everything continues to go well. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105779521670749188196", "name": "Nikesha Baxter", "time": 1487301703382, "rating": 5.0, "text": "The Crumbled Law Firm is Simply The Best.  They didn't just represented me in one but Three cases. Everyone in the office was very  kind very attentive to me and always listen to my concerns and helped me understand the law.  So I would recommend anyone that's in a nasty Custody case, DUI, Criminal Please check Russell and His Amazing Team Out", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "113813689173329902974", "name": "Chase Brown", "time": 1510074300975, "rating": 5.0, "text": "I am very pleased with the outcome. They stayed in contact during the whole ordeal, and provided answers as well as reassurance when needed. I highly recommend these guys", "pics": null, "resp": {"time": 1520523031091, "text": "Thank you, Chase. We are always here to provide support, as necessary, for our clients. By taking advantage of that opportunity, you were able to maintain a comfort level and peace of mind throughout the process. We are all happy with how this worked out for you."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105399239585009201995", "name": "John Montero", "time": 1486253133388, "rating": 5.0, "text": "Russell helped me out of a really impossible situation that turned my life around.  He was more than my attorney. He was a mentor. After my case was over I went on to earn a Bachelor of Science and an MBA. I can truly say that if It was not for Russell Crumbly my life would have taken a much different path!!", "pics": null, "resp": {"time": 1489519457279, "text": "Those are generous and kind words, John. Thank you! You are one of the \"success stories\" that makes us all grateful for the experience."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109529049120180164664", "name": "Jake Black", "time": 1515606711600, "rating": 5.0, "text": "I highly recommend Mr. Russell Crumbley to handle your DUI issues. I was faced with losing my government security clearance and he worked with me for more than a year, and was very, very helpful. His price was very reasonable, and he took care and concern in getting my clearance and all legal issues taken care of. I don't really like to write recommendations because I feel like I paid for the service, so what else do I owe you? But, in this case, Mr. Crumbley went beyond the call of duty to help me and I am deeply appreciative.", "pics": null, "resp": {"time": 1520533009105, "text": "Thank you, Jake. You have done A LOT of things right in your life. In fact, we could use more men like you. But, even good men run into a wall from time to time. I was VERY HAPPY we were able win your hearing and keep your security clearance but, rest assured, all I did was bring to light all the many positive qualities you had already made a part of who and what you are. Thanks for trusting us to do that for you."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102561112514577844953", "name": "Stephan Cathcart", "time": 1537472810156, "rating": 5.0, "text": "Mr.Crumbley was able to take my stressful situation and turn it to ease! He’s a great attorney! I will be recommending him to everyone I know, because he’s so ethical, and easy going but stern in the court room. Very smart, and great prices! You can’t find this quality of service for these prices anywhere else!!! Thank you Mr.Crumbley for everything!", "pics": null, "resp": {"time": 1541012267942, "text": "I am very glad we could help ease the stress - IN ADDITION to handling the legal problem. Easing the tension has become as rewarding as winning. There is a lot to be said for just helping someone \"catch their breath\". Anyway, I really appreciate your kind words. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102520607214365277223", "name": "Tabitha Kontur (R and F Consultant)", "time": 1504206479047, "rating": 5.0, "text": "We hired Russell to take care of a legal matter for our son and he was amazing! He did exactly what he said he was going to do and I highly recommend him and his team should you need legal counsel.", "pics": null, "resp": {"time": 1520524574989, "text": "Thank you, Tabitha! I hope things are going well for you all."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111926808023466526434", "name": "Sheryl Bridges", "time": 1522505894811, "rating": 5.0, "text": "Mr. Crumbley is an outstanding attorney. He handled my case very professionally and confidently. I could not ask for a better outcome for my case. I would recommend him to family and friends. Worth every penny! Thank you Mr. Crumbley.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108778722651346471573", "name": "elizabeth seymour", "time": 1489158799677, "rating": 5.0, "text": "Russell Crumbly is a fantastic lawyer. I was being charged with a DUI and a friend of mine recommended Russell Crumbly, and it was the best decision I could have made. I was so embarrassed and ashamed of myself, I was also a nervous wreck. Russell Crumbly reassured me that he would take good care of me and because of him I'm being given a second chance. Russell Crumbly gets the job done! I highly recommend!!", "pics": null, "resp": {"time": 1520532025697, "text": "Thank you, very much, Liz! You did a great job hanging in there!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110555168063114440758", "name": "Ruth Beardsley", "time": 1541006001301, "rating": 5.0, "text": "My experience with the Crumbley Law Firm was incredible. Mr Crumbley demonstrated exceptional professionalism and extensive knowledge of the law pertaining to my case throughout the entire process. His team of experts worked diligently to ensure true justice was served. I would like to extent special thanks for the work by Josh, Mike, and Nicole. I HIGHLY recommend this Team for any and all of your Law Related situations. My case was dismissed with prejudice, to be followed with the removal of this unfortunate blemish from my record. Thank you for a job well done.", "pics": null, "resp": {"time": 1541012998858, "text": "WB: This is what we shoot for with every client. Thank you, so much, for including the individuals who help make up our team. I will share this with them because it means as much to us as it does to you. So, again, THANK YOU and please accept our best wishes for your future. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103240129008639211259", "name": "Anthony Parise", "time": 1473948507336, "rating": 5.0, "text": "Called around to a few other places and got the run around. I received a letter in the mail from the Crumbley Law Firm and the letter looked very professional. I decided to give them a call (a week before my arraignment) and they worked with me. Very polite and actually let me do some talking and ask as many questions as needed. Highly recommended and most likely the best in the area. -Tony Parise", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "115768264436166501447", "name": "Jennifer Tabares", "time": 1462544754023, "rating": 5.0, "text": "Absolutely amazing!! Very informative and always working around the clock!  I highly Recommend Russell, hopefully I will not need his services in the future but if I do, then I will definitely go with him again!", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "107788908832134080924", "name": "Kyle Pickett", "time": 1560879103245, "rating": 5.0, "text": "Mr. Crumbley took and his team addressed my concerns with care and got the best results available to me. Thanks again!", "pics": null, "resp": {"time": 1561641355732, "text": "Thank YOU Kyle! Hope you have a great and safe summer! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108442703236670193212", "name": "James Chaney", "time": 1504320801443, "rating": 5.0, "text": "A rock and roll team of Lawyers!  Having these guys on my side is the best defence I can think of.  Expertise in DUI, Elder law, and Criminal Defence means I'll never have to look elsewhere for my legal needs.", "pics": null, "resp": {"time": 1520524500841, "text": "Rock and Roll Lawyers? LOL! That's awesome! Thanks. I will have to share this one with my wife (every time we go to Rock and Roll Sushi)."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108442703236670193212", "name": "James Chaney", "time": 1504320801443, "rating": 5.0, "text": "A rock and roll team of Lawyers!  Having these guys on my side is the best defence I can think of.  Expertise in DUI, Elder law, and Criminal Defence means I'll never have to look elsewhere for my legal needs.", "pics": null, "resp": {"time": 1520524500841, "text": "Rock and Roll Lawyers? LOL! That's awesome! Thanks. I will have to share this one with my wife (every time we go to Rock and Roll Sushi)."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117870035143521330847", "name": "Brookelyn", "time": 1461123020880, "rating": 5.0, "text": "After meeting with eight different lawyer's looking and praying for the one who made me feel the most confident in beating not only ONE but TWO DUI. I finally got a consultation with Mr.Crumbley for a meeting and after literally five minutes I knew he was the one to hire. Russell Crumbley did not only save me from losing my license for not taking the BAC. Moral of my review I got both of my DUI thrown out, kept my licenses, and now I am moving on with my future. Thank you so much Mr. Crumbley for saving my future!!", "pics": null, "resp": {"time": 1489526579218, "text": "Thank YOU, Brooke, for choosing me as your attorney. It was a pleasure working for you. Thanks for that opportunity."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "107705060147221531840", "name": "Charlie Barnes", "time": 1510690825278, "rating": 5.0, "text": "Mr. Crumbley and his team do an excellent job. I was very pleased how they handled my case. He was very responsive to  my text and questions.  I  highly recommend this Law Firm.", "pics": null, "resp": {"time": 1520518957196, "text": "Thank you VERY MUCH, Charlie. I have noticed over the years that people sometimes get frustrated with the process but they NEVER ask questions about it. If folks don't ask questions, their lawyers don't know they have them. You did a great job of remaining informed. You certainly played a part in your high satisfaction level. Nice job!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103231526390782532417", "name": "Adam Hyder", "time": 1556637674147, "rating": 5.0, "text": "When I found myself stressed out about and facing serious legal issues from  a particular incident for which I truly had ZERO involvement...I heard a friend talking about The Crumbley Law Firm... I heard him talking about how his case had been dismissed and he was even given back restitution for his troubles...  i figured that I should Atleast have a consult with him.... 2 years later....  all worries are a long , long , time ago and we are moving forward with a clear , stress free , More than satisfied!   I can’t thank them enough for all the hard work, research, phone calls, for my case!  Thank you again CRUMBLEY LAW FIRM!   If you are reading this review ... you probably should have called him like, yesterday!! You will be glad that you did!", "pics": null, "resp": {"time": 1556638630562, "text": "Much too kind, friend! I appreciate the opportunity to work with you and all others who give us such an opportunity. We celebrate with you as you move forward. God Bless! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "106895714476925360112", "name": "Daniel Harry", "time": 1552879183827, "rating": 5.0, "text": "Mr Crumbley AKA MR COMMUNICATION was the best man for the job. He and his team saved my future. What started out as a felony ended with a dismissal. Thank you again Mr Crumbley. NVDO", "pics": null, "resp": {"time": 1555694363529, "text": "Daniel: LOL! Mr. Communication? Wow! Not sure I qualify for that but I will sure take it. Thank you very much for those \"high marks\" and I am really glad things went the way they did for you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103363782959271406160", "name": "Ahmad Ghalaiyni", "time": 1585151692632, "rating": 1.0, "text": "They mentioned free consultation on website , when you go there or ask for appointment, they ask for $200 ( consultation fee !! )", "pics": null, "resp": {"time": 1598880127277, "text": "Yes, we DO mention free consultations on our website. We ALSO mention consultation fees. It all depends on what type matter you have. I am sorry we were not able to be a good fit for you. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "113292523741221647780", "name": "Greg Kaltz", "time": 1550802667465, "rating": 5.0, "text": "TO WHOM IT MAY CONCERN-\n\nIn March of 2014 I was charged with a DUI in Madison County, Alabama. This led to several serious concerns I had as to what negative impacts this DUI might have regarding maintaining my current place of employment, a valid Alabama Driver’s License, and the potential for increased auto insurance rates. In addition, I was uninformed of all the specific issues pertaining to Alabama State Law as they apply to a DUI charge especially, with respect to possible fines, imprisonment, unknown future adverse impacts, or establishment of an unfavorable permanent criminal history. The level of stress in my daily life was extremely high, to say the least, due to this situation and these concerns.\n\nI was referred to the Law Office(s) of Russell W. Crumbley to try and sort all these issues out. Russell put me immediately at ease and clarified for me, in a no-nonsense way, what needed to be done to effectively address the DUI charge against me. He also kept me informed as to the current status of my case as it made its way through the Alabama judicial process and provided reassuring personal representation at any and all court scheduled hearings or appointments. I would HIGHLY RECOMMEND retaining Russell as your DUI Attorney should you ever find yourself in a similar situation. He is a completely knowledgeable and competent attorney in the area of Alabama DUI Criminal Law and you can rest assured that he will obtain the best possible outcome regarding your case.\n\nSincerely Yours-\n\nGreg Kaltz\n\nP.S. – Due to Russell’s expertise, he obtained a DISMISSAL of the DUI charges against me! He is also handling a follow-on expungement action for me that will clear my Alabama arrest record for DUI.", "pics": null, "resp": {"time": 1555694949537, "text": "Greg: It was a pleasure. Thank you! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "101435250670398002136", "name": "Brock Grayson", "time": 1557264097957, "rating": 5.0, "text": "Mr. Russell Crumbley took good care of my DUI case and was an expert in all things considered. He took the stress out of my hands and life and handled everything in a professional manner. On a Sunday, he was the only office that took my phone call, I had to be at court the next day after my arrest at 8 AM. Every office was closed, including Crumbley's. However, on his website there was a chat option in which he took my request and talked to me personally. On that very Sunday he met with me within an hour. He was on his way back from Tuscaloosa and still met with me! I've never been so stressed, but after meeting with Mr. Crumbley, he assured me I would be taken care of. The results: My case was nolle prossed: thrown out. All I had to do was sit back, and relax while Russ took care of the rest. If you want positive results, do yourself and stress level a favor and call his office and have him represent you. You will not regret it.", "pics": null, "resp": {"time": 1557331507325, "text": "Thank you, Brock, not only for those kind words but also for letting us handle your case. We consider it an honor and a privilege to work with every client that gives US that opportunity. There are options in this town. We tend to appreciate those people who choose us. Again, THANK YOU! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110566516761719178249", "name": "Refinnej", "time": 1541421656073, "rating": 5.0, "text": "Mr. Crumbley has been extremely helpful a couple times for me.  His office has been helpful and detail oriented to ensure that we knew everything that was going on and kept me up to date every step of the way.  They were always friendly and accommodating.  Even while not representing me, he was able to give me some great advice about my father's will and estate after my father had passed away.  He took the time out of his busy day to tell me what I needed to do and who it would be that I needed to find and contact once it went to probate.  This is not his area of expertise, he was just helping me know where to start.  He explained to me the process.   Since it was a large city that my father lived in, it was a while before the estate went to probate and I assumed I had been written out due to my father's controlling sister so I didn't bother looking into it until 2 years later when I was found by a life insurance company and received a letter explaining that I was the beneficiary of a policy.  I then took Mr. Crumbley's advice by finding the attorney through the probate court and found that I had many savings bonds, which the sister told me had been spent 10 years prior.  The executrix allegedly told the attorney that she tried to contact me, but she did not  Thanks to these cushions I have been able to go back to school.\n\nI want to add, if anyone is in legal trouble, please seek counsel.  The DA will lie straight to your face.  The DA will threaten you with the highest jail terms to get you to plead guilty so they don't have to take it to trial.  Their in house legal assistants that are there to help guide defendants will tell you that if you don't take the plea \"deal\" that you wont win.  They are only there to help the DA, not you.  It's very difficult, especially when it's your word against law enforcement officers, many who have no problem lying in court and they're buddies with the judge.  You need someone who knows the law and knows how the courts work.  It wont be free, but it's worth it to not have to go to jail and/or have a record haunting you.  For more serious crimes, you may get a public defender, but your life is on the line with someone who may not care about you or what happens to you.  It's a dangerous risk to take and once you are convicted, it's harder to find people to listen to you.", "pics": null, "resp": {"time": 1541428090094, "text": "How kind of you. Thank you. What a mountain of burden you had going on in your life. Thanks for letting us help you navigate through it. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "106330632589751065518", "name": "Bobby Caldwell", "time": 1551287204706, "rating": 5.0, "text": "I hired Mr. Crumbley to help out with a pretty scary issue where I had made incredibly dumb mistakes from lack of judgment and maturity. I was worried I would lose everything, my family and my future (and I almost did) but Crumbley got me sorted out, reassured and sealed after just a couple of meetings. I wish he had been a bit cheaper and that this all never happened, but Mr. Crumbley made me feel a whole lot better while he worked. I’d hire him again, 100 percent.", "pics": null, "resp": {"time": 1555694864432, "text": "LOL! Everyone wishes lawyers were cheaper. Even lawyers when they are on the hiring end and we are ALL on that end from time to time. And, even \"mature\" people make mistakes so don't kick yourself. Things turned out great for you so learn from it. And, THANK YOU for your comments. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "104132695407415216503", "name": "mike thornton", "time": 1597357309806, "rating": 4.0, "text": "Best attorneys in huntsville", "pics": null, "resp": {"time": 1598880645803, "text": "LOL! If we were the \"Best in America\" could we get 5 stars? Seriously, what a great compliment! THANK YOU! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "104279461972614331822", "name": "Miguel Martinez", "time": 1547582448387, "rating": 5.0, "text": "Mr. Crumbley was recommended to me by a friend. I'm very happy I listened. Mr. Crumbley was very professional and walked me through the process step by step and made me feel at ease about the whole process. If you are in doubt about a lawyer, do yourself a favor and give Mr. Crumbley a call. You won't be disappointed. I wasn't!", "pics": null, "resp": {"time": 1555695108083, "text": "That was really nice, Miguel. Thank you (and your friend). ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110566516761719178249", "name": "Refinnej", "time": 1541421656073, "rating": 5.0, "text": "Mr. Crumbley has been extremely helpful a couple times for me.  His office has been helpful and detail oriented to ensure that we knew everything that was going on and kept me up to date every step of the way.  They were always friendly and accommodating.  Even while not representing me, he was able to give me some great advice about my father's will and estate after my father had passed away.  He took the time out of his busy day to tell me what I needed to do and who it would be that I needed to find and contact once it went to probate.  This is not his area of expertise, he was just helping me know where to start.  He explained to me the process.   Since it was a large city that my father lived in, it was a while before the estate went to probate and I assumed I had been written out due to my father's controlling sister so I didn't bother looking into it until 2 years later when I was found by a life insurance company and received a letter explaining that I was the beneficiary of a policy.  I then took Mr. Crumbley's advice by finding the attorney through the probate court and found that I had many savings bonds, which the sister told me had been spent 10 years prior.  The executrix allegedly told the attorney that she tried to contact me, but she did not  Thanks to these cushions I have been able to go back to school.\n\nI want to add, if anyone is in legal trouble, please seek counsel.  The DA will lie straight to your face.  The DA will threaten you with the highest jail terms to get you to plead guilty so they don't have to take it to trial.  Their in house legal assistants that are there to help guide defendants will tell you that if you don't take the plea \"deal\" that you wont win.  They are only there to help the DA, not you.  It's very difficult, especially when it's your word against law enforcement officers, many who have no problem lying in court and they're buddies with the judge.  You need someone who knows the law and knows how the courts work.  It wont be free, but it's worth it to not have to go to jail and/or have a record haunting you.  For more serious crimes, you may get a public defender, but your life is on the line with someone who may not care about you or what happens to you.  It's a dangerous risk to take and once you are convicted, it's harder to find people to listen to you.", "pics": null, "resp": {"time": 1541428090094, "text": "How kind of you. Thank you. What a mountain of burden you had going on in your life. Thanks for letting us help you navigate through it. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "113999791360732906945", "name": "Sara Traylor", "time": 1551123188253, "rating": 1.0, "text": "My husband went for a consultation about some legal issues and the lawyer he spoke with would not listen and just dismissed him without knowing all the information. I would NEVER recommend this firm to anybody.", "pics": null, "resp": {"time": 1551187808579, "text": "Sara: I am sorry you and/or your husband do not feel like he got heard the way he  should have been heard. I take it from your comment that you were not at the consultation. In either event, I would invite you and/or your husband to reach out to me via email (russ@crumbleylaw.com). Leave me a number and I will personally call you and/ or your husband at my very earliest opportunity. You certainly may come to the office but I am offering to make this as easy as possible for you. I am here for either, or both, of you. I will make sure your husband is heard. I will make sure he knows he is heard. I don't know if he has an issue we can help him with but, if we can't, I will make sure he understands that and I will make sure he understands why. If we can't help but I know someone who can I will give him a name and number of that lawyer. I am here to help - not frustrate. Thank you for your time. ~ Russell Crumbley"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "115808209837038627187", "name": "Tim Turner", "time": 1554383366997, "rating": 5.0, "text": "I hired Russ Crumbley thinking I didn't have much of a chance with my lawsuit and they came through with charges dropped and I would recommend them to anyone. Thanks Russ Crumbley & Associates", "pics": null, "resp": {"time": 1555694443172, "text": "Tim: Sadly, lots of people JUST LIKE YOU go in and plead guilty because they think that is their only option. Nothing could be further from the truth as you now well know. Hope all is well. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "115110303836409854076", "name": "Joseph Hall", "time": 1526265968575, "rating": 5.0, "text": "Mr. Crumbley came highly recommended to me and I would also recommend him highly to all others for any legal reason. He served our family member with great care , but most importantly, great skill.", "pics": null, "resp": {"time": 1529007036975, "text": "Thank you, sir! You are very kind."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "101069073858892978665", "name": "Nandi Biba", "time": 1535136060117, "rating": 5.0, "text": "The Crumbley firm represented me recently in a trafficking case. They are very professional, knowledgeable, and take the welfare of their clients very seriously. They love to win! In my case the judge was very one sided and was allowing the ada to do almost whatever he wanted. Still, Russell and Josh were able to win and get me a not guilty verdict, avoiding a 20-30 year sentence. Their team consists of several brilliant attorneys with various backgrounds. If you value freedom like I do, I wouldn’t hire anyone else other than the Crumbley firm.", "pics": null, "resp": {"time": 1541011614089, "text": "Nandi: Taking care of you is what we do. You were a great client with much resolve and determination. It took a lot of guts to fight the fight you fought. It was a privilege to be the attorney chosen to stand beside you in that fight. We appreciate that you chose our firm. It was great to see your face when you got YOUR verdict. It was even better seeing the face of your wife, your mother and your father. Congratulations on the BIG win! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "112447643679754548675", "name": "Grateful Anonymous", "time": 1539695101302, "rating": 5.0, "text": "Very professional in explaining the process and helping me to get the best deal possible.", "pics": null, "resp": {"time": 1541012814003, "text": "Well I am grateful as well ~ that you let us handle your legal matter. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103195639547293344777", "name": "Bob Harper", "time": 1524947653705, "rating": 5.0, "text": "Allow me to say this to anyone who might be seeking legal counsel. I had a problem with the state of Alabama wanting to impose fines and a suspension on me for something that happened eight years ago and in another state. I went in and spoke with Mr. Crumbley and explained my situation. He in turn explained the legal process that would be followed, the possible consequences and the cost to have his firm represent me in this case. He is not cheap but, let me assure you that \"you get what you pay for.\" With the experienced law firm of Crumbley and his team what I got was a victory against an opponent (the State of Alabama) that the little man very rarely gets.\n\nI give them 5 stars.", "pics": null, "resp": {"time": 1529006712372, "text": "Thank you, Bob! Funny how things work sometime. You were a good client but, as you know - after my representation of you, we have gotten to know each other through some common geographical connections. It has been a treat to get to know you in ordinary circumstances as well."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "100996409714327886790", "name": "Ashley Ebert", "time": 1547134242504, "rating": 5.0, "text": "Mr. Crumbley and his legal team was very attentive to my needs and wants throughout my divorce. They were ready to answer questions and provide information throughout the entire process. He made me feel at ease, even during a very nervous and drawn out process. I was very skeptical at times, but Mr. Crumbley and his staff were right there to explain things and keep me in the loop on all actions that were taking place with my case. At the end of this, Mr. Crumbley pointed out that my demeanor had changed from the first day we met to the actual court date. It was great to hear someone recognize that I had gained confidence throughout the process and I have to say most of this was the way Mr. Crumbley and his staff worked with me and supported me during this very difficult time. I want to thank Mr. Crumbley and his staff for everything they did for me!", "pics": null, "resp": {"time": 1555695594133, "text": "Thank you Ashley! It is not often we get to see someone actually GROW during the course of their case but grow you did! And, you did yourself a great big favor by doing so. Best to you and your family as you move forward from this matter. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110577258547077771643", "name": "Rick Roden", "time": 1486320896618, "rating": 5.0, "text": "Russell Crumbley and his team were great.  Our daughter had a motorcycle/car wreck and they listened to us and gave us advice every step of the way.  I highly recommend them for any of your legal needs.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109811535066599567821", "name": "Jessica Riley", "time": 1510005125437, "rating": 5.0, "text": "I got my first and last DUI. I contacted Mr. Crumble and from the very beginning they were very helpful and always available to answer any questions I had during that confusing and scary time. And in the end they were able to get the charge dismissed", "pics": null, "resp": {"time": 1520523304593, "text": "Alex: Thank you! People ask me what is the best part of my job. Your review gives me the chance to illustrate that answer. These matters are confusing and scary. Providing comfort and peace of mind is every bit as good as winning! Glad this is behind you."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117413008847521198773", "name": "Gary Cathcart", "time": 1486524076454, "rating": 5.0, "text": "From the initial meeting to the final outcome, Mr. Crumbley and his dedicated staff of legal professionals never gave me any doubt that my case was always their priority.  Maintaining constant communication at every step in the litigation process, I always knew what to expect and how to react.  I was not only satisfied with the results of my case, but very pleased at the way it was handled.  I highly recommend Russell Crumbley and his team to anyone seeking personal injury litigation.", "pics": null, "resp": {"time": 1489523820174, "text": "Thank you, Gary. You are very kind."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110488481539370262237", "name": "Wendy Adams", "time": 1486009359880, "rating": 5.0, "text": "Mr Crumbley handled some issues for my nephew.  My nephew lives out of state.  The process was painless and efficient.  Thank you so much!", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110957201691134287707", "name": "Theodora Geiger Malcolm", "time": 1531395364185, "rating": 1.0, "text": "I don't hate it...I just can't contact them by phone.", "pics": null, "resp": {"time": 1531485616190, "text": "Well, THIS is certainly a problem - for both you AND me! Please feel free to call me on my cell phone. ~ Russell 256-656-6954 And, THANK YOU!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105186697060886433898", "name": "Melody Graden", "time": 1529455361267, "rating": 5.0, "text": "Russell in a top noch lawyer he was up front and honest we us he knows law and how to use it we was completely saticefied we the way he represented us and the out come of the case he kept Jackson County in line thank you russell", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "106331410309180099538", "name": "Cheryl Mellema", "time": 1528807797517, "rating": 1.0, "text": "Mr. Crumbley’s office called me the day after I posted my review of his partner, and asked if I would speak with Mr. Crumbley at his office. When I explained I was busy I was asked if I would speak with him over the phone. I agreed and I was transfered to Mr. Crumbley.  After listening to me explain my why I left the review and my account of my interactions with Mr. Matt Wisda, Mr. Crumbley asked me several questions.\n1. Would I consider removing my review?\n2. Would I consider moving it to Mr. Wisda’s webpage?\n3. If he (Crumbley) were to fire Mr. Wisda would I then delete my review! I said no.\n4. Was there ANYTHING he (Crumbley) could say or do that would result in me removing the review? To which I responded “Not ethically”, because I felt he was trying to “lead me” into asking for a monetary resolution.\n\nDuring our discussion Mr. Crumbley stated he was not at all happy about Mr. Wisda’s conduct. And that he was considering actions (including termination).  He asked once more if there was anything he could do To get me to retract the review against “Crumbley, Blackwell, & Wisda Lawfirm”.  I explained to him that when I researched Divorce Attorneys/Firms I based my decision in part on the reviews of his Firms website and information regarding the lawyers and therefore would not consider removing the review. We said goodbye and I hung up.\n\nI spent that day wondering if he would call again. I just knew “IT” wasn’t over.\nSo this evening I checked on my review out of curiosity...and wouldn’t you know it there is this long drawn out explanation that it was I who was misinformed etc.  Never once mentioning any unethical behavior on behalf of Mr. Wisda!\nI want to SHOUT from the highest rooftops what a sleazy slimeball you are! Shall I post more? Shall I post information Mr. Wisda freely disclosed to me about a clearly VERY SENSITIVE divorce and custody battle where the children involved had been...!\nYou disgust me!\n\nI retained Matt Wisda to represent me for my divorce.  I feel he acted unethically.\nI contacted his office after receiving an invoice for services that were not rendered. When I followed up with an appointment a few days later not only did he begin by talking about another case he had been working on (this was the 2nd time he mentioned details of this other party's case!) but he also presented me with an official Settlement Agreement\" that clearly stated me and my spouse had both agreed to - WHICH NEITHER OF US HAD!\n\nWe never went through discovery at all! No mediation - nothing!\nThe entire document looked copy and pasted, and all of the assets and then some were to be awarded to me!\n\nMr. Wisda was trying to fool me into thinking he had been hard at work on my case and that I was entitled to everything when in fact he hadn't done anything. Additionally It was never my intention to try take my husband to the proverbial cleaners. I just wanted a fair settlement.\n\nI didn't even look at the \"Settlement Agreement\" he'd drawn up while at his office. I had already decided to sever our business agreement and told him so.  I asked when I could pick up my remaining retainer and he said it would be about a week.\n\nWhen I went to pick up the monies, enclosed with my check was an invoice of almost $700 for the bogus \"Settlement Agreement\" that had been drawn up without consultation or discovery.  Coincidentally the new invoice showed just one line item for the preparing of said agreement which was dated after the phone call I mentioned above.\n\nI immediately drew up a letter refusing to pay and insisting I be refunded.  Additionally in the letter I called him out for trying to fool me and get paid for it. I emailed this letter and received a response early the next morning stating they would immediately refund the that money, which they did.\n\nI am leaving this review to make others aware.  In our consultation meeting he told me his practice \"is like a game to me.\"  And because  conducting his business in such a way, I feel, is an abuse of his power as an attorney and is extremely unethical.", "pics": null, "resp": {"time": 1528493792927, "text": "We deeply regret that your experience with our office did not meet your expectation. We work very hard to not let that happen. Having said that, you say that you received a “settlement agreement” that indicated you and your husband had agreed to the settlement terms when, in fact, you had not agreed. You also say that this agreement was put together without doing any “discovery” or any “mediation”. You initially hired Mr. Wisda to assist you in negotiating an uncontested divorce with your husband’s lawyer. In fact, you produced, for us, a “settlement agreement” created by your husband’s lawyer when you hired Mr. Wisda. That settlement agreement had already been prepared absent any “discovery” or attempt to “mediate”. It was clearly the intentions of both parties (and their lawyers) to settle this matter, if possible, without costly litigation. This type divorce typically does not involve “discovery” (in the traditional sense) and most certainly doesn’t involve “mediation”. In these type matters we simply go with settlement negotiations to the extent we are able, which necessarily includes “settlement proposals”. Also, in this type situation, both parties tend to agree that they know what the assets are and their values are not in dispute.\n\nThe “settlement agreement” your husband’s attorney prepared, and gave you, was just like the one Mr. Wisda gave you. In reviewing your husband’s proposal it is noted that it also includes language stating that the two of you “acknowledged and agreed” to things that you had not already agreed upon. In other words, both lawyers settlement agreements included the very same language in that regard. In fact, most paragraphs in all settlement agreements are full of language such as “the parties acknowledge and agree …”. This language is included to satisfy legal requirements and applies to you ONLY AFTER you have actually read it, agreed to it and signed it. It is not intended to mean that you have already seen it and agreed to it. And, it is NEVER INTENDED to deceive. Your attorney, Matt Wisda, did exactly what your husband’s lawyer did with respect to that language.\n\nAs far as the “attempt to fool you” is concerned: you received an itemized statement of the charges. You received two billing statements. The second of those two seems to be where you objected. That statement involves the “settlement agreement”. You were dissatisfied with that charge and objected to that bill and, although you had NOT notified him of your desire to terminate him until after that work was done, we refunded every penny to you of that part of the bill. And your objection, as much as any we can tell, is founded on your belief that it included the “bogus” settlement language indicating that you and your husband had agreed to the terms that you had not agreed to.\n\nWe strive to handle cases the way our clients direct us. And, while the services you received were not satisfactory to you, Mr. Wisda DID NOT bill you for services not rendered. His conduct was not unethical. His ability to communicate effectively with you, I will agree, must have missed the mark. For example, we are not sure how, exactly, you did not understand that the “acknowledged and agreed” language in the settlement agreement did not mean you had both already agreed to that agreement. That was no more the intent of what Mr. Wisda provided you than it was the intent of what your husband’s attorney provided him. It was merely two lawyers doing their jobs and adding the language that was going to be necessary at some point, in advance. Perhaps THAT is why it looked copied and pasted.\n\nWe would encourage ANYONE who is dissatisfied in ANY way, with ANYONE in our office, to meet with any of us. WE ARE ALWAYS AVAILABLE to meet with that person and do everything we can to alleviate their concern and fight for your cause. Your case matters to us. And, YOU matter to us. Best wishes moving forward during this trying time.\n\n~ Russell Crumbley & Matt Wisda"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108893150977543046838", "name": "Amber Roden", "time": 1529540019790, "rating": 5.0, "text": "Although my case isn’t over yet, these people at this law firm are amazing. I can say they truley build a relationship with their clients, and they are especially great to veterans. As a Veteran I come with quirks that a normal court room may not understand, however these guys told me I had an opportunity to get into Veterans Court with people who will understand my mentality and actions. I am profoundly greatful for this firm and all of their help, guidance, and prayers. Thank you, Crumbley and Associates!", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "112604978908427922049", "name": "Annie Sloan", "time": 1525998136517, "rating": 5.0, "text": "Mr. Crumbley and his associates are great! Mr. Crumbley was available to answer any questions that I had and made sure that I felt like I was in good hands… and I was! He made a very stressful time in my life much less stressful and I'm very greatful for that. I would recommend Mr. Crumbley & his associates for your legal needs.", "pics": null, "resp": {"time": 1529006993313, "text": "Thank you Annie! My favorite part of the job is relieving the anxiety. Thank you for letting us take care of your legal matter (as well as your stress)."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "113209172053181450013", "name": "Jonathan Russell", "time": 1533058264128, "rating": 5.0, "text": "I came to Mr. Crumbley with a domestic violence case in Huntsville VS me. I am an aerospace engineer here in Huntsville, and, like many of you, hold a security clearance. These charges HAD to get dropped if I had any hope of keeping my clearance and my job. I had never been in any trouble before so I wasn't sure how to go about things when the public defender asked me how I wanted to plea.. she told me to plea guilty and pay the county for a class that may or may not get the charges dropped. After getting some much needed advice from a kind correctional officer outside, I declined that plea and decided to plea not-guilty and seek out my own legal counsel. I found Mr. Crumbley's office and the charges ended up being dropped/dismissed. Him and his team, even the front office, they were all excellent. Couldn't have asked for a better outcome. Now my life, my clearance and my job will remain in tact. Everyone has the blurb at the end of their advertisements saying \"no representation is made that the quality of legal services performed is greater than that of other lawyers\" but I'm not sure I agree with that. Mr. Crumbley really knows what he's doing and takes the time to understand where your coming from, what you are trying to do, and came up with a fantastic plan to get me there. Thanks again, to the whole office and team at Crumbley, Blackwell, Wisda and Asc.", "pics": null, "resp": {"time": 1541008337764, "text": "Wow! Thank you Jonathan for those VERY KIND words. You were very fortunate to have gotten some really good, free, advice before you even met us. You did yourself a HUGE favor in following that advice. Thank you for choosing us to represent you. It was an honor to see you through this difficulty and it was especially gratifying to us considering how easily this could have turned out differently for you. Best wishes moving forward. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109103275249720637670", "name": "John Smith", "time": 1524870515137, "rating": 5.0, "text": "Mr. Crumbley is a phenomenal attorney.  Not only did he handle my case in a professional manner, but he also showed a genuine sense of caring.  He always responded in a timely fashion, if not immediately. I was at risk of losing the capability of obtaining a security clearance. Knowing the time sensitivity of my situation, Mr. Crumbley was able to expedite my case. He managed to propel what should have been a four month process before my first initial court date, to my case being completely dismissed three weeks after retaining him and his firm as my council. I highly recommend Mr. Crumbley, not only because of the outstanding success I received, but because of the quality of his character. He was a very compassionate and kindhearted man, that I will forever be indebted to. The investment does not compare to the beneficial return you will be rewarded with if you obtain Mr. Crumbley’s council.", "pics": null, "resp": {"time": 1529006507978, "text": "Your words are amazingly kind. Thank you! But, also, thank you for choosing me and my team to assist you in your matter. Your matter was very important as well as urgent. There are many lawyers in town you could have chosen. You chose us. The only way I knew to respond was to do the best I could do. Again, thanks for the kind words and best to you and yours moving forward."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "104191070693618894207", "name": "Aaron Cannady", "time": 1507347544075, "rating": 5.0, "text": "Since day one, I can honestly say Crumbley and his team has extended excellent service for me as a client and I am very pleased with the efforts that they have put forth. I would recommend Crumbley and his firm as one of the best teams around. Not only was I treated with a lot of care and respect, but the firm made me feel comfortable about my investment. I just wanted to take the time to thank everyone at Crumbley for their contributions and efforts.", "pics": null, "resp": {"time": 1520524280257, "text": "Thank you, Aaron! I will pass your kind words on to \"the team\". We have a great group of people here from the front desk, to the conference room and to the courtroom. I appreciate knowing that they ALL treated you the way I would want to be treated. Hope things continue to go well for you moving forward."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108498626513275782935", "name": "K A", "time": 1528924665957, "rating": 5.0, "text": "Outstanding service. When looking for a lawyer he needs to be your first choice.", "pics": null, "resp": {"time": 1529007598334, "text": "Thank you, KA. We appreciate you recommendation. And, obviously, we are thrilled that you were happy with our service."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114863220130182123631", "name": "Kenny McCrary", "time": 1550618789006, "rating": 5.0, "text": "I want to thank Kyle Clark in my recent case.What was a simple case turned out to be not so much when you are dealing with child support cases.Ex spouse's can be  difficult but he stepped up and problem was solved ..Thank you Kyle and the Crumbley team!", "pics": null, "resp": {"time": 1555695064829, "text": "Thank you Kenny! So glad this worked out for you and, yes, Kyle is a very smart young gun who we are quite excited to have on our team. Nothing quite like \"problems solved\". Have a great day sir. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111030120565310329047", "name": "Matthew Conlee", "time": 1462889281035, "rating": 5.0, "text": "I would Highly recommend Russell Crumbley for any legal needs. Russell worked very diligently to win my  case!", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109882374900221012956", "name": "Daniel Littleton", "time": 1463292430986, "rating": 5.0, "text": "Threw his actions and what he accomplishes it is obvious that Mr. Crumbley is the perfect lawyer for whatever problem you may be facing. He took a very stressful and uncertain time in my life and helped me threw it so now I can breath easier. Thank you for your hard work.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "106899323811165606327", "name": "J D", "time": 1529271934724, "rating": 5.0, "text": "I would like to thank Mr. Crumbley and his associates for fighting and succeeding in giving me a second chance in life. Mr. Crumbley is a confident yet humble man who will comfort your worries and lift your spirit through your difficult time. He was more than a lawyer to me. Some sessions we would just talk for hours about how to successfully overcome the stress and obstacles of life. Mr. Crumbley made a profound impact on my life. One I will forever be grateful for. Thank you Mr Crumbley for my mulligan in life.", "pics": null, "resp": {"time": 1529327153130, "text": "JD: Thank you! I wish I could sufficiently articulate how this review makes me feel. I often reference the \"mulligan\" that you reference. It is a simple concept that is most often applied on the golf course. But, as are many other simple sporting analogies, it is a great metaphor for life. I like to think such things are helpful. Your reference to it certainly makes me think it meant something to you as well. Here's hoping you \"hit 'em long and straight\" from here on out. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103449820587874690261", "name": "Steve Crabb", "time": 1462892791469, "rating": 5.0, "text": "I would highly recommend Mr. Crumbley for your legal needs. He and Mr. Jarvinen work as a great team and cover many areas of law.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111643165772784693993", "name": "mike mcfarlen", "time": 1529797706781, "rating": 5.0, "text": "I needed an attorney and didn't know where to turn so I asked a friend that had been in a similar situation . He gave me two names, Russell Crumbley and the attorney he had used. He told me every time he went to court Mr. Crumbley was there representing clients. I chose Mr. Crumbley.  Within days the other attorney  ( Jonathan Blackwell ) joined Mr. Crumbley's firm and I had both working for me. I could not have been happier .   Mr Crumbley and his firm were able to get all charges dismissed. The service was professional, the fee was reasonable, and the result was great. If you need an attorney call Crumbley, Blackwell, Wisda and associates. You will be glad you did.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "109348264812525627004", "name": "Need Lawadvice", "time": 1528552333253, "rating": 5.0, "text": "I contacted Crumbley, Blackwell, Wisda & Associates, PC for help with a very personal legal matter. My attorney, Mike Morenilla, provided the advice and support that I needed to get the issue resolved in a very professional and caring manner.  It was a very stressful ordeal and Mr. Morenilla provided the reassurance that I needed that everything would turn out ok. I highly recommend this firm for any legal matter you may have.", "pics": null, "resp": {"time": 1529007252975, "text": "Thank you \"Lawadvice\". We take pride in the resources we can provide in our team approach. We are very thankful that you were so satisfied. We appreciate you and we appreciate your recommendation."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102278851608440929848", "name": "Desiree", "time": 1509063921365, "rating": 5.0, "text": "james  floyd\nMr. Crumbley  is an outstanding  lawyer who takes  great  pride in his  work and treatment of his clients.I would highly recommend him if you need  legal  representation.His staff was  courteous and professional.during the entire process", "pics": null, "resp": {"time": 1520523526735, "text": "Thank you for that Mr. Floyd. This was a difficult process for you and your family but it ended very well. Sometimes, an unexpected glitch creates an opportunity for us to step up to another level for our clients. I appreciate that you noticed that effort and that you were kind enough to share it here. God Bless!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "101398690732813194123", "name": "Chuck Swinford", "time": 1524024195896, "rating": 1.0, "text": "Contacted them trying to get help in resolving debt with a collection agency. Was dismissed very quickly and told there's not much an attorney could do and to pay the debt.", "pics": null, "resp": {"time": 1523630718845, "text": "Chuck: I very much appreciate your considering our firm to assist you with your issues. We do every thing we can to make ourselves available to people who wish to hire us to handle their legal issues. There are, however, occasions when people do not wish to hire us (for one reason or another) or even schedule an appointment to come meet with us. Under those scenarios, our staff gives the best information they can (given the limited engagement over the phone) to help them resolve their own issues. Other than that, there is very little an attorney can do for that person. If you feel you have been dealt with less than fairly I would invite you to communicate your concerns with me by emailing me directly at russ@crumbleylaw.com. Leave your phone # and I will be glad to call you and see if I can give you a better answer than the answer you received earlier this week. I can assure you that you will feel much differently after we speak. Either way, have a good day and best wishes with you issues. ~ Russell Crumbley"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "107308441151951329909", "name": "Douglas Crago", "time": 1499895944028, "rating": 5.0, "text": "Friendly staff. Really willing to help and make things as easy as possible.", "pics": null, "resp": {"time": 1520524638028, "text": "Thank you, Douglas. I will sure let my staff know how good they are doing. I will be sure to keep them around as well. :-)"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "118211064788641637381", "name": "Susan Anthony", "time": 1490306266650, "rating": 5.0, "text": "Incredible lawyer! Was informant and helpful through my entire process and got the job done perfectly!", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110485937813049158162", "name": "Kevin Bacon", "time": 1463144517583, "rating": 5.0, "text": "Mr. Crumbley is a very professional and knowledgable attorney. As a Law Enforcement officer, I have seen, first hand, at how well-rounded he is. He legitimately does his absolute best at seeing what's best for his clients. Needing an attorney for a civil case myself, I contacted Mr. Crumbley's office, among a few others. He was the ONLY attorney that returned my call. Come to find out, I had a conflict of interest with him being the defense attorney for an individual that I, unfortunately, had to arrest. I would HIGHLY recommend Mr. Crumbley's services, civil or criminal.", "pics": null, "resp": {"time": 1489520821926, "text": "Thank you, \"Kevin\". Nothing like getting feedback from someone who sees you in court on a regular basis. You do a great job as well. Thanks for your service as a law enforcement officer. Stay safe!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117915021326253256936", "name": "William Mars", "time": 1508942643453, "rating": 5.0, "text": "Mr. Crumbley was a fantastic resource to have in my corner as I negotiated a dispute with my out of state employer. Mr. Crumbley's calm made not only myself but also the opposite party understand that the dispute could be resolved with him as the mediator. I still work at my company and I know for a fact that I would not be if not for Mr. Crumbley's help. At the time, a very stressful situation, I was not able to explain myself in a clear manner and Mr. Crumbley explained the situation to my employer in an eloquent way by formulating thoughts into words.", "pics": null, "resp": {"time": 1520524080224, "text": "William: Thank you for sharing this. I remember sitting in the conference room with you ... listening. There were MANY layers of stress that had piled up for you. I will never forget your case because of what you had on the line on different levels of your life. It was an honor and privilege to help you resolve this. With so much at stake, it was certainly a great day for all of us when it all resolved in the positive way that it did. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103052519117670767013", "name": "Arian imaei", "time": 1555792952150, "rating": 5.0, "text": "Russell Crumbley and his team are the absolute best in their profession. Mr. Crumbley is the most exceptional, top notch attorney in the area and will exceed your expectations each and every time under his representation. He has represented me on 4 separate cases (3 misdemeanor and 1 felony) and has impressed me more and more each time with his results with all 4 of the cases being dismissed with NOT GUILTY verdicts when I was very GUILTY as a matter of fact. As soon as he walks in the courtroom you should know that you will be taken care of. This mans representation is like the results of having the combination of Peyton Manning in the regular season and Tom Brady in the playoffs which in other words is about as good as is gets when in comes to criminal defense representation. I honestly do not have enough words or ways that I can use to describe how high level of an attorney he is and worth every dollar of the premium cost to afford him to represent you because you get what you pay for so you won’t be disappointed no matter how guilty you are of your charges. Don’t hesitate to call his office as they are more than happy to assist you with whatever questions or concerns you may have in regards to your case. Mr. Crumbley is hands down the best attorney in our area for any criminal matters. Do yourself a favor and make sure you hire him to take care of yourself because I’d honestly be hesitant to have anybody else to represent me in a potential criminal defense situation besides Mr. Crumbley. To Teles Walker, you won’t find a better attorney or receive a better result than having Mr. Crumbley by your side and am sure you received a contract as Mr. Crumbley is always sure to provide one so everyone out there should disregard any negative reviews because those folks are more than likely either trolls or generally unhappy with their own lives and you can tell the literacy of the individual by reading their review from a grammatical standpoint. To the rest of the folks out there, be sure to disregard the ignorant individuals reviews as that is a false representation of Mr. Crumbleys services. As GUILTY as any individual may be, I can guarantee that you will receive the best possible legal result with Mr. Crumbley by your side and I say that with no doubt in mind. There is a good reason as to why you see his billboards all around our area and it’s for his consistently exceptional results. As always thank you for your outstanding as well as expectation exceeding results Mr. Crumbley.\nYours sincerely,\nAnother Satisfied Client", "pics": null, "resp": {"time": 1556027434386, "text": "Wow! I have fought for clients for 21 years but, as far as I know, this is the first time a client has fought for me. I never really thought about clients reading other people's reviews before they write their own but I guess they do. I think you were more upset than I was. But, I have learned over the years that people see things, view things, expect things and interpret things differently from each other. As they say: \"one man's trash is another man's treasure\". EVERYTHING must be ALWAYS viewed with the proper perspective. I appreciate your strong, heartfelt words but they weren't necessary. We take cases all across the board and that includes cases that are very difficult and filled with a multitude of considerations, possibilities and opportunities - even for failure. Sometimes the absolute best outcome still falls short of the perfect outcome. I think most people understand that. Having said that, God Bless you young man. Many thanks! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105504463129488306994", "name": "mike money", "time": 1490804539525, "rating": 5.0, "text": "I retained Mr. Crumbley to represent me on a DUI in the city of Madison. I had heard a lot of good things about him and his firm from other people that had used his services. I scheduled a consultation and went to meet Mr. Crumbley. I was very nervous about my situation, but within minutes he had me at ease and feeling confident we would win this case. During our meeting, Mr. Crumbley was very professional and knowledgeable and easy to talk to. I followed his advice and we took the case to a jury trial in the higher court. We were scheduled court dates several times and each time I went, the court wasn’t able to try the case at that time and would reschedule at a later date. Jump forward 6 years (that’s our court system), and the court finally scheduled a court date. So since it had been 6 years, I had moved a couple of times so the court didn’t have my current address so I was never notified of the new date. Mr. Crumbley still appeared in court on my behalf, he informed the court that he had tried to contact me but was unable to reach me. The court was talking about doing several different things, but Mr. Crumbley kept fighting on my behalf to reach a solution that was in my best interest. The day after my court date, I had a missed call, I called the number and it was Mr. Crumbley’s office. His staff found out who had tried to contact me, next thing I know, Mr. Crumbley was on the phone. He told me about the missed court date, and I’m thinking Ok, bench warrant!!! He continued to tell me the news….Case is Dismissed!!! What better outcome could there be. Thanks Russell.", "pics": null, "resp": {"time": 1520525082285, "text": "Mike: THANK YOU for that. But, I just did what you hired me to do ... I kept fighting. And, it certainly worked out better than I expected. Just goes to show ... you never know until you go try. God Bless!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "101450159794462300011", "name": "Rick Wienczkowski", "time": 1565129480934, "rating": 4.0, "text": "Very professional so we'll see if he wins my case or not", "pics": null, "resp": {"time": 1566419902194, "text": "Mercy! I'm not speechless often but I may be here. Of course, I won a trial one time by not saying a word. True story. Of course, I hope we win your case as well. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103817291522820376262", "name": "K Cheema", "time": 1510345089226, "rating": 5.0, "text": "Excellent lawyer, very effective communicator and knowledge of legal processes.", "pics": null, "resp": {"time": 1520519045146, "text": "Thank you SO MUCH! IF I did a good job communicating, you did as well. So, thank you for THAT as well."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "101692053037746828107", "name": "Vicky G", "time": 1531500751827, "rating": 5.0, "text": "Mr. Wisda and his assistant Amy make a great team for my very complicated and drawn out divorce case.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103780661660319699726", "name": "Margie Girard", "time": 1517396557573, "rating": 5.0, "text": "Yesterday I posted negative reviews about Mr Crumbly. I apologize and know I posted in hast.", "pics": null, "resp": {"time": 1520517811642, "text": "Margie: You had A LOT on your plate ... sometimes, life just gets difficult and hard to manage. No worries, and thank you for understanding where we come from in handling these sometimes very delicate legal matters. Hope your day is better."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103510020611381283667", "name": "ben floor", "time": 1486563430459, "rating": 5.0, "text": "Open and honest with me and walks you through the process.", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "112808035632410121958", "name": "Molly Johnson", "time": 1486307619230, "rating": 5.0, "text": "Mr. Crumbley helped me with a situation that could have jeopardized my future and career. I highly recommended him for any of your legal needs!!", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "104957238976159604531", "name": "Marina Efimova", "time": 1468608638482, "rating": 1.0, "text": "He has rude and not responsible representatives. And if he can't organize his firm work properly, I don't believe he is doing his job well.", "pics": null, "resp": {"time": 1488301432004, "text": "It is critically important to us/me that anyone who calls our office has a pleasant experience from the very first moment they are greeted on the phone. We have a seasoned, competent and caring staff but we would encourage ANYONE who takes exception to the way they are treated by anyone in my office (including any of the attorneys) to bring the details of that to me (Russell), personally, by emailing the name (and details of the conversation) to me at russ@crumbleylaw.com. I will thank you in advance for helping us/me maintain a helpful and caring environment for our clients who are, for the record, the most important people to walk through our doors."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108208899833538466701", "name": "Sean Brady", "time": 1477424697795, "rating": 5.0, "text": "Mr Crumbley is one of the few lawyers willing to help people with criminal cases, and even makes up for his high prices in consultation when youre not pleased with the consultation at first. His advice is fair, and non bias.", "pics": null, "resp": {"time": 1488302519104, "text": "That was very kind, Sean. I appreciate your gracious attitude. I wish you nothing but the best."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108257506774849255460", "name": "Lucas Johnson", "time": 1535406865124, "rating": 5.0, "text": "Curtis Whitmore is great and friendly.", "pics": null, "resp": {"time": 1541011641872, "text": "Lucas: Yes, he is. Great guy! Thanks for saying so. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103461324183032244647", "name": "William Smart", "time": 1603157547266, "rating": 5.0, "text": "Useful", "pics": null, "resp": {"time": 1604589163027, "text": "Thank you William. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "110868700782359568967", "name": "Bobby Peden", "time": 1536798151007, "rating": 5.0, "text": "These people can handle any thing. They handled all my needs.", "pics": null, "resp": {"time": 1541011705474, "text": "Bobby: You are much too kind. But we WILL roll our sleeves up and work. Thank you for continuing to place your trust in us. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "102409251739989835326", "name": "Mike Pilotte", "time": 1561663565298, "rating": 5.0, "text": "Awsome attorney..", "pics": null, "resp": {"time": 1568033036496, "text": "Thank you, Mike. We certainly appreciate your giving us a chance. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "105594477513756937616", "name": "Angel Pennington", "time": 1520469355057, "rating": 5.0, "text": "I visited Jonathan Blackwell and although I didn't need immediate legal help, he gave me stellar advice and if I do need legal help in the future I will Defenitely use him!", "pics": null, "resp": {"time": 1520532632755, "text": "Thank you, Angel. Please keep us in mind!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "104158596799754295635", "name": "Walter Prunzik", "time": 1486333033171, "rating": 5.0, "text": "\"Not Guilty, or Case Dismissed\" These are the only words I want to hear from a courtroom judge, and I've heard em both when Russell Crumbley was my attorney!", "pics": null, "resp": {"time": 1489523760870, "text": "Walter, our favorite \"world traveler\". You have SUCH a way with words. Thank you!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111661015498013132953", "name": "Dena Mastin", "time": 1493755260229, "rating": 5.0, "text": "I could not have chose a better law firm to handle my case!!! Thank you so much Russell and Mike👌🏽👌🏽👌🏽👌🏽👌🏽👌🏽.", "pics": null, "resp": {"time": 1520524901328, "text": "You showed tremendous courage during the course of your matter. Your willingness to stand strong in the face of great risk gave us an opportunity to shine. I will NEVER forget your personal display of courage. Carry on!!!"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "118078438045310432421", "name": "DIPYO Much", "time": 1535124569716, "rating": 5.0, "text": "Outstanding lawyers that really care!!", "pics": null, "resp": {"time": 1541011222217, "text": "Thank you, John! That made my day. 5 words that said it all. And, we really appreciate your taking a minute to say so. Today is Wednesday, hope you have a GREAT weekend when it gets here. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111383651073425070102", "name": "Day Dreamar42", "time": 1517608155980, "rating": 5.0, "text": "Best lawyer anyone can ask for", "pics": null, "resp": {"time": 1520517307365, "text": "Thank you, Joe. We enjoyed working with you. Best luck moving forward."}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114198234793193017362", "name": "Ben Tipton", "time": 1542154345567, "rating": 5.0, "text": "Pretty good legal services", "pics": null, "resp": {"time": 1555695624936, "text": "Thanks Ben! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "101176330698234101806", "name": "Jacob Cooley", "time": 1561376254878, "rating": 1.0, "text": "Very expensive and not worth it.  Will make promises and not follow through.  This is for Blackwell, I'm not sure about Crumbly", "pics": null, "resp": {"time": 1561641314585, "text": "Jacob: It is very disappointing to see your level of disappointment. After a review of our records, it appears as though this review stems from issues about 10 years ago. Jon and I bend over backwards for our clients to try to get the best results possible. We have tried many cases in front of a jury. We get MOST cases dismissed and, of course,  some clients do enter a guilty plea. However, every case is different and has it's own variables, nuances and circumstances (both in fact and in law). For that reason, alone, we never make promises or guarantees - even when we believe we could. That is just not good business. The ONLY thing I know to do is to reach out to you and I have done that - to no avail. My office and my phone line remain open to you. In either event, we wish you nothing but the best. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "108750194863716400431", "name": "e c", "time": 1594255293215, "rating": 5.0, "text": "Nice", "pics": null, "resp": {"time": 1598880456093, "text": "Nice! THAT is so cool I'm going to tell my wife about this one. THANK YOU! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "111221493145599867447", "name": "Dustin Dadd", "time": 1567955361583, "rating": 5.0, "text": "Best in the business", "pics": null, "resp": {"time": 1568049189002, "text": "Thank you, David, for letting us take care of you. We appreciate you as much as you appreciate us. ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "118397378157549850111", "name": "Drama Baby’s", "time": 1565475867180, "rating": 5.0, "text": "Amazing....", "pics": null, "resp": {"time": 1566420487545, "text": "Wow! Thank you LayLay! Just … THANK YOU! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "117353932842762829422", "name": "Gay Campbell", "time": 1572398994514, "rating": 5.0, "text": "Excellent", "pics": null, "resp": {"time": 1572623927439, "text": "Very kind! Thank you! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "116662350584586485493", "name": "Douglas Dyar Jr.", "time": 1529612450769, "rating": 5.0, "text": "Thank you Russell", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "103898603255668286287", "name": "Michael Chunn", "time": 1511456229377, "rating": 5.0, "text": "Professional and friendly", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "114198234793193017362", "name": "Ben Tipton", "time": 1542154345567, "rating": 5.0, "text": "Pretty good legal services", "pics": null, "resp": {"time": 1555695624936, "text": "Thanks Ben! ~ Russell"}, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "104517042143286199355", "name": "Hyper Explorer", "time": 1520737755387, "rating": 5.0, "text": "Get this lawyer, Blackwell  .", "pics": null, "resp": null, "gmap_id": "0x886214b5eb6aa54b:0x60d777fdf93ee41a"}
{"user_id": "104802436380625202572", "name": "jason grantham", "time": 1599275368932, "rating": 5.0, "text": "Highly recommend!! Very professional, and easy to talk to. They actually take time to explain things and listen as well. Two thumbs up!!", "pics": null, "resp": {"time": 1599576674704, "text": "Thank you Jason, for the opportunity to represent you."}, "gmap_id": "0x889293aa63485577:0x3924fe72b070382d"}
{"user_id": "116329889988890747155", "name": "Tec Tony", "time": 1543511405095, "rating": 5.0, "text": "Cam & Kaz are great to work with & really know there stuff when it comes to tax laws bankruptcy, living wills. The best part is they don't treat you like a number or a paycheck. They treat you like a person. They will both site down and with and explain all the options you have, so you can make a well informed decision.", "pics": null, "resp": {"time": 1553721746987, "text": "Thank you!"}, "gmap_id": "0x889293aa63485577:0x3924fe72b070382d"}
{"user_id": "106394610950008531716", "name": "Aaron Gartlan", "time": 1575762311966, "rating": 5.0, "text": "Cam Metcalf is a true friend in our community and trusted legal advisor in business and estate planning law and financial matters. I gladly refer clients to Cam on a regular basis.⚖️", "pics": null, "resp": null, "gmap_id": "0x889293aa63485577:0x3924fe72b070382d"}
{"user_id": "101869380722082337567", "name": "Courtney Quinn", "time": 1560883844353, "rating": 5.0, "text": "Highly recommended attorneys who care about the clients they help.", "pics": null, "resp": {"time": 1567187551855, "text": "thank yo so much"}, "gmap_id": "0x889293aa63485577:0x3924fe72b070382d"}
{"user_id": "102932560093225843725", "name": "Christopher Calvin Reid", "time": 1560884028440, "rating": 5.0, "text": "They come highly recommended.", "pics": null, "resp": {"time": 1567187543756, "text": "Thank you"}, "gmap_id": "0x889293aa63485577:0x3924fe72b070382d"}
{"user_id": "107705895886001194379", "name": "Katlin Anderson", "time": 1502988463998, "rating": 5.0, "text": "The attorneys and staff always go out of their way to make sure an already difficult time is made as easy as possibly. They always have their clients best interest at heart and strive to help in anyway possible.", "pics": null, "resp": {"time": 1553715240800, "text": "Thank you!"}, "gmap_id": "0x889293aa63485577:0x3924fe72b070382d"}
{"user_id": "117962847686830747592", "name": "Hayden Lee", "time": 1502748897081, "rating": 5.0, "text": "So nice and helpful, and they always have YOUR best interest in mind, not their pocketbook's", "pics": null, "resp": {"time": 1553715269731, "text": "Thank you!"}, "gmap_id": "0x889293aa63485577:0x3924fe72b070382d"}
{"user_id": "112610788643880651915", "name": "Cassie Meadows", "time": 1502824830988, "rating": 5.0, "text": "Understanding attorneys and staff who are always willing to help in anyway they can.", "pics": null, "resp": {"time": 1553721765168, "text": "Thank you!"}, "gmap_id": "0x889293aa63485577:0x3924fe72b070382d"}
{"user_id": "106882428190066316450", "name": "Maury Mitchell", "time": 1515275862201, "rating": 5.0, "text": "Superb attorneys. Among other areas of expertise, Will O’Rear specializes in helping a person going through a divorce that has to deal with mental health issues in their spouse.", "pics": null, "resp": null, "gmap_id": "0x888e81daee5729e3:0x1ad2f74aeb856210"}
{"user_id": "108956492838397783134", "name": "Joshua Hembree", "time": 1421160533255, "rating": 5.0, "text": "Larry Sasser and Will O'Rear are two of the best attorneys in the state, in my opinion. In my dealings with them they were nothing but professional, competent, kind, and understanding. I highly recommend them to anyone with a legal need in Alabama!", "pics": null, "resp": null, "gmap_id": "0x888e81daee5729e3:0x1ad2f74aeb856210"}
{"user_id": "117879631411463296008", "name": "Codey Cherry", "time": 1500728843904, "rating": 5.0, "text": "Will O'Rear is an excellent attorney. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888e81daee5729e3:0x1ad2f74aeb856210"}
{"user_id": "102632774999082811768", "name": "Patrick Lindsey", "time": 1570243194228, "rating": 5.0, "text": "Great lawyers!", "pics": null, "resp": null, "gmap_id": "0x888e81daee5729e3:0x1ad2f74aeb856210"}
{"user_id": "109315383984394486353", "name": "Thomas Collins", "time": 1420825225236, "rating": 5.0, "text": "Hands down the very best Montgomery Alabama Personal Injury and Family Law lawyer Attorney! They helped me in many other areas such as Pike Rd Mediation and Estates services.", "pics": null, "resp": null, "gmap_id": "0x888e81daee5729e3:0x1ad2f74aeb856210"}
{"user_id": "117838969976532691459", "name": "Sandra Alexander", "time": 1608356169987, "rating": 5.0, "text": "Jared is honest, fair, completes his tasks and very caring. I met him while searching for an attorney through phone calls. Have always used his services since. I lucked out!", "pics": null, "resp": null, "gmap_id": "0x889a6cf22ddd7bdb:0x44c2165828bfe74d"}
{"user_id": "101790624165324792477", "name": "Kyle Davis", "time": 1557511274682, "rating": 5.0, "text": "Jared and his staff handled my case exceptionally well. Jared demonstrated professionalism, content knowledge, attention to detail, as well as compassion throughout my case as it was a very hard and trying time for my family. He helped me navigate the sometimes confusing place that is family court and stayed with it with conviction every step of the way. I would recommend Jared to anyone in need of an great lawyer but even better man.", "pics": null, "resp": null, "gmap_id": "0x889a6cf22ddd7bdb:0x44c2165828bfe74d"}
{"user_id": "111128161248748575216", "name": "Diana Abbott", "time": 1619874901127, "rating": 5.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x889a6cf22ddd7bdb:0x44c2165828bfe74d"}
{"user_id": "100840171251428303233", "name": "Julie Francoeur", "time": 1577105330468, "rating": 5.0, "text": "Very nice and thorough attorney", "pics": null, "resp": null, "gmap_id": "0x889a6cf22ddd7bdb:0x44c2165828bfe74d"}
