{"user_id": "102619139605829854724", "name": "Gary Jones", "time": 1623076275809, "rating": 2.0, "text": "I scheduled appointment to quote 7 separate electrical improvements in my house. They contacted me the day of appointment to ask to reschedule. We rescheduled for two weeks out. After calling in late to work to be present for an 8:00 appointment, I waited until 9:30. No show. I called the home office number. They explained that there was a circumstance that made them late; didn't know when they would arrive. I cancelled the appointment and will use another company that showed up the first time, on time. I gave two stars because Mr. Electric was recommended. Can't be all bad. But, really need to work on communication.", "pics": null, "resp": {"time": 1623078348355, "text": "Gary, we do value your time and regret that this was your experience. Customer service is always a top priority at Mr. Electric, and while we have fallen short in this instance, we do appreciate your feedback and will make adjustments on our end so that we are able to better serve our customers going forward. Thank you."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "100067580390410000901", "name": "Rosie Smoots", "time": 1595004944534, "rating": 5.0, "text": "I’m SO pleased with their service!!! I wanted to install a ceiling fan on my covered porch. I contacted my regular electrician and after waiting a week and a half, I was told it can’t be done. I then contacted a second electrician and was told it can be done but the wires won’t be hidden and it will be “very unsightly”.  I decided to try Mr. Electric because the quote was free and timely. David Hurley came out within an hour of me calling and gave me a fair estimate. Less than 48 hours later I’m now enjoying my new ceiling fan (with no exposed wires) on my covered porch!!!! The job was quick, he explained my warranties AND he cleaned up after himself which I was not expecting! I’d recommend Mr. Electric for any of your electrical needs. 5-stars", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNqpkqnIgvR_MZIP9v1HKlvdL_rqn3pJDf83jCk=w150-h150-k-no-p"]}], "resp": {"time": 1595184577571, "text": "That is great to hear, Rosie! We appreciate your comments and are glad to hear you are enjoying your porch even more with your new fan. Thank you for your business, and let us know if there is anything else we can do for you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104346404322517679439", "name": "James Ocallaghan", "time": 1616718520025, "rating": 5.0, "text": "Electrician was on time (Mitch Davis) completely inspected all electrical systems in my home. Updated all switches, etc. to code. Updated the outside panel box. Technician was very knowledgeable and did not stop until all was completed. I have dealt with other electrical people in the past but I find this Company to be very fair and efficient. A job well done. Without hesitation, I would recommend Mr.Electric to everyone who has electrical work in their home.", "pics": null, "resp": {"time": 1616721037080, "text": "We appreciate your comments, James. Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "101019162352161705193", "name": "Chlora Evans", "time": 1622126598583, "rating": 5.0, "text": "The Serviceman was VERY helpful. He explained what and why I needed to have done in order for electrical service to be restored after a recent storm. The charges were reasonable and affordable and the work was started the same day. THANKS to all the people who were involved in restoring my power and faith in service people. You make doing business with your company a pleaser. Keep up the GREERAT work.", "pics": null, "resp": {"time": 1622139860735, "text": "Chlora, those are kind words, and we appreciate your feedback. We are glad we were able to get your power restored after the storm. Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "106506304649906991813", "name": "Jessica Joyner", "time": 1517881286561, "rating": 5.0, "text": "First off I was looking on Home Adviser for an electrician. I hadn't even fully completed my search and I was receiving a call from Mr. Electric to see what I needed done and when I wanted them to come out and get a free estimate. Yes! I said, \"free estimate.\" That same day, an electrician was sent out and gave me quotes on all my projects. Electrician did not pressure me to do any projects that day and I was able to take 3 weeks and save up the money that I needed to get the project done. The day the electrician came out, he went above and beyond! I will use this company again and again!!!!!!!!! Thank you!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPiOX7kiFLrO6F4Kr_kf_dZINqmLTw5CZPV3Ks1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN6MRm_Bqvzpmdq4vQyV_Dm8ZdSN4oYZh6szGcE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPbSUcFnpmJFQkzVjRdsfaTrovq21dvOWFBJLKM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMLZbUkchAtP4VtvqSszav8TIE-Oq9MDocHUPc5=w150-h150-k-no-p"]}], "resp": {"time": 1520365574698, "text": "Ms. Joyner,\n\nWe value each and every customer here at Mr Electric of Montgomery and we so\n\nappreciate your business! My words can't fully express how much it means to us to\n\nhear from customers like you who know how valuable good service is these days.\n\nThank you for your trust!\n\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "117082433041555008976", "name": "Thad Aldridge", "time": 1616110136266, "rating": 5.0, "text": "Incredible service. Mitch did an inspection of the entire house and recommended several items that would prevent time and money spent later. He explained each aspect of the work, and never rushed me. I took his recommendations and called in someone so they could complete the job that day. I will use Mr. Electric forever.", "pics": null, "resp": {"time": 1616114932427, "text": "Thad, we appreciate your comments and are so glad to hear that you are please with everything. Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "102976661173300421774", "name": "Tamara Lewis", "time": 1620157439992, "rating": 5.0, "text": "Mr. Electric your technicians were professional, matter-of-fact and patience in showing me more than I called them out here for. As a matter of fact, the over look of my safety is something I always wanted to have done when it came to my electric service on my home. Especially, since this is an older home and I noticed times, my lights in areas flickers. I thought this kind of inspection would cost a fortune, so I'm glad today it was finally done. Now, I know! As soon as, I save the money I will call you Mr. Electric, I would like those same two technician to come back, because they were so kind and jumped on the straight to the issues I been concern about for years. One even locked my door back for me. How nice.", "pics": null, "resp": {"time": 1620171623073, "text": "Thank you, Tamara! We are so glad to hear that you were so pleased with your service call. When you need us to come back, we are just a phone call away. We appreciate having you as a customer."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "118011373337441247601", "name": "Les Andrew", "time": 1612208701289, "rating": 5.0, "text": "These guys are phenomenal. We had such an amazing experience with Mr. Electric and will be using them in the future for any electrical needs. We have had a hard time finding good service on various hour projects, and this company was like a breath of fresh air! Highly recommend!", "pics": null, "resp": {"time": 1612296431773, "text": "Great to hear, Les! We appreciate your comments. Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "101892100271827943164", "name": "Kelli Pohlman", "time": 1620055875781, "rating": 5.0, "text": "This company was half the price of another competitor and did an even better job! I was very pleased with the service, result, and price.", "pics": null, "resp": {"time": 1620066614238, "text": "We appreciate your comments, Kelli! Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103456519289440997943", "name": "Catherine Ridling", "time": 1621650682578, "rating": 5.0, "text": "They were very quick to respond, and replaced the wire to my outbuilding\nQuickly and efficiently, for a very reasonable price.", "pics": null, "resp": {"time": 1621822024878, "text": "We appreciate your comments, Catherine, and are pleased to hear that you were happy with your service. Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "112448708996185450809", "name": "Maria Owens", "time": 1617280401942, "rating": 5.0, "text": "He was very respectful and had excellent customer service. We will definitely use your company again.", "pics": null, "resp": {"time": 1617297203315, "text": "Thank you, Maria! We appreciate your comments and are glad to hear that you were happy with your service call. Have a great day!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "111614494448090786421", "name": "Linda Ware", "time": 1621886008144, "rating": 5.0, "text": "Great work. Affordable prices!", "pics": null, "resp": {"time": 1621911371502, "text": "Thank you, Linda!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "107311029172708558576", "name": "Eddie Warren", "time": 1615098421099, "rating": 5.0, "text": "Mr. Electric is very professional and perform high quality work.  I will definitely be using them again in the future!!", "pics": null, "resp": {"time": 1615225684625, "text": "Thank you, Eddie! We appreciate your comments and we are glad to have you as a customer!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "109147436317041029133", "name": "Cornesia Lewis", "time": 1615401612670, "rating": 5.0, "text": "I was able to get an appointment the next day after Dixie electric failed to show up made appointment few days prior no call/no show. Highly recommend this company , Mitch was awesome, he got in and got the job done.", "pics": null, "resp": {"time": 1615556919596, "text": "We are so glad Mitch could get you taken care of, Cornesia. Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "116595709822541793681", "name": "cmiller4au", "time": 1601326362954, "rating": 5.0, "text": "Great experience!  Our provider was professional and efficient.  He even called a day early and said he had time if I wanted him to come on.  Wonderful service, from the sweet lady who took my call to the quickly and reasonably priced repair!", "pics": null, "resp": {"time": 1601393678217, "text": "We appreciate your comments! Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "109245196765702964129", "name": "Gina Mills", "time": 1597881173428, "rating": 5.0, "text": "We needed to have our breaker panel inspected. The woman that answered the phone was polite and helpful. They were able to have someone come over the next day. Mr. Rudder gave us a courtesy call to let us know when he'd be here and he was on time. He was professional, thorough and courteous in his service. Thanks Mr. Rudder for doing a good job! I would definitely recommend Mr. Electric.", "pics": null, "resp": {"time": 1605470726546, "text": "We appreciate your comments, Gina! Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "117773608684574562949", "name": "Mark Lively", "time": 1600738575580, "rating": 5.0, "text": "I called Mr.Electric to give me a price quote on outdoor security lighting and they sent Mr. Justin Walker over and after taking to him for a few minutes I knew right off that he is a professional and knew exactly what I wanted and explained to me exactly what he was going to do to install it,after installation he explained the operation of the system ,when I pulled up to my hom tonight it was exactly what I wanted to see very well illuminated and very professional looking job,the price was very affordable also,Thank you Justin for your professional work!!! We love it!! Thank you Mr.Electric for having professional and polite employees.", "pics": null, "resp": {"time": 1600744775852, "text": "That is great to hear, Mark! We appreciate your comments and will pass them along to Justin's supervisor. We thank you for choosing Mr. Electric."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "116188492204829349088", "name": "Charles Adams", "time": 1602111364878, "rating": 5.0, "text": "I called on MR Electric to install a new thermostat and doorbell for a rental home that I manage.  Mitch Davis was able to schedule me in the next day and was very professional.  Always wearing protective wear every time he entered the house.  He did a great job and I will call on him again in the future.", "pics": null, "resp": {"time": 1602116004591, "text": "We appreciate your comments, Charles, and are glad Mitch could get you taken care of.  Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "101859264983574586973", "name": "Vivian Chestnut", "time": 1600980829561, "rating": 5.0, "text": "Mr. Davis, licensed technician, arrived before time, after calling 1st, and did an excellent job installing 2 fans in a very short period of time. After determining 1 fan had to be replaced, I purchased it online; and Mr. Davis picked it up.\nIn addition to the excellent service, he was a\"true\" professional!", "pics": null, "resp": {"time": 1600993208818, "text": "We appreciate your comments, Vivian. Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "113545947569618960489", "name": "Bettye Hodrick", "time": 1596839466091, "rating": 5.0, "text": "VERY,  VERY  GOOD SERVICE'S,  VERY RESPECTFUL,  NOT VERY  HIGH  PRICED,  GOOD PERSONALLY,  I TOLD  ALL MY FRIENDS AND FAMILY  ABOUT  YOUR SERVICE.  YOUALL GIVE DISCOUNTS  TO SENIORS CITIZENS  ALSO. I WILL HIRE  YOU'RE  AGAIN  ANY  TIME  I NEED A ELECTRIC  JOB  DONE.  YOU'LL  ARE THE BEST  IN MONTGOMERY.  EXCELLENT, LL I CAN SAY.. THANK  YOU  FOR  YOUR  SERVICE..!!", "pics": null, "resp": {"time": 1596839961106, "text": "Thank you, Bettye! It makes us happy to know that you were so pleased with our service!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103759798790065839824", "name": "Cheryl Davitz", "time": 1597424925179, "rating": 5.0, "text": "I had neighbors tree fall in driveway and it damaged wires running to my outside power box. Thomas Rudder was my electrician. He was professional and took care of getting my power restored as soon as possible working with power company and the people who came to remove the part of tree in my yard. I will call this company again if I need anything electrical done.", "pics": null, "resp": {"time": 1597616997657, "text": "Thank you, Cheryl! We are sorry about the damage the tree caused you, but we are glad we could get you taken care of."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "116130839197093869876", "name": "Yahnira Backus", "time": 1595008581676, "rating": 5.0, "text": "I was worried that it was going to cost too much to fix our electrical issues with our home. However, the electrician answered all of my questions and we were able to get ALL of our issues resolved within our budget! He was professional and friendly!! An added bonus! I will definitely use Mr. Electric again, and I recommend it for anyone wanting to sell their home!!", "pics": null, "resp": {"time": 1595184654939, "text": "We appreciate your comments, Yahnira! Thank you for your business, and let us know if there is anything else we can do for you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "112391564560170493223", "name": "Joel Lawson", "time": 1603121098344, "rating": 5.0, "text": "Very friendly and knowledgeable service! Patiently answered all of my questions. Highly recommended.", "pics": null, "resp": {"time": 1603121738132, "text": "Thank you for your comments and for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "101284082162694347617", "name": "Cheryl Westlake", "time": 1596749733966, "rating": 5.0, "text": "On my first call in, I was able to promptly schedule a technician to come do the job we needed. The technician, Mitch, called us when he was on his way, showed up exactly when he was supposed to, explained exactly what he needed to do and how much it would cost, allowed us to approve that before getting to work, and then immediately performed the work quickly and efficiently. You won't find better service anywhere. I will definitely be using them again for any further electrical needs.", "pics": null, "resp": {"time": 1596804757170, "text": "Thank you, Cheryl! We appreciate your comments and we are glad Mitch could get you taken care of. If you need anything in the future, we’re just a phone call away!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108585840715180800421", "name": "Tegan Frazier", "time": 1600524417408, "rating": 5.0, "text": "We called another electrician that never showed up to repair our issue. Then, we called Mr. Electric and they came the very next day. The electrician with Mr. Electric arrived on time, came wearing a mask and shoe covers, completed the work, and he was very professional. I highly recommend Mr. Electric.", "pics": null, "resp": {"time": 1600554048871, "text": "Glad we could get you taken care of, Tegan! Thank you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "105096234536462069967", "name": "Lorene Collins", "time": 1593032951380, "rating": 4.0, "text": "The Technicians were friendly and knowledgable. They provided information(prices and exactly what needed to be fixed)that I as homeowner needed to know. This job have been on my to-do list for a few years now. I am a retired homeowner who live on a budget but thank you so much for good service and I will recommend your service to my friends and neighbors.", "pics": null, "resp": {"time": 1593184101834, "text": "Thank you, Lorene! We appreciate your comments. Let us know if there is anything else we can do for you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "100617846307210632427", "name": "Todd Swale", "time": 1620341077294, "rating": 5.0, "text": "Professional, detailed oriented, clean at completion", "pics": null, "resp": {"time": 1620343342677, "text": "Thank you, Todd!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108963380868059369872", "name": "Joyce Davis", "time": 1598918408780, "rating": 5.0, "text": "Mitch, technician did a fantastic 👏  job. Very professional and knowledgeable about the items that needed to be repaired.", "pics": null, "resp": {"time": 1598928623314, "text": "Great to hear, Joyce! We will pass your comments on to Mitch's supervisor. Thank you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "116254377911226042736", "name": "Mickey Andrews", "time": 1576174902563, "rating": 5.0, "text": "Quick response to the electrical issue with our oven wall unit. Quality work and reasonable cost. Good customer service and attitude from both office staff and electrician. Signed up for their Advantage Plan and will certainly call on them again when need arises.", "pics": null, "resp": {"time": 1576200979154, "text": "Thank you, Mickey! We appreciate having you as a customer!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108647579327454837073", "name": "Kelly Barganier", "time": 1582600542537, "rating": 5.0, "text": "Very impressed with their service. I had an emergency and they were able to come to my house within 30 minutes of calling. The technician was very knowledgeable and assessed and fixed the problem quickly.", "pics": null, "resp": {"time": 1582744540935, "text": "Thank you, Kelly! We are so glad we could get you taken care of!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "116108323722683767820", "name": "TheJeffrey575", "time": 1575579038819, "rating": 5.0, "text": "After scheduling a job I was notified the day before the scheduled electrical work to remind me the electrician was coming and the time within 30 minutes. The electrician showed up right on time ready to estimate the job. After we agreed on the costs the electrician was ready to get started right then! We were used to a contractor estimating a job and notifying us, sometimes a few days later, when they could start work. Not the case with Mr. Electric! The electrician was ready to start.\n\nAs the job progressed we needed to make a few changes, so the electrician re-estimated the cost and we were ready to go. The electrician asked me about fire alarms and CO sensors. Our fire detectors were almost 35 years old so we added them to the job.\n\nAll the commercial stuff is good, but the electrician was outstanding! They were very responsive to our comments. I have worked thousands of contractors in my work life and now in my retirement. The skill and quality of the electrician's work was simply beautiful. I will definitely call Mr. Electric for my next work.\n\nMy only concern was the local franchise was sold to another company so the calls to and from Mr. Electric are not local so I had to be \"expecting\" a call to keep from looking at the strange numbers and not consider them as robocalls.", "pics": null, "resp": {"time": 1575582770900, "text": "Wow! With all of your experience, that is quite an endorsement. Thank you so much! Customer service is a top priority here at Mr. Electric and we are so glad to hear that we exceeded your expectations. We appreciate your business."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108649577357664519521", "name": "John Keltner", "time": 1586886980478, "rating": 5.0, "text": "Electrion was fast courteous did a clean job and followed up to make sure everything  was working to my satisfaction. I would recommend the company.", "pics": null, "resp": {"time": 1589827567206, "text": "Thank you, John! We appreciate your feedback."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103586616176193313336", "name": "Wanda L Hemphill", "time": 1590068219999, "rating": 5.0, "text": "We are very pleased with the work and help that was given also we are going to ask for help in the future for rest of our electrical work from Mr Electric, again many thanks Mr and Mrs Hemphill .", "pics": null, "resp": {"time": 1590163543728, "text": "We ❤️ happy customers! Thank you for your comments. Let us know if there is anything else we can do for you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "109271769742438053756", "name": "Ashley Thomas", "time": 1573838489531, "rating": 5.0, "text": "Best experience. Service was fast and professional. I was pleased that the primary goal of the technician was to make sure everything was safe in my home and working property.", "pics": null, "resp": {"time": 1573854222124, "text": "Great to hear, Ashley! Thank you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "113282723684155340735", "name": "Ti Funn", "time": 1559242371775, "rating": 5.0, "text": "David is not just a top notch electrician he is the kindest person I've met while stationed in Montgomery. I appreciate the assistance from this company and the professionalism that made it easier for me to move onto my next duty station. Thanks again.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "105000969400921847793", "name": "TJ Amadore", "time": 1589464589461, "rating": 5.0, "text": "These guys right here! Prices are fair. Called them out for some work and had a bad experience with the technician. Not only did they fix the issues, they went so above and beyond to please me! I recommend them highly to everyone for all electrical needs.", "pics": null, "resp": {"time": 1574873863176, "text": "Thank you, TJ! We are glad we could get you taken care of. Customer service is a top priority here at Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104002578097395942725", "name": "Amy Benedict", "time": 1590703783640, "rating": 5.0, "text": "Fast and professional,  job done quickly at reasonable rate. Thank you. ab", "pics": null, "resp": {"time": 1590710221093, "text": "Great to hear, Amy! We appreciate having you as a customer. Thank you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "114413240610705419830", "name": "Melissa Smith", "time": 1590274049359, "rating": 5.0, "text": "Top quality, professional staff that are all about their customers for a reasonable price.", "pics": null, "resp": {"time": 1590419294542, "text": "Thank you, Melissa!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "107224768166396805035", "name": "Howard Floyd", "time": 1572107487285, "rating": 5.0, "text": "Very kind and respectful of customers. Excellent customer service and great ways to pay for services. Excellent company. Forever my go to company for electrical work.", "pics": null, "resp": {"time": 1572302305467, "text": "Thank you, Howard! We appreciate having you as a customer."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104367530778605636559", "name": "L LUCKY", "time": 1570300220584, "rating": 5.0, "text": "2d time we've had Mr. Electric out to our residence.\n\nThis time for them to install 2 ceiling fans in our living room with a 25 foot ceiling.   They had to rent a lift to get up there.\n\nOur tech, Mr. Thomas Rudder did an outstanding job, not only taking extra special care to NOT leave a single scratch on our newly installed laminate wood floors, but also by getting us out of a bind when the down rods we were sold wouldn't work with the fans we purchased.\n\nThey quickly sourced, painted to match, & got our fans up.\n\nGreat job & Mr. Electric, mr. Rudder, you will get our future business!\n\nI highly recommend this business.", "pics": null, "resp": {"time": 1570477079148, "text": "We are glad we could get you taken care of and appreciate your business. If you need anything else, we are just a phone call away!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103726747825938502445", "name": "Tim Babb", "time": 1584663689774, "rating": 5.0, "text": "Service was wonderful, David came on time and did a wonderful job installing a 14-50 plug. I would highly recommend David from Mr. Electric.", "pics": null, "resp": {"time": 1584729494840, "text": "Thank you, Tim! We are glad David could get you taken care of and will pass your review on to his supervisor."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "102625673393383798153", "name": "Chris Hopson", "time": 1600895550484, "rating": 5.0, "text": "Great job repairing electrical pole on house that was damaged by fallen tree limb.", "pics": null, "resp": {"time": 1600966264967, "text": "Thank you, Chris!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "116969776293058729412", "name": "Robert Tigue", "time": 1608996657041, "rating": 5.0, "text": "Professional service..", "pics": null, "resp": {"time": 1609352334156, "text": "Thank you, Robert!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "100565518502885641780", "name": "Curt LaFond", "time": 1570226776380, "rating": 5.0, "text": "Mr. Electric quickly replied to my request for a quote, scheduled an appointment for just a few days later, arrived promptly on time, and Ken did the work in a very professional manner. We're very happy with Mr. Electric.", "pics": null, "resp": {"time": 1570241045715, "text": "Glad we could get you taken care of, Curt! Thank you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "113342370486996799958", "name": "Donna Aldridge", "time": 1592430326167, "rating": 5.0, "text": "I'm happy happy happy with our experience with Mr. Electric and the technician David. Will use again👍👍👍", "pics": null, "resp": {"time": 1592492838384, "text": "We are happy happy happy to hear that, Donna! Thank you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "102767027422502256503", "name": "Marilyn Johnson", "time": 1518743202900, "rating": 5.0, "text": "I am so glad I called Mr. Electric! They responded quickly and  are very reasonable. I am very pleased with all the electrical work Zach Kelley of Mr. Electric has completed. He is very knowledgeable, courteous, and  problem solver with all the various tasks I presented. I would definitely recommend Mr. Electric. Marilyn Johnson", "pics": null, "resp": {"time": 1520363167417, "text": "Mrs Johnson,\nThank you so much for giving us the opportunity to serve you! We really appreciate your wonderful review and look forward to providing you service in the future.\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108868603785037876381", "name": "Leslie Cox", "time": 1558712575212, "rating": 5.0, "text": "Fantastic service! We put in an order to get a pricing for a job.. he gave us a fair price and did the work the same day. Terry had Excellent customer service and the work was fantastic!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "105476243039648584153", "name": "Mike Mason", "time": 1575571053272, "rating": 5.0, "text": "Mr. Electric of Montgomery service representative, Thomas Rudder, diagnosed my service needs thoroughly. His explanation of the work he would do was easy for me to understand and he answered my questions without hesitation. The work was completed in a timely manner, with cleanup performed when it was done.\nI will be requesting Thomas for the future work I need.", "pics": null, "resp": {"time": 1575582302246, "text": "Thank you, Mike! We are glad to hear that Thomas could get you taken care of, and we will pass your kind words on to his supervisor. We appreciate your business!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "115058134854452696752", "name": "Jeff Bryant", "time": 1558555157478, "rating": 1.0, "text": "I was feeling the pressure from my renter to get an electrical issue fixed quickly and called a few places and got a much better quote after committing to Mr. Electric. I told them about my cheaper quote but they would not adjust the price. They were 3 times more expensive than First Electric of Prattville. They did a good job but are way overpriced.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "110870106297500338765", "name": "Carrie Stark", "time": 1549467550393, "rating": 5.0, "text": "Thomas was very friendly and professional. Very quick at responding and getting us scheduled. Would definitely use them again.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "112880277465481071607", "name": "Shirley Weeden", "time": 1525196358405, "rating": 5.0, "text": "Thomas Rudder was very efficient, knowledge and timely. Had three lights replaced with pendant lights that he put together and installed. He did a great job and I will definitely use him again.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "107748148809356726302", "name": "Vanessa Freeman", "time": 1540075651794, "rating": 5.0, "text": "David was technician. He arrived ahead of schedule fixed our outlet and gave us a quote for future work. David was nice and very knowledgeable. Will definitely be using Mr Electric again.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "111010671808408922618", "name": "Kenny Roberts", "time": 1522850735158, "rating": 5.0, "text": "Zach did an outstanding job, showed up on-time, and even recommended alternative options to save on the overall bill.  Very professional.  Will definitely use again in the future.", "pics": null, "resp": {"time": 1522957305149, "text": "Mr Roberts,\n\nOur guys here at Mr Electric enjoy their work and we're very fortunate to have Zack as part of our team!\n\nWe appreciate your wonderful review and for putting your trust in Mr. Electric of Montgomery.\n\nDan Black\nOwner\nMr Electric of Montgomery, Ala"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "100774266371328990963", "name": "Carol Horne", "time": 1551740144608, "rating": 5.0, "text": "David and his crew were great.  Showed up on time, did the required work and did it in less time than estimated.  I recommend Mr. Electric to everyone I know who need an electrician.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "118046818449367997423", "name": "Keely Jones", "time": 1506693749889, "rating": 5.0, "text": "Steve was GREAT!!  He was very professional and informative.  He took the time to explain what was needed and the process it would take to get the job done RIGHT!!  He was a joy to work with and I will definitely give Steve and Mr. Electric a call for all of my electrical needs.", "pics": null, "resp": {"time": 1506706608177, "text": "Ms Jones,\nI would like to take this opportunity to sincerely thank you for taking the time to give Steven and Mr. Electric of Montgomery such a wonderful review. At Mr Electric we strive to provide first class service to each and every customer! We really appreciate your business and look forward to serving you again in the future!\n\nWarm regards,\nDan Black\nOwner\nMr Electric of Montgomery, Alabama"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103039161462755512374", "name": "Blanche Martin", "time": 1510885843409, "rating": 5.0, "text": "Steven was professional  and pleasant, but most important, he listened to what we had in mind about our problem and gave us options on solutions.  It was actually an enjoyable experience with excellent, economical results!! We will certainly call Mr. Electric again!!", "pics": null, "resp": {"time": 1517346897612, "text": "Ms Martin,\nWe are so grateful for the opportunity to provide you expert electrical service in your home and hope to see you again in the near future! It's working with customers like you that inspire us each day!\nThank you for taking the time to give Mr Electric and Steven such a wonderful review!\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "113598666389331589155", "name": "John Henfey", "time": 1522163503963, "rating": 5.0, "text": "Had Zach K. come out to my home to look at an issue with my AC.  While the issue was related to the AC and not my electrical system, Zach was able to quickly diagnose the issue and identify the specific part that needed to be replaced by the HVAC specialist.  Zach was extremely professional, prompt and courteous!  A+++", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "101781903704192413406", "name": "Les Abernathy", "time": 1571854566038, "rating": 5.0, "text": "Skilled and hard working. Will always use whenever I need an electrician.", "pics": null, "resp": {"time": 1571924827950, "text": "Thank you, Les! We appreciate your feedback."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104546163235735678153", "name": "Lindsey Porter", "time": 1521053477939, "rating": 5.0, "text": "Zach Kelley did a fantastic job! We live in an older home that needed a breaker box installed. We also wanted to have a line put in so that we could install a garbage disposal. Zach did both of these tasks beautifully. He was also punctual, polite, and professional and I would certainly recommend him and will be glad to ask for him again.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "115811366910845783416", "name": "ImprovementToday", "time": 1524235704472, "rating": 5.0, "text": "Zach did his job and more! His level of service was superior! There are some things that only an electrician can do...and God. Either pay Mr. Electric now or wait until you can pay them. Do not cut corners with your electrical work.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "101747230274371316361", "name": "Emily Pritzel", "time": 1528404030088, "rating": 5.0, "text": "Zach Kelley came promptly and very professionally fixed our electrical issue. I would recommend him and would use him again!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "109900384443602355306", "name": "Carol Nowak", "time": 1524765983847, "rating": 5.0, "text": "This was my second time to use Mr. Electric.  The technician, Steve, did an outstanding job!  He was friendly, knowledgeable,  and went out of his way to explain exactly what he was doing.  Outstanding service - as usual.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108527694088339095284", "name": "Jamal Davis", "time": 1529550873606, "rating": 5.0, "text": "I received great service from the very first call, with Dana, until the call was completed by Steve. Steve was an absolute professional and has restored my faith in the service that can be received from a contractor. The price was also really good, I will definitely be calling again if there is a need and will recommend to all my friends.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "107870081647522855862", "name": "Phyllis Wilson", "time": 1498787039661, "rating": 5.0, "text": "As I have come to expect, I received courtesy and total attention to my problem.  I especially like the fact Terry came in and assessed the situation first, then decided on a course of action rather than just starting without knowing what was really required.  I will definitely recommend Mr Electric to anyone I know who needs a skilled, professional electrician.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "110701319742190565984", "name": "Suzanne Johnson", "time": 1528136532295, "rating": 5.0, "text": "I was wowed by their exceptional service! Zach Kelley was my service professional. He was very knowledgeable, efficient, and courteous. I will definitely call them for ALL of my future electric work.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "102680549663367193700", "name": "Colleen Catania", "time": 1608418265294, "rating": 5.0, "text": "We called Mr. Electric one afternoon when suddenly my outlets stopped working.  They were able to get Zach out here almost immediately.  He reviewed the situation, went over everything with me and had the immediate problem fixed the next morning.  They are wonderful!!!!", "pics": null, "resp": {"time": 1608574017957, "text": "Great to hear, Colleen! Glad Zach could get you taken care of. Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "105534641690485709682", "name": "Y B", "time": 1570149446177, "rating": 5.0, "text": "Knowledgeable, professional, courteous and honest! We highly recommend!", "pics": null, "resp": {"time": 1570200770400, "text": "Thank you for the feedback! We appreciate your business."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108763113552102659042", "name": "Jessica Flahive", "time": 1571094640852, "rating": 5.0, "text": "All I have to say is.....Mr. Ken is awesome!! He got us up back running asap!!! Thanks Mr. Electric for sending us Mr. Ken!!!!!👍", "pics": null, "resp": {"time": 1571246677641, "text": "Thank you, Jessica! We are glad we could get you taken care of!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "111482290685617898689", "name": "Sandy Newsome", "time": 1539389392640, "rating": 5.0, "text": "David and Patrick were on time. They worked diligently and as a team through the list of repairs explaining the process and reviewing the work at the end of each project. They were professional, courteous, honest and displayed a willingness to exceed expectations at all times. In an era when it is hard to find trained professionals, I cannot say enough about the workmanship, the attitude, and the friendliness of these professionals. Mr. Electric will be our electric company from this point on and - yes - we will request this team of professionals!", "pics": null, "resp": {"time": 1539440428717, "text": "Ms Newsome,\nThank you so much for your wonderful google review and for\ngiving Mr Electric of Montgomery the\nopportunity to provide your electrical\nservice needs. We look forward to providing you service again in the future.\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103686491064471630710", "name": "Victoria Cook", "time": 1519849787653, "rating": 5.0, "text": "Zach Kelley did a quick and great job with our electrical needs.\nWhen you need stuff done and done rightly quick, specifically ask for Mr. Kelley.", "pics": null, "resp": {"time": 1520365096960, "text": "Ms Cook,\nThank you so much for taking the time to give us your 5 star review!\nWe appreciate your business and hope to see you again in the future.\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "105921276815229284315", "name": "Whitney Teel", "time": 1521223044425, "rating": 5.0, "text": "We want everyone to know how pleased my husband, Roger, and I were to have a company call from Mr. Electric. I cannot say enough about our\nelectrician, Steven. He was able to fix a problem that my last electrician could not and was so courteous, and willing to explain everything to us.\nWe will only use this company from now on as we loved this electrician.\nMr. Electric you need to keep this young man as he represents your business with 5 stars!\nPenny and Roger Teel", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104943218109254043503", "name": "Greg Houser", "time": 1540299878814, "rating": 5.0, "text": "Fast Professional service! Clear explanation of the work done. Will definitely use again!", "pics": null, "resp": {"time": 1540306123022, "text": "Mr Houser\nThank you for the opportunity to provide service, and for taking the time out of your busy schedule to give us a great google review. We so appreciate your business and we look forward to providing you service again in the future.\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "112106350963986832244", "name": "Rhonda Miles", "time": 1490825881937, "rating": 5.0, "text": "Terry was very professional, extremely conscientious, and amiable; it was a pleasure doing business with him.  I appreciated him being thorough, even to the point of explaining electrical concepts to me, which I feel he did not have to do.  Oh, and his new apprentice, Benjamin, was a true credit to the younger generation.  FIVE STARS!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "109130636227742245982", "name": "Brenda Turner", "time": 1520171661420, "rating": 5.0, "text": "Steve Leavins was very professional and did a great job replacing our outside electrical panel and several smaller projects inside our home. Highly recommended.", "pics": null, "resp": {"time": 1520365261774, "text": "Mrs Turner,\nI can't thank you enough for your wonderful 5 star review and for giving Mr Electric of Montgomery the opportunity to serve you!\nWe hope to provide you service again in the future.\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "105276417702699749809", "name": "Brett Marchand", "time": 1539442204611, "rating": 5.0, "text": "Just had our technician come out. He was very quick and knowledge very friendly and was a breeze to deal with. Will be calling them for all my electrical needs.", "pics": null, "resp": {"time": 1539448299715, "text": "Thank you very much Mr Marchand\nFor giving Mr Electric of Montgomery the opportunity to serve you and for taking the time to give us such a great google review! We look forward to serving you again soon!\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "107992658028528345588", "name": "RONALD CAWLEY", "time": 1501261879787, "rating": 5.0, "text": "Great technician.  Knowledge first rate.  Attention to detail was greatly appreciated. Having Terry do this job was like having a friend coming over to do the work -- a friend with skills.  I will call Mr Electric again for my electric needs because of how Terry handled this job. PS:  I'm a cheap SOB but I found myself giving Terry a tip", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104002244363026724198", "name": "Stevie Holloway, Sr.", "time": 1552318376059, "rating": 5.0, "text": "Prompt and courteous service. Professional technicians. Excellent work.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "107972100728862901214", "name": "Shaunda Reaves", "time": 1487242717194, "rating": 5.0, "text": "I had a great experience. The staff was very friendly and professional. Everything was done with a spirit of excellence. Fast and efficient service!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "113782529243657491170", "name": "Suzanne Burns", "time": 1518576792053, "rating": 5.0, "text": "Wow, customer service, I thought it was a thing of the past.\nI had four little jobs for him to do, no problem.  One company wouldn't  even call me back.  Mr. Electric does not have a service charge just to drive in the driveway.\nWill be calling them back for all my electric  problems.  Thanks Terry Kirkland,\nWe are very happy with the work you did today for us.", "pics": null, "resp": {"time": 1520364769368, "text": "Ms Burns,\nIt was our pleasure to serve you! Thank you for your wonderful review and for giving us the opportunity to provide Expert Electrical Service in your home.\nWe look forward to providing you service again soon.\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103816558918738607194", "name": "james eady", "time": 1524608057639, "rating": 5.0, "text": "I had a very dangerous problem with my outside box causing power surges in my home. I got the number from the Dan Morris show and Greg's show Happy Hour. Within an hour and a half Steven Leavins was there to inspect and give and estimate for the job. By 2pm the next day Steven had totally rebuilt my outside box and added a total home surge protector. Fast and very good service. Price was good. Thanks you.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "109234961308605456432", "name": "Hannah", "time": 1500672483285, "rating": 5.0, "text": "Steven did a fantastic job installing a ceiling fan and some exhaust fans.  He was extremely professional and left the work area cleaner than it was when he started the work.  We would definitely recommend Steven and Mr. Electric for any electrical needs or service work in the river region area.  Thanks for doing such a great job Steven!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "112803053918557293147", "name": "Brenda Langley", "time": 1505857113110, "rating": 5.0, "text": "Very friendly and professional before during and after the service. They do exactly what they say they will do plus some. Definitely recommend them. Both electrician and office staff were great.", "pics": null, "resp": {"time": 1506707529236, "text": "Ms. Langley,\nThank you for your wonderful review! At Mr Electric of Montgomery we delight in working with customers like you each day! We appreciate your business and look forward to providing services again soon !\n\nWarm regards,\n\nDan Black\nOwner\nMr Electric of Montgomery, Alabama"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "106399308089512393374", "name": "Betsy Powers", "time": 1524070221585, "rating": 5.0, "text": "Terry did a great job. He didn't have everything he needed so he went out and got the breakers he needed. AFTER he replaced fuses outside he sealed the tops so water would not get in again. He explained it all simply so I would understand it. He also did work in the attic. I think Terry went above and beyond with the things he did for us. He had a great personality for working with customers.", "pics": null, "resp": {"time": 1524073021911, "text": "Ms Powers,\n\nThank you so much for your business and for the wonderful google review! It's a joy to work with homeowners like yourself who appreciate good quality service.\n\nBest regards,\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103952441912207286305", "name": "Candy", "time": 1522954637319, "rating": 5.0, "text": "What a great company!  ON TIME, polite, and informative - all around outstanding service from my initial phone call (Danna) to finishing the job   I was sent an email before the technician arrived so I would have a face with the name.  How many of you can say that about YOUR electrical company??  I highly recommend Mr. Electric!", "pics": null, "resp": {"time": 1522956736712, "text": "Candy,\nThank you so much for giving Mr Electric of Montgomery an opportunity to serve you!\nWe delight in working with homeowners like yourself.\n\nIt was so kind of you to take the time to write such a wonderful 5 star review. We love those googel reviews so that other potential customers can learn about Mr Electric.\n\nWe look forward to working with you again in the future!\n\nDan Black\nOwner\nMr Electric of Montgomery, Al"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108340897512766731190", "name": "Kim Stewart", "time": 1496365153015, "rating": 5.0, "text": "Professional. Friendly.  Knew what they were doing. Showed up when they said they were going to. Cleaned up when they were finished!  All qualities I appreciate in a contractor!  I highly recommend Mr. Electric!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103046007035766272066", "name": "Dustin Wallace", "time": 1528225709528, "rating": 5.0, "text": "Steven Leavins was my representative. I needed an outlet dropped in my house. He was really friendly and informed me that what I needed to have done to be up to code. He quoted me for 4 hours and sure enough he finished around 3.5. I had a little more labor intensive situation and he worked hard through the heat of the day to get it finished for me. I would absolutely use Mr. Electric and Steven again for any other service situation.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "100843927306335286966", "name": "Aly George", "time": 1523910860077, "rating": 5.0, "text": "Mr. Rudder was professional and friendly; he showed up on time and got the job done quickly. Would definitely recommend this company for your electrical needs.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "101822525181642787111", "name": "Jon Bulkley", "time": 1523143964814, "rating": 5.0, "text": "Can’t thank Dan and his crew enough for expertly taking care of a potentially dangerous situation with our service panel this week!\nElectrician Steve came out and made an assessment of the problem, and the appropriate remedy, including code upgrades and added protection for our home.\nWork was performed efficiently and professionally. In fact, Steve was able to complete the extensive repairs in a timely fashion so we did not have to vacate our home overnight.\nFrom customer care to service performed to value of service and follow up, Mr. Electric is one top notch company to have on your side.\nThanks for providing a premium service for this community.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104208041994817341767", "name": "Allure Amor", "time": 1520541536243, "rating": 5.0, "text": "The tech Zach Kelley did outstanding work! Would definitely referr anyone.!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108978003728701523968", "name": "Random. Potato", "time": 1527700664254, "rating": 5.0, "text": "zach at Mr.electric was very professional and nice and friendly. And very knowledgeable, trustworthy and I recommended him to anyone needing electrical service. They are truly the best company around. Sincerely, Mr Hinkle", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103788046843933440649", "name": "Chandler Hines", "time": 1539285319660, "rating": 5.0, "text": "I've used Terry a few times now and he is very professional.  He cleans up after he installs the lights so you would never know he was there!  Will call again for my next project.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103119976220651502599", "name": "Dianne Gantt", "time": 1541079971862, "rating": 5.0, "text": "Thomas did an excellent job!  Very good customer service!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "101142946065769951788", "name": "Greg Lucas", "time": 1549145326393, "rating": 5.0, "text": "Tony Wills is THE MASTER!!\nCalled mr Eletric to get a surge\nprotector, now my customers\nwhole house is protected from any damage from lightening or the power company. Tony was great to deal with,\nhe knows how to deal with older houses\nbuilt when they really knew how to build houses. Homes with plaster walls & ceilings, 99% of electricians don’t have a clue or even know what they are looking at or dealing with!! Tony simply gets it done & it is done right, very professional, he is short so he can get in the tight spots lol.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "116375549373527389205", "name": "Maria Johnston", "time": 1518017422188, "rating": 5.0, "text": "Project: Upgrade an Electrical Panel or Wiring\nZach Kelley from Mr. Electric provided 5 star, first rate service for replacing a fuse box with breaker boxes, adding junctions to old wiring in the attic, replacing plugs and switches, as well, but not limited to replacing two ceiling fans. The workmanship and attention to detail was exquisite. He was concerned with our safety and took his time to make sure everything was up to code. He was hard working, prompt, courteous, clean. We would definitely recommend Zach Kelley and Mr. Electric and we will definitely` be using them again for any electrical work needed.", "pics": null, "resp": {"time": 1520363743282, "text": "Mrs Johnston,\nOur customers like you are why we enjoy providing expert electrical service in the River Region. Thank you for your 5 star review and for putting your trust in Mr Electric of Montgomery.\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "117213272274593270748", "name": "Sigele Overstreet", "time": 1492881939072, "rating": 5.0, "text": "Mr. Electric responded quickly to my internet request for an appointment. The service professional, Steven showed up on time and accessed the job to give me a reasonable quote. Steven job completed in no time. Thank you!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "107661602620229148117", "name": "Eric Glass", "time": 1490907393842, "rating": 5.0, "text": "Steven with Mr. Electric did a great job installing 4 can lights in one room and a new box for a ceiling fan in another.  Well worth the price for the excellent professional job.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "111123862399443062840", "name": "Fran Carpenter", "time": 1506294094608, "rating": 5.0, "text": "Terry Kirkland with Mr. Electric diagnosed the problem with an old generator (that I had expected would have to be replaced) and repaired it.  It runs like new.  He saved me a lot of money and I really appreciate it.  The cost was reasonable for the service provided.  He also installed a whole house surge protector that I had wanted for a long time, but had no idea where to get one.  He was nice, knowledgeable and very professional.  Anyone who needs electrical work should contact Mr. Electric.", "pics": null, "resp": {"time": 1506707320212, "text": "Ms. Copeland,\n\nIt was a pleasure working with you to get your generator back up and running! Glad we could be of service! Thank you for taking the time to submit such a positive review for Terry and Mr Electric of Montgomery. Our company is blessed with dedicated and professional technicians that enjoy working with customers like you that appreciate expert electrical service.\n\nWe look forward to serving you and your family again in the future!.\n\nWarm regards,\n\nDan Black\nOwner\nMr Electric of Montgomery, Alabama"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "110212513042511461195", "name": "Glenn Johnson", "time": 1512589816221, "rating": 5.0, "text": "I'm in the process of  converting a single family residence to a duplex, and had to bring both sides up code.  After dealing with technicians that were always late or just didn't show up at all, it was so pleasant to finally do business with someone that did exactly what he said.  Thomas Rudder put the \"Customer\" back in \"Customer Service\".  He was pleasant, polite, always on time and most of all very knowledgeable of what it would take to pass inspection.  I can go on and on about my satisfaction in doing business with Thomas and Mr. Electric but I won't.  I don't usually take the time to complete a review but I had to give this business their due.  They earned it!  Btw, passed inspection the first time.\nGlenn Johnson", "pics": null, "resp": {"time": 1512595389479, "text": "Mr Johnson,\nWe really appreciate your 5 star review, it makes such a positive impression on potential customers and\nplays a significant role in growing our company! I also want to thank you for your business and we look forward to working with you again in the future.\n\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "110212513042511461195", "name": "Glenn Johnson", "time": 1512589816221, "rating": 5.0, "text": "I'm in the process of  converting a single family residence to a duplex, and had to bring both sides up code.  After dealing with technicians that were always late or just didn't show up at all, it was so pleasant to finally do business with someone that did exactly what he said.  Thomas Rudder put the \"Customer\" back in \"Customer Service\".  He was pleasant, polite, always on time and most of all very knowledgeable of what it would take to pass inspection.  I can go on and on about my satisfaction in doing business with Thomas and Mr. Electric but I won't.  I don't usually take the time to complete a review but I had to give this business their due.  They earned it!  Btw, passed inspection the first time.\nGlenn Johnson", "pics": null, "resp": {"time": 1512595389479, "text": "Mr Johnson,\nWe really appreciate your 5 star review, it makes such a positive impression on potential customers and\nplays a significant role in growing our company! I also want to thank you for your business and we look forward to working with you again in the future.\n\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "111396044489102741034", "name": "Christina Brown", "time": 1494134344445, "rating": 5.0, "text": "Steven Leavins was prompt and very professional!!! Would definitely recommend this company to others. Customer service was awesome!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "110335120368416863185", "name": "Judy Powell", "time": 1564861970909, "rating": 1.0, "text": "Called  to have exterior lighting  in front  and pool  area repaired. Was  charged  approximately  $300, and  neither  lighting  problems  was corrected.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "115234420037095734823", "name": "Al Smith", "time": 1528510869982, "rating": 5.0, "text": "Excellent, Excellent, Excellent, Excellent, Excellent\nWe are extremely happy with our service upgrade from 125 amp screw-in fuses to 200 amp circuit breakers in our home.  After three estimates, we chose Mr. Thomas Rudder with Mr. Electric.  We preferred his approach to solving our issues, his professionalism, and his clear and concise explanation of his solution to our problems.  The implementation was efficient with minimal down time.  Mr. Rudder went above and beyond to correct all issues.  His quote was commensurate with the competition and was honored as the final price.  It was indeed “Upfront Pricing”.  Categorically recommend Mr. Thomas Rudder and Mr. Electric for any electrical work.\nAl", "pics": null, "resp": {"time": 1528911533128, "text": "Mr Smith,\n\nWe can not thank you enough for giving us the opportunity to provide you service at your home and for taking the time to provide us such an amazing 5 star google review! Customers like you are why we enjoy our work so much at Mr Electric of Montgomery. We look forward to serving you again in the future!\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103748541405688575370", "name": "William Howell", "time": 1517341287130, "rating": 5.0, "text": "Service provided by Mr. Electric was nothing less that outstanding! After contacting Mr. Electric for an estimate for installation of an exterior outlet as well as installation of a lightpost, they showed up the same afternoon. I feel exceptionally lucky that Mr. Steven Leavins performed the estimate and also accomplished the job.  Steven was extremely knowledgeable, polite, and went out of his way to make sure we were happy with the end results of his efforts.  Mr. Electric is truly fortunate to have Steven representing their company, and I am extremely fortunate to have chosen Mr. Electric to handle my job!!", "pics": null, "resp": {"time": 1517345925454, "text": "Mr Howell,\nWe so appreciate you putting your trust in Mr Electric of Montgomery! Your kind words are such an inspiration! Our goal is to meet and or exceed our customers expectations each and every day.\nWe consider it an honor to provide electrical service to customers such as yourself.\nWe're very fortunate to have Steven as a member of our staff and appreciate his dedication to providing top quality service to our customers.\nThank you for taking the time out of your busy schedule to write such a wonderful review!\nWe look forward to serving you again in the future.\nDan Black\nOwner\nMr. Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "111224686215419558526", "name": "Alan Ward", "time": 1503358637720, "rating": 5.0, "text": "Try to get Steve, he's awesome.  Excellent work.", "pics": null, "resp": {"time": 1503490792510, "text": "Mr Ward,\n\nWe appreciate your business and your kind words regarding Steven.  Working with customers like you is what makes our job so enjoyable. We look forward to serving you again soon!\n\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "109849152417090979710", "name": "Anisum Yarrum", "time": 1609336150730, "rating": 5.0, "text": "Great", "pics": null, "resp": {"time": 1609352352438, "text": "Thank you, Anisum!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104177618270941749273", "name": "Swervin Kervin", "time": 1523309388320, "rating": 5.0, "text": "Quick response, quick repair.  Professnioal and courteous from first call to tech leaving!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "115807858265850700363", "name": "Richie Martin", "time": 1540296898138, "rating": 5.0, "text": "Great place do great work", "pics": null, "resp": {"time": 1540304710884, "text": "Thank you Mr Martin. We appreciate your wonderful review and the opportunity to provide service.\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "116764106262970925024", "name": "dustin duncan", "time": 1493080639806, "rating": 5.0, "text": "I had Steven come out and upgrade my outlet for the hot tub on my back porch. Very professional and price competitive relative to others I had price job.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "116764106262970925024", "name": "dustin duncan", "time": 1493080639806, "rating": 5.0, "text": "I had Steven come out and upgrade my outlet for the hot tub on my back porch. Very professional and price competitive relative to others I had price job.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108972600746315410860", "name": "Darntelle W.", "time": 1528902902061, "rating": 5.0, "text": "Awesome service, quick to respond and reliable", "pics": null, "resp": {"time": 1528911288334, "text": "Thank you for allowing Mr Electric of Montgomery to provide electrical services in your home. We really appreciate your business and the wonderful 5 star review! We look forward to serving you again in the future.\n\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108218548325278014203", "name": "Llyrr “OldManGames”", "time": 1528141610745, "rating": 5.0, "text": "Bought new ceiling fans from homedepot and they had mr. Electric call me to schedule a appt for estimate and install. They called very quickly, were nice on the phone and answered all my questions. The electrician Steven Leavins showed up on time and did great work with a very friendly attitude and was very patient and informative while explaining the wiring I had and different switch options. 10 out of 10 would recommend and use again for any of my future needs", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "114579882451264800203", "name": "Fred's on a Walkabout", "time": 1584468174644, "rating": 5.0, "text": "great tech. professional attitude and work habit", "pics": null, "resp": {"time": 1589384219554, "text": "Thank you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104553221594154102330", "name": "Angela P", "time": 1522964135441, "rating": 5.0, "text": "Great customer service and timely", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "117753604575202322231", "name": "edward nettles", "time": 1503067469519, "rating": 5.0, "text": "Excellent service, very professional.", "pics": null, "resp": {"time": 1503083136033, "text": "Mr Nettles,\n\nI can't thank you enough for being a loyal customer! At Mr Electric of Montgomery it's customers like you that make doing our job a pleasure. We look forward to providing you service again in the future!\n\nDan Black\nOwner\nMr Electric of Montgomery, Alabama"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "118237899361246432565", "name": "Doug Irvin", "time": 1481224068538, "rating": 5.0, "text": "I had a dimmer switch go bad and was \"buzzing\" inside. I went to Home Depot and purchased a new three-way switch but upon pulling the old switch out of the wall I found an unusual wiring that I had never seen. The old switch had three wires vs. the new 4-wire switch and the old switch had the green ground wire connected to a \"Red\" wire. Not wanting to take a chance of burning down my house I took the advise of my friend and called Mr. Electric. They were at my house and had the new switch in within three hours. Although people might feel their price was high, you get dedicated/trained electricians, insured and bonded. I'm willing to pay for that.", "pics": null, "resp": {"time": 1481386074577, "text": "Mr Irvin\nThank you so much for the wonderful comments and for choosing Mr Electric.\nIt's such a privledge to work with customers such as yourself!\nDan Black\nMr Electric of Montgomery."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "117572853194886812980", "name": "Jason Krueger", "time": 1498071964980, "rating": 5.0, "text": "Excellent, Steve did an outstanding job under less than ideal circumstances.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "113367614260609550825", "name": "Sleep Walker", "time": 1504834502404, "rating": 5.0, "text": "Mr. Electric provided 5 star, first-rate service for the replacement of my distribution box and installed (4) additional outlets around the exterior of my house. The workmanship of Steven Leavins was simply marvelous and very professional done. I selected Mr. Electric over Dixie Electric, McGehee Electric and R&H Electric for the following reasons:\n•\tThe survey technician, Steven Leavins, was friendly and conducted a fairly thorough survey of the work to be done. This is important because it prevents rework and unnecessary delays in completing the work.\n•\tTheir estimate was very detail, well structured, and nicely presented. Usually, how the presentation (in this case documentation) is delivered reflects the quality of workmanship you can expect.\n•\tQuick response/reply. Mr. Electric responded to my initial query within hours as was your estimate. The other companies took 1-2 days to provide an estimate. This is impressive given the nice job done on the estimate.\n\nI was not disappointed in my choice. Steven Leavins was awesome! His work, attitude, and self-pride are worthy of acknowledgement. I'm not easy to please, but Mr. Electric and the team (namely Steven) delivered as promised and as I expected. Really, if you want some electric work done call Mr. Electric first. Oh, yeah, the company is very reasonable. I promise you will love the workmanship (and the people).", "pics": null, "resp": {"time": 1506708825540, "text": "Mr F, (Sleep Walker)\n\nYou made our day with this glowing review! We can't begin to thank you enough for giving us the privilege\nof providing electrical services at your home. We know customers have many companies to choose from and we don't take customers like you for granted! Our whole team works very hard each day to earn each customer's business and that's why customer service and appreciation is so much a part of our company here at Mr Electric of Montgomery. We are very fortunate to have Steven on our team because of his level of professionalism and dedication to quality work.\nFrom all of us here at Mr Electric of Montgomery, thank you for your trust and confidence.\n\nWarm regards,\n\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "112879154260979452278", "name": "Bob Rocheleau", "time": 1551885891051, "rating": 5.0, "text": "Great job.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108338013387468310980", "name": "CHARLES Sexton", "time": 1573091125230, "rating": 4.0, "text": "As previously stated in survey,job is not complete yet,but so far were satisfied with service!", "pics": null, "resp": {"time": 1573140685215, "text": "Thank you, Charles! Rest assured we will get everything taken care of!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104014925622826821499", "name": "Linda Walsh", "time": 1485960926845, "rating": 5.0, "text": "Excellent professional service!  On time and stayed within the quote for repairs.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "100419980926977615278", "name": "Bob MacLean", "time": 1466639180255, "rating": 5.0, "text": "Very professional technician and excellent service at a great price!", "pics": null, "resp": {"time": 1473713639776, "text": "Thank you very much Mr MacLean for giving us the opportunity to provide you service!\nDan Black\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103642080785655035860", "name": "andy roberson", "time": 1485789595227, "rating": 5.0, "text": "Had to call Mr. Electric on a weekend.  Terry showed up on time and was very knowledgeable and helpful..", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "118154656562810604483", "name": "Gloria M.", "time": 1506299059139, "rating": 5.0, "text": "Great services!!!!!!\nThanks Steve, you’re the best!", "pics": null, "resp": {"time": 1506706838775, "text": "Ms. M.\nThank you for giving us the opportunity to provide electrical services at your home. It's customers like you that make our job enjoyable each day! We look forward to serving you again soon!\n\nWarm regards,\nDan Black\nOwner\nMr. Electric of Montgomery, Alabama"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "109000023813757522059", "name": "Craig B", "time": 1494441148434, "rating": 5.0, "text": "Everything went well as far as Mr. Electric.  I would use them again", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "101550299004555801115", "name": "Gladys White", "time": 1578016237708, "rating": 5.0, "text": "Reliable and fast", "pics": null, "resp": {"time": 1578071303742, "text": "Thank you, Gladys!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "115098122254535949977", "name": "no body", "time": 1523387879327, "rating": 5.0, "text": "Awesome", "pics": null, "resp": {"time": 1523015832339, "text": "We take our reviews very seriously and we have never done any work for this individual. As a result we do not consider this a legitimate review.\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
