{"user_id": "104662566591494654494", "name": "Mitchell Ross", "time": 1618960118208, "rating": 2.0, "text": "Ordered a small part from this company a few weeks ago. After realizing it was the wrong part I sent a few emails trying to iniatw a return.  Totally ghosted me. Thankfully it wasn't very expensive", "pics": null, "resp": null, "gmap_id": "0x88626c91ace66e75:0x2a7c52a029550669"}
{"user_id": "110035755144924835362", "name": "Randy Driscoll", "time": 1587591657759, "rating": 5.0, "text": "First of all, I am from Canada.  I called today to order a part.  He asked me to describe the symptoms that my Samsung Plasma was experiencing.  Rather than just sell me the part as so many sites have done (I've replaced almost every board in the tv so far)He ran me through a common fix (soldering issue) and asked me to call him back to let him know how I made out.  The fix worked and cost me nothing.  I have been talking to a local repair shop and I never got this kind of service.\n\nGood for Huntsville to have his shop and customer service!\n\nOn another note, through just everyday conversation (I am Canadian), I learned that his son is a Doctor in that area.    I'm sure his \"customer service\" has been handed down!!!\n\nThanks So Much!!!!!\n\nRandy D\nQuispamsis, NB, Canada", "pics": null, "resp": null, "gmap_id": "0x88626c91ace66e75:0x2a7c52a029550669"}
{"user_id": "117779031607793004565", "name": "jakeisme21", "time": 1477164715838, "rating": 5.0, "text": "Had a great experience with this company. Needed to replace the main board in my Seiki 32\" TV, they had the part cheaper than anywhere else online. Shipping was quick, the part was nicely packaged, arrived in working order. What more could you ask for? 5 stars.", "pics": null, "resp": null, "gmap_id": "0x88626c91ace66e75:0x2a7c52a029550669"}
{"user_id": "118425495506186690764", "name": "Steven Ilchishin", "time": 1496337452861, "rating": 5.0, "text": "I had a wonderful experience with my online purchase. I was looking for a TV base stand for my LG TV. TVTech Parts was the only place which had it at a decent price (and sold the bracket and screws along with the base). When making the purchase, I forgot to click the \"confirm\" button. Their team reached out to me via email and asked if I needed any assistance completing the order. This small gesture went a long way. Items were just as described. Shipped fast. Packaged well. A+.", "pics": null, "resp": null, "gmap_id": "0x88626c91ace66e75:0x2a7c52a029550669"}
{"user_id": "103140925644442399354", "name": "Matt Reed", "time": 1386100079903, "rating": 5.0, "text": "These guys/gals were very helpful. I emailed with one of their reps before making my purchase to make sure the repair was within the scope of my abilities, he assured me that no special tools were needed for my application.  The new screen for my TV arrived promptly and well packaged, install was not bad at all.\n\nGreat customer service, I saved a bunch of money compared to buying new, and kept more waste out of landfill.", "pics": null, "resp": null, "gmap_id": "0x88626c91ace66e75:0x2a7c52a029550669"}
{"user_id": "115307627544355494252", "name": "Casey Jones", "time": 1533808169168, "rating": 5.0, "text": "Hi never give reviews cause iam super picky but you guys are excellent from placing the order to recieving it was amazing i,ve been in service for 40 years and in those years there has only been 1 or 2 companies that stood out enough for me to take the time to give a review your one of them i will spread the word to every person i talk with so from the people who ship all the way to the owner your doing things the right way and it was a pleasure to be able to work with you as far as getting me the right parts and a short time keep up the good work and thanks again", "pics": null, "resp": null, "gmap_id": "0x88626c91ace66e75:0x2a7c52a029550669"}
{"user_id": "107688821730743695211", "name": "Jim Rase", "time": 1447686763118, "rating": 2.0, "text": "Originally ordered part was quick, however the part they sent was the wrong one picked from their warehouse. Called them a day later (which has been a week now) and they've promised to send me a replacement part-- which hasn't happened yet. Called again today and found out it was never sent, we'll see if that changes this week.. disappointed so far.", "pics": null, "resp": null, "gmap_id": "0x88626c91ace66e75:0x2a7c52a029550669"}
{"user_id": "102273834740595022374", "name": "Otis Collins", "time": 1511202743803, "rating": 5.0, "text": "My TV when black and wouldn’t show a picture I was determinate that I could, fix my TV myself. I first did some research and discover the problem, after establish what I thought was wrong with television I order the part from Tvtechparts. The parts came about two days later maybe three. I call Tvtechparts and had a great and pleasure conversation with Mr. G who works at Tvtechparts, neither to say my TV was up and running within 20 minutes at tops. I thank you Mr. G and the staff for getting the part to me so fast. A GREAT Company to do business with..", "pics": null, "resp": null, "gmap_id": "0x88626c91ace66e75:0x2a7c52a029550669"}
