{"user_id": "108373043575407745396", "name": "Darryl Floyd", "time": 1620404822793, "rating": 5.0, "text": "Very pleasant! I was cared for by staff very speedly and professional.", "pics": null, "resp": null, "gmap_id": "0x886215bb38aa51af:0xcf496fa1b8c8877b"}
{"user_id": "104423375812971032194", "name": "Edward Stell", "time": 1626280673214, "rating": 5.0, "text": "Great place  to do business with.", "pics": null, "resp": null, "gmap_id": "0x88891c0a8248d5b3:0xcec9aee0d6b0fa95"}
{"user_id": "108181608335289813046", "name": "John Willis", "time": 1613407349358, "rating": 5.0, "text": "They got all the tools you need!", "pics": null, "resp": null, "gmap_id": "0x88891c0a8248d5b3:0xcec9aee0d6b0fa95"}
{"user_id": "105453662804657301781", "name": "Brian Rucker", "time": 1623442522386, "rating": 5.0, "text": "Very knowledgeable people", "pics": null, "resp": null, "gmap_id": "0x88891c0a8248d5b3:0xcec9aee0d6b0fa95"}
{"user_id": "106313127972666061552", "name": "Mark Blumer", "time": 1517633111239, "rating": 5.0, "text": "As an electrical contractor from Kansas, who works all over the country, I give these guys a 100%  this is the second time I have done business with them in the last year and they have had what I needed at every turn.  I deal with supply houses all over the country, and believe me when I say, if I dont need it today in Texas, they will get my business tomorrow. I Never seen a supply house like this that cared more for their customers. I could write a whole book, but thank you Calvin for helping us get this job done, and back home to our familes in a timely and productive fashion. We will be back, and we will buy our supplies from Buffalo!!", "pics": null, "resp": null, "gmap_id": "0x88891c0a8248d5b3:0xcec9aee0d6b0fa95"}
{"user_id": "116338474660369892257", "name": "Walter Simpson", "time": 1516034233414, "rating": 5.0, "text": "Very fast and efficient I got the item I was looking for in less than 5 minutes excellent service from the door really appreciate those guys", "pics": null, "resp": null, "gmap_id": "0x88891c0a8248d5b3:0xcec9aee0d6b0fa95"}
{"user_id": "106642727262219535441", "name": "Bryant Gilmer", "time": 1520359102059, "rating": 5.0, "text": "Awesome counter help. Was greated as soon as I walked in. They had what I needed in stock at Internet price too!!!!", "pics": null, "resp": null, "gmap_id": "0x88891c0a8248d5b3:0xcec9aee0d6b0fa95"}
{"user_id": "109862444976598416609", "name": "George Young", "time": 1544202208646, "rating": 5.0, "text": "Best in town", "pics": null, "resp": null, "gmap_id": "0x88891c0a8248d5b3:0xcec9aee0d6b0fa95"}
{"user_id": "111336293959225480673", "name": "Alex \"LiveWire\" Huynh", "time": 1488321511281, "rating": 5.0, "text": "AAAAAAAa", "pics": null, "resp": null, "gmap_id": "0x88891c0a8248d5b3:0xcec9aee0d6b0fa95"}
{"user_id": "105777435893021855194", "name": "Sue Stephens", "time": 1613592532070, "rating": 5.0, "text": "Gexpro has a convenient location to me. They had the part I needed in stock. They provided excellent customer service! Thanks, Gexpro! You will be my go-to from here on for electrical supplies.", "pics": null, "resp": {"time": 1613739825943, "text": "Sue, we are so pleased to hear about your positive experience at our branch! Thank you for the feedback and for the 5-star review. We look forward to seeing you again soon."}, "gmap_id": "0x88626510d0c9b065:0x91e4094b33dc9444"}
{"user_id": "105023440891978401195", "name": "Andrew Ohlinger", "time": 1495107619659, "rating": 5.0, "text": "Great electrical and lighting supply. Very helpful counter staff. They also have a great stock of Klein and Southwire tools!", "pics": null, "resp": {"time": 1588080242807, "text": "Andrew, thanks so much for the 5-star review! We really appreciate you taking the time to write a review and your continued business."}, "gmap_id": "0x88626510d0c9b065:0x91e4094b33dc9444"}
{"user_id": "109886367807929514072", "name": "Paul Goodridge", "time": 1525466622852, "rating": 5.0, "text": "Great place to work and great boss to work with.  Friendly staff and great services.", "pics": null, "resp": {"time": 1588079580524, "text": "Thanks, Paul, for reviewing the branch. We appreciate it!"}, "gmap_id": "0x88626510d0c9b065:0x91e4094b33dc9444"}
{"user_id": "105152564718575499846", "name": "trent flowers", "time": 1531505728567, "rating": 3.0, "text": "A little SLOW on ordering", "pics": null, "resp": {"time": 1588079069796, "text": "We apologize you had a negative experience with us with ordering. We strive to serve our customers at the highest level and hope we can connect with you to see how we can do better. Please reach out to our branch manager at (256) 774-1651 so we can correct the problem."}, "gmap_id": "0x88626510d0c9b065:0x91e4094b33dc9444"}
{"user_id": "100367329911634918477", "name": "Alex Alexander", "time": 1624556724822, "rating": 5.0, "text": "Merideth is so helpful! She always replies promptly to any of my questions and goes over and beyond to assist me in any way! I have enjoyed bouncing ideas around with her. Great experience!", "pics": null, "resp": {"time": 1624664568227, "text": "Alex, Thank you for kind words about Merideth, she is a great asset to our staff. Thank you for your business."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "116201542186029905022", "name": "Max Mitchell", "time": 1608628855984, "rating": 5.0, "text": "MEWS is absolutely fantastic - the selection and prices are great. Robyn was the most helpful and insightful person I worked with throughout the entire home building process. She went out of her way to make sure everything was installed correctly and promptly fixed any issues we had.", "pics": null, "resp": {"time": 1609777055607, "text": "Max, Thank you for the sweet remarks, and we all love taking care of our customers. I will tell Robyn about your appreciation of her helpfulness."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "110781975122031613091", "name": "Sharon Cain", "time": 1615265876359, "rating": 5.0, "text": "My experience at MEWS was terrific!!!!  Corey was so very helpful, professional and knowledgeable.  He went above and beyond to help me with my lighting selection.  I plain on making future purchases.  Thank you Corey!!!!😁😁😁", "pics": null, "resp": {"time": 1615418002214, "text": "Thank you Sharon, we love our customers, and I will tell Corey that he made your experience above and beyond."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "104170603632109196895", "name": "Donna McDonald", "time": 1608213566491, "rating": 5.0, "text": "One of the shops I always look forward to visiting is this one. The displays are beautiful and full of creativity! So after finding the perfect picture frames I was so disappointed in the reception I received at the counter. Besides being ignored, one of the staff was on a tirade about the lunch hours. She even commented about how they never have nice customers while she still ignored me! Gee! That made me feel good!😏", "pics": null, "resp": {"time": 1608214822869, "text": "Donna, I am so sorry, please call me at the store and this will be corrected. Thank you."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "110758333296621431711", "name": "Doug Corley", "time": 1597090263792, "rating": 5.0, "text": "Customer service is outstanding. Needed some parts for the plumber to finish on a new construction home that is about an hour away and Robyn had them there quickly which allowed the plumber to finish and not have to come back another day. From the very beginning Robyn has helped my wife pick out all of our fixtures and it has been one of the easiest parts of building our house.", "pics": null, "resp": {"time": 1597155084951, "text": "Thank you Doug, I have a wonderful staff and we love our customers."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "106668679786731989592", "name": "Fuck Your God", "time": 1607219939939, "rating": 1.0, "text": "As a plumber they don't have a lot of stuff I need alot of times. But good people I don't know about anything else.", "pics": null, "resp": null, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "103950877833553351252", "name": "Julie Lyle Johnson", "time": 1595373347048, "rating": 5.0, "text": "A very beautiful, clean showroom with everything you need to decorate your home. Corey was very helpful, and ordered just the right ceiling fan for our porch.", "pics": null, "resp": {"time": 1595469954339, "text": "Thank you Julie, and I'll let Corey know how you appreciated his assistance."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "117312883243087060119", "name": "Olivia Hardy", "time": 1564800353062, "rating": 1.0, "text": "My husband went to the back to buy a blower unit for the inside part of our A/C. When he got there he found out that they don't sell them as a unit like they used to. You have to buy just the motor, so that's what he bought. When he gets it home, he finds out that it didn't have mount brackets so I went up there to get one that does. I was then told that none of the motors come with bracket mounts. I made the comment that he should have told my husband that so he could have gotten it while he was there. It's hot and this is our A/C unit we're trying to fix in the middle of a hot day. The gentleman said it wasn't his job to know what a person knew or not. I told him that he knew more than my husband on what parts come with what, that's when a woman came around counter and said that she was the owner and that I didn't need to talk to her employee that way. I wasn't being rude or belligerent. I just didn't think it would have been that hard to ask if the customer knew it didn't come with bracket mounts, especially if he brought an older model in. This will be the last time my family and I will be back to that store and before today, I would have recommended that store to anyone. Now I'll tell people to stay away. It's nothing like it used to be.", "pics": null, "resp": {"time": 1565720472419, "text": "Mrs. Hardy,\nYou did not speak to the owner for I am the owner, and I was at another store that day, you spoke to a co-worker, but Mrs. Hardy we have no idea what a customer's needs are until they inform us.\nThere are hundreds of units, and they change models every year, and the servicemen have to request what they need from us. We are a supply house, not a service company, and we are sorry that your husband did not realize he need additional products, but that was his call and not ours. Your husband was servicing his own unit.\nWe try and make all customers happy, and were sorry that you were disappointed, but do realize we have no idea what is wrong with a central unit until a serviceman request a particular part."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "116974851903056374509", "name": "AK _SAVAGE", "time": 1550535920012, "rating": 5.0, "text": "The ladies who work in the front are very friendly and helpful, as well as the associates that are in the showrooms. Huge variety of lighting, many are on display for the customer to see. There's something for everyone!", "pics": null, "resp": {"time": 1550590642201, "text": "Thank you so much for the compliments on our staff,  and we want to have a good selection for our sweet customers."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "105098009053378437929", "name": "Richard Brown", "time": 1538234444269, "rating": 5.0, "text": "In addition to having to the plumbing part that I needed, they have a lot of awesome stuff that would decorate any home beautifully", "pics": null, "resp": {"time": 1538239291729, "text": "Thank you Richard, and we love taking care of our customers."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "118268531911652590361", "name": "lilly Keene", "time": 1514772655271, "rating": 5.0, "text": "Wonderful customer service and very happy with my purchase good to find the quality locally.", "pics": null, "resp": {"time": 1518121780713, "text": "Thank you Lilly, I don't know how I missed your sweet review until now."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "107221695179950899315", "name": "Judy Meyer", "time": 1600789809734, "rating": 5.0, "text": "Very nice", "pics": null, "resp": {"time": 1600796425249, "text": "Thank you Judy, we appreciate our sweet customers."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "113330469000008044766", "name": "Cory Hardy", "time": 1551197268508, "rating": 5.0, "text": "Great people and great materials I recommend MEWS to ANYONE", "pics": null, "resp": {"time": 1551201376189, "text": "Thank you Cory, it is so sweet of you to tell people about us. We do love our customers."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "115050475612973215501", "name": "Jared Toone", "time": 1485371537277, "rating": 3.0, "text": "Great selection, but prices seemed really high.", "pics": null, "resp": {"time": 1497306857523, "text": "Jared, We try and have a selection for all budgets and hope you will give us the opportunity to service you again.\nSorry, I've been so long in responding, but I have not been receiving these reviews until this past week."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "107590350671569690386", "name": "Dawn Czermak", "time": 1523116049507, "rating": 5.0, "text": "UNBELIEVABLE selection. I have no words. Whatever you are looking for - they have it. Anything.", "pics": null, "resp": {"time": 1523288619832, "text": "Thank you Dawn, we want to be there to service our sweet customers and have the products to meet your needs."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "101784775847666266146", "name": "Thomas Thompson", "time": 1517369247069, "rating": 5.0, "text": "Good prices Goodwill variety great service", "pics": null, "resp": {"time": 1517404541533, "text": "Thank you Thomas, that is so sweet of you to take the time to do this."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "113494012974465219262", "name": "Sara Knaub", "time": 1597088832982, "rating": 3.0, "text": "Kinda snotty people", "pics": null, "resp": {"time": 1597095236937, "text": "Please call me and let me know whom you dealt with, this is a very unusual comment for my staff, I usually get just the opposite of how sweet and kind they are."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "113224144832015855927", "name": "Sherry Hester", "time": 1553359073430, "rating": 5.0, "text": "Wow I thought it was just lighting. This store has a little bit of everything. Checked it out.", "pics": null, "resp": {"time": 1553361612483, "text": "Sherry, Thank you for shopping with us, and we hope to see you again soon. We do love our customers."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "105287292938466275483", "name": "Merri Bass", "time": 1536347220952, "rating": 5.0, "text": "Staff is super helpful !!", "pics": null, "resp": {"time": 1536348081502, "text": "Thank you Merri, we appreciate our customers and want to take care of your needs."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "103778336272478274110", "name": "mike clinard", "time": 1532018586170, "rating": 5.0, "text": "Great staffed, provided instructions on suggested part", "pics": null, "resp": {"time": 1565720504754, "text": "Thank you Mike, and sorry I missed your review."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "108600301590225681225", "name": "Chadrick Piper", "time": 1496858679856, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1497306897181, "text": "Thank you Chadrick."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "107353406227582420592", "name": "Stacey Adams", "time": 1494247796093, "rating": 3.0, "text": "High prices", "pics": null, "resp": {"time": 1497306730275, "text": "Stacey, We try to have product in all price ranges to satisfy our customers, I hope you will let our staff service you again and work with you."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
