{"user_id": "110736880653215601508", "name": "Robert Bradford", "time": 1615319719018, "rating": 5.0, "text": "I am responsible for the security system for Birmingham City Schools with 43 schools and almost 25,000 students. We have used Card Lock Company's Maxxess eFusion System for several years and it has worked extremely well for us. It Is highly adaptable and as our needs have grown and changed so has the product. The service is excellent and unlike our former system, we can get support when we need it. They only partner with qualified and trained Installers and they oversee that process to make sure that things are done to their standard. Another plus is their experience. They have large systems all over the country at every level of education. That exposure to the different approaches allows them to design the best solution for you.  What really sets them apart is that they care and take pride in their work, and in our system!  I trust Card Lock Company to take care of us!\n\nRobert Bradford\nSenior Director of Security\nBirmingham City Schools", "pics": null, "resp": {"time": 1617651512391, "text": "Robert, thank you for taking the time to write about your experience! We greatly appreciate and value feedback from the clients we partner with like Birmingham City Schools. It has been an absolute pleasure working with you and we are so happy to hear we are meeting your expectations with our products and services at Card Lock."}, "gmap_id": "0x888e8ee497f2b7b7:0x1694078360c0ec31"}
{"user_id": "108135255477755271899", "name": "Jessica Flomer", "time": 1583946876496, "rating": 5.0, "text": "Great company to do business with! The staff are fantastic, Robbie is very friendly and helpful!", "pics": null, "resp": null, "gmap_id": "0x888e8ee497f2b7b7:0x1694078360c0ec31"}
{"user_id": "107068443614558852815", "name": "HOYT MIDDLETON", "time": 1566597762942, "rating": 5.0, "text": "Super friendly staff", "pics": null, "resp": {"time": 1566785794986, "text": "Thank you for your review Hoyt. We appreciate the rating and are glad to hear that our staff created a good experience for you!"}, "gmap_id": "0x888e8ee497f2b7b7:0x1694078360c0ec31"}
{"user_id": "107339957173018340897", "name": "Hoyt Middleton", "time": 1572188698121, "rating": 4.0, "text": "Friendly staff", "pics": null, "resp": {"time": 1572227908538, "text": "Hello Hoyt, we appreciate you leaving a review! We always like to hear that our staff are facilitating a positive experience. We look forward to working with you in the future."}, "gmap_id": "0x888e8ee497f2b7b7:0x1694078360c0ec31"}
{"user_id": "106513195632982662175", "name": "amanda wilson", "time": 1435611296225, "rating": 5.0, "text": "Awesome", "pics": null, "resp": {"time": 1525718113403, "text": "Thank you Amanda and we hope to continue to help you in the future!"}, "gmap_id": "0x888e8ee497f2b7b7:0x1694078360c0ec31"}
