{"user_id": "112856602004917921444", "name": "Todd Haney", "time": 1564351789222, "rating": 5.0, "text": "This is a great company to partner with for your security and surveillance needs. All of the staff and technicians are very knowledge, and very helpful, fast and efficient. They know their stuff better than anyone.  Their prices are very reasonable as well. They responded to me as quickly the first time as they did the last time I called needing something else done. Really happy with how everything has turned out, and will always use Spy Pro Shop!! Thank you!!", "pics": null, "resp": null, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "101701922366446090627", "name": "Marilyn Hubbard", "time": 1564005453169, "rating": 5.0, "text": "I have always had great customer service from the folks at the store. They are very knowledgeable and patient with people like me who really don’t know for sure what they are looking for. I explain what I thought I needed and they gave me their recommendations. I have been very happy with what I purchased and went back to see more! They just have all kinds of neat things that you would never guess were cameras. A very fun place to go.😃", "pics": null, "resp": {"time": 1564009275328, "text": "Thank you Marilyn"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "117034214258122051868", "name": "Shirley", "time": 1564004202634, "rating": 5.0, "text": "Great store!!! A+ customer service!!! Went in not knowing exactly what I needed but after talking with their knowledgeable staff I left with the perfect product. Will definitely shop here again and will highly recommend them!!!", "pics": null, "resp": {"time": 1564004311499, "text": "Thank you"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "115207430185759453190", "name": "Victoria Faison", "time": 1564112240480, "rating": 5.0, "text": "These guys are great! Excited service. I felt very helped and welcomed. So friendly. 👍🏼", "pics": null, "resp": null, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "114945697833672343552", "name": "Mr Barber", "time": 1564008769343, "rating": 5.0, "text": "This is a great place nice family friendly and knowledgeable I would highly recommend.. I mistakenly left a review that was intended for another business the spy pro shop is great 👍", "pics": null, "resp": {"time": 1564000239203, "text": "Please everyone pray for this person .He gives everyone bad reviews."}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "117098541664549792522", "name": "Jack", "time": 1564004678642, "rating": 5.0, "text": "This store has great products and customer service is unmatched!\nThey are one of the best in the business when it comes to investigative services I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "107299600524733523281", "name": "Rebecca Roof", "time": 1578281695829, "rating": 5.0, "text": "Nice people. Helpful and friendly.", "pics": null, "resp": null, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "112535199449092179179", "name": "David Schove", "time": 1564004879008, "rating": 5.0, "text": "Great customer service.  Learned a lot from the staff about cameras.  Will be back to buy more next month.", "pics": null, "resp": {"time": 1564009291416, "text": "Thanks David"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "105138351444654433896", "name": "Jerry Quinn", "time": 1456283325530, "rating": 5.0, "text": "The Spy Pro Shop is such a cool place.  I had no idea that some of this stuff existed.  I was so impressed with the product knowledge on eveything they sell.  The GPS trackers, drones, video/audio surveillance was unbelievable.  Do yourself a favor and check this store out.  You will walk away with many ideas for sure.", "pics": null, "resp": {"time": 1465226521610, "text": "Thanks, Jerry. That's the sort of thing we love to hear our customers say."}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "106492890632772686089", "name": "Carrie Kelly", "time": 1455122359703, "rating": 5.0, "text": "I rated the Spy Pro Shop with 5 stars because I had previously purchased a trackimo from somewhere else,   and had a problem with the battery running down to fast.  I had to charge it every other day.\nAfter searching around for an extended battery with no luck, that was until I found Spy Pro  Shop! They made it possible for me to have a battery that will last from 2 to 6 months without changing it (so excited).  It has been a week now, and is still  showing 100% (yes!).\nThe Spy Pro Shop customer service was exquisite!  So friendly, patience, and prompt on returning my trackimo to me, after I asked them to fix it to where I could have an extended battery life on it.\nI would definitely recommend this shop to others!!!", "pics": null, "resp": {"time": 1464924352451, "text": "Thank you, you; we enjoyed helping you with that challenge."}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "100631821959112696948", "name": "Connie Briggs", "time": 1505852829887, "rating": 5.0, "text": "Jim walked me through the process of getting Wi-Fi enabled and was very patient.  I couldn't have done it without out.  Awesome customer service.  Thanks so much for getting me up and running.", "pics": null, "resp": {"time": 1564004384957, "text": "Thanks Connie"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "114947854872628358644", "name": "Jack Knight", "time": 1539996859454, "rating": 5.0, "text": "Incomparable to any other businesses in Greater Birmingham, AL.  Love the concept, the store and the helpful, knowledgeable staff!", "pics": null, "resp": {"time": 1564004363981, "text": "Thanks Jack"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "114694930595001994064", "name": "doc lamb", "time": 1543074828658, "rating": 5.0, "text": "Very interesting place with very friendly and knoledgeable staff.", "pics": null, "resp": {"time": 1564004344938, "text": "Thank You Doc"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "118295129268261647230", "name": "Sam Osman", "time": 1474593376554, "rating": 5.0, "text": "For the first time you meet people that knows what they're doing customer service was amazing plenty of merchandise and great hospitality excellent service", "pics": null, "resp": {"time": 1474634470191, "text": "Thank you Sam and all of our customers; we appreciate everyone of you."}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "109859722064579446001", "name": "CRI Trains", "time": 1522183856429, "rating": 1.0, "text": "I was interested in purchasing a wifi security camera, purchased a unit only to get it home and find out that the unit did not have wifi.  I brought it back and they insisted that in fact it did.  Called the support number included they confirmed the unit did not have wifi.  Brought it back a second time for a refund and the lady behind the counter was quite rude and acted as if she did not believe me.  I would avoid this place.", "pics": null, "resp": {"time": 1522188092518, "text": "I'm sorry for the confusion, the camera was wifi enabled but was made to be covert therefore the controls were hidden behind a slide off panel that was not easily detected. I hope Mr. Hammer does not avoid this place as we would love to see him back as a customer. If by chance Mr. Hammer, you do order that camera online, we found that the entire rear panel will pop off with a little pressure and reveal the wifi switch. This was an upgraded model and I'm sorry that our people had not yet become familiar with it."}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "102474340518745711562", "name": "Jamie lee Hallman, Ross", "time": 1459273857656, "rating": 5.0, "text": "The customer services was great !!\nI wish I knew the ladies name working yesterday bc she was locking the door to go home for the day..she seen me see her closing so I turned to walk away she stoped asked if she could help me . then\nunlocked the door to let me look around. She did not rush was very sweet and patient with me.\nAlso bless her heart as I was leaving another customer walked in and she helped him out too 😊\nIsn't that the worst when your about to step in the door of a store and the tell u to get out they are closed, even if they wasn't supposed to close yet !?!\nI'm going back to day to get something that will let me look in at any time and see how my child is doing while I'm at work while being babysat for the first time. #💝Hwy280spypro!!!!!", "pics": null, "resp": {"time": 1465226444703, "text": "Thank you Jamie, the lady was Betty. We appreciate the review. :)"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "108060166920348938263", "name": "Nathan Kimes", "time": 1446062419122, "rating": 5.0, "text": "Great shop with friendly people.  Would recommend to anyone.", "pics": null, "resp": {"time": 1446063174068, "text": "Thanks! We appreciate you."}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
