{"user_id": "115329419173495323389", "name": "Travis Peterson", "time": 1619640917292, "rating": 5.0, "text": "These guys are the best!  Devin, Cody, and JM did an AMAZING job upgrading our service panel, installing a generator transfer switch, and several other improvements!  They are professional, courteous, on-time, knowledgeable, I can go on and on.  I will absolutely use them for all of my electrical needs and will refer them to ANYONE and EVERYONE who asks for a referral.  They get the job done right and do not cut corners.  Thanks guys!", "pics": null, "resp": null, "gmap_id": "0x889a4b709aa32e1d:0x5e0de03bdcf6eae5"}
{"user_id": "112331915549396960134", "name": "Tiffany Nichols", "time": 1622238950088, "rating": 5.0, "text": "My workplace had a problem with our electricity, leaving us in a bad way on the Friday heading into a holiday weekend. Hansen electric was fast to respond, and came out quickly. We were back up and running in no time! We are so grateful to the girl in the office who took the call and to Troy who worked in the hot sun to get us taken care of. Many thanks!", "pics": null, "resp": null, "gmap_id": "0x889a4b709aa32e1d:0x5e0de03bdcf6eae5"}
{"user_id": "100956697968236109160", "name": "Jan Allen", "time": 1625337668933, "rating": 5.0, "text": "Made sure I understood the process. Extremely patient with the client. Thank you", "pics": null, "resp": null, "gmap_id": "0x889a4b709aa32e1d:0x5e0de03bdcf6eae5"}
{"user_id": "102896055432671467835", "name": "B. R. Blount", "time": 1610146553017, "rating": 5.0, "text": "First time using Hansens Electric Service and was extremely pleased.  Andrew was our electrician and did a great job!  He was very knowledgeable and professional, and very nice😊. And the cost was fair! Will definitely use them again if needed👍", "pics": null, "resp": null, "gmap_id": "0x889a4b709aa32e1d:0x5e0de03bdcf6eae5"}
{"user_id": "117082205003138839354", "name": "Melissa Ivory", "time": 1607127781245, "rating": 5.0, "text": "I wanted to be sure to leave a review for Tim. He was on time, knowledgeable, professional and so super helpful. Your company does great work and Tim made the appointment completely painless. Thank you very much!", "pics": null, "resp": null, "gmap_id": "0x889a4b709aa32e1d:0x5e0de03bdcf6eae5"}
{"user_id": "117492100466318358380", "name": "pete gleszer", "time": 1591832802958, "rating": 5.0, "text": "Really impressed with everything involving Hansen Electric. Friendly office staff and service reps. Adapted to the complex install and multi-step process without extra charges or repricing offer. Very near work area in my home and vacuumed up all dust and debris when complete. Price for work was excellent and well below other estimates I received. This is a case where very best costs less.\nExceeded my expectations. Great customer focus and professional skills.", "pics": null, "resp": null, "gmap_id": "0x889a4b709aa32e1d:0x5e0de03bdcf6eae5"}
{"user_id": "113944280610664880150", "name": "Linda Lofton", "time": 1575075040893, "rating": 5.0, "text": "Thank you all for your superior service.  Jake, you got my porch light and carport light working and I so appreciate everything you did. I have more things for you to do after the holidays. Thanks again.", "pics": null, "resp": null, "gmap_id": "0x889a4b709aa32e1d:0x5e0de03bdcf6eae5"}
{"user_id": "103791181567531733757", "name": "Arlenr Huntur", "time": 1624298973605, "rating": 5.0, "text": "Great work very professional installed bathtub\n\nDid a great job", "pics": null, "resp": null, "gmap_id": "0x8891ef3b85b27655:0xf07dea6812111ae1"}
{"user_id": "111784200388467256707", "name": "Hung Nguyen", "time": 1568115292559, "rating": 2.0, "text": "They were called out for an emergency job that took less than 3 hours and a single pipe. When asked for an itemized invoice they refused and then threatened litigation over their pay when that was not what was being debated. They aren't interested in accommodating their customer's clerical needs, but their plumbing ones. The pvc pipe they glued in is still working and they assure me they'll repair it if it fails but I doubt they could have messed up gluing a pvc pipe. However I didn't expect them to be incapable of providing an itemized receipt so they definitely surprised me.\n\nWorth considering alternative providers.", "pics": null, "resp": null, "gmap_id": "0x8891ef3b85b27655:0xf07dea6812111ae1"}
{"user_id": "108323915856527804047", "name": "Juliana McMullin", "time": 1585255825763, "rating": 5.0, "text": "Very professional and courteous. When they needed to reschedule because of the weather, they left me a note on my door so I'd know to call them. That scored major points in my book, pet peeve is contractors who are no show/no call/don't RETURN calls. When the day came, they were on time, and when they came across unexpected snafus they dealt with it at the same price they had quoted me originally. Also (mostly) cleaned up after themselves, didn't leave a huge mess for me to deal with. I've been recommending them to everyone I know, and will be calling them back for more work that needs to be done.", "pics": null, "resp": null, "gmap_id": "0x8891ef3b85b27655:0xf07dea6812111ae1"}
{"user_id": "109687757338600163499", "name": "George Walker", "time": 1600885457940, "rating": 5.0, "text": "Jon and Flavio were great.  They came out quickly and replaced a meter box damaged by Sally. They were helpful in so many ways.  I would recommend them for any electrical problem.", "pics": null, "resp": null, "gmap_id": "0x889a05462c556d77:0x39dde943bd69c168"}
{"user_id": "110512879651426502857", "name": "Philippe Barros", "time": 1596076477469, "rating": 5.0, "text": "João is a work man and very professional. Good price, good quality and aways make my ideas happen so far. He did all my projects to my Tattoo Shop and it looks awesome. Highly recommend. Thank you Gulf Bay Eletric to be my support. 👏🏼", "pics": null, "resp": null, "gmap_id": "0x889a05462c556d77:0x39dde943bd69c168"}
{"user_id": "108138353949510339187", "name": "HILO", "time": 1594841540947, "rating": 5.0, "text": "reasonable rates and honest. had an unknown electrical problem causing lights to flicker. john resolved the issues and charged a very reasonable rate.  highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a05462c556d77:0x39dde943bd69c168"}
{"user_id": "112520831745231358239", "name": "Doc Fruitloops", "time": 1572450891767, "rating": 5.0, "text": "What a great experience.  John/Gulf Bay corrected another electrician's work that wired my pier with INDOOR WIRING and plugs.  John was able to bring my pier up to code and also did much work inside the house.  I cannot recommend him highly enough.  I now have them on speed dial!", "pics": null, "resp": null, "gmap_id": "0x889a05462c556d77:0x39dde943bd69c168"}
{"user_id": "105337590891673562247", "name": "Lee Zimmerman", "time": 1566853372290, "rating": 5.0, "text": "John did a great job adding some outlets above our kitchen cabinets. He knew the current codes for the work required. John provided an excellent service at fair price, and I will use his services again in the future.", "pics": null, "resp": null, "gmap_id": "0x889a05462c556d77:0x39dde943bd69c168"}
{"user_id": "107226338225378277561", "name": "Carlos Colaco", "time": 1564808771497, "rating": 5.0, "text": "What quality of work... Mr. John and his team are to be congratulated for the hard work, clean and organized. I really recommend Gulf Bay Electric Service for your next project (big or small job), very professional. 👍🏼👏🏼👏🏼👏🏼 call and schedule your appointment today.\nThank you very much, Mr. John.", "pics": null, "resp": null, "gmap_id": "0x889a05462c556d77:0x39dde943bd69c168"}
{"user_id": "105994040272435771285", "name": "Shawn Stead", "time": 1571661003334, "rating": 5.0, "text": "Gulf Bay Services was quick to respond to my project and helped me out within the hour. I know it probably doesn’t always happen like that, but I was incredibly impressed. Joao is a nice guy, friendly, and professional. I’ll be recommending him to all my friends!", "pics": null, "resp": null, "gmap_id": "0x889a05462c556d77:0x39dde943bd69c168"}
{"user_id": "115594126329282596620", "name": "Island Granite", "time": 1564848290842, "rating": 5.0, "text": "We have used Gulf Bay Electric Services many times and we’ve always had a great experience with the service provided.\nKnowledgeable, easy to deal with, definitely an outstanding company! We are very pleased with the service. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889a05462c556d77:0x39dde943bd69c168"}
{"user_id": "107328799102173650303", "name": "Joga na MMinha / Mario Masccaro", "time": 1564845826822, "rating": 5.0, "text": "Very good professional, works clearly and safely.  besides being an excellent person... thanks!", "pics": null, "resp": null, "gmap_id": "0x889a05462c556d77:0x39dde943bd69c168"}
{"user_id": "109688579385784151819", "name": "Kristina Halfacre", "time": 1568929239343, "rating": 5.0, "text": "Excellent Electricians! They are honest, dependable, and reasonable. John is the best!", "pics": null, "resp": null, "gmap_id": "0x889a05462c556d77:0x39dde943bd69c168"}
{"user_id": "102023008722947789893", "name": "Angelia Sexton", "time": 1565820875128, "rating": 5.0, "text": "Great and very prompt service! Very professional and kept me up to date on the progress of the job!", "pics": null, "resp": null, "gmap_id": "0x889a05462c556d77:0x39dde943bd69c168"}
{"user_id": "111219562366435502227", "name": "Silvia Peck", "time": 1564833355544, "rating": 5.0, "text": "I had excellent experience with Gulf Shores Eletric Service. Mr Joao is a very competent professional, organized and has a amazing customer service!! I highly recommend", "pics": null, "resp": null, "gmap_id": "0x889a05462c556d77:0x39dde943bd69c168"}
{"user_id": "115042709464244098384", "name": "Ben Montgomery", "time": 1552914614013, "rating": 5.0, "text": "Prompt, professional service. I’ve used them twice for home renovations and projects and they’ve been fantastic.", "pics": null, "resp": null, "gmap_id": "0x889a05462c556d77:0x39dde943bd69c168"}
{"user_id": "103242155802344304082", "name": "Claudia M427", "time": 1552748964080, "rating": 5.0, "text": "Very professional and knowledgeable, I had a few issues that he was able to fix, I would definitely recommend his services.", "pics": null, "resp": null, "gmap_id": "0x889a05462c556d77:0x39dde943bd69c168"}
{"user_id": "107768389201842297125", "name": "Geverson Dossantos", "time": 1564672105992, "rating": 5.0, "text": "Incredible customer service and professionalism.\nI have use their services many times and will continue to do so.", "pics": null, "resp": null, "gmap_id": "0x889a05462c556d77:0x39dde943bd69c168"}
{"user_id": "106969297255384648804", "name": "Maurice Gunter", "time": 1610449100374, "rating": 5.0, "text": "Awesome company I will use them again. I had an emergency and called them. They were absolutely professional and courteous.  I was told the prices up front. The lady that did the work was very quick and professional.  I highly recommend this company.", "pics": null, "resp": null, "gmap_id": "0x8885981e6b27c05d:0x309cafa014da0435"}
{"user_id": "117160153985544417101", "name": "Sonny Pratt", "time": 1617721335748, "rating": 5.0, "text": "Have used them twice with outstanding results. Will use them again on master bathroom repairs.", "pics": null, "resp": {"time": 1617803407296, "text": "Thank you Mr. Pratt! We are glad we could help!"}, "gmap_id": "0x8885981e6b27c05d:0x309cafa014da0435"}
{"user_id": "117043665566488866518", "name": "J Quick", "time": 1607439336786, "rating": 1.0, "text": "I've used Anderson multiple times but would not recommend again. They came out to replace a fuse on my heater and then left without turning the furnace back on. I had to call them to come back to flip the switch they forgot. Then they charged me for coming out the second time.\n\nFlash forward to now. I called them to take a look at the furnace acting up. By the time they arrived the furnace was back to working. I told the guy I didn't need him but he insisted, sprayed WD40 without permission, and found nothing wrong. Now they are trying to charge me despite me never agreeing to the \"work\".\n\nIf Im going to pay for shoddy service calls then I will gladly use another company.", "pics": null, "resp": null, "gmap_id": "0x8885981e6b27c05d:0x309cafa014da0435"}
{"user_id": "105847316607093821076", "name": "Rhonda Cooper", "time": 1597422175586, "rating": 5.0, "text": "They have excellent service. Usually they come out the same day I call in. Staff is very friendly and respectful.", "pics": null, "resp": null, "gmap_id": "0x8885981e6b27c05d:0x309cafa014da0435"}
{"user_id": "108595326197030541031", "name": "Clay Elliott", "time": 1574367363106, "rating": 5.0, "text": "Great HVAC and plumber for our area. They will definitely do what they can to get you up and running!", "pics": null, "resp": null, "gmap_id": "0x8885981e6b27c05d:0x309cafa014da0435"}
{"user_id": "101173674911044690513", "name": "Benjamin R", "time": 1585847799853, "rating": 5.0, "text": "Marc is very sympatic ! Maxime and Jordan it's a french youtuber called Marc for have an information on youtube. Their youtube channel : Des Cuts et des Zoom and The title is \"Comment voyager sans sortir de chez vous ?\" And Jordan call Marc in the end of video", "pics": null, "resp": null, "gmap_id": "0x8885981e6b27c05d:0x309cafa014da0435"}
{"user_id": "106403479676485891346", "name": "Tina Averette", "time": 1617656593146, "rating": 5.0, "text": "Good work!", "pics": null, "resp": {"time": 1617803704269, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x8885981e6b27c05d:0x309cafa014da0435"}
{"user_id": "104532453344995122068", "name": "Darrell Oden", "time": 1603160449687, "rating": 4.0, "text": "They were on time. And worked the entire time", "pics": null, "resp": null, "gmap_id": "0x8885981e6b27c05d:0x309cafa014da0435"}
{"user_id": "105316927157900797146", "name": "Jeremiah Dial", "time": 1502227326760, "rating": 5.0, "text": "These guys are amazing...and they know what they are doing!", "pics": null, "resp": null, "gmap_id": "0x8885981e6b27c05d:0x309cafa014da0435"}
{"user_id": "116776826878595455885", "name": "pauline ory", "time": 1585801530518, "rating": 5.0, "text": "(Translated by Google) France thanks you for your kindness Marc!\n\n(Original)\nLa France vous remercie de votre gentilesse Marc !", "pics": null, "resp": null, "gmap_id": "0x8885981e6b27c05d:0x309cafa014da0435"}
{"user_id": "118067179959740305190", "name": "Taylor K. Vaughn", "time": 1604422897532, "rating": 5.0, "text": "We are very pleased with the work we had done yesterday due to damage from Zeta. The office was fantastic about updating us on when the guys would arrive, and they even showed up a little early! The techs were super friendly and explained everything to us before they got started. They were quick and efficient as well. We will definitely use this company again for anything we may need in the future.", "pics": null, "resp": {"time": 1604607659783, "text": "I am glad we where able to help you with your electrical needs. Looking forward to working with you in the future. Thank  you"}, "gmap_id": "0x889a4deafac20b1f:0x29023cca1f2e230"}
{"user_id": "102489901148543912669", "name": "Kristina Rayner", "time": 1600385434642, "rating": 5.0, "text": "Greatly appreciated their work getting our generator working last week. It hadn’t worked for over a year, and the electrician was very knowledgeable. The generator kicked on seconds after we lost power from Sally and ran for over 18 hours until power was restored. Highly recommend.", "pics": null, "resp": {"time": 1603461443133, "text": "I am glad everything worked as it was suppose to. Thank you for trusting us to take care of your generator needs. We greatly appreciate your business and also your outstanding review."}, "gmap_id": "0x889a4deafac20b1f:0x29023cca1f2e230"}
{"user_id": "100886865082557747396", "name": "Bill Beersdorf", "time": 1601321837353, "rating": 5.0, "text": "Have used Cain Electric in the past.  Very responsive and does great work.  Highly recommend.", "pics": null, "resp": {"time": 1603461800864, "text": "It is always a pleasure working with you. Looking forward to hearing from you again soon. Thank  you for the great review."}, "gmap_id": "0x889a4deafac20b1f:0x29023cca1f2e230"}
{"user_id": "110785687738859082246", "name": "Lara Cox", "time": 1593611904098, "rating": 1.0, "text": "I asked that they come to inspect a generator on a house that we were purchasing (and it’s currently occupied). They were suppose to call before they got there and told me they would be there Thursday or Wednesday. They showed up Tuesday morning without notifying anyone. Apparently they can’t guarantee that someone calls me back either to explain about the generator.\nLady who answered the phone was very rude and unprofessional. She told me he would call me this morning. When I called to see about if I could talk to him, she said he was already gone and couldn’t guarantee that someone would call me today.\nI’ll be looking for a different company to service my generator.", "pics": null, "resp": null, "gmap_id": "0x889a4deafac20b1f:0x29023cca1f2e230"}
{"user_id": "110631491006981023016", "name": "Petra Cain", "time": 1487967144614, "rating": 5.0, "text": "Great service and friendly personal.", "pics": null, "resp": {"time": 1487982772141, "text": "Thank you. We appreciate that."}, "gmap_id": "0x889a4deafac20b1f:0x29023cca1f2e230"}
{"user_id": "100079592823055014419", "name": "Clive Armstrong", "time": 1615909553636, "rating": 5.0, "text": "Friendly and polite good business attitude", "pics": null, "resp": null, "gmap_id": "0x88892a5157743e2b:0x99e10c80efc2d540"}
{"user_id": "102397905746300512204", "name": "Tony Bright (robohiker42)", "time": 1573200444921, "rating": 5.0, "text": "Always have what I need. Prices are compatible.", "pics": null, "resp": null, "gmap_id": "0x88892a5157743e2b:0x99e10c80efc2d540"}
{"user_id": "117692154588342055570", "name": "Patricia Woodson", "time": 1517595487843, "rating": 5.0, "text": "Blown Away! These guys came in totally professional, set up my sound system, optimized it, and explained far more about it than I could read in any manual. They looked at other equipment in my home as a courtesy and explained proper use for them. They were friendly and courteous and did not rush through the process", "pics": null, "resp": {"time": 1525465012333, "text": "Thank you so much Ms. Woodson.  I hope you are enjoying you audio setup."}, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "106629754635906571197", "name": "Kim Patton", "time": 1505433189986, "rating": 5.0, "text": "Twisted installed 3 TVs plus sound bars in our latest home and multiple in our last home.  They go for perfection so it's hard for us to go anywhere else!!!  They will be installing our security camera system next!  Highly recommend them to any and everyone!", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "112950088088265238377", "name": "John McRae", "time": 1513222819545, "rating": 5.0, "text": "Service was a class act. We had a home theater installation. Friendly, knowledgable and reasonable. Very easy to work with. Prompt service. I highly recommend.", "pics": null, "resp": {"time": 1525465246524, "text": "Thank you Mr. John. I hope you are enjoying your awesome system."}, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "108770984922258139206", "name": "Todd Sellers", "time": 1512070344515, "rating": 5.0, "text": "Twisted did an outstanding job hanging the TV and soundbar in our living room. They were very professional and they made sure to clean up before they left. I will definitely be bringing them back to help me hang my other TVs! Great job guys!!", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "104779891600785130401", "name": "Wanda Spillers", "time": 1513905861892, "rating": 5.0, "text": "Very prompt! I was prepared for a long wait and they got it right the very first time. Professional, these are the subject matter experts! I highly recommend them.\n\nDr. Wanda Spillers", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "101171593808885680625", "name": "jean-pierre don juan", "time": 1513647292533, "rating": 5.0, "text": "Outstanding customer service, with impeccable know how.Offering ideas and suggestions that I hadn't even thought of that were time and money saving. Great all around experience.", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "105922210816087403534", "name": "Derrick M", "time": 1513660325482, "rating": 5.0, "text": "Chad is very reliable and always makes sure his work is perfection.", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "108528994475731326245", "name": "MaryAnna Raburn", "time": 1511564803675, "rating": 5.0, "text": "Professional, very responsive, courteous, service oriented, communicative and a job well done.", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "105446915836074230889", "name": "johnny appleseed", "time": 1513646807226, "rating": 5.0, "text": "These folks who came out and did a very good job did not charge an excessive amount would use again", "pics": null, "resp": {"time": 1525465320262, "text": "Thank you for the great review."}, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "111273382746271711257", "name": "LONGS ENTERTAINMENT", "time": 1614469430928, "rating": 5.0, "text": "The Company came and did a amazing job.!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "108607535358463526434", "name": "Damon Hall", "time": 1518636544651, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1525464854489, "text": "Thank You Mr. Hall"}, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "108746692397797532289", "name": "Addy Plays", "time": 1619460958999, "rating": 5.0, "text": "This is a great service because it’s my best friend family business!", "pics": null, "resp": null, "gmap_id": "0x889a4c3c54f7f945:0x3466996617f15a76"}
{"user_id": "115380694111722605235", "name": "Tim Heath", "time": 1521223263273, "rating": 5.0, "text": "Awesome company! They have done multiple jobs for me over the years and have always done a fantastic job. Their crews are respectful and professional. I will never hesitate to use them in the future!", "pics": null, "resp": null, "gmap_id": "0x889a4c3c54f7f945:0x3466996617f15a76"}
{"user_id": "100355876476600881155", "name": "Willard Moore", "time": 1463747581330, "rating": 4.0, "text": "Initially forgot about our appointment, but came over within 30 minutes after I reminded them of the appointment.  Received the quote four days later for the new electrical service and panel, but very hard to get on the phone.  Their prices are fair for a quality electrical company.  They were highly recommended by La Bits AC/Heat.", "pics": null, "resp": {"time": 1463760166142, "text": "We would like to apologize for not getting back to you in a timely manner.  The quote has already been sent to you prior to this incident.  It seems we were blessed with a tremendous amount of unexpected business and were very understaffed to handle this sudden influx of fortune!  Thus it caused a blip in our normal quick customer oriented service.  Please feel free to contact us directly if you have any further questions or concerns."}, "gmap_id": "0x889a4c3c54f7f945:0x3466996617f15a76"}
{"user_id": "112985239845949094630", "name": "Russell", "time": 1533737397462, "rating": 5.0, "text": "Called them to ask for a residential quote. Was told they are too backed up to give a quote and sent me to another contractor.  I'm giving you five stars because I get things happen but sending me somewhere else is not a good business practice. Bizarre.", "pics": null, "resp": {"time": 1533746657157, "text": "Thanks Russell!"}, "gmap_id": "0x889a4c3c54f7f945:0x3466996617f15a76"}
{"user_id": "101706384272638894034", "name": "Jayson Morgan", "time": 1521119560365, "rating": 5.0, "text": "Excellent quality of work, very professional technicians performing the work, and a fair price for the work done. I was especially impressed with the attention I received from their superintendent while work was being done, great managment!!!! 😁", "pics": null, "resp": null, "gmap_id": "0x889a4c3c54f7f945:0x3466996617f15a76"}
{"user_id": "102772559404182392466", "name": "Dennis Lang", "time": 1446078211181, "rating": 5.0, "text": "I had McCollum Electric run some new wires to my service panel.  They showed up on time and did a great job!!  I would recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x889a4c3c54f7f945:0x3466996617f15a76"}
{"user_id": "101165113046175125951", "name": "C Kelly", "time": 1538602664366, "rating": 1.0, "text": "Do not return phone calls for business.", "pics": null, "resp": null, "gmap_id": "0x889a4c3c54f7f945:0x3466996617f15a76"}
{"user_id": "105521505675557514477", "name": "M R", "time": 1546460330468, "rating": 1.0, "text": "Customer services is terrible, you waste your time calling.", "pics": null, "resp": null, "gmap_id": "0x889a4c3c54f7f945:0x3466996617f15a76"}
{"user_id": "104904680913926603464", "name": "Melanie Gallagher", "time": 1606777901898, "rating": 5.0, "text": "Very effectively fast and works to the job is done. A very nice Christian man. I recommend him for your hvac and electrical Repairs or installs", "pics": null, "resp": null, "gmap_id": "0x888cbd483bfdc1b1:0x2856a1cb1b28aa45"}
{"user_id": "104084284714440583532", "name": "Allen Jones", "time": 1616778906449, "rating": 4.0, "text": "Kyle done my work and he's super professional and takes the time to explain the problem and solutions. This is the second time I've used Mr. Electric and both times they have done a excellent job. I'd recommend them for all your electrical needs.", "pics": null, "resp": {"time": 1595162707862, "text": "Thank you Mr. Jones!"}, "gmap_id": "0x888a3ea43b00e6a9:0xa5136e28b06f801"}
{"user_id": "111323336902250027426", "name": "Heather Higgins", "time": 1615307442252, "rating": 2.0, "text": "Nice guys, and maybe great, but 3 times higher than all other local companies we had come out. Cross checked their prices on the supplies and they were marked up.   Get quotes!", "pics": null, "resp": null, "gmap_id": "0x888a3ea43b00e6a9:0xa5136e28b06f801"}
{"user_id": "116865727252447976475", "name": "Melinda Guinn", "time": 1617740516754, "rating": 5.0, "text": "I have used Mr Electric multiple times. I will always use them for all my electrical needs. I highly recommend them. They did an excellent job on running the power for my hot tub. The latest was installing outdoor plugs on my deck and one for my pool pump. They also installed the meter base for our shop! If you want things done right CALL Mr Electric!", "pics": null, "resp": {"time": 1603035963806, "text": "We appreciate that! Thank you!"}, "gmap_id": "0x888a3ea43b00e6a9:0xa5136e28b06f801"}
{"user_id": "117988525564294152445", "name": "Harold Watters", "time": 1596475035814, "rating": 5.0, "text": "This is an excellent company to work with. Will and Kyle are really wonderful people. They keep you informed of their progress and always arrive when they tell you they will be their. They make certain you are satisfied with the finish product. You definitely will want to give them a chance to quote your work.", "pics": null, "resp": {"time": 1596501952968, "text": "Thank you so much! We appreciate you, and It’s been a pleasure working with you and your wife."}, "gmap_id": "0x888a3ea43b00e6a9:0xa5136e28b06f801"}
{"user_id": "113358677371411786032", "name": "Timothy Gregg", "time": 1595777793112, "rating": 5.0, "text": "Made several calls to bid on a private property new construction hookup of utilities and Mr. Electric was very responsive on a call back! Very pleased with this company and their people through out my service call!\nKudos to Kyle and his helper, also th the Owner of the business 👍!", "pics": null, "resp": {"time": 1595792068729, "text": "Thanks! We appreciate that you took the time to share your experience!"}, "gmap_id": "0x888a3ea43b00e6a9:0xa5136e28b06f801"}
{"user_id": "114834939467830477091", "name": "Erin Oliva", "time": 1602939953543, "rating": 5.0, "text": "Prompt and courteous technician, knowledgeable and efficient.", "pics": null, "resp": {"time": 1603035821087, "text": "Thank you!"}, "gmap_id": "0x888a3ea43b00e6a9:0xa5136e28b06f801"}
{"user_id": "115292128253398739738", "name": "Brad Cleveland", "time": 1547827358486, "rating": 5.0, "text": "Will from Mr Electric is the best. He took his time to fix what another so called electrician destroyed. In addition, after he left I found another unrelated issue and he left what he was doing to come back out and fix the problem.\nI HIGHLY recommend Mr Electric. I will definitely use them again if needed.\n\nThanks a ton Mr Electric!!!!", "pics": null, "resp": null, "gmap_id": "0x888a3ea43b00e6a9:0xa5136e28b06f801"}
{"user_id": "108936700955790672294", "name": "PS Snell", "time": 1498073860921, "rating": 3.0, "text": "My husband and I had a major electrical problem and we called Mr Electric and our technician's name was Will and he is THE BEST!!  He is a man of his word and he is so knowlegeable and honest and he is so polite and nice.  We will never use anyone else. The job he did was fantastic and he fixed the problem and we also had him out us in a brand new breaker box...great, great job Will!!", "pics": null, "resp": null, "gmap_id": "0x888a3ea43b00e6a9:0xa5136e28b06f801"}
{"user_id": "100766391392036225324", "name": "M M", "time": 1469580347441, "rating": 5.0, "text": "Installed a 240 volt circuit in my garage and installed some ceiling fans. They came prepared and were efficient and courteous.  Rates were fair. I would definitely hire them again.", "pics": null, "resp": null, "gmap_id": "0x888a3ea43b00e6a9:0xa5136e28b06f801"}
{"user_id": "105692977009244466821", "name": "Jill Boatwright", "time": 1435937063170, "rating": 5.0, "text": "Mr. Electric of Etowah and DeKalb Counties has wonderful service.  Will Martin (Mr. Electric) is such a pleasure to meet and very dependable in his service.  Other electricians that I have dealt with have sometimes been late or never shown up or even returned my calls.  Mr. Electric has always been on time and the service is incredible.  I was having a problem with a can light and ceiling fan.  Mr. Electric came right out and discovered the problem right away.  He also did a wonderful job installing a ceiling fan in a bedroom.  He later put a new fan in my kitchen and it looks wonderful.  The best thing about Mr. Electric is that they are local and very trustworthy and dependable.  Also, the skill and knowledge of Mr. Electric is excellent.  His prices are reasonable and he knows his stuff!  I highly recommend Mr. Electric for ANY electrical need you may have.  These days it is hard to find a good electrician who will serve household electrical needs.  You can't go wrong with Mr. Electric!!!  Awesome +++++++  Hokes Bluff area.", "pics": null, "resp": {"time": 1435947456207, "text": "Thank you for taking the time to share your experience!  We appreciate your business, and hope you will call us back for your future electrical needs!"}, "gmap_id": "0x888a3ea43b00e6a9:0xa5136e28b06f801"}
{"user_id": "109431829522613201613", "name": "Kristi Little", "time": 1446955631303, "rating": 5.0, "text": "Very professionl and trustworthy!!! Great, quality work. I highly recommend Mr. Electric of Dekalb/Etowah county.", "pics": null, "resp": {"time": 1448929193517, "text": "Thank you for taking time to provide the feedback, and please call us again for your future electrical needs!"}, "gmap_id": "0x888a3ea43b00e6a9:0xa5136e28b06f801"}
{"user_id": "108221045164758997700", "name": "micah andrews", "time": 1611381111321, "rating": 5.0, "text": "Good company and nice people.  The yard guy is pretty dang slick with his lull ability, hats off.", "pics": null, "resp": null, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "100366330684148043556", "name": "Daniel Noll", "time": 1537714969073, "rating": 1.0, "text": "Let me tell you a story about these guys. This story takes place in the relatively small parking lot of the hotel I am staying in.\n\nBefore we get started though, know that I tried to resolve this issue directly with the company. The responses I received from them began with a man named \"Andrew\" responding to my initial email with \"who the heck is this\".\n\nIn the attached pictures you will see what their workers did. Things the company clearly considers acceptable, because their attitude towards the situation was condescending at best.\n\nThing #1: You'll see 3 trailers here. One is a different company, one is Scott's Services (the middle one) and one is unmarked. It's not easy to see how many spots they are taking up, but at least 6.\n\nThe drivers were there, and were aware of the problems they were causing. People were actively driving around the lot trying to find parking spots. You can also see the company name on the truck here.\n\nThere is another truck here that is apparently also theirs. After the front desk agent of the hotel asked them to stop blocking parking spaces, they refused, claiming they were stuck. After the agent left they had a good laugh about it, and then moved into the unmarked truck.\n\nThing #2: This is the other side of the parking lot. Another of their vehicles. A much smaller vehicle. One capable of fitting into a single space, and yet they managed to take up two with this one as well. Surely this truck was not stuck as well. What stopped them from fixing this one and freeing up a space?\n\nUpon reporting this behavior to the company, I was told by the person named Andrew that I had a personal problem, and that the hotel should deal with the issue if they feel they need to. I should also stop trying to get hard working people in trouble just because I cannot park where I want. Because everyone knows only Scott's Services' workers are hard working - none of the other patrons of the hotel they inconvenienced were hard working people as well.\n\nIn the adult world we do not get \"in trouble\"; We get held accountable for our actions. The company's refusal to hold their employees accountable for their behavior is a clear declaration that the behavior is condoned by the company, and that these actions accurately reflect the values of Scott's Services.\n\nConsider these things when you consider working with them. This is how they might choose to behave.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNotWXTHDswMaStIri7oO1KYTHcdDg-iMZM7EcH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMIccL5azPhSQVorayMuH0fSQ-MeP3tLWdwfrfu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPYlAUxH76tGUHIMWgqp0OIhoIpA1rtx96Fa9j5=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "110079574381439375015", "name": "DiGiorno 1", "time": 1597964636118, "rating": 5.0, "text": "These guys go above and beyond.  Thank you for paying attention to detail and making the experience quick and painless", "pics": null, "resp": null, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "100129000262680898620", "name": "Phil Green", "time": 1576173371493, "rating": 5.0, "text": "Great and friendly service. can handle any need I have. On time and affordable.\nI Recommend their services", "pics": null, "resp": {"time": 1579125202491, "text": "Thanks so much for your kind words."}, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "104735457715599888855", "name": "Brandon Felice", "time": 1543165254877, "rating": 5.0, "text": "foremer employee. loved the staff and the job. great place to start a career and performs the best service of any non union company out there", "pics": null, "resp": null, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "116604375826105954376", "name": "billy gurak", "time": 1544458601351, "rating": 5.0, "text": "I have been with this company for over a decade.  Whether it has been losing my father or having a tree come through my house they have worked with me on time I needed off. They truly treat you like family.", "pics": null, "resp": null, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "113595226729417891245", "name": "Jose Lopez", "time": 1595016543247, "rating": 5.0, "text": "Love the service here", "pics": null, "resp": null, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "111153154520895431231", "name": "classic32428", "time": 1563994987098, "rating": 1.0, "text": "Had a bucket truck roll into me and take off hit my trailer I was pulling...... down here in Panama city on 23th street and hwy77.............", "pics": null, "resp": {"time": 1579125321246, "text": "I am sorry that happened, I believe the tech did not realize he hit you at the time but came back once he was informed to complete the necessary paperwork."}, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "110722574138138867621", "name": "Tony Worrell", "time": 1547668797665, "rating": 5.0, "text": "Great people", "pics": null, "resp": null, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "112039914496720690151", "name": "Janeth Rivera", "time": 1594659935453, "rating": 5.0, "text": "(Translated by Google) Very friendly good attention to delivery a large space to turn\n\n(Original)\nMuy amables buena atención a los delivery un espacio grande para dar vuelta", "pics": null, "resp": null, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "111275415841861100572", "name": "Mickey Ergle", "time": 1602617856016, "rating": 5.0, "text": "Gerald came out the day I called. My outside box was damaged by hurricane Sally. He go me going safely that night. Then the next day installed us a new main box. It was even cheaper than I could have asked for. His professional and personal attitude was well above great. These are the folks to call.", "pics": null, "resp": null, "gmap_id": "0x889a059e53009e01:0xf82c6070f4dbaa5b"}
{"user_id": "103383984334527242454", "name": "Snapple K", "time": 1595956125696, "rating": 5.0, "text": "Very knowledgeable engineers. I was amazed at the resolution they came up with. It worked and I am very satisfied! If I should ever need electrical work again I will absolutely call them first.", "pics": null, "resp": null, "gmap_id": "0x889a059e53009e01:0xf82c6070f4dbaa5b"}
{"user_id": "100306485671671333541", "name": "Jim Meyer", "time": 1591452879476, "rating": 5.0, "text": "Needed to correct the mis_application of a remodeling project. Electric Power was on the job within an hour and done within two. Thoroughly professional and knowledgeable. They will be on our recommended list.", "pics": null, "resp": null, "gmap_id": "0x889a059e53009e01:0xf82c6070f4dbaa5b"}
{"user_id": "111516304611972823209", "name": "Electric Power", "time": 1595954752671, "rating": 5.0, "text": "Arrived on time - did the work professionally - respected our property - priced right! Couldn't ask for anything more. Re-hire without hesitation!", "pics": null, "resp": null, "gmap_id": "0x889a059e53009e01:0xf82c6070f4dbaa5b"}
{"user_id": "102345302808573138515", "name": "Sam Donaldson", "time": 1595955637680, "rating": 5.0, "text": "Very professional, quick response, even advised on a few things we were doing ourselves. Assisted after the work was done, and much more affordable than Lowe s on lighting install.", "pics": null, "resp": null, "gmap_id": "0x889a059e53009e01:0xf82c6070f4dbaa5b"}
{"user_id": "113633572107690851539", "name": "Phillip Hilley", "time": 1595966185097, "rating": 5.0, "text": "Outstanding service!", "pics": null, "resp": null, "gmap_id": "0x889a059e53009e01:0xf82c6070f4dbaa5b"}
{"user_id": "100647945657002988611", "name": "Joann Wiggins", "time": 1623348841564, "rating": 5.0, "text": "Got my air and heat working great. To hot for no air.  Very nice gentleman. Thanks", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100481246216082589612", "name": "Nancy Owen", "time": 1508210728286, "rating": 5.0, "text": "All I can say is Autumn Air was professional, trustworthy, economical and exceeded all my expectations. There is nothing more aggravating than to have your air conditioning unit quit. Although it is mid-October we needed our air conditioning fixed ASAP. Our unit was 17 years old and I knew we needed to replace it if not immediately, within the very near future. I emailed a few companies Saturday night asking for estimates and to please contact me Monday morning. Only Autumn Air and one other company returned my call today. Autumn Air was very pleasant and offered to have someone come out to price the unit immediately. Since I knew I did not want to start throwing money away repairing such an old unit I asked for a quote for a new unit (with and without the furnace). Skip came out and priced the unit with three options and it was clear if I wanted more options he would give them to me. He did not acted putout or frustrated with my request. He did not pressure me to make a decision nor did he push me to buy the most expensive product. Without me asking, he let me know the specials that were being offered. I asked how soon they could install the unit and he said either this afternoon or in the morning. I called my husband and sent him the estimates. My husband was impressed and even showed his fellow employees who were also impressed with the prices. After weighing the pros and cons we decided to replace the entire unit (with furnace). I called Skip back about 2:30 saying we did want to go ahead and replace the unit, he said he would call me right back, that it would be either this afternoon or in the morning. I was floored when he called me back shortly afterwards and asked if it was okay with me if they could install it today. Skip and two other gentlemen came and installed the unit working hard until close to 9:00 pm. We were all extremely grateful to the diligence of these men. In addition, Autumn Air included a 2-year service plan where they will come out to service/clean the unit twice a year. They have earned my trust. I am very thankful to Autumn Air.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMSUL9QRFJSPykXqDzrNKpCip6nXxO_y7dxFY68=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN2RdAWKk5TI7OZtRl8wgn94aokdQNwgFcu2UXt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOEyoCn2esr-2rrYIf35lCntXDGlIln-damn4kj=w150-h150-k-no-p"]}], "resp": {"time": 1593532696719, "text": "Thank you!!!!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103401569640005628420", "name": "Raymond Gerard", "time": 1622583769528, "rating": 1.0, "text": "Well this guy trys telling us that we needed a WHOLE new unit when in actuality we need 1 part and to find where the freon is leaking. He says it's holding freon when I know for a FACT it's empty. He did not go into the crawl space of where part of the unit is located. This guy is trying to sell us something we don't need. Reason being,  our 18 yr.old son was the one home who doesn't know any better than to just let him in. Didn't talk to my wife or me about anything. Very unsatisfied with this company. We have 5 properties and while our normal ac guy was servicing our rentals(while we waited days for the first company you sent) looked at it and told us exactly what was wrong.... NOTHING MORE THAN REGULAR WEAR AND TEAR.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109506686763532008347", "name": "Tory Shannon", "time": 1616790769309, "rating": 1.0, "text": "Very unprofessional. When asked if I could get number to Corporate office, I was told no the general manager and customer service rep handles all complaints. Customer service only reached out AFTER she seen the review I left on their website. Before the review no one called to apologize or even keep us updated on when our new unit would be in. All this could of been avoided if they would simply offered a simple SORRY. But no one wants to take ownership of their actions. Then Hannah in customer service asked me to stop yelling at her while I was having a conversation , with phone on speaker, haven’t disrespected her nothing and she stops me to tell me stop yelling. Instead of trying to understand the message I’m trying to get her to understand , she is asking me to lower my tune when it wasn’t in a disrespectful manner and I told her that several times.  It’s not like they are doing us a favor, WE ARE PAYING CUSTOMERS. I would not recommend. Spread the word", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "117764367263681419355", "name": "John Hosmer", "time": 1505317915712, "rating": 5.0, "text": "For a long while there have been atmosphere issues in our basement where the previous home owners had never taken care of sealing up the rooms and keeping temps and humidity in check. We had addressed those issues and we had tried using good filters at the returns to prevent as much of any dust, mold spores, etc. from recirculating and spreading, but it ended up being a losing battle for both comfort and our family's health.  Finally, about a month ago I disconnected one of the flexpipes at the end of the trunk run to see just how bad it was and found almost 100% coverage of dust, mold, and nastiness throughout the system. It was in every bit of the trunk, and every flexpipe throughout the house (See pictures). Even a few of the vent registers had started harboring mold growth which was a really bad sign as well.\n\nSo, I did what any good panicking homeowner would do at that point. Went to Google, pulled up nearby HVAC companies with good reviews that could do duct replacement, and called for appointments for onsite inspections. Out of the four highly reviewed and reputable companies (minus individual contractors) in the Pelham area that actually showed up for their appointment, Autumn Air's rep Baker was the only one who showed up on time, actually visually inspected inside the ductwork even after I showed him the initial pictures I took, and then spent a solid amount of time explaining to me options for replacing the entire ductwork system so we could see about what would be right for our budget. In the end, the price that Autumn Air was able to provide for an upgrade to a new round smooth metal interior and outside insulated wrapped system, including new boots and registers, throughout the entire house, plus a new central AprilAire Space Guard filtration and iWave-R GPS ionization system upgrade (per my request) beat out the one other company who actually sent me a quote by almost half. Let me say that again differently...TWO of the four companies NEVER sent back a quote. This told me that two of the highly reputable companies in the Pelham area that have a high amount of favorable reviews simply did not want a job. Pitiful for them.\n\nFast forward to the install a week later...Led by two guys named Javy and Charles, they took care of making sure everything was treated with care when taking out the old ductwork so as to minimize spreading of dirt and mold as much as could be. Then, they proceeded to assemble and install all of the new system on site for custom fitting plus making sure all seams were taped properly and coated with mastic so that the chances of air leaks past the coils is forever kept at a minimum. They arrived early in the morning, and worked until the job was finished that evening (on the day of Harvey storms coming through too!).  Any questions I had concerning anything with the job was answered and explained with no hesitation on their part.  They went beyond expectations with accommodations and I just can't be any happier.\n\nI can't say it enough in this entire description here how great Autumn Air is for an HVAC company. They want someone's business in the best way because they give the work the best service they can at reasonable prices, and offer great financing options too if needed. They understand how to go the extra mile to make sure the customer is being taken care of in the end as well. I can say I have also had the pleasure of meeting Jeff, the owner, later when he came back to look at a minor issue that crept up post install, and he is just as awesome about discussing more than the \"here's what we'll do\". He takes the time to explain the why and how's (if you are interested to know and ask) and will work with you as a customer to do everything he can within reason to make sure you are satisfied with him and his company. Because of all of these things described about everyone at that company and how we were treated, we now not only have clean, sanitized fresh air, but the confidence to know it will stay that way due to the complete service and professionalism we got from Autumn Air.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMabAWy162GH96gyl3m37sUEbn3lZkhH_QMnw5p=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN_X0ScvBCZDov4a77tJ8--jNZxa4SLKPRwf7ZQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP2_SRCsbshQYMwunCW_Svt09o-TDruxZ8tozW8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOKpjJ6ZJSD3l76fC4DaZ5moDrfqENk5DrC3V5m=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPVryaFeSx9Ipmsmn5UNXwMOBC9HZqnM-6Io7MO=w150-h150-k-no-p"]}], "resp": {"time": 1593532681755, "text": "Thank you for sharing your review of our company!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113162987701025102692", "name": "Sunshyne", "time": 1623944314501, "rating": 5.0, "text": "He was on time, respectful, knowledgeable, - though nothing needed to be done at this time. He was great", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110730328967933181341", "name": "W. F. C.", "time": 1616104464426, "rating": 5.0, "text": "Chase is the best, very polite, knowledgeable and explains everything that he finds. Autumn Air is the only Company that will Ever service or replace my unit. Use them, they are honest and trustworthy!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103425132335858219412", "name": "Somer Moseley", "time": 1614285221470, "rating": 5.0, "text": "Chase was super knowledgeable and friendly. He came in completed his specific job task, informed me ways to ensure better quality air in the future by mentioning other services. Thanks for helping me out!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100533506413399443599", "name": "Randolph Pettway", "time": 1616688316435, "rating": 5.0, "text": "Autumn Air is always a pleasure to work with, and I have continued to trust them for years now. I highly recommend their services!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "107147218979368692212", "name": "Harry Daniel Lacey Sr.", "time": 1615490520506, "rating": 5.0, "text": "The Technician did a good job as best as I can tell. Very kind and conciderent and explained it all in a manner that I could understand.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110002014121439675641", "name": "Tony Russo", "time": 1610729473962, "rating": 5.0, "text": "I am extremely impressed with the service I received. My technician, Michael Bowers, was very professional, knowledgeable and personable! Michael took his time to answer all of my questions. I will definitely be using Autumn Air in the future for all of my HVAC needs!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102561326419733360511", "name": "Jim Evans", "time": 1615934985291, "rating": 5.0, "text": "Our upstairs HVAC began putting out 96 degree air when changing from Heat Mode to Cool Mode.   Ambient temp went as high as 96 degrees in our upstairs.   Nick Long was our service tech and we could not have been more pleased!   He quickly & efficiently checked out our entire heat pump system and accurately diagnosed the problem as a malfunctioning thermostat (Trane).   He is very nice and knowledgeable and is an asset to Autumn Air.   I will ask for him by name if I have any HVAC issues in the future.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113114829122449982754", "name": "Nicole Fenderson", "time": 1611692892690, "rating": 5.0, "text": "Mike is the best. Personalble and knowledgeable. Very friendly and never seems to amaze me. If I need service, Mike is who I will always call first!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "108685184292838776791", "name": "Jonathan Freeman", "time": 1615016408204, "rating": 5.0, "text": "Everyone at Autumn Air is extremely professional & always courteous. Pricing is ALWAYS fair, and the work they do is 1st rate...and they STAND BEHIND EVERY SINGLE JOB THEY DO!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "108398441528294797699", "name": "Emily Reach", "time": 1610734504987, "rating": 5.0, "text": "Autumn Air is quick and efficient, I’ve used them a few times now and am really pleased. Nick was very communicative and answered all of my questions!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102161020794102323718", "name": "Cole Betts", "time": 1610997771878, "rating": 5.0, "text": "Michael did a fantastic job, has a great personality and is very transparent with issues and how to repair them. I highly recommend Autumn Air and Mr. Bowers!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110575630665682997196", "name": "sean Peoples", "time": 1618438540382, "rating": 5.0, "text": "Did a great job. Very professional and informative.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109547182390159187729", "name": "kory Nicholas", "time": 1611011206637, "rating": 5.0, "text": "Michael bowers was on time, very professional, friendly, extremely helpful in explaining what was wrong, what we could do to fix it and very good at explaining the process in a way my wife and I could understand.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103384395127531396997", "name": "YVONNE DOUGLAS", "time": 1613754375752, "rating": 5.0, "text": "Technician was early, well informed and honest. Would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114159692413035258158", "name": "Mickey Turner", "time": 1619742270067, "rating": 5.0, "text": "Great folks who consistently do a good job.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113391602552456852453", "name": "carolyn mayfield", "time": 1594762716246, "rating": 5.0, "text": "They installed a hybrid unit for me about a year ago. It has been a fantastic system and has dramatically cut my utility bills. Today they performed a checkup on my unit and did a very thorough job. I trust this company to keep my system running smoothly and I can call them at any time with questions and they are always more than happy to help. Prices are fare also.", "pics": null, "resp": {"time": 1595602446936, "text": "Thank you for sharing your experience with our team!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "117807557896104808508", "name": "Jason Kelly", "time": 1591809242937, "rating": 5.0, "text": "Autumn Air has bailed me out of hot summers a couple of times now. Their whole team is very thorough and professional, and provide you with the best options available. I highly recommend using Autumn Air to anyone that asks me, and to some that don’t even know me! Great company!", "pics": null, "resp": {"time": 1593531082088, "text": "Awesome, Thank you for sharing your experience"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "107427457336929308856", "name": "Julio Duran", "time": 1618424342620, "rating": 5.0, "text": "Great quality work and very professional!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114618588369212031369", "name": "Phyllis Latham", "time": 1623957040596, "rating": 5.0, "text": "Very prompt, professional friendly", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110843563195835919953", "name": "James Hearon", "time": 1619803161967, "rating": 5.0, "text": "They showed up early and their tech Chase knocked it out in 20 minutes.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100120621459124845227", "name": "Robert Gardner", "time": 1592500331094, "rating": 5.0, "text": "Great customer service. Skip is the best of the litter! Knowledgeable, professional and trustworthy. Give him a raise!\n\nAlso, Jason came today for a quick repair. Very courteous and professional . Give him a raise too! Thanks to AA and Jason!", "pics": null, "resp": {"time": 1593531265613, "text": "Thanks you!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103054386620686500178", "name": "Debbie dale", "time": 1592925612024, "rating": 5.0, "text": "Charles did an excellent job. Found issue immediately and replaced the part at no charge as the previous tech missed it twice. He is on longer with the company. Prior service before the tech that missed the  issue was also great. That’s why I bought a new unit to replace mine if 15years.", "pics": null, "resp": {"time": 1593531230935, "text": "Thanks for sharing your experience!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113640397191517381282", "name": "Carol Gancayco", "time": 1592418429515, "rating": 5.0, "text": "Jason showed up earlier than original appointment which was great! He checked my A/C and checked other things to make sure whole system is at 100%. He discovered other things that could have caused the problem and it helped! All repair to be done is still under warranty but labor! Very satisfied with all the work Jason did...super satisfied!", "pics": null, "resp": {"time": 1593531289374, "text": "Thanks you for your review!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116518256012150633364", "name": "Virginia McNamee", "time": 1590784652880, "rating": 5.0, "text": "They have been absolutely incredible. Our tech was Skip Walker and he was so kind and informative. Usually finding out your unit needs to be replaced is a very stressful ordeal. But him and his boss were so nice and explained all possible choices. We laughed and talked and found a plan that will work for us. I will definitely be using them again for any and all my air needs and I would highly recommend them to anyone else who needs air work.", "pics": null, "resp": {"time": 1593531566695, "text": "Thank you for your experience!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114902317468347593965", "name": "Deana Raymond", "time": 1594744254356, "rating": 5.0, "text": "Skip did a remarkable job! Love that he was very thorough and explained everything in detail. Such a great guy! I will definitely be referring you to others!!!", "pics": null, "resp": {"time": 1595602607205, "text": "Thank you for the kind words.Skip will be happy to hear that you have shared the experience you had with his customer service! If you need anything else you let us know!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "106043305844210609872", "name": "Vicki Williams", "time": 1611353418301, "rating": 5.0, "text": "I received a call to inform me that Nick, the tech, was in route to my home. He arrived and entered with his mask on. He checked the fuse box and observed the smoke detectors. I was informed on what needed to be installed to meet  with the  code. He was very polite and knowledgeable.\n\nVicki Williams", "pics": null, "resp": {"time": 1593531619083, "text": "Thank you for the review!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112661279927520948883", "name": "Carolyn Cole", "time": 1589997476224, "rating": 5.0, "text": "Jason and the rest of the technician is very friendly, knowledgeable, also answer any questions. Autumn Air is the best air & heat company through out Alabama. I highly recommended them and any of their staff members.", "pics": null, "resp": {"time": 1593531641016, "text": "Thank you for being such a great customer!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105086827455922328401", "name": "Raymond Perkins", "time": 1594225149916, "rating": 5.0, "text": "Charles was very professional and did an awesome job fixing my unit. I will definitely use them again!", "pics": null, "resp": {"time": 1594650460641, "text": "Thank you for sharing your experience with us!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "107379191817136928937", "name": "Chandra Rodivich", "time": 1582682692917, "rating": 5.0, "text": "This is the second time I have used this company and I have been more than pleased both times!  They replaced one unit last March and my other unit today.  They are the most courteous and down to earth people.   Beyond helpful and efficient.", "pics": null, "resp": {"time": 1593532761721, "text": "Thank you!!!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "115897267392632269641", "name": "Chris Skipper", "time": 1588107493398, "rating": 5.0, "text": "Skip was my technician and nice and very informative and professional. I feel real comfortable and proud of using your service and recommend you to my fellow employees. Thanks\nChris Skipper", "pics": null, "resp": {"time": 1593532603727, "text": "Thank you for sharing your Experience!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "107983273760513076651", "name": "Carolyn Keeton", "time": 1624028088563, "rating": 5.0, "text": "Skip at Autumn Air came out today and did an excellent job! He is very professional and gave me free money saving advice. Autumn Air initially installed my system and ductwork. They have always done excellent work!", "pics": null, "resp": {"time": 1593531796779, "text": "Thank you for sharing your experience!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110701001869854636922", "name": "Kenneth Beavers", "time": 1612543303079, "rating": 5.0, "text": "Nick was very nice , respectful and professional!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112603866575261776033", "name": "Emily Dixon", "time": 1598282882722, "rating": 5.0, "text": "Great service! Great people that do their job on time and are super pet friendly!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109403182270109585505", "name": "Elizabeth Keener", "time": 1613841786386, "rating": 5.0, "text": "Our bathroom fan went kaput and it will be getting replaced! Thanks!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116605020743394734563", "name": "Sabrina Love", "time": 1591908619023, "rating": 5.0, "text": "Skip was nicely professional. I was totally pleased with his visit and his work on my AC. Thank you, Glenda", "pics": null, "resp": {"time": 1593531445637, "text": "Thank you!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111706703248644506608", "name": "Tiffany Kaydim", "time": 1587059707271, "rating": 5.0, "text": "We have had both our A/C units replaced and maintained by Autumn Air and we have been so pleased by their professionalism and friendliness. They also have very competitive pricing.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103756241247715732158", "name": "Guywithaguitar", "time": 1558376052604, "rating": 5.0, "text": "Could not be happier with the service we received from Autumn Air, they were honest and upfront with me from start to finish. Our salesman Corey was very insightful and upfront, our   techs Collin and Jesse did a great job and were very professional and treated the job as if they were installing it in there own home. The owner Jeff even came by a couple of time to make sure everything was going smoothly and that we were happy with what was going on. He even polished up the new ceiling cassette after the job was complete. I feel how reasonable and honest this company treated me was top notch and you can’t go  wrong using them!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102557518549272894558", "name": "Randy K", "time": 1592509302453, "rating": 5.0, "text": "Great company with fast and on time service. Very professional from customer service to their technician. Would recommend them for all your heat and air needs.", "pics": null, "resp": {"time": 1593531255302, "text": "Thank you for sharing your experience!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109321372411691062389", "name": "Amanda Doaty", "time": 1564511195408, "rating": 5.0, "text": "Called Autumn Air this morning and the technician Corey arrived earlier than promised. The service he provided was great!  Corey was pleasantly friendly, knowledgeable, professional, and respectful.  We felt like we’d known him all our lives.  He fixed the problem in no time at all and gave us options without making us feel pressured.  We were so pleased that we ended up signing up for the yearly maintenance plan on the spot which was a great value for the price.  Thanks Autumn and Corey!!!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111226289786748259078", "name": "Michelle Largen", "time": 1562891167157, "rating": 5.0, "text": "Autumn Air was able to send a technician, Corey,  to service our AC unit the same day. He was very thorough and quickly diagnosed our issue. Corey was knowledgeable and went over every detail to make sure we fully understood the problem and the cost for the repair. We are back up and running in a short amount of time. I highly recommend this company.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116920841655864280786", "name": "Rena Payne", "time": 1575348662178, "rating": 5.0, "text": "Edited 12/02/19: As of 12/02, we are still waiting for the final items to be installed. This is 6 weeks after the initial work was done. DO NOT call Autumn Air for services. This company was called 8 times today without an answer and switched over to a fax.  Original post; Corey and the team did a fantastic job making our repairs! Everyone was polite and professional.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100491656115628054150", "name": "Jason Junkins", "time": 1598282597495, "rating": 5.0, "text": "Had a problem with my HVAC and they jumped in and fixed it and held up their promise.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "106025301808347547497", "name": "Analyn Blair", "time": 1558661441476, "rating": 5.0, "text": "Autumn Air was FANTASTIC!!! They came out VERY quickly & gave us a free quote, which was less than several other companies we had come out. They were very professional & knowledgeable. We decided to go with them at 6pm one day & they replaced our AC the very next day! The owner was so pleasant to deal with-would recommend this company to anyone & everyone!!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105028044583035898335", "name": "Brian Shonesy", "time": 1592010709159, "rating": 1.0, "text": "My fault for using them twice but never again. First time was when we had our furnaces installed by them, one was leaking gas into our home because they didn’t install it correctly, the other one wasn’t wired properly and they had to come back out twice to fix it. Second time we had an AC unit replaced and the next day there was water pouring out of the unit all over the floor in our basement. So out of three units I’ve had 0 installed properly the first time, two of the times were catastrophes.", "pics": null, "resp": {"time": 1592229745448, "text": "Mr Shonesy,\n\nWe are extremely sorry for you experience with our company. To my knowledge we have rectified the situations immediately upon learning of your issues. Please let us know if there is anything else that we can do to serve you, or your family. Once again we are very sorry that this has been your experience with our company."}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "108363784288086336028", "name": "RA Litaker", "time": 1619119730426, "rating": 5.0, "text": "Outstanding service!!! Thank you!!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "108495573167216847918", "name": "Will Geiger", "time": 1573750550352, "rating": 5.0, "text": "There isn’t a single company in the Birmingham area that I would call before Autumn Air. They show up on the front end of the time frame that they tell you they’ll be there. They do a great job of diagnosing problems and clearly explaining any needed repair options and the costs involved. I can’t recommend them enough.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102326536040185999037", "name": "Timmonthy Griffin", "time": 1622833534423, "rating": 5.0, "text": "Nice respectable people\nDo what they say and keep informed of anything wrong. 👍🏼", "pics": null, "resp": {"time": 1595602421402, "text": "Thank you for your review"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "108431142599509439340", "name": "Karen Lee", "time": 1554822314474, "rating": 5.0, "text": "This company is outstanding! Very thorough and they take the time to explain everything in detail. They don't try to sell you things you don't need like the last company I used. Their first visit was for a second opinion and they didn't charge anything. Skip was our tech and he's great! Very resonably priced too. I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111290346752313238974", "name": "Randolph Pettway", "time": 1566526993041, "rating": 5.0, "text": "I had Autumn Air come out to my house today, and Corey was everything anyone would want in a representative of a company: knowledgeable, professional, friendly, and understanding of various circumstances. He is a very valuable asset to this company, and I would highly recommend him and Autumn Air to anyone needing inspections or work done to their HVAC unit. He laid out the full diagnosis in an understandable way, and my options were clear. I signed up for the maintenance plan on the spot with Corey, and I am looking forward to working with them in the future!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112288422199347983398", "name": "Dawn Stephenson", "time": 1554844760051, "rating": 5.0, "text": "We just had the unit replaced and Jesse did a great job. He was courteous, professional and we are very pleased. He left the area spotless and made sure I understood about the system before he left. Would recommend!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112804220111058408856", "name": "Pa", "time": 1564842250168, "rating": 5.0, "text": "Cory the technician, was polite, patient, and definitely an expert in HVAC systems!  Great company to work with. Fast, very efficient at my sons house in Helena. Staff at Autumn Air was professional, extremely knowledgeable,  very courteous. I highly recommend Autumn Air & Mr. Cory the technician!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100039228198717962753", "name": "Kalico Gecko", "time": 1574376824901, "rating": 5.0, "text": "Highly Recommended. I was impressed by their punctuality and professionalism. The job was done right the first time. They are our go to when it comes to Electrical work and Hvac. Thanks again!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116708209195288603287", "name": "josh wright", "time": 1561826514151, "rating": 5.0, "text": "Called on a Friday night at 7PM; they were out the next day at 10:30 as promised. Fixed the issue in less than a hour. I thought I was going to need to replace the entire unit since it was over 10 years old but they didn't try to upsell me on anything. He fixed the issue, explained the cost before he even got started and was one of the nicest people I have ever met. Thank you Autumn Air for your EXPERT service and AMAZING customer service! HIGHLY Recommend!!!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "115977777642550027826", "name": "Angela Segars", "time": 1591714436490, "rating": 5.0, "text": "Great customer service. Kind and caring people.", "pics": null, "resp": {"time": 1593531530392, "text": "Thank you for sharing your experience!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113705940308669449120", "name": "Tanya Brown", "time": 1587504891779, "rating": 5.0, "text": "Jason was extremely professional and knowledgeable. I would definitely recommend them and call them again.", "pics": null, "resp": {"time": 1593532632688, "text": "Thank you very much!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113733355024893947453", "name": "Linda Bartlett", "time": 1538908331382, "rating": 5.0, "text": "All my expectations were exceeded by this company. Richard was extremely polite & offered options with no pressure. They arrived right on time. Jesse & Colin were professional, knowledgeable & worked diligently assuring me they would not leave until the job was complete. They were there til almost 9:00 on a Friday night. Exceptional service. Won’t use anyone else for future AC & Heating.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105190172877643297295", "name": "Thomas Lyles", "time": 1595981182686, "rating": 5.0, "text": "Nick's service was timely to avoid probable other problems.  Professional work ethic and result.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "106141364701292346280", "name": "Scott Burnett", "time": 1615829028574, "rating": 5.0, "text": "Skip is the best! Never tries to upsell you!", "pics": null, "resp": {"time": 1593531385003, "text": "Thank you!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101696011925553841660", "name": "Virginia Wimberley", "time": 1590174915433, "rating": 5.0, "text": "Jason is a great air conditioning technician and does great thorough job.", "pics": null, "resp": {"time": 1593531605388, "text": "Thank you for sharing your Experience"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105162284388289528033", "name": "Steve Callahan", "time": 1561083641767, "rating": 5.0, "text": "Wow ! Just found this company 1  day ago . They are awesome. Corey is a rock star !! He came out and spent a lot of time going over all the details when diagnosing my AC and thermostat which got waxed by a lightning storm 2 nights ago. Not knowing much at all about electrical and AC, he had every opportunity to \"create\" broken parts , etc. Nope,  not Corey and Autumn Air. I arm impressed with their work, knowledge, professionalism and honesty. Prices are most fair and they come out when they say they will come out.  Thanks to Corey, we now have AC again less than 36 hours after going down. Oh, and their preventive maintenance plan? Heck, you better jump  all over that, $10 a month auto draft to come out 4x yearly and clean and do PM check is unbeatable. Then when you join, no diagnostic charges when you  call them out, but wait, there's more ! You get a discount on all service  after you sign up !\nReally, $120 a year for the PM plan  ?? i thought he misquoted so I jumped on it but its for real ! Great service, great guy. You rock Corey ! They get 6 stars from me, not 5 .", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "104435242701371483903", "name": "j c", "time": 1546815757344, "rating": 5.0, "text": "Our heat pump died on us and our daughter called. Baker came out and gave us an estimate he was extremely helpful and gave us an extremely\ngood price.The next morning on Saturday Colin and Jesse came out and\ninstalled the new system, both were extremely polite did a very good job\nand even put a cover back on a panel that was not part of the system.\nThey also cleaned up completely. We are very pleased and happy to\nrecommend Autumn Heating and Air to anyone.\n\nir to anyone.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112237714381551895570", "name": "Brian DiRusso", "time": 1546557096423, "rating": 5.0, "text": "Fast, excellent service by knowledgeable people. My heat pump died and I called Autumn Air. They replaced it at a very fair price before the end of the day. Jesse and Colin installed the system and did a neat and thorough job.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "117809989337415255978", "name": "Bob P", "time": 1564003083030, "rating": 5.0, "text": "Corey did a great job! He assessed my unit and made a recommendation based on the condition of the part instead of going for the sale! Loving Autumn so far!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "117809989337415255978", "name": "Bob P", "time": 1564003083030, "rating": 5.0, "text": "Corey did a great job! He assessed my unit and made a recommendation based on the condition of the part instead of going for the sale! Loving Autumn so far!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111191500555175086005", "name": "Tony Bruno", "time": 1538171438464, "rating": 5.0, "text": "Javier, Collin, and Jesse did a great job. Had my new ac unit and water heater installed within a few hours of signing proposal. The new unit is quiet and seems to be of good quality. I would highly recommend Autumn Heating and Cooling to friends and family.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102215771277802367740", "name": "Erin Richardson", "time": 1562957856424, "rating": 5.0, "text": "Great experience with Corey from Autumn Air! He was very thorough in explaining the issues with our machine and spent the time needed to figure out what was wrong. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113104230959085533376", "name": "Jonathan Berry", "time": 1548120133406, "rating": 5.0, "text": "My elderly mother's heat went KaPut on her the other day. She didn't know what to do. I found this Autumn Air company local to her and gave them a ring. This feller named John Orange came out and fixed her heat pump jiffy quick like. He even took the time to compliment her on her fantastic sweet tea and fresh homemade bagels. Thanks guys.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114624028536945268351", "name": "Cheryl Cornelius", "time": 1560264798204, "rating": 5.0, "text": "I had Corey to come out and he was wonderful! Friendly, knowledgeable, very nice young man. I highly recommend this company.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "117196753277352681637", "name": "John Merriman", "time": 1548109767616, "rating": 5.0, "text": "Called with completely dead central air system, and weather headed below freezing. Mr. John Orange gave me a few tips on what to check, and was able to restore system. Saved me a bunch of money, didn't ask for a dime. Will definitely call next time I need service.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112741700873326303531", "name": "Shea Monroe", "time": 1533519865887, "rating": 5.0, "text": "Very professional service and very friendly service. Came out the SAME day and installed a BRAND NEW UNIT for less than we were quoted locally. Jeff and his team do an AMAZING JOB, would highly recommend to anyone in Alabama", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114117559407792423802", "name": "Robert Radice", "time": 1531058348954, "rating": 5.0, "text": "Called for service.  Casey was great and gave me same day appointment.  Charles, the professional who serviced my AC, arrived early and finished in an hour.  Great service by Charles, great attitude by Charles and a very reasonable price.  No doubt I will recommend Autumn Air!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114890766535244651729", "name": "Luke Cox", "time": 1555105685444, "rating": 5.0, "text": "Had Jessie come out today and give my AC unit a good spring cleaning!  He did a great job and I will be using Autumn Air for all my future heating and cooling system needs!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116284625515351441910", "name": "Robert Darling", "time": 1551719587171, "rating": 5.0, "text": "03-04-19.  Worked everything out on discount for new AC unit as their goodwill gesture from something in the past.  Jesse and Colin their service techs did a great job with removal of the old 10 seer unit putting in a new shiny Amana 14 seer unit.  While here Charles replaced blower motor on furnace that was giving an issue.  Great company!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112741700873326303531", "name": "Shea Monroe", "time": 1533519865887, "rating": 5.0, "text": "Very professional service and very friendly service. Came out the SAME day and installed a BRAND NEW UNIT for less than we were quoted locally. Jeff and his team do an AMAZING JOB, would highly recommend to anyone in Alabama", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "115148435656681996048", "name": "Alyce White", "time": 1597422040928, "rating": 5.0, "text": "Very thorough, knowledgeable, it shows he cares about his customers and is not just trying to sell a product. Can’t say enough about Autumn Air!!!", "pics": null, "resp": {"time": 1593532507617, "text": "Thank you for your kind words, and your review!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113672382212353983993", "name": "Debra Birchfield", "time": 1587586270934, "rating": 5.0, "text": "Tech was very thorough and explained everything to me.", "pics": null, "resp": {"time": 1593532620502, "text": "Thank you!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110228227924185488884", "name": "Brian Miller", "time": 1558836350695, "rating": 5.0, "text": "These folks really know what they're doing. How can I say that? Science and logic. Cory, the tech dispatched to our house, was top notch. Personable, thorough, and intelligent. He took the time to answer all my questions and was happy to discuss refrigeration cycles and psychrometrics in technical detail. I even learned a thing or two!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "108119197838129195172", "name": "Stanley Mink", "time": 1548172720129, "rating": 5.0, "text": "I call Autumn Air for all my heating and air needs I take care of several properties and they heave always been professional and gotten our tenants up and running. Call and ask for Casey and he can take care of you.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114117559407792423802", "name": "Robert Radice", "time": 1531058348954, "rating": 5.0, "text": "Called for service.  Casey was great and gave me same day appointment.  Charles, the professional who serviced my AC, arrived early and finished in an hour.  Great service by Charles, great attitude by Charles and a very reasonable price.  No doubt I will recommend Autumn Air!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114895349834457342453", "name": "Chris Glaze", "time": 1554230677793, "rating": 5.0, "text": "I can’t recommend Autumn Air enough. The guys were very professional and did a great job on our install. I would definitely recommend them to anybody needing heating and air work and will be using them again if any issues ever come up.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "104805819854497959953", "name": "harrykat 0ne", "time": 1532983969388, "rating": 5.0, "text": "A great experience from a very good company. I picked Autumn due to their high ratings when I googled them, and was not disappointed. A/C went out late Friday evening and called about 6pm, very friendly salesperson set up call for Saturday morning...needed a new compressor, so the owner got his supplier to open his warehouse and picked up the new compressor himself. A top notch installation crew met him at my house and they had everything done, cleaned up and cold air flowing by Saturday afternoon! Would highly recommend this company, great service especially on a hot weekend!  Jeff R, Ballantrae", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103018758182628438247", "name": "David Campbell", "time": 1582647476813, "rating": 5.0, "text": "They were great. They did a great job.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "117548018755012137008", "name": "Allison Coggin", "time": 1558642255995, "rating": 5.0, "text": "Highly recommend! Corey was my technician and he was so knowledgeable and did great work! I will always use this company!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112788418577795117047", "name": "Jonathan Smith", "time": 1548168817065, "rating": 5.0, "text": "Jessie and Collin are very professional and knowledgeable. I would highly recommend asking for them to do your service! You guys are AWESOME!!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116279014701009247631", "name": "Victoria Woods", "time": 1548168219251, "rating": 5.0, "text": "Jessie and Collin are very professional and  knowledgeable. I would highly recommend asking for them to do your service!  You guys are AWESOME!!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102264312963762140030", "name": "Dwight Tuggle II", "time": 1563024447117, "rating": 5.0, "text": "Autumn Air is an amazing company to use if you're having a/c problems. Corey was my technician, and he was friendly, knowledgeable, on time, and explained what my a/c problems. I would highly recommend using Autumn Air.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116751019085368863532", "name": "Brandon Tisdale", "time": 1537557593803, "rating": 5.0, "text": "I have used this company for AC needs in Birmingham and at Lake Martin. They sent a repairman down to Lake Martin on a day’s notice just to repair my unit..they do great work and can be trusted. They also cleaned up their job site prior to leaving. Nothing negative to say and would definitely recommend for any heating or cooling needs..in Birmingham and at the lake!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110272785520915971841", "name": "Bryan Pope", "time": 1503757633988, "rating": 5.0, "text": "So thankful for Jeff and his team. So professional, helpful, informative, and efficient. We called the night our air conditioner went out, Jeff came that night to offer options and quotes, then they arrived and installed the very next morning. They had the air on by lunch and completed modifications by dinner. Jeff considered our concerns and needs, then offered multiple options to meet both. Leaps and bounds above the competition. They made sure everything was properly set up and running as efficiently as possible before leaving. They even cleaned up after themselves. I highly recommend, especially if you have an out of date unit and and want to reduce your power bill. Fresh, Clean, Crisp Air all thanks to Jeff and his team.\n\nDescription of work:\nHeat Pump and Air Handler Replacement - increased from 4ton unit to 5ton unit - duct work modifications to accommodate increase. Original construction of our home, 12 years ago, was  rushed and the a/c and duct work was thrown together quickly and in a sloppy manner. Our duct work was constricting air flow and in need of modifications. Our power bill was astronomical. So we called Autumn Air.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116375683304923776054", "name": "Max Levi", "time": 1511898129933, "rating": 5.0, "text": "Autumn Air (Charles in particular), have been absolutely incredible!  My existing furnace kept cutting off in the mornings, but then it ran fine for most of the day.  It was a difficult thing to track down, and they never quit troubleshooting to get to the root of the issue so they could fix it the right way.\n\nThis took several trips, they tried several things, one at a time, to narrow it down.  Instead of changing a bunch of things or applying \"band-aids\", they worked hard to pinpoint the true issue.  It ended up being a piece of metal (limit) that was popping and shutting it off prematurely (before the heat limit actually occurred).  So a tiny faulty limit had to be found, and they found it.\n\nIt took a lot of patience and tedious work at times.  They just had the attitude of \"I'll find the root cause no matter what it takes, and I won't stop until I find and fix it.\"  I truly believe others would have given up or chalked it up to an issue with my new thermostat.\n\nI really appreciate the time and effort that was put into troubleshooting, not giving up, and finding the real issue, and fixing it the right way!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100520966996309775722", "name": "Deidre Stone", "time": 1501341069103, "rating": 5.0, "text": "We built our house just 3 Summers ago. During that 3 years it seems like either 1 unit or the other was in a struggle and the builder's installer was at my house at least every 6 months. It just never did heat or cool correctly and ran what seemed like constantly. You can imagine my frustration in a new home. This spring we called Autumn Air. They came right out and checked everything. They even went into the attic and found an issue with a clogged drain. (which the other guys never did) The air has been so cold all Summer that we can't set it under 74 without getting a chill and my power bill is HALF of what it has been in the past! Here we are 4 months later and my technician, Baker, gives me a courtesy call to just see how things are going since the service. I can't say enough good about these guys! Affordable, professional, and quick! I won t call or recommend  anyone but Autumn Air going forward!!Thanks for taking the stress out of my Summer!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114188369110825370019", "name": "Jamie Russi", "time": 1561738480868, "rating": 5.0, "text": "Very well pleased with autumn air and the service technician Jason was outstanding and very trustworthy!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113958667329379467599", "name": "Benjamin L", "time": 1525439349734, "rating": 5.0, "text": "Great Customer service and very fast installation. Called them to come service my AC unit and it was determined it was time to replace. They had it installed and working great that same afternoon. They are very good at what they do.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109546278756591612918", "name": "Jerrad Brooks", "time": 1554326303901, "rating": 5.0, "text": "Awesome and efficient service. Highly recommended. Corey was awesome, courteous, and professional.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101030663773875407706", "name": "LaShonda Burr", "time": 1552353295568, "rating": 5.0, "text": "I love this company!!! My dog was choking and this man stopped work on my heat pump and saved him! Thank the good lord for autumn air for saving my dog and installing my new heat pump! I want to tell the world!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "118437196139932817972", "name": "Jeanmarie McLemore", "time": 1589401329567, "rating": 5.0, "text": "Skip came to my home and repaired my a/c in one trip, had parts and equipment needed for the job.", "pics": null, "resp": {"time": 1593532473486, "text": "Thank you for your review!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "117879435719519621690", "name": "Michael Hull", "time": 1534122787647, "rating": 5.0, "text": "Great company with great leadership. Honest fair price with the most professional service. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101063794845626508126", "name": "Leroy Varner", "time": 1548108114337, "rating": 5.0, "text": "Jesse at autumn air is the best most respectful tech I have ever seen. Highly recommend this company", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112288604134238077576", "name": "Joe Waller", "time": 1510073452576, "rating": 5.0, "text": "If you need help with a broken AC like I did, call Autumn heating and cooling. Great company dealing with HVAC installs and repairs. Friendly, professional service at a good price. Thanks!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100252893685993779623", "name": "don't fuck w/my shit kat", "time": 1510031543658, "rating": 5.0, "text": "Autumn Air Heating & Cooling,\nAre very professional, coutisus, & respectful. They arrive on time and they work extremely efficiently, they had to come inside my home once or twice. They knocked each time to get permission but other than that I didn't even know they were working inside my home unlike other companies that I've done business with in the past.\nThen when it come time to explain my new digital thermostat, my installer explained how to program & work the thermostat. Then he walked me through step by step, having me doing the programming, which made it so much easier to learn & understand.\nI couldn't be more happier with my experience with Autumn Air Heating & Cooling, I'll never use another heating & cooling company ever again. And since the moment they left I've been telling everyone I know about Autumn Air Heating & Cooling, and I plan to continue to tell as many people as I can about, how great Autumn Air is.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100420289009299089025", "name": "jeremy shepherd", "time": 1562794351187, "rating": 5.0, "text": "They were great came out and fixed my unit same day.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116567772930354561213", "name": "Laura Edwards", "time": 1499627856656, "rating": 1.0, "text": "We were charged $625 for work that didn't solve the problem for which we called. After multiple attempts they continually didn't solve the problem despite overpaying for services we didn't need. They have refused to refund any money and offered insulting proposals.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114389590910567860951", "name": "Jordan Kinard", "time": 1510098673038, "rating": 5.0, "text": "I had my A/C unit replaced by Baker Orange and the guys at Autumn Air Heating and Cooling. They were very professional and completed the job in a timely manner. I highly recommend Baker for any heating and cooling job.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110986212795698008924", "name": "Tammy Fitzpatrick", "time": 1541515284243, "rating": 5.0, "text": "Looking for great professional service. Look no further call Autumn Air today. Very please with their work. On time clean and organized. And experience is a plus. They are looking to expand to Millbrook , Prattvillle and Montgomery. Call them today for your Heating and Air conditioning needs.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116720391855917823716", "name": "jerry bailey", "time": 1537974116011, "rating": 5.0, "text": "Jesse and Colin did great job.  Gave free furnace check.   New flue looks great.    Will call again", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100525699462639505126", "name": "Matt Zartuche", "time": 1510072340061, "rating": 5.0, "text": "Great service! The folks are super friendly and they have very good pricing. They made us a priority and didnt push us off till the next day even though it was late. Super professional and I would recommend them to anyone in need of service.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105006786104892154583", "name": "Hank Powers", "time": 1508515490964, "rating": 5.0, "text": "I highly recommend Jeff Franklin and his team! Good pricing, GREAT service and 100% professional. Thank you for taking such good care of us.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101595782316904029128", "name": "Ryan H", "time": 1567449281755, "rating": 5.0, "text": "Ac went out on Labor Day. Autumn air was at my house within 30 mins of placing the service call and Cory had me back up and running within the hour. Amazing service and super nice people to do business with. Thank you!!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111897549068658941741", "name": "Wanda Short", "time": 1548172313349, "rating": 5.0, "text": "Called Autumn Air and spoke with Casey and he got some one out to my home quick and got my heat back running.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102856811430667952176", "name": "Cyndi Johnson", "time": 1504735100271, "rating": 5.0, "text": "Charles Alexander came to clean & inspect our AC & heating systems. He was punctual, very professional, knowledgeable, and courteous. I highly recommend this company and will be using their services in the future.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "118178402987989382465", "name": "Woody Armstrong", "time": 1511880140824, "rating": 5.0, "text": "I have been with a different local HVAC company for the past 4 years. I had been content with them and their service until I had a repair. I had a capacitor go out and I was charged over $300 to replace it. I didn't think much about it until I shared my story with a few people who know what they are talking about. Turns out it was a steep price! I lost TRUST and confidence with them for work. I heard Autumn advertising on WDJC and thought I would check them out. Their monthly maintenance program is very reasonably priced and I even quizzed them on how much a capacitor replacement would run...much more reasonable! So I made the switch and scheduled my first maintenance visit...next day I might add and not in 6 weeks like the other. I was once again shocked at how bad my other service companies quality of work was for maintenance as Charlie showed me all of the stuff that wasn't being done! So, I am very happy I made the switch and hopeful that I have a company I can trust!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112967518708912016715", "name": "Steven Harris", "time": 1563819216569, "rating": 5.0, "text": "Corey was our technician and he was great! Got us fixed in no time.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "118306722754339770519", "name": "Jesse Deloney", "time": 1536846761836, "rating": 5.0, "text": "It's a great work place and the work we do is outstanding if anyone needs a new a.c. or anything serviced y'all won't regret it at all give us a call", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114385542479519258526", "name": "JD Chainsaw", "time": 1527211599996, "rating": 5.0, "text": "Autumn Air Pelham staff were all extremely courteous and professional.  They arrived early and answered all our questions.  AC they recommended works great and they installed it quickly, just in time for a hot AL summer.  Great people.  If you're anywhere in Bham use these guys!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "117171866839634721722", "name": "Jayda Shafer", "time": 1537810199530, "rating": 5.0, "text": "Jesse and Colin did a fantastic job! Quick, curteous, and cleaned up quickly! Will definitely be using them again!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "108391917073431941023", "name": "Mike Brunetti", "time": 1530910464941, "rating": 5.0, "text": "Quick service and exactly what the problem was after I explained what happened.\nFriendly and quick to repair - even cane earlier than scheduled", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "107399572662075931564", "name": "MadcityStudios and PacilloWild", "time": 1510070475983, "rating": 5.0, "text": "Great family owned business.  Saved me about $120 dollars a month with the new unit installed.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112451417478434948884", "name": "Benjamin Wildman", "time": 1552965009128, "rating": 5.0, "text": "Thanks to collin and jesse for the install.  Everything looks good, friendly, helpful, and cleaned up after themselves. Time will tell how quality the install was.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109910395971090812768", "name": "Chris Watts", "time": 1534433073880, "rating": 5.0, "text": "Jesse and Charles did a fantastic job and stayed late to make sure I had air conditioning before they left and they cleaned up very good and god it done in a orderly fashion I would highly recommend autumn air", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105198682712639553074", "name": "Joel White", "time": 1595457023658, "rating": 5.0, "text": "Very courteous and professional", "pics": null, "resp": {"time": 1595602403234, "text": "Thank you!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "115461121364613262538", "name": "Lee McCarty", "time": 1469153449402, "rating": 5.0, "text": "Our air conditioner decided to break down late Friday night, so I found myself in the position of trying to find someone to come out on Saturday to fix it. After calling numerous other companies that were in my area, each time just being told they had no available service time except later in the week, (none of them even asked exactly what the unit was doing, or what was wrong). I found Autumn Air online, and even though they weren't in my area, I figured I had nothing to lose trying them. My call was answered professionally, and he took my info and told me that they were pretty full for the day, but that they would try to fit me in. He asked me for details on what was wrong. After about 10 minutes, he called me back saying that they had a cancellation and a tech could be. at the house in about an hour. An hour later the tech was here and within 30 minutes we had cool air!!! I want to thank Autumn Air for taking the time to talk to me and for fitting me into their busy schedule on such a hot Saturday. The price was VERY reasonable, especially considering that it was a Saturday in the busy Summer season. I would recommend this company to everyone I know!", "pics": null, "resp": {"time": 1469300580118, "text": "Lee thanks so much for the recommendation.  Please let us know if we can help you in the future."}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102472723042847874856", "name": "Alex Symonds", "time": 1510341984344, "rating": 5.0, "text": "What a fantastic service from start to finish! They made the whole process so easy. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116818064743500135921", "name": "Brad (MrAdventure89)", "time": 1558124068520, "rating": 5.0, "text": "Corry was great! Very transparent and helpful!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111976200416729627755", "name": "David Thebigguy", "time": 1510084056386, "rating": 5.0, "text": "Great guys, great work. Honest and straightforward.  Another company said I needed a new compressor, John and his crew found a minor problem, and fixed my existing unit.  They were conscientious of my personal space. They were clean, well mannered. And not at all judgemental. I will definitely be a repeat customer if I need any HVAC work in the future.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101518584955887691180", "name": "Darlene Franklin", "time": 1464451551823, "rating": 5.0, "text": "Awesome company! reliable and honest!  Nice people to do business with.  Would recommend!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103629218486334923927", "name": "Polly Oneal", "time": 1539803377413, "rating": 5.0, "text": "Polite, prompt. Thank you for such a great job!!! Great communication!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110115573415183766979", "name": "Justin Moore", "time": 1510083311085, "rating": 5.0, "text": "John is a big strong man who knows his HVAC and does good work! Definitely recommend them.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102858653165732446529", "name": "ashley mccarty", "time": 1532381732180, "rating": 5.0, "text": "Autumn air are friendly and great people! Cant beat Autumn Air prices! Thanks Guys!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100624183962005477146", "name": "Lisa Cahela", "time": 1510086357068, "rating": 5.0, "text": "Baker Orange is very professional and highly skilled. I definitely recommend him and Autumn Air for any A/C and heating needs.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109784538526059509211", "name": "pete files", "time": 1530735012398, "rating": 5.0, "text": "Techs are very thorough and answer all my questions. Great prices", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102131249923942309585", "name": "Fred Cross", "time": 1464187167626, "rating": 5.0, "text": "It’s hard to find a service company you can trust, and when you do you want to let others know! Autumn Air Heating and Cooling of Pelham Alabama is a company you can trust to arrive on time, do the work right the first time, charge a reasonable price and not try to sell you something you don’t need.  My wife and I have recommended them to all our friends and family.  We would not use anyone else!!", "pics": null, "resp": {"time": 1464262467217, "text": "Fred thank you for your business, please let us know if we can help you out again."}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111860706399687589229", "name": "Jonathan Ray", "time": 1510296457991, "rating": 5.0, "text": "The best HVAC company around...and I’ve had to use several different ones over the years. So glad to have found Autumn Air.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102448096004942461313", "name": "William Burch", "time": 1469503004954, "rating": 5.0, "text": "The absolute best experience I've ever had with a heating and air company hands down. They were on time, extremely knowledgeable , and had the best price of the three quotes I got. When installing my equipment they were quick without the loss of quality workmanship. This Amana equipment is the quietest ac I've ever heard, and my house is cooler than it has ever been due to their focus on air flow. Without Autumn Air I would have spent more money on lesser equipment. They are a wonderful group of guys that can make you happy  just by doing their job. Looks like I'm going to have to take them deep sea fishing on my boat real soon because I still feel like I should owe them something extra for a job well done. Keep up the good work guys!!!!", "pics": null, "resp": {"time": 1469701719024, "text": "William thanks for being such a good customer, please let us know if we can help you out with any of your heating and air needs in the future."}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113824937279567605277", "name": "Derrick Defoor", "time": 1510080147087, "rating": 5.0, "text": "Great work at great prices. Professionally ran business and I will use them again.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102718257279127607467", "name": "William Carlton", "time": 1510027191715, "rating": 5.0, "text": "Installed my system two years ago. Great company to work with. Very professional.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101651340216399204594", "name": "Fun Fidgets And Toys", "time": 1530406333966, "rating": 5.0, "text": "Awesome prices quick to answer any questions and get the job done right the first time.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105393348306687452042", "name": "Dan Rogers", "time": 1510103545523, "rating": 5.0, "text": "Very professional, fast service and very knowledgeable. Plus he's a bit of eye candy.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109313898868877781439", "name": "Vikki Grodner", "time": 1551677211444, "rating": 5.0, "text": "Always quick to respond, reasonable and hard working", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "117680239016305752665", "name": "daniel ortega", "time": 1510112020225, "rating": 5.0, "text": "Super professional, very reliable and great pricing!! Service guys were very respectful and helpful and it was a great first time experience!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100167017797865903774", "name": "Training", "time": 1554331196010, "rating": 1.0, "text": "The most misinformed, mismanaged business I have ever dealt with. If you have unlimited time and a gullible ear, this place is for you. Fool me once, shame on you; fool me twice...never again! Save your time and your sanity, choose someone else.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109250225149120538485", "name": "spiral out keep going", "time": 1530406120398, "rating": 5.0, "text": "They have awesome prices and are very quick to get things done.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101920081161297320890", "name": "jb", "time": 1471283639320, "rating": 5.0, "text": "The Autumn Air specialist was on time, courteous, and knowledgeable.  I would highly recommend this company!", "pics": null, "resp": {"time": 1471284624798, "text": "Thanks for letting us know, we really appreciate your business.  Let us know if we can help in any of your heat and air needs in the future."}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102066023796612612944", "name": "Ryan Carr", "time": 1531875830018, "rating": 5.0, "text": "Jesse, Javi, and Colin did a great job and got the job done quickly. Great company!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "107791395701616844824", "name": "patrick hyatt", "time": 1510070374600, "rating": 5.0, "text": "Friendly, knowledgeable and a no nonsense approach to repairing our system. Thank you.\n\nSincerely,\nPatrick", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111000664038507744596", "name": "Lila Love", "time": 1530850839711, "rating": 5.0, "text": "Awesome company honest people best prices around and great technicians.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105692188664609044783", "name": "Amy Mansell", "time": 1510101069716, "rating": 5.0, "text": "Ahh-mazing company! Very professional and great at what they do! I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112582794471331261046", "name": "Erin Olivia", "time": 1548107223446, "rating": 5.0, "text": "Very friendly staff and great work. Thank you Baker Orange!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112313344070345813674", "name": "Ronnie Aldrich", "time": 1510168215941, "rating": 5.0, "text": "Dependable, honest and do what they say they will do.  I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101723803963117757805", "name": "Sandra Mays", "time": 1530735616399, "rating": 5.0, "text": "Unbeatable prices and all of my questions were answered.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111069873407952342824", "name": "Keith Bates", "time": 1563224794755, "rating": 5.0, "text": "Prompt! Courteous! Affordable!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103708172616100717808", "name": "Josh Sasser", "time": 1510077426168, "rating": 5.0, "text": "Great company. John was helpful in resolving my A/C issues and was persistent in finding the problem.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114668563718108993918", "name": "Barbara Jackson", "time": 1504711510075, "rating": 5.0, "text": "Thank you for the very informative service.  We learned something very important about our heating unit that needs attention before cold weather is here.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109743695222806516621", "name": "Virginia Crawford", "time": 1487355865268, "rating": 5.0, "text": "Great experience! Friendly and professional and great value!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110867211508870012096", "name": "Kristi Kinard", "time": 1501090420503, "rating": 5.0, "text": "Amazing service! Super quick to have repairs completed! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109743695222806516621", "name": "Virginia Crawford", "time": 1487355865268, "rating": 5.0, "text": "Great experience! Friendly and professional and great value!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102450548500126610366", "name": "Samantha Sams", "time": 1548173589982, "rating": 5.0, "text": "My heat went out, and I called and spoke with Casey. He got a tech out to fix my heat quick.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103362678538109683628", "name": "debra perry", "time": 1620244342278, "rating": 5.0, "text": "Nick was Awesome. Great job.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100592353513098366069", "name": "Brittany Day", "time": 1510162608147, "rating": 5.0, "text": "Jeff and his team are the best! They have done a great job for everyone I have talked to, and they are the only ones I trust to come to my house.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112639984367843769359", "name": "Serenity Mays", "time": 1530460712438, "rating": 5.0, "text": "Awesome service answered all my questions", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110023066720912830661", "name": "amanda stephens", "time": 1510191870381, "rating": 5.0, "text": "Highly recommend this company - amazing employees .", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102626244933016082531", "name": "Will Eaton", "time": 1510084964078, "rating": 5.0, "text": "Great people, great service, quality products", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116320296543595768595", "name": "Kyle Morgan", "time": 1510079472614, "rating": 5.0, "text": "Great service! Defiantly recommend!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101217092177140535570", "name": "Ray Thompson", "time": 1548112888031, "rating": 5.0, "text": "heat stopped working and i was out of town working...friend told me to call John orange and I'm glad i did turned out to be a bad thermostat and he took care of it quickly so my kiddos had heat while i was so far from home...thanks again John!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114357373615491629573", "name": "Shukeedria Mclin", "time": 1510071088941, "rating": 5.0, "text": "Awesome Customer Service and Quality Work.....", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101217092177140535570", "name": "Ray Thompson", "time": 1548112888031, "rating": 5.0, "text": "heat stopped working and i was out of town working...friend told me to call John orange and I'm glad i did turned out to be a bad thermostat and he took care of it quickly so my kiddos had heat while i was so far from home...thanks again John!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109294538302316588906", "name": "Khali Pegues", "time": 1510186982707, "rating": 5.0, "text": "Great shop, great work, and better business!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114145757039327224826", "name": "Ramey Akerman", "time": 1510104998954, "rating": 5.0, "text": "Very professional and reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100909525615382186151", "name": "Joseph Cater", "time": 1530735536482, "rating": 5.0, "text": "Awesome people and great prices", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "107142640019315733917", "name": "Michael Damsky", "time": 1614024381696, "rating": 5.0, "text": "Professional", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111752797277201356504", "name": "Cheryl Stevens", "time": 1548177158440, "rating": 5.0, "text": "I called last week when my heat went out in the middle of the night. I talked to Casey and told him my issue and he got a dispatched a technician and they got my heat working for me. Thanks for everything.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113700947581853710266", "name": "Craig Cosper", "time": 1510338338604, "rating": 5.0, "text": "Very thorough service.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105289101991491726318", "name": "Michael Stewart", "time": 1510072750825, "rating": 5.0, "text": "Great family business.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "115889425150488751002", "name": "Riley Carroll", "time": 1530850955351, "rating": 5.0, "text": "Good honest workers and prices", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100786131223871409377", "name": "Marc Wendorf", "time": 1541649552572, "rating": 5.0, "text": "Good people to work with", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "106585216560761685800", "name": "Skylo Bones", "time": 1530465274437, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105740150225271206576", "name": "jonna franklin", "time": 1535130167657, "rating": 5.0, "text": "love this company", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "104300002733378250971", "name": "Hunter Files", "time": 1530734725716, "rating": 5.0, "text": "Great prices!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116890901819497206165", "name": "Sarah Posey", "time": 1530465435986, "rating": 5.0, "text": "Awesome business", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111808122049063317706", "name": "Sonya Mays", "time": 1530465209589, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116476266576241868633", "name": "I dont knoww", "time": 1530241783128, "rating": 5.0, "text": "great staff", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113700947581853710266", "name": "Craig Cosper", "time": 1510338338604, "rating": 5.0, "text": "Very thorough service.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103045002817864560781", "name": "Johnny Holley", "time": 1510105700697, "rating": 5.0, "text": "Stand up company.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "118125066236925089957", "name": "justin pattillo", "time": 1510082195744, "rating": 5.0, "text": "Professional, on time, and trustworthy.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102728788011595288870", "name": "Zach Burchfield", "time": 1510070697130, "rating": 5.0, "text": "Great company", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "115889425150488751002", "name": "Riley Carroll", "time": 1530850955351, "rating": 5.0, "text": "Good honest workers and prices", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105289101991491726318", "name": "Michael Stewart", "time": 1510072750825, "rating": 5.0, "text": "Great family business.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "108275605117818350028", "name": "Jennifer Isbell", "time": 1582844541656, "rating": 5.0, "text": "Cliff arrived an hour ahead of schedule and was the best we could ask for in answering the millions of questions we asked. Did a wonderful job and cleaned up afterwards. Will use him again for any future repairs/improvements.", "pics": null, "resp": null, "gmap_id": "0x8888dcf2e8eb4211:0x73e2711def0dff48"}
{"user_id": "106255377543096179568", "name": "Dustin Love", "time": 1561383711325, "rating": 5.0, "text": "Great Electrician. I have been working with this company for several years and know that they will be fair and provide quality work. Always on time, do what they say they will do and work is done to code. Second to none.", "pics": null, "resp": null, "gmap_id": "0x8888dcf2e8eb4211:0x73e2711def0dff48"}
{"user_id": "102993565637065628945", "name": "Supa CG", "time": 1545517869582, "rating": 5.0, "text": "You won’t find a better electrician than Jason!!! He’s a life saver!", "pics": null, "resp": null, "gmap_id": "0x8888dcf2e8eb4211:0x73e2711def0dff48"}
{"user_id": "109389095950009573466", "name": "Jason Bearden", "time": 1530652495385, "rating": 5.0, "text": "Eddie is a great guy and provides exceptional service", "pics": null, "resp": null, "gmap_id": "0x8888dcf2e8eb4211:0x73e2711def0dff48"}
{"user_id": "102619139605829854724", "name": "Gary Jones", "time": 1623076275809, "rating": 2.0, "text": "I scheduled appointment to quote 7 separate electrical improvements in my house. They contacted me the day of appointment to ask to reschedule. We rescheduled for two weeks out. After calling in late to work to be present for an 8:00 appointment, I waited until 9:30. No show. I called the home office number. They explained that there was a circumstance that made them late; didn't know when they would arrive. I cancelled the appointment and will use another company that showed up the first time, on time. I gave two stars because Mr. Electric was recommended. Can't be all bad. But, really need to work on communication.", "pics": null, "resp": {"time": 1623078348355, "text": "Gary, we do value your time and regret that this was your experience. Customer service is always a top priority at Mr. Electric, and while we have fallen short in this instance, we do appreciate your feedback and will make adjustments on our end so that we are able to better serve our customers going forward. Thank you."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "100067580390410000901", "name": "Rosie Smoots", "time": 1595004944534, "rating": 5.0, "text": "I’m SO pleased with their service!!! I wanted to install a ceiling fan on my covered porch. I contacted my regular electrician and after waiting a week and a half, I was told it can’t be done. I then contacted a second electrician and was told it can be done but the wires won’t be hidden and it will be “very unsightly”.  I decided to try Mr. Electric because the quote was free and timely. David Hurley came out within an hour of me calling and gave me a fair estimate. Less than 48 hours later I’m now enjoying my new ceiling fan (with no exposed wires) on my covered porch!!!! The job was quick, he explained my warranties AND he cleaned up after himself which I was not expecting! I’d recommend Mr. Electric for any of your electrical needs. 5-stars", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNqpkqnIgvR_MZIP9v1HKlvdL_rqn3pJDf83jCk=w150-h150-k-no-p"]}], "resp": {"time": 1595184577571, "text": "That is great to hear, Rosie! We appreciate your comments and are glad to hear you are enjoying your porch even more with your new fan. Thank you for your business, and let us know if there is anything else we can do for you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104346404322517679439", "name": "James Ocallaghan", "time": 1616718520025, "rating": 5.0, "text": "Electrician was on time (Mitch Davis) completely inspected all electrical systems in my home. Updated all switches, etc. to code. Updated the outside panel box. Technician was very knowledgeable and did not stop until all was completed. I have dealt with other electrical people in the past but I find this Company to be very fair and efficient. A job well done. Without hesitation, I would recommend Mr.Electric to everyone who has electrical work in their home.", "pics": null, "resp": {"time": 1616721037080, "text": "We appreciate your comments, James. Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "101019162352161705193", "name": "Chlora Evans", "time": 1622126598583, "rating": 5.0, "text": "The Serviceman was VERY helpful. He explained what and why I needed to have done in order for electrical service to be restored after a recent storm. The charges were reasonable and affordable and the work was started the same day. THANKS to all the people who were involved in restoring my power and faith in service people. You make doing business with your company a pleaser. Keep up the GREERAT work.", "pics": null, "resp": {"time": 1622139860735, "text": "Chlora, those are kind words, and we appreciate your feedback. We are glad we were able to get your power restored after the storm. Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "106506304649906991813", "name": "Jessica Joyner", "time": 1517881286561, "rating": 5.0, "text": "First off I was looking on Home Adviser for an electrician. I hadn't even fully completed my search and I was receiving a call from Mr. Electric to see what I needed done and when I wanted them to come out and get a free estimate. Yes! I said, \"free estimate.\" That same day, an electrician was sent out and gave me quotes on all my projects. Electrician did not pressure me to do any projects that day and I was able to take 3 weeks and save up the money that I needed to get the project done. The day the electrician came out, he went above and beyond! I will use this company again and again!!!!!!!!! Thank you!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPiOX7kiFLrO6F4Kr_kf_dZINqmLTw5CZPV3Ks1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN6MRm_Bqvzpmdq4vQyV_Dm8ZdSN4oYZh6szGcE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPbSUcFnpmJFQkzVjRdsfaTrovq21dvOWFBJLKM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMLZbUkchAtP4VtvqSszav8TIE-Oq9MDocHUPc5=w150-h150-k-no-p"]}], "resp": {"time": 1520365574698, "text": "Ms. Joyner,\n\nWe value each and every customer here at Mr Electric of Montgomery and we so\n\nappreciate your business! My words can't fully express how much it means to us to\n\nhear from customers like you who know how valuable good service is these days.\n\nThank you for your trust!\n\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "117082433041555008976", "name": "Thad Aldridge", "time": 1616110136266, "rating": 5.0, "text": "Incredible service. Mitch did an inspection of the entire house and recommended several items that would prevent time and money spent later. He explained each aspect of the work, and never rushed me. I took his recommendations and called in someone so they could complete the job that day. I will use Mr. Electric forever.", "pics": null, "resp": {"time": 1616114932427, "text": "Thad, we appreciate your comments and are so glad to hear that you are please with everything. Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "102976661173300421774", "name": "Tamara Lewis", "time": 1620157439992, "rating": 5.0, "text": "Mr. Electric your technicians were professional, matter-of-fact and patience in showing me more than I called them out here for. As a matter of fact, the over look of my safety is something I always wanted to have done when it came to my electric service on my home. Especially, since this is an older home and I noticed times, my lights in areas flickers. I thought this kind of inspection would cost a fortune, so I'm glad today it was finally done. Now, I know! As soon as, I save the money I will call you Mr. Electric, I would like those same two technician to come back, because they were so kind and jumped on the straight to the issues I been concern about for years. One even locked my door back for me. How nice.", "pics": null, "resp": {"time": 1620171623073, "text": "Thank you, Tamara! We are so glad to hear that you were so pleased with your service call. When you need us to come back, we are just a phone call away. We appreciate having you as a customer."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "118011373337441247601", "name": "Les Andrew", "time": 1612208701289, "rating": 5.0, "text": "These guys are phenomenal. We had such an amazing experience with Mr. Electric and will be using them in the future for any electrical needs. We have had a hard time finding good service on various hour projects, and this company was like a breath of fresh air! Highly recommend!", "pics": null, "resp": {"time": 1612296431773, "text": "Great to hear, Les! We appreciate your comments. Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "101892100271827943164", "name": "Kelli Pohlman", "time": 1620055875781, "rating": 5.0, "text": "This company was half the price of another competitor and did an even better job! I was very pleased with the service, result, and price.", "pics": null, "resp": {"time": 1620066614238, "text": "We appreciate your comments, Kelli! Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103456519289440997943", "name": "Catherine Ridling", "time": 1621650682578, "rating": 5.0, "text": "They were very quick to respond, and replaced the wire to my outbuilding\nQuickly and efficiently, for a very reasonable price.", "pics": null, "resp": {"time": 1621822024878, "text": "We appreciate your comments, Catherine, and are pleased to hear that you were happy with your service. Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "112448708996185450809", "name": "Maria Owens", "time": 1617280401942, "rating": 5.0, "text": "He was very respectful and had excellent customer service. We will definitely use your company again.", "pics": null, "resp": {"time": 1617297203315, "text": "Thank you, Maria! We appreciate your comments and are glad to hear that you were happy with your service call. Have a great day!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "111614494448090786421", "name": "Linda Ware", "time": 1621886008144, "rating": 5.0, "text": "Great work. Affordable prices!", "pics": null, "resp": {"time": 1621911371502, "text": "Thank you, Linda!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "107311029172708558576", "name": "Eddie Warren", "time": 1615098421099, "rating": 5.0, "text": "Mr. Electric is very professional and perform high quality work.  I will definitely be using them again in the future!!", "pics": null, "resp": {"time": 1615225684625, "text": "Thank you, Eddie! We appreciate your comments and we are glad to have you as a customer!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "109147436317041029133", "name": "Cornesia Lewis", "time": 1615401612670, "rating": 5.0, "text": "I was able to get an appointment the next day after Dixie electric failed to show up made appointment few days prior no call/no show. Highly recommend this company , Mitch was awesome, he got in and got the job done.", "pics": null, "resp": {"time": 1615556919596, "text": "We are so glad Mitch could get you taken care of, Cornesia. Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "116595709822541793681", "name": "cmiller4au", "time": 1601326362954, "rating": 5.0, "text": "Great experience!  Our provider was professional and efficient.  He even called a day early and said he had time if I wanted him to come on.  Wonderful service, from the sweet lady who took my call to the quickly and reasonably priced repair!", "pics": null, "resp": {"time": 1601393678217, "text": "We appreciate your comments! Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "109245196765702964129", "name": "Gina Mills", "time": 1597881173428, "rating": 5.0, "text": "We needed to have our breaker panel inspected. The woman that answered the phone was polite and helpful. They were able to have someone come over the next day. Mr. Rudder gave us a courtesy call to let us know when he'd be here and he was on time. He was professional, thorough and courteous in his service. Thanks Mr. Rudder for doing a good job! I would definitely recommend Mr. Electric.", "pics": null, "resp": {"time": 1605470726546, "text": "We appreciate your comments, Gina! Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "117773608684574562949", "name": "Mark Lively", "time": 1600738575580, "rating": 5.0, "text": "I called Mr.Electric to give me a price quote on outdoor security lighting and they sent Mr. Justin Walker over and after taking to him for a few minutes I knew right off that he is a professional and knew exactly what I wanted and explained to me exactly what he was going to do to install it,after installation he explained the operation of the system ,when I pulled up to my hom tonight it was exactly what I wanted to see very well illuminated and very professional looking job,the price was very affordable also,Thank you Justin for your professional work!!! We love it!! Thank you Mr.Electric for having professional and polite employees.", "pics": null, "resp": {"time": 1600744775852, "text": "That is great to hear, Mark! We appreciate your comments and will pass them along to Justin's supervisor. We thank you for choosing Mr. Electric."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "116188492204829349088", "name": "Charles Adams", "time": 1602111364878, "rating": 5.0, "text": "I called on MR Electric to install a new thermostat and doorbell for a rental home that I manage.  Mitch Davis was able to schedule me in the next day and was very professional.  Always wearing protective wear every time he entered the house.  He did a great job and I will call on him again in the future.", "pics": null, "resp": {"time": 1602116004591, "text": "We appreciate your comments, Charles, and are glad Mitch could get you taken care of.  Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "101859264983574586973", "name": "Vivian Chestnut", "time": 1600980829561, "rating": 5.0, "text": "Mr. Davis, licensed technician, arrived before time, after calling 1st, and did an excellent job installing 2 fans in a very short period of time. After determining 1 fan had to be replaced, I purchased it online; and Mr. Davis picked it up.\nIn addition to the excellent service, he was a\"true\" professional!", "pics": null, "resp": {"time": 1600993208818, "text": "We appreciate your comments, Vivian. Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "113545947569618960489", "name": "Bettye Hodrick", "time": 1596839466091, "rating": 5.0, "text": "VERY,  VERY  GOOD SERVICE'S,  VERY RESPECTFUL,  NOT VERY  HIGH  PRICED,  GOOD PERSONALLY,  I TOLD  ALL MY FRIENDS AND FAMILY  ABOUT  YOUR SERVICE.  YOUALL GIVE DISCOUNTS  TO SENIORS CITIZENS  ALSO. I WILL HIRE  YOU'RE  AGAIN  ANY  TIME  I NEED A ELECTRIC  JOB  DONE.  YOU'LL  ARE THE BEST  IN MONTGOMERY.  EXCELLENT, LL I CAN SAY.. THANK  YOU  FOR  YOUR  SERVICE..!!", "pics": null, "resp": {"time": 1596839961106, "text": "Thank you, Bettye! It makes us happy to know that you were so pleased with our service!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103759798790065839824", "name": "Cheryl Davitz", "time": 1597424925179, "rating": 5.0, "text": "I had neighbors tree fall in driveway and it damaged wires running to my outside power box. Thomas Rudder was my electrician. He was professional and took care of getting my power restored as soon as possible working with power company and the people who came to remove the part of tree in my yard. I will call this company again if I need anything electrical done.", "pics": null, "resp": {"time": 1597616997657, "text": "Thank you, Cheryl! We are sorry about the damage the tree caused you, but we are glad we could get you taken care of."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "116130839197093869876", "name": "Yahnira Backus", "time": 1595008581676, "rating": 5.0, "text": "I was worried that it was going to cost too much to fix our electrical issues with our home. However, the electrician answered all of my questions and we were able to get ALL of our issues resolved within our budget! He was professional and friendly!! An added bonus! I will definitely use Mr. Electric again, and I recommend it for anyone wanting to sell their home!!", "pics": null, "resp": {"time": 1595184654939, "text": "We appreciate your comments, Yahnira! Thank you for your business, and let us know if there is anything else we can do for you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "112391564560170493223", "name": "Joel Lawson", "time": 1603121098344, "rating": 5.0, "text": "Very friendly and knowledgeable service! Patiently answered all of my questions. Highly recommended.", "pics": null, "resp": {"time": 1603121738132, "text": "Thank you for your comments and for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "101284082162694347617", "name": "Cheryl Westlake", "time": 1596749733966, "rating": 5.0, "text": "On my first call in, I was able to promptly schedule a technician to come do the job we needed. The technician, Mitch, called us when he was on his way, showed up exactly when he was supposed to, explained exactly what he needed to do and how much it would cost, allowed us to approve that before getting to work, and then immediately performed the work quickly and efficiently. You won't find better service anywhere. I will definitely be using them again for any further electrical needs.", "pics": null, "resp": {"time": 1596804757170, "text": "Thank you, Cheryl! We appreciate your comments and we are glad Mitch could get you taken care of. If you need anything in the future, we’re just a phone call away!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108585840715180800421", "name": "Tegan Frazier", "time": 1600524417408, "rating": 5.0, "text": "We called another electrician that never showed up to repair our issue. Then, we called Mr. Electric and they came the very next day. The electrician with Mr. Electric arrived on time, came wearing a mask and shoe covers, completed the work, and he was very professional. I highly recommend Mr. Electric.", "pics": null, "resp": {"time": 1600554048871, "text": "Glad we could get you taken care of, Tegan! Thank you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "105096234536462069967", "name": "Lorene Collins", "time": 1593032951380, "rating": 4.0, "text": "The Technicians were friendly and knowledgable. They provided information(prices and exactly what needed to be fixed)that I as homeowner needed to know. This job have been on my to-do list for a few years now. I am a retired homeowner who live on a budget but thank you so much for good service and I will recommend your service to my friends and neighbors.", "pics": null, "resp": {"time": 1593184101834, "text": "Thank you, Lorene! We appreciate your comments. Let us know if there is anything else we can do for you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "100617846307210632427", "name": "Todd Swale", "time": 1620341077294, "rating": 5.0, "text": "Professional, detailed oriented, clean at completion", "pics": null, "resp": {"time": 1620343342677, "text": "Thank you, Todd!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108963380868059369872", "name": "Joyce Davis", "time": 1598918408780, "rating": 5.0, "text": "Mitch, technician did a fantastic 👏  job. Very professional and knowledgeable about the items that needed to be repaired.", "pics": null, "resp": {"time": 1598928623314, "text": "Great to hear, Joyce! We will pass your comments on to Mitch's supervisor. Thank you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "116254377911226042736", "name": "Mickey Andrews", "time": 1576174902563, "rating": 5.0, "text": "Quick response to the electrical issue with our oven wall unit. Quality work and reasonable cost. Good customer service and attitude from both office staff and electrician. Signed up for their Advantage Plan and will certainly call on them again when need arises.", "pics": null, "resp": {"time": 1576200979154, "text": "Thank you, Mickey! We appreciate having you as a customer!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108647579327454837073", "name": "Kelly Barganier", "time": 1582600542537, "rating": 5.0, "text": "Very impressed with their service. I had an emergency and they were able to come to my house within 30 minutes of calling. The technician was very knowledgeable and assessed and fixed the problem quickly.", "pics": null, "resp": {"time": 1582744540935, "text": "Thank you, Kelly! We are so glad we could get you taken care of!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "116108323722683767820", "name": "TheJeffrey575", "time": 1575579038819, "rating": 5.0, "text": "After scheduling a job I was notified the day before the scheduled electrical work to remind me the electrician was coming and the time within 30 minutes. The electrician showed up right on time ready to estimate the job. After we agreed on the costs the electrician was ready to get started right then! We were used to a contractor estimating a job and notifying us, sometimes a few days later, when they could start work. Not the case with Mr. Electric! The electrician was ready to start.\n\nAs the job progressed we needed to make a few changes, so the electrician re-estimated the cost and we were ready to go. The electrician asked me about fire alarms and CO sensors. Our fire detectors were almost 35 years old so we added them to the job.\n\nAll the commercial stuff is good, but the electrician was outstanding! They were very responsive to our comments. I have worked thousands of contractors in my work life and now in my retirement. The skill and quality of the electrician's work was simply beautiful. I will definitely call Mr. Electric for my next work.\n\nMy only concern was the local franchise was sold to another company so the calls to and from Mr. Electric are not local so I had to be \"expecting\" a call to keep from looking at the strange numbers and not consider them as robocalls.", "pics": null, "resp": {"time": 1575582770900, "text": "Wow! With all of your experience, that is quite an endorsement. Thank you so much! Customer service is a top priority here at Mr. Electric and we are so glad to hear that we exceeded your expectations. We appreciate your business."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108649577357664519521", "name": "John Keltner", "time": 1586886980478, "rating": 5.0, "text": "Electrion was fast courteous did a clean job and followed up to make sure everything  was working to my satisfaction. I would recommend the company.", "pics": null, "resp": {"time": 1589827567206, "text": "Thank you, John! We appreciate your feedback."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103586616176193313336", "name": "Wanda L Hemphill", "time": 1590068219999, "rating": 5.0, "text": "We are very pleased with the work and help that was given also we are going to ask for help in the future for rest of our electrical work from Mr Electric, again many thanks Mr and Mrs Hemphill .", "pics": null, "resp": {"time": 1590163543728, "text": "We ❤️ happy customers! Thank you for your comments. Let us know if there is anything else we can do for you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "109271769742438053756", "name": "Ashley Thomas", "time": 1573838489531, "rating": 5.0, "text": "Best experience. Service was fast and professional. I was pleased that the primary goal of the technician was to make sure everything was safe in my home and working property.", "pics": null, "resp": {"time": 1573854222124, "text": "Great to hear, Ashley! Thank you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "113282723684155340735", "name": "Ti Funn", "time": 1559242371775, "rating": 5.0, "text": "David is not just a top notch electrician he is the kindest person I've met while stationed in Montgomery. I appreciate the assistance from this company and the professionalism that made it easier for me to move onto my next duty station. Thanks again.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "105000969400921847793", "name": "TJ Amadore", "time": 1589464589461, "rating": 5.0, "text": "These guys right here! Prices are fair. Called them out for some work and had a bad experience with the technician. Not only did they fix the issues, they went so above and beyond to please me! I recommend them highly to everyone for all electrical needs.", "pics": null, "resp": {"time": 1574873863176, "text": "Thank you, TJ! We are glad we could get you taken care of. Customer service is a top priority here at Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104002578097395942725", "name": "Amy Benedict", "time": 1590703783640, "rating": 5.0, "text": "Fast and professional,  job done quickly at reasonable rate. Thank you. ab", "pics": null, "resp": {"time": 1590710221093, "text": "Great to hear, Amy! We appreciate having you as a customer. Thank you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "114413240610705419830", "name": "Melissa Smith", "time": 1590274049359, "rating": 5.0, "text": "Top quality, professional staff that are all about their customers for a reasonable price.", "pics": null, "resp": {"time": 1590419294542, "text": "Thank you, Melissa!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "107224768166396805035", "name": "Howard Floyd", "time": 1572107487285, "rating": 5.0, "text": "Very kind and respectful of customers. Excellent customer service and great ways to pay for services. Excellent company. Forever my go to company for electrical work.", "pics": null, "resp": {"time": 1572302305467, "text": "Thank you, Howard! We appreciate having you as a customer."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104367530778605636559", "name": "L LUCKY", "time": 1570300220584, "rating": 5.0, "text": "2d time we've had Mr. Electric out to our residence.\n\nThis time for them to install 2 ceiling fans in our living room with a 25 foot ceiling.   They had to rent a lift to get up there.\n\nOur tech, Mr. Thomas Rudder did an outstanding job, not only taking extra special care to NOT leave a single scratch on our newly installed laminate wood floors, but also by getting us out of a bind when the down rods we were sold wouldn't work with the fans we purchased.\n\nThey quickly sourced, painted to match, & got our fans up.\n\nGreat job & Mr. Electric, mr. Rudder, you will get our future business!\n\nI highly recommend this business.", "pics": null, "resp": {"time": 1570477079148, "text": "We are glad we could get you taken care of and appreciate your business. If you need anything else, we are just a phone call away!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103726747825938502445", "name": "Tim Babb", "time": 1584663689774, "rating": 5.0, "text": "Service was wonderful, David came on time and did a wonderful job installing a 14-50 plug. I would highly recommend David from Mr. Electric.", "pics": null, "resp": {"time": 1584729494840, "text": "Thank you, Tim! We are glad David could get you taken care of and will pass your review on to his supervisor."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "102625673393383798153", "name": "Chris Hopson", "time": 1600895550484, "rating": 5.0, "text": "Great job repairing electrical pole on house that was damaged by fallen tree limb.", "pics": null, "resp": {"time": 1600966264967, "text": "Thank you, Chris!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "116969776293058729412", "name": "Robert Tigue", "time": 1608996657041, "rating": 5.0, "text": "Professional service..", "pics": null, "resp": {"time": 1609352334156, "text": "Thank you, Robert!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "100565518502885641780", "name": "Curt LaFond", "time": 1570226776380, "rating": 5.0, "text": "Mr. Electric quickly replied to my request for a quote, scheduled an appointment for just a few days later, arrived promptly on time, and Ken did the work in a very professional manner. We're very happy with Mr. Electric.", "pics": null, "resp": {"time": 1570241045715, "text": "Glad we could get you taken care of, Curt! Thank you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "113342370486996799958", "name": "Donna Aldridge", "time": 1592430326167, "rating": 5.0, "text": "I'm happy happy happy with our experience with Mr. Electric and the technician David. Will use again👍👍👍", "pics": null, "resp": {"time": 1592492838384, "text": "We are happy happy happy to hear that, Donna! Thank you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "102767027422502256503", "name": "Marilyn Johnson", "time": 1518743202900, "rating": 5.0, "text": "I am so glad I called Mr. Electric! They responded quickly and  are very reasonable. I am very pleased with all the electrical work Zach Kelley of Mr. Electric has completed. He is very knowledgeable, courteous, and  problem solver with all the various tasks I presented. I would definitely recommend Mr. Electric. Marilyn Johnson", "pics": null, "resp": {"time": 1520363167417, "text": "Mrs Johnson,\nThank you so much for giving us the opportunity to serve you! We really appreciate your wonderful review and look forward to providing you service in the future.\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108868603785037876381", "name": "Leslie Cox", "time": 1558712575212, "rating": 5.0, "text": "Fantastic service! We put in an order to get a pricing for a job.. he gave us a fair price and did the work the same day. Terry had Excellent customer service and the work was fantastic!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "105476243039648584153", "name": "Mike Mason", "time": 1575571053272, "rating": 5.0, "text": "Mr. Electric of Montgomery service representative, Thomas Rudder, diagnosed my service needs thoroughly. His explanation of the work he would do was easy for me to understand and he answered my questions without hesitation. The work was completed in a timely manner, with cleanup performed when it was done.\nI will be requesting Thomas for the future work I need.", "pics": null, "resp": {"time": 1575582302246, "text": "Thank you, Mike! We are glad to hear that Thomas could get you taken care of, and we will pass your kind words on to his supervisor. We appreciate your business!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "115058134854452696752", "name": "Jeff Bryant", "time": 1558555157478, "rating": 1.0, "text": "I was feeling the pressure from my renter to get an electrical issue fixed quickly and called a few places and got a much better quote after committing to Mr. Electric. I told them about my cheaper quote but they would not adjust the price. They were 3 times more expensive than First Electric of Prattville. They did a good job but are way overpriced.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "110870106297500338765", "name": "Carrie Stark", "time": 1549467550393, "rating": 5.0, "text": "Thomas was very friendly and professional. Very quick at responding and getting us scheduled. Would definitely use them again.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "112880277465481071607", "name": "Shirley Weeden", "time": 1525196358405, "rating": 5.0, "text": "Thomas Rudder was very efficient, knowledge and timely. Had three lights replaced with pendant lights that he put together and installed. He did a great job and I will definitely use him again.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "107748148809356726302", "name": "Vanessa Freeman", "time": 1540075651794, "rating": 5.0, "text": "David was technician. He arrived ahead of schedule fixed our outlet and gave us a quote for future work. David was nice and very knowledgeable. Will definitely be using Mr Electric again.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "111010671808408922618", "name": "Kenny Roberts", "time": 1522850735158, "rating": 5.0, "text": "Zach did an outstanding job, showed up on-time, and even recommended alternative options to save on the overall bill.  Very professional.  Will definitely use again in the future.", "pics": null, "resp": {"time": 1522957305149, "text": "Mr Roberts,\n\nOur guys here at Mr Electric enjoy their work and we're very fortunate to have Zack as part of our team!\n\nWe appreciate your wonderful review and for putting your trust in Mr. Electric of Montgomery.\n\nDan Black\nOwner\nMr Electric of Montgomery, Ala"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "100774266371328990963", "name": "Carol Horne", "time": 1551740144608, "rating": 5.0, "text": "David and his crew were great.  Showed up on time, did the required work and did it in less time than estimated.  I recommend Mr. Electric to everyone I know who need an electrician.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "118046818449367997423", "name": "Keely Jones", "time": 1506693749889, "rating": 5.0, "text": "Steve was GREAT!!  He was very professional and informative.  He took the time to explain what was needed and the process it would take to get the job done RIGHT!!  He was a joy to work with and I will definitely give Steve and Mr. Electric a call for all of my electrical needs.", "pics": null, "resp": {"time": 1506706608177, "text": "Ms Jones,\nI would like to take this opportunity to sincerely thank you for taking the time to give Steven and Mr. Electric of Montgomery such a wonderful review. At Mr Electric we strive to provide first class service to each and every customer! We really appreciate your business and look forward to serving you again in the future!\n\nWarm regards,\nDan Black\nOwner\nMr Electric of Montgomery, Alabama"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103039161462755512374", "name": "Blanche Martin", "time": 1510885843409, "rating": 5.0, "text": "Steven was professional  and pleasant, but most important, he listened to what we had in mind about our problem and gave us options on solutions.  It was actually an enjoyable experience with excellent, economical results!! We will certainly call Mr. Electric again!!", "pics": null, "resp": {"time": 1517346897612, "text": "Ms Martin,\nWe are so grateful for the opportunity to provide you expert electrical service in your home and hope to see you again in the near future! It's working with customers like you that inspire us each day!\nThank you for taking the time to give Mr Electric and Steven such a wonderful review!\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "113598666389331589155", "name": "John Henfey", "time": 1522163503963, "rating": 5.0, "text": "Had Zach K. come out to my home to look at an issue with my AC.  While the issue was related to the AC and not my electrical system, Zach was able to quickly diagnose the issue and identify the specific part that needed to be replaced by the HVAC specialist.  Zach was extremely professional, prompt and courteous!  A+++", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "101781903704192413406", "name": "Les Abernathy", "time": 1571854566038, "rating": 5.0, "text": "Skilled and hard working. Will always use whenever I need an electrician.", "pics": null, "resp": {"time": 1571924827950, "text": "Thank you, Les! We appreciate your feedback."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104546163235735678153", "name": "Lindsey Porter", "time": 1521053477939, "rating": 5.0, "text": "Zach Kelley did a fantastic job! We live in an older home that needed a breaker box installed. We also wanted to have a line put in so that we could install a garbage disposal. Zach did both of these tasks beautifully. He was also punctual, polite, and professional and I would certainly recommend him and will be glad to ask for him again.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "115811366910845783416", "name": "ImprovementToday", "time": 1524235704472, "rating": 5.0, "text": "Zach did his job and more! His level of service was superior! There are some things that only an electrician can do...and God. Either pay Mr. Electric now or wait until you can pay them. Do not cut corners with your electrical work.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "101747230274371316361", "name": "Emily Pritzel", "time": 1528404030088, "rating": 5.0, "text": "Zach Kelley came promptly and very professionally fixed our electrical issue. I would recommend him and would use him again!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "109900384443602355306", "name": "Carol Nowak", "time": 1524765983847, "rating": 5.0, "text": "This was my second time to use Mr. Electric.  The technician, Steve, did an outstanding job!  He was friendly, knowledgeable,  and went out of his way to explain exactly what he was doing.  Outstanding service - as usual.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108527694088339095284", "name": "Jamal Davis", "time": 1529550873606, "rating": 5.0, "text": "I received great service from the very first call, with Dana, until the call was completed by Steve. Steve was an absolute professional and has restored my faith in the service that can be received from a contractor. The price was also really good, I will definitely be calling again if there is a need and will recommend to all my friends.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "107870081647522855862", "name": "Phyllis Wilson", "time": 1498787039661, "rating": 5.0, "text": "As I have come to expect, I received courtesy and total attention to my problem.  I especially like the fact Terry came in and assessed the situation first, then decided on a course of action rather than just starting without knowing what was really required.  I will definitely recommend Mr Electric to anyone I know who needs a skilled, professional electrician.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "110701319742190565984", "name": "Suzanne Johnson", "time": 1528136532295, "rating": 5.0, "text": "I was wowed by their exceptional service! Zach Kelley was my service professional. He was very knowledgeable, efficient, and courteous. I will definitely call them for ALL of my future electric work.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "102680549663367193700", "name": "Colleen Catania", "time": 1608418265294, "rating": 5.0, "text": "We called Mr. Electric one afternoon when suddenly my outlets stopped working.  They were able to get Zach out here almost immediately.  He reviewed the situation, went over everything with me and had the immediate problem fixed the next morning.  They are wonderful!!!!", "pics": null, "resp": {"time": 1608574017957, "text": "Great to hear, Colleen! Glad Zach could get you taken care of. Thank you for choosing Mr. Electric!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "105534641690485709682", "name": "Y B", "time": 1570149446177, "rating": 5.0, "text": "Knowledgeable, professional, courteous and honest! We highly recommend!", "pics": null, "resp": {"time": 1570200770400, "text": "Thank you for the feedback! We appreciate your business."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108763113552102659042", "name": "Jessica Flahive", "time": 1571094640852, "rating": 5.0, "text": "All I have to say is.....Mr. Ken is awesome!! He got us up back running asap!!! Thanks Mr. Electric for sending us Mr. Ken!!!!!👍", "pics": null, "resp": {"time": 1571246677641, "text": "Thank you, Jessica! We are glad we could get you taken care of!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "111482290685617898689", "name": "Sandy Newsome", "time": 1539389392640, "rating": 5.0, "text": "David and Patrick were on time. They worked diligently and as a team through the list of repairs explaining the process and reviewing the work at the end of each project. They were professional, courteous, honest and displayed a willingness to exceed expectations at all times. In an era when it is hard to find trained professionals, I cannot say enough about the workmanship, the attitude, and the friendliness of these professionals. Mr. Electric will be our electric company from this point on and - yes - we will request this team of professionals!", "pics": null, "resp": {"time": 1539440428717, "text": "Ms Newsome,\nThank you so much for your wonderful google review and for\ngiving Mr Electric of Montgomery the\nopportunity to provide your electrical\nservice needs. We look forward to providing you service again in the future.\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103686491064471630710", "name": "Victoria Cook", "time": 1519849787653, "rating": 5.0, "text": "Zach Kelley did a quick and great job with our electrical needs.\nWhen you need stuff done and done rightly quick, specifically ask for Mr. Kelley.", "pics": null, "resp": {"time": 1520365096960, "text": "Ms Cook,\nThank you so much for taking the time to give us your 5 star review!\nWe appreciate your business and hope to see you again in the future.\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "105921276815229284315", "name": "Whitney Teel", "time": 1521223044425, "rating": 5.0, "text": "We want everyone to know how pleased my husband, Roger, and I were to have a company call from Mr. Electric. I cannot say enough about our\nelectrician, Steven. He was able to fix a problem that my last electrician could not and was so courteous, and willing to explain everything to us.\nWe will only use this company from now on as we loved this electrician.\nMr. Electric you need to keep this young man as he represents your business with 5 stars!\nPenny and Roger Teel", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104943218109254043503", "name": "Greg Houser", "time": 1540299878814, "rating": 5.0, "text": "Fast Professional service! Clear explanation of the work done. Will definitely use again!", "pics": null, "resp": {"time": 1540306123022, "text": "Mr Houser\nThank you for the opportunity to provide service, and for taking the time out of your busy schedule to give us a great google review. We so appreciate your business and we look forward to providing you service again in the future.\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "112106350963986832244", "name": "Rhonda Miles", "time": 1490825881937, "rating": 5.0, "text": "Terry was very professional, extremely conscientious, and amiable; it was a pleasure doing business with him.  I appreciated him being thorough, even to the point of explaining electrical concepts to me, which I feel he did not have to do.  Oh, and his new apprentice, Benjamin, was a true credit to the younger generation.  FIVE STARS!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "109130636227742245982", "name": "Brenda Turner", "time": 1520171661420, "rating": 5.0, "text": "Steve Leavins was very professional and did a great job replacing our outside electrical panel and several smaller projects inside our home. Highly recommended.", "pics": null, "resp": {"time": 1520365261774, "text": "Mrs Turner,\nI can't thank you enough for your wonderful 5 star review and for giving Mr Electric of Montgomery the opportunity to serve you!\nWe hope to provide you service again in the future.\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "105276417702699749809", "name": "Brett Marchand", "time": 1539442204611, "rating": 5.0, "text": "Just had our technician come out. He was very quick and knowledge very friendly and was a breeze to deal with. Will be calling them for all my electrical needs.", "pics": null, "resp": {"time": 1539448299715, "text": "Thank you very much Mr Marchand\nFor giving Mr Electric of Montgomery the opportunity to serve you and for taking the time to give us such a great google review! We look forward to serving you again soon!\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "107992658028528345588", "name": "RONALD CAWLEY", "time": 1501261879787, "rating": 5.0, "text": "Great technician.  Knowledge first rate.  Attention to detail was greatly appreciated. Having Terry do this job was like having a friend coming over to do the work -- a friend with skills.  I will call Mr Electric again for my electric needs because of how Terry handled this job. PS:  I'm a cheap SOB but I found myself giving Terry a tip", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104002244363026724198", "name": "Stevie Holloway, Sr.", "time": 1552318376059, "rating": 5.0, "text": "Prompt and courteous service. Professional technicians. Excellent work.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "107972100728862901214", "name": "Shaunda Reaves", "time": 1487242717194, "rating": 5.0, "text": "I had a great experience. The staff was very friendly and professional. Everything was done with a spirit of excellence. Fast and efficient service!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "113782529243657491170", "name": "Suzanne Burns", "time": 1518576792053, "rating": 5.0, "text": "Wow, customer service, I thought it was a thing of the past.\nI had four little jobs for him to do, no problem.  One company wouldn't  even call me back.  Mr. Electric does not have a service charge just to drive in the driveway.\nWill be calling them back for all my electric  problems.  Thanks Terry Kirkland,\nWe are very happy with the work you did today for us.", "pics": null, "resp": {"time": 1520364769368, "text": "Ms Burns,\nIt was our pleasure to serve you! Thank you for your wonderful review and for giving us the opportunity to provide Expert Electrical Service in your home.\nWe look forward to providing you service again soon.\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103816558918738607194", "name": "james eady", "time": 1524608057639, "rating": 5.0, "text": "I had a very dangerous problem with my outside box causing power surges in my home. I got the number from the Dan Morris show and Greg's show Happy Hour. Within an hour and a half Steven Leavins was there to inspect and give and estimate for the job. By 2pm the next day Steven had totally rebuilt my outside box and added a total home surge protector. Fast and very good service. Price was good. Thanks you.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "109234961308605456432", "name": "Hannah", "time": 1500672483285, "rating": 5.0, "text": "Steven did a fantastic job installing a ceiling fan and some exhaust fans.  He was extremely professional and left the work area cleaner than it was when he started the work.  We would definitely recommend Steven and Mr. Electric for any electrical needs or service work in the river region area.  Thanks for doing such a great job Steven!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "112803053918557293147", "name": "Brenda Langley", "time": 1505857113110, "rating": 5.0, "text": "Very friendly and professional before during and after the service. They do exactly what they say they will do plus some. Definitely recommend them. Both electrician and office staff were great.", "pics": null, "resp": {"time": 1506707529236, "text": "Ms. Langley,\nThank you for your wonderful review! At Mr Electric of Montgomery we delight in working with customers like you each day! We appreciate your business and look forward to providing services again soon !\n\nWarm regards,\n\nDan Black\nOwner\nMr Electric of Montgomery, Alabama"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "106399308089512393374", "name": "Betsy Powers", "time": 1524070221585, "rating": 5.0, "text": "Terry did a great job. He didn't have everything he needed so he went out and got the breakers he needed. AFTER he replaced fuses outside he sealed the tops so water would not get in again. He explained it all simply so I would understand it. He also did work in the attic. I think Terry went above and beyond with the things he did for us. He had a great personality for working with customers.", "pics": null, "resp": {"time": 1524073021911, "text": "Ms Powers,\n\nThank you so much for your business and for the wonderful google review! It's a joy to work with homeowners like yourself who appreciate good quality service.\n\nBest regards,\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103952441912207286305", "name": "Candy", "time": 1522954637319, "rating": 5.0, "text": "What a great company!  ON TIME, polite, and informative - all around outstanding service from my initial phone call (Danna) to finishing the job   I was sent an email before the technician arrived so I would have a face with the name.  How many of you can say that about YOUR electrical company??  I highly recommend Mr. Electric!", "pics": null, "resp": {"time": 1522956736712, "text": "Candy,\nThank you so much for giving Mr Electric of Montgomery an opportunity to serve you!\nWe delight in working with homeowners like yourself.\n\nIt was so kind of you to take the time to write such a wonderful 5 star review. We love those googel reviews so that other potential customers can learn about Mr Electric.\n\nWe look forward to working with you again in the future!\n\nDan Black\nOwner\nMr Electric of Montgomery, Al"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108340897512766731190", "name": "Kim Stewart", "time": 1496365153015, "rating": 5.0, "text": "Professional. Friendly.  Knew what they were doing. Showed up when they said they were going to. Cleaned up when they were finished!  All qualities I appreciate in a contractor!  I highly recommend Mr. Electric!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103046007035766272066", "name": "Dustin Wallace", "time": 1528225709528, "rating": 5.0, "text": "Steven Leavins was my representative. I needed an outlet dropped in my house. He was really friendly and informed me that what I needed to have done to be up to code. He quoted me for 4 hours and sure enough he finished around 3.5. I had a little more labor intensive situation and he worked hard through the heat of the day to get it finished for me. I would absolutely use Mr. Electric and Steven again for any other service situation.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "100843927306335286966", "name": "Aly George", "time": 1523910860077, "rating": 5.0, "text": "Mr. Rudder was professional and friendly; he showed up on time and got the job done quickly. Would definitely recommend this company for your electrical needs.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "101822525181642787111", "name": "Jon Bulkley", "time": 1523143964814, "rating": 5.0, "text": "Can’t thank Dan and his crew enough for expertly taking care of a potentially dangerous situation with our service panel this week!\nElectrician Steve came out and made an assessment of the problem, and the appropriate remedy, including code upgrades and added protection for our home.\nWork was performed efficiently and professionally. In fact, Steve was able to complete the extensive repairs in a timely fashion so we did not have to vacate our home overnight.\nFrom customer care to service performed to value of service and follow up, Mr. Electric is one top notch company to have on your side.\nThanks for providing a premium service for this community.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104208041994817341767", "name": "Allure Amor", "time": 1520541536243, "rating": 5.0, "text": "The tech Zach Kelley did outstanding work! Would definitely referr anyone.!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108978003728701523968", "name": "Random. Potato", "time": 1527700664254, "rating": 5.0, "text": "zach at Mr.electric was very professional and nice and friendly. And very knowledgeable, trustworthy and I recommended him to anyone needing electrical service. They are truly the best company around. Sincerely, Mr Hinkle", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103788046843933440649", "name": "Chandler Hines", "time": 1539285319660, "rating": 5.0, "text": "I've used Terry a few times now and he is very professional.  He cleans up after he installs the lights so you would never know he was there!  Will call again for my next project.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103119976220651502599", "name": "Dianne Gantt", "time": 1541079971862, "rating": 5.0, "text": "Thomas did an excellent job!  Very good customer service!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "101142946065769951788", "name": "Greg Lucas", "time": 1549145326393, "rating": 5.0, "text": "Tony Wills is THE MASTER!!\nCalled mr Eletric to get a surge\nprotector, now my customers\nwhole house is protected from any damage from lightening or the power company. Tony was great to deal with,\nhe knows how to deal with older houses\nbuilt when they really knew how to build houses. Homes with plaster walls & ceilings, 99% of electricians don’t have a clue or even know what they are looking at or dealing with!! Tony simply gets it done & it is done right, very professional, he is short so he can get in the tight spots lol.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "116375549373527389205", "name": "Maria Johnston", "time": 1518017422188, "rating": 5.0, "text": "Project: Upgrade an Electrical Panel or Wiring\nZach Kelley from Mr. Electric provided 5 star, first rate service for replacing a fuse box with breaker boxes, adding junctions to old wiring in the attic, replacing plugs and switches, as well, but not limited to replacing two ceiling fans. The workmanship and attention to detail was exquisite. He was concerned with our safety and took his time to make sure everything was up to code. He was hard working, prompt, courteous, clean. We would definitely recommend Zach Kelley and Mr. Electric and we will definitely` be using them again for any electrical work needed.", "pics": null, "resp": {"time": 1520363743282, "text": "Mrs Johnston,\nOur customers like you are why we enjoy providing expert electrical service in the River Region. Thank you for your 5 star review and for putting your trust in Mr Electric of Montgomery.\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "117213272274593270748", "name": "Sigele Overstreet", "time": 1492881939072, "rating": 5.0, "text": "Mr. Electric responded quickly to my internet request for an appointment. The service professional, Steven showed up on time and accessed the job to give me a reasonable quote. Steven job completed in no time. Thank you!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "107661602620229148117", "name": "Eric Glass", "time": 1490907393842, "rating": 5.0, "text": "Steven with Mr. Electric did a great job installing 4 can lights in one room and a new box for a ceiling fan in another.  Well worth the price for the excellent professional job.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "111123862399443062840", "name": "Fran Carpenter", "time": 1506294094608, "rating": 5.0, "text": "Terry Kirkland with Mr. Electric diagnosed the problem with an old generator (that I had expected would have to be replaced) and repaired it.  It runs like new.  He saved me a lot of money and I really appreciate it.  The cost was reasonable for the service provided.  He also installed a whole house surge protector that I had wanted for a long time, but had no idea where to get one.  He was nice, knowledgeable and very professional.  Anyone who needs electrical work should contact Mr. Electric.", "pics": null, "resp": {"time": 1506707320212, "text": "Ms. Copeland,\n\nIt was a pleasure working with you to get your generator back up and running! Glad we could be of service! Thank you for taking the time to submit such a positive review for Terry and Mr Electric of Montgomery. Our company is blessed with dedicated and professional technicians that enjoy working with customers like you that appreciate expert electrical service.\n\nWe look forward to serving you and your family again in the future!.\n\nWarm regards,\n\nDan Black\nOwner\nMr Electric of Montgomery, Alabama"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "110212513042511461195", "name": "Glenn Johnson", "time": 1512589816221, "rating": 5.0, "text": "I'm in the process of  converting a single family residence to a duplex, and had to bring both sides up code.  After dealing with technicians that were always late or just didn't show up at all, it was so pleasant to finally do business with someone that did exactly what he said.  Thomas Rudder put the \"Customer\" back in \"Customer Service\".  He was pleasant, polite, always on time and most of all very knowledgeable of what it would take to pass inspection.  I can go on and on about my satisfaction in doing business with Thomas and Mr. Electric but I won't.  I don't usually take the time to complete a review but I had to give this business their due.  They earned it!  Btw, passed inspection the first time.\nGlenn Johnson", "pics": null, "resp": {"time": 1512595389479, "text": "Mr Johnson,\nWe really appreciate your 5 star review, it makes such a positive impression on potential customers and\nplays a significant role in growing our company! I also want to thank you for your business and we look forward to working with you again in the future.\n\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "110212513042511461195", "name": "Glenn Johnson", "time": 1512589816221, "rating": 5.0, "text": "I'm in the process of  converting a single family residence to a duplex, and had to bring both sides up code.  After dealing with technicians that were always late or just didn't show up at all, it was so pleasant to finally do business with someone that did exactly what he said.  Thomas Rudder put the \"Customer\" back in \"Customer Service\".  He was pleasant, polite, always on time and most of all very knowledgeable of what it would take to pass inspection.  I can go on and on about my satisfaction in doing business with Thomas and Mr. Electric but I won't.  I don't usually take the time to complete a review but I had to give this business their due.  They earned it!  Btw, passed inspection the first time.\nGlenn Johnson", "pics": null, "resp": {"time": 1512595389479, "text": "Mr Johnson,\nWe really appreciate your 5 star review, it makes such a positive impression on potential customers and\nplays a significant role in growing our company! I also want to thank you for your business and we look forward to working with you again in the future.\n\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "111396044489102741034", "name": "Christina Brown", "time": 1494134344445, "rating": 5.0, "text": "Steven Leavins was prompt and very professional!!! Would definitely recommend this company to others. Customer service was awesome!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "110335120368416863185", "name": "Judy Powell", "time": 1564861970909, "rating": 1.0, "text": "Called  to have exterior lighting  in front  and pool  area repaired. Was  charged  approximately  $300, and  neither  lighting  problems  was corrected.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "115234420037095734823", "name": "Al Smith", "time": 1528510869982, "rating": 5.0, "text": "Excellent, Excellent, Excellent, Excellent, Excellent\nWe are extremely happy with our service upgrade from 125 amp screw-in fuses to 200 amp circuit breakers in our home.  After three estimates, we chose Mr. Thomas Rudder with Mr. Electric.  We preferred his approach to solving our issues, his professionalism, and his clear and concise explanation of his solution to our problems.  The implementation was efficient with minimal down time.  Mr. Rudder went above and beyond to correct all issues.  His quote was commensurate with the competition and was honored as the final price.  It was indeed “Upfront Pricing”.  Categorically recommend Mr. Thomas Rudder and Mr. Electric for any electrical work.\nAl", "pics": null, "resp": {"time": 1528911533128, "text": "Mr Smith,\n\nWe can not thank you enough for giving us the opportunity to provide you service at your home and for taking the time to provide us such an amazing 5 star google review! Customers like you are why we enjoy our work so much at Mr Electric of Montgomery. We look forward to serving you again in the future!\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103748541405688575370", "name": "William Howell", "time": 1517341287130, "rating": 5.0, "text": "Service provided by Mr. Electric was nothing less that outstanding! After contacting Mr. Electric for an estimate for installation of an exterior outlet as well as installation of a lightpost, they showed up the same afternoon. I feel exceptionally lucky that Mr. Steven Leavins performed the estimate and also accomplished the job.  Steven was extremely knowledgeable, polite, and went out of his way to make sure we were happy with the end results of his efforts.  Mr. Electric is truly fortunate to have Steven representing their company, and I am extremely fortunate to have chosen Mr. Electric to handle my job!!", "pics": null, "resp": {"time": 1517345925454, "text": "Mr Howell,\nWe so appreciate you putting your trust in Mr Electric of Montgomery! Your kind words are such an inspiration! Our goal is to meet and or exceed our customers expectations each and every day.\nWe consider it an honor to provide electrical service to customers such as yourself.\nWe're very fortunate to have Steven as a member of our staff and appreciate his dedication to providing top quality service to our customers.\nThank you for taking the time out of your busy schedule to write such a wonderful review!\nWe look forward to serving you again in the future.\nDan Black\nOwner\nMr. Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "111224686215419558526", "name": "Alan Ward", "time": 1503358637720, "rating": 5.0, "text": "Try to get Steve, he's awesome.  Excellent work.", "pics": null, "resp": {"time": 1503490792510, "text": "Mr Ward,\n\nWe appreciate your business and your kind words regarding Steven.  Working with customers like you is what makes our job so enjoyable. We look forward to serving you again soon!\n\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "109849152417090979710", "name": "Anisum Yarrum", "time": 1609336150730, "rating": 5.0, "text": "Great", "pics": null, "resp": {"time": 1609352352438, "text": "Thank you, Anisum!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104177618270941749273", "name": "Swervin Kervin", "time": 1523309388320, "rating": 5.0, "text": "Quick response, quick repair.  Professnioal and courteous from first call to tech leaving!", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "115807858265850700363", "name": "Richie Martin", "time": 1540296898138, "rating": 5.0, "text": "Great place do great work", "pics": null, "resp": {"time": 1540304710884, "text": "Thank you Mr Martin. We appreciate your wonderful review and the opportunity to provide service.\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "116764106262970925024", "name": "dustin duncan", "time": 1493080639806, "rating": 5.0, "text": "I had Steven come out and upgrade my outlet for the hot tub on my back porch. Very professional and price competitive relative to others I had price job.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "116764106262970925024", "name": "dustin duncan", "time": 1493080639806, "rating": 5.0, "text": "I had Steven come out and upgrade my outlet for the hot tub on my back porch. Very professional and price competitive relative to others I had price job.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108972600746315410860", "name": "Darntelle W.", "time": 1528902902061, "rating": 5.0, "text": "Awesome service, quick to respond and reliable", "pics": null, "resp": {"time": 1528911288334, "text": "Thank you for allowing Mr Electric of Montgomery to provide electrical services in your home. We really appreciate your business and the wonderful 5 star review! We look forward to serving you again in the future.\n\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108218548325278014203", "name": "Llyrr “OldManGames”", "time": 1528141610745, "rating": 5.0, "text": "Bought new ceiling fans from homedepot and they had mr. Electric call me to schedule a appt for estimate and install. They called very quickly, were nice on the phone and answered all my questions. The electrician Steven Leavins showed up on time and did great work with a very friendly attitude and was very patient and informative while explaining the wiring I had and different switch options. 10 out of 10 would recommend and use again for any of my future needs", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "114579882451264800203", "name": "Fred's on a Walkabout", "time": 1584468174644, "rating": 5.0, "text": "great tech. professional attitude and work habit", "pics": null, "resp": {"time": 1589384219554, "text": "Thank you!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104553221594154102330", "name": "Angela P", "time": 1522964135441, "rating": 5.0, "text": "Great customer service and timely", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "117753604575202322231", "name": "edward nettles", "time": 1503067469519, "rating": 5.0, "text": "Excellent service, very professional.", "pics": null, "resp": {"time": 1503083136033, "text": "Mr Nettles,\n\nI can't thank you enough for being a loyal customer! At Mr Electric of Montgomery it's customers like you that make doing our job a pleasure. We look forward to providing you service again in the future!\n\nDan Black\nOwner\nMr Electric of Montgomery, Alabama"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "118237899361246432565", "name": "Doug Irvin", "time": 1481224068538, "rating": 5.0, "text": "I had a dimmer switch go bad and was \"buzzing\" inside. I went to Home Depot and purchased a new three-way switch but upon pulling the old switch out of the wall I found an unusual wiring that I had never seen. The old switch had three wires vs. the new 4-wire switch and the old switch had the green ground wire connected to a \"Red\" wire. Not wanting to take a chance of burning down my house I took the advise of my friend and called Mr. Electric. They were at my house and had the new switch in within three hours. Although people might feel their price was high, you get dedicated/trained electricians, insured and bonded. I'm willing to pay for that.", "pics": null, "resp": {"time": 1481386074577, "text": "Mr Irvin\nThank you so much for the wonderful comments and for choosing Mr Electric.\nIt's such a privledge to work with customers such as yourself!\nDan Black\nMr Electric of Montgomery."}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "117572853194886812980", "name": "Jason Krueger", "time": 1498071964980, "rating": 5.0, "text": "Excellent, Steve did an outstanding job under less than ideal circumstances.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "113367614260609550825", "name": "Sleep Walker", "time": 1504834502404, "rating": 5.0, "text": "Mr. Electric provided 5 star, first-rate service for the replacement of my distribution box and installed (4) additional outlets around the exterior of my house. The workmanship of Steven Leavins was simply marvelous and very professional done. I selected Mr. Electric over Dixie Electric, McGehee Electric and R&H Electric for the following reasons:\n•\tThe survey technician, Steven Leavins, was friendly and conducted a fairly thorough survey of the work to be done. This is important because it prevents rework and unnecessary delays in completing the work.\n•\tTheir estimate was very detail, well structured, and nicely presented. Usually, how the presentation (in this case documentation) is delivered reflects the quality of workmanship you can expect.\n•\tQuick response/reply. Mr. Electric responded to my initial query within hours as was your estimate. The other companies took 1-2 days to provide an estimate. This is impressive given the nice job done on the estimate.\n\nI was not disappointed in my choice. Steven Leavins was awesome! His work, attitude, and self-pride are worthy of acknowledgement. I'm not easy to please, but Mr. Electric and the team (namely Steven) delivered as promised and as I expected. Really, if you want some electric work done call Mr. Electric first. Oh, yeah, the company is very reasonable. I promise you will love the workmanship (and the people).", "pics": null, "resp": {"time": 1506708825540, "text": "Mr F, (Sleep Walker)\n\nYou made our day with this glowing review! We can't begin to thank you enough for giving us the privilege\nof providing electrical services at your home. We know customers have many companies to choose from and we don't take customers like you for granted! Our whole team works very hard each day to earn each customer's business and that's why customer service and appreciation is so much a part of our company here at Mr Electric of Montgomery. We are very fortunate to have Steven on our team because of his level of professionalism and dedication to quality work.\nFrom all of us here at Mr Electric of Montgomery, thank you for your trust and confidence.\n\nWarm regards,\n\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "112879154260979452278", "name": "Bob Rocheleau", "time": 1551885891051, "rating": 5.0, "text": "Great job.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "108338013387468310980", "name": "CHARLES Sexton", "time": 1573091125230, "rating": 4.0, "text": "As previously stated in survey,job is not complete yet,but so far were satisfied with service!", "pics": null, "resp": {"time": 1573140685215, "text": "Thank you, Charles! Rest assured we will get everything taken care of!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "104014925622826821499", "name": "Linda Walsh", "time": 1485960926845, "rating": 5.0, "text": "Excellent professional service!  On time and stayed within the quote for repairs.", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "100419980926977615278", "name": "Bob MacLean", "time": 1466639180255, "rating": 5.0, "text": "Very professional technician and excellent service at a great price!", "pics": null, "resp": {"time": 1473713639776, "text": "Thank you very much Mr MacLean for giving us the opportunity to provide you service!\nDan Black\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "103642080785655035860", "name": "andy roberson", "time": 1485789595227, "rating": 5.0, "text": "Had to call Mr. Electric on a weekend.  Terry showed up on time and was very knowledgeable and helpful..", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "118154656562810604483", "name": "Gloria M.", "time": 1506299059139, "rating": 5.0, "text": "Great services!!!!!!\nThanks Steve, you’re the best!", "pics": null, "resp": {"time": 1506706838775, "text": "Ms. M.\nThank you for giving us the opportunity to provide electrical services at your home. It's customers like you that make our job enjoyable each day! We look forward to serving you again soon!\n\nWarm regards,\nDan Black\nOwner\nMr. Electric of Montgomery, Alabama"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "109000023813757522059", "name": "Craig B", "time": 1494441148434, "rating": 5.0, "text": "Everything went well as far as Mr. Electric.  I would use them again", "pics": null, "resp": null, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "101550299004555801115", "name": "Gladys White", "time": 1578016237708, "rating": 5.0, "text": "Reliable and fast", "pics": null, "resp": {"time": 1578071303742, "text": "Thank you, Gladys!"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
{"user_id": "115098122254535949977", "name": "no body", "time": 1523387879327, "rating": 5.0, "text": "Awesome", "pics": null, "resp": {"time": 1523015832339, "text": "We take our reviews very seriously and we have never done any work for this individual. As a result we do not consider this a legitimate review.\nDan Black\nOwner\nMr Electric of Montgomery"}, "gmap_id": "0x888c2bb791c8ab23:0x5f513be338b68dcb"}
