{"user_id": "101486971949994689858", "name": "Regina Vinson Ford", "time": 1593799471114, "rating": 1.0, "text": "Very unhappy at this point. We’ve had the lift installed ~30 days and it only works about 50% of the time. Also, the wheel that guides the lift up the track bent 2 weeks after installing. We’ve had the service tech/installer up once and called twice. Wish I had purchased the one from Mobile.", "pics": null, "resp": null, "gmap_id": "0x8889810f58a04f87:0x59812aaecdafd914"}
{"user_id": "105740266497174772700", "name": "Linda Tidwell", "time": 1554043919418, "rating": 5.0, "text": "Got it done with a reasonable charge. Good local company", "pics": null, "resp": null, "gmap_id": "0x8889810f58a04f87:0x59812aaecdafd914"}
{"user_id": "103679815533121305802", "name": "Tina Thornton", "time": 1525363667629, "rating": 3.0, "text": "It's ok", "pics": null, "resp": null, "gmap_id": "0x8889810f58a04f87:0x59812aaecdafd914"}
{"user_id": "105564009453924436986", "name": "James Wells", "time": 1627341339543, "rating": 4.0, "text": "Services are outstanding and the people are friendly", "pics": null, "resp": {"time": 1627514394496, "text": "Thank you James for taking your time and writing us a review - we're happy to hear you had a positive experience with us!"}, "gmap_id": "0x888e8ef6fcc9df4b:0x1eecbe223a808866"}
{"user_id": "104819901475293215134", "name": "BigE Mon", "time": 1613593181772, "rating": 5.0, "text": "Great team of people. Very responsive and professional.", "pics": null, "resp": null, "gmap_id": "0x889a40155c895555:0x7d37795845da9304"}
{"user_id": "107707092392439302334", "name": "Timothy Bolger", "time": 1594147054226, "rating": 5.0, "text": "Edco, and specifically its owner, are very helpful and have repaired our elevator from a completely broken status to a fully functional elevator. The people who worked on it before then totally botched the job, but Edco was able to come in and put in the labor involved to fix it. I recently got my cable changed over from CenturyLink to Mediacom--which is highly recommended on Ono Island--and the technician from Mediacom accidentally tripped a safety mechanism. Edco was able to easily walk me through the fix. Edco is not a cheap company, although I would challenge anyone to find a cheap elevator service company around here anyways. Very happy with their work.", "pics": null, "resp": null, "gmap_id": "0x889a40155c895555:0x7d37795845da9304"}
{"user_id": "114703946199481320076", "name": "Barb Lenn", "time": 1571366324768, "rating": 5.0, "text": "I recommend EdCo without any hesitation.  The stairlift made a world of difference , so highly recommend one if you have mobility problems.   Totally satisfied with their work, plus quality of the stair lift.  Very easy to work with.", "pics": null, "resp": null, "gmap_id": "0x889a40155c895555:0x7d37795845da9304"}
{"user_id": "110119786583373344963", "name": "Randy Kelly", "time": 1572184025726, "rating": 5.0, "text": "Great business minded group, efficient.", "pics": null, "resp": null, "gmap_id": "0x889a40155c895555:0x7d37795845da9304"}
{"user_id": "110116934139402746558", "name": "Anonymous Reviewer", "time": 1476541673023, "rating": 1.0, "text": "To the man driving the blue/ teal pickup with \"EDCO Home Elevators\" plastered on the back window: you are possibly the most erratic driver I have ever encountered. On many occasions you have tailgated myself and many other people I know in the Fairhope and Daphne areas. ENOUGH IS ENOUGH!! Swerving side to side, running up on me and revving your engine will not get me to go any bit faster, especially if i'm already going 10 miles over the speed limit. There is no room for error if I have to break for any reason. What a great example you've set for the company", "pics": null, "resp": null, "gmap_id": "0x889a40155c895555:0x7d37795845da9304"}
