{"user_id": "114119093962708532541", "name": "Paulette Robinson", "time": 1614874228684, "rating": 1.0, "text": "The doctor was amazing. I am giving this place a low rating because of the receptionist. I walked in and she was on her phone and did not ask what I was in here for. The other receptionist had to end her call to assist me and was very friendly with continuing to assist me. When you are in the business of caring for people your staff needs to be friendly and welcoming. As I stated, great doctor but receptionist was awful", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "101807112178652739211", "name": "S Beachlife", "time": 1627060924938, "rating": 1.0, "text": "Disorganized front desk, slow service, definitely not somewhere I would want to be of I urgently needed any type of medical service. The staff was friendly just not efficient or organized.", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "115735845800332135803", "name": "Jamie Shaner", "time": 1621290554555, "rating": 5.0, "text": "Dr.Aldridge is the best! I have been using him for years and love him! So kind!", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "113246884178084016505", "name": "Jubilee Dueck", "time": 1609107563629, "rating": 5.0, "text": "I recommend this place. I didn't have to wait very long, the doctor and staff were friendly. My visit wasn't very expensive considering I do not have insurance", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "114286822817454386449", "name": "Robert Turner", "time": 1609549406693, "rating": 1.0, "text": "Urgent Care- not a fitting name\nI arrived around noon for a covid-19 test, and was told they were not given any more for the day even though they are open for another 6 hours!!! I said I will wait as long as needed since this is extremely important, but the nurse seemed completely indifferent to my health concerns. A little bit of compassion and steadfastness would have been appreciated in this difficult time.", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "114111339521374355697", "name": "Cash Cannon", "time": 1612456369192, "rating": 1.0, "text": "Horrible experience. Everyone here was rude especially front desk lady and non helpful. This place should be shut down. The worst “health care” place in town. Will never be back. And if you do come here plan on being here all day.", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "103167725142168796030", "name": "Wynn Piper", "time": 1607652744830, "rating": 5.0, "text": "I came in Saturday so sick and while Nurse Ebone was collecting a nasal swab I became extremely nauseated and told her I was about to throw up. She immediately helped me into the lobby and set me down and brought out a bag that I ended up filling up and another 1/2 one. She also placed cold wet towels on my neck and head which brought some relief because I was clammy and burning up. She then wheeled me into a room and laid me down and turned the lights off because I had a splitting headache, and brought me a bottle of cold water. The care, compassion, and genuine concern she gave me was extremely comforting in my vulnerable and painful state. She treated me with dignity, respect, and gentleness. I can tell this is not just a job to her but a true calling and I am so thankful for her.", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "110107421618750053689", "name": "Rachel Rhodes", "time": 1606771703157, "rating": 1.0, "text": "had to visit for a quick COVID test before being around family for thanksgiving... the process was quick however the nurse was the rudest person i have ever came in contact with. unfortunately i don't remember her name. I had to have my test in the lobby and she had an attitude about any questions I asked. VERY RUDE!! being in health care myself, it really would help if you got staff that cared about their jobs. You are taking care of sick people and the last thing they need is to feel like a bother to the person supposed to be there to help them.", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "116455741146474437017", "name": "Melicia Owens", "time": 1609608570296, "rating": 1.0, "text": "Dont come here for covid19 testing  I was swabbed at 8:15.Sat in my car for three hours,had to ask about my results for them to find them.Staff need to be trained no one knows what they are doing..Needs new managment and staff..This is ridiculous", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "107034519755473088113", "name": "Susan Hutto", "time": 1604696483862, "rating": 1.0, "text": "The triage nurse was like a army sergeant. The Dr. Was also very rude. Very bad experience, will not go back. People who came there to be tested for Covid were allowed to come and go freely through the waiting area.", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "111635246533692884049", "name": "Robert Sachar", "time": 1626742477036, "rating": 1.0, "text": "Go somewhere else...", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "116697422385987023373", "name": "Kaitlyn P", "time": 1578021625129, "rating": 1.0, "text": "Wish I could give this place 0 stars. I’ve ALWAYS gone to Wetumpka Urgent Care. Today I went and paid my $75 copay. The front desk staff waited until after I paid to let me know I had a $900 account balance which it total BS. I was never notified. I have always had insurance and paid my copays. Any bill that comes to my mailbox gets paid right away. I don’t play when it comes to my credit. Never again will I go there. I absolutely loved how they told me this after I paid $75 then asked me for more money due to this “balance” I will now go to primed! Disputing this BS as well. Staff has changed to snobs and ignorance. Don’t waste your time people. Go to primed", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "117622570403678838784", "name": "Katelyn Lambeth", "time": 1607802126715, "rating": 1.0, "text": "They literally NEVER answer the phone. Extremely unprofessional of a business...", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "112071272655404628842", "name": "Mandi Carmichael", "time": 1566422687353, "rating": 5.0, "text": "I brought my daughter in this morning and was blown away by how wonderful all of the staff were.\nWe were placed in a room quickly and even had two separate staff members come in to check on us to see if there was anything we needed while we waited for Nurse Practitioner Singer to see us.\nNP Singer was amazing, extremely nice and really listened to the issues.\nVery impressive and very professional group of people..A+ in my book.", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "113149408163898078401", "name": "George & Aimee White", "time": 1565647844662, "rating": 4.0, "text": "The doctors and staff are very good and friendly.  Ivy Creek on the other had will inflate your bill.  Make sure you get a print out of the services provided and compare them against your EOB.  I did this and found additional lab charges that were not performed along with discovering that they sent some samples to the Elmore Community Hospital to run similar tests that way they can charge an additional \"facility co-pay\" for using their lab on top of the lab at the urgent care facility.", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "110119882740455322431", "name": "basspro159", "time": 1613928176599, "rating": 1.0, "text": "The front desk person was so rude. I decided to leave and go to the primed down the street. Avoid these places if you can.", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "109520727823030479888", "name": "Jeania Mathews", "time": 1569335389872, "rating": 1.0, "text": "I was treated very friendly here, however, the lab machine was down that day so I was told they would call me with the results. And they would set me up with a primary care provider. 2 weeks go by I call to ask for my lab results and ask about the primary care physician. I am told someone would call me back with my results and that they don't refer to primary care physicians but that I could call River region to get a doctor. Still have not heard back from my labs. I don't know anyone that likes to go to the doctor let alone an office that can't return phone calls or give lab results in a timely manner. Very poor management in my opinion.", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "116406225875879762269", "name": "Whitney Jones", "time": 1583369056656, "rating": 1.0, "text": "Just had the worst experience I have ever had I will never go to this establishment again. I wouldn't even rate this business a 1 but you had to leave a start to give a review! Ebony, demillya and calea are far from professional! One laughed, one tried I give her that and the other one could give 2 cents cant help but wonder if it was because i walked in at 615 and they close at 7", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "108567208768398781253", "name": "Lysee Spigener", "time": 1579012325145, "rating": 1.0, "text": "People are very rude... I went to urgent care because I was sick to my stomach, acing everywhere and couldn't hardly think straight they said it \"sounded like the flu\" And gave me all this medicine after a whole week I was still sick sick so I went to my primary doctor and turns out I had walking pneumonia and the medicine they gave me was not effective with the pneumonia I had had so I was taking unnecessary drugs.. Oh and yeah I was miserable a whole freaking week and a half...", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "104038526713733481471", "name": "Aimee Clements", "time": 1502479971294, "rating": 4.0, "text": "The staff was great. Very friendly and easy to talk to. The Dr I had was also very nice and very understanding to my needs and pain level. (I have double ear infections pretty bad.) I was so out of it though, I didn't pay attention to her name. Overall a great experience.", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "101666089771920328966", "name": "Nic Lloyd", "time": 1416928987139, "rating": 5.0, "text": "The x-ray techs (Kristal, Alex, and Nic) were by far the nicest, most professional, and of course the most efficient employees of the Wetumpka urgent care staff. Yes all of the other nurses were great, but not once did I notice the x-ray crew NOT doing there jobs!!!! Urgent Care has the best X-Ray techs around town! Dr. Aldrich and Dr. Floyd are very knowledgeable and courteous. I recommend this establishment to anyone and everyone from symptoms perusing the flu or if its just for a common cold. Urgent Care if the staff to see!!!!", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "115903454895491142056", "name": "Nic Ole", "time": 1583449843716, "rating": 1.0, "text": "Been waiting here almost 3 hours now and they aren’t even busy. Front desk worker is not friendly. Just need some antibiotics and to be sent on my way. I won’t return.", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "116532943808209752954", "name": "Candace Moore", "time": 1565458285090, "rating": 1.0, "text": "This place is horrible . I just left there highly disappointed!! Some of the staff was very unfriendly especially the one that sits up front at the window. The one that took my vitals was totally uninterested in what she was doing. At the end of my visit I was basically told there was nothing they could do. They ended up supposedly writing me a prescription.  I take the prescription to Wal -Greens only to find out the prescription was for someone else. So I'm still in pain and I have someone else's prescription . I don't know where these people came from but I would advise you to go somewhere else!!", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "109112714331742067605", "name": "mallory chandler", "time": 1577744673592, "rating": 1.0, "text": "Dirty inside in waiting area. Front desk not trained well. Saw me signing in my 2 year old son. Stated to them I was signing in my son. I filled out all of the paperwork and was told,”oh we don’t see 2 year olds.”", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "113074864949038444021", "name": "keesha Osborne", "time": 1530392867797, "rating": 5.0, "text": "My mom have been going there for almost 4 yrs.and Dr.Aldrich save her life with his knowledge she swears by him very courteous and and patient thank you so much my mom seems happier than she has in years", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "115512287861404401685", "name": "lilhayme", "time": 1444393502750, "rating": 5.0, "text": "The best urgent care in the area. Knowledgable and friendly staff. The doctors have the best beside manner, and check everything to make sure they are giving you the best diagnosis. When my family and I have urgent care needs, this is now the only place in the area where we will go", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "106538787021055842802", "name": "Dixie Forever", "time": 1514004585636, "rating": 3.0, "text": "They have only one doctor on duty.  I had chest congestion and a cough.  All I wanted was a prescription for an antibiotic.  The waiting room was jammed up.  I spent about 4 hours waiting to be seen.  The doctor, Dr. Barrow, was very nice, but she wanted to get me a chest x-ray and breathing  treatment.  It was now after 7PM.  I needed to get to the Walmart pharmacy before they closed so I could get my prescriptions filled.  I declined the x-ray and breathing treatment because of the late hour. They need more than one doctor on duty..", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "118414397820702689299", "name": "C M", "time": 1558388825985, "rating": 2.0, "text": "Some of the staff was friendly, I sat there an hour before the staff awknowledged me and remembered to give me paper work to fill out. They also sent me two bills, one was for lab tests that they didnt tell me they were doing and didnt even bother letting me know the results.", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "103710697299617061121", "name": "Mary Ball", "time": 1520056529094, "rating": 5.0, "text": "I always get good service. Staff always friendly\nDuring FLU season the wait is always longer", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "103827118752749867196", "name": "Emily Briggs", "time": 1452113222057, "rating": 1.0, "text": "If I could give them zero stars, I would. I showed up to this urgent care to get refills on my medications, because I had moved to Wetumpka a couple days prior. They were not prompt in acknowledging my arrival into the waiting room, but eventually, one of the two ladies stopped gabbing and asked if they could helped me. I explained that I needed medication refills, and they asked what medications I was on in front of all the other patients in the waiting room. I am not shy about the medications I'm on, but some people are, and they should be sensitive to that. I told them, and they informed me that they don't have primary care physicians, and that they generally don't write prescriptions except for things such as sports injuries or general illnesses that pop up in daily life. I understand that, and said that was fine, I could find somewhere else to go, but they seemed upset at that prospect, and said they would ask the doctor on call if he would make an exception and asked me to fill out paperwork while they asked him. I did, and the doctor said he would make an exception, so I waited and filled out the paperwork to be seen. I waited a good while in the exam room, and when the doctor finally came in, he ho-hummed about giving the medicine that he supposedly had told the office staff he would give me with no problem. He finally asked me if I had enough to patch me over, and I informed him that I did not, so he wrote me the prescription (with refills, so he must not have had too much of a problem prescribing it), and sent me on my way. I left on my merry way, said good-bye to the office staff on my way out, and headed to the pharmacy to fill my prescriptions. Upon handing over the prescription, however, it was discovered that the doctor had given me an *unsigned* prescription! I'm fairly certain that could have ended very badly for him, had I chosen to make it, but since I needed those medications, I grumpily brought the prescription back to the now-busy urgent care, waited about fifteen minutes for the office staff to again acknowledge my existence at their window, and then get them to have the doctor sign his own prescription, that he had issued and sent into the world to have done who knows what with without his signature, begging to have fraudulence done in his name. So he signed it, and I filled the prescription, but the nonsense did not end there. Beyond all of that, I got a voicemail, without my phone ever ringing, which I'm sure was not their fault, but the fault of my phone, but the voicemail said something to the effect that they had made me an appointment that I had not asked for that I would be charged for if I did not show up for at an arbitrary date and time, and to call or come by if this was an inconvenience, and leaving no phone number to call back. I then got a letter in the mail, stating the date and time of this arbitrary appointment I had not asked them to make for me, which I was to be charged for if I no-showed on, that had a number to call if I wanted to cancel the appointment. I called the number, and it brought me to a busy signal, which hung up on me after five seconds each time I called (I tried this three times before coming on Google to look up their actual number to call and ream them out). Supposedly, they have cancelled this bogus appointment that they made for me. My question is: why do they make appointments at all, if they do not do primary care, and are supposedly only available for sports injuries and normal day to day illnesses? Do people nowadays schedule their injuries and illnesses? Why on earth would they schedule me an appointment in the first place, let alone without my asking for them to do so? Avoid this establishment at all costs. If you are looking for a place to receive urgent care or primary care, try PriMed that's right next to Walmart, right up the road. They actually respect their customers, do not make you appointments you never asked for, sign their prescription pads, do not ho-hum about writing you life-saving prescriptions, and treat you like a human being.", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "115478599777466512943", "name": "Sabrina London", "time": 1501617971083, "rating": 1.0, "text": "Just called Wetumpka Urgent Care to ask a few questions about insurance acceptance. They intake nurse was rude, and cut me off several time. Each question was answered with Uhhuh instead of Yes. I believe her name was Jeniva. My elderly mother is ill, and at this time a bit of understanding would have been nice.", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "114798351013708410814", "name": "Camaron Kelley", "time": 1509662781818, "rating": 2.0, "text": "In and out not alot of time spent with patient. Sign in room says limit complaints to 2 come back if you have more.... Really??", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "112350885324186824400", "name": "ashley kilano", "time": 1495074911395, "rating": 1.0, "text": "The only thing good about this place is that it's cheap. The staff is always rude and they could care less about you. They sound like they play around more than take their job serious and one of the girls at the front desk was laughing at someone on the phone. Terrible customer service. Not friendly at all. I don't have any medical experience and I could probably do their job better. Every time I go I feel really uncomfortable and the doctor never seems sure about what he's saying. It makes me sad.", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "103498936797792055028", "name": "Bridget Cheathem", "time": 1495238909898, "rating": 1.0, "text": "The Dr. I had literally looked everything up online. I saw him do it... any question I had he went to his laptop. He didn't wait for test results. When I tried calling back to get my results I was told I would get a call back, that call NEVER came! Also, It seemed like he didn't listen to a word I told him. I will not be going back or reffer this place to a friend. The AFC  next to Walmart is ALOT better!!", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "108763537176357576355", "name": "J Day", "time": 1465494663484, "rating": 1.0, "text": "Nephew came with flu like symptoms, ran blood work given IV and was told he had stomach virus.  Went to Baptist East next morning and he tested positive for viral meningitis and put in hospital.\nThis was there second chance because several months he went and told it was a stomach virus and the next night had to go to Baptist South ER only to find out it was kidney stones.  Don't thing we will try a third time.", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "105260607950751148468", "name": "Kris Johnson Kephart", "time": 1308305249873, "rating": 5.0, "text": "Professional & Sweet! ___ PROS-Super sweet & smiling staff! (Cathy, Nicole, Karman) * Very clean waiting room, powder room & facility * Personal TV in the back patient rooms! * Great Doctor (Dr. Cobb) Thorough & super nice___ CONS-Possible 1 hour wait time on 1st visit * Little Reading material-No Magazines & very few brochures (bring something to do) ___ SUMMARY: I went there as I am changing doctors and my 1st appointment is a month away. I was a bit nervous, not knowing anyone, and in pain. I was taken care of and left feeling better all ready:) Feel free to go to this Care facility if you need medical help!!___ * KRIS JOHNSON KEPHART * TALLASSEE, AL", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "105098342547069224072", "name": "Michael Mann", "time": 1488932422493, "rating": 1.0, "text": "Unfortunately, when you need assistance after your visit, such as cough syrup for the flu, they don't have time to order a prescription. Was told their priority is patients in the waiting room above anyone already under their care. This is corporate policy. Not sure, maybe this has to do with who's money they already have vs who's they don't have yet!", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "107013364765854681116", "name": "Shannon Geer", "time": 1513962282808, "rating": 3.0, "text": "Longest wait times", "pics": null, "resp": null, "gmap_id": "0x888c27cb64f2a3e7:0xb33b4b7ec9f29b18"}
{"user_id": "106412192616110051528", "name": "Sandra Robertson", "time": 1628807706226, "rating": 5.0, "text": "Every time I have visited Primecare I have had a positive experience. The staff are always friendly and helpful. Dr. Krista is caring and knowledgeable. They have earned my trust and respect.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "101427211197052712950", "name": "Rachel Walton", "time": 1628788230457, "rating": 5.0, "text": "Quick telemedicine visit for a covid test. Thorough and friendly.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "115891566655222544768", "name": "Twyla Simmons", "time": 1621973746272, "rating": 5.0, "text": "Very professional. Made me feel he was concerned with my health. He and the staff made me feel that I mattered and really wanted to help me feel better.  As I have grown older I’ve discovered that most don’t have the time for you and want you to sit in a corner and die. Not the case with Prime Care made me feel I was as important now as I was in my 20’s/30’s.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "113050274918394555300", "name": "B Farm", "time": 1628186229554, "rating": 1.0, "text": "Horrible Doctor. Gets paid by employers and does not have patients best interest at heart. Looks out for himself and employers that send him patients, but not the actual patient", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "103038202370960856330", "name": "Brittney Pettis", "time": 1624909045076, "rating": 5.0, "text": "Dr Krista is hands down the best emergency doctor in Dothan. He listens, treats, and makes sure you’re comfortable and cared for. I wish I could make him my primary care doctor! 10/10 recommend.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "108078904248153377106", "name": "Kay Hartsfield", "time": 1627328651432, "rating": 5.0, "text": "He was very concerned about my injury. He took time to show me the X-ray and explained it to me. He put in an order for an MRI and prescribed meds. He was very gentle and caring.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "106681901325827333134", "name": "brenton vedder", "time": 1623695543741, "rating": 5.0, "text": "Dr. Krista is phenomenal. He is the consumate professional with a warm personality. You feel as if he is talking to you as family.  He has always exceeded my expectations.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "106039772270421526555", "name": "Rhenella Smith", "time": 1623346830526, "rating": 5.0, "text": "Have seen Dr. Krista several times over the years.  Always easy to understand and extremely professional.   Diagnoses are always spot-on.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "117363346476447137211", "name": "Pamela Hines", "time": 1624297585664, "rating": 5.0, "text": "I didn’t have to wait long, and Dr. Krista was efficient and effective and thorough. So appreciated, when many others just rush you through.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "101216897131223171947", "name": "Sonya White", "time": 1620310439828, "rating": 5.0, "text": "Dr. Krista is a caring doctor. He genuinely wants to help his patients. I appreciate him and his nurses being patient and thorough!", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "116487491358833012088", "name": "Terry Heinrich", "time": 1627665215590, "rating": 5.0, "text": "Can't say enough about the care givin here! Dr. Krista is second to none !", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "107560621979291087886", "name": "Gregory Peters", "time": 1621975992368, "rating": 5.0, "text": "The place clean and the service was fast. The nurse and the doctor both were great everyone was polite and professional", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "117276787136918658572", "name": "dawn stough", "time": 1617057685609, "rating": 5.0, "text": "I was a walk-in and was seen within minutes with no waiting. Excellent care from the moment I walked through the door until I left. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "108136302275233827571", "name": "Renee Christian", "time": 1617644028413, "rating": 5.0, "text": "Professional, informative and thorough.  They were not busy so I was in and out in less than 30 minutes. Very pleased with Prime Care. I will be back.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "108037655629351662697", "name": "JUAN KIMBRO", "time": 1618251002426, "rating": 5.0, "text": "My symptoms were shortness of breath, blood pressure and pulse rate had spiked up earlier. Dr. Krista had electrocardiograph , chest X-ray, blood work, oxygen level check, performed. All that showed up was abnormal\nelectrocardiograph. He referred me to the ER for further diagnostic testing. Good, quick, professional care.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "118024178769066869715", "name": "helen ryals", "time": 1621444650964, "rating": 5.0, "text": "Friendly service got to the reason why my back was hurting.  Great service", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "114510471352417003401", "name": "Lucy Lucille", "time": 1622584938304, "rating": 5.0, "text": "Dr. Krista and his staff were great!  Very attentive and caring!", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "100252178484623529386", "name": "Betty Weed", "time": 1625857623851, "rating": 5.0, "text": "Dr. Krista is amazing, totally professional and great at knowing his patience.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "108482888764723627964", "name": "Stephen Casey", "time": 1615829561448, "rating": 4.0, "text": "I have visited this doctor office a few times. The staff was a little off the first few times, but, with the covid going on I could understand frustrations I guess. One of the doctors or nurse (I forgot what she was honestly with that poor attitude) on my second or 3rd visit was kind of rude and I wouldn't go back to her. But my most recent visit was a pleasant visit compared to my circumstances. Dr. Krista saw me quickly,  and was nice and also to the point, his nurse was very respectful, and the xray tech was awesome to. All in all I recommend.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "116553627238843292838", "name": "Kenyotta Haire", "time": 1615829772296, "rating": 5.0, "text": "Professional staff and great doctor! Dr Krista was attentive to my needs and I felt no rush in his services.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "113756609845266807063", "name": "Jamey Vibbert", "time": 1616457191870, "rating": 5.0, "text": "This is a great group. Called me twice to stay in contact with me. I’ve have always used This clinic and will not go anywhere else. A++++", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "106800589241560800820", "name": "G Bullard", "time": 1623714419846, "rating": 5.0, "text": "Extremely nice staff.  Did have to wait long.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "100599440711392162904", "name": "Kimberly Bush", "time": 1617989634258, "rating": 5.0, "text": "Excellent service from the front desk to the Dr. Thank you for getting me better.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "106876446577608111992", "name": "Regina Burns", "time": 1623691250348, "rating": 5.0, "text": "Took my husband and received great service.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "101702474862293113114", "name": "Rhonda Pasibe", "time": 1621618780979, "rating": 5.0, "text": "Very thorough, listens, explained options to me, great communication and care.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "108630649064967574362", "name": "Mike Maund", "time": 1623087680964, "rating": 5.0, "text": "Very straight forward and easy to understand.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "115668642139295647168", "name": "Kevin Sheppard", "time": 1621273577060, "rating": 5.0, "text": "Has always been absolutely outstanding at Primecare", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "100748196921433977981", "name": "Martha Hatfield", "time": 1616165605091, "rating": 5.0, "text": "We appreciate the care given by Dr. Krista, he is kind and very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "102962516192553457221", "name": "Joanne Williams", "time": 1617215246735, "rating": 5.0, "text": "The staff was friendly,  Dr. Kristi was compassionate, very  informative, patient and very professional .", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "116547420744016031712", "name": "Allie Davis", "time": 1620925979959, "rating": 5.0, "text": "Very professional and quality Care.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "104784553154352365098", "name": "Kari McAdams", "time": 1615400494046, "rating": 5.0, "text": "I've seen him several times.   Each time I've found him to be competent, quick and kind.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "115325883246073761897", "name": "Dalia Arguelles", "time": 1619804551206, "rating": 5.0, "text": "Very nice 👌", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "115277408519018589457", "name": "R L", "time": 1629140594119, "rating": 5.0, "text": "Dr. Mathew Krista and the Staff at Primecare were awesome Saturday when I visited the clinic. Words can not adequately express the gratitude I have toward them. Moreover, I thank Dr. Krista for his thorough care and kindness. I've never had a Dr to show such professionalism and thoughtfulness as he did toward my care.  Thank you so much.", "pics": null, "resp": null, "gmap_id": "0x88928d994707e193:0x133fb3860b948f4f"}
{"user_id": "103013530006706266996", "name": "Bridget Elder", "time": 1545862321111, "rating": 5.0, "text": "Rich the NP has just demonstrated to me and my family what healthcare is all about! My daughter was seen by him on Monday and today he called her to follow up! We are from Oklahoma and have been to several ER's and Urgent Care Centers and have never had a provider call us back to follow up!!!!\nThank you for caring and going above and beyond Rich!\nWe appreciate your kindness!", "pics": null, "resp": null, "gmap_id": "0x888922fa841b082d:0xa9d1bf166fc2b513"}
{"user_id": "105800497302459816537", "name": "Tyler L", "time": 1547763784241, "rating": 1.0, "text": "This place sent fictitious charges to a collection agency. I had full medical coverage at the time in 2017. They sent the charges to collections as if I didn’t have insurance, even though I was covered.\n\nI called to get this resolved and Ashley was not helpful. There wasn’t a clinic manager, she gave me a bad number to the billing dept, and she was flat out useless.\n\nAfter hours of phone calls, I finally got on the phone with billing, collections, and blue cross, Blue Cross determined that Riverchase Urgent Care filed the claim under the wrong insurance contract.\n\nI called back to speak with a manager and Ashley didn’t know anything. I find it hard to believe that you don’t know where your superior is and that there is nothing that she could do.\n\nThis place is trash and a primary example of what is wrong with the medical system.", "pics": null, "resp": null, "gmap_id": "0x888922fa841b082d:0xa9d1bf166fc2b513"}
{"user_id": "111517163960790256887", "name": "Carmen Pangman", "time": 1502127086091, "rating": 1.0, "text": "Awful experience from start to finish. Everyone was friendly but couldn't seem to do their jobs very well.", "pics": null, "resp": null, "gmap_id": "0x888922fa841b082d:0xa9d1bf166fc2b513"}
{"user_id": "114438362322958149374", "name": "George Corey", "time": 1518796730827, "rating": 5.0, "text": "Great place to come when you need a Dr..family has been treated from the flu..fractured foot...physicals..and everything else...usually very short wait times...they have become our primary care for our entire family...", "pics": null, "resp": null, "gmap_id": "0x888922fa841b082d:0xa9d1bf166fc2b513"}
{"user_id": "116984172152263353597", "name": "Joel McCarn", "time": 1502438543328, "rating": 3.0, "text": "Not good for serious or life threatening issues", "pics": null, "resp": null, "gmap_id": "0x888922fa841b082d:0xa9d1bf166fc2b513"}
{"user_id": "114767813943152919021", "name": "Gregory Jordan", "time": 1622106915280, "rating": 1.0, "text": "My dad drove to the emergency room and a few days later, they discharged him at 10:00pm after calling a 3rd emergency contact we had listed to tell them he had fallen, after talking and laughing earlier that day, that night he couldn't speak or barely move all the way home and had to take him to st.vincents the next morning, he died a few days later, if you love the person you might be taking to the hospital in the future,  I beg you don't take them to this hospital!!!", "pics": null, "resp": null, "gmap_id": "0x8888dddb13e656c9:0xb46b35433b1652e3"}
{"user_id": "101391125150967309308", "name": "Wendall D. Graves (Big Daddy Graves)", "time": 1581517947269, "rating": 5.0, "text": "Because I was able to keep on loving and caring for my wifey, because they &I kept her alive. 🤟💯", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOhuuTNPc-Mu_N9eGOhKZeU4Q1eXW9gemhCvXw7=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888dddb13e656c9:0xb46b35433b1652e3"}
{"user_id": "113747073826382307687", "name": "W", "time": 1624149865654, "rating": 2.0, "text": "Emergency Room facility was very filthy the equipment as well as the floors .\nI just hurried up and got out of there even though I was sick my surroundings were creepy and a few mosquitoes got on me\nwhile I was there and when I checked in at triage desk.", "pics": null, "resp": null, "gmap_id": "0x8888dddb13e656c9:0xb46b35433b1652e3"}
{"user_id": "100866593918745359599", "name": "luv for evs Benjamin-Dobbins", "time": 1598105920686, "rating": 2.0, "text": "Intake service horrible. Intake nurse & lady at desk were very rude. Facility dirty and needs maintenance attention.", "pics": null, "resp": null, "gmap_id": "0x8888dddb13e656c9:0xb46b35433b1652e3"}
{"user_id": "103727658715190952809", "name": "Ginger Minor", "time": 1602868219080, "rating": 5.0, "text": "This doctor in particular  ( Fuller ) is great !!", "pics": null, "resp": null, "gmap_id": "0x8888dddb13e656c9:0xb46b35433b1652e3"}
{"user_id": "105917057393371849003", "name": "Tera Gallinari", "time": 1597856071782, "rating": 1.0, "text": "If there was a rating for ZERO it would be that for pre registration department. EXTREMELY RUDE and laughed at me because I wanted to update my info for my last name and insurance over the phone. And then laughed at me again when I asked about there location.  EXTREMELY UNPROFESSIONAL", "pics": null, "resp": null, "gmap_id": "0x8888dddb13e656c9:0xb46b35433b1652e3"}
{"user_id": "110909577509938352750", "name": "Top TierLLC", "time": 1596081144216, "rating": 1.0, "text": "They are sorry and lazy up there and take to long. And the employees are rude. I wouldn’t recommend no one to go there!", "pics": null, "resp": null, "gmap_id": "0x8888dddb13e656c9:0xb46b35433b1652e3"}
{"user_id": "106990625928239100028", "name": "Clara Palmore", "time": 1567037036860, "rating": 1.0, "text": "Visited my brother who was admitted, on the way to his room the floors were filthy you didn’t know if it was blood or soda leading to the front elevators medical west needs to do better. My brother’s nurse bless her heart needed to be retired, while able bodied nurses sat at the station gossiping everyone in housekeeping need to have a spatula scraping those hideous floors cleaning top to bottom.", "pics": null, "resp": null, "gmap_id": "0x8888dddb13e656c9:0xb46b35433b1652e3"}
{"user_id": "114987191228109580254", "name": "ashlee cook", "time": 1562382108092, "rating": 4.0, "text": "I will admit I haven’t heard many good things about them but they were most convenient at the time the one girl at the front that checked me in was quite nice , there was a little of a wait and I thought people that where coming in after me were going in before me but once I got in my room the staff that came in my room were supper comforting and and sweet and I’m glad that everything ended up being okay", "pics": null, "resp": null, "gmap_id": "0x8888dddb13e656c9:0xb46b35433b1652e3"}
{"user_id": "113756685296717319154", "name": "Richard Horton", "time": 1608519597171, "rating": 1.0, "text": "IN A WORD:  (  NO!  )", "pics": null, "resp": null, "gmap_id": "0x8888dddb13e656c9:0xb46b35433b1652e3"}
{"user_id": "115217793681896123840", "name": "Jeff dungan", "time": 1548972053971, "rating": 1.0, "text": "Waited way to long. Was told they didn't have any beds open I wasn't there for a bed only an x-ray. Also very dirty, stuff all over the floor. The cleaning person came by twice and swept up a little bit then moved on.\nWill not go back.", "pics": null, "resp": null, "gmap_id": "0x8888dddb13e656c9:0xb46b35433b1652e3"}
{"user_id": "106368012864999634824", "name": "Susan Martin", "time": 1528830282728, "rating": 2.0, "text": "Been waiting to see a doctor after a head injure. I’ll might not be a real emergency, but 2 hours in waiting room is ridiculous.", "pics": null, "resp": null, "gmap_id": "0x8888dddb13e656c9:0xb46b35433b1652e3"}
{"user_id": "112285474249205094532", "name": "Ali Almaklani", "time": 1537745268934, "rating": 1.0, "text": "Longest wait ever even when  there was no1 else in the waiting area.", "pics": null, "resp": null, "gmap_id": "0x8888dddb13e656c9:0xb46b35433b1652e3"}
{"user_id": "110867897232482435944", "name": "william riddle", "time": 1565446400982, "rating": 5.0, "text": "A caring staff", "pics": null, "resp": null, "gmap_id": "0x8888dddb13e656c9:0xb46b35433b1652e3"}
{"user_id": "109713380751658007191", "name": "Justin Presley", "time": 1536614179924, "rating": 1.0, "text": "It took a total of 4 hours :(", "pics": null, "resp": null, "gmap_id": "0x8888dddb13e656c9:0xb46b35433b1652e3"}
{"user_id": "114449310126831996075", "name": "Jake Pentecost", "time": 1623903248543, "rating": 5.0, "text": "I'm all better thanks fast and friendly and affordable", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "117556399268321613299", "name": "Teresa White", "time": 1620682672722, "rating": 5.0, "text": "Dr.Justin B.and nurse were very kind and compassionate. Did not have to wait a long time to be seen. Will definitely use this Urgent Care in the future.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "112877039851906560938", "name": "Diane Burns", "time": 1605819123332, "rating": 5.0, "text": "Well the front people are so nice very helpful. The doctor was kind, sweet, to the point. He was so professional & cute as a new puppy. Yes I had to wait a little while but from the staff & doctor they were amazing. I will continue to use this facility for urgent care needs...❤", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "109058561034118277730", "name": "Laura Taylor", "time": 1607012363772, "rating": 5.0, "text": "This urgent care will ALWAYS be first choice for me. From the moment I arrived, until the time I left, I was more than satisfied with my care team. If you don’t have someone great that you can trust with your entire family and healthcare, I recommend Justin Wilson, CRNP. He has repeatedly given me exceptional care and puts his patients first. I have always hated going to the doctor but the care I received by Justin Wilson and his team has been amazing. I truly felt like a person, rather than just a number. He is prompt and gets you in and out as quickly as he can, but ALSO takes time to listen, so that you don’t feel rushed like you do most places. That’s super important to me. I will gladly and confidently recommend Justin Wilson to any of my family and friends! He was a hidden Gem that I am forever thankful my family has found.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "114063278841275596360", "name": "Brenda Scott", "time": 1619356678739, "rating": 5.0, "text": "Prompt on care and diagnosis. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "103774742623181370476", "name": "Michele S", "time": 1605551090751, "rating": 1.0, "text": "Go somewhere else for Covid19 test. Waited an hour past my appointment time while watching them quickly see patients that came in 40 minutes after I did. Doctor claimed they were following appointment schedules but clearly this urgent care does not care about appointment times.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "111208740154286219458", "name": "Jennifer Myers", "time": 1609023133455, "rating": 5.0, "text": "When our doctor at CPC is swamped, or after hours, we'll always come to CPC Urgent Care. The staff is friendly and caring, always smiling and welcoming. The doctors are extremely knowledgeable and empathetic. We recently had to come for a Covid test, which came back positive. The doctor sure hated to be the bearer of bad news, but he made sure I knew everything I needed to in order to take care of my daughter at home, and what to look for if an emergency were to arise. We were there no more than 20 minutes.\nThey are always quick, even with walk-ins. I appreciate CPC Urgent Care so much, and will always refer them to others. I've not had a single issue, and we've been coming here for the past 6 years at least.\nThank you for always having the patient's welfare your priority!", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "112748280959924171820", "name": "Kristen & Terry Smith", "time": 1600694594682, "rating": 5.0, "text": "We love this urgent care. The clinic has nice and friendly staff. We love the doctors as well.", "pics": null, "resp": {"time": 1600701828990, "text": "Kristen & Terry, we're so glad to hear about your experience with us! This is exactly the type of care we strive to provide every time - thanks so much for the kind words. We really appreciate you taking the time to let us know your thoughts - CPC"}, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "102084915214951639603", "name": "Brett Williams", "time": 1595138562557, "rating": 1.0, "text": "I went in with a temp of 104.5 severe headaches and cold sweats they told me \"oh it sounds like covid\" they gave me a covid test and a shot to dampen the headache and sent me home but not before telling me that \"covid doestn kill most people its the pneumonia from covid that gets them\" so at midnight that night my temp climbed to 105 so i went the er they gave me an instat result covid test said it was negative and that the urgent care misdiagnosed me and what i really had was pneumonia and told me that i was lucky i came in so this urgent care is so obsessed with covid they are putting people in danger by misdiagnosing people", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "109492223388260984636", "name": "Sarah STORCK", "time": 1569941754814, "rating": 5.0, "text": "I am very satisfied with Dr. Smith and his staff. If you do not get there first thing in the morning, lunch or after school hours the longest I have waited is 10 minutes. He listens and helps.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "100651488258273042449", "name": "Kelly Jo Wheeler", "time": 1568911871396, "rating": 5.0, "text": "I've had the best experiences with them! Just recently, i was there with major pain in my stomach and they went above and beyond to find out what was going on. Thanks to them i was able to get in with a gastrologist asap; which turned out to be a blessing because i needed a colonscopy and other tests! If it hadn't been for their willingness to go above and beyond, i don't know how sick i would continue to get! Thanks for your  hard work, compassion, and care!", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "105334109368771087891", "name": "Rebecca Richardson", "time": 1565464032470, "rating": 4.0, "text": "I took my best friend here. There was not a wait. My friend was very sick, they took x-rays of the chest. My friend's blood pressure was high and they immediately treated it first. They treated the other symptoms and call the pharmacy to fill the medicine. The staff were caring and professional.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "111507186435259876526", "name": "Robbie Jean Bates", "time": 1563145882662, "rating": 5.0, "text": "Love the staff & love Dr. Mark & Dr. Jonathan! Very caring every time I've had to take any of our children there & also ourselves.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "103711559923933651011", "name": "Furnished With Finesse", "time": 1507912442780, "rating": 5.0, "text": "I came into Cullman on business and a found myself very sick with a bladder infection.  I immediately called Cullman Primary Care-Urgent Care Center to see if they could take my out of state insurance and hopeful that they could see me right away.  They were very responsive and professional.  Upon arriving the staff was friendly, efficient and treated me like family.  My recovery has been quick and I  would recommend this center to anyone looking for fast friendly emergency medical treatment.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "112959427203218179804", "name": "Brenda Cornelius", "time": 1522894478806, "rating": 1.0, "text": "While everyone was fairly friendly, I believe this to be the last visit to this facility for our family.  I called today to get lab results that should've been in two days ago.  I was told the results are there, but the NP couldn't be pulled away from patients to give results.  Was my son not a patient?\nTo me, this screams that patient well-being is of no importance to the staff and that is unfortunate.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "114994099660173277145", "name": "Zeta Smiles", "time": 1543784138576, "rating": 4.0, "text": "Great fast service, friendly and kind Dr that listens and checks out all concerns. I feel like more than just a number here.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "104637852052226006011", "name": "Melina Pylant", "time": 1462803154327, "rating": 1.0, "text": "Sunday, May 8, 2016 - We arrived at 5:37. They don't close until 6:00. There was one car in the parking lot and no one waiting to be seen in the waiting room. We were turned away and denied care. The receptionist put up her hand and said \"We aren't accepting any more patients today.\" When I looked at the clock in bewilderment she said it again. We weren't given a chance to sign in. We were not asked what was going on or who was sick. My daughter was burning up with fever, nauseous and weak. I wasn't given a chance to tell the receptionist that. We were shown the door. We had to take our daughter to the ER....flu and strep was negative. She has a virus. A virus! We let the ER staff know what had happened to us at the Urgent Care and we apologized to them for having to bring her in for a virus. We know they have other things, bigger things, they have to attend to there. Who knows how much that ER visit is going to cost us! I'm shocked at our experience at CPC Urgent Care and personally think Ms. Jones (that runs the place) needs to clean house.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "117154466676198902545", "name": "Nick Bracero", "time": 1493913634886, "rating": 1.0, "text": "We took put 2 year old son in because he was running a temp of 102.1. The nurses were great but the doctor was absolutely terrible. He did a strep test that he said was negative and sent us on our way telling us to alternate between motrin and ibuprofen because he \"didn't know why he was running a fever.\"\n\n4 hours later our son still has a temp of 102, so we take him to his regular doctor. They do a strep test and say \"it came back very positive, I'm not sure why they said it was negative.\"\n\nSo basically, we were charged to be misdiagnosed by a rude doctor.  I do thank the nurses for being great, but Dr Franks not so much.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "113285211955067017091", "name": "Michelle", "time": 1608729428469, "rating": 5.0, "text": "The staff ia great! The doctors are very knowledgeable and always takes the time to listen to you.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "112833149708682101557", "name": "Susan Woods", "time": 1467670494500, "rating": 3.0, "text": "I also did not care for the receptionist 's conduct and demeanor.  It is appropriate to ask if a person's insurance is the same but why would you ask a person if they still have Obamacare insurance?  I felt it was out of line to voice it that way.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "104681030525327328800", "name": "Tallie Schaffer", "time": 1509914603517, "rating": 1.0, "text": "Currently in the waiting room and have waited 1 hour and 22 minutes and I am anticipating waiting in the actual room for even more time, the doctor seems to be very slow and this place seems to not care about the patients that utilize their services. Do not recommend.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "109035495756047202787", "name": "Eagle Man", "time": 1515107544566, "rating": 1.0, "text": "The staff is rude and make you feel fun and the the two part that work on the front is did not look at me for 10 minutes because they was on there phone and talking about what they are going to do this weekend", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "106423803352179247566", "name": "W. A. Clemons", "time": 1514903226694, "rating": 5.0, "text": "The place was full when we arrived at 5:15 p.m., lot of sickness the day after Christmas. Reception staff was pleasant.  My wife had to wait a little more than an hour because of the number of patients, no fault of the staff. When she got to an exam room, the nurse (Delana, I think) promptly saw her. Delana was friendly and did her job well. Dr. Smith came in as soon as the test for flu was finished, and flu it was. He was professional and down to earth. He told my wife the treatment plan. Shortly after, Fatima came with a steroid shot for one buttock and antibiotic for the other. Dr. (or CRNP or PA) Smith told my wife the meds he was prescribing and what she should expect for the next few days. We left after a total of two hours, satisfied with this urgent care center and its staff.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "109335003682581397104", "name": "Rhonda Bracero", "time": 1493915697167, "rating": 1.0, "text": "My 2 year old grandson was seen at this Urgent Care on Wednesday morning because he had been up all night sick and with a temperature. My daughter-in-law made an appt at his regular doctors office but it was going to be late Wednesday afternoon. His temp was still up and we were worried so she decided to go ahead and go to Cullman Primary Care-Urgent Care that morning (waste of time). The office staff was professional and caring but the Doctor on the other hand was rude and basically acting as if nothing was wrong with my grandson other than being a whiny little boy... He is always a happy little boy just for the record but anyway my daughter-n-law was very worried about him and the doctor said well I can run a strep throat test but I am sure it will be negative... So he made my grandson very uncomfortable by shoving a swap as well as tongue depressor in his mouth without being gentle or caring and then came back a little while later and said he does not have strep, just go home and give him ibuprofen.\n\nWell a few hours later I had my grandson and he was still running a high temp and shivering so my son and daughter-in-law decided to keep his regular doctors appointment and they ran a test and it came back positive and the nurse said she does not know how it could have been negative 4 hours ago... Hmmm I have an idea.. maybe just maybe they were charged for a strep test and no test was actually done BECAUSE the doctor decided that he did not believe anything was wrong with my grandson... so basically they were charged $80 plus dollars for the doctor to do nothing other than make my grandson scared of a doctor and my daughter-n-law upset, then 4 hours later I am calling them and saying he is very sick so they went to his regular doctor and got a correct diagnosis​ and some meds to help him...\nSO I WILL NEVER USE THAT URGENT CARE AGAIN AS LONG AS DR HOWARD FRANK IS THERE.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "115131351017200184966", "name": "Linda Weaver", "time": 1555721979634, "rating": 5.0, "text": "Thanks for the Great care you all gave!!!", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "105489024752926426313", "name": "Lisa Davis", "time": 1502917028962, "rating": 1.0, "text": "If it was possible to give negative stars, I would have. My seventy-eight year old Mother fell last Friday, August the 11th and broke her wrist. My sister-in-law took her here to see how bad she was hurt and if any thing was broken.\nHer wrist was broken, so they wrapped her arm and told her that they would send a referral to a orthopedic doctor to have her arm put into a cast.\nThis was late Friday afternoon, so we assumed that it would be Monday before we hear from the referral doctor. Monday comes, no call. Tuesday comes, no call. Today, no call. So I call Cullman Primary Care and ask about why no one has called us.\nI was told they would call me back, I get a call and was told that the person didn't send any referral request to anybody. Then she tells me that if Mother will go the orthopedic doctor they called right then, they would put a cast on her arm.\nSince I'm in Florida, I asked for the doctors name and location, so that I may tell my sister-in-law where to take Mother. The person couldn't give me specific directions or even give the correct pronunciation of the doctors name. I have NEVER dealt with a more inept doctors office than this place.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "106463855865043701948", "name": "Julie Gobbell", "time": 1475380878803, "rating": 3.0, "text": "It's great to have an Urgent Care office to go to to avoid the emergency room. This Urgent Care is often busy, so write down your questions and observations in advance. If you need any updates on vaccinations or a flu shot done they should be able to do that there.\nYou can describe to the receptionist what you need done, but be prepared to describe it to the nurses and doctors, also. They don't always have the chances to communicate with the receptionist.\nThey will do whatever you need done, as quickly and efficiently as possible.\nAs in any doctors office, be confident to be your own advocate to ask questions or ask for other aspects of care for your Urgent Care concern.\nBe aware of the hours. Try to get there at least 1 hour before closing time.\nIf they forget to ask if there are any changes in your insurance, you might have to ask them for a form or you will end up with a bill from a prior Insurance Company that no longer covers you. That happened to me recently, but a phone call to the Urgent Care office rectified the situation in just a few minutes.\n\nI was looking at a prior comment and understand why the reviewer was dismayed and upset. To give the staff the benefit of the doubt, I would call ahead and tell them my insurance. I would ask if they accept that before heading to the office. If someone asked me if that was ObamaCare insurance, I might respond, \"Do you mean, do I have a public option Healthcare plan through the Affordable Care Act (or ACA)? This is my health care carrier, do you accept it?\"\nIf for any reason they say no, then indeed, I would go to the emergency room, but I would contact my health care representative as soon as possible and ask for an updated list of providers in my area.\n\nIt's always best after an insurance change to  find out ahead of time which providers accept the insurance and then confirm that with the providers before there's an Urgent Care situation, if possible.  Usually with a change in health insurance, the provider gives you a list of in-network and out-of-network offices, so it is a good idea to check that in advance. It sounded like a political judgment call, but it may not have been. A lot of people call the ACA public options Obamacare, and they may simply have different forms for public options than they do for health care provided through employers. If there is any further indication that it is a political judgment, the physician's office should be reported to the health care provider. But if they are simply out of network, it's a good idea to make those arrangements in advance.\n\nPeople can usually use an out-of-network doctor. This often happens if one spouse works out of state and the rest of the family is in a different state. The premiums might be a little bit higher, but if it is more convenient, it should be possible to make an arrangement with the physician's office. I've been told in some cases that they simply aren't accepting any more patients or that they are no longer carrying an insurance that was in my providers list. There could be many reasons for this that have nothing to do with judgments or politics. And a family may have to look elsewhere for an office that will accept their insurance. I have several different medical problems for my primary care I can go to town, but for other positions I have to travel quite a distance.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "109663483116364955792", "name": "Priscilla Garcia", "time": 1486985939548, "rating": 5.0, "text": "Our Doctors office is in Madison and they are also helpful when we need in and out. I wouldn't trust any other place in Cullman.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "110983066045349271134", "name": "Mary Lemley", "time": 1558397037349, "rating": 1.0, "text": "No doctor here. Bye.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "103700097731507347253", "name": "LESLEY PEEK", "time": 1530985999733, "rating": 5.0, "text": "Great doctor and nurses", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "108246287512391844931", "name": "Danny Talley", "time": 1508189246715, "rating": 1.0, "text": "I caried my sick wife here and after waiting over an hour and a half I got my copay check back and left. Completely ridiculous  will never go back. There were other people there who said they had been there waiting 1 1/2 to 2 hrs.", "pics": null, "resp": null, "gmap_id": "0x8889cbff582107f3:0x5bec705340e8c23c"}
{"user_id": "102129223335780383330", "name": "Cyndi Hebert", "time": 1615619322504, "rating": 1.0, "text": "We used to love this place, but the doctor tonight has changed my mind. We were treated rudely and beneath her. She had no care in the world about my child and had her mind made up it was depression and not sickness. FYI, he has a brain disease. Smh. Hello Vanderbilt, goodbye Children's.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "114681558315651956917", "name": "Mindy Tobin", "time": 1510282317624, "rating": 5.0, "text": "This is not a first come first serve hospital..this is a sickest child goes first hospital..thank god..Remembering that time is of the essence in the event of an emergency while you wait is a must.sometimes the sickest baby doesnt look ill at all..oh and..its christmas time !!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPITWffKTgL9UJ26CIS7_g-k40mN1-D_UOWGIw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPs2btANT2JspU3h_66u5me2nApAQR8Kw7wv2E=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPg5IqlJ8tEfGq6MqZQ1qNYPuoQQ8o5Sj_aK3Y=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN7oY_MAVYK8I2eZqoVVm4-GZyhc0O6OyIG9Qg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNLmxUV7q3KrkQmZsfxZmEDe31WpfJiaHRCe-w=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMaJHClh3LIn18L7Dqz4QCQfWupuda4f0CUFxQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM4_9wUxfaUPMu7TnegVVprjtA3Kcg4NJtSyPU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "114343255222891354564", "name": "pedro martinez", "time": 1596690296591, "rating": 5.0, "text": "We have been to many urgent care facilities over the years, but tonight was another level. We had to go the children's. I can not tell you what it meant to us. From the moment we walked in the door, things were different. This is the kind of medical care I heard my mom talk about in the 50's, genuine concern and compassion. We had been to 2 different urgent cares and had gotten the run around, before we finally decided, we need to go downtown to children's. The urgent care facilities' demeanor was negative and \"be thankful for what you get\". Children's was different. Compassion and loving urgency to get this child some comfort was so obvious. My child immediately relaxed and become a willing patient. In short, he felt their love. Man, that makes a huge difference! Please don't stop being the compassionate and loving medical providers that you are, it makes oceans of difference.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "102403724372134744675", "name": "Patty Griffith", "time": 1549723280360, "rating": 5.0, "text": "Children’s of Alabama Emergency Room is a place where they will put your mind at ease. Your child or children are in the best care. I have taken my son more than once and never felt so reassured that he would be taken care of like he was one of their children. You can valet your car to avoid the hassle between 16th and 17th street. A great service to make the emergency room trip run smoothly.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNlxdcZdZfKCOLfDDPDNsOZUdVpu5tin7eEfYTD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOk_fNhhlwWznXHeyKcTVRLk1UsUAPt6JggmpyT=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "114189131687104506507", "name": "Drew Mack", "time": 1594678567267, "rating": 5.0, "text": "I am a patient that has had back issues going on for 4 months without a diagnosis.   I went into the ER because I had no way to stop my pain.  I entered the ER around 8:00pm.   I had a very high BP and pain level.   I got called back about 8:30pm and was admitted into the hospital for 5 days.  Thank you Children’s for all of your help.  I will fight through this.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "112714131985814225491", "name": "McDonald *", "time": 1605211556898, "rating": 1.0, "text": "Wow, ER doctors are so good now they can diagnose a toddler that has had 3 days of temp (currently 104) just by looking at them. NO testing required!!", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "118157895932969738686", "name": "Jack R", "time": 1601294096081, "rating": 4.0, "text": "Eh, it was decent! it took forever for doctors to come, but not bad at all", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "105935848951881922489", "name": "G G", "time": 1612662871214, "rating": 4.0, "text": "The wait was long but the quality of care was worth it.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "108484611123968641038", "name": "sothonn harbison", "time": 1579289715268, "rating": 1.0, "text": "Don't waste your time- you won't get seen till hours and hours later. By then I could have had my regular pediatrician see my baby. Go to the ER for these signs they say. Very high fever is just another number. No concerns for the vomiting, rapid breathing, hard to breath, seizures, baby turning purple and temperature keeps rising to alarming levels even after medicine, cold rag and bath. And then to be release with a \"virus\"? Can they be anymore vague?", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "105720454373633906072", "name": "Buddy Skinner", "time": 1523587075248, "rating": 5.0, "text": "The staff, the valet parking make for a pleasant atmosphere upon our arrival at Children’s of AL. ER. The nurses and doctors were all well trained, professional, and also friendly to our child/us.  They listened to him explain his symptoms. Then everything they were doing to treat his illness and get him stabilized. Very comforting knowing such a wonderful, first class facility is located so close to our home. Birmingham is Blessed to have Children’s of AL hospital.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "112283320450369831948", "name": "Aris Garcia", "time": 1568153160759, "rating": 5.0, "text": "Wonderful staff, they treated my son like he was the only patient...more than a hospital a 5 starts hotel.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "118019464082498830292", "name": "Alan Thornton", "time": 1570994398482, "rating": 1.0, "text": "My 4 year old nephew waited 4 hours with a neck injury that was hurting him so bad he was shaking. After the 4 hour wait we asked how much longer it would be and was told another 4-5 hours. Meanwhile a guy gets brought in by police in handcuffs cause he got bit by the k9 in the hand trying to run away comes in an hour after us and he got taken straight back. We ended up taking him to another er the next day and when they xray him he had an out of place vertebrae in his neck . But they take in a criminal first... PEICE OF TRASH HOSPITAL", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "107484171945847306601", "name": "shelia wade", "time": 1571087265059, "rating": 5.0, "text": "They quick and they take good care of  Jaylen Bailey when he arrive.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "103107569468749754383", "name": "Brent Elrod", "time": 1582241679860, "rating": 5.0, "text": "Great place!  They’ve done a lot to help our child.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "106324080491743631297", "name": "Cristen Greathouse", "time": 1550133131267, "rating": 1.0, "text": "I was sent to children's to get a ct scan after a doctor's x-ray showed something abnormal. My daughter was run a low fever and her white blood cells count was high and she had chest pain a hard time taking a deep breath. When we arrived everything was quick and easy they even give her  medicine to help with the fever . Then we got put in a room the resident doctor can in to tell us that they wasn't doing a ct scan but another x-ray.  I was a little  Confused but ok at 6:30 they took her back for another x-ray she got back at 6:35 . Then the waiting game was on we wanted for a hour for them to tell us she was fine and could go home,but if she started running a fever and having a harder time breathing to bring her back . Then I was really confused.. She was running a fever when we came in and they never  Explained why her white blood cell count was up. But she was fine !! So I guess your telling me my 14yr is making up the chest pain shortness of breath and fever..", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "106553229799045146883", "name": "Ashna S.", "time": 1523105259714, "rating": 5.0, "text": "Love love love this place. The staff are amazing, friendly, gentle, and very caring. The wait can be pretty irritating when your baby is hurting but once they get you back in a room it’s a breeze from there. I had originally taken my daughter to St Vincent’s in Pell City because her doctor had told me to take her there. They were no help. Children’s will always save the day. Thanks so much Children’s hospital.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "114850848215976440355", "name": "Lythea Brown", "time": 1575509823779, "rating": 1.0, "text": "Worse place I have ever been too! I would not recommend coming here and I want even here for me or my cold I was a friend's driver. But the wait was ridiculous and the front nurses were rude and not helpful and withheld information.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "100524992617982109653", "name": "Aida Talley", "time": 1529907743734, "rating": 1.0, "text": "The building is beautiful. I did not like the fact that there was a metal detector in a children's hospital. The staff was very nice but we waited for an hour for my daughter to get a room after coming in ambulance then when she was placed in a room we waited two hours and no one every came. One RN said she didn't know we were even in the room. My daughter fainted without warning at a subway while coming from our family vac. She was unconscious shortly but conscious when I arrived. We left the hospital.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "107823879185127367747", "name": "craig wooden", "time": 1529717931465, "rating": 5.0, "text": "Top notch staff and physicians. Brought my daughter to the ER and had no wait. We went straight to a room and a doctor was in within a few minutes. Everyone was nice and helpful. I would highly recommend Childrens of Alabama.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "101868106466202311195", "name": "Gus E", "time": 1522201475476, "rating": 5.0, "text": "Our son was transferred here from another hospital bc they couldn’t keep an IV in.  1st try at Children’s, and they get the IV started. Outstanding team.  kudos to all the staff! Very loving and sincere. Simply the best.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "114784180296728258676", "name": "Kunqi “No longer well rested”", "time": 1557171393677, "rating": 2.0, "text": "Ok i guess. Its really long and the staffs looks like they don't care about their job anymore. I have crohns disease and most of time every time i go to the hospital, they just.. Look at you with dull eyes. Warning the staffs can immediately make you feel unwelcome", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "104343331847549955310", "name": "Holly Fitz", "time": 1546446961708, "rating": 1.0, "text": "1st time visit to Children's ER around 5pm for high fever and eye swelling following surgery that same morning at 7am. Let me stress to you the shock at walking into this place. When you arrive you hand over your bags to security to be searched and walk through a medical detector. Upon walking in i appalled. The place was disgusting. The floors and chairs were smeared in god knows what and their wasn't a hand sanitizer station visible in the place.  Upon intake my child was given a large dose of Tylenol (even though i had just given him some 2 hours before) the dose was 3.75 ml even though our sheet from pediatrician says weight gets 2.5ml. and he was given a dose of Benadryl and we were sent back to waiting room. After an hour or so we were taken to a room where the billing representative came immediately to collect my 100 copay and then an hour later we saw a resident who snottily corrected me when i called him a nurse. He asked some questions looked him over and left. I didn't see anyone again for hours. I was by myself, my child is an infant and i needed to use the bathroom. the only one was in the hall. The bed had no rails to leave my baby in, there was no nurse visible or that answered the call button to assist and the bathroom had no table to lay him on so i could use the bathroom. After a few hours the doctor comes in with a nurse and informs me that my child is allergic to tape (where they taped his eyes down for surgery that morning) and he has sensitive skin. And that they were going to give him a dose of Benadryl to help the swelling. I said NO you just gave him Benadryl on intake and a very large dose of Tylenol. They were like oh we did? Sorry.. I pointed out that the Benadryl did not help and his eye is looking progressively worse and that if he was allergic to tape wouldn't both eyes be like this?  They informed me they weren't going to do anything or run any tests and to follow-up with regular doctor tomorrow. They would however do a flu test to appease me. I know he doesn't have the flu and after 30 minutes i paged the nurse to ask if we can go home and have the flu results called to doctor the next morning? They said they will tell the nurse and send her in to talk to us. Never showed up. Flash forward another hour and 45 minutes. Flu negative and we can finally go home. Vitals and temp never checked since intake and no bloodwork drawn. Nothing. The next morning my child breaks out in the roseola rash. Thanks for nothing Children's. I'm glad my child wasn't having post-surgery infection. If my baby needs to go back to ER. We'll be going to Grandview.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "106156261515527148662", "name": "HairByTammy T", "time": 1512539114490, "rating": 5.0, "text": "Top-notch facility & staff! Courteous & very thorough! We appreciate the care my son received tonight!", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "112098571604131942853", "name": "Jennifer Hutchings", "time": 1539114671957, "rating": 1.0, "text": "Just want to let you all know that ur emergency staff last night was horrible...i brought my daughter in cause she hit the door frame and had 2 goose eggs on her head and immediately started throwing up. We also brought it to their attention that she was hurting in her private area. They had us there for 2 hrs and didnt do anything but give her some Motrin. When they said that they weren't going to do a ct scan due to radiation we thought ok well we will be going home in a minute then. They kept us there for 2 hrs with them seeing that she was in pain in her private area and they wouldnt do anything but tell us to get some diaper rash cream. They could have given her something for some relief and was going to keep us for 2 more hrs to watch her for the head condition when it was clear that she was fine with that.  I also told them that she is a symptomatic hemophilia carrier and they did absolutely nothing for her. I had to finally just say let us go so we can go get her something to help with the pain. I had to google what i needed to get for her and leave there and go by CVS in the middle of the night when they could have given her something there. I haven't had many problems from children's before but last night was the 2nd worst experience I've had there. Their job is to make these kids feel better not ignore the symptoms. I could have given Motrin at the house and avoided the hr s that I spent up there FOR ABSOLUTELY NOTHING", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "102029797922960441558", "name": "Demyla Matthewjr", "time": 1572277705092, "rating": 1.0, "text": "My son years old and he sick throwing up bleeding nose been here since 8 still n the waiting room a 11 really sad", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "101024263029856600328", "name": "Shannon S Crenshaw", "time": 1475509932538, "rating": 3.0, "text": "Typically we have good service.  Today I have been waiting for 2 plus hours waiting to be seen by the doctor.  I was told due to my child being sicker then other patients it would take longer.  Not sure of that logic.  Not happy, Life with insurance in America.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "110627619778426149273", "name": "Carrie Harden", "time": 1508273083352, "rating": 1.0, "text": "My 10 yr old daughter died after 42 days on ECMO. We were told in front of dozens of witnesses there just wasn't nothing left they could do yet when we get her med rec it shows they \"resuscitative measures were deemed medically futile although family did not explicitly withdraw care\" then at 12pm her pump was reduced to 1 which wasn't life sustaining and no further vitals or any other records were logged after 12pm but she didn't die until 1:24pm. Also none of her meds were given except sedation! Why lie? If she was beyond saving then why lie to our faces?", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "103644993112758042620", "name": "raven prince", "time": 1484108345291, "rating": 3.0, "text": "This visit wasn't so great since the  nurse forgot to give me a sample cup for my daughter which postponed our time by an hour since we had to wait for her to use the bathroom again. Dr. Childress is Amazing! This is my second encounter with him and he has been very nice to us. I was excited when I saw the free valet service but upon leaving they lost a patients vehicle! She had her ticket and they brought her another persons keys asking if they were hers and what type of vehicle was it. It took exactly 10mins for them to bring my vehicle and they were still trying to figure out where the lady Durango was. I would've loved to give them 5 stars but sadly this visit wasn't that great.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "104129158442000868154", "name": "Jenna Walden", "time": 1505421307700, "rating": 1.0, "text": "I brought my 3 year old in due to a fall. Once we arrived, she started vomiting and couldn't stay conscious. The staff could care less. I walked out to the nurses station to find someone to help my daughter and I was told my nurse was giving someone an IV they would get her to my room. After waiting 2 hours, a lady walks in the room to register us and I still had not seen the nurse or a dr. At that point I got up and walked out with my child and went to another ER where they saw her promptly and ran test. I will NEVER take any of my kids to children's hospital again. Very poor service and you will never see a real doc just a \"nurse practioner\" if one ever makes it around to your room.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "102065235131184574700", "name": "Ryan Jones", "time": 1490447228032, "rating": 5.0, "text": "Best emergency department in the state! The care you get here is top notch.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "103457074556023893999", "name": "Poe Edgar", "time": 1573505630544, "rating": 1.0, "text": "We are still sitting in the ER waiting  room after 2 and a half hours. We did get called back but only to be turned around because \"we had to give your room to someone else\". If you come bring a lunch and have a friend or family member  on reserve so you can rotate.  We will probably still be here waiting when you arrive.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "100832981518196411891", "name": "Aries Gates", "time": 1479268011339, "rating": 1.0, "text": "Date of Service: 11/15/2016 @9:15pm Room 16 in E.R. I have had the worst experience in my Life! My son has been having Migraines for the last 8 years & he is 12 yrs old. When you have a child that suffers from this type of pain it hurts my Heart that Dr.Anna White would come & ask questions. Conversation: Dr. Anna White    Kameron what's hurting on you? Kameron replies my head is hurting really bad & my stomach. Dr. Anna White asked: How long has your head been hurting & Kameron replied off & on since last night but my stomach started today. Dr. Anna White then asked have he had any bowel movements & Kameron replied: he did earlier today & it was normal. Dr.Anna White asked if he has eaten anything today & Kameron advised he ate a couple hours ago. Dr. Anna White asked what did he eat? Kameron told her  he had Mash Potatoes, Pork Chop, & Corn( Let me add it was the smallest portion of food ever) but anyway Dr. Anna White then goes in to say this is a Non-Emergency Visit because if he tolerated a Meal it's not an Emergency! My response: it's an Emergency  to me because my Son never complains unless he is really sick & if he tells me he needs to go to the Dr. I'm going to bring him. Dr. Anna White then goes on to tell me that they are just counseling patients on Non-Emergency visits, I then cut her off in mid sentence & told her you don't have to help him we will leave because I felt she has had a long day & is now taking it out on us because she feels it's not an Emergency. My son has been at this ER dozens of times & we have never been treated this way. I don't want to ever in my Life step back into this ER as long as I'm breathing because I work in Healthcare as well & our Mission is to always make sure the patient is taken care of. Nurse was Great! Check-in Great! Wait was Ok! The Escort to the room was Great with a Smile! The Patient Coordinator was Great! Dr. Anna White is Horrible & I will write & call Patient Advocate to complain.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "100610791813206685809", "name": "Amber Ramsey", "time": 1461391268928, "rating": 1.0, "text": "Been sitting in the emergency room for almost three hours and we still don't know what's wrong with our daughter. Is the the doctor even here?", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "101632483256406764262", "name": "Stephanie McDaniel", "time": 1513004594988, "rating": 1.0, "text": "Absolute nightmare. Wait was 4 hrs in waiting room, was back in our room another 8 hrs. Absolutely absurd to be an emergency room. And still no answers!", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "113254382991738691931", "name": "Jaber Alnajar", "time": 1574198393599, "rating": 1.0, "text": "Minimum 6 hours that too much", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "102052251532593199640", "name": "Asia Lawson", "time": 1519231034638, "rating": 5.0, "text": "Great and  caring service very loving faculty", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "108627070065656706752", "name": "Erica Melville", "time": 1476337735424, "rating": 1.0, "text": "Horrible service, have been waiting for hours. Was kind of ghetto and overall a bad experience.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "114012168651205131195", "name": "Courtney Brianna", "time": 1624614777134, "rating": 1.0, "text": "Came here tonight because my 3 week old baby was sick and was told by her pediatrician to go to the ER if any worse.  That’s exactly what we did and we were told by the front desk staff that it would be another 5-6 hour wait IF things didn’t “change.”  We had already waited 3 and a half hours and decided to leave.  This used to be a great hospital but it’s going downhill quick.  I hope someone is capable of building another pediatric hospital in Alabama one day.  It will be a cold day in hell for me to come back.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0xf4200c41f2c591b6"}
{"user_id": "105385525260937713705", "name": "Joey Watson", "time": 1594398454340, "rating": 1.0, "text": "Avoid these people at all costs. There are new doctors on staff every 3 months and it’s exhausting because they’re always having to update records and files, which mean more unnecessary tests and costs. They will not be helpful. I’ve had ADHD and have taken adderall for almost 7 years consistently. They wanted me to do a drug screening before writing me a new script -AFTER I’d been coming to them for two years. I got profiled as a drug addict more or less. They’re terrible. Stay away.\nUPDATE: Their billing department CONTINUES to call me even after all of this insanity, so no, no thank you, Joel, instead I wanted to send all of my concerns to these folks, particularly regarding Dr. Marshall, who is now the \"sheriff\" (her words) of all things Central North Alabama Health. I look forward to seeing what the state board says about your actions.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO4f4DSebx4m0qZXfiiDghxkToKMCWP4a7kGrfT=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88625b58c56db4e3:0xbb363bd60df705bd"}
{"user_id": "102833086902583306951", "name": "Mary Hutchens", "time": 1538261999519, "rating": 5.0, "text": "Dr Turney is a very good Dr she takes walk in and I recommend her. She is a very nice Christian Lady.", "pics": null, "resp": null, "gmap_id": "0x88625b58c56db4e3:0xbb363bd60df705bd"}
