{"user_id": "113206315769864938296", "name": "Gihon", "time": 1622816583462, "rating": 5.0, "text": "Kisha Abercrombie is an amazing, well read attorney. Highly recommend her for any criminal case.", "pics": null, "resp": null, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "101331329086710682621", "name": "Catherine Griffin", "time": 1526344031689, "rating": 5.0, "text": "They just don't come better than Trip Walton and the Walton Law Firm. Your best interest is their top priority. HANDS DOWN!\n\nProfessionalism from start to finish, always keeping you in the loop.\n\nTrip is absolutely one of the best lawyers I have ever met, if not THEE best. A unique things about Trip Walton is that he never loses touch with the human side of his case or his clients. He has the best stories to tell and his laugh is contagious. But when it comes to business, he's so knowledgeable and informed, that one would think he wrote the book on  the law in Alabama.\n\nMy case is over, but I feel like I gained a friend for life. Thank you Trip! God bless you and your family!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMwwe1BOlm_OU1C8PG6rUVrh-r-TX7odT00w6Kl=w150-h150-k-no-p"]}], "resp": {"time": 1574443963361, "text": "Thank you very much for your detailed feedback Catherine! Very glad to see that you are happy with the outcome of your case. Our entire team at Walton Law Firm is dedicated to providing the best experience for every single one of our clients. I will be sure to pass on your feedback to Mr. Walton!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "107731434546584146278", "name": "Linda Powell", "time": 1593303512042, "rating": 1.0, "text": "When i meet  with them they give me all the ways they were going to do, which was good even about a trail .then later on they turn  on me. I paid them, but for what.", "pics": null, "resp": null, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "107030734900861657983", "name": "Yanan Duan", "time": 1534443178130, "rating": 5.0, "text": "Walton Law Firm was very helpful. I highly recommend them to the ones who need legal aid. They are experts in dealing with my case. I believe. Because they try their best to protect my interest. And the result is unexpectedly good. My attorney Mallory who is very nice and very familiar with law and each process in my case. She always helped me and answered each question I had. They negotiated with medical agencies, other litigant insurance company and obtained evidence. Mallory analyzed my case wisely and gave the most effective method to protect my interest. They did all they could to fright for my right. It saved me a lot of time. I could spend all time in recovery. After that, I focused on study and didn’t need to pay too much attention on my case. It is the first time I cooperate with an attorney. I was very worried in the beginning and didn’t sure if they were experienced attorney or not. Now, I am sure the anxiety is absolutely unnecessary. All I need to do is trusting them, providing material I had. That’s all. All in all, they are experienced attorneys. I never feel regret to invite them to deal with my case and very satisfied with their help.", "pics": null, "resp": {"time": 1574443258051, "text": "Thank you very much for writing such a detailed account of your experience with our firm! We are dedicated to providing the utmost highest level of service and accountability to each of our clients. Our lawyers and staff refer to our clients by name with respect for their rights as human beings, not just another case number. We are very happy to help!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "114779878040998004191", "name": "Colton Justice", "time": 1553201750561, "rating": 5.0, "text": "At Walton Law firm I didn’t have to choose between hiring a firm who’s name carries weight and influence, and having an attorney who would have the time to be invested in me and will fight for me. They have a proven track record and stellar reputation in the courts, and they also take the time to get to know their clients and absolutely go to battle for them. Highly recommend.", "pics": null, "resp": {"time": 1574442251816, "text": "Everyone here at Walton Law Firm is very appreciative of your review and the trust your put in our firm! We are committed to providing the utmost highest level of service and accountability to each of our clients."}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "116992403891875248012", "name": "Angel Johnson", "time": 1484712016270, "rating": 5.0, "text": "I absolutely love Trip and his entire staff! Everyone has always been super nice and extremely helpful. They handled EVERYTHING  for me, I can't imagine going through that life changing event without Trip &  staff by my side. I will ALWAYS keep them on speed dial. They are definitely 5 star all the way in my book!", "pics": null, "resp": {"time": 1574446185700, "text": "We will be sure Mr. Walton receives your compliments! Thank you so much for taking time out of your busy day to leave us such a great review!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "111997851126322167578", "name": "brian ross", "time": 1581743989728, "rating": 5.0, "text": "I was visiting my family in Alabama when I was suddenly stopped by a an officer for speeding. I didn't agree with the ticket as the speedfrom 55pmh to 45mph and I didn't realize it.  I initially called an attorney in Tuscaloosa that was specialized in fighting speeding tickets but he wasn't helpful. I then called Thanks Walton Law Firm and spoke with Frissee and let me tell you. She told me everything that would happen and it did swiftly. I honestly cannot thank her enough for the dedication and attentiveness all while being super professional. I would recommend anyone and I would even say that this is hands down the best firm in Alabama.  Go Walton Lawfirm!! Cheers Frissee!! :)\n\nBrian Ross\nAtlanta, GA", "pics": null, "resp": null, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "116069995061555204945", "name": "William Allanson", "time": 1489511863675, "rating": 5.0, "text": "Trip Walton and all of his legal staff are excellent! The staff handled my case professionally and kept me up to pace with what was going on, from the first consultation to the end, I knew these guys were there to fight for me. I highly recommend this law firm to anyone seeking experienced, professional legal help.", "pics": null, "resp": {"time": 1574445929381, "text": "Thank you for your amazing review William! We are pleased you are happy with the outcome of your case!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "100675466469805640990", "name": "Clint Niemeyer", "time": 1530136502554, "rating": 5.0, "text": "It's most unfortunate when anyone has a personal injury due to an accident. Fortunately, those of us who have experienced such can take comfort in knowing that Trip and his seasoned, professional staff have our backs. Thanks a million, Trip, Mallory and all the staff at Walton Law Firm for a job well done!", "pics": null, "resp": {"time": 1574443639853, "text": "We really appreciate your kind words, Clint! Happy to see you were happy with the outcome of your case and will be sure to pass on your compliments to the Walton Law Firm team!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "113562358636706947879", "name": "Rhonda Stoner", "time": 1573234766659, "rating": 5.0, "text": "Kisha Abercrombie is a talented, hardworking, and compassionate attorney. She does her job and does it well. I highly recommend The Walton Law Firm and Kisha.", "pics": null, "resp": {"time": 1574439844209, "text": "Thanks Rhonda! This means a lot! We're happy to help in any way that we can at the Walton Law Firm."}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "110705238370424822968", "name": "Jalencia Howard", "time": 1494606942042, "rating": 5.0, "text": "Walton Law handled my case very swiftly and professionally. Valerie Russell was absolutely amazing! They made sure that our line of communication was always open and kept me current with all events pertaining to my case. I couldn't be any more pleased with the outcome and the Walton Law Firm staff!!!", "pics": null, "resp": {"time": 1574445724376, "text": "Very pleased to see you were happy with your experience at Walton Law Firm! Thank you very much for taking the time to leave such a pleasant review!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "100269958288518852399", "name": "Nancy Whatley", "time": 1534510350973, "rating": 5.0, "text": "We are very pleased with the outcome of our case. The team at Walton Law Firm are so very professional and treated us like we were their only clients at the time. Praying that we never need this type service again, it is reassuring to know that Catherine, Brenda and Trip are there!", "pics": null, "resp": {"time": 1574442997783, "text": "Nancy, thank you very much for your amazing review! We will be sure to pass this feedback on to Catherine, Brenda, and Trip. So happy you are pleased with the outcome of your case!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "111478376538463304293", "name": "Shanna Holmes", "time": 1471489850966, "rating": 5.0, "text": "I would absolutely us Mrs. Catherine and Trip again if I had to. (Which I hope and pray I don't) They were very nice and caring. I want to thank them for helping me out and getting everything handled.", "pics": null, "resp": {"time": 1574446035493, "text": "Thank you so much for the feedback! Very happy to hear you had such a pleasant experience with our Firm!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "117273150380210391622", "name": "Tanya Wallace", "time": 1501168586742, "rating": 5.0, "text": "Trip Walton, of Walton Law Firm, was a life saver.  We had a situation that involved our son and Auburn University.   Trip stepped in and not only helped calm our fears, but helped us in clearing our sons name and getting him returned to full enrollment status at Auburn.  It was nice having someone local to help us navigate this case.  He was professional and  and a great listener, who allowed to me vent when needed.  Hopefully,  we will never need his services again, but it's nice knowing he's there if we need him.", "pics": null, "resp": {"time": 1574445283834, "text": "Your review means the world to everyone at Walton Law Firm, Tanya! We are committed to providing the utmost highest level of service and accountability to each of our clients. Our lawyers and staff refer to our clients by name with respect for their rights as human beings, not just another case number. We will certainly pass on your compliments to Mr. Walton!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "102171124592174386535", "name": "Sam Welch", "time": 1553718731475, "rating": 5.0, "text": "Great customer service and great results. Would highly recommend to everyone!", "pics": null, "resp": {"time": 1574441574987, "text": "Sam, thank you for your recommendation! We are happy to help and grateful for the trust you've put in the firm!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "105786643139295703964", "name": "L H", "time": 1482180516499, "rating": 5.0, "text": "Provided me with quick legal advice with professionalism and very polite.  Their number will always be in my phone for myself if need be and referrals. This is the best law firm I have ever contacted.", "pics": null, "resp": {"time": 1574446090375, "text": "We are very flattered by your five-star review! Thank you so much for the kind words!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "105864432521920408611", "name": "tim potts", "time": 1410823345877, "rating": 5.0, "text": "The very best people to have on your side when you need a lawyer. Everybody at Walton Law makes you feel like your part of the family. THE BEST!\nPosted byJimmy Howard not Tim Potts", "pics": null, "resp": null, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "101389795003110921528", "name": "Robbie Lewis", "time": 1549206124430, "rating": 5.0, "text": "Very professional business with genuine people. Provided me with the best assistance possible and more!", "pics": null, "resp": {"time": 1574442453904, "text": "Thank you so much Robbie for your feedback! Walton Law is dedicated to putting clients first and also getting results."}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "101286529942280364799", "name": "Libby Simons", "time": 1495122813269, "rating": 5.0, "text": "You must work with Trip Walton if you find yourself in need of a lawyer in Auburn and surrounding area. We used him for a relative's MIP and he and his staff were incredibly helpful, knowledgeable, responsive, and well-connected in that area. He got a great result for us and it was well worth the money spent. Can't say enough good things about him! He rocks.", "pics": null, "resp": {"time": 1574445657036, "text": "Libby, thank you very much for taking the time to leave such a positive review! We will be sure to pass on your kind words to Mr. Walton!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "107304584973150025560", "name": "Angela Wright", "time": 1536612382253, "rating": 5.0, "text": "I would recommend Walton Law Firm to EVERYONE!! They are always available to answer any questions you may have and are very sweet, loving and caring people.Thanks Walton Law Firm!", "pics": null, "resp": {"time": 1574442850821, "text": "You are very welcome! We are extremely appreciative of the feedback you've left us along with the trust you put in Walton Law Firm!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "103379220055620606941", "name": "Paula Gunn", "time": 1525878920376, "rating": 1.0, "text": "I'm a federal employee who was mauled by german shephards on the job. When this firm lost Valerie Russell, who did put a lot of effort into my case, I decided to stay with them instead of change with Valerie to her new firm. Thinking the attorneys would put as much effort as she did. Unfortunately, they did not. After being mauled on the lower part of my body, and scarred for life. I didn't receive any compensation thanks to going with this firm.", "pics": null, "resp": {"time": 1526751373059, "text": "We apologize that you feel you had a negative experience with our firm.  We have successfully represented thousands of clients, recovering over $100+ million in verdicts and settlements.  We strive to treat all of our clients like family and do everything in our power to assist them during their time of need.  Unfortunately there are situations that occur during the process of some claims that leave our hands tied, such as the other party having lack of insurance coverage or low insurance coverage amounts. We invite you to reach out to our firm at 334-321-3000 at your earliest convenience and schedule a time with Mr. Walton, who will be glad to sit down with you and further discuss the reasons our firm was unable to assist you with your claim."}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "102268353472262955145", "name": "martin", "time": 1537544277599, "rating": 5.0, "text": "I cannot say enough about the Walton Law Firm. The legal representation received and the knowledge of the staff exceeded all of my expectations. If you remember the movie \"Show Me The Money\" where McGuire placed his focus on one payer at a time, that is how I felt my case was handled at The Walton Law Firm.  Thank you ladies and gentleman!", "pics": null, "resp": {"time": 1574442726245, "text": "We appreciate your very flattering words and the trust you put in Walton Law Firm! We are so glad you are happy with the way your case was handled along with the customer service we provided. It really does mean a lot to everyone here!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "100380693923986369764", "name": "Justin Self", "time": 1507067259388, "rating": 5.0, "text": "Great Experience. I am very pleased with the speed at which everything was resolved.", "pics": null, "resp": {"time": 1574445099642, "text": "Thank you for your very positive feedback Justin! We are very grateful for your trust in Walton Law Firm to handle your legal matter. Have a great day!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "106521297830398809795", "name": "James Mecca", "time": 1489345229422, "rating": 5.0, "text": "Trip and his team are incredibly professional, always accessible and very supportive.  Most importantly, they are people you can trust to be there for you and your family when you need them most.", "pics": null, "resp": {"time": 1574446211997, "text": "Thank you so much James! Very pleased to hear you are happy with the outcome of your case!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "100052735571108998472", "name": "George Alford", "time": 1510178535316, "rating": 5.0, "text": "Quick resolve of my problem.\nGreat communication.\nHighly recommend for any legal matter.", "pics": null, "resp": {"time": 1574444868029, "text": "Very pleased to hear you had such a positive experience George!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "100176535498526046170", "name": "Bobby Thornton", "time": 1547922678804, "rating": 5.0, "text": "Very professional, courteous and compassionate. Highly recommend.", "pics": null, "resp": {"time": 1574442568574, "text": "Hi Bobby! Thank you so much for your feedback. We are grateful for the opportunity to assist. Have a great day!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "108963009364299098571", "name": "Debby Sims Hancock", "time": 1412088379642, "rating": 5.0, "text": "Trip Walton handled a family member's BIG problem after a dog attack.  He was AMAZING!  We will appreciate him forever....", "pics": null, "resp": null, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "102335976376084972245", "name": "T Trask", "time": 1490380867067, "rating": 5.0, "text": "A wonderful group of professional attorneys and staff and they are still down-to-earth.", "pics": null, "resp": {"time": 1574445747652, "text": "Thank you for your great feedback and review!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "104758346925008737064", "name": "John Doe", "time": 1498751914178, "rating": 5.0, "text": "Trip and his team are the ASOLUTE BEST ! I could never say enough good things about them.  Thank you all !!!!", "pics": null, "resp": {"time": 1574445339230, "text": "Thank you for your amazing review! We are very happy you are pleased with the service Walton Law Firm was able to provide you!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "113056934709100581604", "name": "Joshua Ruddock", "time": 1489691470848, "rating": 5.0, "text": "Very knowledgeable, fast, and friendly service. Any question was answered immediately and I felt like I was treated like family since first walking in.", "pics": null, "resp": {"time": 1574445868863, "text": "We deeply value our client relationships and are very pleased to hear you had such a positive experience with the Walton Law Firm! Thank you!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "101616325238634442157", "name": "Reilly Taylor", "time": 1514606938485, "rating": 5.0, "text": "Great law firm! Friendly People! Really Helpful!", "pics": null, "resp": {"time": 1574444054054, "text": "Thanks for your amazing feedback Reilly!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "109646709639880514346", "name": "James Cook", "time": 1564685887120, "rating": 5.0, "text": "Excellent work and great people!", "pics": null, "resp": {"time": 1574440626825, "text": "Thank you so much James for taking the time leave feedback! We are glad our team was able to ensure a great experience!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "112754377483769616251", "name": "Awakened Warior", "time": 1553202409078, "rating": 5.0, "text": "Best lawyer I could have chosen!!!", "pics": null, "resp": {"time": 1574441764362, "text": "Thank you for your positive feedback! We will definitely pass on your kind words to Mr. Walton and the team!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "107980928042457225320", "name": "Victor Xayavong", "time": 1495488976901, "rating": 5.0, "text": "My experience with Walton Law Firm exceed my expectations. The entire staff was very helpful, even if it was during after hours!!", "pics": null, "resp": {"time": 1574445472789, "text": "We are very happy to hear you had a positive experience with our team! Thank you very much for your feedback!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "105744732667991428596", "name": "dee abner", "time": 1485192750209, "rating": 5.0, "text": "Trip and his team are great and always professional!", "pics": null, "resp": {"time": 1574446112789, "text": "Thank you for your 5-star review!"}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "108549191988364476638", "name": "george williams", "time": 1518445301616, "rating": 3.0, "text": "Don't really care one way or the other", "pics": null, "resp": null, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "105832122269098705174", "name": "Jasmyn Scott", "time": 1521492044930, "rating": 1.0, "text": "Very unprofessional specifically to black women who think we are dumb!", "pics": null, "resp": {"time": 1528148964397, "text": "We apologize that you feel you had a negative experience with our firm.  We pride ourselves in ensuring that all of our clients, regardless of race, religion, sexual orientation, disability or age are treated equally.  We have successfully represented thousands of clients, recovering over $100+ million in verdicts and settlements and have successfully represented hundreds upon hundreds of clients who were charged with a crime.  We strive to treat all of our clients like family and do everything in our power to assist them during their time of need. We invite you to contact Mr. Walton at 334-321-3000 to discuss your concerns directly."}, "gmap_id": "0x888ced67cf4399e1:0xdf6b2763b49708c1"}
{"user_id": "110537725178398916730", "name": "Phillip Robb", "time": 1624654442925, "rating": 1.0, "text": "I'll finish this after I get the money he has owed me for over 2 years.  I'm in the middle of pressing criminal charges for the second time.  More to come.", "pics": null, "resp": {"time": 1624728298446, "text": "We went above and beyond for you to  get your money sent to the prison where you are housed, as you had no other way to get it. I have sent you numerous copies of those checks.  Please kindly remove this desperate attempt for attention."}, "gmap_id": "0x8889cbb8b9d7a36b:0x65733992966c4de8"}
{"user_id": "109448046774211987801", "name": "Wilbur Boothby", "time": 1618848953329, "rating": 1.0, "text": "You're better off representing yourself. They refuse to answer the phone and if they do you won't hear back. You'll show up to court and sit there for an hour and then find out the court date was continued. Bunch of crooks will steal your money for no work.", "pics": null, "resp": null, "gmap_id": "0x8889cbb8b9d7a36b:0x65733992966c4de8"}
{"user_id": "110978289858835236007", "name": "Seth Key", "time": 1628925489534, "rating": 1.0, "text": "Horrible lawyer! Would not recommend for a criminal case!", "pics": null, "resp": null, "gmap_id": "0x8889cbb8b9d7a36b:0x65733992966c4de8"}
{"user_id": "102820201190435479872", "name": "Elizabeth Hicks", "time": 1593028065794, "rating": 5.0, "text": "The staff was very professional, informative and helpful even during this crazy pandemic we are in. My attorney was super down to earth and helped me understand the fine print to everything I had questions on. I will definitely be using them again in the future!", "pics": null, "resp": null, "gmap_id": "0x8889cbb8b9d7a36b:0x65733992966c4de8"}
{"user_id": "109770937193331016584", "name": "Crystal Chaney", "time": 1603085060278, "rating": 3.0, "text": "The cullman alabama court system is not good... they're a black market baby seller system", "pics": null, "resp": null, "gmap_id": "0x8889cbb8b9d7a36b:0x65733992966c4de8"}
{"user_id": "105773582734382836229", "name": "Patrick Wiggins", "time": 1594821747044, "rating": 5.0, "text": "Was very happy with there representation. I would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889cbb8b9d7a36b:0x65733992966c4de8"}
{"user_id": "112782124057479470036", "name": "Mike Roberts", "time": 1625856348595, "rating": 1.0, "text": "Unethical  lawyer", "pics": null, "resp": null, "gmap_id": "0x8889cbb8b9d7a36b:0x65733992966c4de8"}
{"user_id": "111228579184539957614", "name": "Melanie Daugherty", "time": 1479871223731, "rating": 1.0, "text": "Josh O'Neal is the absolute worst attorney I have ever had. He refuses to return phone calls. He called me ONE TIME during my divorce, the day before the hearing. He never even bothered to send me the final divorce decree. I had no idea what my divorce papers said until his secretary emailed them to me, after the THIRD request. I know all of his secretaries because they are the only ones I could ever talk to. Half the time, they didn't return phone calls either. Halfway through the 'mediation' I got the distinct feeling that he was working for the other side. He obviously thinks he can make a living by gaining clients, screwing them over, and going on to the next victim. He must be too young and immature to grasp the concept that most people will need an attorney more than ONCE in their lifetime, and if he thinks he can be successful without the benefit of repeat clients, he is delusional. If he was the last attorney on earth, I would never hire him again. My divorce is final; I'm still missing half my belongings; he's promised me a refund twice and never delivered. On top of that, he suggested we file a contempt motion because of the fact that I was not given all the belongings I was entitled to. He didn't mention at the time that he planned on charging me an additional $1500 to do what I'd already paid him to do. In my opinion, the reason all his pictures on FB look like gangster photos is because he is a crook. He will stand there and 'listen' to you, but he is just pretending to hear you. You'd have more luck talking to a brick wall. Plus the brick wall might return your calls. I read a bad review of his, and I should have heeded it. If you need a great attorney, contact Michael Haynes.", "pics": null, "resp": null, "gmap_id": "0x8889cbb8b9d7a36b:0x65733992966c4de8"}
{"user_id": "116664221015236104156", "name": "Stephanie Smith", "time": 1462822909542, "rating": 5.0, "text": "Great guy.  Worked with me with payment, stayed late and his secretaries are wonderful.  Definitely use him in the future if I have to have a attorney (but maybe I won't have to have one)", "pics": null, "resp": null, "gmap_id": "0x8889cbb8b9d7a36b:0x65733992966c4de8"}
{"user_id": "115530293854427386774", "name": "Pedro Contreras", "time": 1574278443780, "rating": 5.0, "text": "His whole office has been awesome", "pics": null, "resp": null, "gmap_id": "0x8889cbb8b9d7a36b:0x65733992966c4de8"}
{"user_id": "112160260767988721956", "name": "Leslie Boyles", "time": 1447352802510, "rating": 2.0, "text": "He was the only attorney to work with my fiance. He closed at 5 but stayed open late because my fiance doesn't get off work and home before then. But... Didn't file paper work on time now I can't get married on my Great Grandmother s birthday. Can't get married until January. So upset.", "pics": null, "resp": null, "gmap_id": "0x8889cbb8b9d7a36b:0x65733992966c4de8"}
{"user_id": "108729865412328006835", "name": "Samuel Brooks", "time": 1473688653957, "rating": 5.0, "text": "Well I've been a client of Brock and O'Neal for a few months now and I can honestly say that they've been a great group of people. Everyone has been more than forthcoming and honest, although I kinda miss Mahan, I still feel that I've made a grand decision in choosing Brock, O'Neal, and Kilgo as my team of advocates. Thanks guys for all of your hard work this far, and I hope to continue a lasting relationship with you all...", "pics": null, "resp": null, "gmap_id": "0x8889cbb8b9d7a36b:0x65733992966c4de8"}
{"user_id": "103018146423113736244", "name": "Jennalee Cagle", "time": 1465920963797, "rating": 1.0, "text": "Terrible I would never recommend Josh O'Neal to anyone his secretary is horrible and rude he is never available to speak with and he is always out of state according to his secretary!!!! If there was a way to give him and his staff no stars I would!!!! Terrible customer service!!!! Don't waste your money he promises one thing when u consult with him then it's something totally different later!!!! You always have to talk to his secretary because he doesn't like speaking with his clients apparently he is a rip off!!!! Thanks and be blessed!!!!", "pics": null, "resp": null, "gmap_id": "0x8889cbb8b9d7a36b:0x65733992966c4de8"}
{"user_id": "115364041796789023252", "name": "Brenda Moore", "time": 1573571892425, "rating": 1.0, "text": "Handled a divorce for me.  Would not recommend.  Sorry", "pics": null, "resp": {"time": 1484947498108, "text": "Thanks Brenda! You were a joy to work with!"}, "gmap_id": "0x8889cbb8b9d7a36b:0x65733992966c4de8"}
{"user_id": "116863155458757694452", "name": "Richard Hughes", "time": 1589705041343, "rating": 5.0, "text": "Great lawyer", "pics": null, "resp": null, "gmap_id": "0x8889cbb8b9d7a36b:0x65733992966c4de8"}
{"user_id": "102104314357725731576", "name": "Kristi Lawrence", "time": 1580921808183, "rating": 3.0, "text": "Good lawyer", "pics": null, "resp": null, "gmap_id": "0x8889cbb8b9d7a36b:0x65733992966c4de8"}
{"user_id": "100223822991006352351", "name": "Sandra Wood", "time": 1614895917782, "rating": 5.0, "text": "This is hands a great law firm.  Steve Heninger and his paralegal Pamela were phenomenal from start to finish.  Steve took our complex case, and was responsive/empathic throughout the entire process.  He was able to reach a successful resolution without having to proceed with a trial.  We were very pleased with the outcome, and would not hesitate to use this firm in the future.  Would highly recommend.", "pics": null, "resp": {"time": 1615248295893, "text": "Hi Sandra, thank you for the great review. We always put our clients first, and it’s excellent to see that you had a five-star experience with us."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "117448887259587661989", "name": "Jack Simpson", "time": 1621350993699, "rating": 5.0, "text": "Eric has been working  on a case for me for awhile now. He’s always communicated with me about the case and was always looking out for my best interests. I would recommend them to anyone who’s looking for a great attorney. Thanks you sir for all you’ve done for me and always going the extra mile.", "pics": null, "resp": {"time": 1621364096973, "text": "Thank you for your review, Jack! Communication is a top priority when it comes to serving our clients at HGD."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "104068073877662004616", "name": "Jessica Shackelford", "time": 1614702477089, "rating": 5.0, "text": "Working with Nada and Jackie was a dream! They always made themselves available to answer questions. They explained things clearly to me that allowed me to make the best decision for me. They never stopped fighting for my case to ensure I received what was deserved. I can truly say they have changed my life!", "pics": null, "resp": {"time": 1614888219410, "text": "Hi Jessica, thank you for leaving us a great review! We’re here to give our clients the best representation and it’s fantastic to hear that you received top-quality legal support."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "100931808633067923799", "name": "Neal Owings", "time": 1624460239058, "rating": 5.0, "text": "Excellent Law Firm, Anna Carroll did her due diligence and exceeded my expectations. Thank you!", "pics": null, "resp": {"time": 1624460931185, "text": "Thank you for the 5-star review, Neal!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "103514086294878354306", "name": "MsBooFish", "time": 1627771472452, "rating": 5.0, "text": "Consummate and compassionate professionals! I highly recommend this firm!!", "pics": null, "resp": {"time": 1627911376679, "text": "Thank you for your kind words!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "107388512022129772614", "name": "Dustin Mccombs", "time": 1611773710890, "rating": 5.0, "text": "During my experience with Heninger Garrison Davis, I have been shown courteous, personalized, and prompt coordination in our relationship. I am never left in the dark and am always included step by step in progress and decision making along the way! They have been an excellent firm to work with!", "pics": null, "resp": {"time": 1612230062991, "text": "Hi Dustin, thank you for the great review. We always put our clients first, and it’s excellent to see that you had a five-star experience with us."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "112910142062003713756", "name": "Jonathan Lusk", "time": 1615469332047, "rating": 5.0, "text": "As a practicing attorney myself, I was well aware of this law firm's excellent reputation before I selected them to handle a lawsuit on behalf of my family. The firm lived up to its reputation and more.  Attorneys Tim Davis and Mark Ekonen handled our case. They both worked tirelessly all the way through to a successful settlement. My family and I could not be more pleased with their legal expertise and consummate professionalism. Moving forward, I will refer clients to Heninger Garrison Davis without reservation. Take it from an attorney who knows the difference between average and superior legal representation -- if you have been wronged and need a top flight law firm in your corner to achieve the best possible result, contact Heninger Garrison Davis.", "pics": null, "resp": {"time": 1615471606817, "text": "Thank you so much for your kind words, Jonathan! It means so much coming from a fellow member of the legal community. All the best to you and your family!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "108263681152454855991", "name": "Jacklyn Stegman", "time": 1614369530401, "rating": 5.0, "text": "After our bad accident (a semi truck merged into us at 65mph) myself and my mother-in-law were referred to Heninger Garrison Davis as the people who could help us the best. Let me tell you, they were right. The people we worked closest with were Mark,  Eric, and Beverly, and they are all so friendly and helpful.\n\nEven considering that I moved to a different timezone shortly after the accident, I still felt that I was able to easily communicate with them about any questions or concerns I was having (they respond with most efficiency to email in my experience).\n\nDuring negotiations with the other party (which lets face it, thats the part all of us care about the most) I was shocked by how willing this practice was to work with us and help us obtain the settlement we needed to finally put this ugly event behind us. While I sincerly hope that I am never in another situation that would call for it, I would happily use this law firm again and/or refer them to any friend or family member in need of legal representation.", "pics": null, "resp": {"time": 1614815223284, "text": "Hi Jacklyn, thank you for leaving us a great review. We’re here to give our clients the best representation and it’s fantastic to hear that you received top-quality legal support."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "103328392431722193625", "name": "Lisa Jones", "time": 1607621476590, "rating": 5.0, "text": "I truly had a pleasant experience working with Anna. This was a very sensitive matter for me & my first legal issue. Anna came highly recommended to me, and I would recommend her to someone else. I really appreciate you representing me.", "pics": null, "resp": {"time": 1611161443872, "text": "Thank you for your recommendation, Lisa! We are lucky to have clients like you and want to do everything we can to support you and get the outcome you deserve!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "100202754459755523423", "name": "Kam Pugh", "time": 1616170997721, "rating": 5.0, "text": "Erik persevered and kept me updated through a process where an insurance company tried to draw things out as long as possible. I would highly recommend Erik and his team to anyone who has a need in this area.", "pics": null, "resp": {"time": 1616185702960, "text": "Thank you for your review, Kam! Communication is a top priority when it comes to serving our clients at HGD."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "109858388818703864714", "name": "Matt Sato", "time": 1611761673606, "rating": 5.0, "text": "Unfortunately we had an accident where my wife was injured in a car accident and we needed to seek representation.  The process is already stressful and difficult but Brandy Robertson and her team at Heninger Garrison Davis, LLC provided knowledgeable and excellent service that brought acceptable resolution to our case.  Especially during the current COVID environment and with the courts being backed up it was great to see this Firm adapt to the current situation and get our case settled.", "pics": null, "resp": {"time": 1612230107811, "text": "Hi Matt, thank you for leaving us a great review! We’re here to give our clients the best representation and we are honored to have been able to work with you and your family."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "112005915573678205669", "name": "Cassie Gilbert", "time": 1611780890408, "rating": 5.0, "text": "Mr. Leonard is a very kind and  caring person. He has handled everything quickly and professionally.", "pics": null, "resp": {"time": 1612230040171, "text": "Hello, Cassie – thank you for the great review! We will pass along your kind words to Mr. Leonard as well."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "109618002338938492867", "name": "Brian Kinsley", "time": 1603217498179, "rating": 5.0, "text": "Henninger Garrison Davis is a great firm that works hard for their clients.  They are leaders in the legal community and results driven. I have worked on projects with them for years and enjoy collaborating with them.", "pics": null, "resp": {"time": 1603397732071, "text": "Thank you so much, Brian. We enjoy collaborating with you as well!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "100135860165502881183", "name": "Jeannie Nabers", "time": 1615241875739, "rating": 5.0, "text": "For anyone in need of professional, caring advice or representation, I highly recommend Heninger Garrison Davis, LLC.", "pics": null, "resp": {"time": 1615248269478, "text": "Thank you for leaving us a five-star review, Jeannie. Having you as a client has been a pleasure!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "109827643183457029276", "name": "Melissa Williams", "time": 1603392002144, "rating": 5.0, "text": "Ive had a great experience with them and I will be working with them in the near future for other cases if needed..", "pics": null, "resp": {"time": 1603397677166, "text": "Thank you for the kind words, Melissa. We are here for you if you ever need us."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "111836952100666997166", "name": "susan belcher", "time": 1589478689421, "rating": 5.0, "text": "I would highly recommend this firm. They are a very experienced, ethical, professional team which provided me with excellent legal advice for a complex issue. Thank you Beverly and Erik!", "pics": null, "resp": {"time": 1589502970482, "text": "Thanks, Susan. Great clients lead to great results!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "118124565530071795128", "name": "Megan Miller", "time": 1613176897165, "rating": 5.0, "text": "Knowledgeable, professional and thorough attorneys and staff", "pics": null, "resp": {"time": 1614045764895, "text": "Thank you for the thoughtful review, Megan!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "115769008729721991113", "name": "Laura Coe", "time": 1572910601807, "rating": 4.0, "text": "My husband and I are in the midst of a class action, medical device failure, we believe the manufacturer of the product is liable for his 15 year, ongoing medical battle with the device. Even though we have not met face to face with the attorneys,  HGD has always been quick to return phone calls, answer our call, the first time, not after days and days of leaving voicemails. Our contacts are busy doing all the leg work, representing other clients in court, etc. They are professional, keep you informed, and answer your questions quickly and honestly to the best of their ability. Sometimes the answers aren't what you want to hear, but sometimes the truth hurts. Their experience , willingness to work ethically as a team shows! I plan on writing another review down the line as our case proceeds through the judicial system.", "pics": null, "resp": {"time": 1572915821542, "text": "Thank you so much for your kind words, Laura! We really appreciate you taking time to share your experience with us! We are so glad that your needs are being met by our team and that we are keeping you updated on your case. We count ourselves lucky for clients like you and your husband! Please feel free to reach out to anyone on our team at any time should you need our assistance! Thanks again"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "117813000061196327661", "name": "colette Jones", "time": 1565891295396, "rating": 5.0, "text": "This is a highly reputable firm with highly knowledgeable attorneys. The staff are warm and caring. Highly recommend!", "pics": null, "resp": {"time": 1565891590285, "text": "Thank you for the great review! We are here to help you anytime."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "116724168243060263378", "name": "Stephen Orr", "time": 1617988559066, "rating": 1.0, "text": "Grossly misled, ignored and overcharged!", "pics": null, "resp": {"time": 1617993523719, "text": "Dear Stephen,\n\nThank you for taking time to post a review for us. We are sorry to hear that your experience was not what you expected. We set a high standard for ourselves and we’re so sorry to hear this was not met in your interaction with our business. We do pride ourselves on our clear communication and full disclosure of all fees at the beginning of any client relationship. For that reason, we would like the opportunity to talk with you and investigate your feedback further. Please feel free to reach out to me directly at 205-327-9121 at your convenience so we may discuss how to possibly resolve your issues. Thanks again.\n\nT. Gauldin – Firm Admin"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "103367730960486795057", "name": "Linda Bond", "time": 1578765196010, "rating": 5.0, "text": "I recommend this attorney, he works hard for his client’s best interest.", "pics": null, "resp": {"time": 1580337074375, "text": "Thank you for your recommendation! We are lucky to have clients like you and want to do everything we can to support you and get the outcome you deserve!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "113802985391468570626", "name": "Bill Freise", "time": 1572975913938, "rating": 5.0, "text": "Bill Bross is the greatest. I have never dealt with any one who is more helpful professional or caring I recommend them 110 pct", "pics": null, "resp": {"time": 1572982930898, "text": "Thank you for the great review, Bill! We could not agree with you more about Bill Bross. He is the best of the best! We are also very thankful for great clients like you! Thank you for putting your trust in us and we look forward to our continued partnership with you!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "114487378074814080881", "name": "Mark Phillips", "time": 1584291222506, "rating": 5.0, "text": "I can't say it would be a conflict of interest. Just kidding these guys are very professional and there's a whole team of them there they get it done thanks guys", "pics": null, "resp": {"time": 1589502994161, "text": "Thanks so much Mark! We appreciate working with people like you!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "114007062462287616139", "name": "John Smith", "time": 1619300763618, "rating": 5.0, "text": "Great people", "pics": null, "resp": {"time": 1619442704008, "text": "Thank you, John! It is always a pleasure helping clients."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "108516747051589409617", "name": "Bentley Schoening", "time": 1539708503403, "rating": 5.0, "text": "We have worked with HGD for many years. They are a very reputable firm with exceptional attorneys and staff. Highly recommended!", "pics": null, "resp": {"time": 1565891651641, "text": "Thank you for the kind review, Bentley. We have enjoyed our partnership with you as well."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "112544730905252623315", "name": "Kewanee Fox", "time": 1558353981216, "rating": 5.0, "text": "Nice office.", "pics": null, "resp": {"time": 1565891623846, "text": "Thank you for taking time to review our firm! We hope to see you soon."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "116909536351440176650", "name": "Bobbie Payne", "time": 1497800149532, "rating": 5.0, "text": "They are great lawyers", "pics": null, "resp": {"time": 1536772384282, "text": "Thank you for the kind words!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "117128860924810163421", "name": "Charlie Waits", "time": 1510714499937, "rating": 5.0, "text": "A great, hardworking attorney.  She will put her heart into your case.", "pics": null, "resp": null, "gmap_id": "0x88886115b1857135:0xe03bfdd1b6fbfd80"}
{"user_id": "113700804003794353243", "name": "Kenneth Thompson", "time": 1570636133579, "rating": 1.0, "text": "I have called often and it all ways go to mail box which is always full", "pics": null, "resp": null, "gmap_id": "0x88886115b1857135:0xe03bfdd1b6fbfd80"}
{"user_id": "107602358775656767981", "name": "Grace Thompson", "time": 1560316947986, "rating": 3.0, "text": "Very cluttered and unorganized office. She seemed okay, though I was there signing divorce papers she was still civil .", "pics": null, "resp": null, "gmap_id": "0x88886115b1857135:0xe03bfdd1b6fbfd80"}
{"user_id": "114296087113986739272", "name": "Tonja Strickland", "time": 1566974962684, "rating": 5.0, "text": "Michele Pate put 100% into her cases ❤️", "pics": null, "resp": null, "gmap_id": "0x88886115b1857135:0xe03bfdd1b6fbfd80"}
{"user_id": "112843506374949578587", "name": "Jenn Little", "time": 1577127039632, "rating": 5.0, "text": "Puts her all in her cases 100 percent", "pics": null, "resp": null, "gmap_id": "0x88886115b1857135:0xe03bfdd1b6fbfd80"}
{"user_id": "106218255529532069754", "name": "barry kennedy", "time": 1610321846961, "rating": 5.0, "text": "Great team of professionals.  Used their services several times over the past 28 years.", "pics": null, "resp": null, "gmap_id": "0x8861d62d04b64ee9:0x6bb7bc14d9eb8c9a"}
{"user_id": "116160218251854017635", "name": "jose rosales", "time": 1597201014976, "rating": 5.0, "text": "Always get the help I need, I recommend David and Sheila for just about any real estate matter", "pics": null, "resp": null, "gmap_id": "0x8861d62d04b64ee9:0x6bb7bc14d9eb8c9a"}
{"user_id": "110719852565858864470", "name": "Anita Massey", "time": 1470612441356, "rating": 5.0, "text": "J.David Dodd has been exceedingly helpful with handling various things for my mother after my dad's death! He is a true Southern gentleman and high in the customer service area! I would highly recommend him for all your legal needs!\nI grew up in Fort Payne, but have been living in Florida most of my adult life and it is a reminder, dealing with Mr. Dodd , how great it is to live in a southern town with caring professionals! J. David Dodd is the best!", "pics": null, "resp": null, "gmap_id": "0x8861d62d04b64ee9:0x6bb7bc14d9eb8c9a"}
{"user_id": "107545608487785060955", "name": "Ana Wood", "time": 1552611230614, "rating": 5.0, "text": "I am going to be new in town and I have been so fortunate to of found a truly amazing and knowledgeable attorney for our business!!!", "pics": null, "resp": null, "gmap_id": "0x8861d62d04b64ee9:0x6bb7bc14d9eb8c9a"}
{"user_id": "112605432090379663099", "name": "Brenda Keller", "time": 1527471441342, "rating": 5.0, "text": "David Dodd did fantastic job in helping David an I update our will.  Answered all our questions an helped with advice.", "pics": null, "resp": null, "gmap_id": "0x8861d62d04b64ee9:0x6bb7bc14d9eb8c9a"}
{"user_id": "110650320383304217041", "name": "Krystal Price", "time": 1550454751007, "rating": 5.0, "text": "Eric is great, takes time to actually listen and helps with anything you need.", "pics": null, "resp": null, "gmap_id": "0x8861d62d04b64ee9:0x6bb7bc14d9eb8c9a"}
{"user_id": "114919635659067086678", "name": "Mariam Hunt", "time": 1549761515156, "rating": 5.0, "text": "Great law firm sweet and understanding people to help you with what you need done!!!  =^..^=", "pics": null, "resp": null, "gmap_id": "0x8861d62d04b64ee9:0x6bb7bc14d9eb8c9a"}
{"user_id": "115290191340818024427", "name": "Darlene Williams", "time": 1603741936220, "rating": 5.0, "text": "Great attorneys", "pics": null, "resp": null, "gmap_id": "0x8861d62d04b64ee9:0x6bb7bc14d9eb8c9a"}
{"user_id": "105579928871643007194", "name": "Ruthie Perry", "time": 1610225038036, "rating": 5.0, "text": "I have used Attorney Sandra Lewis and Highly recommend her services.  Thanks again!!", "pics": null, "resp": null, "gmap_id": "0x888e81785c93e01b:0x47c0b8e6eb01e68b"}
{"user_id": "103190638756576678575", "name": "K PA", "time": 1583332668549, "rating": 5.0, "text": "Sandra's some kinda awesome!!!!", "pics": null, "resp": null, "gmap_id": "0x888e81785c93e01b:0x47c0b8e6eb01e68b"}
{"user_id": "107124037624911481680", "name": "Bear Grylls", "time": 1612154296779, "rating": 5.0, "text": "When your lawyers walk out on you, remember \"better phone Schoen\"", "pics": null, "resp": null, "gmap_id": "0x888e81dadca25c31:0x2b26e2e119a96768"}
{"user_id": "104751145870846063343", "name": "Yanika Leavigne", "time": 1619797708700, "rating": 5.0, "text": "My Testimony:\nFirst I want to give thanks to the Almighty God for being with me every step of my struggle and I realize that it's God's timing not man. Second I would love to give praises to Dansby law firm who was more than helpful in helping me get approved for my disability after all of my struggles. I would and will recommend them to any and everyone that needs loyal people on your side to help with your case(s). Thank you Mrs.Dansby for being there for me .", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "116353339847443355080", "name": "Michael Sanders", "time": 1610837863805, "rating": 5.0, "text": "GREAT LAW FIRM AND GLAD I CHOSE KAY DANSBY (MRS. DANSBY) TO REPRESENT ME AND MY CASE. Her people are very nice and polite when I do have to call in to give information to them or ask about my case. THANK YOU FOR EVERYTHING DANSBY LAW FIRM", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "102415429775049251420", "name": "Bettina Stoutmire McGhee", "time": 1625774405419, "rating": 4.0, "text": "Was on and out...no wait", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "107675947667968981466", "name": "cheryl thomas", "time": 1568393764479, "rating": 5.0, "text": "I love Kay! Both she & her office staff are extremely helpful, professional & kind! Kay was absolutely instrumental in assisting me to obtain my disability benefits. For that, I am most appreciative!!", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "107049190770020630773", "name": "Rachel Moore", "time": 1599764923955, "rating": 5.0, "text": "They handle everything so professional. They also understand and help you get through obstacles and maintain while getting your disability.", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "114707572134481229348", "name": "Christopher Harris", "time": 1594135125050, "rating": 2.0, "text": "Would not use again. Did not seem to put the time in. Lots of facts not brought up. No office vists, just the first one to sign the dotted line. Not any communication till two weeks before hearing. I could be wrong.", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "108483890381772024751", "name": "C Moore", "time": 1581623467804, "rating": 1.0, "text": "Sold us a dream! Did not follow through with any of the plan a’s b’s or c’s . Left us high and dry after she told us she would be there every step of the way! And DIDN'T EVEN HAVE THE DECENCY TO CALL US!! Sent us a letter in the mail saying she WOULD NOT represent us! No reason why no recommendation to somewhere else or nothing. Tried to call and WOULD NOT take my calls! VERY UNPROFESSIONAL CATY! I WILL NEVER IN MY LIFE RECOMMEND ANYONE GO HERE INLESS YOU DON’T MIND BEING LET DOWN AND DISAPPOINTED! IF I COULD GIVE NO STARS THATS WHAT MY TRUE REVIEW WOULD HAVE BEEN", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "106984062764152963666", "name": "Shenine Ellis", "time": 1604233172469, "rating": 5.0, "text": "Love Kay dansby", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "112721334183770271440", "name": "Michael McCreedy", "time": 1570545598593, "rating": 5.0, "text": "Excellent work - they are very good at what they do. They helped me get my Socialist Security Disability in a short time.", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "115482287157589032764", "name": "cwf fraley", "time": 1609989720811, "rating": 5.0, "text": "Caring & personable", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "101801253334632017283", "name": "Robert Ammons", "time": 1575399189383, "rating": 5.0, "text": "Very caring law firm.", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "110992982501323856005", "name": "Betty Smith", "time": 1524650467743, "rating": 5.0, "text": "She's an awesome attorney. Very down to earth person.", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "111064167798728965730", "name": "nita easterling", "time": 1557924499144, "rating": 1.0, "text": "I got nothning from her in court she just sit there .in her own little world I would  not reccomend  her if your applying  for disability", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "112201223190027576818", "name": "Arvilla Rothe", "time": 1547059985427, "rating": 5.0, "text": "Office staff are friendly, and knowledgeable. They know the laws for what you are hiring them for.", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "109464849746855803514", "name": "Amanda Ritchie", "time": 1579230070569, "rating": 2.0, "text": "Haven't heard back from them yet. Over a week ago,,,", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "102984453435206257798", "name": "Jessica Jenkins", "time": 1513404505962, "rating": 5.0, "text": "Good people away nice attitudes and welling to help me understand my case.", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "109811474597904244202", "name": "Kim Wood", "time": 1506519178392, "rating": 5.0, "text": "Very nice staff and they answer all of your questions.", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "116467667698994205442", "name": "Reggie Richardson", "time": 1574800066380, "rating": 1.0, "text": "The worst Law Firm In Montgomery period If you need a secretary then they are for you if you need a lawyer anybody but them", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "117542108768939322457", "name": "Conita Henderson", "time": 1494530087243, "rating": 4.0, "text": "My SSI lawyer now. Doing well so far.", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "118392222239409275691", "name": "Brandon Hester", "time": 1562708826153, "rating": 5.0, "text": "She is Awesome at What She Does", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "105363874152591031520", "name": "Tasha Boswell", "time": 1554148815101, "rating": 5.0, "text": "The best lawyer ever!", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "106860308004527833404", "name": "Vernon Hunter", "time": 1544847370971, "rating": 5.0, "text": "Worked very hard for me. We won!", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "105564009453924436986", "name": "James Wells", "time": 1479708556352, "rating": 5.0, "text": "People are very helpful.", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "115302641511290778030", "name": "Mike McWhorter", "time": 1565667878587, "rating": 5.0, "text": "ABSOLUTELY AWESOME", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "113857012380872538076", "name": "John Moore", "time": 1477139942798, "rating": 1.0, "text": "Did not prepare me for my hearing .", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "114669400281501923000", "name": "Tammy Kelley", "time": 1534366388320, "rating": 5.0, "text": "Helped me get my Disability", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "114647178502866014886", "name": "jonathan carswell", "time": 1572649872355, "rating": 5.0, "text": "Very professional", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "111271990725819338359", "name": "Alexis Buford", "time": 1499973196683, "rating": 5.0, "text": "Excellent", "pics": null, "resp": null, "gmap_id": "0x888c2a455f2fc819:0x42bca72c3249ac66"}
{"user_id": "117840667174589689855", "name": "Coco Ashley", "time": 1615938839322, "rating": 5.0, "text": "They are exceptional. They communicate with you and seem to really appreciate their clients. And let me stress how amazing they are at communication. They make sure to check in on you and let you know exactly what is happening in your case. They take their time walking you through the entire process and answering any questions. I'm so glad I called The Virtus Law Group.", "pics": null, "resp": null, "gmap_id": "0x88891b00f304696f:0x119c1d676f9a34f6"}
{"user_id": "116016507462597715327", "name": "Jacqueline Jones", "time": 1619837695009, "rating": 5.0, "text": "Ray Foushee and his team surpassed all of my expectations. They provided me with excellent customer service during the entire litigation process. As a result, I received the settlement that I deserved. Thanks again for everything!", "pics": null, "resp": null, "gmap_id": "0x88891b00f304696f:0x119c1d676f9a34f6"}
{"user_id": "100536236894800480280", "name": "Michael Foushee", "time": 1614280147552, "rating": 5.0, "text": "Really pleased with the speed and professionalism of the attorneys Virtus. They handled my situation quickly and were very helpful throughout the process. I will be a long term client and highly recommend to everyone!", "pics": null, "resp": null, "gmap_id": "0x88891b00f304696f:0x119c1d676f9a34f6"}
{"user_id": "100082322702214376918", "name": "AK Hughston", "time": 1613059785437, "rating": 5.0, "text": "Can't say enough good things about Jeremy & Ray!! They helped me in the past and now helping me with the legal part of starting a company. They are the best! Very professional & personable. They really take the time to get to know their clients and go the extra mile to help them. Highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x88891b00f304696f:0x119c1d676f9a34f6"}
{"user_id": "100558894547502750977", "name": "Megan Gohn", "time": 1609558912863, "rating": 5.0, "text": "The guys are great! Always professional, and very helpful with my case! I was always in the know and kept up to date!", "pics": null, "resp": null, "gmap_id": "0x88891b00f304696f:0x119c1d676f9a34f6"}
{"user_id": "106263678031790136130", "name": "Caroline Courington", "time": 1608668358528, "rating": 5.0, "text": "Phenomenal group of people to work with. They are so responsive when you have questions! I’d recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x88891b00f304696f:0x119c1d676f9a34f6"}
{"user_id": "100384701900817108189", "name": "Jillian Lewis", "time": 1604960349256, "rating": 5.0, "text": "I had an excellent experience with the Attorneys at this firm. They are kind and professional. They also seemed to really care about my case. I am recommending them to my friends and family.", "pics": null, "resp": null, "gmap_id": "0x88891b00f304696f:0x119c1d676f9a34f6"}
{"user_id": "106878505279234330480", "name": "Gabriel Marrero", "time": 1604959125835, "rating": 5.0, "text": "Best Law office in the city. Passionate about their clients, fair and reasonably priced. Wouldn't work with anyone else in the magic city.", "pics": null, "resp": null, "gmap_id": "0x88891b00f304696f:0x119c1d676f9a34f6"}
{"user_id": "102206262868873356951", "name": "Dianne StJohn", "time": 1604086465517, "rating": 5.0, "text": "Me and my husband were hit by a drunk driver . David Jeremy went above and beyond and took care of us . I recommend this group to anyone who is looking for a good lawyer .", "pics": null, "resp": {"time": 1604330453533, "text": "Thank you for letting us handle your legal issue."}, "gmap_id": "0x88891b00f304696f:0x119c1d676f9a34f6"}
{"user_id": "116230113856624791597", "name": "Isabel Medina", "time": 1612504312917, "rating": 5.0, "text": "Jeremy Schatz is a very knowledgeable and kind lawyer.", "pics": null, "resp": null, "gmap_id": "0x88891b00f304696f:0x119c1d676f9a34f6"}
{"user_id": "106859240133247551054", "name": "Luis Murcia", "time": 1604959729361, "rating": 5.0, "text": "Jeremy and Ray are both exceptional lawyers. I call them for all my legal needs!", "pics": null, "resp": null, "gmap_id": "0x88891b00f304696f:0x119c1d676f9a34f6"}
{"user_id": "114229670656224367304", "name": "Philicia Stapleton", "time": 1603899859045, "rating": 5.0, "text": "Virtus Law Group is a great firm. I would recommend them to my family and my friends!", "pics": null, "resp": null, "gmap_id": "0x88891b00f304696f:0x119c1d676f9a34f6"}
{"user_id": "100042839445411503325", "name": "Rene' Morgan (Gallentgaming)", "time": 1591300819706, "rating": 5.0, "text": "Mr. Ford and his entire staff were more than just my attorneys, they became friends during my Workers Comp case. They treated me with the utmost respect. My case was settled in a timely manner and in my best interest. I would recommend this firm to anyone in need. And a special thanks to Laura for always being a listener when I needed it. 🙏", "pics": null, "resp": null, "gmap_id": "0x8888a80796190aff:0xc2ec75e1fb0e3274"}
{"user_id": "116740579728628313047", "name": "Audie Barger", "time": 1593040076868, "rating": 5.0, "text": "Mr Ford served as my attorney in a workman's comp case and provided excellent representation. He was thorough and extremely competent in my case. I have no doubt that had he not been representing me things wouldn't have gone as well for me as they did. I can't recommend him highly enough.", "pics": null, "resp": null, "gmap_id": "0x8888a80796190aff:0xc2ec75e1fb0e3274"}
{"user_id": "113291670851382703049", "name": "Jeff Peitsch", "time": 1621620171154, "rating": 5.0, "text": "Very friendly, great attorney.", "pics": null, "resp": null, "gmap_id": "0x8888a80796190aff:0xc2ec75e1fb0e3274"}
{"user_id": "103388552876896167751", "name": "Debbie Lockhart", "time": 1594135101020, "rating": 5.0, "text": "I highly recommend Mr. Steve Ford, and his entire staff! They handled my workers comp case, with care and compassion! Very informative, and always returned my calls!", "pics": null, "resp": null, "gmap_id": "0x8888a80796190aff:0xc2ec75e1fb0e3274"}
{"user_id": "113706181856762899093", "name": "Donna Dailey", "time": 1593724349749, "rating": 5.0, "text": "Mr. Ford and his staff are very professional. We were very satisfied with the settlement we received on my husband's Workmans Comp case. Mr. Ford worked very hard for us and always returned my calls. He always explained the process in terms that we could understand. I highly recommend Mr. Ford if you need legal representation. I don't know of anyone with more experience in Workmans Comp cases.", "pics": null, "resp": null, "gmap_id": "0x8888a80796190aff:0xc2ec75e1fb0e3274"}
{"user_id": "103013060633082259100", "name": "Kim Taylor", "time": 1595646020756, "rating": 5.0, "text": "My husband has used Mr. Ford and he is very thorough and took time to explain things. Highly recommend his services.", "pics": null, "resp": null, "gmap_id": "0x8888a80796190aff:0xc2ec75e1fb0e3274"}
{"user_id": "101318382926414647625", "name": "Joe Pearce", "time": 1593090996206, "rating": 5.0, "text": "I had a on the job injury and Mr Ford took my case. Everyone I had any contact with at this firm were very caring and courteous. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x8888a80796190aff:0xc2ec75e1fb0e3274"}
{"user_id": "101721353867521623129", "name": "Doug Jones", "time": 1592860215436, "rating": 5.0, "text": "Mr. Ford and his entire staff are GREAT.  Great communication and kept me will informed throughout the entire process.  Would strongly recommend for your workman comp. case.", "pics": null, "resp": null, "gmap_id": "0x8888a80796190aff:0xc2ec75e1fb0e3274"}
{"user_id": "100456308166577908602", "name": "mike parker", "time": 1596638410796, "rating": 5.0, "text": "Got more than I exspected and and handled everything in a professional matter very happy with the out come", "pics": null, "resp": null, "gmap_id": "0x8888a80796190aff:0xc2ec75e1fb0e3274"}
{"user_id": "116137985860540028922", "name": "Justin Beams", "time": 1591300238896, "rating": 5.0, "text": "Mr. Ford was great with handling my case, he and his staff were very professional and responded quickly with any questions I had.  The location is very nice as well.", "pics": null, "resp": null, "gmap_id": "0x8888a80796190aff:0xc2ec75e1fb0e3274"}
{"user_id": "115643539030322382064", "name": "Pamela Cantrell", "time": 1592835799014, "rating": 5.0, "text": "My husband suffered an on the job injury and after having three knee surgeries he continued to have major issues with his knee--and of course W/C told us he was to return to work.  We didn't know where to turn so I ask a long time friend, also an attorney, for advice.  Upon his advice we made an appointment with Mr. Steve Ford and during our initial meeting with Mr. Ford, the steps, process and time frame of how my husbands claim would develop was fully explained.  Mr. Ford, Kee Spree, Laura and Collene will have you fully prepared and will answer any questions you may have along the way.  My husband and I were extremely pleased with every aspect of working with Mr. Ford and his staff.  I highly recommend Mr. Ford and Kee Spree, both did an outstanding job!", "pics": null, "resp": null, "gmap_id": "0x8888a80796190aff:0xc2ec75e1fb0e3274"}
{"user_id": "106558247523434620100", "name": "Deb Fowler", "time": 1593108661165, "rating": 5.0, "text": "Very professional and courteous staff. Mr.\nFord is the best In the business for Workmen’s Compensation.", "pics": null, "resp": null, "gmap_id": "0x8888a80796190aff:0xc2ec75e1fb0e3274"}
{"user_id": "108665113139290623895", "name": "Lawrence Hall", "time": 1593725352078, "rating": 5.0, "text": "Mr. Ford assisted my daughter with a Workman's Comp case. She was having a difficult time having the company she worked for pay for an injury that occurred while she was at work. After meeting with Mr. Ford and his staff, he thought he could help and decided to represent my daughter. After Mr. Ford spoke with the Workman's Comp Insurance company, the company decided to pay my daughter's medical expense. Once the situation was settled, Mr. Ford stated that he didn't have a lot of time invested and gave me a very reasonable billing. I have been extremely please with the way he and his staff assisted my family with my daughter's problem.", "pics": null, "resp": null, "gmap_id": "0x8888a80796190aff:0xc2ec75e1fb0e3274"}
{"user_id": "110965429652679258941", "name": "randy mccool", "time": 1593031864522, "rating": 5.0, "text": "Steve Ford And his staff where very precessional and respectful to me. I would recommend them to any one.", "pics": null, "resp": null, "gmap_id": "0x8888a80796190aff:0xc2ec75e1fb0e3274"}
{"user_id": "106816396734449417501", "name": "sam myrick", "time": 1598591573036, "rating": 5.0, "text": "Mr. Ford is a professional straight forward  guy. He listens to you and and asks questions to help you with your situation\nYou're  not just a client its more personal\nI have retained him in the past and I have retained him again,  I would recommend him to anyone needing an attorney to assist with work comp\nThe building is modern and they have  high tech check in system but it was a little difficult finding with my gps, parking is limited and the spaces are tight, I have a smaller SUV and still had trouble getting out of the car", "pics": null, "resp": null, "gmap_id": "0x8888a80796190aff:0xc2ec75e1fb0e3274"}
{"user_id": "114574987722602307430", "name": "Nettie Williams", "time": 1596743655740, "rating": 5.0, "text": "Very friendly and always there for me.  Good people.", "pics": null, "resp": null, "gmap_id": "0x8888a80796190aff:0xc2ec75e1fb0e3274"}
{"user_id": "109292682666878518250", "name": "Jennifer Coleman", "time": 1576584822636, "rating": 5.0, "text": "Its a law firm but its in a Plaza beautiful place they had a lot of shops over there we can go in and eat and just browse around but like I said it's a law firm that I was looking for but the inside of that building  was nice very secure and updated", "pics": null, "resp": null, "gmap_id": "0x8888a80796190aff:0xc2ec75e1fb0e3274"}
{"user_id": "103422428790889277584", "name": "David McMullan", "time": 1623780564470, "rating": 5.0, "text": "I highly recommend Leslie Palmer and Palmer Law, LLC. She is extremely knowledgeable and the consummate professional. Leslie was very easy to work with and was an outstanding advocate for my interests. Excellent communication and she kept me well informed throughout the process. I will definitely use Palmer Law again and will recommend Leslie to all my friends. The value for services provided was excellent.", "pics": null, "resp": null, "gmap_id": "0x88891bbe67370c5f:0x2569ef2970bf0e05"}
{"user_id": "106698333494008360820", "name": "Allen Arnold", "time": 1593182597040, "rating": 5.0, "text": "Leslie Palmer is a colleague of mine and we have worked together on previous cases.  I am more than pleased to recommend her to help you with your case.", "pics": null, "resp": null, "gmap_id": "0x88891bbe67370c5f:0x2569ef2970bf0e05"}
{"user_id": "110457107942069985860", "name": "Carol Collins", "time": 1574295571580, "rating": 5.0, "text": "Leslie is great!  She is straightforward, honest, knowledgeable and offers great advice.  I would definitely recommend her if you need help with employment issues.  She'll have your back.", "pics": null, "resp": null, "gmap_id": "0x88891bbe67370c5f:0x2569ef2970bf0e05"}
{"user_id": "117327789665040858843", "name": "Kelli Newman", "time": 1542697540400, "rating": 5.0, "text": "Leslie was very understanding and made me feel comfortable to confide in with my issue. She made the process of my lawsuit overall easy and never pressured me to where I always felt comfortable talking to her and I am glad I chose her to represent my case. Hopefully not, but if I do need her assistance in the future theirs no doubt I will be contacting her and will recommend her to anyone that may need her to get them justice! Very sweet lady but could be a ball of fire if she needed to be and that's one of the things I loved about her- she knows her stuff if ya know what I mean!!", "pics": null, "resp": null, "gmap_id": "0x88891bbe67370c5f:0x2569ef2970bf0e05"}
{"user_id": "112938554059144632339", "name": "Rachael Fowler", "time": 1540490441115, "rating": 5.0, "text": "Leslie was very personable & professional. Very organized & prompt. She got more done in 2 months than was accomplished in the past 10 using other representation. I would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88891bbe67370c5f:0x2569ef2970bf0e05"}
{"user_id": "110782393249970586642", "name": "Brittiany Smith", "time": 1541106761903, "rating": 5.0, "text": "Very nice! And puts her work in to help! Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x88891bbe67370c5f:0x2569ef2970bf0e05"}
{"user_id": "108901203439918446905", "name": "Clay Doten", "time": 1436307511976, "rating": 5.0, "text": "I could not have been more pleased with the discretion and courtesy of Ms. Palmer when she helped a family member with a disability claim. She really went above and beyond. I'm eternally grateful.", "pics": null, "resp": null, "gmap_id": "0x88891bbe67370c5f:0x2569ef2970bf0e05"}
{"user_id": "103785521152696144158", "name": "patrick yeatts", "time": 1436362803207, "rating": 5.0, "text": "Leslie is a skilled employment law attorney. She can assist anyone whose dignity and rights have been violated in the workplace.", "pics": null, "resp": null, "gmap_id": "0x88891bbe67370c5f:0x2569ef2970bf0e05"}
{"user_id": "103370171029155604273", "name": "Kareem McNeal", "time": 1627620767453, "rating": 5.0, "text": "First of all, I can't thank Heather Leonard enough for representing me concerning a serious matter.  She was so professional, thoughtful, caring and hard working on my case.  I could not have had better representation.  I would highly recommend her for anyone that needs representation regarding discrimination  issues in the workplace.", "pics": null, "resp": null, "gmap_id": "0x88892275ceaf6fb3:0x7b1df3061b14954f"}
{"user_id": "116591767391018907917", "name": "Glenda Taylor", "time": 1626440751853, "rating": 5.0, "text": "Heather is a very knowledgeable employment law attorney who works diligently for her clients and does not stop until there is a resolution.  She is kind, intelligent and a hard worker. I highly recommend Heather for your employment law issues.", "pics": null, "resp": null, "gmap_id": "0x88892275ceaf6fb3:0x7b1df3061b14954f"}
{"user_id": "106698333494008360820", "name": "Allen Arnold", "time": 1623081906010, "rating": 5.0, "text": "Heather Leonard is one of the most respected employment law attorneys in the State of Alabama.  She is passionate about pursing her client's claims and one of the most knowledgeable and conscientious attorneys' I know.", "pics": null, "resp": null, "gmap_id": "0x88892275ceaf6fb3:0x7b1df3061b14954f"}
{"user_id": "110655717319314538695", "name": "Ken Thomas", "time": 1606915061747, "rating": 5.0, "text": "If you haven't been down this path before you will be filled with questions.  With Heather, she is very responsive and takes time to answer your phone calls, emails and questions.  Her emphasis in her response is to educate you as to what she is doing and why.  She was always prepared for every meeting that we had but also made sure that I was fully prepared.  Her confidence, experience and knowledge are reflected in everything that she does and allowed me to be very appreciative of her representation.", "pics": null, "resp": null, "gmap_id": "0x88892275ceaf6fb3:0x7b1df3061b14954f"}
{"user_id": "106522503992420325190", "name": "Edward Thomas", "time": 1480434961578, "rating": 5.0, "text": "On a mission to satisfy her clients", "pics": null, "resp": null, "gmap_id": "0x88892275ceaf6fb3:0x7b1df3061b14954f"}
{"user_id": "115755996092392989683", "name": "Kenneth Wallace", "time": 1623698931695, "rating": 4.0, "text": "Pretty well organized the lawyers seems very helpful the receptionist was very helpful and nice", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "103514265552640542213", "name": "Bobby earhart", "time": 1623107223084, "rating": 5.0, "text": "ONE OF THE BEST LAW FIRMS IN ALABAMA!", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "100432544266529477784", "name": "Jose Rodriguez", "time": 1621896694960, "rating": 4.0, "text": "They really do get everything in order and help u threw anything you give them what you got and they do the rest", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "101711220989435912831", "name": "Geneva Burton", "time": 1551572891921, "rating": 1.0, "text": "I visited this law firm with the intention of establishing a Will, Power of Attorney and an Advanced Health Care Directive.  When I initially set up my appointment I was uninformed of how the process worked as well as what items I could include. Unfortunately, when I left the appointment I was still uninformed about how the process work and the items I could include.  The appointment lasted approximately 15 minutes. I felt as if I was ushered in and out of Mr. Pettey's office in an effort to move on to someone or something more important.  Afterward, I choose not to continue with their services and received a bill in the amount of $375 for services rendered for a DRAFT of a Will, Power of Attorney, and Advanced Health Care Directive. Will not be recommending this firm to any of my friends.", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "106456949975824239912", "name": "Emory Daniel", "time": 1530314760666, "rating": 5.0, "text": "Very helpful and I highly recommend them. If in need of an attorney at least give they a try before you make the decision.", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "106562742900986380804", "name": "Tim Chambliss", "time": 1490906723137, "rating": 5.0, "text": "Everyone at Samford & Denson are exceptional. Quick, concise and experienced. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "115510910853009528258", "name": "Sarah Meloy", "time": 1473420164947, "rating": 5.0, "text": "We had a wonderful experience with the team at Samford and Denson, LLP, specifically Jennifer Chambliss and Donna Kilcrease. It was a comfort to have Mrs. Chambliss by our side on some of the most important days of our lives. She always made sure to cover all bases and kept a level head on all issues. She is very much an honest and straightforward attorney who always took the high road to ensure our best interest in every situation. Jennifer Chambliss is highly recommended by our family.", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "103326764959457889556", "name": "billy chapman", "time": 1502079914767, "rating": 5.0, "text": "Dedicated lawyers, worth every penny!!!", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "117896164704881325164", "name": "August West", "time": 1617740829427, "rating": 5.0, "text": "Kind, courteous, and personable. We chose Tyler mainly because he didn't strike us as a greedy con-man like most injury attorneys. All of our correspondence was done with Tyler personally and I think that speaks volumes. Since our accident we haven't worried about making any doctors appointments, medical bills, or anything else; all we focused on was getting well and I believe that is a major factor in recovery. The worry and stress of those things were taken care of by Tyler and his team and when it was all said and done we felt like we really mattered. Although the insurance company of the at-fault driver was only liable for a set amount of money, Mr. Mann still made sure that we were compensated enough to matter. I would recommend this council to anyone, anytime. Great people to have on your side!", "pics": null, "resp": {"time": 1617747179732, "text": "Thank you so much!"}, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "100576068848794016774", "name": "Vanessa Tucker", "time": 1611361713123, "rating": 5.0, "text": "I was in a horrible wreck that wasn't my fault and I was recommended to go with Tyler Mann.  Tyler was understanding, hands on, professional, sympathetic,  and honest the ENTIRE time!  He did not set unrealistic expectations.   He was in communication with me the whole time.  He was so knowledgeable.   I'm very grateful and would recommend this Law Firm to anyone who needs help with their case.  Tyler Mann is a man of good character, and integrity.   God bless his firm.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "107920752323623363254", "name": "DonDiva D", "time": 1622575350830, "rating": 5.0, "text": "They have been very patient and good to me. I recommend them to anyone who is looking for a great lawyer.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "103643950435080344082", "name": "Dee Mack", "time": 1614272161172, "rating": 5.0, "text": "Mr. Mann is the ultimate professional and will do right by you. Very upfront and keeps you updated and in the loop throughout the entire process. I would definitely recommend him or ask for his services if ever needed again.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "115452502151806528496", "name": "Crystal Hardeman", "time": 1615913917930, "rating": 5.0, "text": "I was very skeptical of getting an “on tv” lawyer. But Tyler Mann totally changed my opinion. He is the first one to call you when you request info. He is very thorough. He listens and genuinely cares. Would definitely recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "111866434999574784923", "name": "Dawanna Rouse", "time": 1609608034184, "rating": 5.0, "text": "I was in a tragic wreck that was not my fault . I was hospitalized for a week before being operated on and it was a long road from there. I was not able to walk for 11 months and I still have trouble walking but thanks to God and family I  am taking it day by day. Mr Mann was very professional, caring, respectful and always responded in such a quick way himself.... he explained things so I could understand and he was the best choice I could have made. He had MY best interest at heart and in mind 100% of the time . I will recommend Mr Mann , and reach out again If  I need. Thank you very much Mr Mann and Staff...", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "105358820838728664828", "name": "Holly 83", "time": 1608755405653, "rating": 5.0, "text": "Tyler Mann did exceptional for my dad, all he needed was the info from the incident, and he went right to work. He called if he needed more information, filled us in on the status every time we contacted him. Very nice people all around.. He got my dad back a very descent amount. Very pleased with his representation.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "108031174581383247379", "name": "Quentin Smith", "time": 1615227564137, "rating": 5.0, "text": "This law firm works hard to ensure their clients are represented with full faith of them. Best in Huntsville.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "104679340003233695163", "name": "Megan Lyles", "time": 1599765303835, "rating": 5.0, "text": "Wonderful! Had someone drive to Sheffield to discuss the case with me after being hurt in a wreck and Tyler and his group took care of it all! Got a nice chunk of change as well as all of the hospital bills taken care of. Lauren will help with any questions and Tyler calls you himself to give updates. 10/10 recommend!", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "105162972006281712393", "name": "Allison Johnson", "time": 1593095208776, "rating": 5.0, "text": "First time having to acquire a lawyer for anything, and Tyler was great!  Always kept me up to date on the process and was very good at explaining it all to me. Highly recommend Tyler!  He’s an all around great guy  and a pleasure to work with!", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "113273147063712416294", "name": "Sabrina Holderfield", "time": 1593124874000, "rating": 5.0, "text": "Would highly recommend him! We was having no luck with the other people’s insurance company so we contacted him and he was able to get everything settled in a very great timely manner! We was very happy with the experience!  Thank you Mr. Mann!!", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "112439838046711606641", "name": "Marcia A Lawson", "time": 1579090567296, "rating": 5.0, "text": "After my car accident, I kept seeing Tyler Mann commercials more often & I figured he was talking to me. From the minute I called, Tyler & Lauren took care of my every need until the end. They answered my questions & returned calls/emails within minutes. This is my first experience with having to obtain an attorney for anything & it was a fantastic experience in the midst of a storm. Thank you both so much for EVERYTHING!! I recommend you to anyone who's had an unfortunate injury. You guys are the BEST!! Thanks again!!", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "104724000379433655826", "name": "MrGoldshua", "time": 1581613703712, "rating": 5.0, "text": "There are few attorneys that are as down to earth and easy to talk to as Tyler Mann. His staff is courteous and always willing to keep you informed about your case. He is professional and intelligent without ever talking over your head. I recommend him to my family, friends, and anyone else needing help with their injury case and I’ll certainly use his services again if the unfortunate event ever arises!", "pics": null, "resp": {"time": 1581617840583, "text": "Thanks, Shay!!"}, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "103926769180133776419", "name": "Renae Miller", "time": 1590074178530, "rating": 5.0, "text": "When I first signed up things went really fast I was interviewed with in 2 days I was kept up-to-date as things progressed and then he won my case, it was over within 2 months, definitely the man for the job! I highly recommend Tyler Mann. Though not a million dollar case, he made me feel important", "pics": null, "resp": {"time": 1590078000269, "text": "It was a pleasure working for you, Ms. Miller!"}, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "105864865030521882547", "name": "Kay Raybon", "time": 1605320987124, "rating": 5.0, "text": "He did exactly what he needed to do and was straight to the point but always professional! Kept it 💯!", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "116687863234021322346", "name": "Nicole Granville", "time": 1585151501261, "rating": 5.0, "text": "Tyler Mann and his staff were great! From day one, they were very attentive and concerned with my needs for the case. They answered every question I had and was able to provide great advice when I needed it. I would definitely recommend them.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "107312379369656911973", "name": "Helen Lewter", "time": 1594577150402, "rating": 5.0, "text": "Tyler communicates with you and cares which takes away stress.  He and his office staff is friendly and very professional. I highly recommend the Tyler Mann Law Firm.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "117401047838334079260", "name": "glenda McCoy", "time": 1591840772014, "rating": 5.0, "text": "Tyler Mann is just wonderful to have on my side , he was so professional and all I had to do was keep my dr's appointments and get rest and he did all the rest . He and Lauren are both super wonderful and a pleasure to have on my side when need be . I would recommend him to anyone who needed a great lawyer .\nThanks Tyler and Lauren for the work you did for me , you are both just wonderful..", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "117277036740927301366", "name": "Kevin Posavec", "time": 1577919507835, "rating": 5.0, "text": "Tyler and his staff worked very hard to get me the monies I was owed. They were always professional and yet family friendly. Always willing to answer any questions if I needed to call them. I highly, HIGHLY  recommend them if you run into a situation where you need their help.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "111596686226404694228", "name": "Vanessa Holder", "time": 1589914832892, "rating": 5.0, "text": "I recommend Tyler Mann Injury Law because Tyler is very professional and works hard to get great results. I felt as if I mattered and wasn’t just another number. I am very happy with the outcome and Thanks Tyler for making a bad situation turn out favorable for me and my daughter.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "117875401269938525741", "name": "Amber Stiles", "time": 1573088397893, "rating": 5.0, "text": "Tyler represented me several years ago when he worked for a high profile, local clown after I was passed around the office, stalled, and mislead by the large, robotic staff. Much to my relief, Tyler's personable nature and strong efforts were instant indications he truly cared for those he represented and their circumstances and had their best interest at heart. I was very satsified with Tyler's representation and recommend him to all. Glad you made it out of that place, Tyler!", "pics": null, "resp": {"time": 1573092096602, "text": "Thanks so much, Amber!"}, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "116440225520436756029", "name": "Cheyenne Dolan", "time": 1573659060029, "rating": 5.0, "text": "Tyler Mann is a wonderful person all around. He actually cares about his clients and do the very best to do everything in his power to help make the case easy on you. He is the best lawyer by far.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "110841237845729945103", "name": "Matthew Roberts", "time": 1564498042516, "rating": 5.0, "text": "Tyler was fantastic. He helped me when I desperately needed it. He answered any questions I had and was always polite and respectful, and very prompt at getting everything taken care of. I'll always be grateful to him for his help. Thank you Tyler!", "pics": null, "resp": {"time": 1564498866231, "text": "You’re the man, Matthew! Thanks!"}, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "118379779903738423548", "name": "Jeremy Shelton", "time": 1573952418342, "rating": 5.0, "text": "If there was an attorney to represent  every down to earth, humble people, Tyler Mann is it. Simply, the best experience from a bad situation period. Worthy of every handshake, 5 star reviews, all I can say is, Man up with Tyler Mann! Take a 5 star rating times 1 billion, and it's still not enough to thank Mr. Mann!!! Awesome! Never get a group of average guys to take your case, get a superstar Mann to deliver the score\n\nIt's been 2 years since being represented, and it's unforgettable still. Knowing that a personal injury lawyer, was actually personal, plus exceeds time waiting beyond belief. Lifetime memories can be made by children, women, and Tyler Mann. This is no promo, just thinks he deserves to be the top choice anytime. Thanks Tyler, Your the Mann", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "100060886068102355907", "name": "Gay Hawkins", "time": 1480546060188, "rating": 5.0, "text": "Tyler is a warm, kind, caring person with an abundance of knowledge of both sides of Personal Injury Law, having been an Insurance Adjuster.\nHe was so very pleasant and easy to work with.  He handled every bit of the Personal Injury aspect of my settlement so that I did not have to deal with it at all.  I feel he worked diligently and received the maximum amount from the Insurance company.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "111347922971074432311", "name": "Regina Smith", "time": 1587512050764, "rating": 5.0, "text": "Exceptional communication within a timely response. Friendly and courteous staff.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "117730326731321354295", "name": "Hans King", "time": 1470067835102, "rating": 5.0, "text": "Tyler's analytical ability and years of experience enable him to provide thoughtful, thorough, and most importantly, practical legal advice. He has an amazing ability to reduce complex issues into simple concepts. I know my family can depend on Tyler as our lawyer, and would recommend him to everyone!", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "109927433113527977639", "name": "Lance Duke", "time": 1608586124673, "rating": 5.0, "text": "Its amazing and they are very professional", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "104322275134403537819", "name": "Jenica Burrows", "time": 1562260587371, "rating": 5.0, "text": "Tyler Mann was fantastic from the first phone call to the settlement. Getting in a car wreck is never a great experience but he helped make the process so much easier and gave me much peace of mind so I could work on healing from my injuries. I would recommend him to anyone and will definately call him if I find myself injured in another car accident.", "pics": null, "resp": {"time": 1562261595259, "text": "Thank you SO much! Happy 4th!!"}, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "106690624359664431307", "name": "Sandy Clements", "time": 1557852104628, "rating": 5.0, "text": "Tyler is very personable , Professional, he took care of my case very easily and quickly. I highly recommend him. You will not regret hiring him to take care of your situation.", "pics": null, "resp": {"time": 1557864597239, "text": "Thanks so much, Sandy!!"}, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "100665771216997798519", "name": "Brandy Dumas-Harris", "time": 1517350835579, "rating": 5.0, "text": "I was searching for a lawyer for my wreck. I visited the website,  I entered my info into the contact form. I got a call back within 5 minutes. Which surprised me since it was Saturday. I gave the rep my info. by the end of the call she connected me to Tyler Mann. I spoke with him, he was very nice. He arranged to have someone come to me to sign paper work. My experience so far is excellent! I would recommend Mr. Mann.\nMr Mann is a very nice man. He handled my case the the up-most satisfaction. He is a very caring man. He never makes more than his clients ( I can verify this), which is more than can be said about most attorneys. Thank you Mr. Mann for all your hard work on my case!", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "102482964787474950976", "name": "Tommy Vercetti", "time": 1553605555256, "rating": 1.0, "text": "This is what I call a back office lawyer.\n\nAttorneys like this are only looking to send a letter possibly make a phone call and get you some compensation they don’t like seeing the inside of a court room they don’t like pursuing cases that are potentially difficult they are only looking for the quick money.\n\nThey take 30-60% of the settlement amount for simply writing a letter demanding compensation.\n\nThere is nothing wrong with taking a fee there is nothing wrong with sending a letter demanding compensation.\n\nThe problem lies in the fact that the attorney is not interested in pursuing your case far enough to get real compensation.\n\nAttorneys like the set back in their offices on their computer and phones all day but rarely make it to the courtroom.\n\nThis is why they’re not charging fees when they Are not able to provide you with favorable results reason being is because they don’t have much invested they don’t have a lot of time invested they don’t have anything material wise invested other than maybe a sheet of paper in an envelope.", "pics": null, "resp": {"time": 1553607232945, "text": "We have no record of ever representing a Thomas Vercetti. We believe this review to be fraudulent.\n\nIn any event, our goal is to provide the absolute highest level of legal representation. We are committed to our clients’ cases and are willing to do whatever is necessary to obtain justice.\n\nReviews like this one are not only inaccurate, but they do a disservice to our staff who work diligently in service to our clients."}, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "104093456292483548121", "name": "Kaella Abney", "time": 1525871594900, "rating": 5.0, "text": "I was injured in a car wreck and wanted to make sure that my medical bills were covered. I did some searching for an attorney and selected Tyler because of his prior experience in the insurance field. Tyler and his staff kept me posted every step of the way, and I dealt with Tyler himself several times. I really appreciated this, because I know with several larger law offices, I might have met my actual attorney once, if that. He's so nice, and seems to genuinely care about his clients. I highly recommend Tyler Mann.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "113507661403176550166", "name": "Teresa Harris", "time": 1542665601741, "rating": 5.0, "text": "Very nice. Answered all questions. He knows his stuff. And his staff is awesome too. A co worker recommended him and I am glad I chose Tyler Mann.\nThanks very much.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "108473022893509810226", "name": "Gladys Strong", "time": 1542245442835, "rating": 5.0, "text": "I highly recommend Mr. Tyler Mann! My husband and I were looking for someone who is both trustworthy, well-rounded, and knowledgeable Mr.Mann was the right decision. He uses prior experience from working with a big insurance company to help his clients. Thank you again! - G.S.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "111941627516863671562", "name": "Karen Starkey", "time": 1549073209308, "rating": 2.0, "text": "I spoke to Mr Mann briefly on my lunch and he said he could help me. He called me the next day and ask if I had any questions.  I wanted to think through everything and told him he would be the attorney I used.  A few weeks later I tried calling him to schedule a meeting to discuss my case. I have called twice and left messages and he never returned my calls.  Also sent an email and still have not heard from him.  Very disappointed.", "pics": null, "resp": {"time": 1549079529900, "text": "We strive to return all messages and emails by end of business on the day they are received. If you feel we have not responded accordingly, please dial 256-400-4000 and ask to speak to me personally."}, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "106759163216007233170", "name": "Zach Varcoe", "time": 1569588785360, "rating": 5.0, "text": "Seems like a nice guy he helped my stepmother a while back and didnt waste time giving me the resources I needed for finding a specialist for my case.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "103752675899146310587", "name": "Kim Fletcher", "time": 1544564552944, "rating": 5.0, "text": "Tyler Mann was so helpful to my husband and I after our accident.  Very professional, returned all phone calls promptly and worked very hard to get us reimbursed for all our medical bills.  I would recommend his services to anyone who is looking for assistance.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "103505048520209032768", "name": "Lionel Holguin", "time": 1556053301056, "rating": 5.0, "text": "Tyler is very professional and cares about his clients. He kept me informed and presented options for each move he made concerning my case. I would recommend him to anyone seeking relief from expenses due to an accident.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "110533697143346400438", "name": "Larry Robertson", "time": 1539190939642, "rating": 5.0, "text": "I would like to sincerely thank Mr. Mann for his courtesy,  professionalism, patience, and performance.  He exceeded expectations for my wife and I in the compensation received.  We are extremely pleased and would recommend Mr. Mann to anyone in need of his services; you will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "110701513138471028440", "name": "po", "time": 1569004030311, "rating": 5.0, "text": "I highly recommend tyler mann. Someone recommended i used him and im so glad i did. He gets things done!", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "104106455082307150966", "name": "Brittney Mayes", "time": 1469736253681, "rating": 5.0, "text": "Tyler Mann provided exceptional legal services. When I spoke to him about the circumstances of my injury, he was able to outline clearly the best way to achieve a just result that would compensate me for the harm I suffered. Moreover, he was prompt in returning my calls and kept me updated on my case’s progress. Not only is he knowledgeable and skilled in his profession, but he is also compassionate and personable. At no time did I doubt that he had my best interests in mind. His services exceeded my expectations and I would recommend him without hesitation.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "104725736963139057404", "name": "dino Squad 333", "time": 1572453892134, "rating": 5.0, "text": "Great and would reccommened to,anyone looking for a down to earth , easy to talk to , fight for the injured ppl lawyer .", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "109289437755940659573", "name": "Cheryl Scogin", "time": 1572833790455, "rating": 5.0, "text": "He answered my question directly and was very informative.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "110473662932037674379", "name": "kathy himmelberg", "time": 1555423654588, "rating": 5.0, "text": "Tyler Mann takes a personal approach with each case to maximize the result! I was extremely happy with my outcome-I highly recommend if you are in auto accident in Huntsville!", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "117115248844559917034", "name": "Peggy Palmer", "time": 1571945669939, "rating": 5.0, "text": "Tyler Mann was the essence of professionalism  and expediency! So thankful he was there for me and with me throughout a tough time!", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "115950940212129254150", "name": "Amal White", "time": 1535742039519, "rating": 1.0, "text": "As soon as our case got hard he ran as fast as he could . Left us with lots of questions. So we went to a lawyer with years of experience and we are happy now.", "pics": null, "resp": {"time": 1536025452744, "text": "I take all reviews, both good and bad, seriously.  I have no record of \"Amal White\" as a client.  However, we strive to provide quality legal advice and excellent customer service. There are times when we choose to withdraw from cases for various reasons.  Legal opinions are not an exact science.  I sincerely hope you find the answers you are looking for.  If you should have additional questions, or wish to discuss this matter further, please feel free to contact the office."}, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "105893749725260116356", "name": "Jeremiah Marshall", "time": 1564497683014, "rating": 5.0, "text": "Tyler and his staff were easy to work with ! They treated me like family and made sure I was taken care of in all aspects. Thanks for the hard work !", "pics": null, "resp": {"time": 1564498844027, "text": "Thank you, Mr. Marshall! Our pleasure!"}, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "118435149541418416492", "name": "Andrew zipperer", "time": 1504210484992, "rating": 5.0, "text": "I was neglected with my first lawyer, and called Tyler. I explained to him my situation and without hesitation he took my case. Tyler has been honest and respectful with me and I would recommend him to anyone who is looking for a Lawyer who is looking out for you and your wellbeing....", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "114586255890815936354", "name": "Jeff Hastings", "time": 1508425318196, "rating": 5.0, "text": "Very professional, great attorney to work with, handled my case very quickly. I highly recommend Tyler Mann. If I am ever in need of an attorney in the future I will definitely give his office a call.", "pics": null, "resp": {"time": 1508470912265, "text": "Thanks, Jeff! It was my pleasure!"}, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "111588972799680444460", "name": "Sean Blasingame", "time": 1540727933403, "rating": 5.0, "text": "Best personal injury lawyer in the state. Hope you or a loved one is never hurt but if you have to sue an insurance company, this is your guy in Alabama. Tyler used to work as an insurance adjuster (i believe thats the official title) which means his paperwork is always the way the insurance company wants it when it is submitted. Therefore his claims will prob be put on top of the stack compared to other attorneys. It was in my case. Me personally, i was hurt in a car accident on I-65 and was worried i couldnt pay the medical bills. After having 2 sprained ankles and other various injuries(none too serious, thankfully) i ended up in a financial bind and needed the case settled quickly. He had my case settled and doubled the money i received in my hand in just 3 weeks compared to when i broke my back with another injury attorney that took over 2 years. Not only does he do a great job, he seems to genuinely be a good person and will help you all he can (his secretary, too!). Lastly, Tyler doesnt seem worried at all about taking your case to trial if he needs to. This attorney will not just try to settle your case and then pass you off to other attorneys if your case isnt an easy \"cut and dry\" claim which is VERY common in personal injury cases. I personally believe he will do a better job than ANY other injury lawyer for you because he did just that for me and he is still helping my father who was in the wreck with me but hurt worse.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "106247414302369228123", "name": "Naomi Stewart", "time": 1565025190666, "rating": 5.0, "text": "He helped me with some questions I had, after a car accident. Very nice man.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "102590343648812051908", "name": "Marcy Lawson", "time": 1542839912277, "rating": 1.0, "text": "OKAY FOLKS DONT CALL THIS ATTORNEY HE WILL SELL YOU OUT IHE WAS RECOMMENDED TO ME LIKE A DUMMY I CALLED HIM AND WAS GOING TO GIVE IT A SHOT BUT THEN 2 WEEKS LATER HE CALLED AND BASCILLY LEFT ME HANGING HE BELIEVED THE OTHER PERSON OVER ME I ASK TO SEE THE VIDOE AND KROGER WOULD NOT RELEASE IT THATS MR MANN SO CALLED WORDS PLUS HE TOLD ME THAT HE WOULD NOT PURSUE WITH MY CASE  SO I FOUND A BETTER LAWYER THATS TAKING MY CASE AND I WAS TOLD TO WATCH OUT FOR ATTORNEYS ADVERTISING ON TV THAT THEY ARE ALL CROOKS!!!!!!!! PLEASE DONT CALL MR MANN HE WILL WANT 33% if it don’t go to court and over 40% if it goes to court LOL HES A CON THANKS!!!!!", "pics": null, "resp": {"time": 1542897211140, "text": "I review every case thoroughly, and unfortunately, sometimes I have to give clients bad news. I’m always honest with clients about the potential for success. This case was reviewed, and the decision was made not to continue to pursue it. No fee was charged to this potential client, and no fee is ever charged unless a recovery is made on a client’s behalf."}, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "107479979374405359356", "name": "Lori Watts", "time": 1543545679288, "rating": 5.0, "text": "The entire team was very professional. Highly recommended!", "pics": null, "resp": {"time": 1543547110671, "text": "Thanks, Lori!! Our pleasure!"}, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "110591475844572649798", "name": "Michelle Bazzell", "time": 1544039065373, "rating": 5.0, "text": "So easy to work with and exceeded my expectations ! Definitely 5 stars !", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "110048299456472093744", "name": "Pamela Hewlett", "time": 1572188328460, "rating": 4.0, "text": "He is very concerned about getting you the right treatment and the most compensation and really listened to me.", "pics": null, "resp": {"time": 1572192190712, "text": "Thank you, Ms. Hewlett! We strive to provide 5-star service, and any feedback you can give on how we could’ve earned that fifth star would be appreciated!"}, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "116716013198704583029", "name": "Shelia Johnson", "time": 1494272192200, "rating": 5.0, "text": "I found him to be very helpful and professional.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "115507325317626683584", "name": "Annette Hartline", "time": 1520397930113, "rating": 5.0, "text": "THANKS SO MUCH,  love Y'ALL.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "101002440241752264086", "name": "Hickman Taylor", "time": 1552482726147, "rating": 5.0, "text": "Great lawyer", "pics": null, "resp": {"time": 1552483885058, "text": "Thanks, Mr. Taylor!"}, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "110969471856852517505", "name": "Doug Lamon", "time": 1628574021098, "rating": 1.0, "text": "Doesn't live up to his commercial.", "pics": null, "resp": {"time": 1628594915849, "text": "Mr. Lamon is not and was not a client of ours. He called my office regarding a matter, and grew upset when I told him it was not something we could assist him with. Unfortunately, we can not accept every case we are contacted about. We certainly wish him the best of luck, but I feel this review does not reflect the level of service we provide to our clients in our daily practice."}, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "116927813478306399435", "name": "Hunter Garnett", "time": 1628604586772, "rating": 5.0, "text": "I've worked dozens of cases with Tyler. I highly recommend him to anyone who is considering an injury lawyer in northern Alabama.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "106054164180426208486", "name": "Trevor Scott", "time": 1628611967167, "rating": 5.0, "text": "For the number of times I have worked with Tyler Mann Injury Law, this firm has always been very professional, responsive, and easy to work with.  It's no wonder his clients love him, which proves his reputation in not only Huntsville, but all of Alabama.\n\nHe treats clients like family. He treats his city like family.\n\n5 stars, across the board.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "102943358687426082256", "name": "Jacob Brent Colglazier", "time": 1628621431251, "rating": 5.0, "text": "Tyler is a very detail-oriented professional!  He is someone who is genuinely caring for your well-being.  I highly recommend Tyler Mann Injury Law LLC.  He gets above a 5 ⭐️ rating from me!", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x4218ed631d7b5121"}
{"user_id": "115857068599771293284", "name": "Michelle Lewis", "time": 1627690041574, "rating": 5.0, "text": "I highly recommend Agricola Law!! Mallory Harper represented me. Everyone is friendly. Mallory had our best interests at heart. Very responsive. I felt like I've known her for years. Me & my son's are blessed that we had a very positive experience. Felt like a huge weight was lifted & I could finally breathe after almost 20 years. I will definitely come back for future needs. Thank you so much Mallory Harper!!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "117641724555698014451", "name": "Alex Hernandez", "time": 1622941861551, "rating": 5.0, "text": "Where to even start. I came to Agricola Law in desperate need. Being accused of a crime takes an enormous toll on the soul. Not knowing anything about the legal system I knew I needed representation. Agricola Law welcomed me with open arms and the speech that I needed. Making sure that I knew what was to come and how to handle the pressure. For it was a rigorous process, but rest assured Barbi, Al, Matt and all of the staff were there every step of the way on the path to proving my innocence. I can’t thank them enough for everything they have done.\n\nTo the future client that is reading this review.\nThe Agricola Law firm will take care of you. They will help you prove your innocence. You’re hiring some of the best lawyers in the country right now. Isn’t it convenient that they are based, right in your side of the southeast? So give the heavy hitters at the Agricola Law Firm a call and trust that they will be the champion boxer you want in your corner when fighting to seek justice.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "113424333440319907768", "name": "Wendy Parrish", "time": 1625865557225, "rating": 5.0, "text": "Al and Barbara are fantastic. They listen to what you have to say and lead you in the right direction. They're both extremely competent and have a no-bs attitude. Exactly what I was looking for when I needed an attorney. If the need arises, I will go back to them. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "101606146376474340010", "name": "Emily Harper", "time": 1616460483331, "rating": 5.0, "text": "Barbi was extremely responsive and patient with me. The office atmosphere was extremely comfortable and the staff went above and beyond making sure I felt at home. I was kept informed about my case every step of the way. I have dealt with some other law firms in the area and can say with absolute certainty, Agricola Law is one of, if not the best, firm in East Al / West Ga.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "110239549131800563267", "name": "Stephanie Brewer", "time": 1617145059073, "rating": 5.0, "text": "Barbi and Matt were beyond amazing! They were so patient and so caring. They never seemed bothered by my repetitive emails and phone calls! They were always so willing to listen to what I had to say. I’d never been in this position before and their patience with me was impeccable. To say they went above and beyond for me would be putting it lightly! They will support you all the way until the end! They advocated for me and my children and the outcome was exactly what we wanted and more. Thank you Agricola Law! 5 stars could never be enough!!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "112807336884638730462", "name": "Steve Miller", "time": 1627308616642, "rating": 5.0, "text": "They are very good at listening to your situation and helping you move forward towards a finalization of the problem.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "111393294854610961438", "name": "Erica Windham", "time": 1616461626585, "rating": 5.0, "text": "I highly recommend Barbie and her firm. Agricola Law is professional, responsive, and cares about their clients. You aren't just another case at this firm. They prioritize and care about you. Don't waste your time or money on any other lawyers. This is the best firm in the area.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "101750502149329225450", "name": "Kayla Bennett", "time": 1613332891664, "rating": 5.0, "text": "I highly recommend Barbie she was the best and very professional. I had been going through a custody battle with my son for 7 years prior to getting Agricola law firm to help me and she was on it and meant business and won my case and my son is where he should be. All the staff at Agricola Law Firm are Amazing and will keep you informed on everything they do in your case. They were worth every dime!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "113054684845119935497", "name": "Crystal Rodriguez", "time": 1613697639949, "rating": 5.0, "text": "I would definitely give more stars if possible!!!!! Barbi along with her firm is the most dedicated hardworking  law firm i have ever used . She will fight for what’s right and will not back down ! This law firm’s  dedication is something you don’t find Easily. Great and caring staff ! I never felt left out of anything, she always kept me in the loop with everything and made sure my voice was heard ! If you are looking for a amazing lawyer who treats you more like family then look no further! This law firm is a amazing !!!!!!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "104474314515943971325", "name": "Theresa Horton", "time": 1616524585442, "rating": 5.0, "text": "Barbi and Mallory handled a legal matter for me and they could not have been more perfect. They kept me up to date on everything with my case. Most importantly, they made me feel comfortable in a vulnerable situation.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "102402718972354620495", "name": "Marie Owens", "time": 1607382402979, "rating": 5.0, "text": "My husband and I have used Barbi for two different cases and she was AMAZING! Always responded to email or phone calls right away. Always reassured me everything was going to work out and be okay. I would recommend Barbi to anyone that has any legal need. If you want the best give her a call. Both of our cases came out with a positive and great resolution at the end.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "118001869491507388862", "name": "Carmen Cantrell", "time": 1612929176576, "rating": 5.0, "text": "Barbi is one of the best attorneys I know! She is smart, professional, responsive, and she fights for her clients! She knows the law and she knows how to win in the courtroom. You cannot go wrong hiring Barbi to represent you.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "116240189877820911758", "name": "Taylor Stone", "time": 1612898613066, "rating": 5.0, "text": "Working with the staff at Agricola Law was a breath of fresh air. I felt like they put my needs first and had great attention to detail with my case. I would happily recommend them to any future client.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "115121807158216180695", "name": "Daniel Horowitz", "time": 1612900302823, "rating": 5.0, "text": "I truly could not imagine trusting my personal affairs to any other firm in the country.  I had such a positive experience with Agricola and they helped me navigate a complicated legal matter as I came out virtually unscathed.  I could not have been more impressed with their professionalism and service, particularly that of Mr Matt Holdren who was a saving grace throughout such a tumultuous process. 5 stars well earned", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "102951032259894929863", "name": "Trudi Hawke", "time": 1601502247027, "rating": 5.0, "text": "I have level of gratitude for the team at Agricola Law that cannot be adequately expressed in words. Barbi has such an in-depth knowledge of family law that she couples that with a strong persistence and unbelievable stamina for the negations that are required when navigating a divorce agreement. I was always confident of her concern for the best interests of my children and appreciated her compassion and counsel through the process.  To know that she was not only my lawyer but my advocate is priceless!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "107206411559771358866", "name": "Casey Earnest", "time": 1602417037555, "rating": 5.0, "text": "Barbi was very patient with me, always answered my questions and gave me objective counsel I knew I could trust.  She has been of great service when I've desperately needed her expertise. Barbi is an impeccable attorney that sincerely cares about her clients and always made me feel at ease! HIGHLY recommend!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "106301271635036766365", "name": "Brandon Esco", "time": 1601582667348, "rating": 5.0, "text": "I strongly recommend Barbi Agricola and her team at Agricola Law for all of your legal needs. Barbi has the upmost integrity, intelligence, and full knowledge of the law.  She uses all of these characteristics with great passion and professionalism no matter what type case you have.  I would put her up against any attorney in the area.  I mean it, she's STRONG!!   I have consulted with Barbi on several legal questions that I have had the past few years and most recently with a divorce.  Her sharp instincts and ability to stay focused on what matters most is hands down the best around.  Barbi was always extremely responsive to my questions, was able to explain to me the options I had, give me a realistic idea of what to expect, and develop an overall strategy.  I could tell that she was well respected based on the interaction with the judge and other attorney's.  Because of her, I received the best possible outcome with my case.  I was extremely satisfied with her work and will definitely use Barbi and her staff again if the need should arise.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "106957826888079665513", "name": "Parker Edwards", "time": 1612900105788, "rating": 5.0, "text": "Agricola Law was extremely helpful and thoughtful with all of my needs last year. I worked extensively with Matthew Holdren and found him to be a delight in an otherwise stressful circumstance. 5 stars!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "117143191179917426657", "name": "Keyana Comer", "time": 1609901874979, "rating": 4.0, "text": "From the consultation at the very beginning I appreciated that Barbara was very upfront. Unfortunately, I was unable to experience her best work because the judge would not let us speak. I may have liked a bit more assertiveness. Most would consider it a win for me however, I took it as a loss. Even with saying that I still highly recommend Agricola Law Firm for the honesty, sincerity and preparedness.  The experience overall because of the judge and the other party was really disheartening. Too much joking when my livelihood was at risk made it awkward which is not my lawyer fault.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "107773472434761681415", "name": "Kirra Hawke", "time": 1601414111741, "rating": 5.0, "text": "Hands down the best attorneys! Barbi and Al handled my speeding ticket in a quick and easy manor. I am a student, so it was hard for me to attend the court date; they took care of it and took some stress off my shoulders. Agricola Law has such a lovely receptionist and a hard working paralegal too. I would recommend them for any case any day!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "110362707864347427921", "name": "Jennifer Herrit", "time": 1603401219839, "rating": 5.0, "text": "It will be hard to put into words the level of trust I have in the Agricola Law team.  Barbi stayed in constant contact with me, updating me while\nalso keeping me at ease.  They are compassionate, through, diligent and knowledgeable.  I would highly recommend the Agricola Law team!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "102460097767707201340", "name": "susan mitchell", "time": 1601414069213, "rating": 5.0, "text": "These lawyers were the best. So compassionate but also made sure I was taken care of. They worked relentless for my case. I highly recommend them. They always responded immediately to my needs. Thank you so much.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "114213078649048568291", "name": "Mary Bell", "time": 1601494078508, "rating": 5.0, "text": "Very impressed with every aspect of my interaction with Agricola Law and their associates. I found them to be both professional and helpful - giving advice but in a manner that wasn't overbearing or pushy. It can often be difficult to know who to trust with sensitive matters, but I would highly recommend them for anyone seeking legal aid or services. You won't be disappointed!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "108699060280940258485", "name": "Alex Motley", "time": 1627653272713, "rating": 5.0, "text": "Staff was transparent and helpful!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "107843566659693449603", "name": "Logan Cobb", "time": 1602606392834, "rating": 5.0, "text": "Al helped me out with a minor traffic violation a few months ago. Responsive, understanding, and very helpful. I felt comfortable with the team vs embarrassed. I felt safe and at ease during a process that would have normally given me a lot of anxiety. Thanks!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "107172332423359959858", "name": "Logan Langley", "time": 1594142461503, "rating": 5.0, "text": "I cannot recommend Agricola Law enough. They exceeded my expectations and made a messy situation easy by handling all the details of my divorce professionally and respectfully. Anytime I had an issue, they were on top of it and had a plan before I even mentioned an issue. Barbara Agricola was such an amazing attorney and I couldn’t recommend her services enough. I would pay the money again and then some. Matt Holdren was also fantastic and very attentive. Their entire office was amazing. Choose Agricola Law for your needs, best decision I made.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "102947531863740150591", "name": "Peter Hunt", "time": 1613000830986, "rating": 5.0, "text": "Barbi helped my daughter in law and I settle a case of  mishandled conservatorship. She listened to the whole situation and handled the case with utmost professionalism and results were favorable.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "113435585755246280109", "name": "Samuel Gmuca", "time": 1602606198356, "rating": 5.0, "text": "The team at Agricola Law is outstanding. Working with an attorney can be daunting, but this team makes you feel like part of the family. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "106332328447754819742", "name": "Jessica Strickland", "time": 1601426308327, "rating": 5.0, "text": "If not for the team at Agricola Law, I know the successful outcome of my law suit wouldn't have been possible. Barbi took on my difficult case and handled it professionally, efficiently, and with class. Not only did she exceed every expectation I had, she absolutely dominated in court! I HIGHLY recommend Agricola Law!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "112941660309284247045", "name": "Cliff Howie", "time": 1612898886826, "rating": 5.0, "text": "After consulting with multiple attorneys, Agricola Law was an easy choice. They were not the cheapest option, but our outcome was exactly what I wanted.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "116488992255045407742", "name": "Mike Glisson", "time": 1601428663551, "rating": 5.0, "text": "Agricola Law is so professional and responsive to every aspect of law that I had. I would refer them to anybody as they were great with my case. Thank you Agricola law for being fantastic at what you do.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "103998197779672438716", "name": "Tracy Morton", "time": 1581549033240, "rating": 5.0, "text": "We honestly cannot say enough about Barbie Agricola & her entire firm. I’ve met a lot of attorneys in my day... :( But Barbie sets herself apart from them all. She has integrity, tenacity, and most importantly, she’s honest. She does what she says she’s going to do and gets things done quicker than any other attorney I’ve seen and I used to run a law firm. My husband and I HIGHLY RECOMMEND Barbie & her firm to anyone that’s needs any sort of professional legal assistance!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "113421481791707057339", "name": "Shannon Rollins", "time": 1595270024904, "rating": 5.0, "text": "Barbi and Al Agricola did an excellent job dealing with a very tough situation. They were attentive to my needs, gave excellent advice, and provided a very professional service. I would highly recommend them for any legal services needed. They will be the first call I make in any situation where Legal representation is needed in the future.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "108822832779519117461", "name": "West Ryland", "time": 1601420129791, "rating": 5.0, "text": "Agricola Law office treats each client like family.  With Ms Agricola, you’re not a number but a name. She is an outstanding lawyer and you will know you’re represented by the best.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "117006591052791996832", "name": "Kelsey Fuller", "time": 1601415683662, "rating": 5.0, "text": "I had an amazing experience with Agricola Law Firm. They were very helpful and personable with everything. 10/10 recommend Barbi for all of your legal needs!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "106224396201477453262", "name": "George Nunnelley", "time": 1601472281113, "rating": 5.0, "text": "Thankfully, I haven't personally had to use the services of Agricola Law, but I know a number of its employees and can attest to their professionalism, work ethic and desire to help. This is a great group of people.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "116594057193903134374", "name": "Joni Smith", "time": 1604432278829, "rating": 5.0, "text": "Barbi was amazing to work with. She answered all of my questions in a timely manner and made a very difficult process, much easier on me.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "110176091937549547874", "name": "Lori Eckhardt", "time": 1601490930047, "rating": 5.0, "text": "I highly recommend Agricola Law!  Barbi and her staff is very professional and they generally care about helping you.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "118297611514348337236", "name": "Susan Cobb", "time": 1601413924459, "rating": 5.0, "text": "Barbi and her staff are top notch. Everyone at Agricola Law has been so very helpful, friendly and supportive.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "115859099273887448906", "name": "Cody Witt", "time": 1577740981736, "rating": 5.0, "text": "I highly recommend this law firm! They truly show they care about their clients. They made my very bitter divorce process a breeze. They responded very quickly to all questions that I had. Love these guys!!!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "114943254543323511226", "name": "Kristine Farr", "time": 1578100438986, "rating": 5.0, "text": "Barbi is the ultimate professional! She works tirelessly for her clients and has amazing outcomes. Super easy to work with, would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "110939764131432744589", "name": "Catherine Guinn", "time": 1567221565380, "rating": 5.0, "text": "You won't regret it. I don't care what the issue is; Barbi and Agricola Law is exactly who you want to represent you. We first sought this law firm out when we needed assistance with our son's IEP. We met Barbi and she told us everything upfront, no BS. Since then we have had no issues with the school. Most recently we needed legal assistance with the adoption of our 3 children. Her professionalism and care towards our situation made it as easy as possible. Barbi never once lied to us, she was upfront when explaining any possible issues, but quick to respond when they did appear. Our family considers her family now, and will always go to her and the Agricola Law firm with all of our legal needs. Thank you again Barbi, you have not only helped our family; but you helped make us a family. You helped us when no one else would, and found the answers that no one else could. THANK YOU!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "112744318543298680385", "name": "Craig Lipscomb", "time": 1554474365523, "rating": 5.0, "text": "Al Agricola and the Agricola Law Firm exceeded my expectations.  Of course, everyone hopes that their attorney will win their case for them but Agricola was so well prepared and knowledgeable about my case they they literally embarrassed the other attorney.  Another attorney in the court room remarked to me that he should have gotten continuing education for experiencing such a remarkable presentation.  What can I say other than if you need an attorney, Agricola will take great care of you.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "110127305494689714183", "name": "Brian Maley", "time": 1544176662263, "rating": 5.0, "text": "I would have given more stars if it was possible for the amazing work Ms. Agricola and her staff did on my case. Her knowledge of the law and the way she brought out truth in my case that was saturated in lies was impressive. She was able to see clearly the facts right after reading through my paperwork and went to work immediately on getting my son returned to me. I will never forget her not backing down in court and making sure that our side was heard. Her motions were written clearly, persuasively, and concisely. I couldn’t be more impressed than I am with Ms. Agricola. If you or anyone you know needs a great attorney, you have definitely found one!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "110787916384644583405", "name": "Shannon Bourg", "time": 1603335674414, "rating": 5.0, "text": "When I need an attorney, the Agricola firm is there! Whatever time or day, they were never too busy for me, I highly recommend the Agricola Law Firm!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "100626407266720458380", "name": "Winzera Celeste", "time": 1525883171048, "rating": 5.0, "text": "Ms. Barbara truly helped my case get the best results in the shortest amount of time. It seemed almost immediately after we called her she got to work and had results within a day. I had a speeding ticket through a construction zone and was really worried about this going on my record but she is helping me get the best results without it going on my record for insurance. I was a little concerned because her prices were a little higher than everyone else I had called, but it is worth every penny in my opinion. THANK YOU!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "107152195722735416406", "name": "Rodrigues Huguley", "time": 1620433202915, "rating": 5.0, "text": "Great..", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "115570280712261896288", "name": "ron stuart", "time": 1522434024829, "rating": 5.0, "text": "I was visiting friends in Alabama while residing in California on 11/17 and received a speeding ticket at night exiting the freeway from the airport.  I called 3 other law firms and found Agricola Law firm to be the most reasonably priced as well as most experienced while answering all questions in a professional matter.  My attorney was able to work out a deal with the prosecutor if I met a couple of conditions which I did and my ticket was dismissed without any court or ticket fees.  A big thank you to Barbi  and Emily and the entire staff. I would highly recommend this Law firm.  Rod K", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "110722460731716683488", "name": "Shelbie Hunt", "time": 1558551813880, "rating": 5.0, "text": "Barbi is a diligent attorney! My case was complex and took a lot of time  but Barbi and her staff remained transparent. I will always use Agricola Law for my legal needs.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "116970832950349678537", "name": "john Pom", "time": 1513475429061, "rating": 5.0, "text": "The AGRICOLA law firm was so incredibly helpful with our case. Barbara was so understanding and caring.  We truly feel like we had an ally throughout this difficult process. Thank goodness for honest and true people like everyone in the Agricola Law Firm.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "102260810008608770487", "name": "Dixie Broadwater", "time": 1504033121466, "rating": 5.0, "text": "I can't say enough good things about Barbi as an attorney. She really cares about her clients and wants the best outcome for them.She knows what she's doing and explains it a way so that you actually understand all aspects of your case.  I would recommend her to anyone looking for legal services.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "107158795681291422924", "name": "Jeff Ku", "time": 1550538790239, "rating": 5.0, "text": "Barbi is perfect! She is very responsible and she cares about her clients' interests. I strongly recommend her!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "102420898388778572736", "name": "Lindsay Ollis", "time": 1541524314096, "rating": 5.0, "text": "Barbi is extremely efficient, trustworthy, and professional. I am consistently impressed with the way Barbi and her staff are personally invested in the cases the firm takes. I would recommend her to anyone I know!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "101134679628208711718", "name": "Leesa Street", "time": 1509728713595, "rating": 5.0, "text": "Barbi is sharp as a tack and a go-getter. she helped me set up my business and drafted everything for me extremely fast. she also explained everything to me so i understood what i needed to do. if i need legal help in the future, i will be sure to use her again.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "116614559490698109728", "name": "Naeem Ghossein", "time": 1537134955479, "rating": 5.0, "text": "Barbi was just incredible! She was knowledgeable and professional, yet very amicable. The whole process felt effortless, and her and her staff truly care about their clients.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "111749317137556269598", "name": "Jeremy Houser", "time": 1504029295218, "rating": 5.0, "text": "BARBI is amazing!! I highly recommend her! I've moved to Indiana but she continues to be a phone call or text message away if I need advice. I can't thank you enough Doc!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "114681964250637229456", "name": "Kim S Smith", "time": 1621449164233, "rating": 5.0, "text": "Perfect", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "117677390675648160639", "name": "Mik Palm", "time": 1540491148428, "rating": 5.0, "text": "Barbi is a boss! If you are in the Columbus or Auburn area, then this is the lawyer you need to call for your legal needs. She kept me well informed and handled everything promptly. She had me out of that courtroom in less than 10 mins. I couldn't be happier! Thank you Agricola Law!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "112236598571994872419", "name": "Allen Brown", "time": 1575496843823, "rating": 5.0, "text": "Great group that work hard for your needs.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "117801729839470374438", "name": "Dean Richards", "time": 1524949476610, "rating": 5.0, "text": "These gals here helped me with my divorce. They did a lot of work and kept me informed the whole time. They worked with me even though I couldn’t come due to working out of town and I can’t be more grateful. I hope I never have another divorce but if I do I know who I’m calling.\n\nThanks Barbara and Emily y’all rock!!! 💪💪💪", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "108898466626266858666", "name": "Bethany Hill", "time": 1504371494741, "rating": 5.0, "text": "Barbi is so lovely! She has been so very compassionate during my difficult situation. I would highly recommend her.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "106142950654340758524", "name": "Elizabeth Scheeter", "time": 1504714002118, "rating": 5.0, "text": "Barbi is extremely knowledgeable and truly cares. She assisted us with a landlord dispute, and the issue was resolved quickly. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "103932167007884182013", "name": "Charcola Howard", "time": 1539088909643, "rating": 5.0, "text": "I would like to thank Barbara from the bottom of my heart. She is the best I could not have chosen a better lawyer she is a pitbull in your corner. Whatever I asked for she delivered. I reccomend her for any of your legal needs. Once again thank you Barbara for everything.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "112792139310820595983", "name": "Xavier Billingsley", "time": 1504056604535, "rating": 5.0, "text": "I can go on and on about Mrs. Barbie she and her team really care for their clients and she goes to the limit for you. I will always be her biggest supporter because she's an attorney who cares about people and their families well being. Agricola Law Firm is awesome and i would recommend Attorney Barbie Agricola because she is the best to represent you.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "115796799753705679247", "name": "Chris Kelly", "time": 1551734062870, "rating": 5.0, "text": "HIGHLY RECOMEND! HIRED HER 2 DAYS BEFORE COURT AND SHE NAILED IT! WILL DEFINETLY USE AGAIN IF NEEDED!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "117634763957096766423", "name": "VIbrant Fitness Company Vi", "time": 1529152074307, "rating": 5.0, "text": "I highly reccomend Barbi and her staff for all of your legal needs.  They are kind and patient and always very professional.  Trust me, you want Barbi representing you!!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "102331376662523078414", "name": "Mandie Garrison", "time": 1530817853749, "rating": 5.0, "text": "Very professional and organized. She kept me up to date until my case was resolved.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "109620835445926458926", "name": "jeffthro2007", "time": 1504068307486, "rating": 5.0, "text": "I have you used this law firm and recieved nothing but exceptional service. Agricola law was on top of the game. I am a male and she worked twice as hard with long days and long nights putting together my case for full custody of my son. Without her i wouldnt have been successful in court. Full custody with mom having supervised visits at my discretion. From start to finish she always had a plan and follows through. I highly suggest this intelligent woman, she is tough when it comes to standing her grounds in court. Thanks again.", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "110047653919467076813", "name": "Rhonda West", "time": 1601569997000, "rating": 5.0, "text": "Barbi is a rockstar!!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "116648323787483525864", "name": "Patrick Hubbard", "time": 1504372593916, "rating": 5.0, "text": "Nonjudgmental, professional, friendly and extremely helpful!  Agricola Law is the best around!", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "110079255893262633187", "name": "Robert Collins", "time": 1548371168248, "rating": 5.0, "text": "Best lawyer in town", "pics": null, "resp": null, "gmap_id": "0x888c9339a9978771:0x3766d584b8c74cda"}
{"user_id": "114872256209420117841", "name": "Ron Sinai", "time": 1579128089618, "rating": 5.0, "text": "Great law firm and very easy to work with. I would recommend Lee Winston to anyone seeking an aggressive and experienced Employment/Personal Injury attorney.", "pics": null, "resp": null, "gmap_id": "0x88891b946a05e5dd:0x49f34a9da9646386"}
{"user_id": "107950141255233826284", "name": "Tunnel Springs Bullies", "time": 1471221365862, "rating": 5.0, "text": "The best Attorney firm in the world as far as I am concerned. Extremely knowledgeable and quick to act. I recommend anyone in need of an Attorney that falls under the types of things that Winston Cooks LLC handle, to use WINSTON COOKS LLC", "pics": null, "resp": null, "gmap_id": "0x88891b946a05e5dd:0x49f34a9da9646386"}
{"user_id": "104362708550679196645", "name": "Vicki Seals", "time": 1550632537729, "rating": 5.0, "text": "Best employment attorneys in town.", "pics": null, "resp": null, "gmap_id": "0x88891b946a05e5dd:0x49f34a9da9646386"}
{"user_id": "115386404983305701847", "name": "Evan A", "time": 1558120208781, "rating": 5.0, "text": "great!", "pics": null, "resp": null, "gmap_id": "0x88891b946a05e5dd:0x49f34a9da9646386"}
{"user_id": "115348630227849439746", "name": "Vicki Ricke", "time": 1620150268460, "rating": 5.0, "text": "Jim has been my attorney since 2015 and has been a huge asset to not only my family but to our business as well. I cannot say enough about him and his abilities. He was referred to me by another attorney which in itself speaks volumes. Pino & Associates will be our law firm for all our business and personal needs!", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "102793146616034734031", "name": "Tara Davenport", "time": 1604428299157, "rating": 5.0, "text": "In December 2015 Jim Pino was referred to me by a family friend, also an attorney and who’s advice and opinion matter greatly to me.\n\nI needed an attorney who would fight for me. To help and advise me with a divorce after 23 years of marriage. I knew going into it that it wasn’t going to be anywhere close to pretty, much less easy for a multitude of reasons. But I also knew that I had “hit my wall” and it was necessary. I also knew that I was going to have to have an attorney that would work with me, not just for me. I had been married since I was 21.... nothing about anything was easy and I was terrified about everything.\n\nAnd that’s exactly what Jim did for me.\n\nJim and his amazing staff helped me through one of the hardest times of my life and helped me find myself again.\n\nI would and do, recommend Jim Pino & Associates to any and everyone who asks.\n\nThank you Jim and thank you to your awesome staff!!", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "102071198031199362934", "name": "Gordon Madden", "time": 1595643452615, "rating": 5.0, "text": "There is not enough space to share my experience with Jim and the entire staff. They have worked with me for over a decade (11) years. Almost daily, many nights, weekends even when they've been on vacation. Never once failing to jump up to the emergency, or simply to make sure my son was protected. Because of Jim and his family, staff and associates, I have been given the opportunity to have a wonderful relationship with my little boy. He's stood in my defense against 17 different lawyers, sometimes 5 against 1. His son has stood with me as well. We've had multiple trials, most recently he postponed major surgery and suffered through a 4 day trial. Agonizing in Pain against 4 very reputable lawyers. Not to mention, he did this for 1/5 of the money the other guys were being paid. He did it because he cares and felt that it was in my son's best interest and we'll being. Just today, our order was issued. Once again, his hard work and character and one of a kind skill prevailed. I still have sole custody and I am assured a meaningful relationship with the most important thing in my life. I can never repay Jim for his decade long dedication to making sure we're protected. If you need help, a brief visit with him will reveal the true character and heart he puts into making sure justice prevails. My name is Gordon Madden and I would be happy to share my story with you.", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "116986728422883151848", "name": "Jeremy Naish", "time": 1604527717114, "rating": 5.0, "text": "Mr. Pino went above and beyond to help me. He explained everything very thoroughly and let me know what to expect. He was honest and gave me options. I have used Mr. Pino on a few occasions with success every time. I highly recommend using Mr.Pino.", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "110147719251487208120", "name": "David Cooper", "time": 1604264496896, "rating": 5.0, "text": "Jim Pino has been our families attorney for over 10 years. I highly recommend him for any legal services.\nGreat service that has brought value to our family.", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "104426564662520731238", "name": "Ashley Worthen", "time": 1565959681135, "rating": 5.0, "text": "Mr Pino is a fantastic lawyer. He is very knowledgeable and explains the process so you can understand what to expect. He lets you make the final decisions, but gives his honest opinion on how it will play out with the judge. He puts his heart and soul into you and your case and he “brings it” if it comes to the courtroom. I will never recommend or use anyone else! He is amazing!", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "116511729020897353416", "name": "Vivian Avila", "time": 1601062313769, "rating": 5.0, "text": "Very friendly, helpful and reasonably priced", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "110735301558058816628", "name": "J. CL", "time": 1563749925645, "rating": 5.0, "text": "Mr.Jim Pino was an answered prayer. My daughter and I needed an experienced, sharp and aggressive attorney. We were referred to Mr.Pino in the middle of our case, which is difficult at best. I can’t imagine there was anyone better able to represent us. Divorce and Custody can be brutal. He came in strong and started getting results. He is excellent in the court room during cross examination. He didn’t let the opposing attorney badger me and entered evidence in a concise and understandable process.\nI would definitely recommend Mr.Pino for any legal issue. His expertise aside, he is very understanding and helped guide me in a painful process. I am forever grateful.", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "101257783823337477630", "name": "Christopher Meadows", "time": 1430492676958, "rating": 5.0, "text": "Mr. Pino and his son Jeff Pino represented me in my divorce that required them to be pro active in implementing the Alabama State relocation laws. My son was relocated back to the State of Alabama.\nMy divorce was a success thanks to Jim, Jeff and the professional legal staff that Jim has on hand.\n\nSincerely,\nChris Meadows", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "115775859098988301641", "name": "Brooke Lyvers", "time": 1430267147608, "rating": 5.0, "text": "Jim was referred to me by a friend when my lawyer could no longer help me with my case. His knowledge, experience,  professionalism, compassion, fairness, and swiftness surpass any divorce/family lawyer in Birmingham/Shelby co. He is a quick, no nonsense lawyer in the courtroom who refuses to lose. His staff is wonderful!! I have referred several friends to him and will continue to use his services if the need arises.", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "109307036763090119951", "name": "Lauren Valentine", "time": 1493671491280, "rating": 5.0, "text": "Jim was referred to me by a family member who had used him with their case. Jim helped me with my divorce and custody case and was very helpful and understanding. Jim and his staff were great to work with and communicated great with me about my case.", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "101832343041352536837", "name": "Beverly Gaylord Butler", "time": 1434554470568, "rating": 5.0, "text": "I was at my best friends wedding as well as her divorce. Mr. Jim Pino was her divorce lawyer who guided her and supported her through the mediation until the divorce proceedings.  Mr. Pino knew how her ex had treated her and calmed her during this horrible time of her life. She is a smart, loving, and kind woman who had an ex who treated her so cruelly.  Mr. Pino was always there for her to get through this and was fighting for her to the very end of the divorce proceedings.   My friend was a winner in the end because of Mr. Pino's experience and commitment to help her.  Thank you Mr. Pino for being her lawyer!", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "111615151042847826065", "name": "CYNTHIA HYLTON-MURER", "time": 1489687379342, "rating": 5.0, "text": "Jim Pino represented me during one of the most difficult times of my life.   After my dad had passed and I was distraught over the misuse of power of attorney, he got a very difficult estate issue resolved for me and my children.  If it had not been for him, as my attorney, I do not know if I would have made it.  He and his staff are very professional, courteous, and kind. It is with pleasure that I highly recommend Jim Pino and Associates.", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "109091045903747659393", "name": "Brian Yarber", "time": 1430239742754, "rating": 5.0, "text": "Jim is a great attorney and is very knowledgeable, thoughtful and honest. He has a great staff that is very responsive. I would definitely recommend Jim Pino & Associates.", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "109151020649817657410", "name": "Sharon Jones", "time": 1541967345258, "rating": 5.0, "text": "Best Lawyers I have ever used", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "104740390232267810082", "name": "Vickie Harkness", "time": 1429543353116, "rating": 5.0, "text": "Fair, understanding, knowledgeable, great courtroom skills, great staff!", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "100771698162252516730", "name": "fred campbell", "time": 1584038348829, "rating": 4.0, "text": "Great attorney!!", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "111674134020214949841", "name": "Frieda Pearson", "time": 1505763730614, "rating": 5.0, "text": "Friendly very helpful.", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "116611839774469352977", "name": "Matthew Goodsell", "time": 1493223338987, "rating": 2.0, "text": "They didn't file papers correctly with the court.", "pics": null, "resp": null, "gmap_id": "0x8889240e870bbfd3:0x33a0f0bb4f4f12fa"}
{"user_id": "114304613011332178479", "name": "Joy Steiner", "time": 1565539010033, "rating": 5.0, "text": "Jason is the best of the best! He goes above and beyond for his clients. He is not only the definition of professionalism but compassion. He treats his clients with respect and understanding. I recommend Jason to anyone who is looking for an attorney who will give them 110% of his attention and see the case through till the end.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "116183860817643019519", "name": "Meredith Gonzales", "time": 1562425179011, "rating": 5.0, "text": "After my auto accident, I needed help dealing with the insurance companies and healthcare providers.  I'm glad I chose The Hadley Law Firm as they went above and beyond.  Jason never backed down, stuck with it to the end, and made sure I was given the facts to make informed decisions during the whole process.  There's no doubt he has your best outcome in mind when handling your case.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "115903811930070579191", "name": "mauricedallastx", "time": 1547407100842, "rating": 5.0, "text": "The Hadley Law Firm was very professional, friendly and honest when I used them for two traffic violations I received in Bay Minette.  Jason and his staff were dependable and able to get done what I requested with ease.  I give Jason and his team two thumbs up.  FIVE STARS", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "116508195431461017782", "name": "Lee Lee", "time": 1598919882827, "rating": 5.0, "text": "He has been good to me", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "117529433990824390027", "name": "Kim Sinclair", "time": 1571716593387, "rating": 5.0, "text": "Jason is very professional and has provided excellent service! I would highly recommend The Hadley Law Firm.\nThanks again for doing a great job!", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "116227572432356133996", "name": "danny cox", "time": 1562812152126, "rating": 5.0, "text": "Jason handled a very difficult motor vehicle accident for my family. What a great man and attorney. I would not hesitate to recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "100365515552180493794", "name": "Ashley Tuberville", "time": 1546999957177, "rating": 5.0, "text": "Very Professional! Best all around Attorney in the area! He sincerely cares about each of his clients and not just his payment for your case like most Attorneys. If you are looking for the best and most honest Attorney , Mr. Hadley is the one!!!", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "100628431226722367255", "name": "Janna Mosley", "time": 1561954823923, "rating": 4.0, "text": "I really  like them there,they all are nice  and friendly  and they  have a nice  office.I really  hope he can help me.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "116737967030244112660", "name": "Jody Conway", "time": 1529443783641, "rating": 5.0, "text": "Very nice,  handled my vehicle accident claim very well.  Keep me update on what was going on and always responded to my emails when he could.  I would use Jason again if I ever need (and I hope I don't)  a attorney again, he will be the one I call.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "107672768044917480399", "name": "BLAKE COLEMAN", "time": 1536934908442, "rating": 5.0, "text": "THE ABSOLUTE BEST!!! I COULD NOT HAVE BEEN HAPPIER WITH MY CASE! THIS MAN CARES ABOUT HIS CLIENTS AND GOT ME WAYYY ABOVE AND BEYOND WHAT I WAS ANTICIPATING THE OUTCOME TO BE!!", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "116778476373173714145", "name": "Mark Link", "time": 1530043530900, "rating": 5.0, "text": "Jason handled a personal injury case with me and I found that he was very knowledgeable about the legal issues involved in the case.  Mr. Hadley was very attentive to our particular needs and I would highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "115783283928509425387", "name": "Rocky Langham", "time": 1529447333307, "rating": 5.0, "text": "Jason was very detailed in handling my claim he gave me a lot of useful information I thought I had no leg to stand on he let me know he was going to do everything he could to help me ! I would recommend him to anyone with an accident claim", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "103935127809470610959", "name": "Ernest Walker", "time": 1529378699815, "rating": 4.0, "text": "Very professional and helpful staff there. Mr. Hadley is currently representing me in a vehicle accident claim and as of date I am very pleased with everything.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "113536626796489248141", "name": "Stephen Williams", "time": 1528488715181, "rating": 5.0, "text": "Outstanding Attorney.  Impressive record.  Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "114388024242109666645", "name": "Freda DuBose", "time": 1589771974362, "rating": 5.0, "text": "Nothing bad to say", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "103764959238313961608", "name": "Joyce Lambert", "time": 1550716784275, "rating": 5.0, "text": "Very honest. Trustworthy.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "117366158679796009563", "name": "C Riddick", "time": 1524881959932, "rating": 5.0, "text": "Professional, reliable & organized. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "118410199404825866695", "name": "Patti Anderson", "time": 1514013196148, "rating": 5.0, "text": "Great first meeting. Conscientious attorney.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "108890373709654654689", "name": "Connie Whatley", "time": 1565984923801, "rating": 5.0, "text": "Best Law Firm in Bay Minette I recommend it", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "104368542776362634173", "name": "Dr. Jennifer Brooke Gilbert", "time": 1623336154962, "rating": 5.0, "text": "Great attorney. He has exceptional communication skills and has taken care of many legal issues for me. He assisted in saving my career.", "pics": null, "resp": null, "gmap_id": "0x888a3ea52e16c09d:0xdc27c659bb521df6"}
{"user_id": "105809588061148196836", "name": "Carol Carmack", "time": 1608818309207, "rating": 5.0, "text": "Love this lawyer and his very helpful knowledgeable staff", "pics": null, "resp": null, "gmap_id": "0x888a3ea52e16c09d:0xdc27c659bb521df6"}
{"user_id": "112440846490639315432", "name": "Teresa McCutcheon", "time": 1595884382635, "rating": 1.0, "text": "If I could give a 0, I would.  Had a consultation.  He advised what information he would need.  I collected the information he requested.  I sent it to him only to receive a response “Where did you get this?”?  Told him and never heard back...sent many emails asking for a response...nothing!  Very unprofessional!", "pics": null, "resp": null, "gmap_id": "0x888a3ea52e16c09d:0xdc27c659bb521df6"}
{"user_id": "109209666481998103656", "name": "Adam Bennington", "time": 1581108122187, "rating": 5.0, "text": "Great guy. Really cares. And very Ownest Lawyer.", "pics": null, "resp": null, "gmap_id": "0x888a3ea52e16c09d:0xdc27c659bb521df6"}
{"user_id": "112261533911271085415", "name": "B", "time": 1514929943412, "rating": 5.0, "text": "Philip and staff helped us through a trying ordeal . We handed the legal concerns over to Philip and his Office Manager, so my husband and son could focus on recovery.\nThe process was was explained to us clearly and we were satisfied with the results.\nOur family would absolutely use Mr. Miles' services again and recommend him to anyone seeking representation by someone with great knowledge of the law and sincere desire to get the best results for his clients.", "pics": null, "resp": null, "gmap_id": "0x888a3ea52e16c09d:0xdc27c659bb521df6"}
{"user_id": "106746142885660527271", "name": "Donna NeSmith", "time": 1545346646557, "rating": 1.0, "text": "Just wanted to update my case. Mr. Miles wouldn't take my case because \"documentation didn't support it.\" I had a video of the incident. I got an amazing attorney in Huntsville and I won the case.", "pics": null, "resp": null, "gmap_id": "0x888a3ea52e16c09d:0xdc27c659bb521df6"}
{"user_id": "103689486983816871863", "name": "Jason Morgan", "time": 1504857206084, "rating": 5.0, "text": "Great professional service.   Friendly group working hard for you.  Have used for years. He always goes extra mile to get every thing the law says you are owed.  Very easy to talk to and explains complex legal jargon so normal people can understand.    Highly recommend this Firm.      Good People", "pics": null, "resp": null, "gmap_id": "0x888a3ea52e16c09d:0xdc27c659bb521df6"}
{"user_id": "115781559962377090391", "name": "Tyson Ingram", "time": 1579720584836, "rating": 5.0, "text": "Good services are recommended this long office", "pics": null, "resp": null, "gmap_id": "0x888a3ea52e16c09d:0xdc27c659bb521df6"}
{"user_id": "100892506769528420593", "name": "Brooke Durham", "time": 1500660034237, "rating": 5.0, "text": "Great attorney, would recommend him to anyone!! Great workers comp attorney as well!! Thank you for helping us through some rough times!!", "pics": null, "resp": null, "gmap_id": "0x888a3ea52e16c09d:0xdc27c659bb521df6"}
{"user_id": "112820438813220180631", "name": "Jeremy Foster", "time": 1518122639306, "rating": 5.0, "text": "You will not find an attorney that will work any harder for you than Philip. Don't waste time going to anyone else.", "pics": null, "resp": null, "gmap_id": "0x888a3ea52e16c09d:0xdc27c659bb521df6"}
{"user_id": "113467694740099693425", "name": "Tony Durham", "time": 1538315408798, "rating": 5.0, "text": "Great attorney very grateful he was my workers comp attorney.", "pics": null, "resp": null, "gmap_id": "0x888a3ea52e16c09d:0xdc27c659bb521df6"}
{"user_id": "101980791794346352647", "name": "Donna NeSmith", "time": 1518127154954, "rating": 1.0, "text": "No thanks!! No thanks!! I found an amazing attorney in Huntsville that has taken care of it.", "pics": null, "resp": {"time": 1507128612845, "text": "Donna, sorry I couldn't take your case.  The documentation didn't support it. If you would like to talk further please contact me."}, "gmap_id": "0x888a3ea52e16c09d:0xdc27c659bb521df6"}
{"user_id": "116550289851862088595", "name": "Ed Glaze", "time": 1502473356936, "rating": 5.0, "text": "Over several years, Mr. Miles has handled a broad range of legal issues for me. He is a very caring professional and I have full confidence in recommending him to you.", "pics": null, "resp": null, "gmap_id": "0x888a3ea52e16c09d:0xdc27c659bb521df6"}
{"user_id": "112437749107432000981", "name": "Miaa Murry", "time": 1498153791233, "rating": 5.0, "text": "Phillip miles  is too me in my family  the best Attorney in Gadsden. He cares  about  the people.", "pics": null, "resp": null, "gmap_id": "0x888a3ea52e16c09d:0xdc27c659bb521df6"}
{"user_id": "114832173930331767536", "name": "Tabatha D. Knight", "time": 1570570967412, "rating": 5.0, "text": "Grat lawyer", "pics": null, "resp": null, "gmap_id": "0x888a3ea52e16c09d:0xdc27c659bb521df6"}
{"user_id": "112765022997557183046", "name": "Sharon Jordan", "time": 1622926814939, "rating": 5.0, "text": "I was referred to Ms. Thiry by a client of hers and never regretted it. I was under another law firm but I let them go after I spoke to Renee. She was very kind and compassionate with me. She always returned my calls. She made me feel at ease. She was professional as well as laid back. She was able to get me a good settlement and I so much appreciate her.", "pics": null, "resp": {"time": 1622991066790, "text": "So glad I could help!"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "105900400845704220476", "name": "J Ward", "time": 1617992679665, "rating": 5.0, "text": "Mrs. Thiry is intelligent, patient, helpful and very kind. She will get you the results you are looking for. Knowing I was pressed for time, Mrs. Thiry still accepted my case and listened too any and all of my concerns. She went above and beyond what I thought was the impossible. She made a very difficult time easy. She is an extremely caring attorney and is relatable and affordable. Mrs. Thiry made the process as smooth as possible and with her experience I will look no further. I highly recommend Mrs. Thiry @ Thiry & Caddell LLP.", "pics": null, "resp": {"time": 1617996564711, "text": "So glad I could help!  Renee"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "117757593215020506159", "name": "James Pritchard", "time": 1623476759115, "rating": 5.0, "text": "Best attorney in mobile. She's a real scrapper. If you want to win use Renee Thiry.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "106904379435982276885", "name": "Ollice Carter", "time": 1609642332738, "rating": 5.0, "text": "When I was in pain and looking at the loss of my livelihood I found it hard to think clearly and make good decisions. In addition, I didn't understand the complex legal process of worker's compensation law. Renee Thiry explained the law in clear language and laid out what needed to be done without making empty promises and answering all of my many questions.She was assertive without being aggressive.Renee is articulate, knowledgeable and effective.If you need help with worker's compensation or disability law I would highly recommend you give her a call.", "pics": null, "resp": {"time": 1609698124640, "text": "Thank you.  It was quite a journey, and I enjoyed helping you and getting to know you and your wife."}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "108488698092456078795", "name": "lawrence etheridge", "time": 1614813875606, "rating": 5.0, "text": "While I wasn’t a client of this firm I want to give them 5 Stars. My ex wife used them in our divorce 10 years ago and they fought hard for her and she won. Renee was tough and made sure her client was heard. I can tell you from experience that’s rare and if you guys are looking for someone to go the distance with you talk to this firm. I had to hire several attorneys from the Mobile area throughout the years and none were as thorough as I could tell Renee was. I wished I would have had her at the time!\n\n5 Stars", "pics": null, "resp": {"time": 1614813754384, "text": "Thanks so much!  Send me your number.  I would love to talk to you."}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "115841455937692566207", "name": "Jennifer Killgo LMT", "time": 1618861977754, "rating": 5.0, "text": "If anyone needs a good divorce attorney, let me just say that Renee Thiry did an awesome job of keeping my ex’s lawyer on task to get the job done during covid. She listened and sympathized, eased my fears, and was very fair in her pricing and payment plan. Ex’s lawyer tried to play the “good ole boys club card” and she was quick to curb that. Thiry & Caddell, LLP sailed a tight ship through and I would highly recommend them even if it is just in a consultation to see what is best for you.", "pics": null, "resp": {"time": 1618865636338, "text": "Thanks so much!  We enjoyed helping you!"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "107699689477328035045", "name": "yung trav", "time": 1617823034300, "rating": 5.0, "text": "mrs renee and her staff did an awesome job to not only get the job done and doing what’s right for my case but also made me feel like family..\n\nRecommend 100%", "pics": null, "resp": {"time": 1617824154726, "text": "Thanks!  I enjoyed working with you.  Renee"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "103329208361871297047", "name": "Payton Porter", "time": 1604349802569, "rating": 5.0, "text": "This was my first divorce. It was extremely nerve racking for me since I have two little ones. My ex wanted full custody and would not settle on anything that was in the best interest for the kids. The day of court I was a nervous wreck but Renee gave me a hug and told me everything was going to be alright. I never felt like she just \"wanted\" my money and that was it, like most attorneys are. She definitely has a heart for what she does. It has taken us almost a whole year for all of this to be finalized. Not on her behalf but the court/Covid-19. The ending result was more than what I was expecting! She won our case! She fought extremely hard for my kids and I. She always listened to my concerns and anytime I needed to speak to someone the ladies in the office including Renee were always so quick to get back with me. I truly do feel like I gained a relationship with these ladies. I HIGHLY recommend Renee and her team! You will not be disappointed!", "pics": null, "resp": {"time": 1604354835556, "text": "Thanks.  Please stay in touch and good luck to you and your little ones!"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "104620673176607488351", "name": "Kasey Evans", "time": 1616638467951, "rating": 5.0, "text": "If your looking for lawyer Renee is the one after a consultation you will 100% know she's the one. She has great passion, dedication, and professionalism. She made a very stressfull divorce alot easier my ex took my kids an she helped me get them back. I know she has a lot of clients, she is always very prompt responses and attention to detail an she returns your calls personally an for me that meant alot an shows her dedication to her job. I wish I could give her more than 5 stars. I will forever be greatful for Renee.", "pics": null, "resp": {"time": 1616688149203, "text": "Thanks so much Kasey!  I am so glad that I could help you.  Your kids belong with you.  Renee"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "112102797754721959416", "name": "Tell Williams", "time": 1614631319893, "rating": 5.0, "text": "Was a great experience working with thiry&caddell\nThey offered me the best experience Kept me informed on my case I would refer to anyone", "pics": null, "resp": {"time": 1614632592137, "text": "Thank you.  Enjoyed working with you!"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "102189688127698899761", "name": "Karen Uribe", "time": 1608750125021, "rating": 5.0, "text": "Renee went above and beyond to help my father with his divorce . Even with the language barrier she fought hard to give him the outcome he wanted. Very professional but also very caring for her customers. I wouldn’t recommend any other attorney", "pics": null, "resp": {"time": 1608751712642, "text": "Thanks so much!  I enjoyed helping your father."}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "104181359173272473250", "name": "Melissa Stearns", "time": 1594338319318, "rating": 5.0, "text": "Was fighting for my visitation back and went in on a Thursday afternoon and by Friday she had me a result I wasn’t expecting. Signed papers on Monday. I have my visitation back. Fast positive results. Very satisfied. I am grateful for the results that Mrs. Renee got me. I will use her again for anything I may need. Very friendly staff and service. I highly recommend this firm.", "pics": null, "resp": {"time": 1594411305412, "text": "So glad we could help.  I am so happy for you!"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "109048647371811477603", "name": "Haley Alonso", "time": 1602536304158, "rating": 5.0, "text": "I used Mrs. Thiry for a divorce with three dependents and she was amazing and so helpful through the process. She doesn't pick parents sides by gender.. she picks on best outcome for the child. Amazing family and marriage lawyer! 500 gold stars if it were an option!!!! Thank You Mrs. Thiry!", "pics": null, "resp": {"time": 1602539261189, "text": "Thank you so much!  Enjoyed helping you!!!"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "103269792325958661285", "name": "James Eccles", "time": 1613565636925, "rating": 1.0, "text": "This lawyer was horrible! After catching him in numerous lies I was left with no choice to report him to the Alabama state bar. I think his good reviews are as fraudulent as his actions.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "112081073497438318494", "name": "Hannah Burgess", "time": 1598025786109, "rating": 5.0, "text": "Renee made the process as simple and painless as possible. I hired her after firing my first lawyer for completely ignoring my emails and questions about my workman’s comp case. (It wasn’t a big enough case to be important to them.) Wish I would have hired Renee from the very beginning. My questions were answered and my cases was settled quickly. 10/10 would recommend.", "pics": null, "resp": {"time": 1598029589705, "text": "Thanks!  Glad I got to help you!"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "108865060967119215616", "name": "Ketti Thompson", "time": 1611348912988, "rating": 5.0, "text": "fantastic staff and fantastic communication, will definitely use for future legal needs!", "pics": null, "resp": {"time": 1612091442574, "text": "Dear Ketti Thompson, Thank you so much for taking the time to leave this excellent review.  We really appreciate your business.  Please let us know if there is anything we can do for you in the future. -Thiry & Caddell LLP"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "109033547505990475334", "name": "brittany fordham", "time": 1602292866059, "rating": 5.0, "text": "Renee is such a wonderful individual, so professional and personable.  I would highly recommend her for your legal needs.", "pics": null, "resp": {"time": 1602365372116, "text": "Thanks!  I enjoyed helping your husband."}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "112960439395189957500", "name": "Tracy Dunn", "time": 1586382957875, "rating": 5.0, "text": "I very much recommend Renee Thiry.   The staff is very helpful and compassionate to your case and needs.  Renee is exceptional to ensure that she personally calls you back usually within less than 24 hours.  Exceptional work and service.", "pics": null, "resp": {"time": 1594837945686, "text": "Thank you!  I enjoyed helping you and your husband!"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "108161586951316935548", "name": "Danielle Lamprakes", "time": 1582422043728, "rating": 5.0, "text": "Renee Thiry is an absolute exceptional attorney. She is very compassionate and kind when dealing with her clients.She is very thorough and keeps you informed every step of the way. I chose her to take care of my work comp case and she definitely didn't treat me like I was just another case. She treated me like we had known each other our whole life. She has a big heart, and she definitely cares about the outcome of any of her clients. I say that because I would observe her dealing with other clients whenever I had to go see her. Her office staff is exceptional and compassionate and speaking of Kelsie, Mrs Cheryl, Leslie and even Sarah who just started there. These ladies are in the business of caring! I highly recommend Renee. I would give her 10 stars if I could. She deserves it!", "pics": null, "resp": {"time": 1582442361349, "text": "I have so enjoyed working with you.  We will always be friends!"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "100704560834898434291", "name": "Raechel Rodriguez", "time": 1576788611784, "rating": 5.0, "text": "Mrs.Renee was very attentive, helpful, and went beyond measures to make sure that my case was handled correctly and promptly, she wants and gets what is deserved, she makes you feel like an actual person and not just a dollar sign. She is very responsive when you call, we highly recommend her to any one looking for an attorney!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "109145635405220039990", "name": "jack storm", "time": 1583298192866, "rating": 5.0, "text": "growing up i been trying to get on disability all of my life, i kept getting deny and lawyers gave up on me said i may never get it. but the moment i met Renee Thiry she assure me she will do the best she can and help me get it shes friendly she staff is great ready to help always friendly, and kind this is hands down the best lawyer that didn't get up on me i won my cause because of her if u going thew what i been where i was go see Renee Thiry because her and the staff will go far beyond to help u get your disability approved thank u ms Renee Thiry for not give up on me :) 5stars!", "pics": null, "resp": {"time": 1583341116546, "text": "I so enjoyed helping you and getting to know you and your mother.  Stay in touch!"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "110944524789457464368", "name": "Matt Williams", "time": 1588337826744, "rating": 5.0, "text": "Renee is the greatest thing since sliced bread. She really was able to put up with me and fought in corner for what I deserved and was do. Dealing with workmen comp cases are not easy. And I found that out with what we had just been through. She work with me and for me almost 3 yrs, and she never stopped.  Thank you so very much Renee, you and he ladies are gor ever in my stories. If you are in need of a lawyer that actually cares about her clients as a person and not a dollar $...please stop looking....you found her!\n\nAgain thank you Renee!", "pics": null, "resp": {"time": 1602365422133, "text": "Thanks Matt.  Hope you are doing well!"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "106819100192874622856", "name": "Ultreya Park", "time": 1576164255696, "rating": 5.0, "text": "Tried to help as best they could, even though they ultimately could not. It was a situation with an elder who is in a tight spot n needed to improve legal standing. Caddell office gave it their all, and Shawn was very charming and accommodating and sweet about the whole thing. And Mr. C was very kind and tried to assist our family. They went to trouble in a rush and really were willing, able and ready. Put themselves through trouble even though it was only preliminary. Refreshing experience. Grateful for their effort.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "116817336201338235384", "name": "Denise Whitfield", "time": 1589830617032, "rating": 5.0, "text": "Awesome,Caring,Very reliable and makes sure you are taken care of with my workman comp and social security disability!!!", "pics": null, "resp": {"time": 1589836455401, "text": "Thanks Denise.  I enjoyed helping you."}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "104266950844499903715", "name": "Holly McCall", "time": 1570126017969, "rating": 5.0, "text": "Renee Thiry was amazing! I used her for a workers compensation case and she walked me through the entire process with encouragement and professionalism.  She doesn't make you feel just like a file number, she takes each one personally. I am amazed at the outcome she worked for! I would recommend her to anyone for any thing she practices.", "pics": null, "resp": {"time": 1570127307176, "text": "I enjoyed working with you!"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "115624015803700971902", "name": "Lee Ann", "time": 1576687267241, "rating": 5.0, "text": "My husband and I highly recommend this law firm. We've had our wills done there, as well as other legal documents, and it's been a pleasure to have them help us each time we've gone.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "103090487774413034553", "name": "Tracy Hunter", "time": 1560617178326, "rating": 5.0, "text": "Renee Thiry and the staff at Thiry and Caddell are amazing!  They care about you personally.   Leslie Stone is super too!\n\nRenee has represented me in business and family/probate matters.  I have have been pleased with her representation always going over and beyond what’s needed. I highly recommend her.", "pics": null, "resp": {"time": 1560638172246, "text": "Thanks.  Enjoyed helping you.  Love you!"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "107637123642653582173", "name": "William Mccormick", "time": 1549392488542, "rating": 5.0, "text": "M.Renee is a great person in general.  She helped me with my workers comp,  Social security and my custody cases. I recommend this law firm to anyone and everyone.  Every person was very helpful and prompt. You will definitely get your money's worth and then some.", "pics": null, "resp": {"time": 1549395336163, "text": "Thanks so much.  I enjoyed helping you!"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "107312618928740842354", "name": "Anitria Zine Callen", "time": 1555949265144, "rating": 5.0, "text": "Omg!!! Renee Thiry is The Best Attorney at Law.. I’ve known Renee Since 2008.. She’s Always Concerned about her clients.. And Makes Sure you are Well Satisfied in ALL ASPECTS.. I can remember this Case we was fighting for Custody of my nieces and nephews it was like three different states.. Renee Drove to All Three States trying to make sure we Would win!!! And of Course WE DID!!!! Love her she’s a Beautiful person who Answers All her Calls and respond to All her Messages!!!!! My Family loves her and Glad She’s a Part of Our lives!!!!\nThe Campbell And Zine ‘s❤️❤️❤️❤️❤️❤️", "pics": null, "resp": {"time": 1555967639066, "text": "Thanks!  Love you and your family!"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "105672713153584362941", "name": "Light House Cleaning Company LLC", "time": 1574052983793, "rating": 5.0, "text": "Renee And Leslie the entire firm is awesome from personal case all the way to helping with business matters they're concerned with your life and you family ❤️❤️❤️♥️ 🙏 And that's the biggest blessing Ever.,.. Very Professional Understanding and open and Questions Answers... Any Problem related to your case Taken Care of this Firm Put Action Along with they're Promise", "pics": null, "resp": {"time": 1574103121114, "text": "Love you!  Thanks for the review.  I will always be here to help you."}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "112370054145689942402", "name": "Larry Shafer", "time": 1564718435433, "rating": 5.0, "text": "If you are looking for a lawyer look no further!!! I was hurt in shipyard and didn't know what to do so I contacted this lawyer office...The first time I met Renee I was impressed by how she for lack of better words... she was down to earth...she was like your next door neighbor...but what really sold me that she was the lawyer for me was how sad she looked as I began to tell her my tragic story...you can hide a lot of things from people but when you look into someone's eyes who is a caring person like Renee you can see that she actually cares what you are going through...I couldn't have asked for a better lawyer and someone who wants to help get your life back on track..By the time my case was settled I felt that we were more like friends than her being my attorney...I suggest you give them a chance to be your attorney...My settlement was a great one and if you're still not sure the only other thing I can put into words to prove my statements is when I was finished with our first appointment and was getting up to leave Renee actually got up from behind her desk and came around it and gave me a hug and said she was sorry that I was having the troubles that I was having...WHO DOES THAT????? If that doesn't get to you than well I guess you're not human!!! Do yourself and your family a favor ...CALL!!!!", "pics": null, "resp": {"time": 1564751705483, "text": "Thank you so much!  I really enjoyed helping you and getting to know you.  Please stay in touch."}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "107204939078542587198", "name": "andre epps", "time": 1529000061091, "rating": 5.0, "text": "Ms. Renee was very helpful and was always there when I had a question. She responded to all of my messages and calls at a timely manner and made me feel good about my situation. She’s definitely great at what she does and I will recommend her to anyone. She helped me with my workers comp case and got me what was deserved for my injury!!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "103585911960923836396", "name": "April Fairey", "time": 1531587255519, "rating": 5.0, "text": "Renee did an excellent job with my case. I had a favorable outcome despite odds being against me. Renee is not only professional, she is also kind and caring. I would recommend her highly to my friends and family and also to you! I’m", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "105217891443149571582", "name": "Ryan Kelley", "time": 1539722299369, "rating": 5.0, "text": "I was in need of an attorney for a family legal issue and was referred to Renee Thirty and I couldn't have been happier.  Her constant dedication and expertise was beyond compare.  She treated me like family and I can honestly say I really felt as such.  If you need an attorney, Renee Thiry is the only real choice!  I highly recommend it.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "111203445633285313642", "name": "Ashlee", "time": 1527686575945, "rating": 5.0, "text": "This is Tony Luna, I don’t know how to get my daughter off my profile, or make my profile the default so this post is in my name, but I do know one thing, Renée did a great job at explaining everything in a way I could understand!  Her team stayed on top of everything and the result was better than expected. I would definitely recommend her to all my friends and family!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "102017791676510131625", "name": "Tara McAdams-May", "time": 1537454141823, "rating": 5.0, "text": "Renee has been my attorney over the last decade helping me not only with business legal matters but also family law during a woman’s toughest fight divorce/custody. Over the years I’ve had the pleasure of referring multiple happy clients to Renee Thiry and the amount of compassion and dedication she gives to those she serves truly is insurmountable for me to accurately describe. Hire her.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "103764089871050264937", "name": "CharlesBaggett Baggett", "time": 1569619544250, "rating": 5.0, "text": "Renee Thiry is awesome, her and her staff helped me get back on track and every time I needed them they were there", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "109654840052794811456", "name": "blake holmes", "time": 1554236890903, "rating": 5.0, "text": "Great lawyer haven’t even been to court yet but I searched everywhere in mobile for a lawyer to take my custody case that was in less than a week of the day I called ( I did not have the money to pay in full) so no one would take my case but when I called her she told me to come in and from the moment I walked through the door she did nothing but help very sweet and took my case with less then a week notice, and worked with me on my financial situation. Would highly reccomend.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "110164630945882451099", "name": "george metzger", "time": 1531499424276, "rating": 5.0, "text": "Renee has been my personal attorney for the past 8 years. I only wish I had known about Renee's honest and caring style sooner. Renee was able to solve a child custody issue for me in less than 60 days that another lawyer had told me was \"unless you want to open your wallet some more, that is just the way it is\" after speeding over $15,000 with him.\nRenee has always returned my phone calls and emails. I just referred Renee to a friend of mine and my friend could not be happier with the final results of the case.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "114714096987471409453", "name": "Husband", "time": 1531849218154, "rating": 5.0, "text": "Great experience all around.  Professionalism was definitely present when dealing with any aspect of the firm.  Very important to me knowing I can turn to them with any future needs.  Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "117571333916723701589", "name": "Mike McLarty", "time": 1493224375368, "rating": 5.0, "text": "After a lifetime of hard work in blue collar jobs I was suddenly laid off due to my heart going bad. I found myself unemployed and, sadly, unemployable at the age of 44 and with four children, one of which is severely disabled and will require lifetime care.\n\nMs. Thiry had helped a friend get her Disability Benefits and me, not knowing anything about how to find a lawyer for myself, contacted Ms. Thiry to discuss my case.\n\nI was totally lost, despondent. I felt like my life was over. The shame of not being able to provide for my family was crippling. I began to look into how my family would be provided for if I passed. It was bad.\n\nFrom the onset Renee was very compassionate and beyond helpful, as was her entire staff. Anytime I had a question it was answered quickly. She explained the process to me, was honest about the time it would take, and the difficulties of my case because of my age.\n\nLooking back, I think it was her hope and encouragement that sustained me, because I had none of my own.\n\nI was awarded Full Disability, and my back pay was set six entire months before I thought it would be. I don't know how that happened, but I am grateful to Ms. Thiry for making it so.\n\nI have my life back now and, with whatever time I have left I can concentrate on making quality memories with my children. That would not be the case if not for Ms. Thiry's considerable attention to my claim and the dedication of her staff.\n\nI consider her a family friend now and highly recommend her. Were it not for her keen legal mind, good heart, and professionalism I have no idea where I would be now, or if I even would be.\n\nFrom the bottom of my (malfunctioning) heart, thank you Renee Thiry. You were my angel when me and my family needed one the most.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "109412114361726401928", "name": "Delores Nelson", "time": 1552146111964, "rating": 5.0, "text": "When I came to Renee I had been with another lawyer for about 6 montha . He told methere was nothing he could do and I lost my case. She help me get a nice settlement and she is working on something now for me that is working out in my favour. Renee is very professional and always concerned about your well being. I am so thankful that I found her.. I highly recommended her to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "101199011603160552488", "name": "Kelsey Carpenter", "time": 1531498121868, "rating": 5.0, "text": "Renee is an amazing attorney. She loves her clients as if they are family. 10/10 recommend her for all your needs!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "102629709342514150260", "name": "Nikki Baldwin", "time": 1539536298961, "rating": 5.0, "text": "Dear Mrs. Thiry,\nThank you! I was very pleased with your professionalism, & how you took care of me. This lady is one of BEST attorneys in Mobile.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "113664408998255260760", "name": "Kimberly Wright", "time": 1493176285181, "rating": 5.0, "text": "Renee Thiry has been my personal attorney for the last five years. She has helped me with several debt junk buyer cases that she has all won in court. I have also sent dozens of friends and family to Mrs. Thiry for SSI and Social Security Disability and also divorce and custody issues. The staff is pleasant and knowledgeable and the office has a friendly feel that makes you feel welcome.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "101142678827197080222", "name": "Darlene Davis", "time": 1595152835042, "rating": 4.0, "text": "Legal assistant answered some questions when lawyers wasn't available.", "pics": null, "resp": {"time": 1595250639385, "text": "Thanks for the review.  Call us back if you need anything."}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "109905436461036982964", "name": "Sonya Clemens", "time": 1560883219889, "rating": 5.0, "text": "Hands down the best !!!!!  Don't waste your time with anyone else.  If you want someone that knows what they're doing and will get results...call her today !!!!!!", "pics": null, "resp": {"time": 1560884308653, "text": "Thanks!  I enjoyed helping you and your husband and enjoyed getting to know you both.  Great people!"}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "104431148404793971879", "name": "Tamika Pharr", "time": 1537209977022, "rating": 5.0, "text": "Ms. Renee She did what needed to be done for me, an blessed me also during the process....\nShe is the sweetest person every", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "105763243938383735092", "name": "Beth Howard", "time": 1534269214903, "rating": 5.0, "text": "I had a couple cases and all were handled by Renee. Disability gave me a hard time and she took time to go to the office with me and get it changed and taken care of.  I'm very glad I chose to let Renee handle my cases. She is also handling my daughters case.  It has been a difficult past couple of years but Renee has helped me through it.  Thank you so much for everything you have done.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "100104917712104627531", "name": "Air Tree", "time": 1495464804780, "rating": 5.0, "text": "I have been a customer with the Thiry law firm for years. Anytime I have a question or need some advice they're always there! No matter what I'm going through, I know who to call and who will always be there . Thank you so very much Renee for being the best lawyer anyone could ask for!!!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "116114004974131620645", "name": "Jessica Hawkins", "time": 1538492454894, "rating": 5.0, "text": "She is handle workcomp  case for me and I will highly recommend her to someone with any case.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "105817616608126382908", "name": "Stephen Jerkins", "time": 1531494975107, "rating": 5.0, "text": "Renee has been my personal attorney for years and her father before her! I highly recommend her firm for any legal needs!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "114383199042268925894", "name": "Tanisha Marshall", "time": 1543988938761, "rating": 5.0, "text": "Awesome Lawyers....Well Pleased with services I have received...😉😊", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "108598748307429199283", "name": "Melvina Gamble", "time": 1505165184227, "rating": 5.0, "text": "I like to send a great big thank you to ms.Thiry for helping me out on my case..she worked and dedicated herself to my case.she moved pretty fast i highly recommend her to any one searching for a great attorney", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "102836594203441318797", "name": "Renee Thiry", "time": 1531492019428, "rating": 5.0, "text": "Renee is very dedicated to her clients and staff. She does everything she can for everyone.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "116730606375283016173", "name": "Ashley Cooper", "time": 1531856514167, "rating": 5.0, "text": "Great attorney, very caring and professional got our workmans comp case taken care of quickly would recomend to anyone who needs an attorney", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "100638620690358123903", "name": "Alicia Townsend", "time": 1537992692142, "rating": 5.0, "text": "I don’t usually write reviews but I have to in this case. I needed an lawyer back in November 2010 after I was involved in a car accident on my job. I found THIRY & CADDELL, LLP on the internet on a Saturday night.  They actually reach out to me that Sunday morning. I had a face to face meeting with Mr. Richard Thiry the following Monday. Mr. Richard went above and beyond my expectations. He was very passionate about his clients and it shows in his work and spirit. The legal process was easy and stress free, I was very informed throughout the whole process by Mr. Richard and his team, and I felt at ease asking any questions I had. Richard Thiry was very diligent and got me a settlement quickly. Fast forwarding on June 14,2018 I was again involved in another car accident on the job after only been employed 2 days. I immediately reach out to THIRY & CADDELL, LLP. Mr. Richard no longer practice law because he had retired but his daughter Renee Thiry also is a lawyer there.  First, I'd like to say THANK YOU to Renee Thiry and the staff. They are very professional, personable and very helpful team.  Renee always keeps her word and came through for me when I needed her most. I hired Renee for my workers comp and personal injury suit.  Renee always made me feel that she had things under control and was on top of the case. My job terminate me after 7 months because of permeant injury due to the car accident. She help me get my unemployment to help me out until my case was settle. As a single mom with two kids it help out A LOT. My workers comp case has now been settled and i am so relieved and will be forever grateful. I know that she is also going to do a great job with my personal injury case as well. I honestly don't know what I would do without them. If you want the best then you definitely want to hire Renee Thiry.  I cannot thank her enough for all she is doing for me. I don't believe any lawyer could have done any better, that's why I truly believe they are the Best!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "115184740921632919059", "name": "Woody Myers", "time": 1494931394470, "rating": 5.0, "text": "Ms Thiry and the staff helped me beyond measure. My injurys put me out of work, they cut the red tape. Got Work Comp to pay me, got me the advanced treatment I needed and kept the stress down. And they helped me when the TV lawyers wouldn't take my case. Top notch!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "104275710383541774388", "name": "John R Duggar", "time": 1493168490830, "rating": 5.0, "text": "I usually don't post things on the web but I would like to tell you about my experience today. My family has been customers of Thiry & Caddell for years. Hank Caddell is currently helping us with my Grandparents estate and was just a gem today. Not to mention Richard and Renee's help over the past, never mind, it's really to many years to mention!", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "117135481811155787974", "name": "Ebony Tunstall", "time": 1522781166743, "rating": 5.0, "text": "Renee was very helpful with me in my case and I was very pleased with the outcome of my case would recommend her to anyone", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "108304008531876639386", "name": "Trevor McGill", "time": 1531491182992, "rating": 5.0, "text": "Every person who works in this firm treats you like family. It’s very welcoming and they will do everything in their power to ensure you win your case.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "103600486439377557599", "name": "Teresa Johnson", "time": 1575378685867, "rating": 5.0, "text": "Awesome law firm", "pics": null, "resp": {"time": 1575396281552, "text": "Thanks.  I have enjoyed helping your family."}, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "112273621348170014680", "name": "Harlin Gladem", "time": 1531756833126, "rating": 5.0, "text": "I absolutely LOVE Renee Thiry! She takes the time to listen and helps with every detail that comes along.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "100770002686972296558", "name": "Jarvis Tunstall", "time": 1493754961664, "rating": 4.0, "text": "Hire her. Shell get the job done.", "pics": null, "resp": null, "gmap_id": "0x889a4e0ca3cc162f:0x4a8dd40058aae01e"}
{"user_id": "112184667197473743101", "name": "Pamela Ferguson", "time": 1617658393822, "rating": 3.0, "text": "He is grouchy", "pics": null, "resp": null, "gmap_id": "0x8861d7d34dab5ed3:0xcc2643a4ebcfaa29"}
{"user_id": "105323925382603092733", "name": "Stephenn Will Hamm", "time": 1507786325285, "rating": 5.0, "text": "PROFESSIONAL AND SINCERLY CARING ATTORNEYS A RARE COMBINATION.", "pics": null, "resp": null, "gmap_id": "0x8861d7d34dab5ed3:0xcc2643a4ebcfaa29"}
{"user_id": "103549972757114519055", "name": "D Man", "time": 1544280764518, "rating": 5.0, "text": "Good ATTORNEYS", "pics": null, "resp": null, "gmap_id": "0x8861d7d34dab5ed3:0xcc2643a4ebcfaa29"}
{"user_id": "109294345574201031499", "name": "Tommy Blansit", "time": 1550869868794, "rating": 5.0, "text": "Won the case", "pics": null, "resp": null, "gmap_id": "0x8861d7d34dab5ed3:0xcc2643a4ebcfaa29"}
{"user_id": "115044474494045170121", "name": "Charles Dean", "time": 1522621962502, "rating": 4.0, "text": "Great help!!", "pics": null, "resp": null, "gmap_id": "0x8861d7d34dab5ed3:0xcc2643a4ebcfaa29"}
{"user_id": "104598349455747143663", "name": "Porkchopranch", "time": 1555369993236, "rating": 5.0, "text": "Good helpful folks", "pics": null, "resp": null, "gmap_id": "0x8861d7d34dab5ed3:0xcc2643a4ebcfaa29"}
{"user_id": "109327672206404821508", "name": "Ron Troxtel", "time": 1499863327863, "rating": 4.0, "text": "Very good people", "pics": null, "resp": null, "gmap_id": "0x8861d7d34dab5ed3:0xcc2643a4ebcfaa29"}
{"user_id": "103422731649240496676", "name": "Donna Dew", "time": 1613868510695, "rating": 5.0, "text": "Professional, and reliable.  They don't mind you calling them anytime and they are all straightforward.   I would highly recommend any attorney with this firm.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "117106067095096920217", "name": "Natalie Schibell, MPH", "time": 1564877685609, "rating": 1.0, "text": "I would give no stars if I could as I have made three calls over the course of two weeks seeking representation without a response. The answering service used is either not recording messages or the attorneys are being selective. I realize my matter is a small one; however, a return phone call within a reasonable amount of time is the bare minimum expectation this firm could not meet. I have worked in a prominent law firm for nearly a decade and know the value of customer service with every client, both large matters and small. I unfortunately cannot use that law firm as I moved a great distance away. Parkman and White, please return your phone calls, whether you can take the case or not. No firm is too big or an attorney too important to make a courtesy return call or email, at a minimum. You can even have your staff perform the task for you. This way a potential client cannot waste additional time and effort and can call someone else who cares enough to provide the service.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "111156296796968826477", "name": "Ryan Blanch", "time": 1546987508231, "rating": 5.0, "text": "We’ve litigated and tried several major cases together.  What a team.  These guys are simply awesome.  Jim Parkman captivates juries and judges alike with his humor and courtroom presence. Will White’s no-nonsense cutting cross examinations destroy government witnesses.  No one I’d rather go to trial with.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "106165058868512638419", "name": "jonny harvell", "time": 1396642946579, "rating": 5.0, "text": "To describe the ability of these men in their element is nearly impossible. I could not imagine a better team of attorney's to handle any civil, state or federal case. The honesty and determination showed during my case was, in one word, \"AMAZING!\" The experience and expertise displayed inside and outside the courtroom was outstanding. These guys are professionals on every level. If you are reading this and have a loved one in need of an attorney or need one yourself, Parkman & White is where your research should end!", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "114035976289212752360", "name": "Victor Revill", "time": 1522376972046, "rating": 5.0, "text": "These are outstanding attorneys at this firm!!!   I was wrongfully arrested and charged in Blount County.  Attorney Clayton Tartt represented me and he did an AMAZING JOB.  He was prepared, professional, persistent, caring, compassionate, and an outstanding litigator!!! I am a Criminal Defense lawyer that was charged with a crime. I went to Clayton.  If a Criminal Defense lawyer chooses a Criminal Defense lawyer, then he will only choose the best.  I chose Clayton because I knew he cared about his clients and I knew he would be willing to fight. He fought to get me acquitted and I am forever grateful!!!  Trust me, Clayton is an outstanding attorney!!!", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "114179602382429607670", "name": "Jenn Carroll", "time": 1505733591701, "rating": 5.0, "text": "By far the best!  William White and Jim Parkman are amazing at what they do. Anyone that ever asks me about a lawyer, I would refer them to Parkman and White, LLC. Best decision I have ever made.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "105896313030068805818", "name": "Mike R", "time": 1544203239922, "rating": 1.0, "text": "Mr. Parkman charged me tens of thousands of dollars.  I am convinced that he deliberately undermined my case. I had to hire another attorney to defend my case. I found Mr. Parkman to be insufferable,  highly inflammatory, arrogant and strikingly incompetent.  I really like William White.  He deserves a medal of honor for tolerating Jim Parkman.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "100546642756578913720", "name": "Krystal Dixon", "time": 1424197208723, "rating": 5.0, "text": "We hired Parkman and White after my husband was accused of a crime that could have landed him in jail for many years. He had done nothing wrong and unfortunately in our world of technology a computer virus was almost our undoing. We were told that if we wanted the best we should hire Parkman and White. We met Jim Parkman face to face a couple of times and though I did not have the pleasure of meeting William White, I had numerous phone conversations with him. They worked diligently to clear my husband's name. It took almost two years but the night before we were to go to court Mr. White called to inform us that all charges had been dropped. They fought to prove his innocence and I am so thankful that we were sent their way. Mr. Parkman and Mr. White definitely lived up to their reputation of being the best. If you have a legal issue I would highly recommend you get in touch with their law firm.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "118421791758961523093", "name": "S Cole", "time": 1389135539421, "rating": 5.0, "text": "When the stakes are the highest, and your personal reputation, recieving professional, educated, tanacious and agressive defence are of paramount importance . Parkman and White are the ONLY law firm to TRUST and RELY on.  William White and his team assisted me in a time of great legal need with my reputation, financial security, and potential criminal charges against myself. William White was tenacious, exposed the truth and my case was dropped in a Grand Jury Investigation.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "109234907529080186731", "name": "Amanda Griffin", "time": 1527468335058, "rating": 5.0, "text": "Best attorneys in the southeast.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "105250244298431966835", "name": "Roderick Covington", "time": 1436988398230, "rating": 5.0, "text": "During a time when I sought justice and it was nowhere to be found, I found Parkman and White.  And trust me, they helped me find justice.   At the end of my trial, justice prevailed and I was found not guilty on two counts of charges which ended my career.  If you are looking for justice, if you are looking to make a wrong right, look no further than Parkman and White.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "100545436300754474026", "name": "Clark Thompson", "time": 1422991621951, "rating": 2.0, "text": "Firm was unable to help with my case.  May have been isolated to my situation though.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "115688964345782374995", "name": "heath wright", "time": 1615988272038, "rating": 1.0, "text": "I LOST money by retaining Lindsey Simmons. She didn’t even increase my WC settlement for as much as she charged in fees. However, she was kind enough to send someone to intercept my settlement check on the day of court so she could get paid first.\nBAD EXPERIENCE ☹️☹️☹️", "pics": null, "resp": null, "gmap_id": "0x8889179814ed4fe9:0xa8b3e661cf8e4531"}
{"user_id": "104821561651341518868", "name": "Taylor Hayes", "time": 1575994291901, "rating": 1.0, "text": "Spent 4 hours with Larry, he gave me a game plan, fed me tons of false hope, told me I have a great case, got extremely excited, signed papers with me, and said he'd represent me. Told me to keep living my life and he had everything under control. Didn't respond to phone calls and emails for a month. Then sent me a letter saying they wouldn't represent me in any of my cases but recommended I file with the EEOC and seek further legal counsel elsewhere but gave me no recommendations. I feel like I was enthusiastically lied to and now I'm at square one. Makes no sense. Very unprofessional.", "pics": null, "resp": null, "gmap_id": "0x8889179814ed4fe9:0xa8b3e661cf8e4531"}
{"user_id": "104754238100313209315", "name": "Ada Alabama", "time": 1547784068238, "rating": 1.0, "text": "Run as fast as you can away from this law firm.   If you are using them fire them right away.  They do not understand what it  is like to live in constant pain from an injury.  They are not aggressive but are the biggest wimps when it comes to standing up for their clients.   Once you are away from them you will find out all of the things they did not bother to find out or perhaps purposely did not tell you.   Again, they will not stand up for you.   Find a better law firm.  They are useless when you need them the most.", "pics": null, "resp": null, "gmap_id": "0x8889179814ed4fe9:0xa8b3e661cf8e4531"}
{"user_id": "102932560093225843725", "name": "Christopher Calvin Reid", "time": 1523544004142, "rating": 5.0, "text": "Alex is the best Attorney in his field. He is a genius in the courtroom and he finds a way to win when other attorney's call it a day. He was an excellent Attorney back in law school and has only improved! #reidlawalabama fully and completely endorses him. Anyone who would give him less than 5 stars has no clue what they are talking about.", "pics": null, "resp": null, "gmap_id": "0x8889179814ed4fe9:0xa8b3e661cf8e4531"}
{"user_id": "100913928216304870316", "name": "Donald Wise", "time": 1578979166888, "rating": 1.0, "text": "I had hired them I have left 15 messages no return calls totally disrespectful people", "pics": null, "resp": null, "gmap_id": "0x8889179814ed4fe9:0xa8b3e661cf8e4531"}
{"user_id": "103093421134046720055", "name": "Janey Whitney", "time": 1523595751937, "rating": 5.0, "text": "Love King Simmons, P.C.! This is a great and trustworthy firm. Alex Ealy does great work!", "pics": null, "resp": null, "gmap_id": "0x8889179814ed4fe9:0xa8b3e661cf8e4531"}
{"user_id": "107470153095142478972", "name": "Dowdell Dowdell", "time": 1478473609845, "rating": 5.0, "text": "They love people not color treated me like family...", "pics": null, "resp": null, "gmap_id": "0x8889179814ed4fe9:0xa8b3e661cf8e4531"}
{"user_id": "102801205968130077081", "name": "Mary Amerson", "time": 1583728788636, "rating": 5.0, "text": "Friendly", "pics": null, "resp": null, "gmap_id": "0x8889179814ed4fe9:0xa8b3e661cf8e4531"}
