{"user_id": "118191943825514412064", "name": "Jared King", "time": 1611689920013, "rating": 5.0, "text": "As a small business owner, there are times when your vendors are more of a headache than actually helpful. Well, the team at ESS do not carry themselves in that manner. From the first call, through the follow up, they were extremely helpful. I worked with Miquel and he was quick to work me through the entire process. I highly recommend them, and will make sure to use them in the future!", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "107509513238098696800", "name": "Ryan Hand", "time": 1481855412535, "rating": 5.0, "text": "Extremely professional and very efficient. Building isn't marked very clearly but it is easy enough to find. I will be using their services for my business employment screening and compliance needs.", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "117879196677154575643", "name": "Hugh Bailey", "time": 1441690120475, "rating": 5.0, "text": "I had to go here for a TWIC card that my employer required. My appointment was for right when they opened but I got there almost 30min early. As soon as the first person was there they said they could get me in early. The facility was very clean, well furnished, everyone dressed and spoke very professionally and the front desk associate was extremely attentive. I was greeted (not called back) in the waiting room by the lady did did my application. She was quick, courteous and to the point. When we were done she escorted me out. The card was in my hands in just a few days. I was very impressed with the entire experience.", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "112974112117612835839", "name": "Heather Meeks", "time": 1418746825575, "rating": 1.0, "text": "This place is SO awful.  Do not use them!  I was forced to use them because the college program that I am in requires background checks and urine drug tests for admission and they use ESS.  First of all it is day 12 and they do not have my background check back!  I have called their customer service multiple times and each day they tell me \"it will be back today\" or contradict themselves by saying \"we have to make sure the information is correct.\"  Finally, an employee of the college department had to call them and guess what the hold up is...they needed confirmation on my middle name.  You think you could have asked me that one of the SIX times I called you?!  Also, another classmate had been waiting 7 days for a drug test to come back-the school had to call them only to find out that they neglected to send it.  And we got to spend $72.00 for this lovely \"service.\"  The school (who is a huge client of theirs obviously) is extremely irritated with them as well and I wouldn't be surprised if they go with a different provider in the future.  EISI is also in the Birmingham area and does the same service nationwide and will do it cheaper (like 50% cheaper) and quicker.  DO NOT WASTE YOUR MONEY ON THIS PLACE.", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "118248946522021696637", "name": "B C", "time": 1491399272303, "rating": 1.0, "text": "UNETHICAL AND GREEDY. This company scams and over-charges their customers. Companies and individuals should STAY AWAY from this company.\nI had a background check performed for myself and employee. ESS decided to search the middle name and last name of myself and my employee in an effort to make more money.\nThis search was not justified and, as expected, no records came up in a middle name/last name search for myself or my employee.\nThen, I receive an invoice (already charged to my credit card) for 5 total name searches.\nSearching for aliases is understandable and I would not object to this, but they arbitrarily decided to perform unnecessary name searches and charge us for them.\nI have had background checks for myself and employee performed 3 years ago for the same program, and the other company did not unnecessarily search for middle name/last name because they knew that it was unethical.\nI can not stress this enough, STAY AWAY from ESS! They WILL scam you.", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "114135229758172020977", "name": "Michael Justin", "time": 1464486276194, "rating": 5.0, "text": "Good people that run the place. For having to go and give a urine test they were very friendly", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "110428646061924796491", "name": "iL LEUMAS", "time": 1510274757297, "rating": 5.0, "text": "Speedy & friendly place to pee in a cup.", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "115363498306726153289", "name": "Face Ya dig", "time": 1488669557260, "rating": 4.0, "text": "Quick amd friendly service.", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "107466669449025185301", "name": "Jay Jay", "time": 1488080762143, "rating": 1.0, "text": "The girl at the front desk have a very nasty attitude!", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "111793597607092462334", "name": "Michael Shabani", "time": 1485404926572, "rating": 4.0, "text": "Very busy place", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "109994998120876342093", "name": "Andrea", "time": 1496579803448, "rating": 4.0, "text": "In and out.", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "111160761935169011529", "name": "allen holmes", "time": 1415247530405, "rating": 5.0, "text": "great service", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
