{"user_id": "106263325186558312890", "name": "C Mzgemini", "time": 1624935710804, "rating": 1.0, "text": "Went in did the interview and still have not heard a ring on my phone from this company.  Quick to take my social security and I.D.  but heard not a single word.  That has been in three weeks now.", "pics": null, "resp": {"time": 1624995995798, "text": "Hi C! Thank you for sharing about your experience with Elwood Staffing. We have not been able to reach you to discuss your situation. Please reach out to us at 833.402.8521. Thank you!"}, "gmap_id": "0x889a4d086c954f01:0x268956b923d32751"}
{"user_id": "103741910769925651747", "name": "Backend Southen", "time": 1624977509441, "rating": 5.0, "text": "I worked for Walmart distribution I was a u loader a very good worker and I worked for the hospital cleaning up", "pics": null, "resp": {"time": 1624995789750, "text": "Thank you for the kind review. We are glad you had a good hiring experience with Elwood Staffing in Mobile. Please let us know if we can be of further help to you."}, "gmap_id": "0x889a4d086c954f01:0x268956b923d32751"}
{"user_id": "100659747794705588809", "name": "antonio childs", "time": 1616014444224, "rating": 5.0, "text": "They do a wonderful job with me keep me working, I am a forklift operator and they always have a job for me.. Thanks a lot Elwood staffing..", "pics": null, "resp": {"time": 1616078572645, "text": "Thank you for your dedication to Elwood Staffing. We are always happy to help you."}, "gmap_id": "0x889a4d086c954f01:0x268956b923d32751"}
{"user_id": "108367614730270186590", "name": "Joseph Rudnicky", "time": 1585321797163, "rating": 1.0, "text": "This place just collects resume.  I have experience in forklift and warehouse.  I sent my resume and was told call u in a few weeks. This place is a joke i need a job today not in a few weeks.", "pics": null, "resp": {"time": 1589471386405, "text": "Hi Joseph, if you would like to speak with a representative about your experience, please reach out to our Associate Engagement team at 833.402.8521."}, "gmap_id": "0x889a4d086c954f01:0x268956b923d32751"}
{"user_id": "106217902403167589198", "name": "Thomas Beck", "time": 1526030803829, "rating": 4.0, "text": "I would give them 5 stars but that would mean they have nothing to work toward so I'm going to give them some lead 😉👍. When I first applied I wasn't really looking for a job I was just curious being a security officer but as soon as I filled out the application they put me to work right away for a much safer company. The staff is excellent and very helpful. I would recommend Elwood Staffing to everyone.", "pics": null, "resp": null, "gmap_id": "0x889a4d086c954f01:0x268956b923d32751"}
{"user_id": "118012377691072455504", "name": "Tim Croley", "time": 1561339560335, "rating": 5.0, "text": "Great staff! Very upbeat environment. Definitely great resource for employers and those seeking employment!", "pics": null, "resp": {"time": 1561477190240, "text": "Tim, Thank you for sharing your feedback. We are glad we could be of help to you. Please let us know if there's anything more we can do to be of help to you."}, "gmap_id": "0x889a4d086c954f01:0x268956b923d32751"}
{"user_id": "101360121533728660020", "name": "TheHead 32", "time": 1561765433174, "rating": 5.0, "text": "Been working with them for about a month and they sent me to a wonderful job .I had applied with almost every temp service in mobile but they had the perfect job.The staff is also very helpful with answering questions", "pics": null, "resp": {"time": 1561994818244, "text": "James, Thank you for sharing your feedback. We are happy to help. Let us know if you have any questions or concerns."}, "gmap_id": "0x889a4d086c954f01:0x268956b923d32751"}
{"user_id": "104904165409552758570", "name": "Brittany Cook", "time": 1546032528245, "rating": 1.0, "text": "Terrible staffing agency. I would give zero stars if possible.\nUpdate: It's amazing how fast you could respond to a bad review, but won't answer or return my calls OR emails from my supervisor.", "pics": null, "resp": {"time": 1546015249029, "text": "Hi Brittany.  I'm sorry you had such a negative experience.  If you would like to discuss this in more detail, please call the Associate Engagement team at 812-348-6201."}, "gmap_id": "0x889a4d086c954f01:0x268956b923d32751"}
{"user_id": "118238771869062662819", "name": "Amanda Souza", "time": 1500864489915, "rating": 5.0, "text": "Great company, will get you to work asap!", "pics": null, "resp": null, "gmap_id": "0x889a4d086c954f01:0x268956b923d32751"}
{"user_id": "106254047972663427842", "name": "Jamie And Simora", "time": 1543861873019, "rating": 1.0, "text": "I been with this company going on 3 years never gotten a job call , everytime I go up there they be in a rush to send me out when I call to check on my job applications they tell me that I do not have to continue to call to check on my applications they will call me  if I call they will take my application down but still no calls from them my same number has been on file since 2016 they are not HELPFUL at all  I go up there to update my work history still nothing it’s very sad they don’t even deserve a star", "pics": null, "resp": {"time": 1543866724251, "text": "Hi there, We would love to research this and give you a better reason. Please reach out to our Associate Engagement team at 812.418.0962."}, "gmap_id": "0x889a4d086c954f01:0x268956b923d32751"}
{"user_id": "117210391057873837042", "name": "Alisa Whiteside", "time": 1473133768899, "rating": 1.0, "text": "Why is this listed when there is no office showing up in the Job search for Mobile???", "pics": null, "resp": null, "gmap_id": "0x889a4d086c954f01:0x268956b923d32751"}
{"user_id": "107009701955300988530", "name": "Amarie McGhee", "time": 1622518352132, "rating": 5.0, "text": "Love my job and the company I'm assigned to work for. Great learning experience and the staff is professional and friendly.", "pics": null, "resp": {"time": 1623335331758, "text": "Amarie, We are glad you we could help you find a job you love. We work with great companies in Montgomery. We were glad to help you with your job search."}, "gmap_id": "0x888c2be5a841c577:0x921be50c0d6aa380"}
{"user_id": "105560736624511473167", "name": "Justin Smith", "time": 1583249760463, "rating": 5.0, "text": "I came to el wood hoping they could change my life.. They did just that their staff was so kind helpful and exactly how i needed them!.but the manager Tracy was all i could ask for shes wonderful the best that it could be..she helped me in all type if ways now i have a nice well paying job to do what i need to do so i could be great! I truly adore El wood!", "pics": null, "resp": {"time": 1583329311977, "text": "Justin, Thank you for the review. We are glad Tracy was able to help you. We hope you continue to be happy with the service we provide. Please feel free to reach out to us."}, "gmap_id": "0x888c2be5a841c577:0x921be50c0d6aa380"}
{"user_id": "117347949511267695020", "name": "Darrel Whisenhunt", "time": 1612804565376, "rating": 1.0, "text": "Company does not do anything they say Company not for the people", "pics": null, "resp": {"time": 1612882390740, "text": "Thank you for taking the time to let us know about your experience with us. Our Associate Engagement team would like to speak with you to find out more about this experience. Please call or text them at 833.402.8521."}, "gmap_id": "0x888c2be5a841c577:0x921be50c0d6aa380"}
{"user_id": "116472803676627820399", "name": "summer smith", "time": 1583530080975, "rating": 5.0, "text": "The staff at Elwood Staffing is SUPER friendly and GENUINELY cares about their employees.I would recommend this agency to anyone who is looking for a place of employment!", "pics": null, "resp": {"time": 1583759531343, "text": "Summer- We love hearing this. Our staff works hard to help everyone. We are glad you had a good experience. Please reach out to us if we can be of further help to you."}, "gmap_id": "0x888c2be5a841c577:0x921be50c0d6aa380"}
{"user_id": "107493890597331068372", "name": "Neenah Thornton", "time": 1574283844732, "rating": 5.0, "text": "I have worked with elwood staffing in 3 different states. They are truly one of thee best temp agencies i have ever went through.\nThey have never given me any issues always able to find work, on top of that they always had my paperwork ready even in different states. Very professional and i just want to thank elwood for all the work they do.", "pics": null, "resp": {"time": 1574279807632, "text": "Neenah, Thank you for this awesome review. We are glad we have locations all over the US to help you with your job search. We look forward to seeing you again."}, "gmap_id": "0x888c2be5a841c577:0x921be50c0d6aa380"}
{"user_id": "102749219368929734094", "name": "Chris Deris", "time": 1573879431298, "rating": 5.0, "text": "I applied at Elwood Staffing and it was a smooth process and Mrs. Sandy was really fast, helpful, and nice. She got me straightened out and got a job for me in no time flat!", "pics": null, "resp": {"time": 1574102436131, "text": "Chris, Thank you for the review. We appreciate you picking Elwood to help you find the perfect job. Please let us know if there's anything we can do to be of further help."}, "gmap_id": "0x888c2be5a841c577:0x921be50c0d6aa380"}
{"user_id": "117775842105008004736", "name": "N Timms", "time": 1568936026133, "rating": 1.0, "text": "Sandy is horrible at Elwood staffing in Montgomery, AL!  Unprofessionalism  at it’s best.", "pics": null, "resp": {"time": 1568985771364, "text": "We are sorry you didn't have a great experience with us.  We would like to speak with you about the situation so we can understand the issue you experienced.  Please reach out to our Associate Engagement team at 812.657.0807."}, "gmap_id": "0x888c2be5a841c577:0x921be50c0d6aa380"}
{"user_id": "118013444707362326256", "name": "DShay T", "time": 1560428574988, "rating": 5.0, "text": "The best staffing company in Montgomery Alabama.", "pics": null, "resp": {"time": 1560429771560, "text": "DSHAy- Thank you for the 5 star review. We love it. Let us know if there's anything we can do to be of help."}, "gmap_id": "0x888c2be5a841c577:0x921be50c0d6aa380"}
{"user_id": "105787343773955050110", "name": "Project Hexx", "time": 1557958888796, "rating": 2.0, "text": "Weeks and weeks passing after signing up. No job assignments. PeopleReady has locations Nationwide including Canada is the place to seek work!", "pics": null, "resp": null, "gmap_id": "0x888c2be5a841c577:0x921be50c0d6aa380"}
{"user_id": "103376551915614114553", "name": "xlovely 27", "time": 1534517241703, "rating": 1.0, "text": "Do not go through this company They are phony people. My husband was told he was getting a job and they were waiting on the other company to send some stuff over. Well that wasn’t the case the company sent everything over and they put my husband as a no show no call when he was told not to go in by Elwood staffing thank god the other company knew Elwood was not a great staffing company sense most places say their employees are no show no call ( but it’s really the staff at this company who can’t make the foot work to get the people the job ). He got the job through another staffing company. There’s no excuses for this. Y’all are lazy unprofessional people. I mean I have messages from your staff that shows just how unprofessional your employees are. I will be making this public so everyone can see what Elwood staffing is doing to our hard workers who have a family to take care of as well. You put my family on hold for 2 1/2 weeks for two jobs he was suppose to get or should I say y’all said he was gonna get have proof of that as well and than blame some other company for something that was your fault!!!!!!! DO NOT WORK FOR ELWOOD STAFFING", "pics": null, "resp": {"time": 1534520227087, "text": "Hi, I believe we've spoken with your husband about this issue. We apologize to you and your family for the disappointment this issue has caused your family. The client is aware that the NCNS wasn't due to him, but he was told not to report to work to work. It's unfortunate that the situation didn't go as well as planned. This instance isn't because of lack of professionalism, but things that were out of the Elwood team's control. If you would like to speak with us further about the situation he can give us a call."}, "gmap_id": "0x888c2be5a841c577:0x921be50c0d6aa380"}
{"user_id": "113810554124353724578", "name": "Shani Jones", "time": 1507172019394, "rating": 5.0, "text": "Great people but no job for you.", "pics": null, "resp": null, "gmap_id": "0x888c2be5a841c577:0x921be50c0d6aa380"}
{"user_id": "110239063061198437124", "name": "Jayson Smitherman", "time": 1479494237171, "rating": 1.0, "text": "The jobs they represent are usually low wage manufacturing. I do not recommend.", "pics": null, "resp": null, "gmap_id": "0x888c2be5a841c577:0x921be50c0d6aa380"}
{"user_id": "114172167377945159525", "name": "Braydon McPherson", "time": 1573317148050, "rating": 5.0, "text": "Elwood Staffing in Montgomery is great!", "pics": null, "resp": {"time": 1573487315744, "text": "Braydon- Thank you for sharing your feedback. We are glad you had a good experience. Let us know if there's anything more we can do to be of help to you."}, "gmap_id": "0x888c2be5a841c577:0x921be50c0d6aa380"}
{"user_id": "117342590570251130323", "name": "Elwood Staffing", "time": 1534304427165, "rating": 5.0, "text": "Elwood Staffing has NEW jobs!", "pics": null, "resp": null, "gmap_id": "0x888c2be5a841c577:0x921be50c0d6aa380"}
{"user_id": "116401065297767004719", "name": "Neesha's Story", "time": 1600877597924, "rating": 5.0, "text": "My husband joined the Navy out of this Office a few months ago. through out the whole process they explained everything with great detail and were really nice. They also did their best with educating my husband on all the great job possibilities. Thank you everyone for helping our family!", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0x16e2f7d6364439ce"}
{"user_id": "105234535038549468751", "name": "Robert", "time": 1591640992068, "rating": 5.0, "text": "These guys were great when it came to answering my questions, they were happy to help me work with my past issues. Once signed up they had a recruiter who worked out with me so I could get in shape and also would study the stuff they wanted me to know at boot camp", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0x16e2f7d6364439ce"}
{"user_id": "108629627469512748500", "name": "Anya babb", "time": 1573653935119, "rating": 5.0, "text": "Petty Officer Johnson is the best Recruter in the world. This office has the best Recruter’s I’ve ever met. They get things done, when you have questions they will answer them at all hours of the day. They will motivate you to work out by pushing your limits to make sure you are ready.", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0x16e2f7d6364439ce"}
{"user_id": "100143805689990764541", "name": "Juan Torres", "time": 1561431105852, "rating": 5.0, "text": "These guys are the best. They were informative and really were driven in getting me the job that I wanted!! I am proud to say these guy made me a FUTURE SAILOR!!", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0x16e2f7d6364439ce"}
{"user_id": "105531187206371220361", "name": "Raheem Johnson", "time": 1537215107475, "rating": 5.0, "text": "The best Militart branch", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0x16e2f7d6364439ce"}
{"user_id": "105638159641003019809", "name": "Pat Howard", "time": 1599784759728, "rating": 1.0, "text": "I applied for a position online and uploaded my resume. I received a call to go to the nearest branch. I went to the Birmingham location and they weren't welcoming at all. I finish up things on the computer and took a urine & hair drug test. The lady doing the hair follicle test was so rude and impatient. I was told they'll contact to me with the next steps. They went ghost and I never heard from them again. I called for an update and the lady hung up the phone without responding. I believe they lied about the job being available. I see they're still reposting the job. Don't waste your time people. This location is a joke with bitter unprofessional employees.", "pics": null, "resp": {"time": 1600867571583, "text": "Thank you for sharing your feedback. If you would like to speak with a representative about your experience, please reach out to our Associate Engagement team at 833.402.8521."}, "gmap_id": "0x888918beed647e69:0x9663681a7f166652"}
{"user_id": "116954838400395159097", "name": "Starr Champale", "time": 1573913776129, "rating": 5.0, "text": "They were able to find me a job the same day I walked in!!  Brian (though swamped with incoming employees) helped me with the application process every step of the way. He was able to answer all my questions. Also, Sandra was very helpful with giving me valuable information about the place where I'd be working and additional information about the position. Everyone was very professional and willing to assist in any way. I appreciate them so much for all their help.", "pics": null, "resp": {"time": 1573241837527, "text": "Starr, Thank you for sharing your feedback. We love hearing how Brian and Sandra were able to help you with your job search. Please reach out to us if you need further assistance."}, "gmap_id": "0x888918beed647e69:0x9663681a7f166652"}
{"user_id": "101090290161843283431", "name": "Stephanie Sims", "time": 1575560209041, "rating": 4.0, "text": "Despite the numerous people waiting, experience was good. Guy at the front (think his name was Brian) was helpful and patient. They had positions that suited my skills. I would recommend to anyone.", "pics": null, "resp": {"time": 1576007176950, "text": "Stephanie, We are glad we could help you find a job that was suitable to your skills. We hope you will let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888918beed647e69:0x9663681a7f166652"}
{"user_id": "113199051443853636427", "name": "Rose Blevins", "time": 1576017929838, "rating": 5.0, "text": "The first day I walked into the staffing agency I was greeted professionally and friendly by Brian at the front desk. I inquired about employment and he gave me more information than I expected. More than any staffing agency I had been to because for some reason, they act like giving employment info is a secret and you have to be initiated first to get any help. Brian made me feel like he was actually interested in helping me find employment. The Registration process was easy. I came back the next day to complete everything because I had an appointment. I meet with other staff members Shannon and Johnny. They too were friendly, kind, and professional. Just like Brian, with them, I also felt like they genuinely wanted to help me. I haven't felt like that about a staffing agency in a VERY long time. While I was there, I also noticed the way Brian interacted and talked to other job seekers that came into the office. The same way he treated me, with respect, professionalism, care, and a positive attitude. That really won me over and stood out in my mind. I also followed up with Sandra over the phone and she displayed the same professionalism that I encountered with the other staff at Elwood. I was blown away! She was so helpful when I called. I truly recommend Elwood staffing to any job seeker that is looking for employment. They really make you feel like they care about helping you when you walk in the door. They have what other staffing agencies lack these days, GREAT customer service!", "pics": null, "resp": {"time": 1576165620557, "text": "Rose- Thank you for sharing your review about your experience with Elwood Staffing. We are so glad we could be of help to you. Please let us know if there's anything more we can do to be of help."}, "gmap_id": "0x888918beed647e69:0x9663681a7f166652"}
{"user_id": "110178948552480631258", "name": "Phinky Hampton", "time": 1575997256008, "rating": 5.0, "text": "Hey Everybody I’m Caprice. I Would Highly Recommend Going Here. I Worked With Brian. He Was So Helpful and He Stayed Ontop Of His Game To Make Sure That I Got Details With My Job Started Quickly. He Was Very Nice and Funny. Positive Attitude.", "pics": null, "resp": {"time": 1576007260833, "text": "Caprice, Thank you for sharing your feedback. We are glad Brian was able to help you get what you needed so you could start working. Let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888918beed647e69:0x9663681a7f166652"}
{"user_id": "117176008458467045603", "name": "Chris Relph", "time": 1538766400871, "rating": 5.0, "text": "Elwood Staffing gave me a great experience. They were able to provide me with a great job opportunity within a couple months meeting with them. Also, they stuck with the job categories that my skill set has the ability to thrive. I would refer more people to them in the future based on my experience.", "pics": null, "resp": {"time": 1538767244099, "text": "Chris, Thank you for the review. we are so glad we've been able to help you with your job search. Let us know if there's something we can do to be of further help to you."}, "gmap_id": "0x888918beed647e69:0x9663681a7f166652"}
{"user_id": "104558101454975801827", "name": "Christina Sale", "time": 1554227034803, "rating": 5.0, "text": "This is my first time using a temp  Agency  And everyone was super nice everyone could answer my questions Barbie was my helper she is amazing 😉 they helped me find a job quickly with no hassle I’m blesssd to know theses women there that stayed over just to help me finish the page I was on so I could pick it up later this place is amazing and super friendly", "pics": null, "resp": {"time": 1554291081989, "text": "Christina, Thank you for the kind review. We are glad you've had a good experience this far. Please let us know if there's anything more we can do to be of help to you."}, "gmap_id": "0x888918beed647e69:0x9663681a7f166652"}
{"user_id": "115003280789971429598", "name": "Willis Fikes", "time": 1612206935467, "rating": 5.0, "text": "Great Services", "pics": null, "resp": {"time": 1612275643540, "text": "Thank you, Willis!"}, "gmap_id": "0x888918beed647e69:0x9663681a7f166652"}
{"user_id": "105271188671408191180", "name": "Shenitha Littlepage", "time": 1525884352014, "rating": 5.0, "text": "Very pleasant staff they keep you working.", "pics": null, "resp": null, "gmap_id": "0x888918beed647e69:0x9663681a7f166652"}
{"user_id": "106378563077139255718", "name": "Cookie collins", "time": 1526005507248, "rating": 5.0, "text": "Got me good paying job here!", "pics": null, "resp": null, "gmap_id": "0x888918beed647e69:0x9663681a7f166652"}
{"user_id": "107415589309332022944", "name": "Beauty Smiles", "time": 1477946561552, "rating": 1.0, "text": "Its ok..but look for Robin..shes the best", "pics": null, "resp": null, "gmap_id": "0x888918beed647e69:0x9663681a7f166652"}
{"user_id": "102922859612683898354", "name": "Jay White", "time": 1467243876378, "rating": 1.0, "text": "I will not fill out another application until Robin Spear leaves.  Last year, I called to see if the Birmingham Office had \"cleaned house\" since Dan Koch had purchased Alabama Splash Adventure in January, 2014.  Robin Spear dodged the question, saying, \"we don't staff Alabama Splash Adventure.\"  No staffing service staffs ASA, as it is a theme park open only during summer months.  My guess is Ms. Spear does not get along with the Koch Family, who also own Holiday World.", "pics": null, "resp": null, "gmap_id": "0x888918beed647e69:0x9663681a7f166652"}
{"user_id": "117705184733595919156", "name": "Asya Moore", "time": 1475882057850, "rating": 5.0, "text": "They were very helpful..", "pics": null, "resp": null, "gmap_id": "0x888918beed647e69:0x9663681a7f166652"}
{"user_id": "102888117059352058730", "name": "Makeisha Gibson", "time": 1431031269421, "rating": 5.0, "text": "Good  people", "pics": null, "resp": null, "gmap_id": "0x888918beed647e69:0x9663681a7f166652"}
{"user_id": "105009069663296496987", "name": "T “Lady T” CL", "time": 1555150428060, "rating": 2.0, "text": "Had never heard of this place before until they contacted me about a position. Someone else was hired. I stopped by the office to drop off requested paperwork. She said she would keep my information on file. No follow-up or communication since then.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOinsjvrG7S1Yd1V76dHG8ba8QzcnZ3U1TWguOq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMzRmiKtylB7CTdinEazOTHbomJun4mQdTSkS3P=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPt_Zr_oRLVSG1da-b8e48i3IvHQfWyPynKjJG9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMtrnr9rmv99HtVUucNmk7HYalCootfCEsrPZ0H=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO9gfezIRSOknlwHiiUQKlyHLMK4VDsqPqLQE9K=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOeYVpG1yekGsvqe19dnUyUwkVdxsVwurEQAl-w=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOe3GNfHJXHUfIW-jmOsfqIx1hJk5zz2z64Btid=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNR10JCSCr7GStBcyXOLjEXPcnQ98CGHxSfIl6v=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMO75ZnyeGWaBmf3hu-FF_53MkxFxUks9PWD9xR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN-NtNtlpe4400ppCiAkmXGvk_OFUEWzbDYJOq4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM6H08-AnXm0Dv87xAEPCB2_ib9Ogdlstnhdf1S=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNZ2sk0M9arcYG6b1XV9n2KvVRaMtsZSUNTqxuY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNclxgbOFepzUlS1Dx78tvV4zcCKfcs3akYfSq1=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "113599126063458561745", "name": "Elaija Mason", "time": 1559302622711, "rating": 5.0, "text": "Went in one day they told me they would contact me when a job came available got the call early the next morning that they found a position got sent to interview with the hiring employer and 1 hour later I was hired! I have been to several temp agencies but this one got me in and got me out FAST and the staff are very energetic I will definitely be referring people !", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "104530235677517075897", "name": "Vernon B", "time": 1481307191984, "rating": 5.0, "text": "I've consulted with Darrell Walker Workforce many times regarding several of their employment services, including job placement, executive search, and workforce planning. On one occasion, I met with their administrative staff and recruiters in their Birmingham office. Throughout our 4 hour+ meeting, I was impressed with their attentiveness to my specific needs, eagerness and ability to answer my questions, breadth of knowledge about the staffing industry, and the years of experience they (literally) brought to the table. As an aside, they were providing temp services way back before the word \"personnel\" fell out of favor! I know I'm in good hands with Darrell Walker and will continue calling on them in the future for my staffing and payroll outsourcing needs.", "pics": null, "resp": {"time": 1481323844720, "text": "Hi Vernon! We remember that marathon meeting quite well. And we enjoyed every minute of it! One of the main reasons Darrell Walker Workforce is capable of providing relevant and beneficial employment services is because we understand the importance of listening. And the more we listen to valuable clients like yourself, the more we learn. We're definitely looking forward to our next \"discussion\". Thank you for taking time to leave a review. ~ Linda Walker Channell (President)"}, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "105177598837917596552", "name": "Nimitz 17", "time": 1572160206395, "rating": 5.0, "text": "I called in and they had me a job the next day, 5 stars all the way!", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "116894094856529757653", "name": "Shelley Belly", "time": 1409771304426, "rating": 5.0, "text": "Sheila and Meredith are very helpful and knowledgable in their field of human resources and placement.   It was a pleasure to deal with them. I have referred friends in the area to them and they have all enjoyed their experience with Darrell Walker Workforce Systems.  I would definitely recommend them to others.", "pics": null, "resp": {"time": 1481321495273, "text": "Hello Ms. Belly! Sheila and Meredith combined have over 45-years experience (and they're so young) in the staffing and recruiting industry, and Darrell Walker Workforce is grateful to have them on our team! It was a pleasure working with you as well and we REALLY appreciate your referrals. Thank you for your kind review. ~ Linda Walker Channell (President)"}, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "116123383910812557403", "name": "anthony d.", "time": 1541855764124, "rating": 5.0, "text": "I was hired by D. W. Over 2 yrs. ago and assigned a job by them in moody, al. After staying at that assigment for a couple months, I was hired on with the company full time and have been with them since then. The staff was very nice. I recommend D. W. highly as a place to get employment started. Also am making more money.", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "105933276905541719337", "name": "Len Snow", "time": 1546876171431, "rating": 1.0, "text": "I Signed Up For These People Multiple Times An They Never Found Me A Job I Call Every Monday These People Know My Name Personality An Never Found Me Nothing I Really Feel Like This Place A Waste Of Time An Just Won't You To Come In An Do Your Paperwork So They Can Get Paid", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "112974491811833007974", "name": "Humble Beginnings", "time": 1539894515015, "rating": 2.0, "text": "Only 12 hour shifts available.", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "103746775015177415026", "name": "Andrea Alston", "time": 1620317713830, "rating": 1.0, "text": "If you are in desperate need of  a job this is not the place.They are very nice and eager to find you a job in the beginning. ( at least thats what it seem like) I was very fooled by this company I was getting job offers from other companies and this company took 4 months to run a background I have worked in a few professional management settings this was beyond ridiculous.  I even went to the county where the background was stuck in . The office management was getting an attitude with me because I was calling trying to get an update.  To be clear  I did have something on my background that was over 7 years ago I was very honest and upfront with the staff. This has not ever  hinder me from obtaining a job as I have worked in management for over 2 0\nyears. I was beyond disappointed on how I was handle with the Management staff at this establishment.", "pics": null, "resp": {"time": 1620879477383, "text": "Thank you for your comment. We are so sorry to hear about your experience, and we’d like the opportunity to investigate and address your concerns. If you are willing to discuss this further, please contact our Customer Feedback team directly at 800-803-9336 or customerfeedback@roberthalf.com."}, "gmap_id": "0x8889179feec41c7d:0xe0dc48b434e7dde2"}
{"user_id": "114909064236614593006", "name": "Mur Lock", "time": 1581826795215, "rating": 1.0, "text": "Filled out all their info. Got called about a few positions. After they got  allll my information- never.heard.from.again! This seems to be a trend in these temp to hire type agencies. They must all just want to beef up their pool of candidates for businesses but the actual candidate comes last and is disregarded after they get a hold of their resume and info. I will email asking my file be deleted as they wasted my time.", "pics": null, "resp": {"time": 1582050820060, "text": "We are incredibly sorry to hear about the lack of communication you experienced at this branch. Would there be any further details that you would like for us to know? You can reach out to our quality assurance team at customerfeedback@roberthalf.com and/or 1-800-803-9336. We greatly appreciate you letting us know what happened and hope to have one more opportunity to connect with you."}, "gmap_id": "0x8889179feec41c7d:0xe0dc48b434e7dde2"}
{"user_id": "115828335009536105016", "name": "Aubree Gillis", "time": 1578596589476, "rating": 5.0, "text": "The best staffing agency ever, they changed my life.", "pics": null, "resp": {"time": 1579029538778, "text": "Thank you, Aubree!"}, "gmap_id": "0x8889179feec41c7d:0xe0dc48b434e7dde2"}
{"user_id": "111393472582038386846", "name": "kandi lykes", "time": 1463698387676, "rating": 1.0, "text": "Not very professional on top of the fact that I have had a application on file with them for the past 4 years and have never been sent out on a job.", "pics": null, "resp": null, "gmap_id": "0x8889179feec41c7d:0xe0dc48b434e7dde2"}
{"user_id": "102857455174792796880", "name": "Cinderella 7x7", "time": 1492874830490, "rating": 5.0, "text": "They help a lot of people find jobs!", "pics": null, "resp": null, "gmap_id": "0x8889179feec41c7d:0xe0dc48b434e7dde2"}
{"user_id": "108811364033214872670", "name": "David Bryant", "time": 1595462129048, "rating": 1.0, "text": "Staff seemed uncaring.  Unpleasant on the phone. Not many leads for area of interest.  Will look into other staffing agencies after a brief conversation with the agent I spoke with.", "pics": null, "resp": {"time": 1595597624065, "text": "Thank you for sharing your feedback. We will look into this for coaching and training. If you would like to speak with a representative about your experience, please reach out to our Associate Engagement team at 833.402.8521."}, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "106657008187262496307", "name": "Falicia Johnson", "time": 1582150540653, "rating": 5.0, "text": "The staff at the Albertville location are truly amazing. They are sweet and listen to what you need and do their best to work with you.", "pics": null, "resp": {"time": 1582211007019, "text": "Falicia, This is so kind of you. We are glad we could help you. Please stop by our office anytime."}, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "108596447656047757903", "name": "Twiztidlo1019", "time": 1600954229529, "rating": 5.0, "text": "Staff is very nice and professional", "pics": null, "resp": {"time": 1601904946455, "text": "We appreciate the 5-star review."}, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "105283558604439410567", "name": "Elijah Coppett", "time": 1567182883626, "rating": 5.0, "text": "Great people and a great place to come\nGood company\nBrittany dollar is the best nicest woman you'll ever meet!", "pics": null, "resp": {"time": 1567516780185, "text": "Eiijah, Thank you for taking the time to share your feedback. We are glad Brittany was able to take care of you. Let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "108345660368964756913", "name": "A bearded gamer", "time": 1580244085979, "rating": 1.0, "text": "They post fake jobs on facebook to get you to come in. waste your day looking for a job that dont exists.", "pics": null, "resp": {"time": 1580310499718, "text": "Hi, Thanks for sharing your feedback. We'd like to speak with you to learn more about the job posting. Our jobs are posted from our available jobs. We would like to make sure our system is working. You can call us at 833.402.8521."}, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "105217390494942720399", "name": "Brennon Miller", "time": 1568918367709, "rating": 5.0, "text": "Amazing and helpful people with great opportunities! They made sure I understood everything and really helped.", "pics": null, "resp": {"time": 1568920270439, "text": "Brennon, We appreciate your feedback. We are glad we could help you find a great opportunity. Please let us know if there's anything more we can do to be of help to you."}, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "110634029121943314376", "name": "Jordan McClendon", "time": 1531926797078, "rating": 5.0, "text": "Wonderful place. Found me a job immediately. Warm friendly environment. 10/10 would recommend.", "pics": null, "resp": null, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "116643315064318251345", "name": "Greg Beck", "time": 1525276709130, "rating": 5.0, "text": "I went to the Albertville location. They were extremely helpful and nice. I walked in with an appointment and out with a job.\nIf I ever need help finding a job again I'll definitely be coming back.", "pics": null, "resp": null, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "116622734811255630336", "name": "Erica harris", "time": 1525211050526, "rating": 5.0, "text": "Had a great experience at Elwood staffing in albertville alabama\nThey were nice and very helpful and got me the job i wanted.", "pics": null, "resp": null, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "113030586263993593708", "name": "April Filmore", "time": 1527479254094, "rating": 5.0, "text": "Real good place to go to. Nice staff", "pics": null, "resp": null, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "107778114759532883689", "name": "Rachel Blanton", "time": 1477433497207, "rating": 5.0, "text": "They have great people that have gone above and beyond to help me finally find a job in Alabama", "pics": null, "resp": null, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "112970268649149332789", "name": "Kerri Swann", "time": 1512687148587, "rating": 5.0, "text": "Very friendly and helpful with finding jobs for people who need one", "pics": null, "resp": null, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "109634512303094061560", "name": "John Maldonado", "time": 1533222695797, "rating": 5.0, "text": "Great employees and very helpful. Got a job right away.", "pics": null, "resp": null, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "113938261073001221575", "name": "Lucas Martinez", "time": 1457021059893, "rating": 5.0, "text": "Very friendly people and they seem really dedicated to helping find people jobs", "pics": null, "resp": null, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "109266611123505783644", "name": "mr. casey", "time": 1537560751976, "rating": 5.0, "text": "They help me get my money when my old job charge me for uniforms that I done turn in. So thank you Elwood of Albertville 😀", "pics": null, "resp": {"time": 1537790157969, "text": "Hello Mr. Casey, Thank you for the review. We are happy we could help you.  Let us know if we can help you again in the future."}, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "117101032968410176060", "name": "Zachary Moore", "time": 1526960444060, "rating": 5.0, "text": "Very friendly and helped me find a job that fits me.", "pics": null, "resp": null, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "106032946151647998726", "name": "Adam Collins", "time": 1512766475624, "rating": 5.0, "text": "Awesome people very nice and friendly", "pics": null, "resp": null, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "117295423318479209956", "name": "Cynthia Shoe", "time": 1529352695034, "rating": 5.0, "text": "Nice and caring staff!", "pics": null, "resp": null, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "105916581362844045690", "name": "Wendi Jett", "time": 1500560926363, "rating": 1.0, "text": "They decided my \"match job \" based on my last job not on my total work history .", "pics": null, "resp": null, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "101602606070089825260", "name": "Jeff Filmore", "time": 1526225890254, "rating": 4.0, "text": "Very friendly people and they seem to work hard on finding me a job. They had me one in 2 days.", "pics": null, "resp": null, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "117295423318479209956", "name": "Cynthia Shoe", "time": 1529352695034, "rating": 5.0, "text": "Nice and caring staff!", "pics": null, "resp": null, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "103793864888512136312", "name": "Dusty Nix", "time": 1498826774601, "rating": 1.0, "text": "RUDE, and doesn't care to waist your day.", "pics": null, "resp": null, "gmap_id": "0x888a032d79596bc1:0xc74408f178f6824d"}
{"user_id": "110517660034994351920", "name": "Tawana Studdard", "time": 1623962798873, "rating": 5.0, "text": "Elwood Staffing in Oxford is the best.  I had a great experience with Toni Smith.  She is awesome.  I love everything about my new job!", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "113583168510860953011", "name": "Tara Blake", "time": 1623872831458, "rating": 5.0, "text": "Tracy Collins, at the Oxford branch, was such a blessing to me.. from our phone convos to the in person interactions! Such a sweet, patient, and professional individual!! Anyone looking for a job, go see Ms. Tracy today!", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "114742404459738588006", "name": "Mario Dosey", "time": 1621387160713, "rating": 5.0, "text": "Excellent Customer Service and Very Professional!  I enjoyed my experience with Ivy, Ericka, and Dayley. They were very informative and readily helped me with anything I needed. The entire staff greeted me and made me feel welcome. I would highly recommend a visit.", "pics": null, "resp": {"time": 1621865651390, "text": "Mario, Thank you for the kind review. We are glad the Oxford team was able to help you with your job search. Please let us know if you have any questions."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "106901111771867203305", "name": "Kyle Andrews", "time": 1620416297701, "rating": 5.0, "text": "From the first phone call made to the Oxford Branch of Elwood Staffing, their team member Ivy was nothing less than a blessing from helping me Apply on their computers as well as paper to helping me navigate the correct job to fit my schedule and personal needs. Ivy is more than just a regular employee, she made sure to go above and beyond for me as well as many other Elwood employees to help us all achieve success. Oxford Elwood bests the rest by far!", "pics": null, "resp": {"time": 1620762092038, "text": "Kyle, Thank you for sharing this feedback on your experience with Elwood Staffing in Oxford. We are glad you've had a good experience. Please let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "106911173257477033185", "name": "Renee Childs", "time": 1620419692320, "rating": 5.0, "text": "I want to say that I came to Elwood 2013 for a job. They took me to the back to Toni Smith. She was very helpful. She help me understand what I needed to do to come work at bridgewater interior. Her Communication skills are excellent and she cares about her people and come check on us. I enjoy being an employee under her supervision and I will follow her anywhere she would go if she was a supervisor anywhere else. Toni Smith works with help people and try her best to take care of you. I’m still at bridgewater interiors and it’s been 8 years.\nToni Smith is very Professional and polite to everyone. She never rude or short to anyone. Thank you Toni smith for be the best Supervisor I ever had.", "pics": null, "resp": {"time": 1620762032278, "text": "Thank you for being a loyal and dedicated Elwood associate. We are glad we could make a life long partnership working with you."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "102481172903603113713", "name": "Alex Nelson", "time": 1623256167896, "rating": 5.0, "text": "My experience here was great and they got me a job within a week ✊🏻 Ivy", "pics": null, "resp": {"time": 1623332327944, "text": "Congratulations on the new job!"}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "111753408444607891094", "name": "kailey johnson", "time": 1620932512776, "rating": 5.0, "text": "Ivy at Elwood staffing gave me an amazing experience by making sure I found a job that was suited and right for me I really appreciate it", "pics": null, "resp": {"time": 1621257665787, "text": "Thank you for letting Elwood help you with your job search. We are so glad we were able to find you a suitable job. Let us know if there's something we can do to be of help to you."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "103774313008992197954", "name": "Latanya Watson", "time": 1621963377304, "rating": 4.0, "text": "Ivy  she was very professional, my experience with the  office was great everyone was professional and helpful", "pics": null, "resp": {"time": 1622125373204, "text": "Thank you for the kind review. We are glad you had a good experience with the Elwood Staffing office in Oxford."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "112857717970799306599", "name": "Lara Little", "time": 1602193100497, "rating": 5.0, "text": "Elwood Staffing provides a great service.  The staff is professional and handles all our requests in a quick manner.  We have been very pleased with the candidates we receive.  The majority go on to become full-time employees with us.  I am very pleased with Elwood's performance to help our business grow.", "pics": null, "resp": {"time": 1602597174224, "text": "Thank you for the review, Lara!"}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "114318605754470396966", "name": "Ajanaki Bean", "time": 1603388013870, "rating": 4.0, "text": "It was a great place and they actually start you on a job pretty fast.", "pics": null, "resp": {"time": 1603722889271, "text": "Thanks for the great review!"}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "114175205434600319950", "name": "Connie Hickson", "time": 1604345028715, "rating": 5.0, "text": "They are great at helping you find employment. Takes the hassle out of running from job to job filling out applications.", "pics": null, "resp": {"time": 1604353020451, "text": "We appreciate the review!"}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "115924615875704857401", "name": "Darrin Alimenti", "time": 1621957451379, "rating": 5.0, "text": "Friendly, Professional and Courteous", "pics": null, "resp": {"time": 1622126230187, "text": "Thank you! Let us know if we can be of further help to you."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "112516801742940305590", "name": "Tristen", "time": 1614055284807, "rating": 5.0, "text": "Great company to work for!", "pics": null, "resp": {"time": 1620762120176, "text": "Thank you!"}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "103695750091191291993", "name": "Seymour Butts", "time": 1590083326907, "rating": 5.0, "text": "Helpful staff they were always prompt to call back for available positions", "pics": null, "resp": {"time": 1590148998303, "text": "Thank you for allowing Elwood to help you on your job search!"}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "102653359726666985610", "name": "Kristin Stamm", "time": 1525201868279, "rating": 5.0, "text": "Elwood definitely helped me better myself from the start. I was working at Sonic Drive In when I came to them and am now hired on full time at BR WILLIAMS WAREHOUSE and have a chance to even further better myself career wise. Erin was amazing from the get go and was always about checking in on her employees to make sure we were all happy with our placement. The genuine care and support from this company is something I will cherish always. I will never forget where I came from. Thank you so much Elwood, especially Erin.", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "104301368071482755886", "name": "Eddie Gaines", "time": 1525014758243, "rating": 5.0, "text": "Elwood is a great temp to work for. I recommend anyone to work here they are great people and will put you in a nice environment to work. The job I'm at now are awesome thanks to my friend Erin she is the best and will put you in a great work place. She checked on here employees every week it can't get any better than that.\nThanks again Erin\nFrom the quiet 1 Eddie", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "103637984359712275749", "name": "Melanie Glover", "time": 1566635170239, "rating": 5.0, "text": "Thank you Oxford Elwood and online Elwood at Honda. After being a faithful employee through your services I'm now a HMA Employee!  The Elwood staffing was always helpful in my questions and in helping me gain my permanent position! All the employees at Elwood were extremely helpful. I must give a shout out to Chad (Elwood online staff @HMA) no matter what time of day, he was always friendly, polite and willing to offer advice to help me!!", "pics": null, "resp": {"time": 1567007706696, "text": "This is fantastic! Congratulations to you. We appreciate your hard-work and dedication. We love reading about success stories. Thanks for sharing."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "109989348342886232482", "name": "anthony taylor", "time": 1525729352783, "rating": 5.0, "text": "Always helpful. Always quick to employ. I've had nothing but good luck with them. They are all helpful. Though I have been successfully hired on through two separate places thanks to Erin. She helped me find the right fit", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "115037519736144173790", "name": "Jon S", "time": 1515556421060, "rating": 5.0, "text": "I had a great experience!  Erin didn’t stop till she found a job that matched my trade knowledge 110%.   Would definitely recommend this Elwood office to anyone looking for employment.  Thank you for the awesome experience!", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "113962294331648860568", "name": "Ariel Dial", "time": 1537340262176, "rating": 5.0, "text": "Elwood is a terrific temp to hire! I recently left a job of 5 years for a career change and I was skeptical at first but I am now a full time employee at a manufacturing company! And I must say Ms. Toni made it happen best supervisor I’ve ever had! Never a sec that I need to know something and she didn’t find the answer wether she had to go through hoops!!", "pics": null, "resp": {"time": 1537356994544, "text": "Ariel, Congratulations on your new career. We are glad we could be a part of your journey. Let us know if there's anything we can do to help."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "109314023960878093003", "name": "Nathan Nagel", "time": 1524944982109, "rating": 5.0, "text": "Through Elwood I had a great experience if you go plan to spend a bit of time there but they are thorough and very friendly. Thanks to them I got my permanent hire at a great place. I definitely recommend them to anyone looking for a job and a chance to work! Thanks Elwood!", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "115683039853928879742", "name": "Eric Stack (Stack Enterprises)", "time": 1525052925932, "rating": 5.0, "text": "They've placed me the last two jobs. Around 3 weeks from filling out app until employed. Went through Tracy first time, and Toni second time.\n\nBoth professional and look after you. Your work ethic determines your success in your assignments.", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "104053514972277389957", "name": "Kaitlin Johnson", "time": 1526705520538, "rating": 5.0, "text": "Great Staffing Company ! They helped me get the current job I have right now . Very dependable!  Friendly service , very polite staff . They make sure you are well taken care of and employed ! I highly recommend Elwood Staffing Company to everyone !", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "102571644814434947499", "name": "John Fults", "time": 1545360098244, "rating": 5.0, "text": "Very helpful staff, friendly and helpful. I worked through them for several months and was hired permanently to my job. I would recommend them to anyone looking for steady employment.", "pics": null, "resp": {"time": 1545397355326, "text": "John, We appreciate your dedication and loyalty to Elwood Staffing. Happy Holidays from all of us."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "105321362169361369104", "name": "Casey Lindley", "time": 1538734751232, "rating": 4.0, "text": "Friendly staff and quick to get you placed somewhere. I've had quite a few assignments thru them but the most recent has been the best .I send anyone looking for a job to them. Have for years.", "pics": null, "resp": {"time": 1538738901041, "text": "Casey, Thank you for your loyalty to Elwood Staffing. We really appreciate the feedback. Check out our  referral program and tell us Casey sent you."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "117370714874409778152", "name": "Chris Kunkle", "time": 1528765608646, "rating": 5.0, "text": "The people at Elwood staffing in Oxford Alabama have been absolutely wondeful and to say I have had a positive experience would be an understatement. In particular Erin has went above and beyond what I had experienced elsewhere and would gladly recommend her and the rest of the Elwood staffing team in Oxford to anyone seeking employment.", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "105323696737078094506", "name": "Robert B", "time": 1525036601157, "rating": 5.0, "text": "Great Staff! Super friendly! I would definitely recommend if I ever needed to seek employment again! 10 out of 5 stars!", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "114211800869091622704", "name": "Blaytn Turner", "time": 1581402432955, "rating": 5.0, "text": "They were friendly and very helpful", "pics": null, "resp": {"time": 1581514620607, "text": "Blaytn, Thank you for the review. We are glad you had a good experience. Please let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "110604843023165243864", "name": "Haven Smith", "time": 1574107337416, "rating": 1.0, "text": "The only reason I'm giving these guys a star, is because the option for none wasn't available. They are RACIST, RUDE, AND ONLY OUT FOR THEMSELVES. MY HUSBAND HAS BEEN THERE FOR ALMOST A YEAR AND THEY KEEP FIRING HIM FROM HIS JOBS. AT CHRISTMAS TIME???? SHAME ON EVERYONE WHO WORKS THERE", "pics": null, "resp": {"time": 1574278182976, "text": "Haven, If he would like to speak with someone about the situation let him know he can call our Associate Engagement team who will be happy to speak with him. They can be reached at 812.657.0807. He can call or text them."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "114787688267307871808", "name": "Jamie Anderson", "time": 1527475363613, "rating": 5.0, "text": "I was working a job that had me driving long distances and long hours and never had time for family. Elwood helped me find a job 10 mins from home and working the hours I wanted. I'm glad they listened to what I asked for. They found the job that was just right for me.", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "104002769782346965196", "name": "B Hall", "time": 1541722513035, "rating": 5.0, "text": "Excellent hardworking staffing service-very professional and helpful in my process of being hired permanently", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "104320436394224465071", "name": "Rebecca Hanvey", "time": 1534436536402, "rating": 5.0, "text": "The staff is great and very helpful. Great place to go if your looking for a job.", "pics": null, "resp": {"time": 1534508443385, "text": "We are happy we could help you, Rebecca. Let us know if you need further assistance. Have a wonderful day!"}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "106227816169836857921", "name": "indrid cold", "time": 1579490963580, "rating": 1.0, "text": "I have been here twice and have an excellent work history. I was at one job for 20 years and have multiple skills but they can't seem to get me on anywhere I don't get it.", "pics": null, "resp": {"time": 1581081183238, "text": "Indrid, Thank you for sharing your feedback. We will look into this for coaching and training. If you would like to speak with a representative about your experience, please reach out to our Associate Engagement team at 833.402.8521."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "118211946149109849098", "name": "Lurena Garrett", "time": 1525418243303, "rating": 5.0, "text": "Love Elwood!!! A great place to go if you are looking for a  better job or to make more money! Mrs. Toni is the BEST!!!!", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "112915249561622600371", "name": "Miranda Edwards", "time": 1540822932427, "rating": 1.0, "text": "Went to Elwood for employment back in February and went thru the whole process to receive employment. And here it is almost May and do you think they have cared to contact me for employment??? I'm so glad I did not wait on them because I would be still here unemployed waiting on them!!!", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "100622119193914158842", "name": "Amanda Holder", "time": 1525108697794, "rating": 5.0, "text": "Went there to find a job and got a job the same day! They are great at what they do!!! Will use them again if I ever have to!", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "112725957662472381136", "name": "Michael Woosley", "time": 1526653956971, "rating": 4.0, "text": "Great place to find a jobs and a great team to help you with whatever you need", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "103644195930081923904", "name": "Angela Langston", "time": 1534437573955, "rating": 5.0, "text": "Huge Thanks to Elwood, I am currently employed with a wonderful company!!", "pics": null, "resp": {"time": 1534442415009, "text": "You are most welcome, Angela. We are glad we could be of help to you."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "117093110537634149196", "name": "Shervier Prothro", "time": 1497392012265, "rating": 3.0, "text": "Applied years ago and they still haven't found me a job yet so I can't really give a perfect grade", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "113769016153455979433", "name": "Master V Tay", "time": 1529584484492, "rating": 5.0, "text": "Good people and great service I was giving a job that I'm at currently at", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "103004290760370198190", "name": "Shane Hulsey", "time": 1537804704283, "rating": 5.0, "text": "I have worked on and off for Elwood since 2010 always making it  to full time.employment with the compines they sent me to. I was sent to Cvg and after 6 months hired on but 5 years later the plant downsized and I was laid off I once again turned to Elwood and they sent me to Honda in Lincoln Al .Now  after 2 years of temp work I'm hired on as a full time Honda associate.  The people in both the Oxford Office especially Lorena Amaral , and the onsite office  were very helpful when ever I had a question or problem.  i would recommend  them to anyone seeking a job", "pics": null, "resp": {"time": 1537809116565, "text": "Shane, Thank you so much for your dedication to Elwood Staffing. We love hearing success stories like yours. We don't always get feedback on how well the job worked out for people long term. Thank you for letting us be a part of your employment needs."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "116120505165998630720", "name": "Dee Shears", "time": 1525011613725, "rating": 5.0, "text": "I will recommend Elwood Temp service to go to before i started at Bridgewater Int Toni Leverett found me jobs for the time being and they all were nice and friendly environnements and offered me full time as well and the Staffing service is very friendly and helpful start a job the day after i meet Ms Leverett 5 star rating for me 👍👍", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "103686378192595232517", "name": "Sosa Lane", "time": 1489974560313, "rating": 1.0, "text": "filled out an application back in 2008 and finish my app an all.. right at the end you have to do an assessment test and i was told that it didn't matter and any answer would not hurt my chances..  after doing an application for an hr i was ready to go because i was having a son born at the time and couldn't waste anymore time.the assessment test was 80 questions so i flew thru it only to be called the next day and told because of my results i wasn't able to fill out an app ever again!!? because of there system this may never change....", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "112459366515781703806", "name": "Arnold Kirksey", "time": 1525024999288, "rating": 5.0, "text": "Elwood Oxford Alabama has the best location, the staff are awesome and very helpful & I will recommend anyone to go there. Thanks Mrs. Toni.", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "106918038357624702872", "name": "AOAZ Woolf Circle Production", "time": 1527599881597, "rating": 5.0, "text": "Elwood Staffing put me in a great work place . Thanks Erin for your help!", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "115969346830519491811", "name": "Jessica Knight", "time": 1548174988740, "rating": 5.0, "text": "Elwood helped me tremendously! They called me for a job I had been wanting but for another shift, I told them what I wanted and they talked with the company and secured me a position on the shift I wanted! Thanks Elwood!", "pics": null, "resp": {"time": 1548180192357, "text": "Jessica, thank you for sharing your feedback with us. We are glad we could help you find the perfect job. Please let us know if there's anything more we can do to be of help to you."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "113403997289177846284", "name": "Nicole Storey", "time": 1515619468449, "rating": 5.0, "text": "We Will find out in due time their work search persistency\nTryna  get that 🍞\nSo staffing company let's knead the dough", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "112094314358857598810", "name": "Andrew S.", "time": 1565620725880, "rating": 1.0, "text": "Receptionist I spoke to on the phone was extremely rude and unprofessional.", "pics": null, "resp": {"time": 1553280973425, "text": "Andrew, We appreciate you sharing your feedback. We will pass this along for coaching and training."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "109068570323131539022", "name": "Stephany Cunningham", "time": 1609972948840, "rating": 5.0, "text": "Good place to get a job", "pics": null, "resp": {"time": 1563912201324, "text": "Hi Stephany, We understand you are disappointed with the situation with your spouse. We don't have any quotas to meet, we just like helping people. Please let your husband know he can reach out to our Associate Engagement team at 812.418.0962 if he would like to speak to someone about his experience with us."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "109781552560991420502", "name": "Joshua Patterson", "time": 1527634330858, "rating": 5.0, "text": "Elwood staffing in Oxford AL is a great temp force to work for", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "118143783934200940299", "name": "Keara Nicole", "time": 1524090082112, "rating": 1.0, "text": "I’ve been calling and going to Elwood for 3 weeks and people who quit within 2 months get a job there ! I’m not happy with the company and today I heard of a job opening that need people immediately and I called and called and left a voicemail and they never returned my call\nI am trying to work smh\nSad company", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "107377512185634982141", "name": "Thomas Bell", "time": 1500165949109, "rating": 3.0, "text": "It ok I wish they would tell more about what is going on about the jobs you put in for because i had a job interview and that about as far as i got they keep tell me there going to do a back ground check and my job history that been two months ago", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "106706396758782367281", "name": "James Kemp", "time": 1529440318868, "rating": 5.0, "text": "Ericka and Erin are awesome", "pics": null, "resp": {"time": 1531828311646, "text": "Yes they are! We are pleased to have them on our team."}, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "112750309844099347305", "name": "cesilia marquez", "time": 1525013001212, "rating": 5.0, "text": "Very friendly staff. They find you a job a short time period...", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "100430534593099209202", "name": "Troy Brandenstein", "time": 1624552498476, "rating": 5.0, "text": "Thanks to Elwood staffing...got me a great job..within a few days....special thanks to Ivy very throughial and helpful..couldn't have asked for any better!!!", "pics": null, "resp": null, "gmap_id": "0x888bb1bde65c108b:0xbdbda3cf2293b17"}
{"user_id": "100905648336299254363", "name": "Lakesha Spencer", "time": 1617893583715, "rating": 1.0, "text": "I was told that I would have money in the bank so when it’s not there I call them they got very disrespectful said they couldn’t do nothing about it told me in the beginning of the week to get a supervisor to email and approve the hours so now it’s all on cooperate nothing they can do they words or not reliable.", "pics": null, "resp": {"time": 1618327709396, "text": "Thank you for taking the time to let us know about your experience with us. Our Associate Engagement team would like to speak with you to find out more about this experience. Please call or text them at 833.402.8521."}, "gmap_id": "0x88861ccdce4b4d05:0x546240fc16d37c3a"}
{"user_id": "101738822787501919810", "name": "Kandace palmer", "time": 1599811331177, "rating": 3.0, "text": "I give it 3 stars for now cuz I haven't been able to get my first paycheck from them I thought it would be on my card this morning but its not :/ and I need my money!!", "pics": null, "resp": {"time": 1600804138803, "text": "Hi Kandace, give our Associate Engagement team a call at 812-657-0807 if you are still having issues with your pay card :)"}, "gmap_id": "0x88861ccdce4b4d05:0x546240fc16d37c3a"}
{"user_id": "104531656092310783484", "name": "Ivan Scuderi", "time": 1587494420649, "rating": 5.0, "text": "They are a great team  , very communicative and\nThey answer timing is fast . I have been with them since 08/2019 found me the job that I love.", "pics": null, "resp": {"time": 1589400895131, "text": "We are so happy to hear you had a great experience with Elwood. Thank you for the review and kind words, Ivan."}, "gmap_id": "0x88861ccdce4b4d05:0x546240fc16d37c3a"}
{"user_id": "117158163621837381781", "name": "michael Warren", "time": 1526237347078, "rating": 5.0, "text": "I have always been very pleased with customer service from Elwood Staff and Management. I was in search for employment a few weeks ago and decided to contact Elwood, again they put me in contact with a great company.\nThank You Elwood", "pics": null, "resp": null, "gmap_id": "0x88861ccdce4b4d05:0x546240fc16d37c3a"}
{"user_id": "113036511450067847816", "name": "Constance Jackson", "time": 1530895358401, "rating": 5.0, "text": "I love them! They are awesome people to work with!!They are there for you abd always keeps you with a job, might i add awesome job! Elwood Staffing is for the people! Im satisfied with my job and i have them to thank for that and the man above for leading me to them. I give thrm a thousand stars times 10!!!!!Way to Go! You cam never go wrong with them. Please give them a try. They are worth working for and with. I was never dissatisfied or disappointed! I highly recommend them!\nSigned Constance Jackson", "pics": null, "resp": {"time": 1531828471519, "text": "Thank you for the awesome feedback, Connie. We are so happy to be serving the people of Tuscaloosa."}, "gmap_id": "0x88861ccdce4b4d05:0x546240fc16d37c3a"}
{"user_id": "106034936448569073556", "name": "King Yo", "time": 1542819987593, "rating": 5.0, "text": "This is the best temporary staffing service I’ve ever worked for.", "pics": null, "resp": {"time": 1542822736443, "text": "We are glad to work with you. Thank you for your dedication. We appreciate all you do."}, "gmap_id": "0x88861ccdce4b4d05:0x546240fc16d37c3a"}
{"user_id": "112311466094425578392", "name": "Jamarcus Billingsley", "time": 1528937754294, "rating": 5.0, "text": "Elwood staffing is by far a GREAT COMPANY to work for.  The customer service and management is awesome.👍", "pics": null, "resp": null, "gmap_id": "0x88861ccdce4b4d05:0x546240fc16d37c3a"}
{"user_id": "116801542448133723021", "name": "reginald anderson", "time": 1543598900172, "rating": 4.0, "text": "Great People Randys The Best", "pics": null, "resp": {"time": 1543601866317, "text": "Thanks so much for the review. We are glad we could help you."}, "gmap_id": "0x88861ccdce4b4d05:0x546240fc16d37c3a"}
{"user_id": "104857644564473220780", "name": "Sierra Locke", "time": 1507652091958, "rating": 1.0, "text": "They have a man there by the name of Randy Miller... He is very very disrespectful! Doesn't know how to talk to clients, or maybe it's the black ones!!", "pics": null, "resp": null, "gmap_id": "0x88861ccdce4b4d05:0x546240fc16d37c3a"}
{"user_id": "103447310806099360687", "name": "jamorris brown", "time": 1504488120400, "rating": 1.0, "text": "Hate it", "pics": null, "resp": null, "gmap_id": "0x88861ccdce4b4d05:0x546240fc16d37c3a"}
{"user_id": "115402688647210723472", "name": "Ladarius Thomas", "time": 1533825502761, "rating": 1.0, "text": "Bed right guy who work that he is very rude and disrespectful and very mean at Elwood he needs to be fired he don't want nobody with a job", "pics": null, "resp": {"time": 1533828286260, "text": "Thanks for sharing your feedback. We'll look into this situation. Thanks!"}, "gmap_id": "0x88861ccdce4b4d05:0x546240fc16d37c3a"}
{"user_id": "111827409805492192171", "name": "kristi leahey", "time": 1622993610701, "rating": 5.0, "text": "I was very impressed at the quick response to my application. The process from start to finish was in a very pleasant as well as a professional setting. All of my questions regarding the job I applied for were met with quick responses as well as informative. Stephanie and Crystal both were kind and treated me as part of the Elwood family as soon as I sat down to go over the job description I was applying for. Thank you,  Elwood Staffing of Lincoln.", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "109681331166333736176", "name": "Tonia Crumb", "time": 1581434878595, "rating": 5.0, "text": "My name is Shannin Ross and I have applied with elwood staffing in Talladega.  My experience was great. Mrs. Stephanie Martin and Mrs. Lisha made sure that once I walked in I was starting my paper work , test and drug screen out of the way instead of waiting to get started. They are very informative about the safety of the job and what to do in case of an emergency. I also would call both of these intelligence lady's a friend. They work really hard to make sure you get the job you applied for. They are friendly and informative I will always remember  them two lady's who made job hunting a great experience.  Thank you Mrs. Stephanie Martin and Mrs. Lisha", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN6QeDv6uWuejfxbzWpP90Xkyrvew8PjSlW6dCs=w150-h150-k-no-p"]}], "resp": {"time": 1589489767835, "text": "Thank you for sharing your wonderful experience with our team in Talladega!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "102123904257783032464", "name": "Javon Ward", "time": 1622664934716, "rating": 5.0, "text": "Ms.Lisha Kidd is the most delightful person I’ve ever came across. As soon as I’d walked through the door, her & her sweet coworkers had welcomed me with a nice greet! Mrs.Kidd also took me step by step with the hiring process and other questions I needed answers to! Her ability to communicate and try to understand a person is absolutely through the roof. 5 STAR EXPERIENCE!!! Javon Ward Garrett", "pics": null, "resp": {"time": 1623336045582, "text": "Thank you, Javon! Mrs. Lisha has been taking care of applicants in Lincoln/ Talladega area for some time now. We're glad she was available to help you with your job search. Let us know if Elwood can help or answer questions for you while you are working for Elwood."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "111093601954351956455", "name": "LADY B", "time": 1621290849978, "rating": 5.0, "text": "Above and beyond experience for a temporary agency. Stephanie Martin and Emily C. were so kind, friendly, and just overall refreshing energy from the normal dry and routine experience most recruiters give. Emily C. Handled most of the telephone communications anytime I called and was knowledgeable about any questions I had. Stephanie Martin handled my in-office experience and she went as far as giving extra diagram drawings to both locations for the job I would be going to. These ladies left a lasting impression on me and probably was my first great one for a temporary agency. Good Job ladies!", "pics": null, "resp": {"time": 1621863893543, "text": "Thank you so much for the kind review. We are glad you had a good experience with Elwood Staffing. Our team is always happy to help."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "109950774929163528318", "name": "Scott Dunn", "time": 1619247571494, "rating": 5.0, "text": "Stephanie and Emily provided professional, excellent quality customer service.  They both were awesome.  They worked above and beyond getting me set up to work at Honda.  I had an enjoyable experience.  They both deserve raises or cash awards.  Stephanie also deserves higher pay for being required to shave folks for hair follicle test.  Superior job by both.  I am proud to be an employee for Elwood Staffing/Honda Lincoln, AL.", "pics": null, "resp": {"time": 1619445283181, "text": "Hi Scott, Thank you for the kind review. We are very glad you had a good experience with the Elwood Staffing in Lincoln. Please let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "111685173305022496714", "name": "MaggieLand _74", "time": 1621054940579, "rating": 1.0, "text": "Update On My Review.... * THEY DO NOT ANSWER/ RESPOND TO TEXT'S MESSAGES*  YOU WILL BE IGNORED AFTER YOUR START DATE OR CHOOSE NOT TO TAKE A HONDA ASSIGNMENT*\nWhen I first walked in I was greeted by Emily who has a huge smiling face and super friendly. Then the rest of the time I spent with Lisha who is super sweet and helpful specially during the hair extraction for hair follicle drug test, definitely a gentle touch. Amazing Ladies are at this location. professional/friendly/respectful/classy/do their job well.", "pics": null, "resp": {"time": 1620056374850, "text": "Thank you for taking the time to let us know about your experience with us. Our Associate Engagement team would like to speak with you to find out more about this experience. Please call or text them at 833.402.8521."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "100560793751024271345", "name": "Bill Burrows", "time": 1622688712808, "rating": 5.0, "text": "Excellent staffing company. Stephanie Martin was awesome to work with. Explained everything clearly. She is very friendly and patient. Highly recommend seeing her if you are looking for work in the Lincoln AL area.", "pics": null, "resp": {"time": 1623336695869, "text": "Thank you. We are glad Stephanie was able to help you with your job search. Let us know if we can answer any questions for you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "116813431247211347158", "name": "Kassi Fowler", "time": 1620155724283, "rating": 5.0, "text": "Stephanie Martin was my hiring representative and first, she was considerate, very friendly, fast and to the point, very detailed and helpful. Professional and a beautiful personality. Great individual for what she does. I recommend everyone to go thru Elwood in the Lincoln office as her client. A perfect quality.", "pics": null, "resp": {"time": 1620761066362, "text": "Thank you for the kind review Kassi. We are so grateful to have Ms Martin working with Elwood. She is fantastic."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "109666242869042096984", "name": "GG MELANIN", "time": 1620271075371, "rating": 5.0, "text": "Hello, My Experience Was Great. Mrs. S. Martin Assisted Me & She’s The Best. The Atmosphere & Other Ladies Who Work At The Lincoln Location Are Super Nice As Well. I Give You 5 Stars .", "pics": null, "resp": {"time": 1620330414883, "text": "Thank you! We appreciate your 5-star review. Please let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "107647449537253483255", "name": "Jeremy Powell", "time": 1618327324833, "rating": 5.0, "text": "Called to receive information and Stephanie Martin helped me with every thing I needed.  She took the time and made sure I had what I needed.  If you're in the central Alabama area and looking for employment go by and see the staff at Elwood Staffing.  They'll treat you like family (the ones you like) and tell them I sent you.", "pics": null, "resp": {"time": 1618328213502, "text": "Thank you for the 5 star review. We are happy to help you!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "117000900152414717787", "name": "Frank Frith", "time": 1619138286832, "rating": 5.0, "text": "I was contacted quickly after applying by Stephanie Martin.  The application process was quick and easy and pressure free.  Any questions or issues I had, I called her and she quickly resolved or answered them.", "pics": null, "resp": {"time": 1619445363933, "text": "Thank you for sharing your feedback. We are glad the staff in Lincoln was able to help you with your job search."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "101928956309705941544", "name": "Corey Mitchell", "time": 1618601984735, "rating": 5.0, "text": "I had the best experience and upmost professional respect with my employment assistance. Stephanie Martin was the best ever at assisting me in my job process. Thank you and I hope she is recognized for her commitment.", "pics": null, "resp": {"time": 1619096988815, "text": "Corey, thank you for the kind review. We are glad you had an opportunity for Stephanie to help you with you job search. Please let  us know if there's anything more we can do to be of help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "106164013244307582529", "name": "Franklin Roundtree", "time": 1618239528760, "rating": 5.0, "text": "Emily and Stephanie were great. Very cheerful and professional. They made applying comfortable and easy. Thank you very much.", "pics": null, "resp": {"time": 1618328259929, "text": "Thank you for the 5 star review. We are glad we could help."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "106075863250543979543", "name": "sonya bennett", "time": 1620756873657, "rating": 5.0, "text": "The staff greeted me as soon as I walked through the door. I didn’t have a long wait .. Ms.Lisha Kidd was the BEST she helped me & answered all my questions she made me felt welcomed & she was sooo professional I give her 2 thumbs up .. if y’all looking for a job pleaseeeee contact her I promise you won’t be disappointed 🤞🏽", "pics": null, "resp": {"time": 1620761127932, "text": "Thank you for  recommending Elwood Staffing. We are so glad we were able to help you with your job search."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "101753937797889300324", "name": "Paul McSheridan", "time": 1623292553121, "rating": 5.0, "text": "Lisha was very helpful and professional to me.  I appreciate it very much.", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "107905610930591872151", "name": "Amanda Wright", "time": 1621102674280, "rating": 5.0, "text": "Ask for Lisha Kidd, quick with information, got me in a job within the week. Great pay!", "pics": null, "resp": {"time": 1621256485786, "text": "Thank you for taking the time to let us know about your experience. We will be sure to let Lisha know about your feedback."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "109360145778541789588", "name": "Dillen Haney", "time": 1609962314838, "rating": 5.0, "text": "Easy application process. Stephanie Martin made everything absolutely wonderful. Very knowledgeable and helpful. I was able to complete everything including urine and hair follicle test with ease. Would definitely recommend.", "pics": null, "resp": {"time": 1610390010551, "text": "Dillen, We appreciate you taking  a few minutes to give your feedback on your experience with Elwood Staffing in our new Lincoln office. We are glad things went well. Please let us know if we can be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "117645543319846840378", "name": "Kaevon Austin", "time": 1620168722567, "rating": 5.0, "text": "It was an awesome experience. Stephanie Martin was a very good supervisor for me and helped me a lot!", "pics": null, "resp": {"time": 1620761236033, "text": "Kaevon, We are glad you had a good experience with the Elwood in Lincoln. Let us know if you have any questions we can answer for you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "117645543319846840378", "name": "Kaevon Austin", "time": 1620168722567, "rating": 5.0, "text": "It was an awesome experience. Stephanie Martin was a very good supervisor for me and helped me a lot!", "pics": null, "resp": {"time": 1620761236033, "text": "Kaevon, We are glad you had a good experience with the Elwood in Lincoln. Let us know if you have any questions we can answer for you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "101267227906177033272", "name": "Clarence Averitte", "time": 1620841995292, "rating": 5.0, "text": "I had a wonderful time applying for a job, staffing personnel was nice and courteous. Thanks Stephanie", "pics": null, "resp": {"time": 1621256553041, "text": "Thank you!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "103874925457505616075", "name": "Joseph Matthews", "time": 1619455400914, "rating": 5.0, "text": "Fantastic and helpful team throughout with special accolades for Mrs. Stephanie Martin for being so patient when I had pretty dumb questions. Great company to work with.", "pics": null, "resp": {"time": 1620056858808, "text": "Thanks Joseph, We are happy to help. Let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "104090378188217109094", "name": "Anna Hill", "time": 1620838711839, "rating": 5.0, "text": "Stephanie was very nice and helpful! She was very professional as well. Many places need more people like Stephanie.", "pics": null, "resp": {"time": 1621256569186, "text": "Thank you, Anna. We appreciate your kind words."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "106428635797187180880", "name": "Steve Barton", "time": 1617992551691, "rating": 5.0, "text": "Very professional and helpful, not to mention very fast.   I was helped by Stephanie Martin,  she was outstanding and very professional.", "pics": null, "resp": {"time": 1618328395349, "text": "Steve, We appreciate you sharing feedback on the experience you had with Elwood Staffing. Glad they were able to help you with your job search."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "111426684261757148490", "name": "thomas d", "time": 1610032723990, "rating": 5.0, "text": "Stephanie Martin was able to get me in and out very quickly knowing I had to be at work within a couple of hours. Very professional and made the process enjoyable. Would highly recommend this location to anyone looking for a job.", "pics": null, "resp": {"time": 1610389908922, "text": "Thomas, we are glad Stephanie was able to assist you with the hiring process. We are glad you had a good experience."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "102123658062680616089", "name": "Michael Mitchell", "time": 1619215493258, "rating": 5.0, "text": "Emily, Stephanie and Lisha were cvery good at their job.  I enjoyed the experience.", "pics": null, "resp": {"time": 1619445326638, "text": "Thank you, Michael! We are very fortunate to have a great team in Lincoln.  Reach out to us if we can be of help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "100189950598114658361", "name": "Makahia Taylor", "time": 1618598140626, "rating": 5.0, "text": "I had Mrs Stephanie Martin and she was very professional and very helpful , absolutely loved her !", "pics": null, "resp": {"time": 1619096604758, "text": "Makahia, we are glad you had an opportunity to work with Stephanie. She is fabulous to work with. Please let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "102756254830509570082", "name": "Wallace Fincher", "time": 1610121642952, "rating": 5.0, "text": "Very professional and easy to apply. Lisha Kidd was very nice and explained every thing clearly. Everyone in the office was very nice and would make anyone comfortable and feel welcome.", "pics": null, "resp": {"time": 1610389656858, "text": "Wallace, Thank you for sharing your feedback. We are so glad Lisha was able to help you with the hiring process. Please reach out to us if we can be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "107014584571768060786", "name": "Don Newkirk", "time": 1605176029991, "rating": 5.0, "text": "One of the best experiences I've ever had applying for a job. Stephanie Martin is the best. She is patient, knowledgeable and a joy to work with. She treated me with dignity and respect. The staff there is awesome.", "pics": null, "resp": {"time": 1605553967275, "text": "Don, we are glad to hear you had a wonderful experience. Thanks for the review."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "105995036304482996683", "name": "Adam Johnson", "time": 1617813305007, "rating": 5.0, "text": "Thx you Stephanie Martin she is very sweet and straight forward with people helping them the best to get there job and elwood is the best temp service.", "pics": null, "resp": {"time": 1618327628484, "text": "Thank you, Adam! Glad we were able to help you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "109113033266953628998", "name": "Brooklyn Bell", "time": 1605023033375, "rating": 5.0, "text": "I had a great experience. Clean, friendly, professional, and quick staff. Stephanie Martin was my recruiter and she  was awesome! Super bubbly personality  but very professional and focused on my job placement. I would definitely recommend her to everyone.", "pics": null, "resp": {"time": 1605553784496, "text": "We are glad to hear you had a good experience. Thanks, Brooklyn!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "112958449876345232366", "name": "Amanda Thompson", "time": 1618003138349, "rating": 5.0, "text": "Stephanie Martin was very helpful and very sweet. A great person to work with.", "pics": null, "resp": {"time": 1618328347263, "text": "Amanda, We appreciate the kind review. Thank you for sharing."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "114139164050358064512", "name": "Crystal Harris", "time": 1607990235477, "rating": 5.0, "text": "My name is Crystal Harris and I applied for Elwood Staffing in Lincoln. My experience was great especially Stephanie Martin she helped me out a lot and she was very very professional. When I got there she made sure I got started right on my paperwork I didn't have to wait hours and hours just to get started she was great plus she got me hired right there.", "pics": null, "resp": {"time": 1608565188284, "text": "Crystal, we are so glad to hear Stephanie was able to help you out!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "112706918998521057156", "name": "Trinity Cochran", "time": 1607531791061, "rating": 5.0, "text": "This staffing company had a warm welcoming atmosphere and is full of friendly staff members who genuinely care about placing you at a job that works for you. If you happen to stop by be sure to ask for Stephanie Martin she was very nice and extremely helpful throughout the entire process.", "pics": null, "resp": {"time": 1607960593874, "text": "Trinity, we appreciate the review!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "114825470856969638033", "name": "Lehia Gray", "time": 1618099343152, "rating": 5.0, "text": "Emily was an amazi ng help although her co - worker leashia had messed our passwords and sign in up , lost our paper work anddidnt evenbother to help she stayed professional with a friendly attitude and im so thankful for her service .", "pics": null, "resp": {"time": 1618328325797, "text": "Thank you for the gracious review. Glad Emily was able to help you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "108565517122962575885", "name": "Halie Moss", "time": 1611168354953, "rating": 5.0, "text": "Elwood Staffing is the best place to go! I went to Lincoln, Al and Stephanie Martin helped me through the whole process and got me the job super fast, I definitely recommend her!!!", "pics": null, "resp": {"time": 1611239598096, "text": "Halie, Thank you for the kind words. We are glad we could help you get working. Let us know if there's anything more we can do to be of help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "107099985875538394133", "name": "Amber Key", "time": 1607637217277, "rating": 5.0, "text": "Lisha Kidd is the sweetest lady and so helpful. She had to utmost patience and explained everything perfectly. 10/10 would recommend everyone to this office.", "pics": null, "resp": {"time": 1607957893654, "text": "Thank you for the review, Amber!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "105811967170147778172", "name": "Eric Free", "time": 1617931390732, "rating": 5.0, "text": "very good and prompt staff Stephanie Martin does and awesome job", "pics": null, "resp": {"time": 1618328147577, "text": "Thank you for the review."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "101024322318846994418", "name": "Kristen Iisdell", "time": 1601310531607, "rating": 5.0, "text": "This was the best experience I’ve ever had by employment placement agency. They were professional, patient, & kind. Big shout out to Stephanie Martin who took extra time with me through this experience. All companies should be so lucky to have someone represent their company so compassionately as this employee!", "pics": null, "resp": {"time": 1601905216858, "text": "Kristen, we appreciate the review!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "110617815740424274086", "name": "kevin cunningham", "time": 1621647619866, "rating": 1.0, "text": "All they care about is money! Don't care if your hurt or in need. They are terrible! If you want to give your health away for a money hungry company good luck", "pics": null, "resp": {"time": 1621863739055, "text": "Thank you for taking the time to let us know about your experience with us. Our Associate Engagement team would like to speak with you to find out more about this experience. Please call or text them at 833.402.8521."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "108597685025078841997", "name": "Chardon Wood", "time": 1606853895423, "rating": 5.0, "text": "Mrs. Stephanie Martin was all open arms! Very sweet lady! Helped me with everything I needed to know while I was filling out my information. Highly recommend her! She does a excellent job !", "pics": null, "resp": {"time": 1607353029188, "text": "Chardon, thanks for the review."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "100518869538311302060", "name": "Dontrez Calhoun", "time": 1622215114155, "rating": 5.0, "text": "Emily was a 10 /10 jus great 😊😊", "pics": null, "resp": {"time": 1623334581305, "text": "Thank you! We are happy to help you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "100979785263303640194", "name": "Tammie Alford", "time": 1610752312738, "rating": 5.0, "text": "Stephanie Martin is awesome!! She helped me with the whole hiring process. She's friendly & professional. I would definitely recommend elwood staffing.", "pics": null, "resp": {"time": 1611239688311, "text": "Tammie, Thank you for the kind review. Stephanie is such a gem. We are glad she was able to help you with your job search."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "103252110087039539450", "name": "James Bertram", "time": 1609970001915, "rating": 5.0, "text": "Lisha,was awesome she made me feel\nLike I was at home.she explained everything to me just fine,and she was very nice.The whole\nStaff was there to help me and very professional. Thank you guys ,James Bertram\n\nCan’t wait to start my new career with Elwood\nStaffing of Lincoln,Alabama", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "100504265821544233228", "name": "Jacob Mcnair", "time": 1613002180599, "rating": 5.0, "text": "Stephanie martin ask for her she's so nice and helpful not to mention beautiful 😍 lol", "pics": null, "resp": {"time": 1613570870714, "text": "Thanks Jacob! Glad you had a good experience with Elwood in Lincoln."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "116081578080408293023", "name": "Dawn c Car", "time": 1608310480688, "rating": 5.0, "text": "Mrs Stephanie Martin was an Excellent Worker. She answered all my questions. and stop what she was doing yo HELP Me. She's AWESOME", "pics": null, "resp": {"time": 1608565849344, "text": "Dawn, we appreciate the review."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "107790118173603803575", "name": "Steven West", "time": 1610308782249, "rating": 5.0, "text": "Elwood staffing is a very professional company the young lady that did my process was very professional her name was Stephanie Martin they made me feel very comfortable and expedited the entire process I would recommend them to anyone that is looking for a new career", "pics": null, "resp": {"time": 1610389377500, "text": "Steven, Thank you for sharing your feedback. We are glad Stephanie and the other recruiters were able to help you with your job search."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "104636810568794201816", "name": "Life with Peaches", "time": 1612898410892, "rating": 5.0, "text": "I had  Mrs. Stephanie, she’s real sweet and patient with you . So if you ever go to Elwood ask for her!!!!", "pics": null, "resp": {"time": 1613570924949, "text": "Thank you for the kind review. We are glad you have a good experience with our Lincoln team."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "107952697624107839570", "name": "Tia Caldwell", "time": 1596298276590, "rating": 5.0, "text": "Mrs.Stephanie Martin is amazing. Let me explain. From the time I walked in. Her greeting and smile was everything. Very uplifting and positive. She was very professional. She is that shining 🌟. Kind, helpful, positive, energized, great in so many many ways. Thanks for your time and patience beautiful. Elwood she is a keeper.", "pics": null, "resp": {"time": 1596545508473, "text": "Tia, we appreciate you leaving your review. We are glad to hear Stephanie was able to help you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "103801222268770408285", "name": "Life with Kianna", "time": 1623136488133, "rating": 5.0, "text": "Stephanie & Emily were awesome.", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "104911255414750926313", "name": "Verlencia Caesar", "time": 1620329805143, "rating": 5.0, "text": "Mrs. Emily and Mrs Elisha was awesome.", "pics": null, "resp": {"time": 1620761180946, "text": "Thank you, Verlencia! We have a great staff in Lincoln ready to help you. Please let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "106645510797038584817", "name": "Bethany Payton", "time": 1598025054121, "rating": 5.0, "text": "Stephanie Martin is awesome! She is always smiling when you walk in the door & says hello. She helped me w/my paperwork & bless her heart she is a sweet young lady! She is very professional & easy to talk to.", "pics": null, "resp": {"time": 1598445427920, "text": "Thank you for the kind review, Bethany! We are glad to hear you had a great experience."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "116570947563244603348", "name": "Patty Stuckey", "time": 1607702557144, "rating": 5.0, "text": "Stephanie Martin was Very attentive and knowledgeable of her job. I  felt very comfortable 😌", "pics": null, "resp": {"time": 1607957374708, "text": "Patty, thanks for the review."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "108557844369428129953", "name": "Payton Davis", "time": 1604000441396, "rating": 5.0, "text": "I was help by Stephanie Martin and she was the best!! Very friendly and professional. i will suggest Stephanie to anyone looking to work through Elwood Staffing", "pics": null, "resp": {"time": 1604353136727, "text": "Payton, thank you for the kind review. We are glad to hear you had a great experience."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "117062815207580750782", "name": "Tanya Gilley", "time": 1598471465272, "rating": 5.0, "text": "Stephanie Martinsburg n was the best. She made me feel so comfortable like a family member. I would send anyone there for assistance because she has a great spirit.", "pics": null, "resp": {"time": 1599146002212, "text": "Tanya, thank you for leaving your feedback! We are glad you had a great experience with our team in Talladega."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "100466528845328639650", "name": "Christina Tate", "time": 1584552230274, "rating": 5.0, "text": "One of the best staffing agencies I've ever come across. Friendly, professional, and quick placement. Weekly pay, benefits , and they have a good employer pool as well. 😁 I interviewed with Lisha, and was placed as soon as a spot was open. She was great. The front desk people are amazing too. They're are 2 named Stephanie, and both are super friendly and helpful!!", "pics": null, "resp": {"time": 1584620446529, "text": "Christina, Thank you for the kind review. We are glad we have been able to help you with your job search."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "108961862489830612752", "name": "Jamichael Swain", "time": 1621882181308, "rating": 5.0, "text": "Email did her job at Elwood i would send people’s to her help them get a job", "pics": null, "resp": {"time": 1622126540488, "text": "Thank you. We appreciate you sharing your feedback. Let us know if we can be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "112439020712839318078", "name": "Sharon Gray", "time": 1602728059000, "rating": 5.0, "text": "Stephanie Martin and Crystal were very kind and went above and beyond to make sure my experience was smooth. I left feeling very motivated.", "pics": null, "resp": {"time": 1603729340194, "text": "We appreciate the review, Sharon."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "117499784312714700236", "name": "Podna", "time": 1604662786687, "rating": 5.0, "text": "Loretta Smith is so Dedicated, Helpful,\nand Respectful to all of the individuals she works with at Elwood Staffing. She definitely gets 5 stars for her work performance!!!", "pics": null, "resp": {"time": 1604944180357, "text": "We appreciate the review, Podna!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "117499784312714700236", "name": "Podna", "time": 1604662786687, "rating": 5.0, "text": "Loretta Smith is so Dedicated, Helpful,\nand Respectful to all of the individuals she works with at Elwood Staffing. She definitely gets 5 stars for her work performance!!!", "pics": null, "resp": {"time": 1604944180357, "text": "We appreciate the review, Podna!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "116904406892088780043", "name": "Alisha Stover", "time": 1604044315716, "rating": 4.0, "text": "They went over all information and got me in and out in a timely manner.I also had a wornderful experience with Ms.Stephanie and Ms.Lisha with any questions or help I needed.", "pics": null, "resp": {"time": 1604353115417, "text": "Alisa, thank you for the review!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "108691254149746288970", "name": "Destany Bramlett", "time": 1597678433977, "rating": 5.0, "text": "Stephanie has a magnificent attitude and great personality. She made the process so easy. She brings positive energy to the building. Thank you Stephanie and the entire Elwood staffing crew!", "pics": null, "resp": {"time": 1597783330204, "text": "Destany, we appreciate you leaving a kind review!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "116657807853374939278", "name": "Monica Baker", "time": 1596238895304, "rating": 5.0, "text": "Stephanie Martin was EXCELLENT! She went above and beyond for sure. She helped us all today and her demeanor never changed. She is so friendly and very helpful. This world needs more of \"STEPHANIE'S!\"", "pics": null, "resp": {"time": 1596545572045, "text": "Monica, thank you for the kind review!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "110167556973988910505", "name": "Tasha Smart", "time": 1621250059144, "rating": 5.0, "text": "Stephanie Martin was very professional. She help me get in and out.", "pics": null, "resp": {"time": 1621256439047, "text": "Thank you, Tasha! We are so glad Ms Stephanie was able to help you. Please let us know if there's anything more we can be of help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "105865080811904686529", "name": "jaycob Davis", "time": 1589848829881, "rating": 5.0, "text": "I was so nervous about entering the workforce after 4 years of self employment. I had no idea where to start and decided to give Elwood Staffing my attention and I’m glad that I did! The entire process was smooth and FAST I walked in with only hopes and walked out with a JOB! I was honestly blown away by the level of professionalism within this company, they truly have the staffing game figured out! It’s a pleasure to be a part of the team! Thanks for everything that you all do!", "pics": null, "resp": {"time": 1589889485783, "text": "Thank you for allowing Elwood to help you find a job, Jaycob. We are so glad you trusted us! Thank you for the review."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "118181625058110731913", "name": "Brandon Davis", "time": 1600811985466, "rating": 5.0, "text": "It was a very welcome experience and Stephanie Martin helped me out tremendously throughout the process and was able to answer all of questions and she was extremely kind one of a kind person", "pics": null, "resp": {"time": 1600864841052, "text": "We appreciate the review, Brandon. We are so glad to hear you had a great experience."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "114938739004689944426", "name": "Marc Harris", "time": 1603223099538, "rating": 1.0, "text": "I went in for an interview for a driving job and was told that I didn't have the right experience..total waste of time", "pics": null, "resp": {"time": 1603723752459, "text": "Thank you for sharing your feedback. We will look into this for coaching and training. If you would like to speak with a representative about your experience, please reach out to our Associate Engagement team at 833.402.8521."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "112009322630675110432", "name": "Jherica Jones", "time": 1583183043468, "rating": 5.0, "text": "I really enjoyed my applying at this location . Soon as I came through the door, Ms.Loretta got my situated and properly prepared for my interview. Ms.Stephanie was so welcoming and had the best personality. You can tell she’s such a fun person to work with ! I thought the process would take forever but honestly they got me in & out ! Both of these ladies made me feel so confident and comfortable in searching for a job! Ms. Crystal interviewed me. She is very sweet but She definitely keeps you on your toes! If you sit at her desk , speak clearly , know who you are and what you want ! I suggest anyone starting over come here , they are the best . Good luck everyone !", "pics": null, "resp": {"time": 1583246899817, "text": "Jhereica, Thank you for the review. We are glad you had a good experience. Please let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "113305740627327544343", "name": "Teresa Pilkington", "time": 1596557940671, "rating": 5.0, "text": "I went in and was greeted by Stephanie Martin she had the biggest smile and after I left I felt a lot better then I did before I went in . She makes you feel calm and welcomed . And she even helps you with the computers. Even mrs elisha was so nice to me . She showed me step by step and took their time to help me. I love Elwood and I would recommend anyone to go . Mrs Stephanie will make you feel better and feel welcomed.", "pics": null, "resp": {"time": 1596654505015, "text": "Thanks for sharing this story, Teresa! We appreciate you taking the time to share your experience!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "118352681700870267691", "name": "Emily Hall", "time": 1607377494149, "rating": 5.0, "text": "Stephanie was very helpful and made my experience 100%!", "pics": null, "resp": {"time": 1607958147008, "text": "Thank you for the review!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "105780294478316653908", "name": "Deshana Thompson", "time": 1597873661162, "rating": 5.0, "text": "Stephanie Martin was very pleasant and very professional. She has a very welcoming personality. I like her smile.", "pics": null, "resp": {"time": 1599856387933, "text": "Thank you for the review!!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "106095700102903837838", "name": "Derrick Mathews", "time": 1595431804767, "rating": 5.0, "text": "Stephanie Martin was great and really helpful very polite and interested in helping me and she did as such she was very nice and generous my visit was pleasant and I’d like to thank the company for having such good employees that are really concerned thank you guys", "pics": null, "resp": {"time": 1595595846837, "text": "Thank you for the review Derrick! We are so glad our team in Talladega was able to help you out!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "107055343042911623063", "name": "Frederick DeLeon", "time": 1580750305686, "rating": 5.0, "text": "When I walked in, this girl named Stephanie Martin had the biggest smile on her face and that made my day so much better. I have never been unemployed, so I was in a terrible mood. She was so nice and asked if I needed help with anything multiple times. I would recommend Elwood Staffing to anyone because there were very nice and very professional. Thank you Stephanie for keeping and happy attitude and for making people's days so much better by your personalit .", "pics": null, "resp": {"time": 1581020754988, "text": "Frederick, This is awesome. We are so glad we were able to help you. Please let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "108433037056974779907", "name": "Lakerria Swain", "time": 1602189580957, "rating": 5.0, "text": "Stephanie Martin was very helpful she got be in and out and such a nice person. Elwood is becoming better than before", "pics": null, "resp": {"time": 1602597193829, "text": "Thank you for the kind review!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "115861452978962535229", "name": "Lauren Mattox", "time": 1596555055262, "rating": 5.0, "text": "Stephanie Martin was very friendly and welcoming\nLoretta Harmon was so supportive of me getting a job\nLakiesha was very kind sweet and guided me through everything", "pics": null, "resp": {"time": 1596654662972, "text": "We love hearing stories like this! Thanks for sharing, Lauren!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "111702117769776660034", "name": "amber maddox", "time": 1597181339181, "rating": 5.0, "text": "Stephanie Martin was very helpful with everything. She made the whole process really simple.", "pics": null, "resp": {"time": 1597260672543, "text": "Amber, we appreciate you leaving a review!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "105300695024091936740", "name": "Selina McCay", "time": 1583186394587, "rating": 5.0, "text": "Today I applied with Elwood and spoke with Stephanie Martin in HR. she was such a pleasant person to speak with,  answering all questions effectively.  I could definitely feel her smile through the phone.  Great customer service skills,  can't wait to meet her in person!\nProfessional Yours,\nSelina Kennedy", "pics": null, "resp": {"time": 1583246832417, "text": "Selina, We are glad you had a good experience with Elwood. We hope you have as a great experience every time you interact with our team."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "115205262003748193957", "name": "Mac Williams", "time": 1619555945790, "rating": 5.0, "text": "Good staffing there", "pics": null, "resp": {"time": 1619620910748, "text": "Thank you!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "108527143634828592067", "name": "Barbi Roman", "time": 1597254754557, "rating": 5.0, "text": "Stephanie martin great attitude enjoyed my time at the office..she's great customer service rep", "pics": null, "resp": {"time": 1597260608734, "text": "Barbi, thank you for the kind review!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "108433037056974779907", "name": "Lakerria Swain", "time": 1602189580957, "rating": 5.0, "text": "Stephanie Martin was very helpful she got be in and out and such a nice person. Elwood is becoming better than before", "pics": null, "resp": {"time": 1602597193829, "text": "Thank you for the kind review!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "106919708935989737436", "name": "Alicia Walls", "time": 1582732365036, "rating": 5.0, "text": "Stephanie Martin is the sweetest and funniest person. I've never walked in and she's not smiling or greeting you. She's very down to earth, she will make you smile, her personality is all it's own and I love it. Keep up the good work.", "pics": null, "resp": {"time": 1582819277007, "text": "Alicia, Thanks for choosing Elwood. We are so happy to work with you. Please stop by anytime."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "115205262003748193957", "name": "Mac Williams", "time": 1619555945790, "rating": 5.0, "text": "Good staffing there", "pics": null, "resp": {"time": 1619620910748, "text": "Thank you!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "103850927926193516928", "name": "Tyea Whitson", "time": 1581374734987, "rating": 5.0, "text": "Thank you so much Mrs. Lisha Kidd I appreciate all the work you have helped me with. You are a wonderful person and I am so thankful for you as an a staffing recruiter. You always keep your word about a job,call,or anything u say you'll  thanks once again for being a wonderful role model and helping me out with this job. Elwood staffing agency is a blessing and everyone there have positve, professional,outgoing attitudes and treat everyone equal I will recommend anyone to Elwood staffing.", "pics": null, "resp": {"time": 1589489829885, "text": "Thank you for sharing your experience, Tyea! We are so happy to hear Lisha was able to help you"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "108654101191982298830", "name": "Curt Davis", "time": 1611123550078, "rating": 5.0, "text": "Stephanie Martin was very helpful, encouraging, and professional", "pics": null, "resp": {"time": 1611239635796, "text": "Thanks, Curt. We appreciate the opportunity to work with you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "104982253559961421326", "name": "Della Wilson", "time": 1580408643911, "rating": 5.0, "text": "I've been employed by this company for a little over 2 years. Went in for an interview, started working not even a full week later. Great benefits and pay, absolutely no complaints. Contacted\nthe office about an important question and  Stephanie Martin not only answered my  question but solved the problem as well. Thank you.", "pics": null, "resp": {"time": 1580479770465, "text": "Della, Thank you for your hard work and dedication to Elwood Staffing. We are glad we could help you. Please reach out to us with any questions or concerns. We are always happy to help."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "108527143634828592067", "name": "Barbi Roman", "time": 1597254754557, "rating": 5.0, "text": "Stephanie martin great attitude enjoyed my time at the office..she's great customer service rep", "pics": null, "resp": {"time": 1597260608734, "text": "Barbi, thank you for the kind review!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "106024370689178366968", "name": "I SmithNwesson", "time": 1596478635022, "rating": 5.0, "text": "Stephanie was really friendly and helpful even though she had a million things going on", "pics": null, "resp": {"time": 1596545380783, "text": "Thank you for the kind review!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "115617249633954810033", "name": "Henry Williams", "time": 1597179896102, "rating": 5.0, "text": "I recommend talking Stephanie Martin. She was very helpful and courteous.", "pics": null, "resp": {"time": 1597260693449, "text": "Thank you for the kind review, Henry!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "104407383221102506319", "name": "Mildred McCain", "time": 1582055360475, "rating": 5.0, "text": "The moment I walked in I was greeted by several associates. Everyone was very nice and helpful. I feel Paige offers extraordinary expertise to this establishment. She helped me succeed in what I wanted to achieve. Many thanks to all of the staff at Elwood Staffing Talladega Al.", "pics": null, "resp": {"time": 1582122101891, "text": "Thank you for the review, Mildred.  We are glad you had a good experience. Please let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "103259374464476506342", "name": "scott lawerence", "time": 1598213891286, "rating": 5.0, "text": "stephanie martin was\nExcellent ,and such a sweetheart,great personality and cutie too ,lol , and very helpful , and quike with the process , every business should have someone like her, working for them", "pics": null, "resp": {"time": 1598445266703, "text": "Thank you for the review, Scott! We are glad to hear Stephanie was able to help you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "112410786928117569190", "name": "Cheryl Smith", "time": 1602641808815, "rating": 5.0, "text": "Stephanie Martin and Crystal were very knowledgeable and helpful! Great place!", "pics": null, "resp": {"time": 1603729398727, "text": "Thank you for the kind review, Cheryl!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "104313820928335316222", "name": "gavin hays", "time": 1597349159577, "rating": 5.0, "text": "Stephanie Martin is amazing and is great at helping people out with every question you ask her! Thank you!", "pics": null, "resp": {"time": 1597783455572, "text": "Thanks for the review, Gavin! We are glad Stephanie was able to help you out."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "102677718103011096448", "name": "Jason Stringer", "time": 1597782412570, "rating": 5.0, "text": "Stephanie Martin was awesome.  Very helpful and professional.", "pics": null, "resp": {"time": 1597783032172, "text": "Jason, thank you for the review!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "100025547226507648050", "name": "Gavin Murray", "time": 1597083579805, "rating": 5.0, "text": "Stephanie Martin andMs.Crystal were great leaders and support at Elwood very professional!Thanks Elwood", "pics": null, "resp": {"time": 1597260922705, "text": "Gavin, we are so glad you had a great experience with our team in Talladega! Thank you for the review."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "113726399754020524829", "name": "Courtney Looney", "time": 1583442974464, "rating": 5.0, "text": "I had a great experience! The staff was very helpful and friendly. Stephanie Martin has a great personality and she is very helpful", "pics": null, "resp": {"time": 1583504566094, "text": "Courtney, Thank you for the sweet review. We love hearing about Miss Stephanie and your experience. Please let us know if there's anything more we can do to help."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "114778182118900383877", "name": "George Truss", "time": 1613688720678, "rating": 5.0, "text": "Stephanie Martin was very professional with my process in the Lincoln, Al office", "pics": null, "resp": {"time": 1613740880184, "text": "George, We are glad Stephanie was able to help you with the application process. Let us know if there's anything more we can do to be of help."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "115446784112446673403", "name": "Gary Jemison", "time": 1582316630989, "rating": 5.0, "text": "Stephanie Martin was so very helpful and friendly.  I needed her assistance  navigating  thru the enrollment process on several occasions. She had wonderful patience. She is great.", "pics": null, "resp": {"time": 1582572439388, "text": "Gary, Thank you for sharing your feedback about your recent experience. We are glad we could be of help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "114790668331326732485", "name": "Candice Norton", "time": 1582649825155, "rating": 5.0, "text": "Stephanie Martin was super sweet and helpful. She went above and beyond to help me and my boyfriend with everything. 5/5 RECOMMEND !!", "pics": null, "resp": {"time": 1582809962594, "text": "Candice, Thank you for the kind review. We are glad Stephanie was able to help you both with your job search. Please let us know if there's anything we can do to be of further help."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "103910994205262515292", "name": "Queann Williams", "time": 1579559533831, "rating": 5.0, "text": "Mrs. Paige was very friendly and helpful! My process was very fast. I will definitely recommend her personally to a friend.", "pics": null, "resp": {"time": 1579628110880, "text": "Queann, Thank you for the kind review. We are glad Mrs. Paige was able to help you. We are all happy to help anytime."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "103910994205262515292", "name": "Queann Williams", "time": 1579559533831, "rating": 5.0, "text": "Mrs. Paige was very friendly and helpful! My process was very fast. I will definitely recommend her personally to a friend.", "pics": null, "resp": {"time": 1579628110880, "text": "Queann, Thank you for the kind review. We are glad Mrs. Paige was able to help you. We are all happy to help anytime."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "102483046496889479923", "name": "Chrstal Johnson", "time": 1581004438619, "rating": 5.0, "text": "Stephanie Martin is a pleasure to meet. She was very helpful, and friendly. I was promptly helped and was offered a job. I highly recommend Elwood staffing in talledega!", "pics": null, "resp": {"time": 1581020624292, "text": "Chrystal, Thank you for the review. We are glad you had a good experience. Please let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "116716882677599611200", "name": "Melinda Nix", "time": 1583428527124, "rating": 5.0, "text": "Stephanie Martin is the most sweetest employee I have ever met. She helped me out with alot! Best attitude ever!! Most definitely should get employee of the month!", "pics": null, "resp": {"time": 1583504657587, "text": "Melinda, Thank you for sharing about your experience. We are so glad you got to meet with Stephanie and get registered with Elwood. We will pass this along and let her know you were pleased with her service."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "108638104223551584762", "name": "Christina Gamez", "time": 1579970643809, "rating": 5.0, "text": "Very friendly staff! I loved Lisha Kidd, she was amazing! My first experience at a staffing place, and I felt very welcomed and greeted with smiles.", "pics": null, "resp": {"time": 1580151776085, "text": "Christina, Thank you for sharing. We are glad you picked Elwood for your first staffing experience. We are always happy to help. Please reach out with any questions."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "112656073232772879256", "name": "Megan Carnes", "time": 1579199120325, "rating": 5.0, "text": "Went and done my application Wednesday, had an interview the same day, went back today and done all of my paperwork and I start work tuesday. The staff are awesome. They are poilte an very helpful. Mrs. Lisha is absolutely wonderful to work with.", "pics": null, "resp": {"time": 1579271775573, "text": "Megan, Thank you for sharing this feedback with us. We are glad we could help you find a great job. Lisha is the best. She is so good helping people find perfect jobs. We hope things continue to go well for you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "110356527724718715402", "name": "Jaedon Smith", "time": 1583194904467, "rating": 5.0, "text": "I applied for a job today and Stephanie Martin was an amazing help. She was really funny and nice while also helping me to complete my application.", "pics": null, "resp": {"time": 1583246743788, "text": "Jaedon, Thank you for the kind review. We are glad Stephanie was able to help you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "115725821351179621962", "name": "Joshua Smith", "time": 1599673159607, "rating": 5.0, "text": "Stephanie Martin was super nice and helpful.", "pics": null, "resp": {"time": 1599855041500, "text": "Thanks for the review!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "115813829204026825390", "name": "Kennedy Watson", "time": 1599661447981, "rating": 5.0, "text": "Stephanie is always so nice and helps with everything", "pics": null, "resp": {"time": 1599855016000, "text": "Thanks for the kind review!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "111182708643638018682", "name": "Jasmine Hart", "time": 1584534557852, "rating": 5.0, "text": "Paige, Chrystal and all the other friendly and polite staff of Elwood Staffing have been a great help to me and have aided me well in my job search!", "pics": null, "resp": {"time": 1584544016368, "text": "Jasmine, We are glad we could help you with you job search. Our team tries to make it a good process for everyone. If you have any questions about the process you can stop by our office or give us a call."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "107795258992628219847", "name": "Aaliyah Dorman", "time": 1582562872529, "rating": 5.0, "text": "This Branch has worker's that aren’t rude and very friendly they make you feel welcome and really want to help you and Lisha is very helpful go to her", "pics": null, "resp": {"time": 1582574041112, "text": "Aaliyah, Thank you for the review of your experience with us. We are glad you had a good experience. Lisha is so kind. We are all happy to help."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "117196102399973337740", "name": "Patrick Marbury", "time": 1590610959607, "rating": 4.0, "text": "This place was great at walking me through the hiring process and procedures!", "pics": null, "resp": {"time": 1590677054354, "text": "Thanks for the kind review, Patrick!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "105266354102222328683", "name": "Christopher Ivey", "time": 1611349108520, "rating": 5.0, "text": "Thank you Stephanie Martin for all your help!!!", "pics": null, "resp": {"time": 1611586460495, "text": "Thank you, Christopher. We appreciate the review."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "112759598011972891141", "name": "Mike Lopreste", "time": 1583949805956, "rating": 5.0, "text": "Elwood got me the job . Paige Caldwell was was great . Amanda &Mark saw it threw .great team at elwood .... Thank you so much", "pics": null, "resp": {"time": 1584024797589, "text": "Congratulations on the new job. We are glad we could help you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "118400228335022374407", "name": "Benitra Mckinney", "time": 1582144273999, "rating": 5.0, "text": "They are a wonderful staff and they work with you. I really recommend them if you are looking for a job.", "pics": null, "resp": {"time": 1582228325041, "text": "Benitra, Thank you for the kind review. We appreciate the recommendation. We will be happy to help with your employment needs."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "108615805218772511770", "name": "Tracy Church", "time": 1580947269849, "rating": 5.0, "text": "Everyone  there was helpful but Loretta and and Stephanie  Martin  were  on point  with  everything i needed  help with  . Thank you  pretty ladies  !", "pics": null, "resp": {"time": 1581020660484, "text": "Tracy, Thank you for the review. We are glad you had a good experience with Loretta and Stephanie and our team in Talladega. Please let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "106081931820988050751", "name": "Joshua Vise", "time": 1598427144880, "rating": 5.0, "text": "Friendly, professional, and above all honest . Very thing they told me is exactly how is was.", "pics": null, "resp": {"time": 1598444961732, "text": "Thank you for the review, Joshua! We are glad to hear you had a great experience."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "102459871589685539012", "name": "Vincentw Mckuhen", "time": 1582066338261, "rating": 5.0, "text": "They where good friendly people and every helpfull and I thank them for that I would recommend them to any one looking for a job", "pics": null, "resp": {"time": 1582122631525, "text": "Thank you for the kind review. We are glad we could help you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "116249466018985261667", "name": "Benjamin BUCKNER", "time": 1581107332448, "rating": 5.0, "text": "Elwood Staffing agent: Stephanie Martin, from Talladega Alabama, did an amazing job getting me a good career job and worked swiftly, she has a great personality and very professional!", "pics": null, "resp": {"time": 1581347901983, "text": "Benjamin, Thank you for the review. We are glad you had a good experience. Please let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "112697707761965367826", "name": "April Nelson", "time": 1616092346043, "rating": 4.0, "text": "Great 👍", "pics": null, "resp": {"time": 1616096360841, "text": "Thank you!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "113782626789977939956", "name": "Chance Haney", "time": 1580864970870, "rating": 5.0, "text": "I came in looking for a job and I was in and out with a new job within 30 minutes and the employees are nice and very helpful", "pics": null, "resp": {"time": 1581020677253, "text": "Chance, Congrats on the new job. We are glad we could help."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "114124190247355173772", "name": "elizabeth reynolds", "time": 1580826597947, "rating": 5.0, "text": "i walk into elwood staffing yesterday and this girl stephanie martin welcome me in with a big smile and she was so sweet and kind made my day so much better.we need more people like her", "pics": null, "resp": {"time": 1581020686981, "text": "Elizabeth, Thank you for the review. We are glad you had a good experience. Please let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "109794541108779118294", "name": "Yvette Kidd", "time": 1614613972954, "rating": 5.0, "text": "I went to Elwood Staffing on two occasions. The first time I was there, I was looking for a part-time summer job since I was a college student. Ms. Lisha found a great job for me for that period of time. The second time I went through Elwood I was looking for another part-time job for a longer period of time. Ms. Lisha paired me with a clerical job and now I am full time with the business and love it! Please see her for any questions about finding a temp job. She was wonderful, polite, kind, and professional.", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "107295550758958280287", "name": "Orlando Withers", "time": 1578958054060, "rating": 5.0, "text": "Mrs. Lishia Kidd was the best to work with. She helped me find employment with no problem.", "pics": null, "resp": {"time": 1579116829564, "text": "Orlando, Thank you so much. We appreciate your kind words."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "118090045818705851434", "name": "Gerald Hubbard", "time": 1573651241369, "rating": 5.0, "text": "Anyone looking for work can easily find it with Elwood. I've just received a full-time position.", "pics": null, "resp": {"time": 1573740642435, "text": "Gerald, Congratulations on the full-time job! We are excited for your new adventure. Let us know if there's anything more we can do to be of help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "116511318190100200291", "name": "Candice Vickery", "time": 1568168778917, "rating": 5.0, "text": "Everyone there was really nice and helpful.\nMrs.Chrystal was very nice and very informative on what to do. I went in on monday and she called me for a job on tuesday. Thank you so much Chrystal you are awesome.....", "pics": null, "resp": {"time": 1568310356989, "text": "Candice, Thank you for taking the time to share your feedback. We are thrilled you had a good experience. Let us know if there's anything more we can do to be of help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "107534615376977646955", "name": "Heaven Yates", "time": 1534438545784, "rating": 5.0, "text": "Everyone up there is so nice a s they do their very best to help you. Mrs. Lisha Kidd was the one over me and she has been absolutely amazing to me. 5 stars to Mrs. Lisha and the rest of Elwood's staff!!", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "102795959177739672362", "name": "nikita anderson", "time": 1556110708876, "rating": 5.0, "text": "Christy was great! Went in on a Friday, called on a Monday and was approved for the job. Went this past Tuesday to fill out paperwork and she was very helpful and answered what was asked. Thanks so much!", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "100540402678401881033", "name": "Regina Hawkins", "time": 1537909097130, "rating": 5.0, "text": "Ms Lisha Kidd has been very professional, efficient, and thorough. She has made the process easy, fast and stress free. I am excited to start work. So happy I came to Ellwood Staffing, they have taken good care of me.", "pics": null, "resp": {"time": 1537962050155, "text": "Regina, We are happy you came to Elwood Staffing. We are happy to help. We are looking forward to working with you. Please let us know if we can be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "114900065393431413014", "name": "Ronnie Rhodes", "time": 1582839964560, "rating": 5.0, "text": "Stephanie Martin and all the staff was so helpful and friendly! Great smiles and teamwork!!!!!", "pics": null, "resp": {"time": 1582898667509, "text": "Thank you Ronnie. We are super happy we could help you with your job search. Let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "116032787933658525685", "name": "Last Day", "time": 1623271885803, "rating": 5.0, "text": "Stephanie Martin", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "100327105080752868351", "name": "Leon Dudley", "time": 1571688397061, "rating": 5.0, "text": "They was great they worked with me around my schedule while i was out on the road", "pics": null, "resp": {"time": 1571839714421, "text": "Leon, We are glad we could hep you and accommodate you. Let us know if you need anything more."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "109619669295367708099", "name": "Andrea Garrett", "time": 1553023063995, "rating": 5.0, "text": "Christy was phenomenal and she got me results so fast I could have gone anywhere but I am so very glad that I came here and I will be starting my new position tomorrow in the work environment that I love. Thanks and I highly recommend ELWOOD STAFFING", "pics": null, "resp": {"time": 1553543724271, "text": "Hi Andrea, Thank you for sharing your feedback with us. We are glad we could help you with your job search."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "103958009139390873997", "name": "James Williams", "time": 1579896155813, "rating": 5.0, "text": "The staff are all incredibly kind and helpful. Shout out to Stephanie for going above and beyond in helping me out and easing my worries.", "pics": null, "resp": {"time": 1580151550007, "text": "James, Thank you for the kind review. We are so glad you've had a good experience. Please let us know if we can be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "113881056008659959118", "name": "Timothy Kendrick", "time": 1582159568189, "rating": 5.0, "text": "STEPHANIE MARTH WAS SO KIND AND HELPFUL", "pics": null, "resp": {"time": 1582228345297, "text": "Tim, Thank you for the feedback. We love hearing this."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "110124819611487197224", "name": "Rishawn Hare", "time": 1539976162557, "rating": 5.0, "text": "Elwood Staffing is the best temp service I ever been too! They are awesome, great attitudes and good customer service! But the main one who help me getting a job is TARAH FOSTER, she's amazing and I just met her lol, I went to do my application for the first time and BOOM I HAVE A ORIENTATION on Monday! God is Good🙌", "pics": null, "resp": {"time": 1539977127929, "text": "Thanks for the review, Rishawn! I'm glad to hear that you had a great experience."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "100791903595388258568", "name": "The Solitary Eclectic Witch", "time": 1558122129491, "rating": 5.0, "text": "I’ve worked for Elwood for 16 months and had my rollover this past Monday.🥰 I must say,these ladies are AWESOME!! I referred my son to them who is happily on his 2nd month employed through Elwood. 🥰🥰 These ladies work hard to get you into a position you fit. They kept in contact with me via text and email the whole time. They are super friendly and welcome ALL to apply. Should you have any problems, you have but to call them and they’ll work twards fixing the problem. I try referring everyone who asks me “is anyone hiring?” To Elwood. Thank you ladies!!! Y’all Rock!!! 🥰🥰", "pics": null, "resp": {"time": 1558123109596, "text": "Congratulations!! We are so excited for you. We are glad we could be a part of your employment history. Please send us your referrals, any friend of yours is a friend of ours. Let us know if there's anything more we can do to be of help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "111378471123266931622", "name": "Amiya Sillmon", "time": 1568150125935, "rating": 5.0, "text": "Crystal taunton is best person in the word helping people find a good job she make sure that you are the right person for the job She always has candy on the desk and smile on her face she is  the best Elwood staffing employee that they ever had thanks Crystal taunton", "pics": null, "resp": {"time": 1568308686414, "text": "Amiya- Thank you for the kind review. We are going to make sure Crystal is recognized for this. Thank you so much!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "110724351549163655585", "name": "Christina Browne", "time": 1539912078536, "rating": 5.0, "text": "Anyone who has been job hunting knows what a nightmare it can be, but Elwood did make the process a bit easier (still stung like Rocephin 😖). Tarah worked with me to find a job that works with my family schedule. I had just about given up hope when she said to come see her again until she spoke those sweet words of \"I have you on the spread sheet to go to Honda for processing tomorrow. Congratulations \". Yep, I would say she is one of my favorite people and Elwood my favorite staffing company.  Thank Tarah!", "pics": null, "resp": {"time": 1539977317541, "text": "I'm glad you didn't give up hope, Christina!  Good luck with your new job!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "104791028044471486341", "name": "Kristin Sanders", "time": 1543875847100, "rating": 5.0, "text": "I need to brag on Christy for a minute. Her attitude, even through the madness, was tip top! She was very informative & helpful. The whole office as a whole had a wonderful attitude.", "pics": null, "resp": {"time": 1543928845021, "text": "Kristin, Thank you for leaving a review of your recent visit with us. We are glad we could help you. Please let us know if there's anything more we can do to be of help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "103005728783496499949", "name": "Albert Marchese Jr", "time": 1577325569922, "rating": 5.0, "text": "Very nice people best in Metro Birmingham!", "pics": null, "resp": {"time": 1577370655485, "text": "Thanks for the review, Albert!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "115549503858830852062", "name": "jackieinthabox K", "time": 1564418970048, "rating": 5.0, "text": "Everyone that works there has a lovely attitude :-) the lady that helped me was named Christy, she was so sweet, professional and informative.", "pics": null, "resp": {"time": 1564428782729, "text": "Thank you very much for the kind review, we love it. We are so happy you had a good experience with us."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "103002735162721394039", "name": "Annie Littleton", "time": 1564692666924, "rating": 5.0, "text": "Every one here is very patient and calm no attitude or anything they greet you when you coming and going I just love coming", "pics": null, "resp": {"time": 1564748877066, "text": "Annie, Thank you for the kind review. You are always welcome to visit our office."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "114039495064529915424", "name": "FXNHD", "time": 1534955495607, "rating": 5.0, "text": "Elwood has to be the best Temp Service that I've ever been employed through. Ms. Christy was a GREAT help! She made sure to have my packets and information ready when needed and was ALWAYS done in a timely fashion.", "pics": null, "resp": {"time": 1534957276989, "text": "Thanks for the positive review Frank. We're glad you had a good experience. We look forward to working with you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "106732112998911557215", "name": "BreAnna Thompson", "time": 1544571245860, "rating": 5.0, "text": "They provided me with great and fast service.! Christy is the best. She was very friendly and down to earth. I received a job that same week.! Thank you all.!", "pics": null, "resp": {"time": 1544621460267, "text": "BreAnna, Congratulations on the new job! We are glad we could partner you with a great company. Please let us know if we can be of help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "109053538719474652574", "name": "Mia Allen", "time": 1535143571780, "rating": 5.0, "text": "Elwood Staffing is a really good place if you’re looking for a job. They were very fast and professional. Mrs. Christy was over me. She was a big big help. Her attitude was amazing, you can tell she loves what she does. The front desk ladies were also very amazing and made sure to be there if I needed help. Kudos to Mrs. Christy and the whole Elwood Staff☺️", "pics": null, "resp": {"time": 1535371664243, "text": "Thank you, Mia! We appreciate you taking the time to give your feedback on your experience with Elwood Staffing.  Our staff is awesome and we really appreciate the shout-out. We'll be sure to share this with them."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "116227560028953320488", "name": "Austin Taunton", "time": 1527087892445, "rating": 5.0, "text": "I am a college student and needed some extra money.  I completed a temp assignment for the Talladega office and it was a great experience. The ladies in that office are very sweet and professional. They are always super busy!! I appreciate the help when I needed it.  I will be using them again in the future.", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "108991360637376188475", "name": "Coriande Brown", "time": 1558632591804, "rating": 5.0, "text": "This staffing service is phenomenal. Christy helped me get the job that I wanted. 10 out of 10 would go back", "pics": null, "resp": {"time": 1558633771180, "text": "Coriande- They are the best. We are glad Christy was to help you get the job you wanted. Please let us know if we can help you further."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "105542055294201917691", "name": "Katelyn Wallace", "time": 1559249097241, "rating": 5.0, "text": "An amazing place the people are so sweet and helpful, I’d highly recommend using if you’re looking for a job.", "pics": null, "resp": {"time": 1559578870505, "text": "Katelyn- Thank you for the kind review. We are glad we could help you with your job search. Please let me know if there's anything we can do to be of help."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "117521533580697848061", "name": "Johnathan Edgeworth", "time": 1580322366980, "rating": 5.0, "text": "Great staff, very helpful especially Dorrie Scott!", "pics": null, "resp": {"time": 1580480350051, "text": "Johnathan, Thank you for sharing your feedback. We are glad Dorrie could help you. Don't hesitate to reach out if there's anything we can do to be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "106290742933759169505", "name": "Anna James", "time": 1568336026271, "rating": 5.0, "text": "Crystal Taunton @ Elwood in Talladega helped me get my job and I am so thankful! I just got hired on full time where she placed me, she is super nice as well!", "pics": null, "resp": {"time": 1568657723946, "text": "Anna, Congratulations on getting hired full-time by the company! We are so excited for you!! This made our day!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "114554255372934662435", "name": "Megan Pearson", "time": 1527182768208, "rating": 5.0, "text": "Just wanted to praise Elwood & their staff! The Talladega office is amazing!! If you’re looking for a job, I highly recommend Elwood & Kaitlin! She is very friendly & helpful in finding a job that’s right for you!!", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "106290742933759169505", "name": "Anna James", "time": 1568336026271, "rating": 5.0, "text": "Crystal Taunton @ Elwood in Talladega helped me get my job and I am so thankful! I just got hired on full time where she placed me, she is super nice as well!", "pics": null, "resp": {"time": 1568657723946, "text": "Anna, Congratulations on getting hired full-time by the company! We are so excited for you!! This made our day!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "108991360637376188475", "name": "Coriande Brown", "time": 1558632591804, "rating": 5.0, "text": "This staffing service is phenomenal. Christy helped me get the job that I wanted. 10 out of 10 would go back", "pics": null, "resp": {"time": 1558633771180, "text": "Coriande- They are the best. We are glad Christy was to help you get the job you wanted. Please let us know if we can help you further."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "105752608021662809838", "name": "Denise Oliver", "time": 1546019220586, "rating": 5.0, "text": "I met Christy last Wednesday with hopes of finding a job before going into the new year. She called Thursday morning saying I got approved for Honda. She kept me updated on the next steps and how everything works. This lady is a Godsend I really appreciate everything she has done for me thus far!❤🤗\n-Letrell.", "pics": null, "resp": {"time": 1546030228664, "text": "We are so glad to help!  Thanks for all of the kind words."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "103496018779386589953", "name": "Jennifer Castleberry", "time": 1526328222758, "rating": 5.0, "text": "The ladies at Elwood Staffing in Talladega are professional, kind, caring and truly know what is means to work as a team with clients, associates and each other. They value every applicant that comes through the door, every client they have the opportunity to service and they truly love helping people!!", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "108270490597220543448", "name": "Alexis Coleman", "time": 1561654612015, "rating": 5.0, "text": "Always friendly and very helpful the best Elwood I’ve ever been too!!", "pics": null, "resp": {"time": 1561748399095, "text": "Alexis, Thank you for the kind review. We are glad we could help you. Let us know if there's anything more we can do to be of help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "114015066810274934787", "name": "Tiarrial Duncan", "time": 1527084501233, "rating": 5.0, "text": "Elwood Staffing is a great place to go if you’re looking for a job. Miss Christy and the staff is very helpful and they do a great job getting you set up for employment! If needed, I will be back.", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "113527000680811208140", "name": "Sydney Ariel", "time": 1529506017908, "rating": 5.0, "text": "Elwood is a great place to go. Very friendly and helpful staff! Mrs. Barnwell in particular was very helpful and professional to me over the phone.", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "117417694353175756247", "name": "Viv Woo", "time": 1546547063836, "rating": 5.0, "text": "Very helpful and attentive! Friendly staff willing to assist with employing dependable workers!", "pics": null, "resp": {"time": 1546608507222, "text": "Vivian- Thank you for the kind words. We are so glad we could be of help to you. Please let us know if there's anything more we can do to be of help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "116094952635459330263", "name": "Dakota Hambleton", "time": 1552540129159, "rating": 5.0, "text": "Christy is my Elwood Rep and I have had the BEST experience Ive ever had with any staffing company in Alabama. I love Elwood's values and customer service.", "pics": null, "resp": {"time": 1552562316174, "text": "Dakota, Thank you for the kind word and recognizing Christy. We work really hard to be the best in Talladega for the people of Talladega. Let us know if there's anything we can do to help you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "100748507889760343295", "name": "Jade Mitchell", "time": 1585325155389, "rating": 1.0, "text": "very rude people that work there when I call over the phone, and I do not appreciate it. Won’t get my business again.", "pics": null, "resp": {"time": 1589471395139, "text": "Thank you for sharing your feedback. We will look into this for coaching and training. If you would like to speak with a representative about your experience, please reach out to our Associate Engagement team at 833.402.8521."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "111587119245463327689", "name": "Cali Triplett", "time": 1543265520277, "rating": 5.0, "text": "Elwood Staffing is by far the best Temp Force! Gave me the best and fast service. Thank you Miss Lisha Kidd for this opportunity!!", "pics": null, "resp": {"time": 1543267476658, "text": "Thanks for the review, Cali! We are always happy to help!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "113376276533282859504", "name": "Ground Food", "time": 1560291464803, "rating": 3.0, "text": "A good way to get hired onto Honda. Or get your foot in the door without a special degree. Infact I think the only way. You have to spend way to much time to get hired onto Honda. Its excruciating. Honda is already strict. I have no problem with that. But a temp agency compared to that is too far. Getting less pay and worse benefits is fine. But they need more PTO and quicker attendance forgiveness. Also they need to give each person a pamlet evertime they update something and go over the best ways to not miss days. I was unaware of some because they didnt go over it at all or enough and it cost me two points instead of one. Also they(the elwood office) make mistakes just like anyone\nBut there mistakes can cost you your job or get you a piont. And they would never take the fall.", "pics": null, "resp": {"time": 1560337961740, "text": "Thank you for sharing your feedback with us on your experience working at Honda. We will pass this along for coaching and training. We are perplexed on the mistake you reference. If you would like to speak to someone further about your experience, please reach out to our Associate Engagement team at 812.418.0962."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "113527000680811208140", "name": "Sydney Ariel", "time": 1529506017908, "rating": 5.0, "text": "Elwood is a great place to go. Very friendly and helpful staff! Mrs. Barnwell in particular was very helpful and professional to me over the phone.", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "104089158570477575432", "name": "Magic Shoota", "time": 1557264775585, "rating": 5.0, "text": "Christy was very helpful for me with updating all my information and getting me a job the first time I went to apply for one. It was a good experience and very friendly environment. I highly recommend Elwood Staffing in Talladega and I Highly recommend Christy as a Rep to help you with all your info and getting you a job ASAP.", "pics": null, "resp": {"time": 1557338000877, "text": "Awe, thank you. We are glad you've had a good experience with us. Our team in Talladega is awesome. You are very fortunate to work with any of our recruiters."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "118207898451103417035", "name": "Donna Bruce", "time": 1535065361577, "rating": 5.0, "text": "Crystal was fantastic. Very efficient and curtious. I could not have asked to have been treated with more respect.\nThe staff at my assignment however could use some improvement on thier communication skills. Things they told us were confusing and contradictory at times. Please note i am not speaking about the people in the local office. They were great.\nI must say I am very appreciative.", "pics": null, "resp": {"time": 1535044608681, "text": "Donna, we appreciate your feedback. This is very useful information. We'll follow up with the local team to learn how we can better assist our associates and make the process easier. Thanks for sharing."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "114015066810274934787", "name": "Tiarrial Duncan", "time": 1527084501233, "rating": 5.0, "text": "Elwood Staffing is a great place to go if you’re looking for a job. Miss Christy and the staff is very helpful and they do a great job getting you set up for employment! If needed, I will be back.", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "111032128381088449222", "name": "Tatiyana Smith", "time": 1549042129646, "rating": 5.0, "text": "I had the best experience at Elwood staffing with Christy. Thank you soooo much. You’re the best!", "pics": null, "resp": {"time": 1549044873967, "text": "Tatiyana- Thank you so very much for taking the time to give your feedback. We are thrilled you had a good experience. Please let us know if you have any questions we can answer for you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "114526024123953484218", "name": "Zac Nabors", "time": 1538951224873, "rating": 5.0, "text": "I came up there this past Tuesday looking for employment and the staff at Talladega was the nicest, most driven people I think I've ever met, certainly the best staffing company around, in particular there is an employee named tarah who works there and she is great at what she does! She loves her job and certainly deserves a raise or possible promotion, if I find anyone looking for employment I will definitely refer y'all!", "pics": null, "resp": {"time": 1539000725650, "text": "Zac, Thank you for the kind review. We are so glad you stopped by our office and had the opportunity to meet with our staff. Let us know if there's anything we can do to be of further assistance to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "118263180137075352541", "name": "Billy Bedford", "time": 1544717279427, "rating": 5.0, "text": "Christy was awesome , she was amazing and easy to work with . It was a great experience 👍🏾", "pics": null, "resp": {"time": 1544800721466, "text": "Billy, Thank you for the shout-out! We love it. We are so glad to work with you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "101938330096883006001", "name": "Abril Chavarin", "time": 1551904087058, "rating": 5.0, "text": "Very fast service and sweet employees! Got me a job in less than a day!", "pics": null, "resp": {"time": 1551963972130, "text": "Abril- Congrats on the new job! We are glad we could help you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "111005854575791379259", "name": "Rachel Garrett", "time": 1580393392080, "rating": 4.0, "text": "I went in early this morning and was helped right away. Thanks to Ms. Loretta.", "pics": null, "resp": {"time": 1580480604850, "text": "Rachel, You are too kind. Thank you for the opportunity to help you with your job search."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "107281377975825932122", "name": "James Jordan", "time": 1553624776157, "rating": 5.0, "text": "Kaitlyn really helped me get a job fast and easy was really nice", "pics": null, "resp": {"time": 1553627225741, "text": "James, We are glad we could help with your job search. Let us know if there's anything we can do to be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "101244023465299012057", "name": "Dennis Clanton", "time": 1534184484764, "rating": 5.0, "text": "Great help and working with me. I highly recommend. Thank you Crystal Taunton.", "pics": null, "resp": {"time": 1534187769387, "text": "Thanks for the shout-out Dennis. Crystal is awesome and we are so glad you had an opportunity to work with her. Have a fabulous day!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "111950993615397052322", "name": "Kelsey Thompson", "time": 1546894362639, "rating": 5.0, "text": "Super friendly and helpful! Would recommend to anyone looking for a job!", "pics": null, "resp": {"time": 1546960178995, "text": "Kelsey, Thank you for sharing your feedback. We are glad we could help you. Have a great 2019!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "108462632644228075314", "name": "Hunter Isbell", "time": 1539296819432, "rating": 5.0, "text": "I had a great experience at Elwood Staffing in talladega. Tarah helped me so much and I’m currently employed through Elwood at Honda, I definitely recommend.", "pics": null, "resp": {"time": 1539351895596, "text": "Hunter, Congratulations on the new job! Honda is a fantastic place to work."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "116051997582261836486", "name": "Katelynn Lackey", "time": 1538162026750, "rating": 5.0, "text": "Tarah was very helpful I Would recommend all my friends to come here for a job", "pics": null, "resp": {"time": 1538162943715, "text": "Thank you for the review, Katelynn. We are happy to help you anytime."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "101295439790439400286", "name": "Tatiana Gulley", "time": 1544131056777, "rating": 5.0, "text": "Great service Very helpful and friendly Kaitlyn and Mrs Lisa Are Great nicest people ever", "pics": null, "resp": {"time": 1544721430928, "text": "Tatiana, Thank you for such a kind review. We love hearing this. Come back and see us."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "102372103869359544680", "name": "Big Kuntry Bama", "time": 1515865578959, "rating": 5.0, "text": "It was good.  They got me a great job.  Thank you so much.  Il be sending friends", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "117133600335142608890", "name": "james townsend", "time": 1530823214728, "rating": 5.0, "text": "Good training and staffing with help on finding the best job fit for the ones they are able to help , also were very friendly and nice .", "pics": null, "resp": {"time": 1531828178566, "text": "Thanks, James! We are happy to be of service to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "114392677243551118219", "name": "Damien Kidd", "time": 1532013453538, "rating": 5.0, "text": "My name is Tiffany Kidd and my experience at Elwood Staffing was great. Everyone we as very nice and helpful.", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "102582016920109232407", "name": "Trina Howard", "time": 1530823128191, "rating": 4.0, "text": "I have recently started the process to work as an associate .i am very excited.the lady's at Elwood are great", "pics": null, "resp": {"time": 1532004670531, "text": "Thanks Trina. We appreciate your feedback."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "101749007700732853846", "name": "Tabitha Atkisson", "time": 1557339129368, "rating": 5.0, "text": "Paige and Christy were really nice!", "pics": null, "resp": {"time": 1557343596113, "text": "Tabitha- Thank you for sharing your review. Paige and Christy appreciate the shout-out!  It makes our day!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "106190720254376802207", "name": "Brown SUGA", "time": 1568313677234, "rating": 5.0, "text": "Crystal was great!!.. Thank you", "pics": null, "resp": {"time": 1569008134144, "text": "Ema, Thank you for leaving a review. We are glad Crystal was able to help you. We are all happy to help, let us know if we can be of further help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "104272789950692791906", "name": "nathan Eady", "time": 1540918291986, "rating": 5.0, "text": "I’ve used Elwood back in 2016 and again this year. Fabulous place", "pics": null, "resp": {"time": 1540920821404, "text": "Thanks for being a loyal and dedicated Elwood associate. We are glad to have an opportunity to work with you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "115779553146179321073", "name": "Devin Scales", "time": 1540825733161, "rating": 4.0, "text": "If you really want to work they are they to help.thats if you want to work dont waste there time", "pics": null, "resp": {"time": 1540826466665, "text": "Hi Devin, Thank you for sharing your feedback. We love helping people find great jobs. Glad we could help you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "106796384786713892249", "name": "Shameka Hughley", "time": 1527784641534, "rating": 5.0, "text": "Everyone was very polite,understanding and patient with me ! No question was gone unanswered! I’d definitely recommend them", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "116889704655523378216", "name": "Allen Sanders", "time": 1538530533470, "rating": 5.0, "text": "Very good company to work for very understanding about your back ground check and will get u the best job possible so please  dont think cuz of your back ground check u cant wrk at any job..elwood  would get u the best job.", "pics": null, "resp": {"time": 1538503844064, "text": "Allen, It is so good to hear someone say positive things about our back ground checks. We are always here to help. Thank you for allowing us to be of service to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "105868547854870153578", "name": "Jessi Ragsdale", "time": 1527225752991, "rating": 5.0, "text": "Elwood in Talladega is an amazing branch with a friendly and professional staff! I highly recommend going to them and letting them help you if you're in search of a job.", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "113511306974607691655", "name": "Scarlet Malone", "time": 1527178038025, "rating": 5.0, "text": "Love the service. Same day job opportunity! Walked in unemployed, walked out employed! :)", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "100347149530019334163", "name": "William Harvey", "time": 1530823081026, "rating": 5.0, "text": "Walked in on a Monday morning before a holiday and was placed with a really good company in my area they next day! Christy was very informative and great to work with. I recommend to anyone who is in the Talladega area to go see Christy and she will help you out!!!!", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "105463703706323875758", "name": "Bridget Burns", "time": 1541196666035, "rating": 4.0, "text": "Christy was wonderful! She was so polite and helpful!", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "114070171920210528617", "name": "Pamela Posey", "time": 1535575872999, "rating": 5.0, "text": "good place to go to find a great paying job", "pics": null, "resp": {"time": 1535630313560, "text": "Pamela,  Thanks for the shout-out. We look forward to working with you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "102098577383520998346", "name": "Morgan Garrett", "time": 1543436427592, "rating": 5.0, "text": "Y’all are excellent!!! Very nice and kind people to work with!", "pics": null, "resp": {"time": 1543496876173, "text": "Morgan, Thank you taking the time to share your feedback. We are glad you had a good experience. Please reach out to us again if we can be of help to you."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "100097117502143894061", "name": "Theo Miller", "time": 1549478720669, "rating": 5.0, "text": "Mrs. Christy is the best at her Job.", "pics": null, "resp": {"time": 1549480220631, "text": "Thanks Theo. We think she is pretty special as well. Let us know if there's anything we can do to be of further help."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "115059880719231342592", "name": "Shayla Ramsey", "time": 1502803666070, "rating": 5.0, "text": "If you need a job they will help you get one", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "101061118091306784014", "name": "Monica “Beautiful Moe” Henderson", "time": 1463458401969, "rating": 5.0, "text": "Thank you for helping me find employment. The staff is awesome.", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "114264907573266781956", "name": "Breanna Richmond", "time": 1607547295105, "rating": 5.0, "text": "Stephanie Martin", "pics": null, "resp": {"time": 1607960630928, "text": "Breanna, we appreciate the review!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "100584064268955385758", "name": "Steven Flint", "time": 1500396115833, "rating": 4.0, "text": "They got me a really nice job", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "111460014291915725130", "name": "Ashley Smith", "time": 1543956077691, "rating": 5.0, "text": "Friendly staff and quick hiring", "pics": null, "resp": {"time": 1544022152569, "text": "Ashley- Thank you for the sweet review. We love it."}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "116329813812158123397", "name": "Brittany Wynn", "time": 1527109502929, "rating": 5.0, "text": "Ms.Christy was great handling me", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "105467153627850625477", "name": "Antwanette Green", "time": 1527108773635, "rating": 5.0, "text": "I've been having hard times but they never gave up on me, I really appreciate the people that I came in contact with they make you feel like family.", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "116507592504123338873", "name": "T.J Lamberth", "time": 1532025225158, "rating": 5.0, "text": "Amazing people", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "115963503926004132169", "name": "SpeedRacer_2020", "time": 1590101616791, "rating": 5.0, "text": "Amazing service!!!!!", "pics": null, "resp": {"time": 1590149045423, "text": "Thank you for the 5-star review!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "115160870546770091531", "name": "Donovan Greaves", "time": 1597352391315, "rating": 5.0, "text": "It was chill", "pics": null, "resp": {"time": 1597783391760, "text": "Thanks for the review!"}, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "108193746655432847304", "name": "Kimiko Ware", "time": 1495884690756, "rating": 3.0, "text": "Trying to get a job from there.", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "112782682156581451524", "name": "Destiny Aaliyah Hill", "time": 1474064509995, "rating": 1.0, "text": "They are big liars about your stupid global card", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
{"user_id": "104662675652323600276", "name": "MELANIE VANWAGNER", "time": 1456852960929, "rating": 5.0, "text": "Going for interview in the morning at 8.00!", "pics": null, "resp": null, "gmap_id": "0x888bdccf82c632fb:0xedb2dc3add98a6e0"}
