{"user_id": "111089517701104971891", "name": "Shirley Provo", "time": 1568413520996, "rating": 5.0, "text": "I love Nina Jo, Sherry & the whole medical team. Everyone is so friendly and personable.  They care about the patients & their wellbeing. Great job, team!!", "pics": null, "resp": {"time": 1568571698945, "text": "Thank you for your kind review. It is our pleasure to be your healthcare provider. If we can be of further assistance, please call us 334-613-7070."}, "gmap_id": "0x888e81a74a14b0a7:0x599519e3ece6350e"}
{"user_id": "107824135829194189914", "name": "Diane Stiffler", "time": 1553716088832, "rating": 5.0, "text": "Nina is always thorough and listens to her patients. She is always on top of the current procedures and medications.  Her staff listens and fulfills directives cheerfully and professionally.  The Lab people are professional quick, and as cheerful as one could expect with people griping about the pain or needles.  It is always a joy to be treated at the UAB Clinic.", "pics": null, "resp": {"time": 1554310366884, "text": "Thank you for your kind review.  It is our pleasure to be your healthcare provider.  If we can be of further assistance, please call us 334-613-7070."}, "gmap_id": "0x888e81a74a14b0a7:0x599519e3ece6350e"}
{"user_id": "113253838712424239910", "name": "Ann Maines", "time": 1553539249299, "rating": 5.0, "text": "Nina Jo is simply the best. She always takes time with me, answers my questions, and leaves me feeling secure that she is taking care of me.", "pics": null, "resp": {"time": 1554310405069, "text": "Thank you for your kind review.  It is our pleasure to be your healthcare provider.  If we can be of further assistance, please call us 334-613-7070."}, "gmap_id": "0x888e81a74a14b0a7:0x599519e3ece6350e"}
{"user_id": "112776180005944325436", "name": "Jann Guthrie", "time": 1560618891688, "rating": 5.0, "text": "I have been going to the UAB Multi-Specialty Clinic for several years now and Nina Jo Hibbard is taking excellent care of me.  She is sweet, caring and very knowledgable and someone I trust completely!  She listened to me when no one else would. Go see her.  I promise, you won't be sorry!", "pics": null, "resp": {"time": 1561399565180, "text": "Thank you for your kind review. It is our pleasure to be your healthcare provider. If we can be of further assistance, please call us 334-613-7070."}, "gmap_id": "0x888e81a74a14b0a7:0x599519e3ece6350e"}
{"user_id": "105753280035415785874", "name": "Diana Rosure", "time": 1616629662278, "rating": 1.0, "text": "It was very hard to reach this doctor and when I finally got an appointment, it was cancelled and the person in charge of the doctor’s schedule not only sounded hesitant but could not give me a date on when the appointment  would be rescheduled. It is a very important time for an expectant mom and I felt that this practice does not take that in consideration. “I’d call you when there is an opening” is not helpful at all esp. on a time constraint. I called and followed up and to no avail. The answering service would pick up and say to call again in five minutes. Finally, I called again on a Tuesday almost a week after no response, three times to the answering service. After the 4th call, the answering service rep shared the clinic isn’t going to open this Tuesday.\n\nMy advise to those who may have the same issue, go to St. Vincent East and see a more professional group of people.\n\nDo not think this is the only available option for you especially if you are needing a specialist. Get a specialist  that actually has more of a professionally managed office. This is not worth your headache.", "pics": null, "resp": null, "gmap_id": "0x888a3f28a97a643f:0xb24df753c910bf5e"}
{"user_id": "104211980839391897456", "name": "Cortney Alred", "time": 1614020016603, "rating": 1.0, "text": "I have an elderly grandmother that I am speaking for, that every time she has a set appointment, she has to wait an hour and a half to two hours just before she gets to see the doctor. It is infuriating for any patient to do everything they are supposed to do and be there when they are scheduled, just to have to wait for that long! It is very unprofessional and unacceptable! Be better! Care more about your patients and their time!", "pics": null, "resp": null, "gmap_id": "0x888a3f28a97a643f:0xb24df753c910bf5e"}
{"user_id": "107261668546896742624", "name": "Leasha henson", "time": 1607912439283, "rating": 4.0, "text": "It is very nice and clean everyone that works there or is very polite very good doctor", "pics": null, "resp": null, "gmap_id": "0x888a3f28a97a643f:0xb24df753c910bf5e"}
{"user_id": "106921105662540869406", "name": "Mary Saxon", "time": 1573239217523, "rating": 1.0, "text": "👆(had to hit star in order to post)so unprofessional!! Should not practice medicine!!😡\n\n👎👎👎👎👎👎\nUpdate!!!\nJust had appointment today and left in 😭\nThis Doctor gets no stars!!! Only was seen for about 30 min and Dr. Mu was only concerned to change my medication. (Based on my request) He wouldn’t  bother about any of my concerns. He flat out said “what dose do you want” and of course I had inquired about what he thought would be best based on my blood work, since he’s the Doctor.  He said “your the one taking it, so do you want the higher or lower”? I had some concerns about things I should or should not try to help with my condition and he just rushed me out! I said “sir, but I have a question” Dr. Mu yelled over his shoulder “you’re checking out”!\nI will not be going back!!! I highly suggest people do their research and get quality care instead of convenient care!!! This “Doctor” is only into his own agenda!!!", "pics": null, "resp": null, "gmap_id": "0x888a3f28a97a643f:0xb24df753c910bf5e"}
{"user_id": "101870876285610563251", "name": "Amy", "time": 1566441991941, "rating": 5.0, "text": "I went for the first time today. The whole staff was very professional and nice. Dr Mu was very nice, thorough and took his time explaining everything.", "pics": null, "resp": null, "gmap_id": "0x888a3f28a97a643f:0xb24df753c910bf5e"}
{"user_id": "102057065716400148478", "name": "T. Page", "time": 1572233538567, "rating": 4.0, "text": "Dr. Mu and Victoria are wonderful but the women at the front have a poor attitude and NEVER answer the phone.", "pics": null, "resp": null, "gmap_id": "0x888a3f28a97a643f:0xb24df753c910bf5e"}
{"user_id": "105452393370093647667", "name": "Teresa Gamblin", "time": 1516728644568, "rating": 5.0, "text": "Dr. Mu is a wonderful doctor. Very caring. Takes his TIME!!!! with his patients. And yes... Marie Freeman, when the office IS COMPLETELY CLOSED DUE TO ICE AND SNOW, NOBODY CAN CONTACT YOU to let you know the office is closed. Not only that, but it's a huge liability to have patients with disabilities  come to the property and risk getting hurt on ice/snow. Dr Mu cares about his patients! ! So, the office was closed 2 days due to bad weather. Several employees have to drive long distances to get to work. So please think of others before you go spouting off rude things about people and degrading their business.", "pics": null, "resp": null, "gmap_id": "0x888a3f28a97a643f:0xb24df753c910bf5e"}
{"user_id": "102483108993783128934", "name": "William Tillman", "time": 1575932512395, "rating": 1.0, "text": "Very slow here waited in the room for 2hr before  dr came in and not many ppl here", "pics": null, "resp": null, "gmap_id": "0x888a3f28a97a643f:0xb24df753c910bf5e"}
{"user_id": "111191852533887843409", "name": "Sandra Whorton", "time": 1570818064667, "rating": 5.0, "text": "Very good and concerned Dr. Staff is friendly and helpful!!", "pics": null, "resp": null, "gmap_id": "0x888a3f28a97a643f:0xb24df753c910bf5e"}
{"user_id": "113205195113577774362", "name": "Lee Mulkey", "time": 1555358924406, "rating": 4.0, "text": "Great Dr, great people, seems to be doing the job and getting sugar back down.", "pics": null, "resp": null, "gmap_id": "0x888a3f28a97a643f:0xb24df753c910bf5e"}
{"user_id": "112735775331939768619", "name": "Denise Taylor", "time": 1538754185697, "rating": 1.0, "text": "Nasty building and exam rooms.  Always an extended wait, still being held hostage in an exam room 1 hour and 20 minutes after my appointment.   The other physician went to the restroom, and used it (I know because I was directly across the hall), exited restroom and never washed hands.  I know this because 1. The water never turned on and 2. I went in behind him and the sink bowl was completely dry.  Exam rooms are filthy and front office staff is beyond rude!!  Best thing about the place is Victoria, the nurse dor Dr. My.  She is always friendly and will do what she says.  Kudos and 5 stars to Victoria!", "pics": null, "resp": null, "gmap_id": "0x888a3f28a97a643f:0xb24df753c910bf5e"}
{"user_id": "102435937991271545406", "name": "Mona Maddox", "time": 1392143836779, "rating": 2.0, "text": "Dr. Mu is a nice doctor.  A little hard to understand with his accent, but his information and explanations made sense.  The problem is getting their attention again now that I've been for the visit and driven to a separate lab for lab work.  They don't do their own; you take their form somewhere, get blood drawn and the lab sends results to the doctor. My lab work was supposed to be back to him last Wednesday, according to the lab. Dr. Mu said for me to call them if I did not hear, so I called Friday and Monday. Now Tuesday. Just answering machines where I keep leaving my requests for info/prescription.  When I was there last week, there was a man complaining to them that someone should answer their phones.  That would be nice.", "pics": null, "resp": null, "gmap_id": "0x888a3f28a97a643f:0xb24df753c910bf5e"}
{"user_id": "114599933175451115169", "name": "J C", "time": 1467824183439, "rating": 1.0, "text": "They are very hard to get in touch with, I have called several times with no call back. It's been 2 months since I had my lab work no one has contacted me back with my results I have called so many times  I just give up. They really need a better system.", "pics": null, "resp": null, "gmap_id": "0x888a3f28a97a643f:0xb24df753c910bf5e"}
{"user_id": "104995674844397796043", "name": "Edna Marie Bailey Freeman", "time": 1516154113191, "rating": 1.0, "text": "Dr Mu is a wonderful doctor but his office provides poor service.  First, I went to my appointment a couple of years ago only to find out that they had moved!  When I, finally, found their new location, I asked  if they had informed the patients prior to the move and  Dr. Homan stated, \"No.\"  without apology.  Secondly, they had been very difficult to get in touch with but have recently gotten better.  Lastly, (this turned me completely) I drove 40 miles to meet my 8 a.m. appointment with Dr. Mu (which I had looked forward to for 6 months) only to be \"stood up\" by the entire office.  THEY WERE CLOSED AND DID NOT CALL TO LET ME OR AT LEAST 3 OTHER PATIENTS KNOW!  I will not return to this office because three strikes and you are fired!  This is totally unacceptable and if this is how they want to do business, then I pity those who choose to stay.", "pics": null, "resp": null, "gmap_id": "0x888a3f28a97a643f:0xb24df753c910bf5e"}
{"user_id": "106908598632546621887", "name": "Sydney Tinney", "time": 1534277482741, "rating": 1.0, "text": "Ridiculous. I've been seeing Dr Mu since April 2018. I was originally told I had 1 mass on my thyroid, then 2, then told it's cancer (thank god for a wrong diagnosis) but when I call asking about new symptoms, they were dismissed and I was told I couldn't get any pain medicine (not EVEN remotely what I asked about). Had surgery July 3rd in Birmingham to remove 2 masses totalling 9 cm that were the source of ALL the symptoms I had developed, and was supposed to having a follow up today, August 14. The condescending receptionist mocked the $50 I was able to pay towards my bill and told me I had to start paying more. I'm still paying off the $900 copay from my surgery and all the other bills accrued from the tumors and having my thyroid removed. She then told me I needed to be more financial responsible because my bills are being sent to creditors. Dr Mu himself is ok, but due to his atrocious staff member, I will be finding another place to go. NO ONE should go in for bloodwork to leave without being seen, in tears. Absolutely worst receptionist I have ever met.", "pics": null, "resp": null, "gmap_id": "0x888a3f28a97a643f:0xb24df753c910bf5e"}
{"user_id": "117965396030895107600", "name": "Alicia Mccoy", "time": 1559934323352, "rating": 5.0, "text": "They were very polite. Dr.mu spends alot time with his  patients.", "pics": null, "resp": null, "gmap_id": "0x888a3f28a97a643f:0xb24df753c910bf5e"}
{"user_id": "107955886226060940640", "name": "Niki Jackson", "time": 1487595290578, "rating": 5.0, "text": "Dr Mu is very nice and he spends alot of time with you and explains everything to were you can understand.", "pics": null, "resp": null, "gmap_id": "0x888a3f28a97a643f:0xb24df753c910bf5e"}
{"user_id": "104401680046012250906", "name": "Summer Patterson", "time": 1516735809039, "rating": 1.0, "text": "Awful, awful, awful. Dismissive and condescending. Refuses to do full panel blood work and his plan of care for thyroid conditions is to “eat eggs”.", "pics": null, "resp": null, "gmap_id": "0x888a3f28a97a643f:0xb24df753c910bf5e"}
{"user_id": "110238022208614484101", "name": "Rebekah Hayes", "time": 1628011127684, "rating": 5.0, "text": "I’m so thankful that Dr Valderrama became my doctor many years ago. He always listens closely and cares about his patients. He not only took care of and kept a close watch over my treatment resistant auto immune thyroid issues, but he looked at other blood work and made sure I was healthy in other ways. He is very knowledgeable, but not prideful. He doesn’t treat you like you’re dumb or he knows it all. He will even look things up if he’s not sure. I’m just so blessed he’s my doctor.", "pics": null, "resp": {"time": 1628083516046, "text": "Thank you for your kind words and this wonderful review!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "106853080787595576763", "name": "Sarene Hampton", "time": 1628028644945, "rating": 4.0, "text": "Very knowledgeable about Reactive Hypo and thyroid issues.which is very uncommon in local Dr.s. Doesnt rush you in your visit . He makes.an extra effort to help you get your equipment and is patient.Follow up from labs is not great if you can't use the portal.", "pics": null, "resp": {"time": 1628085490803, "text": "We really appreciate your feedback!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "118341767570868752438", "name": "Kerry Allgood", "time": 1628627015865, "rating": 5.0, "text": "Great patient care from nurses and techs.  Medtronics representative is great.  The best care I have ever had with MedTronics.  Corey is extremely helpful, considerate, knowledgeable, and caring.  Makes me feel so much better about diabetes control.  Dr. Valderrama is by far the best endocrinologist I have ever had in my 56 years of being a diabetic.  The office personnel are great.  They really work with you in getting an appointment time you need.", "pics": null, "resp": {"time": 1628775159793, "text": "We strive for 100% satisfaction, and we love to hear about these positive experiences! we are happy to pass along your comments to the team here! We sincerely thank you for the positive review!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "115445136159281860275", "name": "Tina Cantrell", "time": 1626466159188, "rating": 5.0, "text": "I was happy to see masks are still required. Dr. Valderrama was very nice along with the staff. He seemed very interested in my issues and finding out what is going on. I was done in an hour including labs. I would say my first visit was a very good experience.", "pics": null, "resp": {"time": 1626708200401, "text": "We strive to provide great experiences. Thank you for your feedback!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "113688134999188800154", "name": "Tim Davis", "time": 1627415410090, "rating": 5.0, "text": "Great people. Wonderful doctor. Dr Valderrama and his staff are the tops. They've helped me with my diabetes and better control for a few years now. I highly recommend them. Tell them Tim sent you lol. Love my doctor.", "pics": null, "resp": {"time": 1627421651914, "text": "Thank you for your kind review; we are happy to pass along your comments to the team here! Our staff strive to provide the best care and experiences. Your recommendation means so much to us.  Thank you again for taking the time to share your comment. Have a great day!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "109899835367516785217", "name": "Laura Tidmore", "time": 1628269584862, "rating": 5.0, "text": "As always everything was great!  I'd recommend them to anyone!!", "pics": null, "resp": null, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "103087824966729162425", "name": "Brooke Griffin", "time": 1619200857390, "rating": 5.0, "text": "Dr. Valderrama was very thorough and kind. I love going to a doctor who takes the time to explain things to you. His whole office was very friendly and efficient. Great experience!", "pics": null, "resp": {"time": 1619216650464, "text": "We strive for 100% satisfaction, and we love to hear about these positive experiences!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "108419704235496054741", "name": "Babs Hester", "time": 1616001686659, "rating": 5.0, "text": "Very good doctor, thorough, listens to your concerns. Makes recommendations and allows you input on treatment. He found my issue that I have been told for years, oh it’s just that number today. He has a good staff. No bad experience for me, I just wish I had taken my issue to him three years ago.", "pics": null, "resp": {"time": 1616033706160, "text": "Thank you for your kind words and this wonderful review!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "118330609690430672782", "name": "Heather Wilson", "time": 1610227171973, "rating": 5.0, "text": "I am a new patient, and had a good, but quick visit.  I was referred by my rheumatologist for my thyroid.  I checked in, and I think I waited about 15 minutes to be called back.  Nurse was pleasant and prompt.  I had another very short wait before Dr. Valderrama came in.  He was pleasant and direct.  He seemed to be thorough asking many questions.  He walked me to have labs, and continued to answer questions I had.  Overall, an A+ visit.", "pics": null, "resp": {"time": 1610375141758, "text": "We strive for 100% satisfaction, and we love to hear about these positive experiences!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "102577998343022161544", "name": "Denise Randolph", "time": 1617711976957, "rating": 5.0, "text": "Very knowledgeable and so helpful in introducing new products to help me in getting my A1C number down.", "pics": null, "resp": {"time": 1617713653933, "text": "Thank you; we appreciate your feedback! Our staff strive to provide the best care and experiences. Thank you for your comment!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "109281223349230945441", "name": "Robert McConnell", "time": 1620100428686, "rating": 5.0, "text": "Both Dr Valderrama and his practice staff are very nice and very professional.", "pics": null, "resp": {"time": 1620134721610, "text": "Our staff strive to provide the best care and experiences. Thank you for your comment!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "114226152802861605069", "name": "Phyllis Harper", "time": 1610130803075, "rating": 5.0, "text": "Love Dr. Valderama! He’s always so kind and thorough! Great Physician and has lots of knowledge in his field of medicine.", "pics": null, "resp": {"time": 1610135554326, "text": "Thank you for your kind words and this wonderful review!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "102381242666285347774", "name": "Ken Martin", "time": 1611943751234, "rating": 5.0, "text": "The doctor was very good at explaining the plan for getting off prednisone and the possible effects.\nVery good doctor, easy to talk to and very knowledgeable.", "pics": null, "resp": {"time": 1611956097473, "text": "Thank you; we appreciate your feedback!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "110758017686681962921", "name": "Laura T", "time": 1602612231099, "rating": 5.0, "text": "Everyone is very nice at this office. Dr. Valderrama is very calm and so nice. If I was my doctor, I'd want to yell at me about my blood sugar and A1c readings. I appreciate him and his staff very much. I'd recommend him to anyone needing an endocrinologist.", "pics": null, "resp": {"time": 1602681285847, "text": "Thank you for your kind words and this wonderful review! We appreciate  your praise and comments about our team. Your recommendation means so much to us.  Thank you again for taking the time to share your comments. Have a great day!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "100224769027900677242", "name": "Wanda Eskew", "time": 1614910235867, "rating": 5.0, "text": "Nicely run facility.  Dr. Valderama is very thorough and nice.", "pics": null, "resp": {"time": 1614914366491, "text": "Thank you; we appreciate your feedback!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "117408639353984088170", "name": "Marsha Howell", "time": 1608315279708, "rating": 5.0, "text": "Dr. Valderrama is a very good doctor and will try his best to get answers for you. I am sickly with Adrenal Insufficiency and he has been a great doctor to me and tries to get down to what my problems are. I really like him, and would recommend him to any patient who suffers from Adrenal Disease.", "pics": null, "resp": {"time": 1608418538930, "text": "Thank you for your kind words and this wonderful review! Your recommendation means so much to us.  Thank you again for taking the time to share your comments. Have a great day!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "100100612068744691692", "name": "Mary Killen", "time": 1611763717005, "rating": 5.0, "text": "Everyone was so helpful and friendly, and I absolutely love Dr. Valderama. I know I am in good hands.", "pics": null, "resp": {"time": 1611802432005, "text": "Our staff strive to provide the best care and experiences. Thank you for your comment!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "102602426955843165611", "name": "Patty Wiley", "time": 1611166488987, "rating": 5.0, "text": "All staff were extremely kind and professional and I would highly recommend Dr Valderrama as a knowledgeable and caring physician", "pics": null, "resp": {"time": 1611188087228, "text": "Our staff strive to provide the best care and experiences. Thank you for your comment!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "106768219973928125370", "name": "Kiva Karmen", "time": 1605904840937, "rating": 5.0, "text": "This office of medical professionals are absolute JEWELS.  The compassion is felt from the receptionist, Nurse, Nurse Practitioner, Doctor, and lab staff.  Their bedside manner is rare.  They listen and actually read the data!  Most doctors ignore their patients concerns.  I was so overwhelmed with the level of compassion.", "pics": null, "resp": {"time": 1606142010488, "text": "Thanks for your praise and kind comments about our team. Our staff strive to provide the best care and experiences. Thank you for your comments!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "102816295455511817872", "name": "MAXIE JOHNSON", "time": 1611364183537, "rating": 5.0, "text": "Dr. Valderrama is a Great DOCTOR and his staff is very efficient. Thank you Dr. Valderrama and staff.", "pics": null, "resp": {"time": 1611540943269, "text": "Thank you for your kind words and this wonderful review!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "117278196738508805177", "name": "Susan McCarthy", "time": 1604364058753, "rating": 5.0, "text": "Dr. Valderrama is a gem! I would rank him higher if I could. I have gone to several endocrinologists in recent years because one moved, one had a baby and cut back her schedule to mostly teaching, and one was less willing to listen and showed impatience. So I really appreciate Dr. V.! He is both professional and warm, and shows his respect for the patient's point of view. He is not threatened by questions; he welcomes them. I have learned so much about thyroid disease from him  in the past year, although I have been dealing with it for ten years. I never feel like he is \"on the clock\" and trying to move on quickly. After my first appointment with him, I felt such relief. Finally I found this fine doctor.", "pics": null, "resp": {"time": 1604500274430, "text": "Thank you for your kind words and this wonderful review!  We're so glad that we were able to go above and beyond your expectations."}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "107024547399977459498", "name": "james helms", "time": 1627413491246, "rating": 5.0, "text": "Very nice people", "pics": null, "resp": {"time": 1627421920647, "text": "We strive to provide great experiences. Thank you for your feedback!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "107646678109058325237", "name": "Jan Mooney", "time": 1611167725620, "rating": 5.0, "text": "In and out quickly. Clean office.", "pics": null, "resp": {"time": 1611188029440, "text": "Patient satisfaction is our top priority! Thank you for the star rating."}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "116471057471141019600", "name": "Brandy Holder", "time": 1583351781073, "rating": 5.0, "text": "Dr. Valderrama is a very genuine person. He truly cares about his patients and their wellbeing. He takes  time to talk with you and discuss anything you feel is important. Also, everyone that I have crossed paths with in his office have been equally as pleasant. The staff is amazing with the patient portal and getting back with you if you have any questions/concerns. Highly recommended!", "pics": null, "resp": {"time": 1583421152552, "text": "Thanks for your praise and kind comments about our team. Your recommendation means so much to us.  Thank you again for taking the time to share your comment. Have a great day!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "106022532202044564631", "name": "Mimi D", "time": 1578343231299, "rating": 5.0, "text": "Wonderful physician!  He is very kind and caring. He listens to his patients and does a thorough assessment. His office staff is very friendly and wait times are excellent.", "pics": null, "resp": {"time": 1578349385597, "text": "Mimi 1207, thank you for your kind words and this wonderful review!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "110336172158507844265", "name": "Marsha Howell", "time": 1570129686126, "rating": 5.0, "text": "Dr. Valdaramma is very kind and compassionate. He takes my health seriously and I have Adrenal Insufficiency and hypothyroidism. He is very thorough about lab work and makes decisions about my medication based solely off of them. He is a very smart doctor who will make sure you are taken care of. I highly recommend seeing him.", "pics": null, "resp": {"time": 1570135479762, "text": "Your recommendation means so much to us and we're happy to have earned it. Thank you for taking the time to share your positive experience. Have a great day!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "108436060260635285336", "name": "Julia Thomason at Love the Mouse Travel", "time": 1576780143415, "rating": 5.0, "text": "Dr. Valderrama is much better than the previous endocrinologist I had seen. He is patient and he listens to your concerns. He doesn't seem in a hurry like many physicians these days. He uses data from testing along with his conversation with you to provide the best care. His staff is also very kind and friendly.", "pics": null, "resp": {"time": 1576786993480, "text": "Julia Thomason, thank you for your kind words and this wonderful review. We're happy you found our staff to be so supportive. We always strive to provide top quality service and are pleased to hear that your experience was a good one!  Thank you again for your feedback. We hope you have a great day!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "108558605871907613978", "name": "Caitlyn Joiner", "time": 1595395597490, "rating": 5.0, "text": "Most helpful and thorough doctor I’ve seen. Was very patient, answered all my questions; didn’t rush the appointment, etc. highly recommend.", "pics": null, "resp": {"time": 1595423836322, "text": "We love hearing about these experiences! Your recommendation means so much to us.  Thank you again for taking the time to share your comment. Have a great day!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "114391738305667862399", "name": "Kylie Jerkins", "time": 1557260478653, "rating": 5.0, "text": "Dr. Valderamma is, hands down, the most thorough doctor I have ever seen. He genuinely cares about my well-being and spends a ton of time in the room with me. I've never had another doctor ask so many questions and run so many tests. When the first few tests came back inclusive, instead of just saying that I'm perfectly okay, we had another conversation and he found more tests to run. No other doctor has ever dug this deep for me and I really appreciate him for it. He's such a great doctor that his schedule is usually pretty full, so it'll take some time to get an initial appointment, but the wait is worth it.", "pics": null, "resp": {"time": 1557263998116, "text": "Kylie Jerkins, thank you for your kind review; we are happy to pass along your comments to Dr. Valderrama.  Your recommendation means so much to us and we're happy to have earned it. Thank you again for taking the time to share your positive experience. Have a great day!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "108173745048498664522", "name": "Elizabeth Boyd", "time": 1595523838295, "rating": 5.0, "text": "Dr. Valderama was the first doctor to take the time to listen to my concerns and try to come up with solutions. His staff is wonderful and very on top of things in the office.", "pics": null, "resp": {"time": 1595544180930, "text": "Thanks for your praise and kind comments about our team. Our staff strive to provide the best care and experiences. Thank you for your comment!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "110462688201448442734", "name": "Lisa Giles", "time": 1611944679294, "rating": 5.0, "text": "Excellent care from doctor and staff!", "pics": null, "resp": {"time": 1611955971926, "text": "Thank you; we appreciate your feedback!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "114372989523460784985", "name": "Neil Clay", "time": 1600887903714, "rating": 5.0, "text": "Great communicator. Very thorough", "pics": null, "resp": {"time": 1600898871586, "text": "Patient satisfaction is our top priority! Thank you for the star rating."}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "103821185875580560883", "name": "Lynda Daniel", "time": 1575689849912, "rating": 5.0, "text": "I would highly recommend Dr Valderrama. He is very knowledgeable and very encouraging. I also like his office staff very much.  He does not scold his patients or make them feel guilty when their A1C tells it all. Dr. Valderrama takes  a positive approach to motivate his patients.", "pics": null, "resp": {"time": 1575903002925, "text": "Lynda Daniel, thanks for your praise and kind comments about our team. We always strive to provide top quality service and are pleased to hear that your experience was a good one! Thank you so much again for your feedback! We hope you have a great day!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "116262774625787224359", "name": "Thomas Williford", "time": 1616014777220, "rating": 5.0, "text": "great staff and doctor", "pics": null, "resp": {"time": 1616033904769, "text": "We really appreciate your feedback!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "110281931669118896112", "name": "Icye Lewis", "time": 1608841791487, "rating": 5.0, "text": "He is a very good doctor", "pics": null, "resp": {"time": 1607680589514, "text": "Patient satisfaction is our top priority! Thank you so much for your rating."}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "112188373213640564246", "name": "Paul Odell", "time": 1575304441846, "rating": 5.0, "text": "I've been a patient of Dr. V for for coming up on 15 years. Best, most caring, knowledgeable Endocrinologist I've ever been a patient of.", "pics": null, "resp": {"time": 1575331083179, "text": "Paul Odell, thank you for your kind words and this wonderful review!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "107697502067009055462", "name": "Holly Simmons", "time": 1565889269883, "rating": 5.0, "text": "Dr. v seemed to really care about my situation instead of just passing me off like a number.  It was very refreshing to have someone to actually listen to my problems and concerns and give real feedback. It was well worth the wait to get in with fb f", "pics": null, "resp": {"time": 1565891112649, "text": "Hi Ms. Simmons - thank you so much for your positive comments about Dr.  Rodrigo Valderrama!  We always strive to provide top quality service and are pleased to hear that your experience was a good one. Again, thank you for leaving us this response!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "114498369658218031002", "name": "Dianne Snow", "time": 1587242534997, "rating": 5.0, "text": "I love Dr. Valderrama ; he is very caring and the first doctor that got my hypothyroidism under control and works to keep it controlled.", "pics": null, "resp": {"time": 1571757035367, "text": "Ms. Snow, thank you for your kind review."}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "107596525056120706363", "name": "Linda Dennis", "time": 1605205318649, "rating": 5.0, "text": "The best Dr and staff", "pics": null, "resp": {"time": 1605276291803, "text": "Our staff strive to provide the best care and experiences. Thank you for your comment!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "109229893783716179638", "name": "Judy Parker", "time": 1569441502280, "rating": 5.0, "text": "Nice staff and Great Doctor!   Would recommend him to anybody, He is caring, and very thorough,👍", "pics": null, "resp": {"time": 1569446754514, "text": "Ms. Parker - your recommendation means so much to us and we're happy to have earned it. Thank you  for taking the time to share your positive experience. Have a great day!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "100397929074035386033", "name": "Margie Haddox", "time": 1565977140100, "rating": 5.0, "text": "Dr. Rodrigo Valderrama, MD has always given me his full attention when I see him. He asks questions about my health sense my last visit and how I am doing now. He is very informative about my health. I never feel like he is in a hurry to get to the next patient. I like Dr. Rodrigo Valderrama very much and would refer him to all patients. He is worth more then five stars.\n\nMargie Haddox", "pics": null, "resp": {"time": 1565985634830, "text": "Margie Haddox, thank you for your kind words and this wonderful review!  Your recommendation means so much to us and we're happy to have earned it. Thank you again for taking the time to share your positive experience. Have a great weekend!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "115342941627604460400", "name": "Shelia Allen", "time": 1568394922385, "rating": 5.0, "text": "I just love him he’s really good he listens to what you have to say.", "pics": null, "resp": {"time": 1568398816954, "text": "Hello Shelia Allen, thank you; we appreciate your feedback! Feel free to reach out to us if you need anything. Have a wonderful day."}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "116790395127699149354", "name": "Butch Walker", "time": 1616002000776, "rating": 5.0, "text": "Always a pleasure", "pics": null, "resp": {"time": 1616033716940, "text": "We really appreciate your feedback!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "102075704065772396123", "name": "Carolyn Robards", "time": 1569261840346, "rating": 5.0, "text": "Nice staff and like the building it’s easily accessible.", "pics": null, "resp": {"time": 1569264062469, "text": "Carolyn Robards, thank you for your kind review; we are happy to pass along your comments to Dr. Valderrama and his team!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "117720550499131372681", "name": "Barbara Coker", "time": 1579821773974, "rating": 5.0, "text": "Had very good results", "pics": null, "resp": {"time": 1579877928011, "text": "Barbara Coker, thank you for the star rating!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "100681388084509216417", "name": "Barry Rowland", "time": 1595883645649, "rating": 5.0, "text": "Great experience", "pics": null, "resp": {"time": 1595950571029, "text": "Patient satisfaction is our top priority!  Thank you so much for your positive comment."}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "109786141907883521609", "name": "Tony Wilkerson", "time": 1599612593870, "rating": 5.0, "text": "Excellent", "pics": null, "resp": {"time": 1599664644077, "text": "We strive for 100% satisfaction, and we love to hear about these positive experiences!"}, "gmap_id": "0x888917a395356241:0x6889f9343070e009"}
{"user_id": "113393998999103138159", "name": "Jessica Cost", "time": 1618523981494, "rating": 5.0, "text": "Dr. Reddy literally saved my life. I came to her three years ago on over 200 units of insulin a day, an Alc of 10.5, and extremely overweight...absolutely miserable. She released me from her care, today, because I no longer need her services. Today, I am completely OFF of insulin, down two medications, and have lost almost 100lbs. She was so very decisive in my care. She was thorough and she doesn't mince words. If you, the patient, does what she advises you to do, YOU WILL SUCCEED. PERIOD. She's good people!!!", "pics": null, "resp": {"time": 1618581789355, "text": "Hello, Ms. Cost. Wow, what an incredible story! Thank you for sharing. We're so pleased to know that you are now off insulin and on the road to a healthier future. We will make sure Dr. Reddy and the rest of the Huntsville Hospital Endocrinology & Diabetes Clinic team know how much you appreciate their efforts. We wish you continued good health."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "108087568096497140502", "name": "Judi McMillin", "time": 1609363134047, "rating": 5.0, "text": "Dr. Reddy takes care of me for both diabetes#2 and thyroid issues. She is very comforting, knowledgeable, caring, etc. She never rushes my appointment. True...it does take some time waiting for her but it is very worth it. Her staff is fabulous....they all are friendly and caring. The one (Brian) is a total riot! He's very funny and likes to joke with me. This truly is THE doctor you need for these conditions.", "pics": null, "resp": {"time": 1611608916903, "text": "Hello, Ms. McMillin. Thank you so much for the kind words and the great review! We are so pleased to hear that Dr. Reddy and the rest of our team are meeting your needs. We look forward to continuing to care for you in the future."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "106810881904472922741", "name": "stacy wilks", "time": 1605809550952, "rating": 5.0, "text": "Dr. Reddy is by far the best endocrinologist I have ever been to. She listens and never seems rushed when we are discussing my plan of care. The wait has been very long because of the Covid issues and how long it takes with patients plus the tele calls. The office staff is wonderful. Lynn always answers all questions and is pleasant despite these trying times. I feel like I am getting the best care of all of my years with type 1 diabetes.", "pics": null, "resp": {"time": 1611260854543, "text": "Wow, Stacy. What a wonderful review! We're so pleased  to know that Dr. Reddy is not just meeting your expectations but exceeding them. We appreciate your support and are glad you are part of our Huntsville Hospital Endocrinology & Diabetes Clinic family."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "115589825808441670651", "name": "Nichelle Carpenay", "time": 1600889188747, "rating": 5.0, "text": "I LOVE this office with Dr. Jindal and his staff! The staff is sure to make you smile and keep you well informed with appointments, prescriptions etc. They even sent a sweet card in the mail. Very, very professional and kind. And Dr. Jindal is such an encouragement and great help with getting his patients better and giving vital information on what is necessary to get healthy. I have already seen improvements being one of his patients. Thanks Dr Jindal and Staff😊", "pics": null, "resp": {"time": 1601059098695, "text": "This is all wonderful to hear, Nichelle! We're so glad to have you as a patient and to know that your health is improving with Dr. Jindal's care. Thank you for taking the time to let others know of your experience with our clinic."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "106893672237859183268", "name": "Jamie Weinstein", "time": 1582571937853, "rating": 5.0, "text": "Dr Reddy is by far the best endocrinologist that I have seen in my 25 years with type 1 diabetes. She is super knowledgeable and up to date on all new devices and medications and most importantly she listens to every concern and comment I have. She is very punctual, which is very important to me since I have to bring my toddler with me, with whom she is great with as well! Couldn’t recommend her more.", "pics": null, "resp": {"time": 1582582119784, "text": "We appreciate the fantastic review, Ms. Weinstein, and are excited to share your comments with Dr. Reddy. Thank you for your continued trust and support."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "111823123781686739539", "name": "Donna Maschke", "time": 1580743922180, "rating": 4.0, "text": "Dr. Reddy is very thorough and explains details of treatment well. She is a new physician for my mother and we have seen her twice. Both times I had to call their office because they didn't call in the prescription. Overall we are pleased with our experience", "pics": null, "resp": {"time": 1580762168937, "text": "Thank you for taking the time to leave a review, Ms. Maschke. We're glad to hear that Dr. Reddy has impressed you so far, and we hope to do better in the future regarding your mother's prescriptions. If there's anything else we can do to improve your experience, please call (256) 265-0780 and ask for the Practice Administrator."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "108120892485025119571", "name": "Troy Biles", "time": 1580138985070, "rating": 5.0, "text": "I’m a patient of Dr. Jindal and I’ve been seeing him approx a year or so. I see these negative reviews and I know after visiting with him during my visits, these reviews are not accurate. His bedside manner is excellent. He’s extremely knowledgable and professional. He listens to me and my concerns and considers what I’m telling him. Someone mentioned that he was only on the room 7 minutes, well I have no idea the circumstances, but there have been times I’ve only seen him a short period because it’s a follow up after getting lab work done etc.. He listens and responds but he does have other patients to see as well.\n\nThe office staff are always very friendly and every appointment that I’ve had has been great as far as wait times. Never over 10 minutes or so.\n\nI highly recommend this physician and his staff.", "pics": null, "resp": {"time": 1580165013370, "text": "Hello, Mr. Biles, and thank you for taking the time to let others know about your experiences with Dr. Jindal and our staff. We're glad to know that our team is meeting your expectations and will pass along your compliments to Dr. Jindal."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "103546565758565830096", "name": "Jessica Styles", "time": 1572280608978, "rating": 1.0, "text": "My labs are messed up, my ultrasound shows Hashimotos Disease and I was told to lower my carbs and see a psychologist for therapy. I've been sick for FOUR YEARS. If you want a doctor who doesn't listen and suggests you have a psychological issue when you tell him your quality of life is poor, then this is the doctor for you. I was warned before seeing him and decided to give him a chance. Huge mistake. It only prolonged my suffering. Hard pass on this doctor for me.", "pics": null, "resp": {"time": 1572627025341, "text": "We're sorry to hear about this, Ms. Styles. Please call our Practice Administrator so we can work with you to address your concerns. The number is (256) 265-0780. Thank you."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "101089892653688354833", "name": "Ken Graham", "time": 1543338905633, "rating": 1.0, "text": "I just had my first visit with Dr Jindal and I wanted to share my first impression. He comes in telling me that my medical history doesn't make any sense (all diagnosed by Vanderbilt) and spent most of the time doing all the talking. He spends, at most, 7 minutes in the room and then leaves. I am in shock at how little he asked about my medical history. I'll go back for the results of the lab work and I'll update this if the appointment goes completely different. As of now, he is the worst Dr I have seen in the last 10 years.", "pics": null, "resp": {"time": 1545164952259, "text": "Hello, Mr. Graham. Our practice administrator would be happy to speak with you about your concerns. Please call her at your earliest convenience. The number is (256) 265-0786. Thank you."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "115992707989493727323", "name": "Shandora Moore", "time": 1547841682929, "rating": 5.0, "text": "Awesome doctor. For first time I felt comfortable about having an Endocrinologist.", "pics": null, "resp": {"time": 1548091716291, "text": "Thank you for the kind words and the great review, Ms. Moore. We're so glad that you've had a five-star experience!"}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "110533569448933972280", "name": "AK Colossus", "time": 1547045769926, "rating": 5.0, "text": "Dr Jindal was great when I saw him. I am borderline needing medication for hypothyroidism/ Hashi and he didn't force me to get a prescription. He gave suggestions for a lifestyle that would promote better thyroid health. Also I had my one year old in the office and the appt couldn't have gone better. I will say he is very concerned and on top of it for women who want to have children and have thyroid issues.", "pics": null, "resp": null, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "111325044508787676878", "name": "Shirley Hobbs", "time": 1597338442149, "rating": 4.0, "text": "Dr Reddy was Great", "pics": null, "resp": {"time": 1597856069568, "text": "Thank you for taking the time to leave a review, Ms. Hobbs! We will make sure Dr. Reddy knows how pleased you are with her care."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "102346525844950518895", "name": "Daily in The Word", "time": 1508211020017, "rating": 5.0, "text": "Wonderful experience with Dr. Jindal and his staff.  First visit was today.  They were kind, courteous, and attentative to detail.  They asked all the right questions, were thorough and seemed to be interested in finding the best treatment plan possible.", "pics": null, "resp": {"time": 1508421690429, "text": "We appreciate your nice comments and feedback, Mr. Kitchens. It's a privilege to care for people in our community."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "112017314760631702903", "name": "lewis jolly", "time": 1567541626752, "rating": 1.0, "text": "Never go to Dr. Jindal. He left paperwork on his desk and did not send it in so my son's drivers license got suspended.", "pics": null, "resp": null, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "111707701803401322468", "name": "Cal and Dar Lawley", "time": 1614181132307, "rating": 5.0, "text": "Dr. Garg is an extremely thorough and professional doctor. She has been my thyroid doctor for over a year now and I wouldn't dream of changing. Although the wait in the waiting room can be somewhat lengthy at times, the staff are all very friendly. If you're looking for an endocrinologist, I highly recommend Dr. Garg.", "pics": null, "resp": {"time": 1614289356717, "text": "It is our honor to provide compassionate care always! We are delighted to hear this feedback and thank you for sharing."}, "gmap_id": "0x888e803f6c3e914f:0x99f1e3c56e88478"}
{"user_id": "108221869444738187658", "name": "Leti JB", "time": 1613144258937, "rating": 5.0, "text": "Dr. Garg is a great listener, she appears to be truly concerned about her patients, and is very knowledgeable.  I really liked the fact to that she has called me personally to discuss results.", "pics": null, "resp": {"time": 1613778684482, "text": "We are honored to provide compassionate care for the people of the River Region! Thank you for sharing."}, "gmap_id": "0x888e803f6c3e914f:0x99f1e3c56e88478"}
{"user_id": "107126770959605064930", "name": "lou harris", "time": 1608682238949, "rating": 5.0, "text": "Excellent service from all aspects - front desk to exam room.", "pics": null, "resp": {"time": 1611010222520, "text": "Thank you for sharing! We are honored to serve the patients of Central Alabama with excellence in healthcare."}, "gmap_id": "0x888e803f6c3e914f:0x99f1e3c56e88478"}
{"user_id": "106546310690683916256", "name": "Daniel Pope", "time": 1568264026386, "rating": 5.0, "text": "Dr. Garg is an excellent endocrinologist. Very caring with a great personality. She has been my endo for several years and has exceptional knowledge in her field of medicine and is a true professional.", "pics": null, "resp": {"time": 1568302326715, "text": "Thank you so much for your review. It is our honor to be your healthcare provider. If there is anything further we can do for you, please don't hesitate to call us at (334) 613-7070."}, "gmap_id": "0x888e803f6c3e914f:0x99f1e3c56e88478"}
{"user_id": "107849092721032919838", "name": "Tony Montgomery", "time": 1545325095237, "rating": 5.0, "text": "Dr. Garg was very great. She listened to my concerns and her replies and suggestions were helpful. I'm glad she is my new Doctor. Very fast service.", "pics": null, "resp": {"time": 1545410035340, "text": "Mr. Montgomery - thank you so much for your review. It is our honor to be your healthcare provider. If there is anything further we can do for you, please don't hesitate to call us at (334) 613-7070."}, "gmap_id": "0x888e803f6c3e914f:0x99f1e3c56e88478"}
{"user_id": "103928093621604817127", "name": "Annie Bishop", "time": 1553269451039, "rating": 5.0, "text": "Dr. Garg is Awesome!! Very professional and knowlegeable. Takes time with you to answer all your questions and concerns. Annie B", "pics": null, "resp": {"time": 1553700010951, "text": "Thank you so much for your review. It is our honor to be your healthcare provider. If there is anything further we can do for you, please don't hesitate to call us at (334) 613-7070."}, "gmap_id": "0x888e803f6c3e914f:0x99f1e3c56e88478"}
{"user_id": "117665421855410351840", "name": "Michael DeVine", "time": 1545336693461, "rating": 5.0, "text": "Extremely pleasant. My my Doctor of 34 years retired and I was unsure of what to expect. Dr. Garg was willing to proceed cautiously. I was very much pleased.", "pics": null, "resp": {"time": 1545410020505, "text": "Mr. DeVine- thank you so much for your review. It is our honor to be your healthcare provider. If there is anything further we can do for you, please don't hesitate to call us at (334) 613-7070."}, "gmap_id": "0x888e803f6c3e914f:0x99f1e3c56e88478"}
{"user_id": "106276702774166680149", "name": "Abby McNeil", "time": 1566073110123, "rating": 5.0, "text": "I have seen dr garg once so far and drive from Dothan to see her as I come to Montgomery regularly . I am pleased with her services so far. She listens and seems very thorough with her patients . I did not feel brushed off , and although some labs are still pending , I have had her office call me with updates on them letting me know they haven’t forgotten about me and they’re still pending and I really appreciate that . All in all a great clinic and dr so far and worth my time for the drive . -Catherine", "pics": null, "resp": {"time": 1566316841801, "text": "Thank you so much for your review. It is our honor to be your healthcare provider. If there is anything further we can do for you, please don't hesitate to call us at (334) 613-7070."}, "gmap_id": "0x888e803f6c3e914f:0x99f1e3c56e88478"}
{"user_id": "115917392509875271202", "name": "Amy Boyd", "time": 1627932475730, "rating": 5.0, "text": "Dr. Garg is the best thing that has happened to me in years! She is very knowledgeable about any questions I have and is never rude or arrogant when answering! Her bedside manner\n(Office Manner) is great! I was her first patient here at UAB MONTGOMERY and what a blessing for me and my medical problems!! Love Dr. Garg!!!! It is great to have UAB and these physicians here!!!", "pics": null, "resp": {"time": 1545925737271, "text": "Ms. Boyd - thank you so much for your review. It is our honor to be your healthcare provider. If there is anything further we can do for you, please don't hesitate to call us at (334) 613-7070."}, "gmap_id": "0x888e803f6c3e914f:0x99f1e3c56e88478"}
{"user_id": "115991565865172184318", "name": "Sweetbluxila", "time": 1620736058983, "rating": 1.0, "text": "Jeanetta....i thought she was a good doctor because I was referred to her but her and her staff is trash! They say smart remarks when asked a question and her staff backs her up. She has no compassion for nothing. She just sit there and record on her recorder. I tried to tell her I been in the hospital for somethinhg else she literally did not care,if asked for more info about the can do ,and the don't do. She clearly does not care. She called about my diagnoses over the phone. To me that is rude,and unprofessional.   would ask her staff questions to see if they had compassion and faith I needed nope they just ran to,Dr.Robles and say I complained and questioned her care,and am I at the right place thatvcan get me back on track. I needed this becauae i just had a baby,and know im here scared ,emotional and  just had a baby. That was the last time I went to her. I wasnt going back. However,she sent me a discharge paper in the mail. Smh....NeVer will i recommend this place.", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x7eb96e6b1fc851a0"}
{"user_id": "109700316391970367811", "name": "Doylynn Lawler", "time": 1584555451628, "rating": 5.0, "text": "I have to say that in the three and a half years that Dr. Cardenas (Robles) has been my doctor, I have only experienced compassion and excellent care from both Dr. Robles and the folks at the front counter in Anniston Medical Clinic. They have been very caring and polite during the times I visited the office. Of course, I always try to treat THEM with respect and kindness as well. In my humble experience, you generally get what you give. Just a thought.", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x7eb96e6b1fc851a0"}
{"user_id": "117073491258711811820", "name": "Mizzuz Mo", "time": 1597416706414, "rating": 5.0, "text": "Dr. Robles is incredibly thorough, patient, knowledgeable, and so kind. I am so so happy I didnt let reviews deter me(I seriously almost didn't come😅). The staff are friendly and personable--and here I'll mention those who really brightened my day and made an already scary visit more pleasant: Mrs. Helen at the front desk, Nurse Erica, Sarah in admin, Brook in ultrasound, and Mrs. Louise from Labcorp. All of them lights in a dark world. No one is perfect people! No one. I've seen an issue today with a patient who's appointment was changed without notice. So call and verify the afternoon before, but please when you do get here, smile--thru your mask(they'll see it in your eyes☺) at the wonderful souls who risk their health to better ours.", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x7eb96e6b1fc851a0"}
{"user_id": "117252112392165096389", "name": "Sherita Tuck", "time": 1572982942400, "rating": 1.0, "text": "Was a good doctor at first, but she changed. She is rude and says smart remarks. She has no compassion for nothing. She just sit there and record on her recorder. I tried to tell her I been in the hospital and what they diagnose me with. She did not care at all and that was the last time I went to her.", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x7eb96e6b1fc851a0"}
{"user_id": "111749521313869742963", "name": "Karen Dodd", "time": 1535404453524, "rating": 5.0, "text": "Love her & her staff! Have not had to wait on anything. Have been a diabetic for 25+ years & learned more from her & this facility in 3 months than all the others put together. Took lots more time explaining things to me & my family than any other! Thank you! The family who recommended her to me felt the same way about her!", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x7eb96e6b1fc851a0"}
{"user_id": "101376751584495148017", "name": "Rick Oglesby", "time": 1493464692644, "rating": 5.0, "text": "Dr. Cardenas listens, cares and knows her stuff. She works to help you live your life rather than to force you into the perfect numbers. Christina is an excellent assistant. This is my 50th year on insulin and Dr. Cardenas is my favorite of all who've treated me. I highly recommend her!", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x7eb96e6b1fc851a0"}
{"user_id": "108034383791985739178", "name": "Vicky King", "time": 1550085744003, "rating": 1.0, "text": "Rudest  doctor I've ever meet zero compassion.  I've never meet a doctor that I've had to ask to please look at me so I can talk to you.", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x7eb96e6b1fc851a0"}
{"user_id": "106203414227211911425", "name": "Joshua Abercrombie", "time": 1523475388511, "rating": 3.0, "text": "Dr. Cardenas is amazing however I have had a very difficult time getting 1 piece of paperwork sent to my surgeon. I have left several voicemails at the \"nurses station\" over the last week and a half and have not received a call back or gotten the paperwork sent. I asked the receptionist if I could speak to someone in Dr. Cardenas office and was informed that was impossible and that leaving a voicemail was the only option. I then asked if I could leave a message with her and she said that they never see the nurses, that they work on a different floor. To say this is frustrating is an understatement. While I highly recommend Dr. Cardenas I would also stress that you should expect things to move very slowly and to be ready to wait for things to get done. It looks like I will have to drive from Gadsden to Anniston just to get the paperwork myself.", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x7eb96e6b1fc851a0"}
{"user_id": "116182156811244973437", "name": "Carol White", "time": 1513706555910, "rating": 5.0, "text": "Wonderful lady! Love her and her staff!", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x7eb96e6b1fc851a0"}
{"user_id": "113268033047830032516", "name": "Ken Medders", "time": 1449014316565, "rating": 1.0, "text": "No much!!  Very disappointed,doesn't take time with patients,just tests after tests after tests with no explanation just pay your deductible and come back for more tests.would not recommend her as a specialist", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x7eb96e6b1fc851a0"}
{"user_id": "111646615726534750783", "name": "T K", "time": 1529359882745, "rating": 1.0, "text": "Allowed me to get into real danger\nIn 2015", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x7eb96e6b1fc851a0"}
{"user_id": "106192780229423452650", "name": "Jamie Robinson", "time": 1501914501294, "rating": 3.0, "text": "She's okay just needs to slow down when talking to her parents", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x7eb96e6b1fc851a0"}
{"user_id": "104921093303845475746", "name": "Tylor Curvin", "time": 1538409486818, "rating": 5.0, "text": "Thorough and cares!", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x7eb96e6b1fc851a0"}
{"user_id": "114003018825315748882", "name": "Dale Austin", "time": 1351864993786, "rating": 3.0, "text": "Dr. Cardenas ROCKS, her staff does not. Replace them, and you'll have an A+++++ Endocrinologist center!", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x7eb96e6b1fc851a0"}
{"user_id": "106506008189482969051", "name": "Samuel Steele", "time": 1627353711923, "rating": 1.0, "text": "I had the worst experience with Dr. Habermacher, I had went to ER with a kidney stone and was told it measured 7mm, was told to follow up with Urologist from your clinic,I saw NP on day of appointment which was very nice,I ask for a scan to be done before so we would know if stone was still there. The morning of surgery, Dr. Habermacher came into room I ask if he was going to do scan to make sure stone was gone, he replied no, it will be gone today one way or another. I had passed very small pieces of stone but definitely not a 7mm in prior week.When I awoke from procedure I was told there was no stone, after getting home I was very sick from procedure and very sore. I went for my follow-up, I told the girl that checked me in that I was upset that he did not do KUB to make sure the stone was gone also, that I am a nurse and have had enough of kidney stone patients to know how to check for kidney stones and I definitely had not passed a 7mm. She said I will tell him, she immediately came back in room and said this is a nurse visit, he wants you to do 24 hr urine and come back in 2 months. I have no intentions of ever using him again, why would you not do a KUB or scan to make sure it's gone before putting someone through this, it sounds like it's all about money to me. WILL NEVER use this Dr again.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "107560826844517747305", "name": "Nathan Herrick", "time": 1611344210315, "rating": 1.0, "text": "Received a referral from my insurance company to this clinic to see a Gastroenterologist and I cannot even schedule an appointment. For the last two months, I have called the only available phone number to make an appointment only to be transferred to the gastroenterology clinic appointment line where I have left several messages with the scheduler because that person was not there. No return calls and the office is closed on Friday.", "pics": null, "resp": {"time": 1614290855284, "text": "Nathan, we would value the opportunity to connect with you further. Our patient care team can be reached at (334) 613-7070 at your convenience. If you would prefer to speak with our Patient Advocate, please call (334) 568-4866."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "118035772244836917308", "name": "Renae Pemberton", "time": 1604533118108, "rating": 1.0, "text": "I would not recommend anyone to Dr. Habermacher. My husband and I received some news that was scary and the doctor was not empathetic towards us. He does not like for his patients to do any scholarly research to help the patient or families to be knowledgeable on their diagnosis. He will get offended if you ask questions in which he feels a patient is second guessing his medical knowledge. He talked down to us and no doctor should ever talk to people in that way. Listen to your gut or in my case the Holy Spirit if something does not sit right with you about someone taking care of your loved one. I pray Dr. Habermacher is a Christian and if not that he will come to know the love of Jesus.", "pics": null, "resp": {"time": 1606179290463, "text": "Renae, we would value the opportunity to connect with you further. Our patient care team can be reached at (334) 613-7070 at your convenience."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "106276702774166680149", "name": "Abby McNeil", "time": 1601472617242, "rating": 5.0, "text": "I’ve been a patient of dr garg for a little over a year and she’s great . Yesterday I came in and I just wanted to call out one of the endocrinology nurses , Jennifer , and tell her how kind and wonderful I thought she was at her job. Jennifer went out of her way to make sure I was comfortable during a really long glucose test I had . Dr garg also takes a whole body approach to your treatment , and it is truly worth my drive from Dothan where all our endos are retiring/booked to come to this clinic .", "pics": null, "resp": {"time": 1601482922083, "text": "Abby, thank you for the kind review. It is our honor to provide excellence in care to the people of Alabama!"}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "111188159416355907851", "name": "Jaime Denise", "time": 1608335886715, "rating": 3.0, "text": "They schedule way too many people at the same time, so the waiting time is HOURS.", "pics": null, "resp": {"time": 1614290484766, "text": "We understand your concerns and know that your time is valuable. Your feedback has been shared with our team and we thank you for your patience in this intricate season of care."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "113464080315346843401", "name": "Tony Boyer", "time": 1545582087126, "rating": 5.0, "text": "At times finding proper care that gives you the feeling your best interest has been top priority can be a challenge in the Montgomery area.  We typically go to Birmingham for peace of mind.  My first visit to UAB Urology clinic was one of the best experiences I've had anywhere.  Professional, engaging, reflective, and not reluctant to challenge the knowledge and awareness of their patients.  Dr. Habermacher understood my level of comprehension to quickly lend understanding to my concerns & how to handle my own personal health going forward.  Without being too long winded, I have to express gratitude for the opening and benefits of this clinic for Montgomery residents & anyone within reasonable distance.  Checks all the boxes both physically and psychologically to assure patients care is their top priority.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "109149654432663969534", "name": "Jeff chappell", "time": 1580739399408, "rating": 1.0, "text": "Apparently negative reviews get taken down quickly?  Dr. Thudi, an endo, has the worst communication skills.  Does not listen, assumes, and is too proud to admit mistakes.  They return calls, but only if you're waiting by the phone.  No voicemails except \"please call us back\" and you never get a live person, so it's voicemail tag over and over and over.  Add that to their \"never on Friday\" rules and you've got a setup for making money with zero customer service, much less patient service.\nAnd DON'T even think of adding a response to this about \"We'd like to talk with you about your experience\".  We spoke, we emailed, and THIS IS my response to your customer care.  Don't act like this is the first you have heard of the problem.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "110810778778295902588", "name": "Evelyn Young", "time": 1529426965919, "rating": 2.0, "text": "I have had zero problems until today. You have one number for the entire clinic. They have several specialists. So it is hard to reach the person you need. I called asking for a specific person and extension. I was asked the person last name .They did not leave a last name. I gave the extension#. I was asked what is the nature of the call. I still did not get the person that left the message. Guess if it's important they will call me back..", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "111193115751902347353", "name": "Tamra Oswalt", "time": 1570210263130, "rating": 1.0, "text": "I'm very disappointed I have been to four doctors in the past month about my foot and my toe I am in excruciating pain mobic is helping and your office closed at noon today because it's Friday well I don't consider an emergency other than I'm excruciating pain and can't walk. So what am I supposed to do?\n\nVery disappointed how the doctor he's never seen me going to know what to do for me", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "114165500896750655586", "name": "Scott Thompson", "time": 1538578909414, "rating": 2.0, "text": "Originally given 1-star: Waited for 6 weeks for an appointment just to have a consult. The Friday before the Monday afternoon appointment I get a call saying Doctor Hablemacker would be out of the office and they had rescheduled me for two weeks later in the morning instead of the original afternoon. They required me to call and confirm to keep the new appointment. No further explanation. No options given for the inconvenience. Attempted to call at 2:30 pm when I got the message, but the office was already closed. Apparently they also don’t work on Friday afternoons...\n\nUPDATE TO POST (10/18): Upgraded to 2-star.The office was able to accomidate a different appointment time since I was going to be out of the country during their first rescheduled time. Initially, they didn't have availability, but were willing to squeeze me in for the short consult given the previous circumstances. I will reconsider again after the appointment/service.", "pics": null, "resp": {"time": 1536593512763, "text": "Mr. Thompson,\nWe are very sorry we did not meet your expectations.  Please do call our office today between 8 AM and 5 PM to find a more convenient time for your appointment."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "105513552415487179721", "name": "Grover Wedgeworth", "time": 1555512481353, "rating": 1.0, "text": "Service sucks, no follow up on lab between visits, .Failed to provide consultation notes and labwork to my wife's primary doc.  Dtaff are curt cna rude", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "100199861040353856532", "name": "DeAndre Scott", "time": 1542033819723, "rating": 5.0, "text": "I have been coming to the UAB Specialty clinic to see Rheumatology. Dr. Gadea and his staff are some of the best medical professionals I have ever come across. Having worked in the medical field for 16 years (21year USAF Vet), I have worked with countless professionals. I can only highly recommend Dr Gadea and his team as their patient care exceeds the standard every visit!", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "109337083997686348338", "name": "Wendy Adams", "time": 1545164083529, "rating": 1.0, "text": "This is a poor excuse for a gastroenterology center. My husband is having issues with abdominal pain and other stomach issues and we were told by Dr. Kahn that if my husband continued to have issues that he should go back to the ER and let them call him and see if he could get in for an emergency colonoscopy. Well he went back to the ER and they ran all kinds of test and just because his blood work came back fine, the ER staff and Dr. Kahn refused to admit him and said that he would have to wait until Feb to have a colonoscopy scheduled.  So the doctor lied to both of us. Needless to say my husband is still in very bad pain. So nothing bad better happen to my husband because of their negligence.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "109629967256740502457", "name": "Andrea Curtis", "time": 1536710565402, "rating": 5.0, "text": "The doctors here are excellent.  I especially like Dr. Nina Jo Hibbard, Endocrinologist,  and Dr. Carlos Gadea, Rheumatologist.  They are knowledgable, patient, and very concerned about the pateient's well-being.    I wouldn't trust my healthcare needs to be handleded anywhere else.   😀", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "105124454187813409107", "name": "Jennifer van Arcken", "time": 1504830525964, "rating": 5.0, "text": "My husband had surgery by Dr. Habermacher and we are very pleased that UAB opened this state of the art clinic in Montgomery and brought such great healthcare professionals to our area. The surgery was a success and the follow up visits at the clinic were accomplished very professionally.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "114492014717223503219", "name": "Bill Flick", "time": 1514917554556, "rating": 5.0, "text": "I have seen Dr. Pazona in Urology and found him to be very competent, professional and pleasant.  The staff were also very efficient and pleasant.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "115584060232493438080", "name": "Tamara Dozier", "time": 1568788922908, "rating": 2.0, "text": "Dr. Mullins was wonderI!!\nI need a new Rheumatologist ...", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "118096554832493583892", "name": "EDDIE SMITH", "time": 1536835072856, "rating": 5.0, "text": "Great doctor took good care of my mother", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "111678628734953407312", "name": "Angela Flemons", "time": 1597706944199, "rating": 5.0, "text": "Dr. Homan is truly the best!! He took the time and fully explained everything. I appreciate everything he did.", "pics": null, "resp": null, "gmap_id": "0x888a3f28a9042d17:0x5471825b6c38985c"}
{"user_id": "118317537622897815329", "name": "lisa Mann", "time": 1611084794370, "rating": 5.0, "text": "He is a very thorough dr.", "pics": null, "resp": null, "gmap_id": "0x888a3f28a9042d17:0x5471825b6c38985c"}
{"user_id": "110915179162498687682", "name": "Patjen Winn", "time": 1568661149772, "rating": 5.0, "text": "Dr. Homan is truly an amazing Doctor who cares deeply about his patients!! His staff is equally wonderful as well. Highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x888a3f28a9042d17:0x5471825b6c38985c"}
{"user_id": "110992426794543758886", "name": "Jimmy Singh", "time": 1540619438555, "rating": 5.0, "text": "Dr. Homan is amazing. Takes his time with you, doesn't rush you. Is a great clinician. Since he is so good, the wait times are a bit long. But I definitely recommend him.", "pics": null, "resp": null, "gmap_id": "0x888a3f28a9042d17:0x5471825b6c38985c"}
{"user_id": "116409144619820213885", "name": "D_The Letter", "time": 1555437858239, "rating": 1.0, "text": "Waiting in the room to be seen while he ate lunch not professional if they are going to take lunch then they need to either close for lunch or not have appointments during that time i have others things to do than to wait on the doctor to eat lunch!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888a3f28a9042d17:0x5471825b6c38985c"}
{"user_id": "105594355121661133492", "name": "Grand Bay City Girl", "time": 1610537419342, "rating": 5.0, "text": "Always a great visit", "pics": null, "resp": null, "gmap_id": "0x889bb28d76f1a4c9:0x1d8721508fc0f239"}
{"user_id": "101052172992418529301", "name": "Jan Leigh Bautista", "time": 1566094564241, "rating": 5.0, "text": "Dr. Oscar is amazing endocrinologist! He really knows his stuff and takes the time to examine his patients. Thank you so much!", "pics": null, "resp": null, "gmap_id": "0x889bb28d76f1a4c9:0x1d8721508fc0f239"}
{"user_id": "106244100020395456445", "name": "Joycelyn Wiley", "time": 1553699213671, "rating": 5.0, "text": "Great doctor!! He listens and takes great care of his patients. Ive been going to him for almost three years ive lost almost 100lbs following his recommendations!! one of the best doctors i know!", "pics": null, "resp": null, "gmap_id": "0x889bb28d76f1a4c9:0x1d8721508fc0f239"}
{"user_id": "116870426688510535173", "name": "Anthony Andrade", "time": 1566093663531, "rating": 5.0, "text": "I have seen Dr.Castro for several and many times. He is very caring and very compassionate doctor. He is always on the top of everything.", "pics": null, "resp": null, "gmap_id": "0x889bb28d76f1a4c9:0x1d8721508fc0f239"}
{"user_id": "110954375246238619952", "name": "Rei Eevee", "time": 1549318658778, "rating": 2.0, "text": "The Dr himself isn't bad.. he listened to me at least.. but he way overbooks and I have had to wait anywhere from 1 1/2 - 5 hours to actually be seen. And if you leave because of the wait they charge you for the appointment.", "pics": null, "resp": null, "gmap_id": "0x889bb28d76f1a4c9:0x1d8721508fc0f239"}
{"user_id": "112275506251902148409", "name": "Cyrus Cornez", "time": 1566093924845, "rating": 5.0, "text": "Dr. Oscar is very thorough doctor that really tries to help his patients. Highly recommended endocrinologist!", "pics": null, "resp": null, "gmap_id": "0x889bb28d76f1a4c9:0x1d8721508fc0f239"}
{"user_id": "111867448524325452339", "name": "Desirèe McWhorter", "time": 1457674924163, "rating": 1.0, "text": "Worst doctor's appointment I've ever had. Dr. Castro went straight to wanting to change my thyroid medicine without asking me any questions or doing ANY blood work. When I told him what I am on has improved my quality of life, he didn't want to hear it. He insisted his suggestion is \"the best\" even though it is really expensive. What is best for one person isn't best for everyone. It's obvious he is getting major kickbacks from that pharmaceutical company. I ended up walking out because he didn't care about how I felt or what I had to say. The only way I was able to get a word in was by interrupting him. I've been to numerous doctors due to my thyroid disease, and he is by far the absolute worst I have ever, ever dealt with. He even answered his personal cell and walked out of the room during the appointment. Highly unprofessional, arrogant, and lacks compassion.", "pics": null, "resp": null, "gmap_id": "0x889bb28d76f1a4c9:0x1d8721508fc0f239"}
{"user_id": "106003762929787122505", "name": "Ben Adams", "time": 1547872539677, "rating": 1.0, "text": "I was referred to Dr Castro...he was in to see me about 10 minutes. Due to surgery and other medical treatments my A1c was high. He told me my pancreas wasn't making insulin without testing me to be sure. I took metformin for years. He put me on insulin. After using amount he said my sugar dropped to 40 and 44 first to nites. 3rd day l was so sick sugar dropped had to go to bed. He over medicated me. Very dangerous. I will never use him again.", "pics": null, "resp": null, "gmap_id": "0x889bb28d76f1a4c9:0x1d8721508fc0f239"}
{"user_id": "101368369536981928582", "name": "Meg Raley", "time": 1531876574160, "rating": 1.0, "text": "This doctor was so bad that I reported him to my insurance company after my first and only visit!", "pics": null, "resp": null, "gmap_id": "0x889bb28d76f1a4c9:0x1d8721508fc0f239"}
{"user_id": "114731952114763577638", "name": "Go Medical Staff", "time": 1553392159757, "rating": 5.0, "text": "Best endocrinologist in Mobile!", "pics": null, "resp": null, "gmap_id": "0x889bb28d76f1a4c9:0x1d8721508fc0f239"}
