{"user_id": "108233123939057495014", "name": "J L", "time": 1588632614294, "rating": 5.0, "text": "Dr Collier is the best.  Topnotch, staff, office and care.  He is a wonderful man, very compassionate, great care and his work is painless.  Don't waste your time going elsewhere, Dr Collier is the only person for a root canal.  He's #1.", "pics": null, "resp": null, "gmap_id": "0x888919a0ffbb611b:0x9b2f02d1b95bec8b"}
{"user_id": "108649795811651433616", "name": "Mo B", "time": 1590808904370, "rating": 5.0, "text": "I was referred to Brookwood Endodontists for a root canal that hurt so bad my ear felt the pain! 😀 They got me in that day and did the root canal. Dr. Collier was the one who drew the short straw to get me as a patient cuz I'm the biggest pansy when it comes to dental work and he did AWESOME work.  They made sure I was as comfortable as possible and took xrays during the procedure which is a good sign of thoroughness. All the staff were friendly and professional. For someone who doesn't like dentists (nothing personal) I wish I could hear more from this staff personally. Being a Christian, this office reminded me of the body of Christ and I wish I had more! Great example y'all!", "pics": null, "resp": null, "gmap_id": "0x888919a0ffbb611b:0x9b2f02d1b95bec8b"}
{"user_id": "115848615215490859083", "name": "Kim Jerkins", "time": 1521829172989, "rating": 5.0, "text": "Had a root canal performed and the staff was extremely nice.  Before the procedure the doctor explained everything and made sure I understood. While the root canal was being done Dr. Collier and his assistant asked me several times if I was doing okay or needed anything.  I was already pretty nervous so this definitely made the visit more pleasant.  After they were done I was given my Rx and instructions for what I needed to do.  The next day the office called to check on me and ask if I had any questions.  If I ever need anything else done I will definitely go back.", "pics": null, "resp": null, "gmap_id": "0x888919a0ffbb611b:0x9b2f02d1b95bec8b"}
{"user_id": "105518604220617310433", "name": "Cierra Cherry", "time": 1548253296636, "rating": 5.0, "text": "Dr. Collier and his staff are absolutely amazing. I would recommend anyone getting a root canal to come see him.", "pics": null, "resp": null, "gmap_id": "0x888919a0ffbb611b:0x9b2f02d1b95bec8b"}
{"user_id": "111758043690526811496", "name": "Danny McCullars", "time": 1540069124156, "rating": 1.0, "text": "Really? You are a root canal dentist that goes on TV and promotes Gary Palmer crying to repeal the Affordable Care Act, which of course includes repeal of protection of discrimination against preexisting conditions. The oath doesn’t apply to dentists? Face on TV? Palmer line your pocket? Smells disgusting.", "pics": null, "resp": null, "gmap_id": "0x888919a0ffbb611b:0x9b2f02d1b95bec8b"}
{"user_id": "108724508180379938877", "name": "Laura Gail Claassen", "time": 1470943087874, "rating": 5.0, "text": "At 8 months pregnant and wearing Invisilign braces, I was experiencing tooth sensitivity and discoloration on one tooth. In a panic, I called Dr. John Collier and they fit me in at lunchtime. Not only that, but the office manager babysat my 4 year old and kept him entertained while Dr. Collier examined me. He determined that I needed a route canal and said that I could stay there and get it done and they would continue to look after my little boy so I wouldn't have to come back. Only a few hours later and the discoloration is already gone. Dr. Collier and his staff prayed over me and handled me with such sensitivity and compassion that I cannot imagine getting endodontics service done anywhere else. Also, they have a beautiful waiting room to boot. Do not go to anyone else but Dr. Collier - you won't be dissappointed!!!!!", "pics": null, "resp": null, "gmap_id": "0x888919a0ffbb611b:0x9b2f02d1b95bec8b"}
{"user_id": "106022530090860692803", "name": "Clifton Payne", "time": 1557786870036, "rating": 5.0, "text": "Absolutely great Dentist", "pics": null, "resp": null, "gmap_id": "0x888919a0ffbb611b:0x9b2f02d1b95bec8b"}
{"user_id": "103325645322535178179", "name": "L S", "time": 1623265694049, "rating": 5.0, "text": "Dr. Kamburis and his staff will make you feel comfortable and put your mind at ease as soon as you walk in the door! I was very nervous for my root canal but I didn't need to be since he explained everything, and it was painless and I felt so much better after. I will definitely recommend Dr. Kamburis and his staff to everyone!", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "102266523280671237874", "name": "Alese Morgan", "time": 1591376398774, "rating": 5.0, "text": "Dr. Kamburis and his team are top notch! Dr. Kamburis made sure I had little to no discomfort  and communicated with me throughout the procedure. Dr. Kamburis and staff are hyper vigilant on infection control protocols during pandemic and I felt comfortable my entire visit. Follow up  phones calls made me feel well taken care for my  post procedure needs. The entire staff is top notch and you can tell they pride themselves on delivering quality care. Thank you for all your care. I will recommend you to all my friends and family.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "106435984177562761127", "name": "Bobbie Weldon Canada", "time": 1582227053275, "rating": 5.0, "text": "Wonderful experience when having a root canal!\nDr. Kamburis Is very compassionate and gentle.\nHe  continued to check on how I was doing from the beginning of the procedure and until he was finished. His assistant, Ashley, was also  gentle. They were clear about everything that was happening, so there were no surprises. And I hate pain, but no worries there. Dr. Kamburis gradually gave me a type of numbing so that I hardly knew anything was happening. I couldn’t be more thrilled to find\nDr. Kamburis and his sweet staff! The receptionist was amazing, too!! Thank you all so much!", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "100704011149417222891", "name": "Mary Grace Tackage", "time": 1595808766652, "rating": 5.0, "text": "Dr James Kamburis and staff were all very friendly and very nice! Felt very comfortable with them all!\nAlso very professional!", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "116625379612005076653", "name": "William Barnes", "time": 1567370594219, "rating": 5.0, "text": "Excellent doctor.  Dr Kamburis was very thorough and knowledgeable.  He and his staff were very courteous.  They followed up with me to make sure I was doing well.  I highly recommend his services.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "112295862800996545067", "name": "Katie Nelson", "time": 1567285094468, "rating": 5.0, "text": "Really good visit.  The staff was super nice and the doctor was really patient with me.  Definitely if I ever needed another root canal I would return .", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "103668431326855421346", "name": "Amanda Cook", "time": 1579032223277, "rating": 5.0, "text": "They were so kind and able to see me quickly. I will definitely use them again.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "107098208267761510677", "name": "Randy Johnson", "time": 1581010129752, "rating": 5.0, "text": "I’m glad I went to dr Kamburis for my root canal because he was patient with me being nervous. And he answered all my questions. Everyone else in the office was kind and helpful. I will go back to his office if I need another root canal.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "101033881385731931778", "name": "Tamara Winston", "time": 1582577695464, "rating": 5.0, "text": "Great staff and service.  The assistant (Ashley) and Dr. Kamburis were very thorough with explaining the root canal process.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "116984804153257218339", "name": "jackie scott", "time": 1588910010751, "rating": 5.0, "text": "I have had no problems and it was super easy. Thanks a bunch", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "102765074633604768147", "name": "Stephanie Park", "time": 1550769663913, "rating": 5.0, "text": "I really liked the mouth dam. Made me feel more comfortable. Constant checking on me made me feel good too. I like to know that I am cared for and comfortable. Thank you !", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "115141876435384650607", "name": "Andrea Brown", "time": 1580415890026, "rating": 5.0, "text": "Dr. Kamburis and his staff was very professional and caring.  I impressed with the services.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "100091095028565432849", "name": "Lori Smart", "time": 1549400393221, "rating": 5.0, "text": "I cannot say enough about the positive experience I had at Dr. Kamburis’s office.  First of all, because I was in such pain, his receptionist kindly fit me in on a busy Monday morning.  Having had two root canals before, at different offices, I wasn’t looking forward to another.  Yet my experience was so amazing.  Every step of the way, both the assistant and Dr. Kamburis explained exactly what was being done.  The gentleness of Dr. Kamburis calmed my fears.  He asked several times if I was feeling any pain – and he went overboard to assure me that he’d give me more Novocain if I were experiencing the slightest pain.  He was gentle in administering it as well in the whole root canal process.  I could tell he was knowledgeable and experienced in this procedure; yet he explained it all to me in terms that I could understand.  My husband, who is also in the dental field, joked that he had never known someone who got so excited as me about a root canal! I have already recommended Dr. Kamburis to several people and am truly grateful to this wonderfully competent and kind doctor and his amazing staff.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "109095333528053701961", "name": "Sallie Hines", "time": 1552572973794, "rating": 5.0, "text": "By far the best experience that I have ever experienced. Today, I had a root canal done. At hello the staff was completely amazing and willing to take my anxiety to an ease. Dr. Kamburis helped me through my needle phoebea, and I must admit I barely felt a thing!!! Amazing! Amazing!! Thank you for taking care of me and allowing me to find trust into you guys", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "107276513837004802404", "name": "Todd Taylor", "time": 1528566652071, "rating": 5.0, "text": "I wouldn't get a root canal from anyone else in this town, and you shouldn't either! Dr. Kamburis is totally professional and personable, just a great guy. I've had 2 root canals from him, and it just couldn't have gone any smoother. Oh, and pain free! The support staff is super accommodating and courteous, also. 5 stars across the board!", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "101945888554714050778", "name": "Marc Berg", "time": 1550587791445, "rating": 5.0, "text": "You guys did a great job! Attentive care by doctor and staff. Much appreciated. 10 out of 10. Would recommend!", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "109946477813523880835", "name": "Tommy Jenkins", "time": 1547169260901, "rating": 5.0, "text": "The BEST dental experience I've ever had. The doctor was informative and made sure I was comfortable through out the root canal. Thanks for being so kind and professional.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "109325188971958953578", "name": "Brian Harrison", "time": 1508116872131, "rating": 5.0, "text": "Fantastic office and staff.Timely with my appointment and Dr. Kamburis was very skilled and made sure to take the time to explain his thoughts, diagnosis, recommendations, and the procedure. I live in Atlanta, while in Montgomery. I needed help. I came in with a broken tooth. Dr. Kamburis was able to fix me up in 1.5 hours in a single day(no required follow up visit). Painless, convenient, and competitively priced. He is a great asset to the city of Montgomery. He and his staff kept me at ease the whole time I was there. I will return again. I wish Dr. Kamburis was in Atlanta.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "102477968945104408693", "name": "Stuart Patton", "time": 1583857961452, "rating": 5.0, "text": "Very well done!\nTotally painless. Thank you!", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "102076754494330349377", "name": "Beautiful", "time": 1553645731021, "rating": 4.0, "text": "I was charged me almost 1,000.00 for a re treatment of a root canal. They asked me to pay even first like I would try to get free services or something which was  insulting.1,000.00 is a  big price tag  and they gave me a temporary fill in for my tooth. I still have to spend more money and get a permanent fill in. My procedure was fast. Also, I can't close my left eye all the way from the numbing medication. Other than that my procedure was fast and they were very caring.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "103384336321217697929", "name": "Arich Ryan Reynolds", "time": 1533153827066, "rating": 5.0, "text": "Friendly staff! Put me at ease! Procedure was much faster and without near as much pain (and I’ve had multiple root canals with at different places before). Very impressed!", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "104457896690230054143", "name": "Raul P", "time": 1542049810221, "rating": 5.0, "text": "Went  to Dr Kamburis for root canal therapy. He and his staff were great.  The whole procedure took about 45 minutes and it was painless.  It was a wonderful experience.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "101286209376724531200", "name": "Altrenna Thomas", "time": 1531772474861, "rating": 5.0, "text": "I am very impressed with Dr. Kamburris.  His staff is very nice and knowledgeable about teeth.  His office is very clean.  He is very knowledgeable about root canals.  I am so happy that he did my root canal and not some other doctor.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "116353646349107413702", "name": "Alan Johnston", "time": 1527963638783, "rating": 5.0, "text": "I got an appointment very quick and the root canal was easy. Dr. Kamburis and the young lady assistant checked on me to make sure I was ok. The whole office really cares. I would recommend anyone that needs a root canal.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "118324722047530787755", "name": "kim johnson", "time": 1558492626794, "rating": 5.0, "text": "Just wanted to thank everyone for being so nice and having a good experience. I've had no more problems!!", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "104359142071195942712", "name": "Kelly Lafreniere", "time": 1548101644227, "rating": 5.0, "text": "Everyone was very gentle and professional. It was not painful and I would recommend the office to friends. It was a great experience.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "106906691289817422899", "name": "SaLena Embry", "time": 1513048278765, "rating": 5.0, "text": "The office staff, the assistants, and Dr. Kamburis himself, made the root canal process as pleasant and painless as it could have been.  He was so gentle with me and so conscientious of my comfort. He checked in with me every few moments to make sure I wasn't in any pain. His assistant was wonderful; she explained the equipment she would be using and was very kind.  I had no pain, only slight discomfort from the numbing which passed quickly. And i have no had a single issue since: I followed the post treatment directions and I haven't had any pain, swelling, or discomfort of any kind. I plan on thanking my dentist wholeheartedly for referring me to this office.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "110720621718965997688", "name": "Ariel Underwood", "time": 1535054856440, "rating": 5.0, "text": "Great staff and doctor. They are all so kind and I appreciate the services provided. I will recommend you all to others. Thank you!", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "115572867945754691087", "name": "Johnny Chaney", "time": 1547071299507, "rating": 1.0, "text": "I was overcharged 9x the amount I actually owed them,and after I informed them about their supposedly error,they did not seem to be in any hurry to give me my money. As of this review my insurance has paid them and  they have not reimbursed me. I felt butchered during the root canal and I never even saw the doctor’s face,he came into the room sitting in a chair with a mask on and started working on me. Looking back,I don’t think he wanted to treat me. While I was still sitting in the chair after the procedure,they gave me a survey to fill out which I declined. I will not go back to him.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "106464017134292414781", "name": "Kimberly", "time": 1509030447572, "rating": 5.0, "text": "Love Dr. Kamburis and his wonderful staff. Took care of my needs right away. Very professional and just delightful to work with! Would highly recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "101426060260878792860", "name": "Jay Arr", "time": 1549486265860, "rating": 5.0, "text": "Did an amazing job on my root canal! Made me feel comfortable the whole way through . Professional attitude", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "111051138105789599985", "name": "Keith Dykes", "time": 1544126277967, "rating": 5.0, "text": "Super friendly staff .They will help you on anything. Couldn't make it another day without them . Extremely helpful .I will recommend anyone to this office.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "114266069203125143387", "name": "Tommy Dorch", "time": 1565117862395, "rating": 5.0, "text": "Was very comfortable considering the situation I'm in. Thanks.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "103531055404541046122", "name": "RandomMom _", "time": 1550159779514, "rating": 5.0, "text": "Great experience. I had been dreading the procedure, but was pleasantly surprised there was no reason to be!", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "108337292855325924046", "name": "Rosetta BrownHuffman", "time": 1549295979256, "rating": 5.0, "text": "Everyone was very nice and explained everything that they did throughout the procedure. It was simply painless.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "100706774218745059031", "name": "sam smith", "time": 1525965287522, "rating": 5.0, "text": "Dr. Kamburis and his staff are outstanding.  Everything was very smooth, from my appointment, the actual procedure and the follow up. I would highly recommend Montgomery Endodontics.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "111070999536822071676", "name": "Sara Brown", "time": 1537817716559, "rating": 5.0, "text": "Dr. Kamburis and his staff are just wonderful people. Very friendly environment. I would recommend Dr. Kamburis to anybody. Such a great place.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "113365296638106423172", "name": "Angie Ciesla", "time": 1542297693320, "rating": 5.0, "text": "Very good experience. Would highly recommend. Ashley was awesome. She is a asset to your practice.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "100712201681374333964", "name": "Ebony Dusk", "time": 1556204250781, "rating": 5.0, "text": "Very friendly staff and they were good about answering all my questions.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "105291604363703426128", "name": "Johnny Strickland", "time": 1548346065231, "rating": 5.0, "text": "Great Doctor! Wonderful staff. Will Highly Recommend.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "106009092900734481504", "name": "Halie Oakley", "time": 1549382782731, "rating": 5.0, "text": "Honestly my best dental experience! I asked as many questions as I wanted and not only did they not mind, they answered them!", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "103084430838817304241", "name": "christa spann", "time": 1508121351524, "rating": 5.0, "text": "Most wonderful experience !!!!! The office is state of the art and beautiful. The staff is friendly and Dr. Kamburis delivered an absolutely painless procedure from start to finish.  I've had the rest, he's the BEST!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "112026745466816987395", "name": "Steve O", "time": 1510166979672, "rating": 5.0, "text": "Very professional, thoughtful and courtesy staff..from the receptionist, the dental assistant to the Dr. himself! Made sure I was comfortable and at ease before beginning and throughout the procedure.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "100332462642014306990", "name": "Briana Jackson", "time": 1542300130663, "rating": 5.0, "text": "They were awesome, very gentle and caring. Will come back any time. Thank You", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "104715380204763219372", "name": "Amber Leeper", "time": 1531772858781, "rating": 5.0, "text": "Very Sweet Staff and Doctor.Always making sure you are comfortable and not feeling any pain.I will definitely recommend Dr. James Kamburis to my friends and family.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "115525433267091755806", "name": "Derinda Moseley", "time": 1525295102465, "rating": 1.0, "text": "The staff is so unprofessional as well as the doctor.  I think there was one person there that had some professionalism.  The doctor basically called me a liar in his office about my followup visit.  Spent well over a thousand dollars at this place to be so disrespected.  I will never return to his office and wouldn't refer anyone else.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "100067892782765091272", "name": "Barry Fencher", "time": 1556808980188, "rating": 5.0, "text": "Best root canal experience I've ever had!!", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "101544467804903701822", "name": "Fannie Pettway", "time": 1548867892939, "rating": 5.0, "text": "Caring staff. Very professional service provided.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "100827900010765897360", "name": "Christyn Howard", "time": 1548867181713, "rating": 5.0, "text": "Staff was very nice and caring!  I definitely recommend and will be back if needed!", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "107845680795417536167", "name": "Charles Boyd", "time": 1544116684374, "rating": 5.0, "text": "Great service and staff thanks to you all very much.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "101921921503720320596", "name": "Janet Mathews", "time": 1553694700844, "rating": 5.0, "text": "Thank you so much for good service. 😃", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "102683194768739668557", "name": "Roger Dyess", "time": 1516301886079, "rating": 5.0, "text": "Excellent staff, prompt appointments, Dr.Kamburis is Supierior with expert skills and knowledge.Goos down to earth communication skills. Cares about his patients.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "116391388323945166559", "name": "Mimi Meria", "time": 1556545551398, "rating": 5.0, "text": "The staff is very professional and caring!!", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "111459037302987849835", "name": "Carlton James", "time": 1537302503938, "rating": 1.0, "text": "Very rude receptionist that refuse to even give a basic time line of ehnr they could see me for a procedure without first making me come in so they can do an evaluation.  Even with evaluation complete at other facility they want to do another one.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "107314176280633441277", "name": "Don Daniels", "time": 1459915271072, "rating": 5.0, "text": "Dr. Kamburris was very attentive to my every need. I felt at home from when I opened the door until I left. The receptionist, nurses and Dr. Kamburris were just like family. I could not have asked for a more friendly and professional group to get to know and have an established kinship. All of us had conversations and it didn't add to my time of waiting. I even received a courtesy call on the way to make sure I good directions to their office because it could have been a little hard to find. I thought now that is service and the beginning of a wonderful morning.\nThanks to Dr. Kamburris and your staff.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "112188294962356277738", "name": "Robbin Simmons", "time": 1506700831461, "rating": 1.0, "text": "Worst experience of my life!  When giving me the numbing shot, he hit a nerve that sent an electric shock through my lip.  During the procedure he was so rough he was banging on my upper teeth with the drill.  I had several panic attacks during the procedure.  Then after the procedure I was so numb I could not swallow which caused me to choke.  I was in the doctor's restroom for over 5 minutes choking and NO ONE came to check on me.  WORST experience of my life!", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "115654489018454084333", "name": "Yvette SEARIGHT", "time": 1546982360667, "rating": 5.0, "text": "Very professional, caring staff, and informative.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "106979149559681703193", "name": "BYRDIE Yeah", "time": 1499813820181, "rating": 1.0, "text": "They don't like to give you a straight up price over the phone because they know they plan to charge you a price that's up in the thousands...if they were to tell u up front before you came then they know that you wont bother to show up.", "pics": null, "resp": null, "gmap_id": "0x888c2a6e18ee9567:0x18f28e78c91cf489"}
{"user_id": "106832065758346559535", "name": "Johnny Morris", "time": 1609881751854, "rating": 5.0, "text": "Truly enjoyed my visit and treatment.....", "pics": null, "resp": null, "gmap_id": "0x88886153dde56083:0x3713aeb4652d806b"}
{"user_id": "108839491054845791803", "name": "Melissa McCay", "time": 1556806912872, "rating": 5.0, "text": "Dr. Cooner and staff go beyond standard care to make sure you have the best smile possible. The staff is always friendly. I've had absolutely amazing service at every visit.", "pics": null, "resp": null, "gmap_id": "0x88886153dde56083:0x3713aeb4652d806b"}
{"user_id": "105647710859236919059", "name": "september Parker", "time": 1393341508329, "rating": 5.0, "text": "I highly recommend this office. They are the best!! They care so much about there patients everyone is like family. Dr. Ray and Dr.Logan take there time in explaining everything in detail. And the Staff is amazing the best staff you could ever have. But most of all the Botox and Filler this office does no one around can compare they are truly artist!!! They believe in making you happy that is there overall goal and making you feel the best you can feel about you and your smile. I love you guys", "pics": null, "resp": null, "gmap_id": "0x88886153dde56083:0x3713aeb4652d806b"}
{"user_id": "111430178989470274729", "name": "Tsunami Shijo", "time": 1494345710253, "rating": 5.0, "text": "Pulled my broken tooth. Rear molar. Seen me the day I called. Got me in, numbed me up, took about 3-5 minutes max to get it out. Paid my bill and went on my way.", "pics": null, "resp": null, "gmap_id": "0x88886153dde56083:0x3713aeb4652d806b"}
{"user_id": "114044018486332805261", "name": "Jerome Hastings", "time": 1550269779321, "rating": 5.0, "text": "Absolutely wonderful staff", "pics": null, "resp": null, "gmap_id": "0x88886153dde56083:0x3713aeb4652d806b"}
{"user_id": "114845407882759373750", "name": "Cara Turner", "time": 1619743557566, "rating": 5.0, "text": "Dr Tedder is such a good soul. I recommend her to anyone. She has been such a wonderful doctor. My Son adores her and loves going to see her . She has the sweetest staff as well.", "pics": null, "resp": null, "gmap_id": "0x889a56499d21ed5d:0xedeaea6c3fd7984c"}
{"user_id": "116222728308596288941", "name": "Thomas Alford", "time": 1621517011243, "rating": 5.0, "text": "Been using Dr. Tedder for years, very pleased with her .", "pics": null, "resp": null, "gmap_id": "0x889a56499d21ed5d:0xedeaea6c3fd7984c"}
{"user_id": "113299956045893800732", "name": "Robert May", "time": 1609279573228, "rating": 5.0, "text": "The folks there are very nice and professional. Everything is super clean, and they take every precaution to be sure patients stay healthy, especially considering COVID-19.", "pics": null, "resp": null, "gmap_id": "0x889a56499d21ed5d:0xedeaea6c3fd7984c"}
{"user_id": "111640263423535988447", "name": "G Floyd", "time": 1601320411280, "rating": 5.0, "text": "We’ve been coming here for 9 or 10 years now. I love the service and the atmosphere. Everyone welcomes you with a warm smile and greeting. Dr. Teddar, listens to your concerns and will give you a thorough examination. Satsuma Family Dental is definitely the best.", "pics": null, "resp": null, "gmap_id": "0x889a56499d21ed5d:0xedeaea6c3fd7984c"}
{"user_id": "106529587043993223577", "name": "Aemanda Landry", "time": 1594138674981, "rating": 5.0, "text": "First I would like to say it's awesome Google notified me this is a women led office. All the staff are females and that always eases me more. Second the issue was with my son. He was 6 and had not one cavity up until now. The whole staff are wonderful and really helped him relax the multiple times we had to come and then finally to have his tooth pulled. They walked him through the whole process and eazed all the anxiety my little one had. If I could give the staff more than 5 stars I would. They worked very fast and effective. The staff maintains a very clean environment and a very welcoming environment. I really applaud these ladies for the standard they have set during this epidemic and helping my family feel better about a scary procedure.", "pics": null, "resp": null, "gmap_id": "0x889a56499d21ed5d:0xedeaea6c3fd7984c"}
{"user_id": "112871547679026231734", "name": "Alex Peterson", "time": 1607737330245, "rating": 5.0, "text": "Never thought i would look forward to going to the dentist office. This is the best i have encountered in 30 years.", "pics": null, "resp": null, "gmap_id": "0x889a56499d21ed5d:0xedeaea6c3fd7984c"}
{"user_id": "112701928408622365545", "name": "Murray Murphy", "time": 1602800247376, "rating": 5.0, "text": "Highly recommend!   Friendly, very professional and efficient Staff .", "pics": null, "resp": null, "gmap_id": "0x889a56499d21ed5d:0xedeaea6c3fd7984c"}
{"user_id": "115833908797707125833", "name": "Sandy Smith", "time": 1601461099160, "rating": 5.0, "text": "Dr Tedder’s office is the best I have found for children’s dentistry. I started going to her in 2003 with my first granddaughter. I am now going to her with my second grandson although I’m 35 miles away.\n\nAlthough COVID-19 has changed some things, the care starting at the reception area and continuing through checkout can’t be beat. They are so intuned to a child’s needs it instantly puts them at ease. Prior to COVID they would have several assistants working with your child. They talk to them massage their arms and legs while getting cleanings and fillings. Just beautiful 🥰\n\nThey make it a great experience for you and your child or grandchild. They leave happy and unafraid of coming back.", "pics": null, "resp": null, "gmap_id": "0x889a56499d21ed5d:0xedeaea6c3fd7984c"}
{"user_id": "109222781067991891962", "name": "Rocquell Besteda", "time": 1505317404883, "rating": 5.0, "text": "The best dentist office I've ever been to! The staff is awesome alone with Mrs Tedder! They make u feel like your at home lol!! I've been with them over 3yrs and they haven't changed a bit!!", "pics": null, "resp": null, "gmap_id": "0x889a56499d21ed5d:0xedeaea6c3fd7984c"}
{"user_id": "103906118618490641180", "name": "Van Stewart", "time": 1624933095707, "rating": 5.0, "text": "Simply awesome dentist.  Dr. Tedder and all of her staff are friendly and professional.  I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x889a56499d21ed5d:0xedeaea6c3fd7984c"}
{"user_id": "116008043526629583726", "name": "Tiffany Harrison", "time": 1532111944665, "rating": 5.0, "text": "These ladies from the front desk to the back including Dr. Tedder were AMAZING!!!! Both my boys had a really bad experience with another dentist, and didnt want to go back. I called around to several dentist office to try making an appointment for both my boys and Dr. Tedder was the only one that i could get into see. And I am so glad she was. My boys were happy with their visit too. I wanted to find a dentist closer to home anyway, so it all worked out!  I am so happy I took them to see Dr. Tedder and her amazing staff!! Thank you all for this great experience!!!!", "pics": null, "resp": null, "gmap_id": "0x889a56499d21ed5d:0xedeaea6c3fd7984c"}
{"user_id": "104422287783742660976", "name": "Darlene Houk", "time": 1486516269187, "rating": 5.0, "text": "Everyone here is very polite, when I was trying to find out their information they were patient and very much informative on all the information they gave me.", "pics": null, "resp": null, "gmap_id": "0x889a56499d21ed5d:0xedeaea6c3fd7984c"}
{"user_id": "113672182840137390264", "name": "Bobby Wheeler", "time": 1616870367680, "rating": 5.0, "text": "From the front desk to the exam room, very professional doctor and staff. Have had two root canals done by Dr. Roth. He is gentle yet thorough with his work. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888c2a44c033ab43:0x9478e7957bf51343"}
{"user_id": "112411779423251284908", "name": "radarice2", "time": 1600303531584, "rating": 5.0, "text": "I have had three root canal procedures with Dr Roth. The last one in January 2020. In all three, I found Dr Roth and his staff to be the most caring and efficient practitioners of a complex profession. Years ago, a dental surgeon friend once told me that if ever I needed a root canal done, find a dentist that is really good and has done a lot of these procedures. Dr Roth qualifies in each case. I also partook of his Nitrous Oxide (laughing gas) machine which made the procedure much more comfortable. I highly recommend Dr Roth.", "pics": null, "resp": null, "gmap_id": "0x888c2a44c033ab43:0x9478e7957bf51343"}
{"user_id": "115093207896882424877", "name": "Charles Lewis", "time": 1605716842939, "rating": 5.0, "text": "I love Dr. Todd.. Words don’t do justice!", "pics": null, "resp": null, "gmap_id": "0x888c2a44c033ab43:0x9478e7957bf51343"}
{"user_id": "100756000659545759855", "name": "Mike Waites", "time": 1534779127628, "rating": 5.0, "text": "I was a patient here today. Probably the best experience in a long while. If your like me I alway get tense at and dentist etc. don’t worry. The staff here was awesome! They put me at easy, no waiting, and Doctor Todd Roth took his time and explained the procedure in depth. He is a true professional. I know where to go in the future!", "pics": null, "resp": null, "gmap_id": "0x888c2a44c033ab43:0x9478e7957bf51343"}
{"user_id": "116618531387321278948", "name": "Coach Washington", "time": 1526646794590, "rating": 5.0, "text": "It was great! That was my response when Dr. Roth asked how the root canal went. The staff, Carmen, Shiloh and Kristen were very warm and helpful. Dr. Roth was professional, experienced and caring. I had no pain during the procedure and I didn't have any days afterwards. I definitely recommend Dr. Roth for anyone needing a root canal!", "pics": null, "resp": null, "gmap_id": "0x888c2a44c033ab43:0x9478e7957bf51343"}
{"user_id": "108515799844939707734", "name": "A F", "time": 1557421406438, "rating": 1.0, "text": "I only went for an evaluation. Dr Roth was friendly and honest. The receptionist got so upset that I didn’t have my insurance information and started giving me an attitude. She really was a jerk. I paid the evaluation fee and never argued, but she just completely turned it into a terrible visit.  I have paid out of pocket and higher prices for friendly services.  I will not go back to that office if my insurer pays 100%.\nA good face to your business is huge!\nHe needs to hire better help.", "pics": null, "resp": null, "gmap_id": "0x888c2a44c033ab43:0x9478e7957bf51343"}
{"user_id": "105464823127246205415", "name": "Cheryl Phillips", "time": 1495763669141, "rating": 5.0, "text": "I had best experience! I feel great just hours after my root canal. I have TMJ and the procedure was done in a manner that was painless and time efficient. I would definitely recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x888c2a44c033ab43:0x9478e7957bf51343"}
{"user_id": "110537032280104774769", "name": "Tymira McCall Bell", "time": 1534810051808, "rating": 1.0, "text": "If I could have given him a negative zero I would have. Carmen is awesome. His assistant that came in was just as rude as he was. I would never recommend anyone to him. I was sent to him by my orthodontist and there is no way I would ever go back to him or allow him to do any work for me. You never know what people are going through Todd try to brighten others day Instead of being rude and disrespectful to your patients.", "pics": null, "resp": null, "gmap_id": "0x888c2a44c033ab43:0x9478e7957bf51343"}
{"user_id": "105019948980541272561", "name": "Brooke T", "time": 1626973162018, "rating": 3.0, "text": "Dr Hwang did a great job on my tooth but if you have any type of anxiety I would not recommend this office. I made sure that they offered nitrous before I made my appointment and marked that I wanted it on my paperwork. I then told them once seated that I wanted it. Dr Hwang told me that I didn’t need it and that he would be quick. One hour later he was done.", "pics": null, "resp": null, "gmap_id": "0x888ced2fbe4dd621:0xc06d45527056c3f9"}
{"user_id": "100937393846436200742", "name": "Bethoc Dunwitty", "time": 1616087464267, "rating": 5.0, "text": "I can't say enough wonderful things about this practice!   I was seen quickly, the hygenists were very attentive and took their time to listen carefully and do a thorough evaluation.   I was here to do a root canal.  It's not the most pleasant procedure in general, but Dr. James was considerate during the shots administered and allowed me time to adjust to the discomfort.  I'm so happy to say that I was in and out quickly and am in NO PAIN today.  Thanks so much for a great experience and wonderful professionalism.", "pics": null, "resp": null, "gmap_id": "0x888ced2fbe4dd621:0xc06d45527056c3f9"}
{"user_id": "100362744451927187833", "name": "Drew Davis", "time": 1599057914542, "rating": 5.0, "text": "Dr. Hannahan and his staff was a life saver to me.  I had developed a infected tooth and was having severe pain 24/7. They performed a root canal Monday and I don't think you could have asked for a better outcome. The procedure was painless and they kept me comfortable the entire time. Each day is getting better (soreness from infected tissue around tooth) and best of all... no pain! I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888ced2fbe4dd621:0xc06d45527056c3f9"}
{"user_id": "110119159216049209028", "name": "Julia King", "time": 1605644021891, "rating": 5.0, "text": "The staff and Dr. Hannahan were very kind and helpful.  Dr. Hannahan made sure that I was in no pain and very thoughtful the entire time of the root canal.  Would use again!", "pics": null, "resp": null, "gmap_id": "0x888ced2fbe4dd621:0xc06d45527056c3f9"}
{"user_id": "106265069847651999573", "name": "Hal Walker", "time": 1592864311153, "rating": 5.0, "text": "The Dr and his staff were great.  First ever root canal and it was probably the easiest dental work received to date.  Dr took the time to explain everything and was very kind and professional.", "pics": null, "resp": null, "gmap_id": "0x888ced2fbe4dd621:0xc06d45527056c3f9"}
{"user_id": "100630670992918522614", "name": "Roberto Racheal Martinez", "time": 1563404793649, "rating": 5.0, "text": "Very nice. It was quick with minimal pain. The doctor even called to check on me a few hours after I left. He honestly knows how to do his job and I hope he knows how much I appreciate him taking it easy on me! 😬", "pics": null, "resp": null, "gmap_id": "0x888ced2fbe4dd621:0xc06d45527056c3f9"}
{"user_id": "117686484856124707589", "name": "Adam Baker", "time": 1568750059661, "rating": 5.0, "text": "Dr. Hannahan did an excellent job of saving my teeth! I have terrible anxiety when it comes to dental surgery and was quite frightened prior to getting two root canals today.  Once I arrived the staff and doctor did an excellent job of calming me down.  The procedure itself was painless.  I was thoroughly numbed (so I felt no pain AT ALL) and utilized the nitrous to ensure I remained calm.  The surgery went well - I was in and out in no time!  I highly recommend Dr. Hannahan should you need to see an endodontist.  He is highly skilled and very courteous!", "pics": null, "resp": null, "gmap_id": "0x888ced2fbe4dd621:0xc06d45527056c3f9"}
{"user_id": "105853249066889574388", "name": "Emily Jordan", "time": 1583336468714, "rating": 5.0, "text": "Very professional and friendly staff.  I had a root canal that was as  close to painless as you can get . Dr. Hannahan kept making sure I was okay which put me at ease .", "pics": null, "resp": null, "gmap_id": "0x888ced2fbe4dd621:0xc06d45527056c3f9"}
{"user_id": "102656980179971192491", "name": "Carolyn Haynes", "time": 1509942285212, "rating": 1.0, "text": "I went to Cumberland back in 2015 to get fillings and a root canal done. Long story short, I have paid three times to get the same filling re-done and now my crown has came out which will result in me paying more money at another dentist office. I agree with others, they seem very rushed at everything they do, but I can’t afford for them to keep messing up costing me money. Never again will I go back, good luck to those who do and kudos to those who have had a better experience.", "pics": null, "resp": null, "gmap_id": "0x888bb138988eebc9:0xcaed53487a9501c7"}
{"user_id": "107440117875640056479", "name": "Flenardo Taylor", "time": 1513695622652, "rating": 3.0, "text": "If they would take pride in their customers like their Christmas decoration. People will love them.  I read the reviews and I have to agree. The front staff wasn't so friendly. Only came for an exam. The dentist was cool.", "pics": null, "resp": null, "gmap_id": "0x888bb138988eebc9:0xcaed53487a9501c7"}
{"user_id": "104101127377980290732", "name": "Stephen McGatha", "time": 1488392847061, "rating": 4.0, "text": "Been going for over a year now. They seem to genuinely offer good dental services. Fairly good at keeping dental appointments.", "pics": null, "resp": null, "gmap_id": "0x888bb138988eebc9:0xcaed53487a9501c7"}
{"user_id": "108049916626451217944", "name": "April Jordan", "time": 1526914719298, "rating": 1.0, "text": "The worst place I've ever been.. Went to get 3 fillings put in and I was in so much pain for several days. The dentist never said a word to me when I went to get the fillings not even hello... I do not recommend this place to anyone. When I went back due to so much pain I found out he put the filling in too deep and hit a nerve now I have to get the tooth pulled or a root canal... SMH.. The worst place", "pics": null, "resp": null, "gmap_id": "0x888bb138988eebc9:0xcaed53487a9501c7"}
{"user_id": "100576670023078343553", "name": "Melissa Simmons", "time": 1500326069807, "rating": 1.0, "text": "I went in last Saturday to get 4 wisdom tooth removed when I got back in the room for them to proceed to do the procedure I feel it was a rush job and they was just ready to go home dr. Kelly had no bedside manners in my opinion she was just ready to clock out to me I feel as if she was trying to talk me out of it after I paid cash money with no insurance to get it done after about four to five days at home I noticed the back of my teeth had a funny taste with something coming out of them I put a napkin in my mouth to find that it was yellow stuff coming out of it I immediately called the office on a Saturday during business hours no one ever picked up the phone after I got off work I proceeded to call back that night in the answering service picked up and I told her that someone needed to get in contact with me because it was an emergency and what the situation was this was Sunday it is now 4:10 p.m. Monday and no one has still contacted me I went to the emergency room on Sunday night and they told me the antibiotic that I got with the procedure that I had I should not have that antibiotic they put me on more antibiotics of which I had to pay for my ER visit but long story short I wouldn't recommend taking a dog to this place with no one contact you about an emergency that is a red flag!!!!!", "pics": null, "resp": null, "gmap_id": "0x888bb138988eebc9:0xcaed53487a9501c7"}
{"user_id": "106339072460487444633", "name": "Robert Caldwell", "time": 1498078363795, "rating": 5.0, "text": "Very friendly staff,. professional I will recommend to others.", "pics": null, "resp": null, "gmap_id": "0x888bb138988eebc9:0xcaed53487a9501c7"}
{"user_id": "105113740764504954211", "name": "S", "time": 1511284935458, "rating": 1.0, "text": "Do not go to them, they only care for money and the whole staff is snooty. Have never been to such a rude, snobby, uncaring set of people.", "pics": null, "resp": null, "gmap_id": "0x888bb138988eebc9:0xcaed53487a9501c7"}
{"user_id": "103157596890660041917", "name": "Synthia Johnson", "time": 1472786172164, "rating": 1.0, "text": "Horrible...Terrible Dr's Bedside mannerisms...Won't go bck here......................", "pics": null, "resp": null, "gmap_id": "0x888bb138988eebc9:0xcaed53487a9501c7"}
{"user_id": "103615048036032191525", "name": "Thomas Dorer", "time": 1624390680351, "rating": 5.0, "text": "I have been a patient of Dr. Dillard’s for over 20 years. He takes time to explain what needs to be addressed. The staff are friendly and engaging. I love the office. Like all dentists  though he still asked questions with his hands in my mouth.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "111833750887776616161", "name": "Rachel Swain", "time": 1624677146367, "rating": 5.0, "text": "There is NO better dentist, nor dentist staff, that is better than Dr. Dillard and his staff!! Like most, I’ve never been one to ‘get excited’ about the dentist, but now I am LEGITIMATELY excited and looking forward to seeing the staff and Dr. Dillard. They are so down to earth and personable, and there is no other dentist I’ll EVER visit in the greater Birmingham area :-)", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "109679275356528677507", "name": "Vicki Boswell", "time": 1618954448760, "rating": 5.0, "text": "I’m a new patient to Dr. Dillard, but feel like I have been coming here a long time.  Dr. Dillard and his entire staff make you feel at home and always make sure you are “ok”.  They are all very kind and make the entire experience enjoyable.  They are a faith based practice and their light always shines bright.\n\nI have been to a lot of dentists in my lifetime and they are at the top of my list !!!\n\nI highly recommend them !", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "104338521051526520593", "name": "Wendal Burks", "time": 1619187687888, "rating": 5.0, "text": "I enjoy talking with Mrs Ryan just in the two visits I had at the office it seems as if we have known each other longer. She is very good dental hygienist. I trust that they know what is best for my dental needs", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "115333227771387682942", "name": "Tim Scott", "time": 1617811969287, "rating": 5.0, "text": "Our family has been long term patients of Dr. Dillard and we can't say enough good things about the entire staff!  They're always up to date on new techniques and are very careful to make your visit as pain free as possible.  We wouldn't go anywhere else and we highly recommend Dr. Dillard!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "103142139290373958240", "name": "Megan Scarborough", "time": 1614205975963, "rating": 5.0, "text": "Lisa Tucker is the most amazing person in the world! I could not imagine going to a dentist that did not employ someone like Lisa.\n\nAlso, everyone there is amazing too. They make you feel like you're at home which is hard to do at a dentist's office. I have recommended them multiple times and will continue to do so.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "110438592216069517419", "name": "Kourtney Robinson", "time": 1620263697105, "rating": 5.0, "text": "Great experience! More than patient and gentle with my sensitive teeth, always kind and trying to make sure i’m comfortable.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "110375601533405262241", "name": "Brandi Newman", "time": 1605100906285, "rating": 5.0, "text": "From start to finish this dental office was top notch!  The front staff had smiles on their faces when you walk in.  Then your hygienist comes out to greet you, mine being Shelley.  She sits down in front of you making you feel like you were her family and I love that because it makes you feel as though they truly do care!  Then of course on to the next part of the dentist, WHICH I HATE” Shelley made very pleasant!\nAfter all that the bad news😩!  I have MS so my teeth have a lot of issues and Dr. Dillard was so caring and very sweet and was going to work on a plan to help my teeth!  Great experience 💙😊😊😊", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "116334787443245889972", "name": "TwoSeater Reaper", "time": 1613059165275, "rating": 5.0, "text": "Awesome staff, and they are professional! Super nice and everyone greets you with a smile! Wouldn't go anywhere else in Bham area for any kind of dental work!!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "103291353456050808988", "name": "Samantha Peppers", "time": 1602556042348, "rating": 5.0, "text": "Love the people here! Always kind and professional\nI am an actual patient here, not just some troll that gives bad reviews because I don’t like their political sign in the yard! 🙄 I guess I care more about having nice teeth than who Dr. Dillard votes for! And I do have nice teeth, because Shelly takes great care of me!", "pics": null, "resp": {"time": 1602608050605, "text": "Thank you so much for your courage and honesty"}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "115608261587639539029", "name": "Chirihane Ouaoua", "time": 1609871443706, "rating": 5.0, "text": "Love seeing Dr Dillard and his staff. Tina cleans ny teeth very well. Dr Dillard does a phenomenal job about keeping my teeth healthy. Each time I go they have some kind of technology improvement with the tools they're using for patients, which means they're on top of their game in the dentistry field.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "113054239015417292562", "name": "Clayton Peppers", "time": 1601658826311, "rating": 5.0, "text": "A friend recommended Dr Dillard to me a few years ago and he, and his top-notch dental team, have been my go-to ever since.  They handle all of my dental work with a warm attitudes and a friendly atmosphere.  If you don’t have a regular dentist, or you’re looking for a new one, give them a try - you’ll be happy you did......and if not, at least your teeth be really clean.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "103127213370050121068", "name": "Vada Lasa", "time": 1616522213851, "rating": 5.0, "text": "Dr. Keith is very good at what he does, my teeth haven’t been cleaned as well as he cleans.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "118324307995375170348", "name": "Megan Patterson", "time": 1592609374596, "rating": 5.0, "text": "Dr Dillard and his team have always provided the BEST in dental care. Tina and Shelly are amazing! Well, they are all amazing! From the front desk ladies to the techs that jump in to help out when needed, they really know how to work as a team. They are honest, caring, and always ask about concerns I may have. Always on the forefront of best practice, Dr Dillard is a wealth of knowledge! If I could give 10 stars I would! Love this place!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "113253970518772831259", "name": "Roshinau Houston", "time": 1616999486922, "rating": 5.0, "text": "Professional, close to home, love everyone's vibe and energy, super friendly and fun atmosphere.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "103219973461957150502", "name": "Teresa Thompson", "time": 1607633208425, "rating": 5.0, "text": "Dr. Dillard's expertise is unbelievable. His staff consists of seasoned veterans who genuinely care about their patients. Best dental practice I've ever experienced.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "114776524126948717714", "name": "Brandi cummins", "time": 1617901794692, "rating": 5.0, "text": "All the staff were very friendly & made me feel very comfortable!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "103911788350559298965", "name": "Terry Baker", "time": 1590001736701, "rating": 5.0, "text": "I love Dr Dillard and everyone that works there is the best. Shelley has been cleaning my teeth for 20 yrs were else are you going to find that. Dr Dillard is the best at what he does. Mad skills seriously, cutting edge technology. His office has a relaxed peaceful atmosphere you won’t ever feel the shot no kidding. If your teeth mean something to you than this is the place for you.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "108238856130868291403", "name": "Beth Seibert", "time": 1598028987292, "rating": 5.0, "text": "Dr. Keith Dillard is the BEST dentist ever!!! He has an amazing staff who work together so well and who truly care about their patients. Their knowledge is superb along with state-of-the-art equipment/technology. They take incredible measures to ensure your comfort!", "pics": null, "resp": {"time": 1598123591697, "text": "Thanks Beth, so kind of you"}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "104610787916087310471", "name": "Kathy Arthur", "time": 1621194839696, "rating": 5.0, "text": "Epitome of professionalisam!!!\nReferred by Deborah Stephens, long time client.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "104405130022878999162", "name": "Martha Grubb", "time": 1595362465064, "rating": 5.0, "text": "Everyone in Dr. Dillard’s office is pleasant and helpful. As for Dr. Dillard, he is absolutely the best dentist I have ever used. I went to him many years ago when I lived in the Birmingham area. I moved to Georgia in 2001 and I never found another dentist that I liked or trusted. So now that I live in Montgomery I drive about 80 miles one way to see him because he is the best.", "pics": null, "resp": {"time": 1595471883887, "text": "Thanks Martha so glad you are back"}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "111675993310086337975", "name": "Tom Cattell", "time": 1620231552932, "rating": 5.0, "text": "Awesome visit and awesome results. Thanks!!!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "104541024571514182731", "name": "Cory Seidl", "time": 1612208308945, "rating": 5.0, "text": "Rock solid dental work. Dr. Dillard and the girls are the best in the business!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "118073034353886370597", "name": "Mark Aultman", "time": 1604434925680, "rating": 5.0, "text": "Dr. Dillard and his team always do a great job.  Best dentist I have ever been to!  Shelly is an outstanding hygienist!!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "109126306537829022110", "name": "Brittany Pruitt", "time": 1603476987013, "rating": 5.0, "text": "Amazing staff. They were kind and knowledgeable. I would recommend them for any of your dental work needs.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "110036909287220318005", "name": "Kayla Marsh", "time": 1596128857674, "rating": 5.0, "text": "If you live in or around Birmingham and you aren’t going to Dr. Dillard’s office, you are missing out!! The staff is so friendly and Dr. Dillard takes his time with every patient to make sure they are 100% satisfied. I just took my 3 year old daughter for the first time and she was so nervous, but we left with big smiles and a prize from the treasure box! Now her little sister is excited for her turn at the dentist. Couldn’t recommend this place more!!!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "116484793733224877317", "name": "Pam McGraw", "time": 1589418060116, "rating": 5.0, "text": "I called with an emergency situation, needing to see Dr. Dillard as soon as possible.  Lisa made calls and moved appointments around to get me in as soon as possible.  As always, the entire staff were welcoming and accommodating.  They never fail to make me feel like me and my teeth are very important to them.  I just love them!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "101614703920431825027", "name": "Natalie Roberts", "time": 1591391811827, "rating": 5.0, "text": "Amazing caring staff and doctor! Best place for all of your dental needs! Dr. Dillard and everyone in there is so caring and so sweet and will go above and beyond!  Love love love them all ❤️", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "117965832130295084206", "name": "Elizabeth Hester", "time": 1604946260346, "rating": 5.0, "text": "Great experience, the doctor is amazing I've been a few places but this one is the one to go to", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "106678481611654002009", "name": "Fred Cross", "time": 1594860719036, "rating": 5.0, "text": "Great Dentist,  would never consider anyone else.  Dr. Dillard and his assistants are as good as it gets!  Hope never retires at least till my expiration  date\nGod Bless you  Dr. Dillard!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "109079980992795601518", "name": "Luke Breasseal", "time": 1598896956089, "rating": 5.0, "text": "Top flight professionals 👍 it’s like a whole new world now that my teeth no longer ache 😁🦷 thank you Dr. Dillard and associates!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "115933949422598280313", "name": "C Neeley", "time": 1598045220074, "rating": 5.0, "text": "Excellent team and care provided, they are always looking for ways to improve patient care and save you health and money in the future, their focus on prevention is extremely valuable.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "114760829825655957206", "name": "Bree Emenhiser", "time": 1603305893735, "rating": 5.0, "text": "The staff is amazing!! I love going to the dentist now!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "102998123191175888399", "name": "Cel Gibson", "time": 1600277265077, "rating": 5.0, "text": "Very nice dental place . Workers are very nice . Been here many years .", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "114017015914889607731", "name": "Jim Kemp", "time": 1590708005982, "rating": 5.0, "text": "Typically just saying Dentist causes me anxiety, but they made my first visit very comfortable. Shelley explained everything very clearly and took extra effort to be sure I was not experiencing any discomfort during my cleaning. Next visit should be easier on the stress level.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "109323015263761737636", "name": "Naomi Hatcher", "time": 1561067500148, "rating": 5.0, "text": "I always look forward to my visits at Dr Dillard's office! His entire staff is very cheerful and welcoming. I recently moved to Alabama and needed to find a new dentist. I chose Dr Dillard because he uses the most modern equipment for restorations, and offers a great variety of services, including cosmetic and orthodontic services. Dr Dillard does amazing work also! He is very gentle and meticulous with all his procedures. Just stop in and see all the great before and after photos he has in office, you'll leave feeling better than when you came in!", "pics": null, "resp": {"time": 1557869718970, "text": "Thanks Naomi! We always love seeing you.  We especially enjoy our tooth cacti, all of our patients love them!"}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "105370447590913358858", "name": "Sonja Oliver", "time": 1610599719895, "rating": 5.0, "text": "Going to the Dentist is like going to see your family every 6 months. They make you feel like you’re part of their family. We love Doctor Dillard and his staff.\n\nEvery time my kids take pictures I get comments about how pretty their teeth looks.  Thank you Dr Dillard for a great experience for me and my family.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "115666288455952602062", "name": "Anna Sparks", "time": 1606163225702, "rating": 5.0, "text": "I love my dentist and his staff. It’s a clean, friendly environment and they are some of the best at what they do. I will not go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "107616511158292570790", "name": "Michael Glaze", "time": 1586446858837, "rating": 5.0, "text": "We love Dr. Dillard and his entire staff! This is an amazing group of christian people and they provide wonderful care. My family has been coming to Dr. Dillard for over sixteen years. We aren't going anywhere else.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "110067429594031637667", "name": "Peggy Strauss", "time": 1607463832368, "rating": 5.0, "text": "Dr. Dillard and his staff are very professional, kind, do excellent work, and will go over and beyond the call of duty to be there when you need them. I had a dental emergency when out of town, called them for advice, they gave me the name and number of a dentist out of town to help me temporarily, then, met me at their clinic as soon as I returned to Birmingham to repair my tooth permanently.\nAnother time when I had a dental emergency, Dr. Dillard was out of town. What did he do? He actually came back from his trip early to meet me at his clinic after hours on a day they were closed!  He brought his wife to be his dental assistant and he repaired my tooth in order for me not to miss work the next morning!  What else can I say about this awesome doctor and his amazing staff!?! They are the best! I highly recommend them!!!", "pics": null, "resp": {"time": 1557870639282, "text": "THANK YOU!"}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "115716710210998884192", "name": "SJ", "time": 1575502972127, "rating": 5.0, "text": "He is the best dentist I have ever gone to.  My son & his wife also use him and speak very highly of him. If you want a great dentist Dr. Dillard is it. Fred Cross", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "116577803773068785552", "name": "Jade Mcwhorter", "time": 1578901134324, "rating": 5.0, "text": "The staff is amazing with both me and my son. I will never go anywhere else. I absolutely love this dentist!!!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "103826367161705373319", "name": "Rosalie Hagan", "time": 1589916072427, "rating": 5.0, "text": "Everyone there is very helpful and welcoming. I always have a good experience here.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "102309511909508219363", "name": "Rxseirixlle Geabov", "time": 1588193137801, "rating": 5.0, "text": "I had the best experience with Dr. Dillard’s he office staff was so friendly and accommodating.  I highly recommend", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "115630286658680734991", "name": "Pearls of Eden", "time": 1547230804252, "rating": 5.0, "text": "I received OUTSTANDING care from Dr Dillard and Lisa during my recent visit and would highly recommend his services to anyone looking for superior dental care provided with patience, gentle care, and genuine concern for patient comfort and satisfaction. Scheduling is a breeze. The new patient process is seamless. They are well staffed and I always manage to get an appointment when it is convenient for me. Not to mention that their staff is amazing and very friendly and genuinely interested in your well being. I would highly recommend them to friends and family!", "pics": null, "resp": {"time": 1547659986973, "text": "Thanks Marilyn! We are ecstatic that you are now a patient! We can't wait to see your beautiful smiling face and sassy stylish self, back in our office."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "116832072537433764974", "name": "James Kuhlman", "time": 1563828865088, "rating": 5.0, "text": "I have been going to Dr. Dillard for many years. He has replaced several of my old crowns. He was able to make my crowns there in his office the same day and put my permanent crowns in. I remember having crowns that it took  2 weeks to get. Dr. Dillard also makes any dental work he does painless. I would recommend Dr. Dillard to anyone looking for a dentist in Pelham, Helena , Alabaster and Hoover.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "109101634294888153585", "name": "Arkita James", "time": 1563071422127, "rating": 5.0, "text": "I simply adore the team at Dr Keith Dillard's office. They are all professional courteous and kind. Each of the team members are knowledgeable in their craft and every time  I visit I feel like a member of the family. If you want Dentistry at its finest, I highly recommend dr. Keith Dillard and his team!!!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "109301350007670666148", "name": "Efmu Co.", "time": 1550683333043, "rating": 5.0, "text": "I have been visiting these folks for over 20 years now and I am always amazed at their skill and professionalism.  They have always treated my family with tender care and are so great at making sure you experience no pain!  I highly recommend them.", "pics": null, "resp": {"time": 1557870274952, "text": "Thank you Sherry. We always love seeing you.  We have treasured your friendship throughout the years."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "104223089978171799501", "name": "Curtis Woods", "time": 1552503748670, "rating": 5.0, "text": "Dr. Dillard and his staff are extremely helpful and caring. Been using them for quite a few years and they have handled this dentophobic with care and compassion. They even tolerate my dry sense of humor! You can't go wrong with this team.", "pics": null, "resp": {"time": 1557869831302, "text": "What dry sense of humor?! HA Thank you for entrusting us with your care, your review means a lot."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "102388647991266726506", "name": "B & K G", "time": 1552500886666, "rating": 5.0, "text": "Dr Dillard and his entire staff are some of the most caring and supportive individuals I know.  My family has used them for years and we have nothing but positive experiences.  They will give you options and they understand about fear of dentist and make sure you are absolutely comfortable!", "pics": null, "resp": {"time": 1557869944671, "text": "Thank you! Our office atmosphere would not be possible without fun families like you all! It's always a pleasure when we see you and your family on the schedule."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "116266207223060076165", "name": "Sara Handsel", "time": 1597683953322, "rating": 5.0, "text": "Love the staff and Dr. Dillard!! It’s a great Dentist office!!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "109128845960822185883", "name": "Anna Reeves", "time": 1544553919365, "rating": 5.0, "text": "Always phenomenal!!! Dr. Dillard and all his staff are amazing people. I work in health care but his passion and standards stand out and he is top notch perfectionist! I had dental emergency yesterday and they worked me in immediately and saved the day. Absolutely love this dentist and staff!!!! They have changed my life and made me love my smile", "pics": null, "resp": {"time": 1547660342954, "text": "WOW! Thank you Anna.  We are happy that you came to us.  You're beautiful inside and out."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "103400432982899628467", "name": "Donna Kellis", "time": 1547581248746, "rating": 5.0, "text": "it is always a pleasant experience when we go to the dentist at Dr. Dillard‘s. His staff  are welcoming and inviting and Dr. Keith Is an excellent dentist. My entire family has been seeing them since my children were small I highly recommend them.", "pics": null, "resp": {"time": 1547660085475, "text": "Thank you Donna! You know you are like family to us.  Thank you for your loyalty all of these years. We always enjoy seeing you and all of your family and friends that you and David have referred to us throughout the years."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "107553574053345613768", "name": "Dorothy Sarvaunt", "time": 1555676075130, "rating": 5.0, "text": "I must say that Dr. K Dillard and his staff are the most caring people. I would not want to go anywhere else for any of my oral care needs. There facility is comfortable and clean. I even got to watch my own personal tv while have my teeth cleaned! Love them!", "pics": null, "resp": {"time": 1557870381555, "text": "We are so happy to hear that you utilized our television amenity. We are glad it helped you feel comfortable.  Thank you for your kind words."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "118421497533115203977", "name": "Brenda Clarke", "time": 1561147676758, "rating": 5.0, "text": "Dr. Dillard and his staff are the best! They’re courteous and professional. Actually, they’re my dental family. My daughter and both of her kids are treated by Dr. Dillard. I’ve had cleanings, crowns, bridgework, he even replaced one of my veneers after my last dentist moved away. The best part is that I’ve never had any terrible pain! Yay!!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "117645908642619702119", "name": "Sheila Cleckler", "time": 1563298650281, "rating": 5.0, "text": "Had to have a tooth crowned. Dr. Dillard and his staff made sure i was comfortable and did not feel any pain. My family has used Dr Dillard for 36 years. He is the best!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "108335605240257658378", "name": "Timothy Thrasher", "time": 1569258345037, "rating": 5.0, "text": "Dr.Dillard and his team are awesome they take care of my whole family and do a wonderful job.  Dr Dillard takes the time too go over your treatment plan and make sure you know exactly what the steps for your treatment is.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "108437256341376079555", "name": "Maggie Hicks", "time": 1603915115791, "rating": 5.0, "text": "Hands down best dentist around!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "101981246403032396938", "name": "Daphne B", "time": 1591642783064, "rating": 5.0, "text": "Friendly staff and excellent service. Thank you!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "111037263587921266561", "name": "Lenny Ferguson", "time": 1593021881561, "rating": 4.0, "text": "Overall, very good. Nice conversation, advice, and updates.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "102932855549241617314", "name": "Mittie Brown", "time": 1597178391764, "rating": 5.0, "text": "I’ve gone to Dr. Dillard for years now and decided to try a dentist office closer to my home. I went to two different dentist offices and I quickly realized the difference, Dr. Dillard and his team are the MVP’s of Dentistry they literally can do anything related to your teeth, no one else could compare. They are also a very loving group of people they treat you like family everyone  there knows your name, you know they are personally invested in your care.", "pics": null, "resp": {"time": 1540916625748, "text": "No Mittie, you are the real MVP! Thank you for your kind words.  We sure love seeing you."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "100105994005354769224", "name": "Sue Hogan", "time": 1562761325691, "rating": 5.0, "text": "I have never had a bad experience with Dr. Dillard or any of his exceptional staff.  No pain, no regrets.  My teeth are beautiful, and I must thank Dr. Dillard, Lisa T., Tina, and the entire staff.  I live in Sumiton, but it is well worth the drive to Pelfam to know every single time that they will take very good care of me.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "117318985712340240110", "name": "denise jeffries", "time": 1601572909788, "rating": 5.0, "text": "Dr Dillard and his staff are the best!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "107714836895161314542", "name": "Joe Hogan", "time": 1535584229378, "rating": 5.0, "text": "I have been a patient of theirs for about 15 years and I love 45 miles away. Tina, Shelly, Lisa, Lisa, Ally, and Dr. Keith are the best anywhere. Always up to date with technology and techniques. They really are a family and have made me feel like family for 15 years.", "pics": null, "resp": {"time": 1537539247516, "text": "Thanks Joe we always love to see you."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "111742403622802484621", "name": "Michael Hanscom", "time": 1563443996746, "rating": 5.0, "text": "Needed a second opinion and they fit me in on short notice.  The staff and doctor were top notch.  Would highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "116606763796576655043", "name": "Tyler C", "time": 1556301154242, "rating": 5.0, "text": "Dr. Dillard, Lisa and the whole staff did a fantastic job! I had not been to the dentist in years and needed major work done. They put me at ease and made the whole process painless! I seriously can't recommend them enough", "pics": null, "resp": {"time": 1547660202041, "text": "We are blessed to be able to have recommendations such as yours.  We are pleased that you had a wonderful experience and hope that you never go years without seeing your new dentist!"}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "117166293235308531344", "name": "Debi Jasper", "time": 1607022553484, "rating": 5.0, "text": "Dr. Keith Dillard and his Staff get a 5-Star rating from me. They make going to the dentist a pleasant experience, whether it’s a simple cleaning or complex dental work. They are the Very Best!!", "pics": null, "resp": {"time": 1547658990422, "text": "WOW! Thank you for this wonderful review.  We try our very best everyday and appreciate you as a patient!"}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "117319440563348638552", "name": "Sharon Grimes", "time": 1573595350713, "rating": 5.0, "text": "I had a horrible dentist as a child but very good dentists the rest of my life and that includes Dr. Dillard. He put veneers on my yellow teeth and gave me a wonderful smile that I have had for years. I know other people whose veneers have come off but mine never have. Dr. Dillard and staff have also given me a great deal of dental work in the last 21 years but not one instance of discomfort! They are all such terrific people that I always love going to see them!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "103608334649548584619", "name": "Nancy Santos", "time": 1550084150877, "rating": 5.0, "text": "Best dentist and staff ever. Thank you for being patient with me. This was the best cleaning that I ever had. Can’t wait to come back.", "pics": null, "resp": {"time": 1550697956373, "text": "Thank you Nancy! We enjoyed meeting you and look forward to many years as your dental provider and friend."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "103243145350143510610", "name": "Carl McKay", "time": 1582908211025, "rating": 5.0, "text": "I must admit that I am probably the worst possible patient. Due to traumatic events in my life, my fear of sitting in the chair is off the charts and there’s nothing I can do to stop it. Dr. Dillard and staff went the extra mile to do everything possible to help my situation.\nIf I must go to a Dentist, Dillard is the only one for me.\nThank you Dr. Dillard and staff for putting up with me.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "105576160760763659441", "name": "Chuck Watkins", "time": 1574705220010, "rating": 5.0, "text": "Excellent and friendly. Wouldn't go anywhere else!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "115505849677451874976", "name": "omgitsamber5", "time": 1547751496520, "rating": 5.0, "text": "He is a great Dentist! His team of ladies are wonderful and are very concerned about your pain levels. They offer a comfortable and peaceful atmosphere.", "pics": null, "resp": {"time": 1550697717149, "text": "Thank you Amber, we enjoy having you as a patient!"}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "117751870093186124134", "name": "Barbara Bradley", "time": 1566853019063, "rating": 5.0, "text": "Always timely, very friendly, and strives to never cause any pain with any procedure. My family has been patients for over 30 years.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "113187595834909188949", "name": "Sandra Milstead", "time": 1467829105857, "rating": 5.0, "text": "My experience was exceptional! They have the most caring staff.  I have a long standing fear of the dentist and pain associated with dental procedures.  Dr. Dillard makes every effort to make the experience be as pain free as possible. I always walk out of his office feeling a bit more confident about coming back to the dentist. I'm so glad I have him as my dentist now.  They are the BEST!!!!! Highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "106287529017787709486", "name": "Richard Rushing", "time": 1533147079772, "rating": 5.0, "text": "Great Staff and top notch care!  I know that I'm a tough patient to work with because of my schedule and they have really worked hard to help me get in and out!  Love these folks!", "pics": null, "resp": {"time": 1534884678772, "text": "Thank you Richard! You're not tough at all, we are happy to help any way we can.  Hope this finds you doing well!"}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "106222392397795432081", "name": "Holly Parker", "time": 1552007317179, "rating": 5.0, "text": "This is a great place! I was very nervous and hesitant to go to the dentist after not going for a long time, but from the first visit my fears disappeared. The staff is very friendly and really takes the time to get to know you. They have helped me through every thing I have had to do and gone above and beyond. I would recommend giving them a try if you are looking for a dentist office.", "pics": null, "resp": {"time": 1521551932572, "text": "Holly, we have absolutely enjoyed getting to know you as our patient and friend.  We are all so proud of your diligence with your dental health and always love seeing you smile when you walk in the door."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "106019292651728049624", "name": "Kevin Arvin", "time": 1537474301483, "rating": 5.0, "text": "We’ve been using Dr Dillard for more than 20 years. He has always treated all our family with great sensitivity and the best of care at a great value. No better dentist out there in my opinion!", "pics": null, "resp": {"time": 1537539502395, "text": "Thanks Kevin , It has been great watching your family grow up and have their own family. You are one of the reasons we love what we do."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "117321646729008313560", "name": "Melynda Brown", "time": 1551906208996, "rating": 5.0, "text": "Dr. Dillard & his staff are always friendly & patient with me & my family. They are helping me get my 5 yr old excited about going to the dentist.", "pics": null, "resp": {"time": 1557870110886, "text": "Thanks Melynda! We always love seeing you and your family, especially Kendon, what a cutie!"}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "103847075113318464429", "name": "Christopher Lanter", "time": 1539364856538, "rating": 5.0, "text": "Very friendly and caring staff.  You can watch tv while they clean your teeth or get a massage from the chair your sitting in.  Relaxing environment!  5 stars", "pics": null, "resp": {"time": 1540916799271, "text": "Thanks Chris! We love that you take advantage of all of our relaxing features. Have a great holiday season."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "115329270098652787348", "name": "Greg Herbinger", "time": 1595690796804, "rating": 5.0, "text": "Very professional, courteous, pt oriented.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "113684530079791177237", "name": "Tabitha Goggins", "time": 1539201840976, "rating": 5.0, "text": "Absolutely love Dr Dillard and his entire staff!!! They are all so sweet and friendly and make you feel right at home!! Top of the line Staff and office!! I highly recommend Dr Dillard!!!", "pics": null, "resp": {"time": 1540916830388, "text": "Thank you Tabitha!"}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "110574218250747011507", "name": "Christina Smith", "time": 1549233356147, "rating": 5.0, "text": "A dentist that cares!! The staff is phenomenal! The dentist is not my favorite place to go, but they make the experience so much more relaxing.", "pics": null, "resp": {"time": 1550697780629, "text": "Thank you Christina! We always enjoy seeing you."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "108222289911294574889", "name": "Jeff Solomon", "time": 1533920660431, "rating": 5.0, "text": "Very nice, friendly and personable staff. Dr. Dillard is very helpful and knowledgeable. Overall, this is an amazing practice that makes you look forward to keeping up with dental hygiene.", "pics": null, "resp": {"time": 1534884519970, "text": "Thank you! We always look forward to seeing you and your family."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "102138304078081281169", "name": "Elizabeth Regan", "time": 1528220815419, "rating": 5.0, "text": "Dr. Dillard and his staff are very sweet and make going to the dentist a great experience.  It is the first time in my life I have ever had pain free dental work. I highly recommend Dr. Dillard.", "pics": null, "resp": {"time": 1528406467279, "text": "Thank you Elizabeth! We really enjoyed seeing you and we are glad you had a great experience."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "104080906527485760854", "name": "Lucky Mamf", "time": 1485886782132, "rating": 5.0, "text": "Very friendly professional & talented. Did a great job reconstructing my smile. They literally changed my life. Thank you Dr. DILLARD & STAFF😘😆", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "117962456895431006862", "name": "Tony Smith", "time": 1549545260659, "rating": 5.0, "text": "Very professional but yet with a caring environment this is the only Dentist I would trust my child with! Love this place", "pics": null, "resp": {"time": 1550697866393, "text": "Thanks Tony! We always enjoy seeing you and your family."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "106164141656186991920", "name": "Gary Grimes", "time": 1489612921933, "rating": 5.0, "text": "I can always count on first rate competent dentistry that has to be done only once and lasts.  The work is always done with care and painlessly.  I always look forward to the visits with the fun and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "109268167128203012310", "name": "Barbara Redding", "time": 1602883335055, "rating": 5.0, "text": "My experience with all the people at Dr. Dillard's office, especially Dr. Dillard, has been of the highest quality and the atmosphere makes you feel like you are family!", "pics": null, "resp": {"time": 1550698105412, "text": "Thank you for the review Barbara! We love when patients feel the family atmosphere."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "113999141662429602710", "name": "donna tyner", "time": 1612399124787, "rating": 5.0, "text": "Dr. Dillard and staff are the best of the best!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "110364148761649683948", "name": "Cheri Price", "time": 1544465014491, "rating": 5.0, "text": "I love Dr. Dillard and all of his staff. They are super friendly and make going to the dentist a breeze.", "pics": null, "resp": {"time": 1547660106580, "text": "Thank you Cheri!"}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "113035974083799356135", "name": "Ben Morton", "time": 1559257406112, "rating": 5.0, "text": "The staff was 100% professional!!! I would highly recommend Dr. Dillard to anyone. I was a walk-in patient with a tooth ache and was treated immediately!!!!!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "112329417269757067658", "name": "Annie Holmes", "time": 1564495578948, "rating": 5.0, "text": "Friendly atmosphere and professional service.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "110829642519998098014", "name": "Billy Kizziah", "time": 1589397142618, "rating": 5.0, "text": "Excellent Dentist, Great Staff!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "101044403917708100839", "name": "Juanita Sims", "time": 1400205899789, "rating": 5.0, "text": "I usually avoid dentists at ALL costs!  I've had more than one terrible and painful experience in a dentist's chair.  Dr. Dillard and his professional staff have shown me a new and pain free dental experience that I never would have thought existed, especially when I was having major dental work done!  I'm happy to say I have a new dentist!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "107041016236078629290", "name": "Joyce Carroll", "time": 1459868286626, "rating": 5.0, "text": "Always a loving and kind environment.  Makes me feel like family!  Love them all!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "109521429651112580297", "name": "Cris Speegle", "time": 1519938353719, "rating": 5.0, "text": "The were very accommodating of my tight schedule nd met all my needs.  Great service and staff!", "pics": null, "resp": {"time": 1521551681704, "text": "This is wonderful to hear.  Thank you for taking your time to review our office."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "111981937047365700173", "name": "Rick Lumpkin", "time": 1618509331861, "rating": 5.0, "text": "Good professional experience.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "105925403603505939502", "name": "David&Tesia Sullivan", "time": 1519178697031, "rating": 5.0, "text": "We are so glad we found this dentist! Dr Dillard and his staff are all amazing!", "pics": null, "resp": {"time": 1519838355319, "text": "We love having you all as a part of our dental family! Keep bringing your sweet baby to visit with us.  Those little ones brighten our day."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "107868569955686743475", "name": "Cathy Dobbins", "time": 1528477830690, "rating": 5.0, "text": "Dr. Dillard and his staff are awesome.   Love them!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "100489348939459637227", "name": "Ben Horne", "time": 1519167524852, "rating": 5.0, "text": "My wife, was extremely scared of dentists, but they worked with her and treated her like family! Best staff ever!! Looking forward to going back.", "pics": null, "resp": {"time": 1519838589470, "text": "Awesome! We are thankful that she had a wonderful experience.  We love hearing these victory stories.  It can be difficult to overcome fears of the dentist, but we strive to make our practice a happy pain free family experience.  Thank you for your feedback."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "116284598134243560836", "name": "Zack Kellis", "time": 1341868050254, "rating": 5.0, "text": "Dr. Dillard has been my dentist for 23 years.  As a kid, he was famous amongst my sisters and I for his shots that you never feel.\n\nIn 1989, I broke 4 of my teeth.  Over the years I continue to break off the bondings then veneers doing a variety of stupid things.  Dr. Dillard has always done great, painless work.  He has TVs hanging from the ceiling so you can watch something while you wait as well.\n\nThe staff is great.  I could not reccomend them any higher.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "112412906412230069120", "name": "J. Terry McCombs", "time": 1599523764372, "rating": 5.0, "text": "Best dental services I have ever received.", "pics": null, "resp": {"time": 1519838672571, "text": "Thanks Terry!"}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "103689285430940584622", "name": "Elizabeth Foster", "time": 1543351326239, "rating": 5.0, "text": "Dr Dillard and his staff are the absolute BEST.", "pics": null, "resp": {"time": 1547659011441, "text": "Thank you Elizabeth!"}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "117728945214434435654", "name": "amy baird", "time": 1399520442741, "rating": 5.0, "text": "Dr. Dillard gave me my smile back! .Thank you to his staff. They are the best.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "117840066830672687398", "name": "Anne Orchard", "time": 1352065481282, "rating": 2.0, "text": "This place called me and informed me that Dr. Dillard is now accepting BCBS insurance so I make an appointment to have a few fillings.\nDr. Dillard was NOT the dentist they gave me. I was treated to Dr. DeShazo from MS.\nShe was in a hurry and botched the whole procedure terribly. After the Novocain wore off my bite was uneven. I called and went back the next day and they tried to grind it back to normal. Still, a week later Im in pain and my bite is worse.\nThe recommended Advil.\nAwesome.\nI will not be back. I will find another dentist.", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "103865165749811816484", "name": "denise jeffries", "time": 1579720038344, "rating": 5.0, "text": "Simply the best!", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "115712693419383463197", "name": "Bob Cleveland", "time": 1599171877307, "rating": 5.0, "text": "He has been my dentist for 30 years.  'Nuf said ?", "pics": null, "resp": {"time": 1557870616926, "text": "Thank you, Mr. Cleveland!"}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "107621185671682812973", "name": "Matt Besecker", "time": 1531502180723, "rating": 5.0, "text": "Best dentist and dental hygienists in the area!", "pics": null, "resp": {"time": 1531863320339, "text": "Thanks Matt! We enjoy having you as a patient and greatly appreciate your business."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "106967244503232644620", "name": "Chris Lanter", "time": 1521047538683, "rating": 5.0, "text": "Very fun, friendly,  and outgoing staff that does a great job", "pics": null, "resp": {"time": 1521552680669, "text": "Thank you!"}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "105921154614378531854", "name": "elizabeth haynes", "time": 1548782990156, "rating": 5.0, "text": "Dr. Dillard & all the staff are always wonderful!!", "pics": null, "resp": {"time": 1550697827732, "text": "Thanks Libba!"}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "117380833327458065361", "name": "Ken Suda", "time": 1512588608225, "rating": 5.0, "text": "Pain-free baby!", "pics": null, "resp": {"time": 1519838766728, "text": "WooHoo!!! That's what we like to hear! Thank you for your feedback."}, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "102915950282023384136", "name": "Roy Connell", "time": 1523968231572, "rating": 5.0, "text": "Caring, excellence, and friendly service", "pics": null, "resp": null, "gmap_id": "0x888923b7c6899ed5:0x3294c01713014faa"}
{"user_id": "111671571193231621998", "name": "Winston Jordan", "time": 1622047776290, "rating": 5.0, "text": "I WILL NOT GO ANYWHERE ELSE FOR ANY SERVICE THAT THEY PROVIDE\n\nHaving heard about terrible root canals all my life, when I finally had to have one, they were the first spot available. There was literally no pain whatsoever, in and out and just over 2 hours. I could not anymore highly recommend Dr Adams. He was gentle, careful, explained everything that was happening thoroughly. I appreciate all the time that they take to make sure that you have a good experience.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP-Y3UOs7iJE4WgosGyIKIAn74cvE6wqlieO8As=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "103845138616004666089", "name": "Angela Coates", "time": 1624384908362, "rating": 5.0, "text": "I can't rave enough about Dr. Adam's and staff. The initial contact was with Mrs. Jane, she was very patient with me as I couldn't find insurance card was not rushing and was nice from the start.  Dr. Adam's should be poster child for niecest doctor I have met in a long time. He was informative and made me feel right at home. I hate to have a root canal,  but if need be again no one can perform it but Dr. ADAMS.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "100509436983976402412", "name": "Tara Swanner", "time": 1620913296173, "rating": 5.0, "text": "Dr Adam and team took fantastic care of me! If you’re in need of a root canal you couldn’t be in better hands. They will ensure you’re comfortable, from making the appointment to finishing treatment. Very kind and compassionate team.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "115099871565015520962", "name": "Carmen Anders", "time": 1622592296832, "rating": 5.0, "text": "I am posting this review for my husband. You have to understand how big his dental phobia is. He puts off what he can and when he has to go for a dental procedure he paces the floor, breaks out in a sweat and try’s everything to get out of going.  He came home after his procedure and couldn’t stop talking of how great his experience was. From the time he walked in until he left everyone was welcoming and professional. I am in the dental field and he wants to take me to meet Dr. Adam’s and his team. When my husband can’t stop talking about how painless and great his visit was, well that is a very high recommendation. Thank you!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "108562498526915132089", "name": "Chelsea Cloud Brewton", "time": 1622123013920, "rating": 5.0, "text": "My experience for a consult could not have been better. Dr. Adams was attentive, thorough, calm and answered all of my questions. The staff is all friendly and the office itself is beautifully decorated and calm. WOW!", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "105369679531108024348", "name": "RBA", "time": 1621459741514, "rating": 5.0, "text": "Learning you need a root canal is not the best of news, but going to Advanced Endotontics is a great place for efficient, friendly, and painless treatment. Dr. Adams has a calm and reassuring disposition, a gentle touch, and remarkable skills. You will appreciate the state-of-the-art equipment and the patient-first attitude.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "107266299124617189419", "name": "Beverly Rankin", "time": 1618587347616, "rating": 5.0, "text": "Dr. Adams and his treatment team are OUTSTANDING ! I highly recommend him and his team.  I drive from Montgomery because of his excellent treatment and care.  Very kind, very thorough in explaining my options, answers all my questions.  He is the BEST!!  The entire staff is helpful, considerate, and kind.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "113873321490235452485", "name": "Becky Smith", "time": 1616531481804, "rating": 5.0, "text": "My experience at Advanced Endodontics was as pleasant as a trip to the endodontist could possibly be.  Dr. Adams was very professional, but also very caring.  He explained everything to me thoroughly before my appointment and was patient and gentle throughout my procedure.  I was referred to Advanced Endodontics by my dentist at 8:30 this morning, and by 10:30 I was in the chair beginning my root canal procedure.  The entire staff was very friendly and professional.  I was very grateful to them for being so accommodating to me.  I was in and out in less than 2 hours.  I would definitely highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "106646102052666289949", "name": "Crystal Chiles", "time": 1619732939500, "rating": 5.0, "text": "Dr. Adam’s was amazing as well as his assistant. He explained everything to me before, during, and after the root canal. The front office staff were very nice and professional.  I would not ever consider using another endodontist.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "115582125730310381759", "name": "Shelia", "time": 1620160071791, "rating": 5.0, "text": "Dr. Smith was Awesome❣️❣️❣️  His staff as well❣️I had to have two root canals.  Dr. Smith was very professional & informative.  He was concerned about me as a patient, being comfortable, & appreciated him explaining as he went along. His calm & peaceful demeanor, comforted me as the procedure took place.  I highly recommend Advanced Endodontics P.C.to whomever needing this procedure done. You will love his newest technology in Endodontic treatment!!!  Game Changer!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "102840720245878060987", "name": "Mary Gates Brown", "time": 1619128854656, "rating": 5.0, "text": "Dr Smith is so kind and comforting. I didn’t have to wait at all for my appointment. And I felt zero pain during the root canal. Perfect all around.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "118343151042614769168", "name": "Theresa Hicks", "time": 1617914756432, "rating": 5.0, "text": "Unbelievable! Dr. Adams/Smith got me into oral surgery within hours. The most advanced methods I’ve ever seen/experienced. Dr. Adams talked to me explaining every step. The staff takes care of you the minute you open the door. I can never thank them enough. No pain I’ll never go anywhere else!  THANK YOU!\nTheresa Thompson Hicks", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "111421615984079826315", "name": "Susan Hartin", "time": 1616623242464, "rating": 5.0, "text": "I will never have a root canal done any where else! I have had cleaning that hurt more than this root canal did!!!! I could have slept through it thanks to the block the put between my teeth to rest my jaw so my TMJ didn’t get bad. Easiest dental appointment ever!!!!", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "104738295049713236845", "name": "Tyra Farris", "time": 1618348434217, "rating": 5.0, "text": "Dr Adams was fantastic. The staff were friendly and efficient. I'd never had real dental work before, and I was comfortable and at ease the whole time.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "109294743253215655768", "name": "Pate Thomas", "time": 1616274698579, "rating": 5.0, "text": "I am super impressed with Dr. Jimbo Smith and his office. He has an excellent bedside manner and is very skilled at what he does. Being the wife and daughter of dentists, I highly recommend this practice.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "106081058300584145949", "name": "Stacey Osborn", "time": 1620077087414, "rating": 5.0, "text": "Everyone was very friendly!!! I will definitely go back. Dr Adam’s was the nicest and explained everything he was doing!!!", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "105030456983203000195", "name": "Amanda Przekora", "time": 1619572430513, "rating": 5.0, "text": "Dr. Smith is thought of highly around the dental community. My experience as a patient was above and beyond. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "105558355437380205965", "name": "Tijuana Williams", "time": 1619906742254, "rating": 5.0, "text": "Professional, friendly, knowledgeable. Thank you for creating an environment where my 11-year old felt comfortable.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "115744427346245144176", "name": "Ethan Shaw", "time": 1611603058063, "rating": 5.0, "text": "Amazing Job! Had some work done and the people their were kind and always checking to make sure I was doing alright! The job was done quick, comfortable, and completely painless! Would highly Recommend!", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "117080955951591250471", "name": "Tom Richardson", "time": 1617917099673, "rating": 5.0, "text": "Everyone in this practice is friendly and very helpful. Dr Smith was super and the entire experience was excellent", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "118368829701041946663", "name": "Gary Wolanek", "time": 1611326921540, "rating": 5.0, "text": "I know root canals have a bad reputation, but Dr. Smith and his staff shattered that myth.  I had a tooth that had a temporary crown and was causing pain at night, but now the pain is gone.  The injection was painless, the procedure was painless, and I have had zero post-op pain.  The staff was courteous and professional from the first phone call to checking out at the end of the appointment.  The office is beautiful and the equipment is high tech.  The gentle wave system to clean the canals is the cutting edge technology and produces the cleanest canals possible.  If I need another root canal in the future, I will be calling Dr. Smith and Advanced Endodontics.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "106690987663063399240", "name": "Sonja", "time": 1617307239296, "rating": 5.0, "text": "The Doctor was so sweet, talking me through every step before he actually did it. Very comforting", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "100266520689504261663", "name": "Stacey Wolanek", "time": 1611698523745, "rating": 5.0, "text": "The staff was super kind, caring, and sweet. Dr. Smith was wonderful, professional, and compassionate. It was a very pleasant experience- I even feel asleep!", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "109187807378951497019", "name": "D Haskins", "time": 1617055807339, "rating": 5.0, "text": "Thorough examination and well-explained procedure! Dr. Adams is professional and compassionate.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "105371150801209815149", "name": "Court Deaton", "time": 1610903300079, "rating": 5.0, "text": "My experience with Dr. Adams was incredible! I have horrible anxiety, especially with going to any dentists. I have had bad experiences at other offices. But Dr. Adams eased my anxiety. He made sure I was okay every step of the way and explained everything! And he did a great job, I’m finally no longer in pain! I recommend him 100%!!!!! I would give him 10 stars if I could!", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "113653286460845647457", "name": "Amy Conlin", "time": 1605739427073, "rating": 5.0, "text": "Dr. Smith will go the extra mile to solve your dental problem. He is thorough, professional, and honest. His office is equipped with state of the art equipment which will give your root canal the very best chance at success. I also found the GentleWave system he uses to be much more comfortable (much less pain when the numbing wore off) than root canal procedures I have had in the past. You are in good hands with Dr. Smith and can trust he is the most qualified in Birmingham.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "101390797807425116531", "name": "Erica reynolds", "time": 1611605375888, "rating": 5.0, "text": "Really loved Dr. Adams! He was gentle and made sure I was comfortable. The atmosphere was good.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "117858956991534539844", "name": "Robert Levin", "time": 1601416935354, "rating": 5.0, "text": "Dr. Smith and his staff are extraordinary!  They are prompt, courteous and extremely efficient. Dr. Smith makes a painful situation as painless as possible.   His experience and skills are remarkable. I feel fortunate to have been referred to him.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "106281748131578598333", "name": "camille pitman", "time": 1614046073746, "rating": 5.0, "text": "Dr. Adams & his staff were very friendly & professional. The office was very clean & followed COVID precautions with hand sanitizer & masks. Dr. Adams took the time to walk me through the procedure, answer all my questions, and put my mind at easy for a pleasant & painless experience.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "100629723800095169483", "name": "Debra Hancock", "time": 1600031641716, "rating": 5.0, "text": "I always dread a visit to the dentist but Dr. Smith is very caring, gentle and understanding.   He made me feel very comfortable and at ease during a very unpleasant but necessary root canal.  I hope I never have to have another but if I do I will definitely choose Dr. Smith for my procedure.   I would highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "100829720076396160362", "name": "Larissa Robinson", "time": 1618354770805, "rating": 5.0, "text": "Wonderful staff and caring doctors. So glad I was referred here.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "103856432526736282595", "name": "Pete Ray", "time": 1609810219150, "rating": 5.0, "text": "Great people very professional.Did everything they said they would explained every step great equipment.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "106570036406190313394", "name": "Dwan Gibson", "time": 1611734275242, "rating": 5.0, "text": "Dr smith did an excellent job and his assistant\nLlooking forward to seeing them in July", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "116086092502097287194", "name": "Ronald Tisdale", "time": 1605404155457, "rating": 5.0, "text": "Excellent professional staff with advanced endodontic procedures that not only are effective but have high success rates compared to conventional procedures. I have been a patient of Dr. Smith for several years and considered him one of the best if not the top-rated endodontist in the area.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "105795136752822848562", "name": "diane clark", "time": 1592944184925, "rating": 5.0, "text": "I was very pleased with Dr. Smith and his staff. He or his assistant, Jan, explained step by step what they were doing during my root canal and why. They were very considerate and kind. I couldn’t be more pleased.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "103194352838480642375", "name": "Tony Russell", "time": 1607621042635, "rating": 5.0, "text": "Very satisfied with Dr Smith and his staff...my teeth feel great!", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "105795895130843835549", "name": "JASON BARNETT", "time": 1604628952553, "rating": 5.0, "text": "Dr. Smith and his staff took great care of my dental needs. I would highly recommend his services.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "108383772150850024078", "name": "Michelle Ozbirn", "time": 1597859594594, "rating": 5.0, "text": "Dr Smith is amazing. Very kind and informative. I’ve been in the dental field for over 30 years and he is the best.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "109821538961720734756", "name": "Dorothy Nelson", "time": 1589932644922, "rating": 5.0, "text": "I was so very pleased with the care I received from Dr. Smith and his staff.  Dr. Smith was so kind and told me exactly what he was doing throughout the entire procedure.  He was  gentle, calm, and very professional.  I would highly recommend him to anyone. His staff was very warm and welcoming also.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "109941249055524807933", "name": "Kim Johnston", "time": 1597512602258, "rating": 5.0, "text": "I had a root canal by Dr. Adams. It was a painless experience. I nearly fell asleep in the chair while he worked. I chose this practice because they use the GentleWave technology.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "105612652782176485374", "name": "Cindi Jones", "time": 1594353558376, "rating": 5.0, "text": "I can't say enough praise for Dr Smith and his staff.  His touch is gentle and his technique is sure and thorough.  I can't recall ever getting numbing injections in my mouth that didn't hurt like crazy - especially those roof-of-the-mouth ones.  Again, his technique alleviated all but the slightest twinge!  I will never see any other Endodontist but Dr Smith!", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "107415635302161979645", "name": "julia t.", "time": 1583436431209, "rating": 5.0, "text": "Amazing office !  Dr. Smith is the best, a perfectionist with a calmness and a caring heart !  Sooo happy my dentist referred me. I experienced no pain not even with the shots.  Everything was high tech and professional.  Awesome friendly staff too...Love them all!   Thank you Dr. Smith for being the best !", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "108576327778368056293", "name": "William Rogers", "time": 1623104339612, "rating": 5.0, "text": "Dr. Smith and staff are very professional.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "114156176814087098704", "name": "L R", "time": 1582573594824, "rating": 5.0, "text": "Wow! who would think that a root canal could earn a 5 star rave review! I had RC this morning with Dr Smith and staff. I was referred to this office through my dentist. The RC procedure was absolutely the best professional /\"medical dental\" experience I have ever had: Punctual, efficient, clean, high tech and friendly. Took less than an hour. Dr Smith  explained each step as he proceeded, and he took great care to ensure my comfort. I can't even complain of pain from numbing injection. Seriously, this was better than getting a crown fitted or cavity filled. It was like flying in First Class. I told them not to retire or move as this will be my go to provider for all future Endodontic needs.  Thanks to Dr Smith and his Staff.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "104210911505116057995", "name": "Deborah Knotts", "time": 1602874858879, "rating": 5.0, "text": "Very nice people here very clean environment very professional", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "101117624286674763158", "name": "Austin Terrell", "time": 1595282642314, "rating": 5.0, "text": "Great staff, during the entire root canal the Dr. continually checked on my status and asked if I was ok. Managed to get a nap in during a root canal, if that tells you anything.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "113325563225172608381", "name": "Skip Ragsdale", "time": 1582305175465, "rating": 5.0, "text": "Doctor Smith is great to work with and he knows his field.  Even the shots didn't hurt!  I enjoyed watching the procedure while he worked.  I now understand what a root canal is and how it is done.  Thank you Doctor Smith.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "116780577501665176370", "name": "Emma Bruce", "time": 1591313944404, "rating": 5.0, "text": "Dr. Smith and staff addressed all my concerns. No pain during or after root canals. Very gentle....prompt visit.  No extended waiting.\nThank you very much.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "105860131435629222581", "name": "Marty Henrickson", "time": 1580779849111, "rating": 5.0, "text": "Let's just get this out of the way: nobody WANTS to get a root canal. But my contention is that when I'm in a situation where I NEED a root canal, I want to go to the best. Dr. Smith and his team at Advanced Endodontics are the best.  They did an excellent job taking care of my problem in a caring, effective, efficient way.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "113325563225172608381", "name": "Skip Ragsdale", "time": 1582305175465, "rating": 5.0, "text": "Doctor Smith is great to work with and he knows his field.  Even the shots didn't hurt!  I enjoyed watching the procedure while he worked.  I now understand what a root canal is and how it is done.  Thank you Doctor Smith.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "112399619488781031264", "name": "Lele mc", "time": 1584389053265, "rating": 5.0, "text": "The doctor and his assistants are all very professional, kind, and considerate. They got me in quickly for a root canal and the doc was gentle and considerate. Pain is gone, thank you God and Advanced Endodontics!", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "117340947932398463742", "name": "Mary Jane Cagle", "time": 1582580473466, "rating": 5.0, "text": "I saw Dr. Smith for a pretreatment of an older root canal.  He was very professional and thorough and explained everything he was doing throughout the procedure.   He and his staff were incredibly friendly in what could be an anxiety-filled visit into one that was almost stress free.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "108663194193148001148", "name": "Tony Mitchell", "time": 1569507331158, "rating": 5.0, "text": "Dr Smith was excellent! He had taken his time and explained everything that was done throughout the entire process. He is a very nice guy as well. I was nervous about getting a root canal but I can say first hand that it wasn’t bad at all. I had my canal done on Monday the 23rd and today is Thursday the 26th, I have had no pain at all! I had to take Tylenol and Advil the first day but after that no pain whatsoever. I also had my temporary crown put on the same day I received my root canal. Only thing I have is a little swelling. Great job to Dr Smith and his staff! I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "101429416465708426454", "name": "Van Folds", "time": 1583458664821, "rating": 5.0, "text": "I have been completely satisfied with every part of AE from the time I walked in the door until the time I walked out. I would recommend going here to anyone anytime.\nI have had root canals in the past and recently started having pain. Dr. David Holcomb (another great Doctor) recommended I go to AE because they have advanced equipment that could identify what was causing my pain. They determined there were missed roots from my first root canals that had gotten infected. He went back in and cleaned it all out. I may not understand all that had to be done but I do know he saved my teeth and it was as gentle and painless as it could be. This doctor and his staff are top notch on a bad day. If I had to give them a rating from 1 to 5 stars they are a ten star facility. My hat is off to all of them.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "104758622757354525785", "name": "Chiharu Roach", "time": 1588902484951, "rating": 5.0, "text": "Dr. Smith is the best dentist!!! Now I am a big fan of him! Thank you so much 😊", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "100852442618322196704", "name": "Bill Emanon", "time": 1576765783234, "rating": 5.0, "text": "I'm a real person using my Google alias name. I've had a number of root canals, and the one I had this week with Dr. Smith was by far the easiest and best.  Gentle and painless prep with novacaine.  He and his staff are great  and the \"go-to\" people if you need a RC.  Tip: pay a little extra for nitrous if you are at all apprehensive (like me) - you'll never feel a thing. His charges are in line with other endodontists.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "116242153327713935701", "name": "Bill Smith", "time": 1615142733785, "rating": 5.0, "text": "Efficient, friendly, professional.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "109589683672821996602", "name": "Mike Sheffield", "time": 1607448347163, "rating": 5.0, "text": "Fantastic experience, took away the fear of procedures.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "100852442618322196704", "name": "Bill Emanon", "time": 1576765783234, "rating": 5.0, "text": "I'm a real person using my Google alias name. I've had a number of root canals, and the one I had this week with Dr. Smith was by far the easiest and best.  Gentle and painless prep with novacaine.  He and his staff are great  and the \"go-to\" people if you need a RC.  Tip: pay a little extra for nitrous if you are at all apprehensive (like me) - you'll never feel a thing. His charges are in line with other endodontists.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "108478795580797245939", "name": "Margie Tranum", "time": 1562795026045, "rating": 5.0, "text": "I needed an emergency root canal and their staff added an appointment for me. They were quick and efficient. The state of the art technology and high quality of care were impressive", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "101378862679475905642", "name": "Mike Williams", "time": 1582299245810, "rating": 5.0, "text": "Dr Smith and his staff are Good--Very Competent--Humorous at times--They are more than professionally sound they give of themselves!", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "106799346066360331253", "name": "Margaret Hubbard", "time": 1583004725638, "rating": 5.0, "text": "Dr Smith and his staff are the most expert professionals. Dr Smith is always available in an emergency and has always given me the best treatment.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "113067564508112353664", "name": "Cassia Smith", "time": 1579042106338, "rating": 5.0, "text": "Clean, efficient, organized, professional, kind manners, and an overall pleasant and confident root canal experience. I do recommend this!", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "100218812240956061461", "name": "Bill Ringler", "time": 1565875409322, "rating": 5.0, "text": "Dr. Smith is a caring dentist.  I'm glad that my personal dentist recommended his services.  I would urge my friends to do the same.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "103072853332195264104", "name": "shawn sutton", "time": 1619731266912, "rating": 5.0, "text": "Jimbo is the absolute best!!!!!", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "117844831449997087157", "name": "Lana Osborn", "time": 1564607864853, "rating": 5.0, "text": "Dr. Smith and his staff are outstanding. I highly recommend him. He was so kind throughout the procedure. No Pain!", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "112621664550128611050", "name": "Dr Russ Fine", "time": 1585066660046, "rating": 5.0, "text": "There's an old saying: \"You get what you pay for.\"  It's true, especially when it comes to endodontic care. Let's be candid: endodontic care (root canals,etc) is very expensive ... no matter who you choose to provide it. So, why not make the most informed choice possible and pay for \"the best?\"  One must always bear in mind, especially when selecting health care professionals, that you are paying for \"alot\" of different things that come together during your procedure. They must have excellent training, extensive experience performing \"your particular procedure,\" the latest equipment and technology, qualified and well-trained assistants; and, a discernable commitment to what it is they are doing. There's another thing: the patient pays, not only for what the provider does ... we pay for the provider's vast wealth of knowledge (acquired at considerable expense) AND FOR WHAT THE PROVIDER KNOWS WHAT NOT TO DO. Very important.\n\nBoth my wife and I have been cared for by Dr. Smith. Our initial referral was from a UAB School of Dentistry facaulty member, whom I have known for many years and for whom I have great respect. She told me \"Dr. Smith is the best in Birmingham.\" Based on my experience (as well as that of my wife's) Dr. Smith may very well be the best endodontist in the country, seriously.  Let me put it this way: I love living in Birmingham, but at this stage of my life, I would prefer living in Fairhope. If I ever move to Fairhope and find myself in need of endodontic care ... I'm driving back to Birmingham, even if I'm in pain. He's that good.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "113748206522491811937", "name": "Ed Vernon", "time": 1568223118001, "rating": 5.0, "text": "Excellent experience.  Everything explained and my comfort was very important to them.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "116912064979484154323", "name": "Susan Farmer", "time": 1609970383532, "rating": 5.0, "text": "Dr. Smith and his crew are very kind and thoughtful.  They make a visit feel almost spa-like.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "115555945118958928685", "name": "Jill Shearin Driver", "time": 1565350132680, "rating": 5.0, "text": "Dr Smith is a professional in every aspect of his practice:  scheduling, wait time, quality of services, etc.  He is an excellent endodontist.  I recommend him highly and without reservation.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "117474048327554445701", "name": "Marilyn P", "time": 1566947448034, "rating": 5.0, "text": "Advanced Endodontics \"Gentle Waves\" root canal was quick , painless, and most importantly thorough! Many thanks to Dr. Smith and staff!", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "115041764305535485895", "name": "Kevin Windsor", "time": 1564013798540, "rating": 5.0, "text": "Very pleasant staff, Dr Smith is patient, pleasant and affable.  Very efficient and actually PAINLESS.  Highly Recommended", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "116924729479663810633", "name": "Ann Mccarty", "time": 1566488345743, "rating": 5.0, "text": "My procedure was painless. Dr Smith and his assistant Jan work together seamlessly.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "103247539520906921975", "name": "Carol Paramore", "time": 1562941617620, "rating": 5.0, "text": "I have had 8 root canals and Dr. Smith is heads above all other dentists!  I have left two other dentists offices who were not able to finish the root canals and Dr. Smith was able to complete the procedure.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "108386300933261013386", "name": "Molly Simmons", "time": 1562765615160, "rating": 5.0, "text": "Amazing!!  Would recommend to anyone.  Great and thorough Doc and wonderful staff!!  A big THANKS for working me in!", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "100149489706357392729", "name": "David Haegele", "time": 1582243965544, "rating": 5.0, "text": "Efficient, painless resolution to my dental problem.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "103172978763256518871", "name": "Dave Verhine", "time": 1562791552571, "rating": 5.0, "text": "I called Monday to schedule an appointment with Dr. Smith in order to assess a third molar, #30, that had previous received root canal therapy and seemed to be giving me some pain. The team worked me in quickly and I was seen 2 days later. The office is well kept, modern, and very clean. The operatory spaces are outfitted with the most cutting edge technologies such as GentleWave techanology by Sonendo, etc. I explained my dental history and Dr. Smith and his team quickly, and accurately, assessed my situation. Within 5 minutes Dr. Smith had pinpointed the problem--it was not #30, but #31, an adjacent tooth which had the beginnings of a small cavity due to the wearing away of previously applied sealants (different dentist, many years prior). I knew I was being treated by a true professional when he DID NOT recommend root canal therapy for that tooth, even though he could have, but instead recommended a simple filling. These are the kinds of things that set professionals apart from those trying to move patients through chairs. True patient care in all respects. His team provided me with all the information and history needed to allow my general dentist to pick up right where he left off. I will 100% recommend Advanced Endodontics to any and all my friends and family in the Birmingham area. Thanks again!", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "110676372578312076575", "name": "dalton Williams", "time": 1618164576266, "rating": 5.0, "text": "Very professional", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "114467620030044570122", "name": "Keith Dillard", "time": 1553634879306, "rating": 5.0, "text": "I have been practicing dentistry for approximately 35 years, and during that time, I have done a great deal of my own endodontic treatment, including molars. However, Jimbo Smith, for the last 20 years, has been my go-to guy for the difficult cases.  He has all the best technology and I am convinced gives my patients the best chance of success when other attempts have been unsuccessful.  I believe the Gentle Wave and cone beam will at some time become the standard of care for endodontics and I am glad to have Jimbo up to date on the latest and greatest for the benefit of my patients.  They always report he is very gentle, he has the ability to sedate when necessary, and overall my patients seem to have a great experience with him.  I would highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "111577888942229070686", "name": "Elizabeth Walker", "time": 1580396901078, "rating": 5.0, "text": "Incredible team and service.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "100373830121310073734", "name": "Deana Sheucraft", "time": 1565562930392, "rating": 5.0, "text": "Great job from start to finish.", "pics": null, "resp": null, "gmap_id": "0x88891bdac6bcf12d:0x1b2d23ae3c6d92ab"}
{"user_id": "102898842828938122857", "name": "Nakiria jackson", "time": 1567112624788, "rating": 1.0, "text": "I saw this dentist several years ago and I did not remember why I wasn't going to go back. I went in today for a cleaning and the minute he walked in the room I was reminded why I will never visit this office again. He is impolite, insensitive, and can't relate to me effectively. The ladies at the front desk are very nice and professional and so is the lady that cleaned my teeth. Needless to say I will never give him my business again.", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "107373649571992208452", "name": "Brian", "time": 1481946937255, "rating": 5.0, "text": "I've been going to see Dr. Walker since I was 18. I'm 47 now. He's a very nice guy and knows his profession very well. I feel like I'm visiting family when I go there. Everyone is very nice to me and always answers any questions I may have. If you wanna keep your teeth looking good and feel comfortable doing it then go see Dr. Walker and his great staff.", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "113971054413972766497", "name": "Cortney Moon", "time": 1469128496471, "rating": 5.0, "text": "Dr. Walker was absolutely amazing!  I have a true fear of the dentist and he and his staff made me feel very comfortable.  I would highly recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "115353579254628142794", "name": "AJS Williams", "time": 1471479163809, "rating": 4.0, "text": "Dr. Walker was absolutely great with my daughter, was so nervous and she said she couldn't even feel the shot. Girl up front was so patient with my insurance. No other place would try to help me with a estimate or take our brand. We will definitely be back to that office.", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "106165162966531897023", "name": "Melissa Crusoe", "time": 1475597422067, "rating": 5.0, "text": "Dr. Walker is the best dentist I have had! He is very professional and knows his craft well! AND his staff is professional and very skilled! I highly recommend Dr. Thomas Walker's Dentristy for all your dentistry needs!", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "106667328325162014245", "name": "Richard Howell", "time": 1460500561506, "rating": 1.0, "text": "Staff is incompetent and severly lacking in training. Worst dentist office I have ever been to. I am 58 yrs old and have had a lot of dental work done. These people don't have a clue about what they are doing. They will lie and make up things in an attempt to cover up their incompetence. Don't waste your money. Save yourself a lot of pain and definitely avoid this office.", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "111678913351712476652", "name": "Brittany Richards", "time": 1421087975055, "rating": 5.0, "text": "Dr. Walker has been my dentist since I was a child. I'm almost positive he worked on my first tooth! Even as a kid I felt comfortable and loved him as my dentist. As an adult, I feel the exact same and have always been extremely loyal to Dr. Walker. His office is always clean, my visit is always fast and his staff are always wonderful to talk with. He moved from Irondale (originally up on the hill) to Trussville (closer to me so that's a win!) and I'd follow him again. My entire family uses Dr. Walker and I highly recommend him as a dentist for patients of any age. He's the reason I have the awesome smile I do! :)", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "109463799663931100283", "name": "Kathryn Lopresti", "time": 1487707885742, "rating": 5.0, "text": "Friendly and experienced employees. They become like family after a few cleanings or dental work. I have seen Dr Walker over 15 years.", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "105939211859585004125", "name": "Crystal Hucks", "time": 1468949473312, "rating": 5.0, "text": "Great atmosphere!! Very clean and patient oriented office..", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "112556937432305065458", "name": "Christian Collins", "time": 1551133994858, "rating": 5.0, "text": "Very professional, calming and very thorough", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "109462209739645041828", "name": "Heather Snyder", "time": 1475597669802, "rating": 5.0, "text": "The staff is amazing!!!!!!!!! Great experience they were very helpful and made me feel right at home  ! I will be back!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "100450929465764203278", "name": "Mindy Lambert", "time": 1488509485714, "rating": 5.0, "text": "I would highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "103253097224547230723", "name": "Liliia USA", "time": 1602687581953, "rating": 1.0, "text": "My husband was a client of this clinic for several years. And he came from Pensacola. Last week, the VA was allowed to give him another apoitment.  My husband called and left a voice message.  A few hours later , he got a call back, as it turned out, from the clinic. My husband receives thousands of calls from various Scam and advertising companies. And this call he credited to the Scam and did not respond properly. When he realized that there was a misunderstanding, he called back again, deeply apologized. That's it!!! Since then, silence!!!! I , his wife , called, WA called. Expensive clinic and a wonderful doctor! You need to change the receptionist.  A clinic that works to provide services should probably at least answer incoming calls.", "pics": null, "resp": null, "gmap_id": "0x889a4d294c032353:0x12c1e08c9ba717a"}
{"user_id": "104301913140780165039", "name": "Jackilynn Langley", "time": 1566606124873, "rating": 5.0, "text": "Most amazing place! They care!", "pics": null, "resp": null, "gmap_id": "0x889a4d294c032353:0x12c1e08c9ba717a"}
{"user_id": "111778256161857287217", "name": "Joyce Cooper", "time": 1611286568138, "rating": 5.0, "text": "Scheduled  appointments are meant with little to no wait time. The office staff are always professional and courteous. All procedures are fully explained. I would definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "109249293061988416628", "name": "Jasmine “Jassie Creations” Neal", "time": 1611960010907, "rating": 5.0, "text": "Clean and friendly place. The staff was nice and my cleaning was good. I will continue to go.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "103506311502181537218", "name": "Anoymous Ok", "time": 1617284051172, "rating": 2.0, "text": "Can someone tell me why their is not a full time receptionist to answer the phone.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "113534799137330972381", "name": "Lena Dillon", "time": 1611892930716, "rating": 5.0, "text": "Cumberland Dental takes excellent care of my dental needs.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "110972099247165447744", "name": "Dorothy Johnson", "time": 1600868557557, "rating": 5.0, "text": "I like the service, staff was very nice and generous I'm looking forward to my next visit.   Thank you.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "101423559806266567953", "name": "Becky Shirley", "time": 1597415152732, "rating": 2.0, "text": "My mother had to have a crown replaced. They told her a price and what her part was going to cost. She paid it right then. After 2 months the procedure was finished, why it took 2 months is beyond me. They are now sending her bills for more money even after the insurance company has paid their part too. Also charged the insurance company for 2 tooth crowns and not just one.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "107284405303424327382", "name": "BJ Kidd", "time": 1575676522935, "rating": 1.0, "text": "Terrible experience.  Unorganized.  Worked on the correct tooth for one family member but applied Novocain shots to the wrong side of the mouth.  Performed a filling that is failing only after a couple of months.  Another family member sat in the Dentists chair for 2 hours and 30 min without performing any work.  Billing was also a headache very difficult to work with and a confusing bill.  Complete waste of time and money.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "104543765273512880204", "name": "Keith Foshee", "time": 1572372492335, "rating": 1.0, "text": "Was referred to this place by my Dental Insurance Company.    Called at  3 various times during business hours and got answering service every time.    Very little command of English language.    Left message on 3rd try for someone to please call me back to schedule an appointment.    24 Hours have passed and still no call.    If this is an indication of how they run the business- then I wouldn't do business with them anyway.    So very unprofessional.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "108736622669374749668", "name": "kash05052010", "time": 1581061564803, "rating": 5.0, "text": "Anita is awesome! She’s sweet and does her job well!!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "109329375324440562923", "name": "Amberlyn Porter", "time": 1541890713377, "rating": 5.0, "text": "Tammy was my dental hygienist and she was amazing. I absolutely love how comfortable and aware she made me in the time of my visit. This place is definitely home for me!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "110718412538757330079", "name": "James Mucha", "time": 1531272649049, "rating": 5.0, "text": "From the front counter upon entering the facility, to the dental hygienist, to Dr. White, I received phenomenal service and a thorough exam. Staff were very friendly and professional. I know what to expect each and every visit and have never been disappointed. I will continue my dental care at Cumberland.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "104652033718669546421", "name": "Kindeth Martin", "time": 1563374610633, "rating": 1.0, "text": "Very rude unprofessional group. I called to get a bill resolved because they did not file my insurance, (which I gave them the correct insurance card at the time of my appointment), she told me she'd have to send my information to corporate, (which was suppose to be done at my appointment) and I told her I didn't care what they had to do, I just wanted my bill resolved, I got hung up on. I called back, I asked for a supervisor, I was told a supervisor would call me, (mind you none of my information was asked for) I asked her is she was gonna take my information, in a smart tone she said \"We have called ID\", I explained to her I was calling from work and wanted them to call me back on my cell phone, well then she proceeded to remember who I was. Please do not waste your time here, they do not care about you nor your health and the also will not allow you to make payments on your bill. Go to someone who cares because its obviously not this group.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "103699653400213832740", "name": "LWV Tuscaloosa", "time": 1490477856101, "rating": 5.0, "text": "I have been going to Cumberland Dental for 8 years.  Right after I moved to Tuscaloosa the front half of a molar broke off.  I picked Cumberland Dental from the Yellow Pages, found that it takes my dental insurance and got a prompt appointment with Dr. White.  He made a crown for the tooth that is completely satisfactory after 8 years.  He has replaced a couple of old fillings and the new ones are fine.  Emily, the hygienist who takes care of my routine visits, is really competent, professional and friendly.  I certainly would recommend both of them to anyone.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "118154587453659046076", "name": "Raymond C", "time": 1526399612137, "rating": 4.0, "text": "There is a long wait time between visits but Dr White is excellent. He does not hurt you when he gives the numbing shot. The assistants are mostly nice. However whoever they call in to do tooth extractions will hurt you. I wish Dr. White would teach them how to give a shot.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "105963279292749842774", "name": "Alethia Smith", "time": 1457796639483, "rating": 1.0, "text": "This is the worst dentist ofice, to go too! The woman that did my cleaning, had a nasty and unprofessional attitude. She didn't speak to me or ask how i was doing and act like she really hated her job. I want EVER go back there. So please stop emailing me..for a follow up on my cleanings. I have never ever experienced such bad attitudes in my whole life on earth. The equipment , looks horrible and looks old. I can go on. I should of left as soon as i meet the woman that i dealt with. She looked so mean and unhelpful. You all want ever have to worry about me EVER again. I wasn't comfortable at all in there.She acted like she was even more mad, because i had braces on and that i just needed to get a cleaning. They need to fire her. She is one of the main reasons..you all or getting bad business. Please get more educated and professional workers in there. Its like going to hell and back, going there straight up.  People, please take my advice and don't waste your money or time!!!!!! No stars, none whats so ever! I'm still pissed off. Hate i had to even like one star...to submit this post.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "104570941933576630306", "name": "Sheila Garner", "time": 1556200529853, "rating": 5.0, "text": "I have had a wonderful experience!!!! Couldn’t ask for better service, friendly and helpful staff! Staff takes time to answer questions that you may have, I highly recommend them!!!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "107299262558375705306", "name": "Mary Black", "time": 1538531551424, "rating": 5.0, "text": "Every one is caring and they took great Care of my needs. I have high anxiety and they were great helping me stay calm etc.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "100310410546025175542", "name": "Sherri Custred", "time": 1513778658014, "rating": 1.0, "text": "Came here for implant surgery. Am now 5 MONTHS BEHIND schedule because their implant dentist and scheduler can't seem to get things right. I have rearranged my schedule to be here 5 TIMES and been told I have to reschedule. As soon as I am finished here,  I WILL NEVER COME TO THIS OFFICE AGAIN. IF I HADN'T MADE THE MISTAKE OF PAYING FOR ALL OF MY PROCEDURES I WOULDN'T EVER COME BACK!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "104682051221533439585", "name": "Shamaria Borden", "time": 1459443265615, "rating": 2.0, "text": "The first visit wasn't bad at all. The lady who did my cleaning was very informative and nice. However, I have been rescheduled 3 consecutive times for my cavities to be filled. Whoever this lady is, who's supposed to perform my fillings, has been out of the office seems for months now. My rescheduled appts. have now ran into a 3 month period. It's extremely frustrating. I have chosen to switch dentists.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "102521602106249323834", "name": "Kimberly Johnson", "time": 1519588204785, "rating": 5.0, "text": "They make you feel comfortable during your stay, I was very impressed with the care that I had!! I would definitely refer anyone to Cumberland dental!!!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "111918163004574064171", "name": "Js Bell", "time": 1533522233444, "rating": 5.0, "text": "Everyone was very nice and professional. Procedure was quick and painless.😊", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "112025893585481592768", "name": "Sandi Moss", "time": 1474565310390, "rating": 1.0, "text": "Horrible! Worst place to ever go!!!! I was charged for some procedures twice one procedure I didn't need at all! I wear a medical bracelet AND my file list my allergies in BOLD LETTERS and the dentist completely overlooked it proceeded to touch me. Ihad to leave and spend 2 days in the hospital because my throat began to close! I DO NOT ADVISE ANYONE TO GO HERE AT ALL!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "113580378281847100038", "name": "Kat Robison Hasani", "time": 1559322889985, "rating": 1.0, "text": "Waited over an hour and after showing up early and still hadn’t seen the actual dentist and they couldn’t even say when the dentist would be in. We left. Worst dental experience ever.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "115479212725049057400", "name": "Ashley Delahanty", "time": 1509117000670, "rating": 1.0, "text": "I'm 30, I've had a lot of dental work in my life and the oral surgeon is the first to actually make me cry. She was so rough and to top it off, I still have pieces of tooth sticking out of my gum causing a lot of discomfort. My experience was so unpleasant, I don't even want to go back for her to check on it", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "103235158036588122928", "name": "Cheryl Farley", "time": 1552605261749, "rating": 5.0, "text": "I have been a customer of Dr. White's for over thirty years.  I always refer people looking for a dentist. Also my dental hygienist Montana and Dr. White really care about they patient's. 👍", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "102744717989698440072", "name": "Shalandra Washington", "time": 1497734384558, "rating": 5.0, "text": "Ms. Anita is awesome. This last visit was great and very timely.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "102040371173684790827", "name": "Natalie Davis", "time": 1439948587319, "rating": 1.0, "text": "Normally I go to the dentist at home but it was an emergency. I woke up one morning with a lot of pain and swelling. I went in and they gave me some antibiotics and ask I return to have the tooth fixed on completion of my antibiotics. The service from this visit was great!\nI returned on completion of my antibiotics and that's when the trouble started. They decided I needed to get a root canal on the tooth. It was still very sensitive and painful. The hygienist was very general when taking x-Rays and getting me into my room. The dentist came in and put a bit of numbing medication on my gums. The shot was done before the gum was numb and he started the dental work before the tooth was numb. He would not stop no matter what the hygentist or I did. I walked out of the office in tears and it wasn't until I got to my car the full effect of the numbing medication kicked in. The office staff and hygentist all seemed very upset about how the doctor did this. Needless to say I did not return to have my permanent crown done at this office and for purposes of all emergencies will seek care elsewhere!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "111588372296830345758", "name": "Jackie Easterwood", "time": 1520366794410, "rating": 5.0, "text": "EVERYONE is always friendly to me i like that the wait time is not long", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "108009556542675150265", "name": "Deborah Crocker", "time": 1463766878440, "rating": 4.0, "text": "I have been going there for 25 years. Some of the personnel have changed over the years but I have never had a problem with anyone or anything.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "116240027065500664353", "name": "D Pohl", "time": 1459181554700, "rating": 1.0, "text": "Dishonest and predatory practices.  Completely unsatisfactory.  Complaint filed with the Better Business Bureau.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "112161203407410595826", "name": "Earl Ike-German", "time": 1553204953835, "rating": 5.0, "text": "Awesome staff!! Anita and Dr. White are the best!!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "112664701980900936902", "name": "Donna Lockett", "time": 1454773994912, "rating": 2.0, "text": "Don't think I would recommend anyone here..the nusrse that took my xrays was so harsh with the tools she had to do it with and my tongue still hurts and she smelled like a pack of cigarettes.. Then they said I had to schedule two appointment to do the work they need to do.but I think this office just want money...#Needs major improvements", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "108417549611036998470", "name": "Temeka Johnson", "time": 1573455768602, "rating": 1.0, "text": "My experience with Cumberland Dental was awful, I had to go back several times for work that was done to be  done over again, like my filling came out within 2 or 3 day after being put in then when I went back he stuck a needle n my gum where I had no teeth at now that spot is hurting so bad I don't know what to do and the filling has came out again", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "108627743208578909071", "name": "Kristin Heard", "time": 1496761090125, "rating": 1.0, "text": "I went to this dentist and they told me I had 100 cavities. Of Course I went to get a second opinion because I thought 100 cavities was absurd. Once I received a second opinion from a different dentist office,  I was then told I didn't have any.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "104679595326564040819", "name": "Mike Howell", "time": 1521469953266, "rating": 5.0, "text": "My experience here was good.. Dr. White and the staff treated me well and my problem was taken care of..", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "117795338092868947715", "name": "Michael Morris", "time": 1531695138653, "rating": 4.0, "text": "They do good work at good prices.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "116408891372829855469", "name": "Gail Johnson", "time": 1533679505915, "rating": 5.0, "text": "Everything was great, staff was very polite.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "108295274548008996188", "name": "Jayy Hollie", "time": 1588641947612, "rating": 1.0, "text": "Horrible, Horrible Customer Service!!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "106248021373166570197", "name": "Mickey Burgin", "time": 1551571157395, "rating": 5.0, "text": "The pain was gone a couple of hours after I left", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "101911194557745554460", "name": "Sharon Watts", "time": 1557157554274, "rating": 5.0, "text": "Copy Comments To Clipboard", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "106437565629159680438", "name": "Fran Viselli", "time": 1481926037374, "rating": 5.0, "text": "Very pleasant and professional, made me feel at ease.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "111529720698085740126", "name": "Alden Ammons", "time": 1519944664230, "rating": 1.0, "text": "Really slow, expect to wait an hour, even when you have a scheduled appointment !", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "101873653107223508364", "name": "Pierre Tubbs", "time": 1516741023973, "rating": 1.0, "text": "False Advertising THE RECEPTIONIST TURNED ME AROUND AT THE DOOR..they DO NOT ACCEPT WALK-Ins", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "117203653912011578990", "name": "Michael Lindsey", "time": 1504909112644, "rating": 1.0, "text": "They are expensive, unorganized, unprofessional and SLOW!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x3b4520c933b799fb"}
{"user_id": "100453209912679887480", "name": "Michelle Riley", "time": 1596645223415, "rating": 5.0, "text": "Wow!  If you have a choice of where to go...this is THE PLACE.  Immaculately clean, friendly staff. Dr. Alley examined me.  I really appreciated how he explained things to me.  He earned my trust immediately. I didn't feel rushed or pressured to make a decision about next steps. In fact, they made it a point to include me in the decision making.  You'll be very happy here.", "pics": null, "resp": null, "gmap_id": "0x88626cb5d084fd61:0x37529a39a3b465ee"}
{"user_id": "105548933815651497074", "name": "Kevin Echols", "time": 1591724005857, "rating": 5.0, "text": "Excellent Endodontist!!!!  I have had several root canals over the years and this was by far the best experience ever!  Dr. McCrary took the time discuss with me and then completed my root canal painlessly!  I had no pain or soreness after the numbness wore off!  His staff was very kind and helpful.  Excellent experience I would give them 10 stars if possible!!", "pics": null, "resp": null, "gmap_id": "0x88626cb5d084fd61:0x37529a39a3b465ee"}
{"user_id": "100815288648319979613", "name": "Lindsay Wheeler", "time": 1524191402858, "rating": 5.0, "text": "I was referred here from an emergency dentist, had an emergency root canal here, and these folks are amazing! They were very professional and were able to see me quicker than I thought. Most places have like a two week wait time, they were able to see me within days of scheduling me! And though my insurance apparently doesn't cover basically any root canal, they still did their best to make the process painless and easy. I definately recommend this place to anyone with issues that their regular dentist cannot handle!", "pics": null, "resp": null, "gmap_id": "0x88626cb5d084fd61:0x37529a39a3b465ee"}
