{"user_id": "108739912154638194454", "name": "Mick Lindley", "time": 1607828249626, "rating": 1.0, "text": "Called at 9am to ask if they could fill my propane tank on my RV. They stated no one was there to do it. Don't waste your time. Look elsewhere.", "pics": null, "resp": null, "gmap_id": "0x888a610dd648086b:0xc2912a3bd1724cb2"}
{"user_id": "101186303370066966450", "name": "Jason Etheridge", "time": 1602942620452, "rating": 2.0, "text": "Exchanged lp tanks. 1 st one leaked immediately. They exchanged for another. Camped the weekend, turned off valves to return a month later to an empty tank. For something as dangerous as gas.... leak test should be a priority. Money wasted.", "pics": null, "resp": null, "gmap_id": "0x888a610dd648086b:0xc2912a3bd1724cb2"}
{"user_id": "109749890520168772971", "name": "Tammi East", "time": 1610164359967, "rating": 1.0, "text": "I have tried for three days to cancel a delivery. Sent three emails and put on hold for over two and a half hours. This company has the absolute worst customer service I have ever dealt with! I will never use them again!", "pics": null, "resp": null, "gmap_id": "0x888a610dd648086b:0xc2912a3bd1724cb2"}
{"user_id": "117991102857492181932", "name": "Diggin Dawn", "time": 1516249310461, "rating": 1.0, "text": "I looked at the reviews and did not see any negatives. Strange...Well, you have one now! My Sister paid for her propane 2 days ago and I just found out she ran out today because y'all couldn't deliver to her because an employee didn't work today  Does anyone there keep up with the weather? It is 15 degrees with a CF of 12 degrees! Not only is she freezing to death, she is also worried that her pipes will freeze and burst. Somebody at Heritage Propane should have cared enough to make sure her propane was delivered even if they had to work overtime to do it due to the weather. And once y'all even sent her a bill for 1 penny. Is your company really that hard up for money? Rest assured I will be looking for a dependable propane service for her to sign up with.  I gave Heritage Propane 1 star only because I couldn't post without it!", "pics": null, "resp": null, "gmap_id": "0x888a610dd648086b:0xc2912a3bd1724cb2"}
{"user_id": "110105331493743959542", "name": "Cynthia Morgan", "time": 1516247134910, "rating": 1.0, "text": "My sister in law lives in Gaylesville Alabama, she paid in full for a 100 gallons on Monday 01/15/2018 its freezing with snow on the ground and ice on the roads and is out of heat!! This is a disgrace, they say an employee stayed out of work, fine this is your company and your responsibility to the people you serve. You took funds that guarantee that your customer will be warm, you have failed in this agreement. I hope she and her pets do not freeze to death, yes i offered food and shelter but she can not get to my home. I don't care what this company has to do but you should have had a driver (in a warm truck) deliver . today is Wednesday it was ordered 2 days ago. I will be reporting this further, that you can count on!!!", "pics": null, "resp": null, "gmap_id": "0x888a610dd648086b:0xc2912a3bd1724cb2"}
{"user_id": "117965803249368754982", "name": "Sally Lee", "time": 1540386860463, "rating": 1.0, "text": "This is the WORST company ever.  We just moved into a house and we called around Sept. For delivery and to check. Well, they were backed up. We called and called and she told us that their guys was working on Saturday because they were behind. Finally, two months later When it was COLD they finally come to inspect and check out everything. The short heavy man and tall skinny man arrived RUDE  towards me. Funny how I woke my husband up and told them how they were being an he walked in and  they were nice as can be the whole time. Then later we went to order more gas and paid upfront and got a bill, like really????????? will never use them and tell everyone!!!! When the heavy short man, tall skinny man hateful to a woman but different when a woman is around is pathetic!!!!", "pics": null, "resp": null, "gmap_id": "0x888a610dd648086b:0xc2912a3bd1724cb2"}
{"user_id": "102385342439170278381", "name": "Justin Busby", "time": 1456389241062, "rating": 5.0, "text": "Worked here from 2011 to 2014 and I still have to say iv never lerned so much so quick anywhere else,  had many many great times. Awesome company! !!!!", "pics": null, "resp": null, "gmap_id": "0x888a610dd648086b:0xc2912a3bd1724cb2"}
{"user_id": "113584218328026017963", "name": "Troy Patterson", "time": 1499376450358, "rating": 1.0, "text": "Website says open until 5 4:20 & their closed.", "pics": null, "resp": null, "gmap_id": "0x888a610dd648086b:0xc2912a3bd1724cb2"}
{"user_id": "100304679018268371705", "name": "Ashley Bosarge", "time": 1553342954383, "rating": 5.0, "text": "Neat concept, extremely friendly staff, interesting products, and delicious coffee. My one and only complaint is that none of the merchandise has prices on it. I would buy more if I didn't have to ask the price of each individual item (and I'm not going to buy something without knowing the price). Otherwise, it's an awesome place.", "pics": null, "resp": null, "gmap_id": "0x889bb2ad06faf7b7:0xb8d59d6602017a03"}
{"user_id": "117801262450584330062", "name": "James Duke", "time": 1548377438945, "rating": 4.0, "text": "This is not a coffee shop. This is a caffeine dispensary. If you are an energy drink connoisseur, this is the place for you. If you like fancy froufrou coffee drinks, try one of the multiple coffee shops within a mile of this place. In addition to the plethora of chilled energy drinks, and various other caffeinated paraphernalia (like soap), they serve \"the strongest coffee in the world.\" This coffee, however, is surprisingly good and not bitter at all. I'll swing by here again when I need a pick-me-up and want to support local.", "pics": null, "resp": {"time": 1548378578082, "text": "Thank you so much for your positive feedback! We're so glad you enjoyed our little shop!"}, "gmap_id": "0x889bb2ad06faf7b7:0xb8d59d6602017a03"}
{"user_id": "104966717927345297174", "name": "Jason Viator", "time": 1559840319857, "rating": 5.0, "text": "Amazing coffee, great shop, incredible service. I can't say enough good about this place. Stop by if you're a vet for sure!", "pics": null, "resp": null, "gmap_id": "0x889bb2ad06faf7b7:0xb8d59d6602017a03"}
{"user_id": "110425621990538290838", "name": "Ashley Friend", "time": 1518231521576, "rating": 5.0, "text": "amazing local coffee place , love the rewards program and the local outreach that is done to help the community. like the donation of coats for those in need recently.  highly recommend this place. found my new favorite energy drink its called bang the champagne flavor is my absolute favorite. it reminds me of real faygo cream soda I used to drink as a kid in glass bottles during the 90's.", "pics": null, "resp": null, "gmap_id": "0x889bb2ad06faf7b7:0xb8d59d6602017a03"}
{"user_id": "104047699722589304181", "name": "Tyler Belden", "time": 1542331906728, "rating": 5.0, "text": "If you enjoy caffeine then this is your place for sure. From quality coffee, to just about every energy drink you could imagine, and some more usual ways to get your caffeine fix. They just about have it all. (They also offer a loyalty cup that is a one time purchase and then a small fee for every coffee fill up!)", "pics": null, "resp": null, "gmap_id": "0x889bb2ad06faf7b7:0xb8d59d6602017a03"}
{"user_id": "104503932638541959944", "name": "Matt DeBlaey", "time": 1551913766255, "rating": 5.0, "text": "A great place to get the best coffee. The people that run it are super nice. Definitely a place to grab some beans or a cup to go.", "pics": null, "resp": null, "gmap_id": "0x889bb2ad06faf7b7:0xb8d59d6602017a03"}
{"user_id": "112992331829914824084", "name": "Matthew Peterson", "time": 1512262765842, "rating": 5.0, "text": "Caffeine corps is awesome!  They have rare, unique energy drinks and coffee, and the staff is knowledgeable about their products.  If you want to hang out, there is plenty of seating as well.  I'd definitely recommend it!", "pics": null, "resp": null, "gmap_id": "0x889bb2ad06faf7b7:0xb8d59d6602017a03"}
{"user_id": "108230420948259417482", "name": "Ziggy Zane", "time": 1546545891865, "rating": 5.0, "text": "I went in for the first time today after seeing them on Facebook. I went in looking for K cups but they were sold out. I did grab a case of assorted Bang and am looking forward to try it. The girl working in there offered me a cup of Deathwish coffee and it was awesome. I will definitely be back when my reusable K cup arrives.", "pics": null, "resp": null, "gmap_id": "0x889bb2ad06faf7b7:0xb8d59d6602017a03"}
{"user_id": "116750116664954079263", "name": "J. K. Kesterson", "time": 1564570217746, "rating": 5.0, "text": "Mandi and the team provide excellent knowledge on all things caffeine.", "pics": null, "resp": null, "gmap_id": "0x889bb2ad06faf7b7:0xb8d59d6602017a03"}
{"user_id": "107714280751609194694", "name": "Justin Schneider", "time": 1530624238933, "rating": 5.0, "text": "Awesome coffee. Awesome owner. Best cup of joe for cheap", "pics": null, "resp": null, "gmap_id": "0x889bb2ad06faf7b7:0xb8d59d6602017a03"}
{"user_id": "116087127684278332817", "name": "Thomas Drew III", "time": 1528494165369, "rating": 5.0, "text": "Great people amazing customer service and they have death wish, great place 10/10", "pics": null, "resp": null, "gmap_id": "0x889bb2ad06faf7b7:0xb8d59d6602017a03"}
{"user_id": "106019099763225048957", "name": "Lee Grimm", "time": 1532722977468, "rating": 5.0, "text": "Great place and incredibly kind owner who runs the store. Hope the neighborhood will support it!", "pics": null, "resp": null, "gmap_id": "0x889bb2ad06faf7b7:0xb8d59d6602017a03"}
{"user_id": "101451417074576450778", "name": "Mary Ann Tuohy", "time": 1516370775699, "rating": 4.0, "text": "Clean, frendly atmosphere. No decaf.\nNeeds pastries.", "pics": null, "resp": {"time": 1516982843379, "text": "Hi, Mary! We apologize for not having decaf, but we have started looking into carrying brewed decaf as a pour over option! We are also in the works with a local baker to get pastries to sell. We hope to see you back at the store!"}, "gmap_id": "0x889bb2ad06faf7b7:0xb8d59d6602017a03"}
{"user_id": "100942603927506258025", "name": "Jacob Cooley", "time": 1551984963467, "rating": 1.0, "text": "Burnt coffee. Too expensive. $3 for a coffee is overpriced for your subpar brew.", "pics": null, "resp": {"time": 1552043940771, "text": "We apologize for your experience! Great thing about Caffeine Corps if that we have tons of other options besides coffee!\n\nWe hope you have a great day!"}, "gmap_id": "0x889bb2ad06faf7b7:0xb8d59d6602017a03"}
{"user_id": "102773162827347509903", "name": "Rick Green", "time": 1517922939224, "rating": 5.0, "text": "Best selection of caffeinated products in town.", "pics": null, "resp": null, "gmap_id": "0x889bb2ad06faf7b7:0xb8d59d6602017a03"}
{"user_id": "111147113269745996558", "name": "Mandy Clark", "time": 1523387695335, "rating": 5.0, "text": "Best place to get caffeinated!", "pics": null, "resp": null, "gmap_id": "0x889bb2ad06faf7b7:0xb8d59d6602017a03"}
{"user_id": "102034863491338362069", "name": "Billie Grimes", "time": 1531512084877, "rating": 5.0, "text": "Love the Death Wish coffee!", "pics": null, "resp": null, "gmap_id": "0x889bb2ad06faf7b7:0xb8d59d6602017a03"}
{"user_id": "108370122017706363307", "name": "Tamara Weiss", "time": 1520443085920, "rating": 5.0, "text": "Friendly service, huge selection, and amazing  coffee!!!", "pics": null, "resp": null, "gmap_id": "0x889bb2ad06faf7b7:0xb8d59d6602017a03"}
