{"user_id": "115927414020738179742", "name": "Brooklyn H", "time": 1610671548934, "rating": 5.0, "text": "I was recommended and I myself, would recommend. It took about 2 1/2 weeks to get everything we NEEDED done. they were very upfront about the cost, how long it would take, and gave us a run down of everything that needed repaired & basically a general overview. We got what we originally came for the first week & after they noticed a few minor issues, we had them fixed within the next week. Still needs work but they got us up and running! they recommend affordable places to buy parts as well. I am confident that this business will give you the best work and if they feel they can’t, they will recommend you somewhere that can!", "pics": null, "resp": {"time": 1612480096030, "text": "Thank you"}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "117946577260122656452", "name": "Bloody Hatchetz", "time": 1617395058941, "rating": 1.0, "text": "Had a vehicle towed from my house to Integrity cause of it not running . This car didn't have much problems only needed parts put on that I already had that I stored in car . My car sat in there parking lot for 2 weeks and was not touched by them . I did call them 3 times asking for any updates and was told by them  it would be done on a Monday . I waited till Friday of same week and got fed up on waiting . I had another shop come with there towing truck . I would not recommend  Integrity ! They are also rude as I was only wanting updates.  They told me if I could do it faster then come get it so I did .", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "108534847403383658855", "name": "PB and J Aquatics", "time": 1628230288298, "rating": 1.0, "text": "They lie and delay.  Don't take your vehicle there if you expect to use it for several months .  Mine sat there so long that mice made a nest in the wiring harness.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "105307606696602897258", "name": "alice gaylor", "time": 1599863684959, "rating": 5.0, "text": "I am purchasing a new (used) vehicle that is in need of some repairs and Integrity is where the car lot took it to be serviced. I stopped by today (my first time ever being there) to check on the progress and was VERY impressed. Although my car isn't ready, Ryan and a couple of other employees were SO helpful and informative about everything going on with it. I never felt rushed or like I was being a burden for stopping by. As a matter of fact, they were trying to get the air in my truck going for me so I would have AC until my car gets fixed!! Unfortunately it wasn't able to be fixed but just the kindness and courtesy these guys showed was refreshing!!! I will definitely be using them for my go to shop from now on!!\n\n****Updated Review****\n\nHUGE shout out to the employees at Integrity!!! All the way from Robert, to Liz, Brian, and Doug.....you guys absolutely rock!!!!! Not only have you guys fixed the original car issues, but you helped me get the other things taken car of as well. I was greeted with a smile and excellent customer service EVERY time I stopped in and have nothing but praise for you guys!! Thanks so much for everything!!!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "100977011363706017397", "name": "Jamie Allison", "time": 1616539228122, "rating": 1.0, "text": "well they lie a lot and they just don’t do good business so I do not recommend I hope whoever sees this goes to someone better do not trust them up there we had our car up there and they messed everything up so just go to someone better🙂", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "112083976705522191180", "name": "Draco Palioxis", "time": 1612286405889, "rating": 1.0, "text": "I had my car taken up here to get the Rack and Pinion and 2 rims fixed. They did all this unnecessary work like fix my bumper that wasnt broken and repainted my car for no reason. I have had this car in there for about a month now and I finally get a call from my insurance, NOT THE COMPANY MY CAR IS WITH, telling me that my car was totaled. And now I have no car in order to do my job in anymore. I highly would not recommend this place for any sort of repairs or fixing of your vehicles.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "117187025503744171904", "name": "Mark Lanier", "time": 1603725176756, "rating": 5.0, "text": "5 star service. They will have all my vehicle maintenance work from here on out. I had my truck towed to them they had the problem diagnosed and fixed by the next afternoon. They called and let me know what was going on and what it would take to fix before doing anything. They took all my warranty so my cost was just the deductible from my warranty. Great people and customer service.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "101987308529494115763", "name": "Josh Mckleroy", "time": 1607955956486, "rating": 1.0, "text": "Had transmission rebuilt in September of 2019 had to take it back 2 days later because it was leaking fluid where the transmission bolts to the transfer case. Then around Christmas I realized the 4 wheel drive didn't work called up there and was told someone would call me back and they never did and done this multiple times for the next year and in November 2020 the transmission has went completely out after 14 months and 16000 miles owner blocked me on social media because he knows he has done wrong and hopefully by sharing my experience I can save someone the hassle and money so they don't waste $1800 like it did", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "101102728045700930344", "name": "P M", "time": 1608480028674, "rating": 1.0, "text": "Not sure why the rating for this business is so high. As a mechanic I can say that I have seen some terrible work come from this shop, and I have seen some very upset customers who have lost thousands of dollars by trusting these guys. I’m making this post because today I ran across a third car they “worked on” and for the third time the repair they performed was unnecessary, and did not fix the issue. And for the second time, the work they did actually caused additional issues.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "110546456501581556322", "name": "Karen Patterson", "time": 1594611551200, "rating": 5.0, "text": "Super place too have work done on your car! Friendly, helpful staff and the work performed  is always priced reasonably and completed in a good time frame. I only have 1 vehicle so I can't wait several days or more for my car to be repaired. I've used Integrity for a couple of years now and am always satisfied with the quality of the work performed and the cost for same.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113490179763894716615", "name": "Chris Holmes", "time": 1591890932482, "rating": 5.0, "text": "This morning I dropped off my car at 9 by 1030 they had my oil changed and air fixed.  I was a walk in and was blown away by their customer service.  There was no profanity or nasty jokes that you typically hear at a shop. They truly live up to their name. They also fixed my blinker for free. Hands down best place to work on your vehicle. I want be going anywhere else from now on. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "103562021808295369602", "name": "Anthony Durante", "time": 1622816894434, "rating": 5.0, "text": "They do a real  good job!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "114470736595923645702", "name": "Beth Condit", "time": 1600280833868, "rating": 2.0, "text": "The people were very nice but we were charged over $1000 and we still had the issue when we picked the truck up. When we went back in they told us it was something else and would cost over $400 to get that repair done. They misdiagnosed the issue and wanted us to pay for another costly repair. I will not be using them again. They also did not disclose there is a 4% charge for using a credit card until after the repair was done.", "pics": null, "resp": {"time": 1600302077724, "text": "Not true at all. Your truck needed a new rack , alignment and brakes was gone on the front. I talk to your husband and told him after we fix the know problems we found you also needed a clock spring. And as far as the charge on the credit card company I also talk to your husband about that. Their are signs in the service department hanging and on back of the computes about credit card company.\nI'm sorry you feel the way you do. We could have fixed the clock spring but also talked to your husband about that.\nMy name is Robert I'm the owner of the shop I'm asking you to give me a call about this 2567354000\nWe can only fix what the customers allow us to fix.\nGood thing is still have front rotors and pads that was on truck and the rack also so your more than welcome to come see them."}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "109636035817345544086", "name": "Amber Jones", "time": 1582958345948, "rating": 2.0, "text": "We used them one time to get a radiator hose replaced. They told us they would also do a full inspection and call us to let us know if there was or wasn't anything else found. Never heard from anyone. Figured maybe they got busy and we just let it go. Just last week we figured let's give them another shot because the service was great last time.... My husband called to find out how much brakes and rotors would cost us and they told him they would call him back with that info.... We never heard from them. Customer service isn't the greatest. Friendly service in person. Just don't expect a call back.", "pics": null, "resp": {"time": 1583161554056, "text": "I'm sorry for not getting a call back. We are down 2 people in service department.  Can't find help. I know that is no excuse but I hope you come back and give us another chance.\nIf you have any other problems please call me Robert Taylor 256 735 6808 my personal cell"}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "104037884005103972276", "name": "Loris the win", "time": 1580474442163, "rating": 5.0, "text": "I went to integrity auto on yesterday because I was scared. I’m a single mom trying to provide for her family. This vehicle is my lifeline to work, food, church and pleasure. My engine light came on 11 days ago. I called them and the guy got me in there Immediately, took care of me ASAP, fixed the problem and sent me on my way. Christian based facility.... you guys and gals are God SENT!!! You rock.🤩🤩 I love me sum Integrity Automotive!!!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113519040564980256441", "name": "Susan Comperda", "time": 1601305596667, "rating": 5.0, "text": "Our van broke down In Cullman while traveling from Huntsville to Birmingham. We were lucky to stumble upon Integrity. The local Enterprise has closed down so we had to rent a Uhaul to travel to Birmingham. The owner happily drove us to the local Uhaul and his team got to work on our vehicle. Thank you for going above and beyond!", "pics": null, "resp": {"time": 1602681517787, "text": "Thanks for the kind words"}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "106608397956901324448", "name": "danielle johnson", "time": 1571410121926, "rating": 5.0, "text": "EXCELLENT CUSTOMER SERVICE!! Highly satisfied with my visit. As a woman, most shops will try to take advantage but not this place. Everyone, from the mechanics to the customer service desk, was so kind. The mechanics took the time to explain what needed to be done to fix my car and even showed me what was wrong. I really appreciated that. I had to stay at the shop while they fixed my car, they knew I needed to get home by a certain time and they made sure to get me back on the road in that time frame. I will never go anywhere else. My encounter with everyone who works there definitely lived up to the business name. Thank you Integrity!!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "109148432632154225680", "name": "Marilyn Stewart", "time": 1590752900504, "rating": 5.0, "text": "So thankful to find a trustworthy place for vehicle repairs.  Nicest people you could ever deal with. Quality work.  Will surely use for all repairs.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "114772139006624495426", "name": "Eric Trahan", "time": 1590799350693, "rating": 5.0, "text": "My car died on the interstate. I called them and they had it towed to the shop. Timing belt broke. They are going to replace the engine which is going to be expensive but they are working with me on that. Everyone I've talked to had treated me with respect and have been very pleasant. I'll update this review when I get my car back.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "111923116593138532465", "name": "Kelsie West", "time": 1585572986966, "rating": 1.0, "text": "My husband took his truck here explaining the problem to begin with, when it was dropped off. $3,400 dollars later and over at the least one month later and that problem was never fixed (was not told that until pickup today) along with after picking it up smoke came from the tail pipe and the air conditioner is not blowing cold even though they took it upon themselves to service the AC and charging $89 for that without notice. Neither of those problems were occurring prior to dropping it off. Needless to say, the truck was dropped back off to them within 30 minutes of pickup. We will be speaking with the so called mechanic on Monday. They also have problems with taking and returning calls. The only good thing I can say is that the owner Robert was nice and friendly. Let’s just see if they can make this right and I will come back and edit this post. But for now I DO NOT RECOMMEND THIS SHOP, PERIOD.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "103264852874076298757", "name": "Tiffani Johnson", "time": 1575567268301, "rating": 5.0, "text": "I can't say enough good things about this company! Awesome experience with them, they replaced front rotors and brake pads on our car. They were VERY honest through the whole process. Was in and out within an hour, they didn't gouge us either! Highly, highly recommend them for any of your automotive needs!", "pics": null, "resp": {"time": 1575571040125, "text": "Thank you so much and for your business to our shop."}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "116089505486807941455", "name": "The Smith’s", "time": 1594735790142, "rating": 1.0, "text": "Run! I took my car in for a noise on with my passenger side, water coming into my floorboard and ac not cooling. They charged my extended warranty over $1700 to redo my ac and I paid another $1200 for my front end work. The first week I had my car back it started making an awful noise. I took my car to another mechanic and he found that Integrity put no bolts in one of my brakes and it fell behind the caliber. The mechanic said he couldn’t believe I didn’t have an accident. I took it back in 6/15 due to the ac pouring water and still having a front end noise. They had my car until the afternoon of the 19th and said they had everything fixed. We left for vacation the 20th and half way to our destination the ac started pouring water in the passenger floorboard when it’s on. I’ve had my car back since the 19th of June but it’s sat in my barn the past 3 weeks. My transmission light is now on and it won’t shift gears. I had ABSOLUTELY NO problems with my transmission prior to my car going there and my AC now leaks constantly. I’m to the point of getting an attorney. I saw it was a veteran owned business and being that my husband is a veteran as well, I thought it would be great to support them. This is the biggest mistake I could have made.", "pics": null, "resp": {"time": 1594814170481, "text": "Fake customer"}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "108444714933658089969", "name": "James Turner", "time": 1593016754656, "rating": 5.0, "text": "Was exactly what mechanic said it was no more...very reasonably priced no hassle  in and out very pleased with time line will do all my work there", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "116196028868161014469", "name": "James Bice", "time": 1589678151959, "rating": 5.0, "text": "They did an outstanding job working on my car they got it running right and did an oil change and time up plus the best part they came in on a Saturday morning when they was closed just to work on my car now that is customer service they will always have my business", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "108320762845515347422", "name": "South Cullman", "time": 1570026693998, "rating": 5.0, "text": "I normally am very picking about my car. I brought it up there on my lunch break to have my oil changed and they got my car straight back. I was pleased with the service. Everyone was VERY friendly. Doug at the desk talked to me on the phone and had the guy waiting for me to get there. He was super polite when I got there and made sure everything was taken care of. The guy that changed my oil was very friendly. I felt right at home. Great place overall. All the guys in the shop are great!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "106612345036299403609", "name": "Brittany Sterling", "time": 1617407997783, "rating": 1.0, "text": "My husband used this place and they are very rude and unprofessional !", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "100115261399114892742", "name": "Garrett Bowers", "time": 1569983818786, "rating": 5.0, "text": "Had my daughters 01 explorer fixed by Doug canter and the guys at integrity auto a few months ago. Car runs like a top would recommend this company to anyone. Fair price and great service", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "106573828271238136973", "name": "Greg Talks", "time": 1570034149148, "rating": 5.0, "text": "These guys took my car that I thought couldn’t be fixed inside their body shop and made it look like new! They were able to use a lot of the same parts so I didn’t have to spend a lot of money for new parts. They’re fast, efficient, and economical!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113065218356124908278", "name": "Tammy Allums", "time": 1591213207007, "rating": 5.0, "text": "I have used them several times and they always take me on short notice and get me in and out in a reasonable time. They are very nice and pleasant to deal with.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113131351401105436597", "name": "Bobby Hudson", "time": 1570119557762, "rating": 5.0, "text": "No matter what problem big or small I am having with any of my vehicles, Ryan and Doug have always came through for me and even the mechanics help explain the problem and the solution for it. I recommend these guys to anyone especially my friends and family because I know all the guys at Integrity will treat them with respect. Honest service writers and mechanics that truly live up to the name Integrity Auto Group", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "107606174768426633402", "name": "Lisa Bates", "time": 1591330180973, "rating": 5.0, "text": "Very very friendly people. I will only take my car to them from now on. Great service they all make you feel at home.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "101012738491177297458", "name": "SFW CEO", "time": 1569792323955, "rating": 5.0, "text": "A company for the community! We use them for all our work on the vehicles we have donated. Robert Taylor Jr. Is a standup guy and loves giving back to his customers and community!\n\nThere paint and  body shop have some of the best in the business painting small cars, restores and big rigs! They have one of our jeeps painting it now and have done a great job!!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "109021648925326872878", "name": "Stephanie Hill", "time": 1582327739429, "rating": 5.0, "text": "Great place for all your car's needs! Ask for Dixie! She is awesome! Will help you with anything you need! Love her!!❤❤", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "102011626655809480553", "name": "Alicia Powe", "time": 1583450092035, "rating": 5.0, "text": "Integrity treated my parents exceptional by helping repair their 2010 Chey Equinox. After several attempts to fix it at other places, Integrity fixed the transmission with a 1 year warranty and replaced a bad axel.  Providing financing and everyone was extremely friendly😊Thank you Integrity! 🙌 💯", "pics": null, "resp": {"time": 1583460293847, "text": "Thank you. Your mom and dad we sweets hearts"}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "101374140641377567890", "name": "tommy smith", "time": 1578443308872, "rating": 1.0, "text": "Had my car at Integrity Auto for 4 days at $493. Picked it up after hours and when backing out of the parking spot, realized it was doing exactly what I brought it to the shop for. Took it to another mechanic shop who within an hour told me what was wrong with it and it did not need the parts that was put on. So $493 in unnecessary parts. Tried numerous times to talk with them about this but can’t seem to get a return phone call. Bad thing is I actually have known and used them for a long time but not anymore. I bet my phone will ring now.", "pics": null, "resp": {"time": 1579566048335, "text": "Talk talk with Tommy and this has been took care of."}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "107608792829790372440", "name": "Samantha Best", "time": 1570024527856, "rating": 5.0, "text": "Best service in town. They get you in and out in no time. Very friendly honest and reliable people. Please go see them for all your repairs,I promise you will be satisfied that’s a guarantee.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "105634541545585913955", "name": "Annette Munger", "time": 1588116712230, "rating": 5.0, "text": "Thank you to the guys at Integrity! You made my life easier by coming and getting my truck for brakes and tires.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "105792025709245880648", "name": "Elizabeth Speegle", "time": 1570306129312, "rating": 5.0, "text": "We have used Integrity on several occasions. Fast response time. Gentlemen are helpful and have car back to you in a reasonable time table... Helpful owner and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113781800995312981559", "name": "Amy Canter", "time": 1570223232098, "rating": 5.0, "text": "This place is amazing! They were able to work me in with a short notice for my air conditioning. One thing I noticed was that 3 women came in behind me and they were great with them and didn’t try to overcharge them. I will be back!!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113768169355454440565", "name": "Judy Lowery", "time": 1590092732385, "rating": 5.0, "text": "Honest and GREAT service. Friendly people from the owner to the employees   I will only take my car to them", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "108320142077145027575", "name": "Tim Bliss", "time": 1580951258541, "rating": 5.0, "text": "This place is great!! They offer the best personalized service at the absolute lowest price.", "pics": null, "resp": {"time": 1580954974171, "text": "Thanks Tim please help us get the word out about Integrity Auto Group"}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "104785464287261436677", "name": "Heather O'Rear", "time": 1569984038282, "rating": 5.0, "text": "Great shop with great people.  Big shout out to Doug for explaining everything and giving best prices he could! Will recommend to friends and family!!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "102941823268649512013", "name": "Tanya Lynn", "time": 1589374679077, "rating": 5.0, "text": "Very nice and very helpful. Will definitely use them again!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "102126227903431085795", "name": "Christopher Sumners", "time": 1583874268824, "rating": 5.0, "text": "This is the best place in Cullman. If you know what you need done or need help to figure it out. Integrity got it for you.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "111276965054065646121", "name": "Misty Teets", "time": 1587818461439, "rating": 5.0, "text": "I called on a Thursday evening he fit me in on Friday installed a water pump and thermostat for me at a great price and an amazing turn around team I recommend these guys hands down and will be using them again", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113096537095453174017", "name": "Nicole Jett", "time": 1587233553191, "rating": 5.0, "text": "These guys go above and beyond to provide excellent service at a reasonable price.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "111006243486838453858", "name": "Aj Rapper", "time": 1579624376277, "rating": 5.0, "text": "They have excellent customer service...fast in friendly in they will work with you to get the job done.definetly are out go to place for all our car needs", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113409776231396598981", "name": "Visual Lacey", "time": 1570027645002, "rating": 5.0, "text": "Great group of guys to work on any of your vehicles. They Always get me what I need for less than anyone else around, and always get me in immediately with no wait. Couldn’t say better things about this business!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "117402509284642254613", "name": "Integrity Auto Group", "time": 1569689853900, "rating": 5.0, "text": "This place is the best . Always the best service and price in Cullman. Transmission service and rebuild is out of this world.\nVery Honest they don't try to up sale you on everything.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "102481278105347684800", "name": "Richard Jones", "time": 1591314548929, "rating": 5.0, "text": "I cant see taking my vehicles anywhere else! Always prompt friendly service with very reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "101482812789613436512", "name": "April German", "time": 1570107308818, "rating": 5.0, "text": "Honest people and great place to bring your car! Does a lot for our community as well. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "109419204410439633610", "name": "Rhys Battles", "time": 1570024280737, "rating": 5.0, "text": "Friendly service. Goes beyond what the customer expects. I know the owner and many of the workers have stayed well past 5 to help the customer get where they need to go", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "118241204465395016155", "name": "Nakki Kane", "time": 1569982539806, "rating": 5.0, "text": "Doug Canter is amazing, especially for younger females that don’t know anything about mechanics. He did an excellent job at explaining things in terms that I could understand without making me feel dumb. I couldn’t recommend a better person to see for all things vehicle related.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "107983955367686521206", "name": "Brandy Hayes", "time": 1570059308519, "rating": 5.0, "text": "Great honest and dependable shop. They have done all the repairs to our 2 vehicles. I wouldn’t recommended anyone else!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "117655877852396495372", "name": "Hannah Stewart", "time": 1571915942599, "rating": 5.0, "text": "Very very nice people will break their back to help anyone in need! They’ll work around and try to actually help you! I highly recommend them!!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "118165667113133082860", "name": "Amy Glimpse", "time": 1583259850633, "rating": 5.0, "text": "Friendly and courteous service... Thanks for a job well done!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "111334677080284608874", "name": "Kim Carwell", "time": 1570031517503, "rating": 5.0, "text": "Integrity, has been great for me as a female it is hard for us to find a shop that will be honest.  I recommend Integrity, to all females and veterans it has been great for me and I would go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "106192196530578669948", "name": "Marie Arwood", "time": 1572544591920, "rating": 5.0, "text": "I’m proud that Mr Taylor made the decision to allow his employees to enroll in Aflac! It really shows he cares about his employees and business.\nI would most definately recommend Integrity Auto Group for all your automotive needs!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "110277180598036231722", "name": "Rachel Pace", "time": 1578329949073, "rating": 5.0, "text": "Very friendly and honest group. Will definitely come back", "pics": null, "resp": {"time": 1578355322070, "text": "Thank you"}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113679084727670014001", "name": "Kelly Best", "time": 1569850614614, "rating": 5.0, "text": "Thank you integrity Auto group for fixing Renee Beasley's car and getting her back on the road y'all done a fantastic great job", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "117427242223950481440", "name": "Kesha Sandlin", "time": 1569982471015, "rating": 5.0, "text": "They did a customer appreciation day over the summer an i got a free oil change Doug had me in an out in no time", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "117153234213934009171", "name": "Local 360", "time": 1578434819127, "rating": 5.0, "text": "Great job changing plugs & distributors quickly & within budget on my Ford F150", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113224337498794965676", "name": "Daniela Bartlett", "time": 1591052716440, "rating": 5.0, "text": "Love these guys. Always accommodating and professional!!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "105399515709526425627", "name": "Mandi Easterwood", "time": 1579364834017, "rating": 5.0, "text": "My husband and myself both have had our brake pads and rotors replaced here. Excellent  and friendly  service.Also received excellent customer service from Dixie Hall.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "108986498321698519941", "name": "Tripp Taylor", "time": 1569790859146, "rating": 5.0, "text": "Great place to take your vehicle! Great customer service and lowest prices!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "102931522824334837529", "name": "Michael Doc Elston", "time": 1573481560143, "rating": 5.0, "text": "A very polite and skilled group of mechanics. I will be returning here.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "106024784551230112935", "name": "misty cason", "time": 1570025692220, "rating": 5.0, "text": "They are great people and are very friendly and will do everything they can to help u..", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "111908320358589504600", "name": "Doug Canter", "time": 1569983409239, "rating": 5.0, "text": "Great people are and amazing service would definitely recommend them to everyone!!! Owners and management are very Knowledgeable and helpful", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "115816539227281313073", "name": "Troy McGraw", "time": 1570035575816, "rating": 5.0, "text": "Great people, great service, with honest and fair pricing.\nYou won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "106461401980471674748", "name": "Ashley Payne", "time": 1570024336110, "rating": 5.0, "text": "The mechanics are amazing along with the rest of the staff! Very friendly and know exactly what they're doing.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "106552993956676200235", "name": "Dustin Miller", "time": 1570024153556, "rating": 5.0, "text": "Coustomer service is great! They work hard to get you exactly what you need!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "106365428380451355165", "name": "jason hills", "time": 1570550950760, "rating": 5.0, "text": "Honest and veary nice great prices couldn't have ben more pleased.\nTHANK YOU", "pics": null, "resp": {"time": 1570795676970, "text": "Thank you"}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "110025072465034838684", "name": "Brandy Thrasher", "time": 1580492438152, "rating": 5.0, "text": "Great experience ! Oil change was quick and very reasonably priced .", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "115974832361822624266", "name": "Chrislandon Orear", "time": 1569984623570, "rating": 5.0, "text": "Doug Canter had us in and out in no time. Would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "117650059027011101094", "name": "Joseph Bell", "time": 1580491499120, "rating": 5.0, "text": "Great service and friendly staff, got me in quick and work was high quality", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "105866118992795814299", "name": "Amanda Treptau", "time": 1570024329921, "rating": 5.0, "text": "A great place to take your vehicle for quick service at a great price!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "114887088938738910177", "name": "Nancy Yeager", "time": 1570047247393, "rating": 5.0, "text": "Great service awsome company  they go above and beyond in customer service", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "105707567619963328212", "name": "Christy Miller", "time": 1570024270066, "rating": 5.0, "text": "Best service around Cullman! They stop at nothing to get your car working again!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113611870001800427685", "name": "Mike Pritchard", "time": 1569690089306, "rating": 5.0, "text": "Great place for any Automotive needs. Mechanical,  Used cars, Auto Body repair.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "112280169382451097879", "name": "Lynn Jones", "time": 1591216673608, "rating": 5.0, "text": "Everyone was very helpful!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "103703766848301265797", "name": "J. Lewis", "time": 1588796503278, "rating": 5.0, "text": "Quick, professional service.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "109293963557210445187", "name": "Michael Aderhold", "time": 1609448351023, "rating": 5.0, "text": "Good", "pics": null, "resp": {"time": 1609802858060, "text": "Thank you for using integrety Auto Group LLC"}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "104330528392297883859", "name": "Lashonna Gaither", "time": 1570024201401, "rating": 5.0, "text": "10/10 they are the best!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "109023016065128863661", "name": "Paul Chaney", "time": 1573877257526, "rating": 5.0, "text": "Best repair shop in Cullman", "pics": null, "resp": {"time": 1574028678750, "text": "Thank for your business to our shop."}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "115160147402324469008", "name": "jennifer heinl", "time": 1570035145215, "rating": 5.0, "text": "Love this place and the owners!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "103628677169676611593", "name": "Robert Taylor", "time": 1591896989912, "rating": 5.0, "text": "Best in the business", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOBUFrf_qj4VLRYymWVOec0MfoHndU2OaypIZm3=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "105192744677159847050", "name": "Cassandra Hernandez", "time": 1582233485610, "rating": 5.0, "text": "Hard worker's", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "103326873548385790007", "name": "Larry Smith", "time": 1628980118311, "rating": 5.0, "text": "Wonderful experience. Quick and knowledgeable", "pics": null, "resp": null, "gmap_id": "0x8889dd4167905b3f:0xe8f273705679bfb7"}
{"user_id": "109231710350691832377", "name": "Jon Stockton", "time": 1618069732775, "rating": 5.0, "text": "Don couldn’t have been a more helpful person.", "pics": null, "resp": null, "gmap_id": "0x8889dd4167905b3f:0xe8f273705679bfb7"}
{"user_id": "107284626173831665125", "name": "Ivan Westmoreland", "time": 1610309587970, "rating": 5.0, "text": "Good work fair prices", "pics": null, "resp": {"time": 1614389369940, "text": "We try!! Thanks"}, "gmap_id": "0x8889dd4167905b3f:0xe8f273705679bfb7"}
{"user_id": "103111491086071604511", "name": "Sandra", "time": 1543877039314, "rating": 5.0, "text": "Don does great work and is fair and stands behind his work.  I take all my vehicles to him that need fixing.  I trust him and happily refer him to other’s with confidence!", "pics": null, "resp": {"time": 1614389570029, "text": "Thanks and Your welcome"}, "gmap_id": "0x8889dd4167905b3f:0xe8f273705679bfb7"}
{"user_id": "111033518448034880015", "name": "Benny Pendergrass", "time": 1550464161100, "rating": 5.0, "text": "I've used on shop for many years now and he keeps on doing good work he backs up off his work and he buys the parts he backs up the parts cancel better people they get on it and knock it out you'll be back on the road with no worries to worry about if it's going to break back down with the same issues or not cuz he will take care of it did you have machine made it and he's very very responsible I trust you with my life beautiful are very very good people", "pics": null, "resp": {"time": 1614389535783, "text": "Your Welcome  Thanks"}, "gmap_id": "0x8889dd4167905b3f:0xe8f273705679bfb7"}
{"user_id": "108878197357468775228", "name": "Ginny Caspar", "time": 1614572389389, "rating": 5.0, "text": "UPDATE: Been going there for 20 years now, still wouldn't go anywhere else!!!!\nDon is as honest as the day is long. They have been working on all of our vehicles for the past 16 years. They do good work and stand behind it at a fair price. I couldn't ask for a better couple of guys to deal with!!!!", "pics": null, "resp": {"time": 1614389620681, "text": "Your Welcome"}, "gmap_id": "0x8889dd4167905b3f:0xe8f273705679bfb7"}
{"user_id": "105503528904918502050", "name": "Michael Rogers", "time": 1576898661737, "rating": 5.0, "text": "Will repair the vehicle right the first time at reasonable prices.", "pics": null, "resp": {"time": 1614389431263, "text": "Thanks"}, "gmap_id": "0x8889dd4167905b3f:0xe8f273705679bfb7"}
{"user_id": "107421872322375746044", "name": "Jennifer Grindle", "time": 1557163357090, "rating": 5.0, "text": "All my automobiles get good care and I get informed of all issues along with cost before work begins.", "pics": null, "resp": {"time": 1614389462178, "text": "Thanks"}, "gmap_id": "0x8889dd4167905b3f:0xe8f273705679bfb7"}
{"user_id": "116826636663415242378", "name": "Robert Adams", "time": 1627916773827, "rating": 1.0, "text": "No one answered the phone or return my call", "pics": null, "resp": null, "gmap_id": "0x888c29ab72f4171b:0x1333bf91edc5cc2"}
{"user_id": "106395184803342544126", "name": "William Quillin", "time": 1581102578773, "rating": 3.0, "text": "Very slow. I was promised the truck on Monday, then Wednesday, then Thursday, and finally picked it up on Friday. The cost was more, by almost $100, than the estimate I had been given. Good work, but slow. I never received a call about the truck except when told the problem and the estimate.", "pics": null, "resp": null, "gmap_id": "0x888c29ab72f4171b:0x1333bf91edc5cc2"}
{"user_id": "100742946431314626322", "name": "Jimmy Sharpe", "time": 1616084189552, "rating": 5.0, "text": "Good folks", "pics": null, "resp": null, "gmap_id": "0x888c29ab72f4171b:0x1333bf91edc5cc2"}
{"user_id": "111683350435002035241", "name": "James McCain", "time": 1544320503309, "rating": 1.0, "text": "You drop your car off seven or eight days later no one calls you they tell your car is done and it cost $2000 to fix they fix my car with no approval I said OK paid the bill picked it up less than 10 days later I start to hear funky noise like something is loose then transmission fluid starts pouring all out of it  end it won’t move they send a wrecker after it same thing car sits there for almost 4 weeks no one calls me tells me the car is done I come to pick it up drive home put about 400 miles on it guess what car won’t move call him they tell me to bring it in don’t even offer it to tow it back wake they came and got it finally Repeated the same thing 3Weeks later I called to check on my car how they say it’s ready to go said they had a fluid leak told me that park the car out front I come to pick it up it’s dark and raining guess what the car won’t start won’t crank nothing popped the hood the negative battery cable was loose reconnect it car still is dead as a hammer. It’s late it’s dark come back the next day car won’t even jumpstart the battery is so dead go to get a battery put a battery in it started and the emergency brake light won’t go off like they adjusted the emergency break wrong drive it home will never go back oh by the way when I went to pick it up the driver side floor board was full mud . Don’t take your car there", "pics": null, "resp": null, "gmap_id": "0x888c29ab72f4171b:0x1333bf91edc5cc2"}
{"user_id": "110681694615864249043", "name": "Leah Autumn", "time": 1481752910864, "rating": 5.0, "text": "I contacted Alabama Precision Transmission to get an estimate on a new transmission for my Nissan. I spoke with Michael (Mike) and he worked hard and got me the best deal possible! He went above and beyond to get me what I needed and I would never go anywhere else!", "pics": null, "resp": null, "gmap_id": "0x888c29ab72f4171b:0x1333bf91edc5cc2"}
{"user_id": "115651930909017596249", "name": "Marshall Mims", "time": 1561569490677, "rating": 5.0, "text": "Great guys to work with, great attention to detail and take pride in their work.", "pics": null, "resp": null, "gmap_id": "0x888c29ab72f4171b:0x1333bf91edc5cc2"}
{"user_id": "117113097535329156723", "name": "Kaitlyn Shotwell", "time": 1501958074437, "rating": 2.0, "text": "My car broke down about 20 miles south of Montgomery, and the Firestone on Maxwell AFB recommended this place as a reputable transmission specialist. My first impression walking in was not favorable, as the owners smoke indoors and it is not well maintained. I would say the highlight of this place is the employees, because they were super helpful and polite as my car was put into the garage. Be careful if you have insurance; once I brought up that my insurance might cover the work, the owner got really shady and kept telling me that it wasn't a good idea to contact my insurance company. I ended up leaving my car here for about a week and I heard no updates from the store and they wouldn't answer any phone calls. I decided I didn't want to conduct business with these folks anymore. When I finally got the owner on the phone, he protested that the job would cost me about $6,000, but calling around and showing the invoice to other mechanics in the area, they told me they would do the same job for about $4,000. I ended up having the car towed to the dealership because of the bad vibes I got with APT.\n\nIn summary, I cannot attest to their expertise fixing the car, but I definitely didn't like their low level of professionalism. Two and a half stars.", "pics": null, "resp": null, "gmap_id": "0x888c29ab72f4171b:0x1333bf91edc5cc2"}
{"user_id": "115888469935692872552", "name": "Tara Goode", "time": 1535629394018, "rating": 1.0, "text": "Take forever to fix your car.", "pics": null, "resp": null, "gmap_id": "0x888c29ab72f4171b:0x1333bf91edc5cc2"}
{"user_id": "105553501341054484587", "name": "Jerry Campbell", "time": 1506609690686, "rating": 5.0, "text": "EarIier this year I had a 1987 S10 with a 350ci worked on for worked on for 30+ minutes  and was charged zero.  Dennis Morgan the service manager said the mechanic was unable to  improve it but also stated what needed to be done and if I needed them to let them know.  Thanks Dennis Morgan..\n\nIn August I returned with the same auto after someone else worked on it. They did the fine tuning for $25.50.  I should have used them for the complete repair instead of wasting alot of money and time? A very costly mistake on my part.\n\nThanks Dennis Morgan (Manger) and Jesse Simmons (Mechanic)\n\nI would use them again and highly recommend them to anyone who wants to be treated fairly and needed help at a very fair price! They let you make the decisions and apply no pressure to get yor business! Its very hard to find a business like that today!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPD_R7PD_IMG9Tx5azbX6dl1BGDKPxongW7pvcP=w150-h150-k-no-p"]}], "resp": {"time": 1506707817465, "text": "Thanks for the high recommendation, Jerry. Happy we were able to help. Don't hesitate to reach out anytime you need our assistance again. All the best. - David Below"}, "gmap_id": "0x8889ccf82805caaf:0x6f066d07c152c23b"}
{"user_id": "103598867977267777121", "name": "Greg Howard", "time": 1521466320876, "rating": 5.0, "text": "I had a car emergency and limped in to their shop early Monday morning. Greg was already there and welcomed me in even though they were not open yet. Greg and the entire staff were friendly and professional. The facility was incredibly clean, both the shop and showroom. I do not hesitate recommending them.", "pics": null, "resp": {"time": 1521655997861, "text": "I'm so glad we were able to help you out with your car, Greg. My team does their best to make sure our customers are well taken care of and that our work stays fast and exceptional. Thanks for the awesome rating, and if you ever need anything else we're here for you! -David Below"}, "gmap_id": "0x8889ccf82805caaf:0x6f066d07c152c23b"}
{"user_id": "111800943912893851213", "name": "Andi Dover", "time": 1498913036485, "rating": 1.0, "text": "He ruined my vehicle!!!! Service manager made me feel 1 inch tall! But he does have a cute nice helpful wrecker driver named Earl!! I wish he was not taken.", "pics": null, "resp": {"time": 1499364223169, "text": "Andrea, thanks for the review. We're sorry to hear you weren't too pleased though. We will look into this. -David Below"}, "gmap_id": "0x8889ccf82805caaf:0x6f066d07c152c23b"}
{"user_id": "104384251011125311768", "name": "Gene Simmons", "time": 1498186847958, "rating": 5.0, "text": "I was taking a trip from Florida to Kentucky and below car clinic treated me and my mother like family even though we had never met. I needed a helicoil done when my spark plug blew out of the head and Wesley took care of it on his lunch break so we would be on our way. They even went and got us lunch while we waited. The world needs more amazing honest people like them. Best experience I've ever had with any auto repair shop. 5 stars all day long", "pics": null, "resp": {"time": 1498766222448, "text": "Gene, we're so glad you were pleased with the service we provided to you while you were on your trip. It's never good to have an issue -- especially when you're away from home. We hope you're doing well! -David Below"}, "gmap_id": "0x8889ccf82805caaf:0x6f066d07c152c23b"}
{"user_id": "111044646241569480395", "name": "Kevin Turan", "time": 1496489006931, "rating": 5.0, "text": "Very helpful, great prices, and they don't try to pressure you by keeping you there all day and wearing you down. I'd recommend Below Car Clinic to anyone looking for a vehicle or needing work done on one.  If you are tired of be mistreated try this place.", "pics": null, "resp": {"time": 1496771816425, "text": "Kevin, thanks for the great review! We're so glad you were pleased with our prices and service, too. Come back again soon! -David Below"}, "gmap_id": "0x8889ccf82805caaf:0x6f066d07c152c23b"}
{"user_id": "115472504094013507442", "name": "John Phillips", "time": 1533776035405, "rating": 4.0, "text": "I recommend Below Car Clinic to anyone who needs automotive work done. They know what they're doing and they will always stand behind their work. Below Car Clinic is no longer open for business.", "pics": null, "resp": {"time": 1488228550069, "text": "John, thanks for choosing us! We're so glad you had a great experience with us and found us easy to work with. We hope you choose us again in the future! -Thank you, David Below"}, "gmap_id": "0x8889ccf82805caaf:0x6f066d07c152c23b"}
{"user_id": "110110528211998838582", "name": "Jimmy Akers", "time": 1487610895989, "rating": 5.0, "text": "Fantastic service and helpful staff.I would advise  any one needing mechanical help to go here first.", "pics": null, "resp": {"time": 1487620911717, "text": "Thank you Mr. Akers. We hope to see you back here again!"}, "gmap_id": "0x8889ccf82805caaf:0x6f066d07c152c23b"}
{"user_id": "100083429892256026413", "name": "Misty Goodlett", "time": 1515614059421, "rating": 5.0, "text": "Very honest and informative. Will never go anywhere else again.", "pics": null, "resp": {"time": 1515761250864, "text": "We appreciate the stars! Honest and informative is the only way to do it. Don't hesitate to reach out anytime you need our services. - David Below"}, "gmap_id": "0x8889ccf82805caaf:0x6f066d07c152c23b"}
{"user_id": "100252881721812681611", "name": "David Nelson", "time": 1520443236349, "rating": 5.0, "text": "Great quality service!", "pics": null, "resp": {"time": 1520520046386, "text": "David, you're the best. Thanks for your review. We're here for you anytime you want another hand. -David Below"}, "gmap_id": "0x8889ccf82805caaf:0x6f066d07c152c23b"}
{"user_id": "108292955521927670033", "name": "Misty Michelle Robinson", "time": 1527111703075, "rating": 4.0, "text": "Nice people, good service", "pics": null, "resp": {"time": 1527175998588, "text": "Thanks for the high rating, Misty. We appreciate the support. If we can ever lend a hand again, let us know. -David Below"}, "gmap_id": "0x8889ccf82805caaf:0x6f066d07c152c23b"}
{"user_id": "116594522268122963034", "name": "Tracey Bailey", "time": 1512234064563, "rating": 5.0, "text": "Nice people to work with", "pics": null, "resp": {"time": 1512662578663, "text": "We’re happy we could help out, Tracey. Thank you for your support. Don't hesitate to reach out if you ever need anything. -David Below"}, "gmap_id": "0x8889ccf82805caaf:0x6f066d07c152c23b"}
{"user_id": "112421529603241281959", "name": "Misdom Kritner", "time": 1532044931588, "rating": 4.0, "text": "Good work", "pics": null, "resp": null, "gmap_id": "0x8889ccf82805caaf:0x6f066d07c152c23b"}
{"user_id": "105811657102333484395", "name": "Richard Lynch", "time": 1531253614881, "rating": 1.0, "text": "Not in business anymore", "pics": null, "resp": null, "gmap_id": "0x8889ccf82805caaf:0x6f066d07c152c23b"}
{"user_id": "109566530114305587140", "name": "Tiffany Walls", "time": 1585074038544, "rating": 5.0, "text": "I absolutely ADORE Brian and Tammy! They have serviced my Hyundiai Tucson as well as a second vehicle for our family. In August 2019, I had my AC compressor replaced. I had shopped around some other businesses (including Firestone, which I would NEVER recommend) and I was quoted a far more reasonable price for parts and labor through Brian's. Brian took the time to diagnose my issue, explain what he would do to my vehicle, how the part worked and why the part that needed replacing wasn't working properly. After the repair, Brian took the time to have me look and listen to the new part, showed me the broken part before he disposed of it and even gave me some insight to another belt that may need replacing at a certain point. They won us over with their communication, responsiveness, kindness and honesty. They have customers for life because they did such a stellar job! Wonderful experiences at this shop!", "pics": null, "resp": null, "gmap_id": "0x88892f98fbfe4b37:0x4a00948aa39e24f1"}
{"user_id": "117365224911827822327", "name": "Ethan Lake", "time": 1552668288194, "rating": 5.0, "text": "Absolutely the best experience I have had with a mechanic. I called several of the places around to see if I could bring my truck by and this was definitely the friendliest of them. Tammy answered my phone call and was beyond helpful. I instantly took the truck by and Brian greeted me as soon as I arrived. For the first time, a mechanic (Brian) actually took the time to hear me out and see what I thought the issue was. He checked various things in the truck and under the hood. He did a little tinkering and sent me on my way with no more problems! I will definitely be back, and for anyone else new to this area and looking for a place to get your vehicle fixed, go see Brian!", "pics": null, "resp": {"time": 1553892341932, "text": "Thank you Ethan!  We appreciate your review and look forward to helping you in the future."}, "gmap_id": "0x88892f98fbfe4b37:0x4a00948aa39e24f1"}
{"user_id": "111010473174855540593", "name": "john chafton", "time": 1576701005074, "rating": 5.0, "text": "Highly recommend Brian's Automotive, Tammy and Brian are wonderful people and they take the time and listen to you. I have a 2004 Chevy Silver ado 4 wheel drive and he has changed the transmission for me and some other work and he does great work. He does stay busy so he may have to keep your vehicle a little longer than normal but its worth it. Thanks Tammy And Brian.", "pics": null, "resp": null, "gmap_id": "0x88892f98fbfe4b37:0x4a00948aa39e24f1"}
{"user_id": "114852929771499984310", "name": "Bubba Holsomback", "time": 1559332207187, "rating": 5.0, "text": "Brian is a great person first off and very honest. I highly recommend him. He’s gonna tell you EXACTLY what’s wrong with your car, but he also explains it to you in a way you can understand. Then will explain what’s going on, and what’s  being done to fix it.", "pics": null, "resp": null, "gmap_id": "0x88892f98fbfe4b37:0x4a00948aa39e24f1"}
{"user_id": "107959425474457228167", "name": "Mike McKenna", "time": 1522167401919, "rating": 5.0, "text": "I took my 1994 Chevy Z71 to Brian to fix a broken manifold bolt on the back passenger side. Very professional and knowledgeable with excellent follow up. He kept me posted and went over and above my expectations at a reasonable price. I will not hesitate to bring my other vehicles to Brian.", "pics": null, "resp": {"time": 1522179961157, "text": "Mike, we appreciate the opportunity to work on your truck.  We also appreciate the very kind review. Thank you!"}, "gmap_id": "0x88892f98fbfe4b37:0x4a00948aa39e24f1"}
{"user_id": "106649051700618223594", "name": "Dean Shirley", "time": 1495036965728, "rating": 5.0, "text": "Went to Brian by recommendation of a friend.  I have to say that may have been my best experience with a Mechanic.  He takes great pride in what he does and he treats people above and beyond friendly.  He is super easy to work with and doesn't try to add on extra expenses if not needed from a safety standpoint.  I would recommend Brian hands down!", "pics": null, "resp": {"time": 1505490383996, "text": "Thank you for the great review Dean!  We are so glad you found us."}, "gmap_id": "0x88892f98fbfe4b37:0x4a00948aa39e24f1"}
{"user_id": "105986132755786066605", "name": "Stephen M", "time": 1497414354495, "rating": 5.0, "text": "What a great place for car repair.  The owner Brian is straight forward and really knows his stuff.  I've been back several times now for scheduled maintenance on both my cars and am still amazed at the knowledge and  customer service he provides.  Thanks!", "pics": null, "resp": {"time": 1505490083146, "text": "Thank you Stephen.  We appreciate your kind words and your business!"}, "gmap_id": "0x88892f98fbfe4b37:0x4a00948aa39e24f1"}
{"user_id": "102959050326545779900", "name": "Christopher (Kyle) Smith", "time": 1519688720886, "rating": 5.0, "text": "Excellent Mechanic! Brian rebuilt the top-end of my LS1 1994 Corvette. Not an easy rebuild due to the age of the car and the multitude of aftermarket performance parts on the Corvette. Brian overcame the obstacles with minimal part replacement and returned me an amazing product. Trusted and proven recommendable service.", "pics": null, "resp": {"time": 1522093897125, "text": "Thank you for allowing us to rebuild your LS1 1994 Corvette!  I enjoyed the process and we appreciate your business."}, "gmap_id": "0x88892f98fbfe4b37:0x4a00948aa39e24f1"}
{"user_id": "117927945024774378386", "name": "Javier Sagastume", "time": 1518314325170, "rating": 1.0, "text": "Brian spends too much time bad mouthing \"glorified parts changers\" on Facebook or in person. In reality a Ford 6.0 diesel full engine rebuild was too big for him. I went to A2 Brothers Auto Service in Alabaster and they got it done in no time without talking smack about other shops like Brian does.", "pics": null, "resp": {"time": 1522089065070, "text": "This is a false review.  We have never quoted this work to this person."}, "gmap_id": "0x88892f98fbfe4b37:0x4a00948aa39e24f1"}
{"user_id": "109159023093837698321", "name": "David Seelbinder", "time": 1523391453918, "rating": 5.0, "text": "Great experience, trust Brian, very nice and knowlegeable!", "pics": null, "resp": null, "gmap_id": "0x88892f98fbfe4b37:0x4a00948aa39e24f1"}
{"user_id": "118009390950785014946", "name": "Louie Faulkner", "time": 1517076778058, "rating": 5.0, "text": "Very knowledgeable and polite.", "pics": null, "resp": {"time": 1517247149070, "text": "Thank you for the kind words."}, "gmap_id": "0x88892f98fbfe4b37:0x4a00948aa39e24f1"}
{"user_id": "112336990631315821184", "name": "Timothy Jarmon", "time": 1612844167991, "rating": 5.0, "text": "The best service! Dependable,  reliable,  trustworthy! Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x888bb1611b6d8b63:0xd429fd11cc382e9c"}
{"user_id": "101781299822579549817", "name": "Zavier Cordova", "time": 1606400164826, "rating": 1.0, "text": "At first glance everything seemed to be going well, but then out of nowhere more things needed to be fixed, the original price for the items started increasing and the time of the repairs took too long. I would not recommend this place to anybody.", "pics": null, "resp": {"time": 1612956778218, "text": "This vehicle was brought in not running with a blown engine. Installed good used motor, ran fine no power, catalytic converters were plugged. Advise customer and tried to find her two good used cats, because she couldn't afford new. Finally found to good used cats. Test drove car and it vibrated violently was un drivable.  She said she really had to have car an test drove it. Brought car back with right inner fender well ripped out of car? She said fix car. I put car on lift and found that someone tried to weld in ujoints? They have to be machine pressed.  I told her she needed a whole driveline. She squabbled alot and finally said I have no choice go ahead. I found her a good used driveline from California and when it came in I Installed it and she was able to pick up a good driving car! Everything was done right each step i had to make nothing i could of done differently!"}, "gmap_id": "0x888bb1611b6d8b63:0xd429fd11cc382e9c"}
{"user_id": "106068324346189349787", "name": "T.C. Hill", "time": 1557435354874, "rating": 5.0, "text": "I've used and my Family uses M&D. We've had no issues. I recommend M&D to ALL my friends an coworkers. He charges less than ANY shops in the area and does honest, qualiry work in a reasonable time frame.  You don't believe me get on the phone, get a estimate. See what else the other shops \"Find while under the hood\".  No I will stick with M&D.", "pics": null, "resp": null, "gmap_id": "0x888bb1611b6d8b63:0xd429fd11cc382e9c"}
{"user_id": "105664671182517564962", "name": "Jason Welsh", "time": 1565123661861, "rating": 5.0, "text": "Went to the glass doctor side, and had a windshield replacement. They did excellent work. I was in and out in no time. I have to say of everyone else I called they where the cheapest. But the service was quality.", "pics": null, "resp": null, "gmap_id": "0x888bb1611b6d8b63:0xd429fd11cc382e9c"}
{"user_id": "103818956757026854906", "name": "patrick Timmons", "time": 1553536423565, "rating": 5.0, "text": "I currently have my 2004 Pontiac vibe at md auto getting an engine swap initially the owner tried to call me several days to let me know he found an engine with 56k miles a rare find man I really appreciate him calling me I work 2 jobs and now they're doing an awesome job replacing my engine and they've been very nice when I call and ask questions and very informative", "pics": null, "resp": null, "gmap_id": "0x888bb1611b6d8b63:0xd429fd11cc382e9c"}
{"user_id": "102446646375066171212", "name": "Sheryl Ledbetter", "time": 1530458522271, "rating": 1.0, "text": "I would advise anyone to stay away from there.\nThe owner scheduled us in get minor repairs done on a specific day. He quoted us a price that was higher than other places but we had to have something done in the shop next to him so we agreed. He was supposed to let the other person have our car by noon so he could get started on the job we wanted to have done. Not only did he not have the car done by noon but rather at 4pm, also he didn't finish the job and charged us double the money he quoted he would charge for both repairs.\nThis is my second bad experience with him, I had a bad feeling about him but I thought I could get these easy things done so he could move our car along to the guy next door in a timely fashion.\nNever again.", "pics": null, "resp": {"time": 1530465026373, "text": "Sometimes you have to wonder who your really speaking to. This car a 2000 Mercedes Benz S430 was scheduled to have her windows tinted next door to me and when she showed up late to her appointment and couldn't get her car done that day she asked me if I could go ahead a replace her passenger mirror & that the new one was in a box in the back seat & then change her oil the oil was also in the back seat in a bag. I told her I would and gave her a quote of 70 dollars to do both. When I started the Job around 2 oclock I found that  someone had taken a big tube of glue and poured it all over the inner mounting guts of the mirror assembly to glue it back on the car, this was not told to me when I gave her a estimate.  I tried contacting her and was un able to , then she showed up at four when I was just finishing her mirror , but hadn't changed her oil yet and told her that I wouldn't have time now to change it , but showed her and her boyfriend the extra work I had to do to save the wires safely getting the connectors apart and getting the mounting screws out without hurting the heads   because of the glue mess someone had made. Her car was also suppose to go to the window tint shop in the morning at 10:00am but she failed to get it there on time and by 10:30 Anthony had to leave and told her her car would now not be done that day he had other jobs he had to do first since she missed her appointment , but she could leave it and he would have it done tomorrow morning she was nasty pushed on getting it done that day then said forget it , then called him back and said ok. The job calls for an hour of labor I ended up spending 2 hours because of the glue and charged her for 1 hour and this is what she thinks she can do to repay the favor and on top of it her they only paid me 50 dollars and I just let it go! P/s she also quoted this was her second time using me and the fact is this was the first time. She bought her car from a used car lot and I was asked to do some repairs on it from the dealer , but never did the work.  Like I said you never know who your really talking to , but I will be praying for her heart issue is attended to by my loving God and that she maybe able to share the love He gave through me to her someday by the Grace/forgiveness/Love I gave her for her ungodly ways this day!\nGod is Good all the time Amen Let's keep loving even when people are mean!"}, "gmap_id": "0x888bb1611b6d8b63:0xd429fd11cc382e9c"}
{"user_id": "110831965684808992334", "name": "Joseph Burger", "time": 1400393206260, "rating": 5.0, "text": "M.D. Automotive did a Perfect job.. great service and very affordable!", "pics": null, "resp": null, "gmap_id": "0x888bb1611b6d8b63:0xd429fd11cc382e9c"}
{"user_id": "113617029582192162019", "name": "Denzel Campbell", "time": 1580497563079, "rating": 5.0, "text": "Great job.", "pics": null, "resp": null, "gmap_id": "0x888bb1611b6d8b63:0xd429fd11cc382e9c"}
{"user_id": "117527717397529141769", "name": "Sand Mountain Ballistics", "time": 1626139942209, "rating": 1.0, "text": "Ledon does poor work. And he will not stand behind his work. I would take my engine literally any where else", "pics": null, "resp": null, "gmap_id": "0x8861eee7777f0717:0x6f2fe3926ac8ce71"}
{"user_id": "102269089571742183666", "name": "josh whisenant", "time": 1611979567044, "rating": 5.0, "text": "John a and Ladon always take care of what I need!", "pics": null, "resp": null, "gmap_id": "0x8861eee7777f0717:0x6f2fe3926ac8ce71"}
{"user_id": "110111101487132011739", "name": "David", "time": 1577600608583, "rating": 5.0, "text": "This place is run by honest folks that treat you right. The owner is a skilled professional. If you need a cylinder head decked, a block bored or a crank ground, this is the place to get it done right and for a fair price.", "pics": null, "resp": null, "gmap_id": "0x8861eee7777f0717:0x6f2fe3926ac8ce71"}
{"user_id": "116204937159926738094", "name": "Ronnie", "time": 1574613998844, "rating": 5.0, "text": "Tell John I said Hi", "pics": null, "resp": null, "gmap_id": "0x8861eee7777f0717:0x6f2fe3926ac8ce71"}
{"user_id": "117505918540446061463", "name": "Annette Smith Bentley", "time": 1594135362685, "rating": 5.0, "text": "I recommend these guys to anyone. They have worked around my work schedule many times just to make sure that every problem is addressed and that I would be safe in my travels. So with that being said give these guys a try", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "105931572962626369800", "name": "kenneth mote jr", "time": 1600558356946, "rating": 5.0, "text": "Excellent service, super people to do business with!!   This is the only place I carry my  vehicles.   I highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "115311921207622748001", "name": "Jason Bentley", "time": 1597189196792, "rating": 5.0, "text": "First Class Service All Around!!! Recommend these guys to anyone!", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "107069074555890870895", "name": "David Robenstine", "time": 1567865650054, "rating": 5.0, "text": "Russell and the staff are very knowledgeable.  Prices are reasonable.  I will be giving them more business in the future They do the job right the first time", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "114120447781306521154", "name": "Ben Martin", "time": 1586789697806, "rating": 5.0, "text": "Randy and his crew always do really great work, at a very reasonable price. I always recommend them for repairs both big and small, and based on the stuff they always have sitting around, I am convinced they can fix anything.", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "106259516170268633094", "name": "Brittany LelaFaye Mote", "time": 1564943858649, "rating": 5.0, "text": "These guys will definitely fix you up! They are amazing at what they do and they have the beat prices around.", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "105555205937588776773", "name": "Evan Alden", "time": 1546856685384, "rating": 5.0, "text": "Great place, wonderful staff, good quality work and prices are the best around. They do all my work.", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "105059312789048976152", "name": "Jason Crow", "time": 1536440091499, "rating": 1.0, "text": "I took my truck to these people and and there not mechanics they just change parts til they find the one it is what I call a part changer", "pics": null, "resp": {"time": 1536607833374, "text": "Thank you for the review Jason. I am sorry that we were unable to satisfy your needs. Maybe you should have had us diagnose the problem before you told us to change parts.\n\nWe appreciate your business and am sorry that you had such unrealistic demands.\nHave a wonderful day."}, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "105089188680920969856", "name": "Kaitlin Wasden", "time": 1618327581154, "rating": 5.0, "text": "Jordan went above and beyond to make sure I was able to get my dream vehicle! He was so patient with me and helped to make sure the process flowed so smoothly. I couldn’t have asked for a better experience! I’m extremely thankful to have such great business in Ozark!", "pics": null, "resp": {"time": 1618416671406, "text": "Thank you Kaitlin for the review and the 5 Stars  We appreciate the job you and the many medical professionals do for our community too!\nWe are here for you anytime you need us.  Jordan does a great job, Thank you!  Dale Moates"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "109766445135985192902", "name": "Cindy Bug", "time": 1627515130330, "rating": 5.0, "text": "Very nice people, quickly helped check my car 🚗", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "108679574505302001155", "name": "Amy Spry", "time": 1619088719978, "rating": 5.0, "text": "We have purchased two vehicles here, and the Moates are like family. They operate with integrity, honesty and fairness. They go above and beyond to make sure the process is seamless, and we are grateful for getting to do business with these wonderful people!", "pics": null, "resp": {"time": 1619108595399, "text": "Thank you Amy for your support and for taking the time to complete a review!  We appreciate you and your family."}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "100255416311607840862", "name": "Necia Williams", "time": 1608670019931, "rating": 5.0, "text": "Outstanding service from start to finish!  Jordan McDonald was professional and responsive to all my questions.  Because I was offered a fair price on my old vehicle, the decision to do a trade in vs private sale was easy.  I drove away in my new (used) 2018 Dodge Grand Caravan which is in excellent condition, drives well, and meets my needs.  It was definitely worth the drive from Pensacola to Moates for the exceptional quality of service received.  I was very impressed and will go to Moates when looking for my next vehicle.", "pics": null, "resp": {"time": 1608672533728, "text": "Mrs Williams, THANK YOU for the review and letting me know how you felt about your experience.  Jordan does a great job, I see it everyday.  We will never be the biggest auto dealer, but we will always strive to be the best and treat everyone like family.  I appreciate your kind words.  Dale Moates"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "103046703984638020987", "name": "Lauren Kerchner", "time": 1617217162927, "rating": 5.0, "text": "We would highly recommended Jordan over at Moates! He went above and beyond searching for the best vehicle for us and even drove paperwork to my office. He is the best!", "pics": null, "resp": {"time": 1617306409017, "text": "Thank you Lauren for the 5 stars and the kind words... Jordan goes out of his way so you don't have to!  We're always here for you!  Dale Moates"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "116269140570383814804", "name": "Lawrence Russell", "time": 1621174675782, "rating": 5.0, "text": "Recently had work done on my car all of the help we received was awesome by the crew and Dale .", "pics": null, "resp": {"time": 1621375091019, "text": "We appreciate your support Mr. Russell and the kind words.  Dale Moates"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "115916333531689071408", "name": "Michael Darien", "time": 1620225277029, "rating": 5.0, "text": "They found my dream truck. Customer service both in sales and the service department have been great. Thankyall so much", "pics": null, "resp": {"time": 1620256849978, "text": "Thank you Michael for the review and the 5 stars!  and thank you for allowing us to help you find that awesome truck… we look forward to serving you in the future in our awesome service department. Enjoy!\nDale Moates"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "111238829050357327585", "name": "Kim Bartley", "time": 1623762954645, "rating": 5.0, "text": "I have purchased 2 cars from Moates and use them for maintenance and repairs.  They are top notch and have excellent customer service!", "pics": null, "resp": {"time": 1623767576744, "text": "Kim We certainly do appreciate the kind words and your support!  We are always here for you."}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "114142592840831780633", "name": "Shawn Holmes", "time": 1617217558902, "rating": 5.0, "text": "Jordan found the truck I was looking for and notified me as soon as he had it in. Sale went smooth and the customer care was awesome!! Couldn’t have been happier with our experience.", "pics": null, "resp": {"time": 1617306337761, "text": "Thank you Shawn for the review and the 5 Stars!  We hope you get many years out of the awesome 3500 4x4"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "110328510402787445453", "name": "Lee holland", "time": 1617217960646, "rating": 5.0, "text": "We always get great service at Moates Auto Exchange and Jordan McDonald always takes care of us.", "pics": null, "resp": {"time": 1617306176472, "text": "Thank you Lee!  We appreciate your family's support over the years!"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "104550573095009592681", "name": "Mike Stough", "time": 1617287298136, "rating": 5.0, "text": "We purchased an F150 from Jordan. You don’t feel like you’re dealing with a salesman. He cares about every detail in the process. Plus, he does it all including financing! If you’re looking for a vehicle, go see Jordan McDonald at Moates! We’re glad we did.", "pics": null, "resp": {"time": 1617305961839, "text": "Thank you Mike for the kind words and the 5 Stars.  We have always done things differently from other car lots and families and businesses really appreciate it.  Jordan exemplifies our family's business ethics.\nTreat folks the way you want to be treated, have only quality inventory, and make things easy.  Happy truckin'  Dale"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "104795735331396221781", "name": "Jordon May", "time": 1596205190813, "rating": 5.0, "text": "I highly recommend Moates Auto Xchange! Jordan was awesome and went above and beyond for us. We were at another dealership and called to see what he could do for us. He got us a better deal on a better car, so we drove 2 and a half hours to get it! !We will go there from now on to buy!", "pics": null, "resp": {"time": 1596478284174, "text": "Thanks for letting us know how everything went for you.  If you need anything in the future, just give us a call. -Dale M., Business Owner"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "109629852829151136329", "name": "terry strickland", "time": 1613780336130, "rating": 5.0, "text": "Helpful and friendly people! Good prices on vehicles too!", "pics": null, "resp": {"time": 1614718021964, "text": "Thanks so much for the review and the kind words.  We're here for you anytime!"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "117721546681558193384", "name": "Ryan Beheyt", "time": 1600432415917, "rating": 5.0, "text": "Good honest people. I called them to get a price to fix what I thought was a wheel bearing. After they looked at it it turned out to be the tires were bad. Price to fix it was great. Great people to bring your vehicles to. I trust them And will bring my car back for more work when needed!", "pics": null, "resp": {"time": 1600440247249, "text": "Ryan thank you for the 5 stars and the kind comments.  We strive to do the best job we can and treat our customers the way we would want to be treated."}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "110721782914807176429", "name": "Victoria Snellgrove", "time": 1600564825689, "rating": 5.0, "text": "These are the friendliest people. We have been auto trading with the Moates family for 10+ years now. They always give us the best deal. I wouldn’t buy from anyone else!", "pics": null, "resp": {"time": 1600725443190, "text": "It's been a pleasure working with you for all these years, Victoria! Thanks so much for taking the time to show your support. We'll always be here for you if you need anything. -Dale M., Business Owner"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "115558133025796835294", "name": "Brent Vance", "time": 1512231312651, "rating": 5.0, "text": "Worked with Mitch here and was not disappointed. He didn’t BS me or tried to conceal any information.\n\nHe also let me come after hours to see a car and then stayed an additional 3 hours after closing to work finance terms on my 2013 Elantra.\n\nThe car is very clean and they put a lot of miscellaneous service work that I requested before I picked it up a couple days later.\n\nI highly recommend this business.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP_NYAbp5izvWg3Ok96V4S1S4G2cVhkfJS3m20G=w150-h150-k-no-p"]}], "resp": {"time": 1524148673944, "text": "Thank you Mr. Vance! Dont forget to come back for your free Oil Change!"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "105794310710305629638", "name": "Len Gordon", "time": 1587584109668, "rating": 5.0, "text": "My wife and I purchased a used Tahoe from them. We dealt with Jordan during the purchase. I have purchased several used vehicles that items were given a \"Band Aid\" to hide problems and that did not occur here. Overall I feel they were honest and did not try to hide anything from us. I came with a change of clothes and gloves to go through the vehicle myself, instead they let me go through the car on one of their racks. The vehicle checked out as we had discussed. Also, I might add that I feel like Jordan really put in the extra effort to ensure he earned our business. The paperwork and transaction was simple and very straight forward.", "pics": null, "resp": {"time": 1587589545088, "text": "Thank you guys, it was a pleasure to meet you.  We look forward\nto helping you and your friends in the future.  Dale Moates"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "110617112499502164161", "name": "David Giles", "time": 1605104569313, "rating": 5.0, "text": "Bought a gorgeous low mileage Miata from Jordan and crew.  They were very friendly and honest and the vehicle was just as described except for one minor issue.  I had been told it had a new battery, but during inspection we discovered that the battery was not new. It was just a mix-up and they were happy to install a new battery while we were finishing up the financial side of the deal.  Would have loved to have gotten the car at a bit lower price (who wouldn't?) but this was an exceptional low-mileage one-owner specimen, and they did work with me on the price.  I've shopped Miatas for quite some time and lately Carvana seems to have almost cornered the market on clean low-mileage Miatas and have jacked the prices up really high.  But I was able to buy this Miata well below what Carvana would have priced it at, and I feel that I got a good deal considering the current market and the premium condition of this vehicle  (and lots of buyers have had very bad experiences with Carvana, so I'm glad I didn't have to deal with them).  Highly recommend Moates Auto Xchange and would absolutely do business with them again!", "pics": null, "resp": {"time": 1605547210512, "text": "Thank you Mr Giles for the review.  We appreciate your kind words, yes Carvana is not what everyone thinks it is, I've heard nothing but horror stories and that \"return policy\" is quite the scam.  Enjoy that beautiful Miata."}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "117581773051317244366", "name": "AJ Nashville", "time": 1534263845536, "rating": 5.0, "text": "Ive had incredible luck with Moates. As an out of state buyer you typically run into questions that most local buyers dont have. Simply because you cannot see the car first hand. Ive always ran into an issue that when I showed up at other places to pick up my nice new car, its never what I expected it to be. Thats not the case with Moates. The staff there has been extremely forth coming and honest when it comes to small things like dings and scratches on a car. This way when I arrive, I know what to expect. My next car will come from here, its a drive but its one that I see as well worth the time. Thanks Moates for an awesome car buying experience!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMmcnGBYlwGVEmHWb2kUfKnz1BCGxB__H528Qy7=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "110487128459110518235", "name": "S. Berlet", "time": 1594084572579, "rating": 5.0, "text": "We bought a great car at a great price from an awesome sales person! Thank you Jordan McDonald for an incredible and quick car buying experience.", "pics": null, "resp": {"time": 1594224368480, "text": "Glad we could help you get a great vehicle at a great price! Thanks for letting us know how everything went for you, and we're always here to help if you need anything else. -Dale M., Business Owner"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "118395697231714309515", "name": "Rev. Clayton Lassiter", "time": 1593041705561, "rating": 5.0, "text": "I bought my wife her 2018 Sonata and got a great deal from Dale and the team. I would and probably will buy again and I live 3 hours away now!", "pics": null, "resp": {"time": 1593203483271, "text": "Satsuma, I'm so glad I was able to help you and your wife find the perfect car! Whenever we can help, don't hesitate to stop by or give us a call. -Dale M., Business Owner"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "116732705586590676224", "name": "Jodi Berger", "time": 1572473671176, "rating": 1.0, "text": "How dare you assume that we are ungrateful. My husband gave them more than half for the vehicle. It was NOT at no cost. This is not about the church, who helped us tremendously during hard times. That was pretty low of you. You sold the vehicle \"as is,\" I understood what that meant. My husband was warned \"do not drive it very far.\" After a week, a main component (the fly wheel and belt), literally fell out of the vehicle while I was driving. I lost all power. I and/or my husband or someone else could have been fatally injured. The reason for what happened was that it was improperly torqued. We would have been back to not having a vehicle. Only the parts that you replaced were new, everything else had to be replaced from factory parts. Hadn't you even done a tune up? The filters were all factory. Like I said, \"as is,\" but it should have been thoroughly inspected by a mechanic. Most likely, you only did what was necessary to pass the inspection. Do not assume that because I'm female that I don't know anything about cars. I do, I was the owner of a NASCAR in the '80s and raced with the legends. You wanted an edit, this is what happened and your response was shameful.", "pics": null, "resp": {"time": 1572276216153, "text": "As clearly stated on the CARFAX history service records. 7/3/18  Control Arms, Ball Joints, and Sway Bar links and alignment. All Parts replaced were new OEM quality, I have the receipts.  Repair order #19147  anyone disputing that is misleading you, btw.\n\nThis work was done prior to your \"acquisition.\"\n\nI say \"acquisition\" because you DID NOT buy / purchase ANYTHING. This old (but clean) 1996 SUV was as a GIFT to you at NO COST by a charitable group of church members to help you, to give you a way to go.  You paid for NOTHING for that vehicle (which given to you) well over a year ago.\nIf you \"could have BOUGHT a brand new car\" why did you need others to pool their money to GIVE you an SUV?\n\nRethink who you call \"Swindlers\" next time you decide to get mad because your 23 year old vehicle might need some maintenance.\n\nI'll give you the opportunity to edit your review and apologize for your comments and misleading review.  Only actual customers leave reviews and comments per Google's Policy and you have never spent $1 here.  You are NOT a customer and obviously you are NOT thankful either.\n\nP.S.  If anyone who works with charitable organizations and give their time and money to help others, please do not let \"this example\" deter you from your heart's desires and work.  Most people are very thankful."}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "115777713142365002714", "name": "erica conner", "time": 1541817595402, "rating": 5.0, "text": "I love getting my car fixed at Moates! They are excellent! I just love Bryan, Wayne, and Calvin Cole! They are hilarious and everytime I go they give me a wonderful experience. They fix my car right on up. Their customer service is amazing. If I could I would give them 100 stars!!!!", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "113257351017666871187", "name": "Logan Tongate", "time": 1577842419913, "rating": 5.0, "text": "Went in to get an oil change and the customer service was great. While waiting I had a great conversation with Dale. I give them 5 stars everyone was friendly and I will definitely be back.", "pics": null, "resp": {"time": 1578585901398, "text": "Thanks, Logan. It was a pleasure chatting with you and look forward to seeing you again soon."}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "106612155697646346083", "name": "Barbara Jones", "time": 1552740989288, "rating": 5.0, "text": "If you're shopping around for a car, check out  Moates Auto Xchange. They're all really nice people and anxious for you to get the car that fits your needs. Mine was a pleasant transaction and Dale explained and demonstrated some of the functional things about the car. You'll be pleased if you  visit them.", "pics": null, "resp": {"time": 1578586052550, "text": "Thank you for taking the time to review your visit, Barbara. We appreciate it and glad you had a good experience."}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "100843599162700844646", "name": "Stephanie Evans", "time": 1541604505600, "rating": 5.0, "text": "Jason was wonderful. Professional and very helpful without being pushy. I feel I got a good quality vehicle at an affordable price. I will be using them again and recommending them to my friends and family.", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "116731975906868666980", "name": "Leigh Anne", "time": 1528499653804, "rating": 5.0, "text": "Amazing customer service. Had my oil changed with 2 toddlers. They are very fast and gave me so much info about their service shop. Definitely will be back.", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "114206560951168631587", "name": "Deaunqua Bryant", "time": 1546135835495, "rating": 4.0, "text": "Their service department is phenomenal! They do a great job they're honest, open, and very thorough. I look forward to doing more business with them.", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "105675607566155547299", "name": "Jessie Fitzwater", "time": 1557510605458, "rating": 5.0, "text": "They are very nice and very helpful. I will be sending people down here. I am very happy with everyone there. Thank you so much", "pics": null, "resp": {"time": 1572278067552, "text": "We appreciate the kind words and the referrals.\nThank you for your business and the review."}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "114038507395726756891", "name": "Robert Campbell", "time": 1574302640553, "rating": 1.0, "text": "Trying to sell a car that is about to break down. Steering was unsafe. One person said it was safe and the other told me no it was not", "pics": null, "resp": {"time": 1578946724358, "text": "Offering a vehicle that isn't safe for the road is not something we do.  No one at the dealership has any recollection of speaking with you or anyone concerning a vehicle with questionable steering.  Dale M."}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "112008613267597632778", "name": "Pam Park", "time": 1520000279977, "rating": 5.0, "text": "I recently purchased a Ford Edge from Moates Auto Xchange and it was by far the best buying experience I have ever had!!! The owners are such nice personable people and the sales staff and service department are friendly and professional. I would recommend them to anyone! If you are in the market to buy a vehicle please be sure to check these guys out, you won't be disappointed!", "pics": null, "resp": {"time": 1524148555958, "text": "Thank you Ms. Pam for your review! We look forward to servicing your new to you Ford Edge for years to come!"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "116567190804002107280", "name": "Christina Vance", "time": 1554931466379, "rating": 5.0, "text": "Best service center in the wiregrass area! Very knowledgeable personnel. From changing motors to changing oil, these guys can do it all!", "pics": null, "resp": {"time": 1572278180992, "text": "Thank you Christina, we appreciate your business."}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "105470717658941059635", "name": "Ethan Mitchell", "time": 1556823548504, "rating": 5.0, "text": "I was told it would be the next day before they could get to my truck to fix an exhaust gasket.. I got a call 1 hour later saying it was done.. very fast, very professional, I am highly satified", "pics": null, "resp": {"time": 1572278088819, "text": "Thank you for the review!"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "105754751007003798186", "name": "Harry Gilmore", "time": 1574618192114, "rating": 5.0, "text": "They take care of all my automobile needs.", "pics": null, "resp": {"time": 1578946409417, "text": "Mr. Gilmore, thanks for taking a moment to show your support. We're always here for anything you need in the future. -Dale M., Business Owner"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "107872522622813431678", "name": "Candace Jaggars", "time": 1519215673219, "rating": 5.0, "text": "I've bought a vehicle and used the service dept many times. Service is great and smiling faces are always there to greet you. Love the home town feel and sweet folks all around.", "pics": null, "resp": {"time": 1524148629223, "text": "Thank you Ms. Jaggars! We try to make this a pleasant environment! Thank you for your support!"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "110100555609034530440", "name": "Cole Jones", "time": 1534266553607, "rating": 5.0, "text": "Great service. Not your typical car lot. not too pushy and awesome financing options", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "114152506897487531155", "name": "Natalie Patterson", "time": 1497961617117, "rating": 5.0, "text": "We had the best experience we've ever had at a car dealership. Mitch worked to get us to get a great deal. Service was friendly, prompt, and not pushy.", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "109188791386896209117", "name": "Rose Lyons", "time": 1501774188056, "rating": 5.0, "text": "They ALWAYS take excellent care of me. Good, honest people who keeps my car on the road! Love em all!", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "106241693623361463939", "name": "Ben Wicker", "time": 1551915029336, "rating": 5.0, "text": "I'd tell all my friends to shop here . Dales a good person to deal with . ...", "pics": null, "resp": {"time": 1578586087865, "text": "Thanks, Ben, for your kind words. We appreciate you taking the time to share your thoughts."}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "117652125248541092328", "name": "Miriam McFarland", "time": 1497976297394, "rating": 5.0, "text": "This was the first used car I have ever bought. I had a 2011 Ford Edge that was totaled. I loved that car.\nMy brother found this car at Moates.I was able to get a 2013 with only 22,000 miles and  even more features  than my original car. It was the color red that I wanted. I am old and knew what I wanted to drive. I knew how the technical things worked on this car and I had to have that car. I am usually not this spoiled but I was so happy with my Edge.\nMitch Sebastian was wonderful to work with. I got a great price. He even delivered it to me which was so important since my husband has Lewy Body dementia and does not travel well and my brother lives across the state.\nI will go to Moates Xchange and Mitch for any future car needs I have.", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "109905587777191585589", "name": "Charles Burks", "time": 1555573740984, "rating": 5.0, "text": "The cheapest & good quality front end alignment in town.", "pics": null, "resp": {"time": 1572278123737, "text": "Thanks Mr. Burks"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "110507657242791100944", "name": "Cori Baker", "time": 1556015257087, "rating": 5.0, "text": "Went here for repairs on my vehicle. The mechanics were knowledgeable and friendly and gave frequent updates on cost and timeline of how long repairs would take.", "pics": null, "resp": {"time": 1572278106684, "text": "Thanks Cori for the review."}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "111730253699988331861", "name": "Julie Englehart", "time": 1511574111418, "rating": 5.0, "text": "GREAT deals on nice vehicles. Sales guys are AWESOME... extremely helpful", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "104606162951613823637", "name": "Michael Winslett", "time": 1522878940630, "rating": 5.0, "text": "The people who work are easy to get a long with, and try to help in any way possible with no hassle.", "pics": null, "resp": {"time": 1524148434124, "text": "Michael thank you for your review! We try to change the way people view our industry one customer at a time!"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "107222118028673448522", "name": "Billy Alt", "time": 1534263516933, "rating": 5.0, "text": "Great service before, during and AFTER THE SALE. Thanks guys for your help!!!", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "106037530263338721439", "name": "Darlean Smith", "time": 1528327010502, "rating": 5.0, "text": "Love this car auto dealership. Best place to buy a use car.", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "104213018712978107878", "name": "Charity Carver", "time": 1533038669086, "rating": 5.0, "text": "Love the guys at the shop Wayne and Brian are always the best and get it fixed!", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "110972950765134366509", "name": "Alex Sanders", "time": 1490199089350, "rating": 5.0, "text": "These guys are super friendly and have the best prices you can find. They'll make you feel like the most important customer they have even if you aren't.", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "102352554003882660868", "name": "Gwendolyn Carpenter", "time": 1583333957181, "rating": 5.0, "text": "Great service and car care", "pics": null, "resp": {"time": 1600100601874, "text": "We appreciate you Mrs Gwen, Thank you for your support!"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "104517336847885997895", "name": "Lorilovesgreen#9 Looking up", "time": 1582306454394, "rating": 5.0, "text": "Absolutely spectacular service.", "pics": null, "resp": {"time": 1582819191987, "text": "Thank you for all the support! Feel free to reach out if you need anything. -Dale M., Business Owner"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "114972895165161303242", "name": "Pam Osborn", "time": 1537390042895, "rating": 5.0, "text": "Did a great job at detailing my car.", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "110575590567560945103", "name": "James Hyers", "time": 1518453405842, "rating": 5.0, "text": "Always courteous and fast service at a reasonable price.", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "115155963919544770744", "name": "latricia Bivins", "time": 1522766380580, "rating": 5.0, "text": "Jason Park was great. If you are looking for a car he is the man to see", "pics": null, "resp": {"time": 1524148477186, "text": "Thank you Ms. Calhoun. Jason has been a great asset to our company since his arrival!"}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "105879966380793298061", "name": "Justin Reed", "time": 1468986826528, "rating": 5.0, "text": "Great service with a knowledgeable staff for all of your vehicle needs.", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "118284224306046801457", "name": "Catherine Thomas", "time": 1528979592399, "rating": 5.0, "text": "Nice man that came to help me.", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "112001784451127757930", "name": "Cheryl Leatherwood", "time": 1498852320091, "rating": 5.0, "text": "No pressure. Professional. Got a good deal.", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "108654801672064117023", "name": "Robert Amuso", "time": 1529952733737, "rating": 5.0, "text": "Great customer service and rates.", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "110744249081291809760", "name": "Steve Stumpf", "time": 1527901410417, "rating": 5.0, "text": "Awesome  repair service center!", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "102104595497223874833", "name": "mitch sebastian", "time": 1534523965768, "rating": 5.0, "text": "COULDNT ASK FOR A BETTER PLACE!", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "108219993024884980590", "name": "LeighAnn Gunter", "time": 1530567678067, "rating": 1.0, "text": "Bought a vehicle in March and already had to put in 2 transmissions...Smh", "pics": null, "resp": {"time": 1530577526119, "text": "Flagged for Google comment removal, not a real customer.  no sale or issue exist."}, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "104076901173714425085", "name": "Robert Walters (Rob)", "time": 1531259770969, "rating": 5.0, "text": "Outstanding customer service!", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "110652325434391568637", "name": "TJ Hisway", "time": 1518534848838, "rating": 5.0, "text": "Excellent service.", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "105536907671021330125", "name": "Todd Chancey", "time": 1549321203806, "rating": 5.0, "text": "Good deals", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "110904205818795428840", "name": "Donnie Costelloe", "time": 1498320732384, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x88927c3583c009d7:0x273831e881312d56"}
{"user_id": "110160418902214572369", "name": "Taylor Wright", "time": 1618521237436, "rating": 1.0, "text": "Matt or whatever his name is, is slow he’s the manager of the whole place and he has had my car for over 3 WEEKS and nothing has been done to it he has told me that it’ll be done on this day, that day comes and the car is still not ready. The lady that answers the phone is very nonchalant, the workers are rude, there isn’t any type of greeting when you get to this place, this place is a 0/10 never bring your car here unless you have another at home you can drive until yours get fixed and i’m paying these people almost 2 thousand dollars on something they haven’t even started on yet.", "pics": null, "resp": {"time": 1618597148656, "text": "Hello Taylor, my name is Linda I am one of the owners at Mr T's. I would like to speak to you concerning your experience but I can't find any information in your name. May I ask if your vehicle is your name or some one else's ? What make and model is it and what repair did we do? Without any information I can't address your issue. Can I ask that you please call me personally at 205-786-8279? I want you to know I am very sorry about this and  interested in listening to what happened directly from you. Please call me."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "118399882855638142510", "name": "Larry Robbins", "time": 1619444262524, "rating": 5.0, "text": "Great service department. Friendly and helpful.", "pics": null, "resp": {"time": 1619466578123, "text": "Thank you for the kind words, Larry! We're happy to hear that you enjoyed working with our team during your time in our shop. We hope that you will consider choosing Mr. T's Automotive when your vehicle is in need of repair or maintenance in the future!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "108165207086404000295", "name": "Cherrie Cooper", "time": 1618268182407, "rating": 5.0, "text": "I love Mr. T'S they are reasonable and respectful and good at what they do on your car, thanks again Mr. T's for working on my car for the second time,  I wouldn't take it any place else but you guys.", "pics": null, "resp": {"time": 1609189841729, "text": "Thank you, Cherrie, for the 5-stars and for taking the time to leave us a review. We appreciate your kind words, and for making Mr. T's Automotive your go-to automotive repair shop!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "113642041906522946380", "name": "Johnathan Harris", "time": 1611142125118, "rating": 5.0, "text": "This was a warranty through car dealership visit they fixed everything that the dealership seemed to miss before they sold me the car. If I have anymore problems in the future im always coming to Mr.Ts from now on they treat you like family", "pics": null, "resp": {"time": 1611266675109, "text": "Thank you Johnathan! Please do not hesitate to give us a call if you need anything else!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "114042759790652175131", "name": "Eric Mcghee", "time": 1608748243226, "rating": 5.0, "text": "Mr T'S Automotive Does Excellent Work And They Have Your Vehicle Serviced And Ready in A Timely Manor And They Stand Behind Their Work !! I would Recommend My Family And Friend's !!", "pics": null, "resp": {"time": 1608825593191, "text": "Thank you Eric for the 5-stars and awesome review! We appreciate you sharing the word about Mr. T's Automotive to your friends and family!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "115521105671880704190", "name": "Raymond Harkins", "time": 1624627105391, "rating": 5.0, "text": "Great service and knowledge of 🚘", "pics": null, "resp": {"time": 1624634282936, "text": "Thank you Raymond! We appreciate your review and will always work on your vehicle with our full knowledge and effort! Take care."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "100075470343672960300", "name": "Jonathan Teesdale", "time": 1582899424949, "rating": 5.0, "text": "I usually don't write reviews but Mr T got me out of a bind when my boat trailer came loose off 59. The axle was bent and I slowly crawled off the exit to his shop. He took the time to go out of his way and fix the trailer that same day. The price was very fair and the quality of work was excellent. They are good people and I would recommend his shop to anyone. Thank you, Mr T!", "pics": null, "resp": {"time": 1583189573943, "text": "Thank you, Jonathan for taking the time to leave us a review! We're always happy to help a lending hand to customers in need, as we know how scary and frustrating a situation like that can be. Thank you again for your kind words, and for visiting Mr. T's Automotive!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "105780750503234757280", "name": "Sharlene Brown", "time": 1622847967589, "rating": 1.0, "text": "Received car back with missing parts, drove car home and parked it.  Two days later drove it and it broke down while driving it after I paid $1700.00 for it to be repaired. Was told it was the engine why wasn't that found when the $1700.00 work was done?????", "pics": null, "resp": {"time": 1610143851930, "text": "Thank you Sharlene for taking the time to leave us your feedback! On April 4th we put a rack and pinion steering sector and a power steering pump on your car. Your timing chain broke, there is no way to predict that the timing chain is going to break. It is always a good idea to replace it when recommended by the manufacturer so that it doesn't break and destroy the motor."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "118343691316146641667", "name": "Pam Steele", "time": 1580158148089, "rating": 1.0, "text": "I am at Mr T’s shop with my daughter and the manner of communication given to my daughter by an employee was unprofessional i.e. talking about her hair and children; stating that he understands why her hair is “glued on” since she has so many children. when we returned immediately after picking up her car because of engine light being on he stated well you might as well get it fixed too since you have your income tax money......very rude and appears to have an set opinion of certain people. Know this; all people of color are not ignorant to employee’s or employers who  apparently  do not have their facts or business etiquette in order. We are waiting outside over an hour for wiring to sensor to correct check engine light. I have had to cancel my business appointments today by the way is how we paid for this fiasco. Such a bad way to earn business from customers however they choose to pay", "pics": null, "resp": {"time": 1580236501897, "text": "Ms Grant, I am very sorry that you were offended that certainly was not my intention. Let me first say that I am not a racist person, my business would not have survived 30 plus years in a predominately black community if I was. I try to treat my customers like family or at  least like a close friend without the thought that some people may take offense to it. I often come into the lobby and interact with my customers, mostly to let them know they are more to me than just a dollar. I believe that most appreciate that or I wouldn't have been here as long as I have. My business is built on word of mouth from family member to family member, friends to friends then coworkers and others. I know the majority of my customers by name, I know their spouses, mothers and fathers, sisters and brothers and their children. Again, I apologize for offending you and I truly hope that I have not lost your daughters business through this misunderstanding."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "108546736029572937011", "name": "christopher mennefield", "time": 1618627125295, "rating": 5.0, "text": "Best mechanic in the south", "pics": null, "resp": {"time": 1618839394195, "text": "That means the world to us, Christopher! Thank you again for the 5-stars and for making Mr. T's Automotive your go-to automotive repair shop! We'll see you next time!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "112787332616614073408", "name": "Anterrio Perry", "time": 1588783846490, "rating": 5.0, "text": "Took my lancer in, and they really did a great job on my exhaust system. Sound's awesome", "pics": null, "resp": {"time": 1589918391829, "text": "Thank you Anterrio for the 5-stars and wonderful feedback! Thank you for choosing Mr. T's Automotive for your exhaust work on your Lancer! We'll see you again the next time you need us!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "102328872190725721949", "name": "Ricardo Mullin", "time": 1607390080127, "rating": 4.0, "text": "Everything was done very professionally and very timely.", "pics": null, "resp": {"time": 1607466633585, "text": "Thanks Ricardo! We appreciate your feedback!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "102172385655069992183", "name": "Richard Martin", "time": 1624301853837, "rating": 5.0, "text": "A quality mechanic shop", "pics": null, "resp": {"time": 1624398906068, "text": "Thank you Richard! We appreciate you visting Mr. T's Automotive!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "115396085025414436647", "name": "Brenda Jackson", "time": 1498721977796, "rating": 5.0, "text": "WOW!!! I must tell about my wonderful experience with this place. I was greeted with a smile. The young lady was very polite and listened to my concerns, and got my car looked at by the owner quickly. I explained to her that I was having back surgery the next day and would bring my car by to get the needed repairs. The young lady , Stephanie typed me an estimate with needed repairs and the amounts of them so I could give my husband. She called me to let me know my car was ready and then helped me and my husband make payment (he was in another state at this time). The process was so smooth she was so helpful and concerned. To top it off when I came to pick up my car, I was greeted by that wonderful smile again and she pulled my car to the front and helped me in. Thank You, Thank You Stephanie and Mr. Ts, I have never received this multitude of service from a repair shop! Best experience ever, I will be back and sending you more business!!!!!", "pics": null, "resp": {"time": 1498737956970, "text": "Thank you so much for the 5-star review Ms. Jackson, and for your business. Also, thank you for recognizing one of our employees! We will let Stephanie know what a great job she's doing."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "112918946304668284346", "name": "Antonio Gulley", "time": 1561156647756, "rating": 3.0, "text": "I have a 2008 white Dodge Charger MR T’s put a motor in my car and a  Coolant reservoir total $4100.00 he told me the new motor they put in my car had 18  Thousand miles  wow that’s a new.the car was driving nice and  smooth.but after two weeks of driving  my check engine light came on and the car start shaking real bad and    Running rough. I never had a car with 18 thousand miles on it running rough or all the cars I rented with 18 thousand miles on it running rough like this. So I called him and told him what the problem was and they told me to bring it up there So I drop the car off Wednesday late evening by the way I stayed about 12 miles away but when I was driving to the shop it wasn’t running rough anymore. He called me Friday morning he told me they drove and drove the car and he said they couldn’t find anything wrong with it so I picked the car it and drove the car about 8 miles to the store and came back out  The car is shaking and running rough again and it is barely pulling a little hill.  So I called him and told him what was going on with the car again he told me to bring it back up there again Monday ..  they are very nice he is not give me any problems about bringing my car back up there but I just want my car fixed  so I will keep you guys posted with this review after I pick my car up after Monday  to be continued...", "pics": null, "resp": {"time": 1561494309417, "text": "Dear Antonio, we appreciate your feedback and the opportunity to work on your vehicle. We believe that we have addressed the issue and the noise, but if for any reason it is still acting up, please let us know by giving us a call at (205) 786-8279, and ask for Matt or Linda so that we may address your concerns. Thank you."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "109247661351660440141", "name": "Doyle Bright", "time": 1584112167831, "rating": 5.0, "text": "Mr T's automotive strives to satisfy the customer Matt Tortorici is very knowledgeable he has been working with cars and building engines from back in the mid 70's .  I had a coolant leakage problem with my GMC 1500 Sierria 5.3 liter Truck.  GM used defective castech heads casting#706 from 2002 thru 2007 they were made in China. The heads will crack at the head bolts causing coolant to leak into engine. GM would not fix the Issue and had multiple other shops in the Birmingham area try and repair the same old casting 706 and it would last for around 60k miles and crack again.  We put casting 243 heads on my 2002 5.3 liter\nand so far so good it seems to have lost little low end but picked up some upper end power. Matt went over everything with me and even steamed cleaned my engine also repaired my AC.  I highly recommend Mr T's / Matt Tortorici he didi exceleent job on my Truck.. MShelto", "pics": null, "resp": {"time": 1584126250035, "text": "Thanks so much for the great feedback. We do appreciate our customers and we realize how big trust is in the auto repair industry. We're so glad we've earned yours Doyle! Thanks again for the review!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "109034140625045116019", "name": "Melinda Furniss", "time": 1581978594502, "rating": 5.0, "text": "I never had an they didn't solve. Affordable and trustworthy. My go to for all my car repairs.", "pics": null, "resp": {"time": 1582127623980, "text": "We're always happy to help, Melinda! Thank you for the wonderful review. We really appreciate your feedback!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "110547930095344445327", "name": "Ashley", "time": 1508416013009, "rating": 1.0, "text": "VERY POOR SERVICE. I Would never go back nor recommend this business to anyone. My husband dropped his vehicle off. (Drove it in) After waiting 3 long, ridiculous months for the repairs to be finished, and spending 3,000 dollars, the vehicle was not in drivable condition and had to be towed away. The vehicle is in worst condition after receiving repairs from Mr. T's. You're very eager to provide a speedy response to a public review, but if you were as eager to provide excellent customer service you wouldn't have so many negative reviews to respond to. Provide this same eagerness, and willingness to provide clarification when a customer is standing before you, with questions about their invoice or inquiries about such lengthy auto repair times. This review is not worthy of your response as I've already heard all of your excuses and even read some of them in your responses to reviews. My Mechanic is on vacation, waiting for parts to arrive, dealing with a warranty issue etc. However none of this explains why it took 3 months to render repairs, why were there services on my invoice that had not been performed on my vehicle and why my vehicle is not in drivable condition today. When this issue was presented to the business owner instead of him treating a paying consumer with respect, I was met with, anger, frustration, he himself had a lack of understanding, unwillingness to explain, lack of empathy. He was truly unconcerned and appeared as if he didn't care. No need for your public, heartfelt, speedy response.", "pics": null, "resp": {"time": 1508417828984, "text": "Of course since you have not identified yourself or your vehicle we cannot issue a rebuttal. However we do regret that you are unhappy. I am the owner and I would like to speak with you to try to  resolve the issue, please call me at your convenience. 205-786-8279 my name is Linda."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "106199962033201480429", "name": "Carol Federer", "time": 1611601701268, "rating": 5.0, "text": "Very friendly and thorough", "pics": null, "resp": {"time": 1612282882003, "text": "Thank you Carol!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "105665713140773799284", "name": "T . Tolliver", "time": 1528819649057, "rating": 4.0, "text": "Good things take time. Very knowledgeable staff. Very busy place. Be prepared to leave your vehicle indefinitely, but they do great work. Highly recommend.", "pics": null, "resp": {"time": 1528820834650, "text": "Thanks for sharing your feedback! We believe in providing the best service possible for all our customers and we're happy to hear that is the experience you had as well."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "116465641962389026577", "name": "Kyoka Akers", "time": 1580865198257, "rating": 5.0, "text": "I have had no problems with my car since I took it to them. They're not cheap but, in the end it worth it.", "pics": null, "resp": {"time": 1581004640463, "text": "Thank you for sharing your feedback with us, Kyoka! We appreciate your feedback and look forward to seeing you next time you are in need of tires and services."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "112045076746676650337", "name": "Derrick Young", "time": 1571213278840, "rating": 5.0, "text": "They aim to please and their prices are not that bad I finally got my truck fixed thanks to mr. T's and the customer service is wonderful💳🔝💯", "pics": null, "resp": {"time": 1571348033272, "text": "Thank you Derrick for the 5-stars and for sharing your most recent experience with us! We appreciate your support, and are here to help with anything else you may need. Thank you!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "107317117752260070351", "name": "Yvette Jones", "time": 1616858055162, "rating": 5.0, "text": "Excellent service", "pics": null, "resp": {"time": 1617209468952, "text": "Your positive review and feedback are much appreciated, Yvette! We appreciate you visiting Mr. T's Auto Service Inc."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "117603169483479763718", "name": "Crk Cali", "time": 1473800966862, "rating": 5.0, "text": "Always #1\nNever had a problem with this company. Employees are great. They always get to the point to get your vehicle fixed or whatever the case is.\nI'd refer anybody to them. Thanks Mr T's Staff you are the best", "pics": null, "resp": {"time": 1474378386776, "text": "Thank you for the kind words Crk. We do the best we can to always help our customers!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "117415383996587872118", "name": "Kyla Clark", "time": 1610205732442, "rating": 5.0, "text": "Very nice people", "pics": null, "resp": {"time": 1610746978975, "text": "Thank you Kyla! We appreciate you visiting Mr. T's Automotive for your service!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "107625826445934295687", "name": "TT Fine", "time": 1561675165400, "rating": 1.0, "text": "Scammers.....scammers......scammers...... this  place will rob you blind.Antonio Gulley... I have at white 2008 Dodge Charger.  I said I was going to give you guys an update after I take my car back up there After  two weeks of driving and after spending $4,100.00  on a motor.  Now he is saying that my computer is bad. a 10 year old car with a bad  Computer.  Lies.. after.. lies.. And we all know that the computer is not warranty.  are you surprise, because I’m not. Robbers.  I am going to report this place to the Better Business Bureau..  cause they need to be  shut down now he want me to spend $400  on a computer. Why  all of a sudden my computer is bad.. it was nothing wrong with my computer before I took it up there to you guys..they will call you with bad news after news.what they will give you. Please people do not take your car here I would hate to see someone else being treated the way I am.", "pics": null, "resp": {"time": 1561740652842, "text": "Do you know the legal liability you have imposed on yourself by posting a malicious business review with a fake Google account? You should look it up. With that said here is our reply to your review.\nI am sorry you are having an issue after the repair but an engine replacement is just that, the engine along with any extra parts that we felt were questionable and they are listed on your invoice. There is not an ECM on your invoice. Please keep in mind that there are several other things under the hood of your car that can also cause future problems. Unfortunately we are not able to detect a component such as an ECM, starter, alternator, Oxygen Sensor, Injector and so on that is about to go bad, it is just impossible. Your vehicle is 11 years old and does have 175,000 miles on and usually parts and components will begin to fail and need replacing after 10 years. This ECM is not covered under warranty because we did not replace this part and it does not come with an engine. I have copied and pasted some information for you that came from a site called my mechanic explaining the ECM’s function to your car. We have ordered the ECM, as you know, and as soon as it is installed and the car is test drove we will call you.\nHere is some information that I pulled from the site \"My Mechanic\" that may help you better understand an ECM's function.\nThe engine control module (ECM), also commonly referred to as the engine control unit (ECU) or powertrain control module (PCM), is one of the most important components found on virtually all  vehicles. It essentially functions as the main computer for many of the vehicle’s engine performance and drivability functions. The ECM takes the information from the engine's various sensors and uses that information to calculate and tune engine spark and fuel for maximum power and efficiency. Erratic engine behavior also indicates a bad or failing ECM. A faulty computer may cause the vehicle to intermittently stall or misfire. The symptoms might come and go and not appear to have any sort of pattern to their frequency or severity. The ECM plays a vital role in engine performance. Any issues with it can cause major problems with the overall functionality of the car."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "113939560481533179514", "name": "Kathleen Thompson", "time": 1491547367001, "rating": 5.0, "text": "I have never had a bad experience with this company, Recently I had my caladiac convert and some more work done on my Nissan Quest, and had a small issue with my wipers the night I picked it up, called them the next morning and they told me to bring it in, I didn't have to wait , the tech connected it back and I was on my way.\n\nI would recommend them for any services you may have. The only thing I wasn't to happy about was one of the young men that I would always see when I drop off my car wasn't there anymore. He will be missed but I'm sure all the other people will be just as nice its just when you are comfortable with someone you don't want any changes.\n\nGive them a visit.", "pics": null, "resp": {"time": 1491572064367, "text": "Kathleen, we are so pleased to have earned your 5-star review! Thank you for the positive feedback. We look forward to seeing you again in the future and can assure you, everyone is more than happy to assist."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "113449118721822658959", "name": "stan gillard", "time": 1564149165427, "rating": 5.0, "text": "This is a great place to get your car fixed ! They d ok a super job an fast !", "pics": null, "resp": {"time": 1564171540541, "text": "Thank you Stan, for the 5-stars and for supporting Mr. T's Automotive! We appreciate your business, and we look forward to seeing you the next time you need us!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "104698913681828582936", "name": "Sharon Smith", "time": 1578417674800, "rating": 5.0, "text": "Mr. T's Automotive is the place to take your vehicle for repairs. It's my ideal automotive. From the front desk to the back are are A1.", "pics": null, "resp": {"time": 1578426151737, "text": "Thank you Sharon for the 5-stars and wonderful feedback! We are happy to hear that we provided you with exceptional customer service, and we look forward to seeing you again for your next service."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "107863390939725862472", "name": "rosey rolblox", "time": 1524831811284, "rating": 5.0, "text": "Mr. Robert  and his staff are great! He makes sure you understand what it is he is say (I am a woman of course!) and works with you on pricing as well!", "pics": null, "resp": {"time": 1524839171178, "text": "We are happy to serve you with excellence, Karia! Thank you for taking the time to share your feedback with us. See you next time!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "109130871599860181416", "name": "stellicia person", "time": 1499456587237, "rating": 1.0, "text": "I can not stand this place. They have had my car since june 30. Told me to pick it up Thursday i called they said it was not ready. Now it is Friday i have called over four times. Robert said my car will be ready Thursday and it was not. They are liar i will not recommend them to anyone. They closed at 5:30. I still don't have my car.. Another weekend with no car.", "pics": null, "resp": {"time": 1499458395791, "text": "Ma'am  your car is ready and has been ready. We were simply waiting for the warranty company to issue card payment for the repairs but please do come and get it.  We  close at 5:30 but it is only 3:10 so we won't close for at least 2 more hours, that should be sufficient time to pick it up so that you may have it  for the weekend. We apologize for any inconvenience."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "111488636134590802292", "name": "Shervette Coleman", "time": 1557662156005, "rating": 5.0, "text": "Professional. Very honest and straightforward. Excellent service. Thanks.", "pics": null, "resp": {"time": 1558030308349, "text": "Thank you Shervette for the 5-stars and the compliment! Please do not hesitate to reach out if we can assist you with anything else! Take care."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "115072107753865196542", "name": "Jan Denson", "time": 1455057620680, "rating": 5.0, "text": "My husband and I had our RAV 2003 computer and transmission go out.  There was a class action lawsuit against Toyota regarding the problem.  Mr T's was very helpful with all the paperwork which had to be sent to the class action attorney.  They fixed the problem right away and the car now drives great.  In the end we didn't get to be included in the suit as our car had too many miles but the good news was we sold our car with the knowledge that it was fixed right and the next owner would have piece of mind knowing the car had a new computer and transmission.  I would recommend Mr. Ts, very pleased with the service.", "pics": null, "resp": null, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "107140060191408779864", "name": "Storm Everlasting", "time": 1436221422475, "rating": 1.0, "text": "If I could give them no stars I would. I took my car  here to be repaired and me radio speakers and TV's were stolen out of the car, while in there shop. The owner is not doing nothing about it. He said he is not responsible. If you value your car you will not bring it to this place.", "pics": null, "resp": null, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "103460508995644021269", "name": "Curtis Jemison", "time": 1603637959817, "rating": 3.0, "text": "Do good work", "pics": null, "resp": {"time": 1603722410552, "text": "We appreciate your feedback, Curtis. Please do not hesitate to let us know how we can give you a 5-star experience during your next visit with us. Thank you!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "100905598449795801958", "name": "out to sea at last", "time": 1492541692317, "rating": 1.0, "text": "The customer service at this establishment is non existent. I tried twice over the weekend to have my vehicle serviced and was turned away; first by the manager one day then again by the receptionist who informed me the manager instructed her not to accept anyone else. This was done despite the sign stating walk ins are welcome. I have never encountered a company of any kind that turns away paying customers until now. So my advise to anyone needing automotive services is to go somewhere where your business is appreciated.\n04/18/17", "pics": null, "resp": {"time": 1492722375292, "text": "Tameeka,\nWe would never want a customer to feel their business is not important to us. We appreciate you stopping by, however when we asked you to come in early the next morning by 7:30am, it is unfortunate that we were already full when you came in mid-morning. We always strive to do our best to accommodate all of our customers. If there is anything more we can do for you please reach out at (205) 786-8279. Thanks."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "110961888964367060570", "name": "Phillis Anderson", "time": 1574169467390, "rating": 4.0, "text": "Just picking up a car,  no complaints.", "pics": null, "resp": {"time": 1574199829517, "text": "Thank you for taking the time to leave us a review, Phillis! Let us know how we can earn that fifth star!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "105408928012271012094", "name": "Jayne Huddleston", "time": 1500388461818, "rating": 4.0, "text": "Great experience. Thank you so much for all your help, and not taking advantage of me.  Will spread the news.", "pics": null, "resp": {"time": 1500389196308, "text": "Thanks for the positive feedback, Jayne! We are always happy to help our customers out. Thank you for sharing your experience!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "110672068163941708423", "name": "Zariyah Williams", "time": 1554065009841, "rating": 5.0, "text": "Rebuilt transmission,they do great work,and their honest,robert dowdell,im sending my truck to them on monday.", "pics": null, "resp": null, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "117802833364307378252", "name": "Soul Jah", "time": 1496358569168, "rating": 1.0, "text": "WARNING! WARNING! ...Avoid at all cost!! This business is not what they claim they are. My P30 Step Van was towed in to get a refreshing and almost had to be towed away. I heard their ad on the radio, gave them a call and found out they service Cintas vans. I spoke to the owner Matt on the phone and he assured me that he was the place to come to and he would take care of me. I told him what I wanted done, I also left a list with the most important to be taken care of first (fuel tank leak and master cylinder replacement) with the receptionist. I mentioned new tires but didn’t decide what to install, but he did, and installed them without my consent. Later he said he thought that’s what I wanted “the cheap ones.” He decided to do what he wanted and void my concerns (that I spoke of on every visit). I was charged over $400.00 in parts (radiator, v belt and lug nuts) plus labor @ $74/hour added without my consent nor were they spoken of when I made payments in person. I was charged ($35.00) for an air cleaner that he had left from a previous vehicle and promised that he wouldn’t charge me for since I was getting so much work done. That Monday of week three, I stopped by to realize no work had been done over the past 5 days and I immediately stopped the work and told them I would be back in the morning to pick up and pay off balance. Next morning I waited over and hour for the motor to be pressure washed like he promised it would be done yesterday by lunch. While waiting he then decided that he would for free replace the master cylinder and patch the fuel tank leak with a $6.00 putty instead of replacing the tank like I asked on day one. All while repairs being done there were no actual receipt/list of parts and labor but guesstimations made until I made final payment. After I reviewed the receipt just before I paid the remaining $1,400+ balance I had to request that Matt break down and fix the double charges on receipt (I was so angry that I missed a few issues on the receipt). A week turned into a month and if I had not stopped the work there’s no telling how long it would have taken to get the van back. Now I’m weeks behind schedule on preparing for the van for body work and getting it wrapped.   The total cost was $3,863.68 and $1,417.25 of it was labor. I felt robbed and played. This place is not worthy of your money and will waste your time…. so please be advised! You are WARNED!!\nCROOKS CROOKS CROOKS CROOKS CROOKS CROOKS CROOKS CROOKS CROOKS CROOKS CROOKS\n\nH Russell Adair II\nWhite 1984 Chevrolet P30 Step Van\n\nP.S.\nI was charged $30.00 for brake fluid even though he knew the master cylinder was bad. I realized this after I paid. Also, the paper work was drawn up and balance paid before he decided to replace master cylinder.\nMatt told me the only man allowed to work on my vehicle had taken off several days due to court date and illness hence why the time frame was pushed back.\nHe spoke negatively about customers in front of me while they were on hold with the receptionist who also was not professional.", "pics": null, "resp": {"time": 1496431288541, "text": "Hello Mr. Adair,\nWe are sorry that you are not happy-- our customers are very important to us. In all fairness, when the vehicle was diagnosed the owner did recommend that you not repair it because the repairs would be more than the vehicle was worth. Considering you had just purchased it, and it was a 1984, you didn’t know how well it was maintained hence lots of wear and tear does equal extensive repairs. Again we are very sorry and would like the opportunity to speak with you. Please call us at 205-786-8279. Thanks."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "109707454186433727676", "name": "Carla Mc", "time": 1511130703619, "rating": 5.0, "text": "Great service! When you walk in, you're automatically treated like family. Reasonable prices and trust worthy! Even if you're a lady!! Lol! Thanks!", "pics": null, "resp": {"time": 1493128324322, "text": "We appreciate the review, Carla! We work hard to provide all our customers with the best service and products in addition to fair prices and honest work. We thank you for your business!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "115291238668228660421", "name": "anthony timpa", "time": 1364012534335, "rating": 5.0, "text": "I found out about this place through a friend of mine, he diagnosed, quoted a price, and fixed my car in an expedient manner, and was reasonably priced! heck, I feel like I got the family discount! I'd use this place again, and I live in Pelham! I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "107851782599612365368", "name": "That Guy", "time": 1572433003224, "rating": 3.0, "text": "Spectacular parking lot which is all I saw", "pics": null, "resp": {"time": 1572450869267, "text": "David, although you've never visited our shop, we appreciate your feedback and are here to help for any future automotive repair needs you may have. Thank you!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "107422424505667289159", "name": "Natasha Webb", "time": 1483217646291, "rating": 5.0, "text": "Best place ever! Very honest and affordable they do excellent work.I wouldnt trust anyone with my cars except Mr T's", "pics": null, "resp": null, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "111528543477231553124", "name": "jetlyfe jay", "time": 1580993181433, "rating": 4.0, "text": "Very friendly an helpful with great customer service", "pics": null, "resp": {"time": 1581004660046, "text": "Thanks, Joshua! We appreciate your feedback and look forward to seeing you next time you need us!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "107498289039148573122", "name": "Joseph Aweman", "time": 1432915770138, "rating": 1.0, "text": "I took my car to have the transmission repaired. After 1 week of them putting a 'brand new transmission in it' and blatantly overcharging me for parts and labor. Which was fine, because hey, my car was 'fixed'. Well, these Mr. fix its didn't fix anything as after about a week my transmission went out AGAIN. Luckily it was under warranty, but I was charged the towing fee PLUS the inconvenience of being without a vehicle for an entire week. On top of everything, I was referred to these jokes that could not even look me in the eye the third time I went in to pay the towing bill. Not sure how many positive reviews have come from their family members, but take it from this REAL review that these people are highly unprofessional. Needless to say, there will be no further referrals.", "pics": null, "resp": null, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "106189569499885749609", "name": "nicole hook", "time": 1497384073787, "rating": 5.0, "text": "They were very helpful and affordable I greatly appreciated all that they did for my car and they work very quickly. I had a great experience", "pics": null, "resp": {"time": 1497447108967, "text": "Hi, Nicole! Thank you for the positive feedback! We pride ourselves on providing all our customers with the highest quality of service at affordable prices. See you next time!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "114082218001988092209", "name": "EVANDER GAMBLE", "time": 1456350074859, "rating": 1.0, "text": "Good service but highly overpriced and there attitude towards customers is highly rude.. They smile in your face and take your money... I'd Trust the Midas touch before I let these guys work on my vehicle again", "pics": null, "resp": {"time": 1472157923894, "text": "Hello Mr Gamble, we are sorry we did not meet your expectations. I would like to speak with you concerning the problem you encountered, please call me at 205-786-8279 my name is Linda. I look forward to hearing from you!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "101086430511581070536", "name": "Bershante Murrell", "time": 1497384165110, "rating": 5.0, "text": "I Absolutely Love Them !! They Was Friendly And Provieded Me And My Family With Great Customer Service I Would Send Anybody To Them If They Needed They Car Fix . Thank You Mr T And Team 😍", "pics": null, "resp": {"time": 1497447460157, "text": "Thank you for the 5-star review, Bershante! We are happy to be the shop to take care of you and your family. We appreciate the shout out! Let us know if there is anything else we can do for you! Thanks again."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "111466197869776400159", "name": "AD Carter", "time": 1545415370954, "rating": 5.0, "text": "Second time getting a service done and I am satisfied so far. Stay tuned.", "pics": null, "resp": {"time": 1545839818605, "text": "We appreicate your support! Thanks for choosing Mr. T's!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "103305267474559000494", "name": "Robert Kelley", "time": 1464211369371, "rating": 5.0, "text": "Was a great experience for me...I took my car in for a simple oil change and tire rotation...however while my car was being serviced the mechanic not only  noticed that I really needed back brakes and rotors but that my front right axle needed to be replaced as well....thanks to the Sweet lady at the front desk and her mechanic for fixing my car!!!", "pics": null, "resp": {"time": 1464272997768, "text": "Thank you so much for taking the time to leave us your review Robert! I am glad that we were able to take care of you and give you the proper services to help you on the road! Please don't hesitate to let us know if you need our help again!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "103841322240128571485", "name": "Kick Work", "time": 1544030080590, "rating": 1.0, "text": "BAD REVIEW PLEASE  READ...This shop is the MOST disrespectful, unprofessional, money hungry group of people you can meet in the auto industry. I have spent over $10000 at this shop over the course of two years. THEY STOLE MY CAR.   WHEN I BROUGHT THE CAR IN IT WAS BLOWING BLACK SMOKE my car was brought in for a DAMAGED \"OIL COOLER\". A MAN BY THE NAME OF ROB claims he replaced the part totaling $650.  He then claimed he started the car and the engine failed.  Any MECHANIC WITH HALF OF A BRAIN KNOWS THE SYMPTOMS OF A BLOWN MOTOR...BLACK SMOKE MEANS MAJOR ISSUES HEKNEW THIS MOTOR IS BAD AND HE JUST WANTED A FREE CAR BECAUSE I CANT AFFORD TO GIVE AWAY $650 FOR NOTHING. This shop IS very expensive and NOT ONLY THAT they are shady and don't tell you what's really wrong with the car. They let you drive and break down again only to tell you that another part broke. DONT GO TO MR TS...I  WARNED YOU", "pics": null, "resp": null, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "105854160586278698657", "name": "Dan Mckay", "time": 1554742777083, "rating": 5.0, "text": "Last minute he put a different rear end in my truck within 4 hours....very professional and very friendly...appreciated the friendly workers..thank you for making a bad morning become a great day..", "pics": null, "resp": {"time": 1554745897305, "text": "Cassidy, thank you for the great review. Our goal is to provide our customers with an unbeatable experience every time!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "118115502535625459422", "name": "Just Tim", "time": 1471317974302, "rating": 5.0, "text": "The best shop in Birmingham. If you need it done fast and accurate, check out Mr Ts.......", "pics": null, "resp": {"time": 1471383103130, "text": "Thank you! We appreciate your business as well!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "106923497253314311075", "name": "John Williams Jr.", "time": 1566560333896, "rating": 2.0, "text": "I gave mr. T's Automotive over $10,000 of my business and I really wasn't satisfied the work is real shabby and you always have to go back for other reason he's never proactive about fixing older cars and they are very expensive", "pics": null, "resp": {"time": 1561494444765, "text": "Mr. Williams, I am surprised to hear this. Our records show the following services done for you since  2017: Electric Fuel Pump, Hydro Cylinder, Carburetor, Power Steering Pump, Clutch Slave Cylinder, 2 door handles, an oil change and battery charge, Thermostat Gasket and Housing, PVC Valve, Belt and Tensioner, rear Brakes, Hydraulic Winch, and a Distributor. You have come to Mr T's for 16 totally different repairs over a 2 year span. Futhermore, we originally advised you not to purchase this vehicle due to the repairs it would need. So it's no suprise to us that you've needed so much work done on the vehicle, and we've done the best that we can for you.  We understand that you don't need to use us any more, and we wish you well."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "114621017395052074707", "name": "JM Doug", "time": 1355056331725, "rating": 5.0, "text": "Like The Man Who Wears The Star ... you can trust your car to Mr. T's. (5 star business to me) I have over 40 years of owning used cars or trucks. All have needed mechanical work. It's not easy finding an Auto Shop that you can trust. I got lucky and found MR. T's. Twice they have helped me when I was in a bind :( They are very friendly , reasonable prices and their speed of service amazes me. I would like to THANK all employees and the owners of such a 1st. class business. I know they are not perfect BUT they try. I look forward to dealing with them again. Thanx again MR. T's. P.S. ..Petty, Earnheart and Force would want ya on Their team.", "pics": null, "resp": null, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "116371229961461591670", "name": "Eddie Holt", "time": 1523996139487, "rating": 5.0, "text": "I had a motor put in my car in Mississippi, and after installation no one could get the car to start, including several locksmiths. Needless to say I remembered Mr T's from past experiences, and I went to the shop and explained my problem to them. I was told by the manager they that they can start it....folks, I hauled my car from Mississippi, and Mr T fixed it (and it was in a mess)! Also, they gave me a Military discount.....thank You Mr T...you did what no one else could do, and at an affordable price,....Ed Holt", "pics": null, "resp": {"time": 1523998732681, "text": "We love to hear that, Ed! Thanks for taking the time to share your experience with us, as customer feedback helps us to build our business. If we can assist with anything additional in the future please let us know. Thanks again!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "118145335916593503676", "name": "Charles X", "time": 1598807471700, "rating": 2.0, "text": "It take one month for repairs", "pics": null, "resp": {"time": 1599836598773, "text": "Charles, thank you for your feedback regarding your most recent service with us. Please give us a call at (205) 578-0310, so that we may discuss your concerns further. Thank you."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "102209594413489163634", "name": "Deona Flowers", "time": 1539600381008, "rating": 5.0, "text": "This shop fixed my car when I thought all hope was lost. I had an entire other mechanic to \"fix\" it but it went right back to the issue! I stopped in to just diagnose it but then 2 days later they called to say it was FIXED and it has never stopped working again! That was 3 years ago.", "pics": null, "resp": {"time": 1539806238075, "text": "Deona- We're happy to know even three years later your still a happy customer! We appreciate the feedback. Please let us know if we can assist with anything additional on your next visit in. Thank you!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "115183531253182298899", "name": "shamyria bester", "time": 1497384148653, "rating": 5.0, "text": "Great customer service loved everything about them they do wonderful work .", "pics": null, "resp": {"time": 1497447350898, "text": "Shamyria- We appreciate the feedback! Thank you for sharing your experience at our shop!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "110382879536540008581", "name": "Karen Glover", "time": 1499552956928, "rating": 5.0, "text": "Won't have to say the prices are very reasonable service is good and when you're told they're going to have something done they do it.", "pics": null, "resp": {"time": 1499694594989, "text": "Thank you for the positive feedback, Karen! We appreciate your review and your business!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "107393327064147931083", "name": "Ricci Creger", "time": 1487000760131, "rating": 5.0, "text": "Reasonable prices, helpful, work is done quickly and they are very accommodating.", "pics": null, "resp": {"time": 1491572225104, "text": "Ricci- thank you kindly for sharing your experience! Your feedback is important to us!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "111688787811693223149", "name": "JAMES WASHINGTON", "time": 1568414082484, "rating": 1.0, "text": "Fair prices, and great work.", "pics": null, "resp": {"time": 1568755424038, "text": "Thank you James for the compliment! We're happy to hear that you enjoy our prices and the quality repairs that we do. Please let us know if there's anything else we can assist you to make your visit a 5-star experience by giving the shop a call at (205) 786-8279. Thank you!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "105379002831210517785", "name": "dara cunningham", "time": 1464814160518, "rating": 5.0, "text": "Excellent service ! Everyone was so nice and car was taken care of immediately, would recommend this place to anyone", "pics": null, "resp": {"time": 1464807060451, "text": "Thank you for the review Dara! We really appreciate it!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "105710050327064799275", "name": "Adamu Shauku", "time": 1504898155626, "rating": 5.0, "text": "Low cost, honest, stand behind their work, friendly service, local shuttle provided.", "pics": null, "resp": {"time": 1505136726975, "text": "We appreciate your review and your business with us, Adamu! Thank you for taking the time to share your experience. We'll see you next time!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "112291804601167747048", "name": "Belinda Powell", "time": 1522860698997, "rating": 5.0, "text": "I love them!!aThey are determined to fix your. Car problems.☺", "pics": null, "resp": {"time": 1522861414049, "text": "That is true! We will always do our best to serve you! Thanks for the positive feedback, Belinda."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "109077259901014657466", "name": "endrick smith", "time": 1537808889345, "rating": 1.0, "text": "Sucks would never let them work on a hot wheels car", "pics": null, "resp": {"time": 1539886541526, "text": "Endrick- Please call us at the shop at your earliest convenience. We are eager to learn the details of your visit as we have no one in our customer database matching the name above. We hope to speak with you soon, as we take customer feedback very seriously. Thank you."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "101513879657938932336", "name": "Cal L", "time": 1573134707877, "rating": 5.0, "text": "Best to go great price", "pics": null, "resp": {"time": 1573244628480, "text": "We appreciate the great feedback, Cal :) --  We look forward to seeing you again in the future for your automotive needs."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "108268408344998396842", "name": "Jo Anna Kitchen", "time": 1455056065194, "rating": 5.0, "text": "Good work and pleasant staff...work done on time and right.", "pics": null, "resp": null, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "114374925798960383315", "name": "morris Mack", "time": 1579888964407, "rating": 5.0, "text": "Because they are good", "pics": null, "resp": {"time": 1580145959223, "text": "Thank you Mari for the 5-stars and for your continued support of Mr. T's Automotive! We appreciate your business."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "109413996138127176166", "name": "Debra Cupp", "time": 1570736648255, "rating": 5.0, "text": "Does good work", "pics": null, "resp": {"time": 1570830630521, "text": "Thank you for the 5-stars and great feedback, Debra! We appreciate it!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "106895425183098885432", "name": "Eric Williams", "time": 1601058831478, "rating": 5.0, "text": "Great", "pics": null, "resp": {"time": 1601068979931, "text": "Thank you Eric! We'll see you next time!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "116488538186665815435", "name": "Wendy Graham", "time": 1492558549696, "rating": 5.0, "text": "Absolutely the best customer service ever!", "pics": null, "resp": {"time": 1492612778973, "text": "Thank you for the positive feedback, Wendy! We love hearing from happy customers!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "114086115671266502464", "name": "Brenda Boyd", "time": 1517511257369, "rating": 5.0, "text": "Very happy with work an Staff.", "pics": null, "resp": {"time": 1517514031636, "text": "Thanks, Brenda! We're always glad to help!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "104665118143487051673", "name": "Susan Cook", "time": 1517572972432, "rating": 5.0, "text": "Great Service, they solved a problem 2 other places couldn't! I will be a customer for life!!", "pics": null, "resp": {"time": 1517840393794, "text": "Hi, Susan! We appreciate your support! Thanks for taking the time to leave us a review. We look forward to being your go-to shop from here on out. Thank you, again."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "113410942687793715859", "name": "Dominic Moore", "time": 1597426558401, "rating": 1.0, "text": "Poor customer service", "pics": null, "resp": {"time": 1597441602024, "text": "Thank you for your feedback. We are sorry to hear about your most recent experience at our shop, and would like to learn more about your visit. Please give us a call at (205) 578-0310, so that we may learn more about your experience with us, and address any concerns you may have. Thank you."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "116795497471078843941", "name": "Marvin Shelsky", "time": 1513742241893, "rating": 5.0, "text": "Always quality service.", "pics": null, "resp": {"time": 1473340856634, "text": "Thank you for the review Marvin! Glad we're providing quality services to you."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "107238700676480035417", "name": "Kia Cooper", "time": 1495870879813, "rating": 5.0, "text": "Customer Service was nice!", "pics": null, "resp": {"time": 1496157260447, "text": "Thanks, Kia! We are happy to have earned your 5-stars!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "114298946641163454690", "name": "Wallace Chaney", "time": 1531746520246, "rating": 4.0, "text": "I love this place they fix the problem", "pics": null, "resp": {"time": 1531757358475, "text": "Thanks for the support, Wallace!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "102491993690074757807", "name": "alphonso lewis", "time": 1505987750209, "rating": 5.0, "text": "Beat in town. Gets the job done right!!!!", "pics": null, "resp": {"time": 1505996156336, "text": "thank you we try very hard.Thank you for your business"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "106742367671391366248", "name": "Jerri Marie Vice", "time": 1525118183244, "rating": 5.0, "text": "Great group of people", "pics": null, "resp": {"time": 1525119502841, "text": "Jerri- Thank you for your support! We appreciate it!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "112821153858020276013", "name": "Paul Williams", "time": 1471869438646, "rating": 1.0, "text": "Crooks posing as car service professionals. Run now!", "pics": null, "resp": {"time": 1472157226973, "text": "Hello Mr. Williams, I’m sorry you had a bad experience. We’ve been in business 30 plus years and we strive to create the best possible  experience for every customer but  on occasion we may not have met a customers expectations and it sounds like that is the case here. I have looked for you in our customer data base but am not able to find you, I would like to try to rectify the issue that has made you dissatisfied.  I am the owner my name is Linda, please call and ask for me 205-786-8279. I look forward to hearing from you!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "111550944386246642923", "name": "LINDA TORTORICI", "time": 1567162240475, "rating": 5.0, "text": "Go see them", "pics": null, "resp": {"time": 1567522050525, "text": "Thank you, Linda, for the 5-stars and the recommendation! We appreciate your support, and we look forward to assisting you the next time you need us!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "103627362629690428969", "name": "Arthur Watson", "time": 1547737572078, "rating": 5.0, "text": "That do what they say they are going to do", "pics": null, "resp": {"time": 1547745982692, "text": "Thanks for the 5-stars, Arthur! We are grateful so serve you!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "103219979244091669614", "name": "George Alexander", "time": 1574211085567, "rating": 4.0, "text": "Very please", "pics": null, "resp": {"time": 1571176804657, "text": "Thank you George, for taking the time to leave us a review. We'll see you next time!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "113475379096110354162", "name": "Mike Ware", "time": 1477687231073, "rating": 5.0, "text": "It was painless", "pics": null, "resp": null, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "108425403940704330314", "name": "Cathie Johnson", "time": 1508420627620, "rating": 5.0, "text": "Wonderful service!!!", "pics": null, "resp": {"time": 1508421411413, "text": "Thank you Cathie! It's great to hear from happy customers, we appreciate you."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "106511180530300758227", "name": "Ivorie Crear", "time": 1544527958262, "rating": 4.0, "text": "Friendly staff", "pics": null, "resp": {"time": 1543250425534, "text": "Hi, Ivorie. Thank you!"}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "117351819065221784942", "name": "Valencia Cheatom-Evans", "time": 1495156546020, "rating": 3.0, "text": "Close", "pics": null, "resp": {"time": 1495212687206, "text": "Valencia- thanks for the review! We look forward to providing you with a 5-star experience on your next visit in."}, "gmap_id": "0x8888e1ecf9f042b3:0x2b83686c18294477"}
{"user_id": "105517745393849096956", "name": "Steve Pierce", "time": 1608242705011, "rating": 5.0, "text": "I’ve used this company on a few repairs (the most recent was one I created) and every exchange has been professional, quick, and priced fairly. I’ve dealt with Rick each time and he’s a great guy to work with.\nFive stars for me-\n\nSteve Pierce\nCoast Equipment Services", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "114549923175477789635", "name": "Dwight Keener", "time": 1558263235355, "rating": 5.0, "text": "Great price on a fuel injector pump rebuild. Saved me from buying a new one. Great job.", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "103945743370275520911", "name": "Larry Miller", "time": 1592127830442, "rating": 5.0, "text": "Best turbo repair shop", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "113004782316400347088", "name": "Victoria Edwards", "time": 1570130406856, "rating": 1.0, "text": "BEWARE!!!!!! Do not buy a turbo from this place!!! We bought a turbo for $1600 dollars and 3 weeks later it went out and now they don't want to cover it with the warranty. This is the worst service I have ever received and a WASTE of money. I got children to feed.", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "100869027137899215669", "name": "Chloe Barr", "time": 1560412073470, "rating": 4.0, "text": "Really enjoy the customer service :)", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "112283004879325645899", "name": "Capt Tom Adams", "time": 1467050154012, "rating": 5.0, "text": "Test CalibrationGreat place for turbos and injector pump rebuilds!!! Nice folks too ! Tom Adams Mexico Beach Charters", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "110933377730012459235", "name": "Jackie Neese", "time": 1502726785374, "rating": 1.0, "text": "I have been dealing with this company for a year and they refuse to stand by their parts- if you can get coverage for the part your lucky but you will never see a dime for labor compensation. DO NOT use them ever!!! Deal with someone who will stand beside their parts and back them with labor coverage. They are horrible to deal with!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "105455062300893771772", "name": "Jon Lewis", "time": 1505838965983, "rating": 5.0, "text": "I have known Rex and his wife, Denise, for approximately five years, and my family and I have not only used them to fix our cars, but I have also used Rex as an expert in several of my lemon law cases.  Rex is reasonably priced and very good at what he does.  He is knowledgeable and shoots straight with his customers.  I highly recommend Rex.", "pics": null, "resp": null, "gmap_id": "0x88891b8d987d66a9:0xa661fcfed3797aa4"}
{"user_id": "117066918072070666746", "name": "Glitch01", "time": 1506452102658, "rating": 5.0, "text": "Good auto shop.  I know enough about cars to do my own work if I have equipment and time.  Prices are very reasonable and the mechanics are knowledgeable and honest.  They will not sell you something you do not need.  Recommended from a DIY car guy.", "pics": null, "resp": null, "gmap_id": "0x88891b8d987d66a9:0xa661fcfed3797aa4"}
{"user_id": "102135271507524470382", "name": "Kelly Thurber", "time": 1413940335899, "rating": 5.0, "text": "Rex and Denise are awesome. Great customer service and they kept my old Volvo alive way beyond my expectations as I drove it pretty hard. I don't even live in Alabama anymore, but I try to schedule my regular maintenance with them when I travel to Birmingham!", "pics": null, "resp": {"time": 1414091168579, "text": "That was a great car, Kelly! It was our pleasure to keep it going. We'll see you next time! Best, Rex - Owner"}, "gmap_id": "0x88891b8d987d66a9:0xa661fcfed3797aa4"}
{"user_id": "111647297595267044220", "name": "LaToya Elms", "time": 1452183576009, "rating": 5.0, "text": "My husband and I have had a Acura Vigor and a 12' Maxima that have went through Rex. He does great work with reasonable prices. We've never had a problem with customers service either. I'll recommend this business to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891b8d987d66a9:0xa661fcfed3797aa4"}
{"user_id": "100934665268075690291", "name": "Dnika Joseph", "time": 1414008025036, "rating": 5.0, "text": "As a person who knows very little about cars, I never question what Rex says. This is one auto service I can always count on to be honest, and never try to abuse my naiveté. I highly recommend their service.", "pics": null, "resp": null, "gmap_id": "0x88891b8d987d66a9:0xa661fcfed3797aa4"}
{"user_id": "103250163776759347007", "name": "Ali K", "time": 1474349214200, "rating": 5.0, "text": "I brought my car and they found the problem fast. Gave me good deal but didnt take it. Ended up expensively ;(", "pics": null, "resp": null, "gmap_id": "0x88891b8d987d66a9:0xa661fcfed3797aa4"}
{"user_id": "114713710862008884130", "name": "challthr", "time": 1429193443214, "rating": 5.0, "text": "Rex has worked on our cars for almost 20 years.  HONEST, reliable service by skilled technicians. They will phone you with updates on what needs attention and an estimate of cost.", "pics": null, "resp": null, "gmap_id": "0x88891b8d987d66a9:0xa661fcfed3797aa4"}
{"user_id": "111564768105299422307", "name": "Jonathan Landham", "time": 1414161452188, "rating": 5.0, "text": "The best place to go for fast, trustworthy service, expert knowledge--and great company. Rex and Denise are a Birmingham fixture, and I wouldn't trust anybody else.", "pics": null, "resp": {"time": 1414600938382, "text": "Thanks for the nice shout out, Jonathan! You know you can always count on us to take care of your ride. See you soon! Best, Rex"}, "gmap_id": "0x88891b8d987d66a9:0xa661fcfed3797aa4"}
{"user_id": "107244025694048427378", "name": "donna glista", "time": 1620661023426, "rating": 5.0, "text": "They are amazing! Couldnt imagine taking my car anywhere else! Hardworking guys who are  great!!!", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "103975656850969328077", "name": "Robb Young", "time": 1507122315661, "rating": 5.0, "text": "I can't say enough about the great service I received from them! My 2006 Infiniti G35 coupe jumped time on me... Paul quickly went and picked it up with the tow truck, took it back to their shop, and figured out that it had caused valve damage in my motor. Unfortunately this was very bad news, but he went way above and beyond to find me a good used motor to replace my damaged one. They saved me a lot of money and had it ready to go in less than a week.! Not too many shops will go so far out of their way just to save you some money like they do... I highly recommend them for any vehicle services, and they always seem to have a good selection of used cars priced very fair..", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMDQzoNrBorrBZCbGOp6-HQUTd3pQ6ranjjj8Hl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNwTRuRFY-5O_xTlYYhLpisTOQ6C9ZFZYn0x9Sj=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "112854685474798362839", "name": "Ned Mongar", "time": 1615763671699, "rating": 1.0, "text": "Bought a car from Blake the mechanic seemed like a good car but already have found the exhaust was muffler taped and painted to cover it up only a $150 parts it was the Y pipe Said he was selling due to getting bigger family but I'm wondering if this car has alot more problems than he disclosed at sale. If he takes care of his own car this way just hate to see how he takes care of anyone else's... Will keep posted as what all goes wrong with the car as I've only had it a month", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "100533454459883363491", "name": "Dee Osborn", "time": 1597886262728, "rating": 5.0, "text": "Eddie and Ruben are the best. They give you great service for a fair price,Eddie will towe you in at a low price and do any and all repaires that are needed. If you cant be repaired he will put you in a good dependable used car for a  lowe payment every month or week.", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "113081637316400020841", "name": "Roger Simpson", "time": 1593060750452, "rating": 5.0, "text": "Fair prices, honest people. They do great work", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "116682733458789824776", "name": "Jeff Cook", "time": 1570798162331, "rating": 5.0, "text": "You wont find a better place to take tour car. Their prices are way better but with an exceptionally high quality work. They went above and beyond to make sure I was taken care of.", "pics": null, "resp": {"time": 1573279727713, "text": "We appreciate your business. Quality."}, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "116463826818769542219", "name": "Sam Stand", "time": 1572723147834, "rating": 5.0, "text": "Great place and fast service! I needed my car looked at asap and other places said a week. I called and he told me to come and he would fix it today. They werent even open. Soo blessed to have found them!", "pics": null, "resp": {"time": 1572980489517, "text": "We appreciate your business!"}, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "106601847263942564183", "name": "JW Stewart", "time": 1580922593676, "rating": 5.0, "text": "Professional staff. Very hands on and knowledgeable. Not pushy. Very thorough.", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "117807427212976116464", "name": "Billy K", "time": 1570670881300, "rating": 5.0, "text": "Great place to take your vehicle that might need some help.", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "110055252910325013201", "name": "Josh Franklin", "time": 1554063897285, "rating": 5.0, "text": "Very friendly and helpful. The owner is a great guy and will help you any way he can.", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "101325928617189428441", "name": "Patsy Williams", "time": 1550882101137, "rating": 5.0, "text": "I was amazed how thecyoung men helped me out ... They couldn't order the part I needed to they remodeled my part !!\nVery personal\nIll definitely be back", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "117814834012204703077", "name": "Anita Williamson", "time": 1520884171817, "rating": 5.0, "text": "Very helpful with my vehicle's problems. Solve in a timely manner. Work preformed was at very reasonable rate. Would recommend to others.", "pics": null, "resp": {"time": 1520889611277, "text": "THANK YOU FOR YOU REVIEW AND BUISENSS"}, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "101052016113576593661", "name": "Justin Hays", "time": 1525146832687, "rating": 5.0, "text": "Quality Used Automotive is the place to go for all your automotive purchase and repair needs. Located in Trinity, it's location is perfect for ease of finding and access. It's also on the same lot as a local tow truck company. Owned and operated by some great people, they are staffed with equally great salesmen(and women) and talented mechanics. They use top end high tech machinery to get most any job done and done well. As a Uber/Lyft driver partner, I need to maintain my SUV as best possible, both for the life of my vehicle and the safety of my passengers. That's why I come right here. Quality always bests quantity, and I know they understand that here.", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "114960374439477560605", "name": "7 Link", "time": 1596755758426, "rating": 1.0, "text": "messed up my friends d21 engine", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "103187472725324850253", "name": "Deanna Journey", "time": 1549507796427, "rating": 1.0, "text": "Worse car lot I've ever been too. Very young owner. Lack of experience. Expensive cars that have many flaws and not detailed. Very dirty. Found personal items inside many of them. Looks like they may use them after hours.", "pics": null, "resp": {"time": 1552706927934, "text": "Hello, and Thank You for your feedback!  We are a repair facility as well as a Used Car Lot.  We DO drive the vehicles on our lot often to make sure that they are up to the standards that we expect to provide to our customers.\nIf you were not impressed or didn't have an enjoyable experience here, then we apologize.  Our facility is staffed with persons of experience and age and our prices reflect the value of our vehicles, not our repair shop customers vehicles.   Your feedback will help improve our facility."}, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "112976979732464609753", "name": "Paul Lamon", "time": 1602089878025, "rating": 5.0, "text": "Best ever", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "116079746130514355533", "name": "Monica Parker", "time": 1543863455609, "rating": 1.0, "text": "I don't recommend this mechanic for repairs or service. He kept our car for almost two months before repairs were complete the low rating is based on customer interaction, service, reliability, and honesty.", "pics": null, "resp": {"time": 1544128605405, "text": "Ma'am please let me know what vehicle you are talking about, questioning my/our honesty and integrity"}, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "102956875421765880239", "name": "Donald Norwood", "time": 1521568297994, "rating": 5.0, "text": "Honest, caring, dependable people. Cars for all budgets. Great mechanic work.", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "117394724252291571435", "name": "Heather Richards", "time": 1509907009790, "rating": 5.0, "text": "Great owners. They will work with you on the financing they also have an on-site mechanic shop this is a family-owned operation and they also will go to the auction and pick a car for you if you come ahead of time and let them know what your need or desire is conveniently located in Trinity which is really Decatur nowadays all you have to do is go to a pole 24 Trinity mountain and they are right at the top on the left can't miss it check them out", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "105411657758212650599", "name": "pablo furnace", "time": 1504119112724, "rating": 1.0, "text": "If we could give less than one star we would. Please never go here. We purchased a vehicle and January and have yet to receive the title from Jason Norwood or Paul Lamon. We have heard countless excuses and are unable to get a competent answer from anyone at this company. We have requested the surety bond company information to file claim but they are uninsured or unaware what company bonded them. This place is the epitome of the sleazy car dealership stereotype. Please don’t buy here or do any business with these people ever.", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "117314362004419678432", "name": "Chas Dutton", "time": 1569546976516, "rating": 2.0, "text": "He replaced a bolt that had fallen out on my control arm and charged me 75.00 I thought was high", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "107514470743437905032", "name": "David Vaughn", "time": 1524701028349, "rating": 1.0, "text": "Drove an hr and a half to look at a vehicle. Called before I left and said when I would be there. Even messaged seller when I was half way there. I showed up and nobody was there. Very irritating. They clearly don't care about your business so I wouldn't give it to them.", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "102121559603838574218", "name": "Jeremy Reeves", "time": 1537496587695, "rating": 5.0, "text": "Honest and do work at a fair price!", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "105843631890158484099", "name": "Doreatha Gillespie", "time": 1563774413329, "rating": 5.0, "text": "Great bunch, good work!!", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "104866362119300842111", "name": "Dion Huey", "time": 1553399412525, "rating": 5.0, "text": "Fast and great service", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "104848748875081530049", "name": "Shelly Shelton", "time": 1497474179770, "rating": 5.0, "text": "The guys are GREAT", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "113621650691510298532", "name": "Marquita Holt", "time": 1480034211587, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x88629b127b65e733:0xd757d52b1a91d1"}
{"user_id": "111347898632323897661", "name": "T. Ferguson DiazBrothersFan", "time": 1555210469728, "rating": 1.0, "text": "I gave one star because the girl at front is very sweet and there was a helpful guy, but we left car on a Wednesday at 10am. I explained we really needed the car asap because I have cancer and lupus etc and will be hard for me to give people rides to work etc at 5am! They explain there was cars in front of mine (6) Thursday it was to be done...nope! Friday the were sure by then...NO, the mechanic that looked at it had left for the day and weekend. The other mechanics had jobs and they couldn't get to mine...nothing! They need a mechanic for minor jobs like mine (bearings to be replaced) and other mechanics for the bigger jobs...if you got one car and need it done same or next day or actually in three ...don't go here! I feel the mechanic that looked at the car should have just fixed it. Oh they were supposed to have called as well..no such thing happened, the mechanic just didn't want to do the job! I have never taken a car somewhere where they did not have their stuff together like this place! Never even called for a status update or to tell us anything about the car! Taking car to another place who can have work done in one hour!!! The car set there for 3 days!!!!!", "pics": null, "resp": null, "gmap_id": "0x8888c4e6e0b99431:0x62babd6da353f44f"}
{"user_id": "110656466573275137435", "name": "Carole Juarez", "time": 1571253309847, "rating": 5.0, "text": "Amazing company!!!  We were referred by discount tire. Polite hard-working people. Thank you for putting us back on the road so quickly. Feeling safe Carole", "pics": null, "resp": null, "gmap_id": "0x8888c4e6e0b99431:0x62babd6da353f44f"}
{"user_id": "112607602553102294006", "name": "Joe Shultz", "time": 1541797282432, "rating": 1.0, "text": "I went there for a new water pump for a Chevy SUV. A new water pump was installed, but didn't last 100 miles. I returned the vehicle only to have the auto shop refuse to replace the water pump free of charge. I removed the water pump that weekend to find they cross threaded the new water pump and warped the unit. No wonder it did not function properly. After re-tapping a couple of screws and several hours out of my Saturday I replaced the new pump myself. Now I am out the price of another water pump, thanks a lot.\n\nMany people do not know this, but each repair job has an attached amount of time associated with it. So, if an auto center changes your brakes in 30 min but the book says it takes 1.5 hours, then the shop charges you for the extra hour as an extra rake. Now, I do not mind paying the extra as long as the quality matches. This shop may do quick work, but it is not at the quality I am paying for. Poor value given, and they would not make it right either. Basically the repair guy did not remove all the necessary components (like a radiator) to save some time and shoved the water pump in at an angle.\n\nI will never use them again.", "pics": null, "resp": null, "gmap_id": "0x8888c4e6e0b99431:0x62babd6da353f44f"}
{"user_id": "110828088194437221454", "name": "Heather M", "time": 1507858796400, "rating": 5.0, "text": "Griffin is a lifesaver! My truck blew a spark plug and I had two kids with me along with my husband. We were about 300 miles from home! I thought we were stranded and repair was going to cost a fortune. Griffin used his OWN vehicle to drive 3 exits up to assist us. He was able to get the undamaged spark plug back in and also brought us a brand new coil pack and put it in. He did this repair out of the kindness of his heart and we cannot thank him enough! He was honest from the get go. He could have told us the truck needed a new head or worse and made a ton of money, but he fixed the problem quickly and didn't charge us a fractuon of what he could have! Thank you Griffin, you were our Angel! His shop may be behind sometimes, but he is worth the wait if you want an honest mechanic!", "pics": null, "resp": null, "gmap_id": "0x8888c4e6e0b99431:0x62babd6da353f44f"}
{"user_id": "109319938818633925137", "name": "Sheree Lewis", "time": 1527133493906, "rating": 5.0, "text": "New owner, great guy great work! I recommend this place for all your auto work .", "pics": null, "resp": null, "gmap_id": "0x8888c4e6e0b99431:0x62babd6da353f44f"}
{"user_id": "107950437258188919050", "name": "Travis Gibbs", "time": 1482204094044, "rating": 1.0, "text": "I brought my car and truck to them when they first opened. They fixed both and stuck to fair estimate.\n\nI wouldn't do business with them now after my last experience.\n\nMonth 1 & 2\nOur car needed a new engine. The shop owner wanted to get an engine from his supplying junkyard. He missed one that became available. This process took about 2 weeks before we decided to find an engine ourselves which he was not happy with but agreed to. He said they could have it put in within a 3 day period. The engine company we bought from needed it done in 10 days for warranty purposes. Griffith used all of the 10 days to because other cars came in front of me while we had to wait on engine. They finally got it in and started but had to send to dealership because the car went into anti-theft mode and wouldn't start. We had to actually arrange the drop off to the dealership ourselves. I feel like we were running his business for him because he was almost never there. The employees even mentioned that problem in passing.\n\nMonth 3\nWe become worried after not hearing anything from dealership or Griffin for about 2.5ish weeks. I had to contact dealership for them to tell me that they told Griffin that the car needed a major fuse panel that could be $1200+. I called Griffin to tell him I approved the install because we really needed the car. It's month 3 folks!\n\nIs it Month 4? Getting close anyway.\nWe had to go ourselves to the dealership to confront them about not getting to our car. This should be Griffin's job. The dealership says that the part didn't fix the problem. Car still doesn't work. We decide to give up because the car needed another part for $2400 to \"maybe\" fix. We decide to just give up. Dealership is trying to get more money from us even though they didn't fix the problem. Griffin is trying to put that on us. We said we would pay for his time, but does this seem fair? Griffin himself might be a knowledgable mechanic, but he is a rookie business owner with no organization or management skills of his people.  He wasted a huge amount of our time (3+months), money ($6000+) and stressed my wife and I to no end. We are going to have to scrap our car with a new engine that doesn't run.\n\nThey do good oil changes and put a muffler on another car we brought, but he also made me pay for the part up front which shows bad business to me as well.\n\n* FINAL RESULT\npaid griffin $1400 because the car ended up not working out. He said he made no money and it would have been $2000 if it had worked + whatever it would be to charge AC. When we walked in to pay he didn't even recognize us. My wife and I talked to this guy several times in person and on phone. The waiting area had mice running around too FYI if you are scared of them. After that we went to the dealer shop that had our car and basically gave it to the tech working on it. he paid for the dealer work and gave us a little cash. When we went to clean the car out I noticed that the driver seat leather looked very dirty and worn. Griffin said he was sorry.", "pics": null, "resp": null, "gmap_id": "0x8888c4e6e0b99431:0x62babd6da353f44f"}
{"user_id": "108473209869977531443", "name": "Kristina Garrison", "time": 1483890633370, "rating": 1.0, "text": "I am honestly disappointed, this shop has Amazing POTENTIAL. However, I don't feel it is being ran efficiently. I have called with no answer, mupltiple occasions. I also have the concern of the child/childern that are running through shop all day, most days. I have also had to keep from hitting many toys, many times. I believe the shop is in an amazing location, and again has all potential in the wprld. Unfourtnally, right now, I wouldn't recommend it.", "pics": null, "resp": null, "gmap_id": "0x8888c4e6e0b99431:0x62babd6da353f44f"}
{"user_id": "111590927505438535548", "name": "Chris Ruffin", "time": 1476732640164, "rating": 5.0, "text": "I moved to McCalla in March of 2015. I was looking for a dependable repair shop that did quality work and that I could become a repeat customer with. I chose Griffin Automotive because they are ASE certified and after using them with 3 vehicles (06 Nissan Altima, 05 Chevy Silverado, & 2015 Nissan Altima) I have had no complaints with them.\n\nThey do great work, and are realistic with their estimates. If you are looking for a repair shop with a quick turnaround (meaning hours instead of days) then this may not be the shop for you, but I have a spare vehicle and can leave the vehicle for repairs.  They typically tell me that they have other vehicles in front of mine, but will look at it as soon as they get a free moment. I have sent my cars or truck to them at least 9 times (using both the overnight drop box and just bringing it in) and have only waited longer than a day once (and that was because the part got their late in the evening and I picked it up after work the next day)\n\nI have had multiple types of jobs: brakes pads for Altima and Silverado, rotors for Altima and Silverado,, brake drums for Silverado, oil change for Altima and Silverado, window regulator replacement on Silverado, oil leak repair on Altima, engine mounts on Altima, transfer case replacement Silverado 4x4, along with other normal maintenance type items", "pics": null, "resp": null, "gmap_id": "0x8888c4e6e0b99431:0x62babd6da353f44f"}
{"user_id": "107696584351107496497", "name": "Joel Banyai", "time": 1605136280282, "rating": 5.0, "text": "In the past few months I've had work done and sent multiple friends to this shop. They've fixed cars other shops won't touch (or messed up), and saved my friends and I a ton of money. We all know warranty work doesn't pay the bills, but when an alternator they had rebuilt and installed failed, they had a new alternator swapped in the next morning. On another repair they offered a good used part they had on hand for much cheaper instead of charging for a brand new part. Another car had a strange symptom; they correctly diagnosed two cascading failures up the line and fixed everything. If a repair isn't going to be cost effective, they'll tell you that too.  I'm extremely pleased. You won't go wrong going here.", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "113170035828590986453", "name": "Lisa P", "time": 1599138306860, "rating": 5.0, "text": "Quick service. Great price.", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "111208463373245123319", "name": "Jane Knauss", "time": 1584125043337, "rating": 5.0, "text": "Very nice and knowledgeable. Quick turnaround and reasonable prices. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "112107226880004550926", "name": "Alexandria Haley", "time": 1598507209583, "rating": 5.0, "text": "This man does an amazing job with rewiring...", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "106129296149127023476", "name": "Ikram Singh", "time": 1567640014725, "rating": 4.0, "text": "I think they did a pretty decent/good job on my windshield wipers and front window rotor. Had the car ready the very next day. The guy is a PROFESSIONAL but I think I was OVERLY CHARGED !!\nIf it was not for the HIGH CHARGE I would definitely visit this place again.", "pics": null, "resp": {"time": 1576084685450, "text": "We appreciate your business and we believe our prices are very competitive."}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "101397981434405686581", "name": "Josh Knowling", "time": 1547922430396, "rating": 5.0, "text": "I recently took my truck to Russell Brothers with a tricky electrical issue that had persisted despite previous mechanic's best efforts.  I was skeptical at first that a solution would be reached.  Initially, Russell Brothers did fail in their first attempt at correcting it, despite having replaced expensive components.  However, after a couple of return trips, their persistence paid off and they expertly diagnosed and ultimately corrected the issue for good.  I would like to thank technician 'Jim' in particular in showing great integrity, reaching out to me when he knew the issue was not correctly repaired.  Will used their service again in the future, as well as recommend it to others. Thanks fellas!", "pics": null, "resp": {"time": 1549736421341, "text": "Thank you Josh! We truly appreciate you taking the time for the awesome review!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "108700960294994844581", "name": "jdblackbelt", "time": 1539147778687, "rating": 5.0, "text": "I have been bringing my vehicles here for service and maintenance for 10 years now. They regularly charge me half what the dealership has quoted me for the same job. They're always busy (as people have caught on they do phenomenal work for fair prices), so sometimes you'll have to wait an extra day for your vehicle, but you'll always save money. Jim and Robbie have always taken care of me, know me by name, and only recommend repairs and maintenance on what's necessary. There's a reason they've been in business since the 70's. Can't recommend them highly enough.", "pics": null, "resp": {"time": 1539200714965, "text": "That is so very special that you that the time to write such a wonderful review. We appreciate you taking your time to give us such a kind and thoughtful review. Sincerely, thanks so very much!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "118114176008128280076", "name": "Elizabeth Henson", "time": 1581304948758, "rating": 5.0, "text": "Easy to schedule with, did the work for what they said it would be, and what they said it would be was MUCH less than the dealership quoted.  This is the second time we've had work done there and they've got our business if we need something else done.", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "115217720221887283257", "name": "alicia perez", "time": 1441056201930, "rating": 5.0, "text": "Best place to get my truck fixed. I took my truck in at approximately 12:30 and they were done by 3:00. Excellent prices, friendly guys, really smart. They know what they are doing and are honest to their prices. They are awesome all around. We will continue to keep taking our vehicles there.", "pics": null, "resp": {"time": 1564072084173, "text": "Thanks so much!!!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "108594614352902405485", "name": "Jake Self", "time": 1520871235768, "rating": 4.0, "text": "Had to return a few times but they was kinda working me in I still recommend them. Let me clarify this statement instead of changing it. When I say return a few times I mean too fix several problems. Only once was something unfinished properly on my alternator/battery, and had to have it towed back. No extra charge but I did feel that they should've covered the TOW TAG.😂😂😭👌🤘👍✌️", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "107302473788236122918", "name": "Robert Robb", "time": 1503060231454, "rating": 2.0, "text": "Charged me $400 to fix a bad wire going to the AC clutch (no parts).  At $85/hour that means it took them almost 5 hrs to fix.  I had looked at the problem before I brought the car in and had narrowed it down to the AC clutch so I asked when i pick it up if it was on the ground or power side.  He wouldn't tell me .  When I looked under the car I could see where they used a wire jumper like whats used for connecting trailer lights to connect to another ground wire that must have been good.  I had expected 2 to 3 hundred but with the mechanic refusing to answer a simple question left me questioning.", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "110557839919993682275", "name": "Jovan Coates", "time": 1484863855621, "rating": 5.0, "text": "Russell Brothers Auto is the best repair shop in this city hands down.  I have been having my vehicles serviced there for over ten years.  They have kept things running that others have said could not be fixed, or a dealership suggests that it's time to purchase another vehicle.   They work on any make and model of vehicle and can perform any type of maintenance from fluid changes, up to engine replacement.  The staff is friendly and the service top notch.  They have always had my vehicles ready the same day I drop them off.  The value cannot be beat.  They do not suggest needless services just to pad an invoice, if your car is not running or something electrical doesn't work, they will immediately get to the heart of the problem and take care of it.  They stand by their work and I will wholeheartedly recommend to anyone if you need your car repaired take it to Russell Brothers, you won't be disappointed.", "pics": null, "resp": {"time": 1564072003146, "text": "Thanks so kindly!!!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "115043664282084828699", "name": "LiqwdE Teryx 4LE (LiqwdE)", "time": 1520521783294, "rating": 5.0, "text": "So far so good. Very understanding. They helped budget my repairs into 3 visit depending on severity of problems. As long as people remember most problems can't be solved same day. Good mechanics, not miracle workers!", "pics": null, "resp": {"time": 1549736567362, "text": "Appreciate you very much. Thank you for being our customer!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "114756388195955394865", "name": "Briana Wright", "time": 1424363466795, "rating": 1.0, "text": "If I could rate it at half a star I would. Avoid this place like the Ebola.\nThough Ebola Might be easier to deal with than these clowns.\n* NO Communication.\n* NO Realistic estimate.\n* NO Time frame for repairs to be completed.\n* NO Call to authorize ordering of expensive parts.\n* NO Friendly service, in fact, acted as if simple questions were a bother to answer, and indeed were NOT answered.\n\nIn the End I had my Car towed away to take to elsewhere.. where the car was fixed, and on the road the next day, for the same price as I was charged by these yahoos for ripping apart my dashboard.", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "111748791581459687827", "name": "Thomas Taylor", "time": 1454361361897, "rating": 5.0, "text": "These guys will fix those cars that no one else will even touch. They repair a Porsche Cayenne (a real PIB to fix) to a 20 year old beater that most would charge more than the car is worth.\n\nThe guy that was crabbing about his experience...., If you say \"Fix it!\" they will fix it. If you say tell me what is wrong and how much, then they will do that as well. BTW, it cost $$ to diagnose and this is sometimes the most expensive part of a repair. Communication is key and it goes both ways.\n\nThese guys are about the only honest ones left. They are so good that many dealers around town bring their used cars to them because their own mechanics can neither fix nor diagnose what is wrong with them. Or maybe they just don't want to get their hands dirty!\nJim and his guys will get greasy and keep you on the road!", "pics": null, "resp": {"time": 1564072062383, "text": "Kind words and much appreciated!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "110595242941967694919", "name": "Russell Patten", "time": 1513098413023, "rating": 5.0, "text": "Great repair facility. Will go back there again in future if needed. Very helpful and knowledgeable", "pics": null, "resp": {"time": 1549736630960, "text": "Thanks so much for the kind words and for being our customer!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "115482508235936950714", "name": "James Bowker", "time": 1506221055951, "rating": 5.0, "text": "Best place to take your car or truck. Real nice people who don't B.S you. 💘", "pics": null, "resp": {"time": 1564071875935, "text": "Thanks so much for the great review. It is very appreciated!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "110101656312094046077", "name": "david huey", "time": 1520872087551, "rating": 1.0, "text": "People misdiagnosed my car after I TOLD them what was wrong. Then offered the correct repair for slightly above market value. Gee, thanks but no thanks. Take your car here if you enjoy wasting money", "pics": null, "resp": {"time": 1524064931147, "text": "We are unsure how to respond since there are no details. Please either post the information or call us and we can address your concerns."}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "100660179116163681659", "name": "chris denton", "time": 1481573049146, "rating": 5.0, "text": "Excellent work! They are top notch mechanics and do excellent elecrical work also. They are straight up and will not take advantage of you.", "pics": null, "resp": {"time": 1564072041416, "text": "Thanks so much!!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "116626745452803937441", "name": "z ten", "time": 1535725802849, "rating": 1.0, "text": "I asked for a quote for two sides. I was given a price. I asked if that was the price for both sides. He said yes. Later, after already doing one side, he tells me that it was the price for one side and questioned if I wanted the other side done. I said I would pay for both sides if they took care of the alignment. He said they would. I got the vehicle, immediately noticed the horrible alignment, had it inspected, and was told that the alignment was, as I suspected, terrible.", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "111138479150269657430", "name": "Andrew Self", "time": 1498864044298, "rating": 5.0, "text": "Always quick and direct with addressing the issues you have with your vehicle. Had a much wider skill set than other shops in the area.", "pics": null, "resp": {"time": 1564071960889, "text": "Thanks so much!!!!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "114452824243984101202", "name": "brent dutton", "time": 1538311229510, "rating": 4.0, "text": "Knowledgable staff. Fast & courteous", "pics": null, "resp": {"time": 1538414732668, "text": "Thanks so very much for being our customer and taking the time to give us a very nice review!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "112312572809002445572", "name": "kristi gibbons", "time": 1466266245509, "rating": 2.0, "text": "We've had one good experience with these folks and two bad ones. They have some skilled electrical technicians capable of figuring out difficult electrical issues. Unfortunately, the company WILL take advantage of you financiallly given the opportunity. They failed to honor a warranty on a part they replaced. Another time they overcharged for correcting an easily diagnosable connection problem in the ignition system. No parts were replaced, probably less than an hour of labor was involved, and the bill was a few hundred dollars. When I politely questioned them on the bill, the guy became agitated, tried to change the subject, explained how I was lucky they didn't charge much more to get my car back.", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "102128516049759978201", "name": "T. Barnes", "time": 1529590078319, "rating": 4.0, "text": "I've been using Russell Brothers for 25 years.  Always fair and very good at Auto Electric repairs.", "pics": null, "resp": {"time": 1529592780627, "text": "Thanks so very much! We appreciate your patronage truly."}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "101925628941556109489", "name": "Trevor Tate", "time": 1518375193320, "rating": 5.0, "text": "I only take my car to these guys, there the best in the business and if you have some type of wiring or computer issues with your vehicle take it to these guys", "pics": null, "resp": {"time": 1549736589384, "text": "Thank you! Thank you!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "110563615991398509123", "name": "Malcolm Smith", "time": 1528376251157, "rating": 5.0, "text": "Does a great job and does it right the first time.", "pics": null, "resp": {"time": 1528386697397, "text": "Thanks so very much for your kind words! Please let us know anything that pleases you or displeases you and we will always try to be better."}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "104881043768727871445", "name": "billy Allen", "time": 1564068323499, "rating": 5.0, "text": "They fixed the problems and I got it back the next day. Replaced wiper motor, rebuilt alternator and air filter", "pics": null, "resp": {"time": 1564071676983, "text": "Thank you so much for the wonderful review! We appreciate it so much!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "102519782902967951653", "name": "Vincent vashel", "time": 1457216707182, "rating": 1.0, "text": "made the mistake of telling them I was from out of town, my original quote was $700. I thought a little high, but when I went to pick my car up it was $3200. & they totally screw up my 4 wheel drive said they didn't know anything about 4 wheel drive. can you say rip-off", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "114738578676967424231", "name": "Ed Hood", "time": 1430185852498, "rating": 5.0, "text": "Best Shop in Town. They'll fix it! Been using them over 15 years!", "pics": null, "resp": {"time": 1564072109238, "text": "Thanks Ed!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "111105865597545009900", "name": "winterelm", "time": 1509455966571, "rating": 5.0, "text": "Awesome service if you need an alternator rebuilt.", "pics": null, "resp": {"time": 1564071842826, "text": "Thanks so much."}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "109144512860558158632", "name": "Joan Marie", "time": 1521382012044, "rating": 5.0, "text": "Hidden jewel in Huntsville Alabama. BAM!", "pics": null, "resp": {"time": 1523481927011, "text": "Thank you so much!!!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "118051971773537963491", "name": "Patrick Pezzano", "time": 1512619337672, "rating": 5.0, "text": "Great people to deal with if you have any auto. Electrical problems this is the place to go.", "pics": null, "resp": {"time": 1549736672837, "text": "Thanks for taking your time for this wonderful review and for being our customer!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "100593327704166788645", "name": "Debra VanHeiden", "time": 1490968647718, "rating": 5.0, "text": "Always a fair price and good service", "pics": null, "resp": {"time": 1564071987460, "text": "It is so kind, thank you so very much!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "115518603906144189725", "name": "Stephen Eyma", "time": 1427400538267, "rating": 5.0, "text": "Those guys did a great job at a reasonable price. Hats off Russell Bros!", "pics": null, "resp": {"time": 1564072155825, "text": "Hats off to the great review! Thank you."}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "114483245697141139521", "name": "Paula Harris", "time": 1551945541378, "rating": 5.0, "text": "Good", "pics": null, "resp": {"time": 1552070970195, "text": "Thanks so much Ms. Harris!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "108963799297163091985", "name": "Frank Armstead", "time": 1477537598271, "rating": 2.0, "text": "The worst people in the world to work on your car please stay away if you do not want trouble", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "111565289148010094830", "name": "donald peoples", "time": 1549654744756, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": {"time": 1549736365186, "text": "Thanks so much for the kind words and being our customer!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "104876356686931793178", "name": "John Fletcher", "time": 1504723993079, "rating": 5.0, "text": "The get it done place\nIf nobody else can I bet they can!", "pics": null, "resp": {"time": 1564071913454, "text": "Thanks so much!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "110184357982732487152", "name": "CJ AUTOMOTIVE HANDWASHANDDETAIL,LLC", "time": 1510092076949, "rating": 4.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "113174550674152384594", "name": "Furlough Wrecker Service", "time": 1505339411083, "rating": 5.0, "text": "Awesome Service and Fast", "pics": null, "resp": {"time": 1564071895548, "text": "Thanks so much!!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "104649472993009271938", "name": "Corey Bartlett", "time": 1456344853787, "rating": 1.0, "text": "Call ahead of time for estimate on installing a manifold intake and throttle body was give a 300$ estimate and a date(2-23-16) to drop it off dropped it off 5 hrs(9am-2pm) for them 2 call me back and tell me it would cost 500$ not the 300$ estimate i was given over the phone.", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
