{"user_id": "109535931511347327100", "name": "Shelley Kim", "time": 1461042114274, "rating": 5.0, "text": "It was such a pleasure hearing DJ Billy Ferguson!  Growing up with a dad who's a musician, I was exposed to, and have an appreciation of, the older generation's music as well as every genre of music out there.\n\nBilly, being so humble, surprised me with his extensive knowledge of these genres from old classics to country to hip-hop!  Ask him for ANY song and he'll pull it up in a second.\n\nHe's an excellent MC - a natural - and is an asset to any event because he loves what he does, he's been doing it for ever, and can blend into whatever role you need him to play.\n\nI can't wait for my daughter to get married so more people can get to experience him as I have.", "pics": null, "resp": null, "gmap_id": "0x888c29fc6afc368b:0x674376fee6b94d4e"}
{"user_id": "100265935271884226756", "name": "Lana Grier", "time": 1451238678050, "rating": 5.0, "text": "I highly recommend Hubcap Classics with Billy Ferguson when looking for disk jockey.  Mr. Ferguson has provided entertainment at multiple events I have attended through the years. He has awesome sense of humor and access to every song you could imagine.  He is definitely a crowd-pleaser and keeps the party lively!", "pics": null, "resp": null, "gmap_id": "0x888c29fc6afc368b:0x674376fee6b94d4e"}
{"user_id": "112881252800758493659", "name": "james worrell", "time": 1500344220093, "rating": 5.0, "text": "D j had excellent communication skills", "pics": null, "resp": null, "gmap_id": "0x888c29fc6afc368b:0x674376fee6b94d4e"}
{"user_id": "112915029039315141933", "name": "Burnette Plumbing", "time": 1497609384092, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x888c29fc6afc368b:0x674376fee6b94d4e"}
{"user_id": "116207822186030735357", "name": "Benjamin Ellis", "time": 1517428990439, "rating": 1.0, "text": "Idk", "pics": null, "resp": null, "gmap_id": "0x888c29fc6afc368b:0x674376fee6b94d4e"}
{"user_id": "108180800077036929089", "name": "Chasen Shaw", "time": 1578287927437, "rating": 5.0, "text": "Birmingham is lucky to have JAMM. They're a small business with big capabilities for special events of all kinds. I've worked with them for many years and always appreciate their professionalism.\n\nYou really can't go wrong working with Geoff and the JAMM team.", "pics": null, "resp": null, "gmap_id": "0x88891764f5f60a81:0xe98ab25cc34c3d64"}
{"user_id": "100567245515630847121", "name": "Tracy Pool", "time": 1533061099022, "rating": 5.0, "text": "I hired JAMM for my wedding and they did a wonderful job! I met with Jeff several days beforehand to go over the songs I requested and he worked in every single song during the reception at very specific times! He also provided white curtain covers to hide the not so pretty green curtains behind our altar in the hotel where we were married, as well as lighting. Our guests raved about how beautiful everything was, and a lot of that was because of JAMM!", "pics": null, "resp": {"time": 1533597549788, "text": "It was great helping you create your wonderful wedding! Congratulations again!"}, "gmap_id": "0x88891764f5f60a81:0xe98ab25cc34c3d64"}
{"user_id": "110745501166153434853", "name": "Erik Church", "time": 1558968390795, "rating": 5.0, "text": "JAMM Entertainment was referred to us by a friend.  We are so thankful that we heard of them.  From the initial quoting process, I could tell they had done this before.  They were extremely thorough and professional, ensuring that every part of our day had good flow from a DJ perspective.  We met with our DJ (Geoff) in person after filling out an initial planning form.  He made sure every detail was covered.  On the big day, everything flowed so smoothly it was incredible.  The ceremony was absolutely beautiful with no \"hiccups\" that always seem to happen with DJs.  The reception was so much fun! Geoff was incredible at reading the crowd, sensing when people needed a little motivation to come back out and party.  I would highly recommend JAMM to anyone needing a DJ for their wedding ceremony/reception or any event!  Geoff - thanks again for all that you did!", "pics": null, "resp": null, "gmap_id": "0x88891764f5f60a81:0xe98ab25cc34c3d64"}
{"user_id": "116300831600957058864", "name": "Florida Consumer", "time": 1463005558452, "rating": 5.0, "text": "When my daughter got married, I pretty much just paid the bills, let her manage the process and stayed in the background. However, I did not do that with regards to finding a wedding disc jockey in the Birmingham, Alabama area.\n\nWhy?\n\nA lot of couples put a lot of energy into all of the other vendors that support a wedding, sometimes leaving the selection of the DJ until very late in the process when both time and money are short. That's a huge mistake because the disc jockey establishes the mood and tone of the wedding and the reception. Pick the wrong wedding DJ at the last minute and you'll be sorry.\n\nWhen I contacted Jamm Entertainment Services about my daughter's wedding they patiently answered all of my questions, recommended the right services, and delivered exactly what they promised - a smooth, perfectly orchestrated wedding service and reception with a consistently packed dance floor that we'll remember for the rest of our lives!\n\nI want to thank them in particular for their patience in answering all of our technical questions about the video and photo files we provided because they were a critical part of my daughter's wedding event.\n\nIf you're looking for the best Birmingham, Alabama disc jockeys, you'll be delighted with Jamm Entertainment Services just as I was.", "pics": null, "resp": null, "gmap_id": "0x88891764f5f60a81:0xe98ab25cc34c3d64"}
{"user_id": "118049290365692441657", "name": "Brandy Morris", "time": 1376673073418, "rating": 5.0, "text": "I'm an event planner in Birmingham, Al and it has been an absolute pleasure working with Jamm. From the start they're so great. They're prompt and professional and will provide the perfect ambiance for any space and music for guests. It's so hassle free which is awesome considering all the other details I have to worry about. All I have to do is share my vision and I know I can trust them to bring it to life. The dj's are fun to work with and I can't say enough about Becky Reese. Her willingness to go above and beyond is so refreshing. These guys are providing the latest and greatest in technology. If you're looking for that wow factor at your event...there's no question, this is who you want.", "pics": null, "resp": null, "gmap_id": "0x88891764f5f60a81:0xe98ab25cc34c3d64"}
{"user_id": "114411851329761752775", "name": "Pelham Morris", "time": 1521054618573, "rating": 5.0, "text": "Excellent event planning, combined with creative budgeting solutions and cutting-edge tech make JAMM ROCK!", "pics": null, "resp": null, "gmap_id": "0x88891764f5f60a81:0xe98ab25cc34c3d64"}
{"user_id": "101262182106173485699", "name": "Zachary Banks", "time": 1604150780527, "rating": 5.0, "text": "DJs are awesome!!!", "pics": null, "resp": null, "gmap_id": "0x88891764f5f60a81:0xe98ab25cc34c3d64"}
{"user_id": "100652289493775469372", "name": "Derek Hoffman", "time": 1575695627905, "rating": 5.0, "text": "Lindsay did karaoke at a Christmas party and was the bomb dot com. Whatever she’s paid... needs to be doubled", "pics": null, "resp": null, "gmap_id": "0x88891764f5f60a81:0xe98ab25cc34c3d64"}
{"user_id": "103745398617219145411", "name": "Kristin Smith", "time": 1628274825094, "rating": 5.0, "text": "This place was sooooo awesome! The staff was extremely friendly and helpful. I highly recommend doing this while visiting Orange Beach Alabama!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMXmFTAnzNi2_f2g6pbkp0FqMX5QewjnNJPf02R=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN1lSDYbkNF9OraFH2wyXNxw1WkATak5sY_VxDi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNqBd556tS5ZAc-Z4WOOHoHabpaSpV1d15-q47V=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOkkttqWt56pf_KGNUkiXKrKDKlFO0WsQQ1PqGY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN-XjarKvWR0N1ho-ihscv-UPDsbW1mIaNZsZUa=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOGpvTTIcPnA7LkcQC88RPYdYzWMdYborbUDYez=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPn4Tx9AvZIKQ822qAnsEMv1Rb7ywhIK1iOqhkG=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMhpBm8gbKfjEn5GKqy0N8ULQlBxKbIVgoglXSL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMQC-bMe5sguls7I35TWTJIT7aux1SrvxordoT4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPX_4k0YYMer2Z2ZmMI-787mxvUbQFZIXxwjSb3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPWBqOhrvF3y7qlHVxFs9vwymDX7TDoqL3rPpQ9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPQtpANwQGNrGpbfZrRS_hEQTTDmPNW-MQ0oz7N=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "106977722008593747780", "name": "Jayden Marsh", "time": 1629498058775, "rating": 5.0, "text": "Definitely recommend to anyone traveling or in the area. My girlfriend and I loved it and got a ton of fun, goofy, cute pictures! Thanks to Tracy we got to look around before and check out all 50 backgrounds and even got help with different poses and pictures! The Cool Shots Selfie Museum was definitely a fun part of our trip.", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "108138445008130298177", "name": "Brianna Stout", "time": 1624642495592, "rating": 5.0, "text": "I absolutely loved this place!!!! I can’t wait to go back with more friends!!!! There are so many cool backgrounds and props!!! Megan was super friendly and helpful! I had the best time!!!! Don’t be afraid to go alone too cause they have selfie stands!!! They also have awesome lighting!!! Absolutely fantastic and fun!!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPAD0HirOEhim6P-bSZsrjgk0GP553vukdu4jud=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOLB5hcBJ5oxs5T1hBAKGJ8tGWHCHlxRKNF9jJy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMx2wvk7VL4qZrrArXrCLlDJe86RWPJVtN7OfUu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPp2rTZU9oD9_kfzvlkVMsLTQ_IrW9rx6Jl21Qe=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "112900342479834206669", "name": "Chyna Chrisman", "time": 1629555511451, "rating": 5.0, "text": "this place was so much fun! as soon as my boyfriend and i walked in we were immediately greeted by tracy i believe was her name! she was super helpful and kind! we will never forget this place! we also got some great shots that will last a lifetime :)", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "116663255739818715288", "name": "Mandie McArty Gosa", "time": 1629124614964, "rating": 5.0, "text": "Wow! A bit pricey, but what a gem when you need a break from the sun! Generally, I would have not thought twice about a \"Selphie Museum\", however, coming across a few reviews during my search for things to do in Gulf Shores, we decided to give it a shot...and we were NOT disappointed! We could have stayed for HOURS if we allowed ourselves. We had 3 adults with two 12 yr old boys, one 10 yr old boy, and an 8 yr old girl. We ALL had a blast!!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "108673854071231206471", "name": "Mallorie Brunswig", "time": 1627252436510, "rating": 5.0, "text": "My boyfriend and I went and we had an amazing time!!! There are so many different places to take pictures and cool background. Good for all ages. I definitely would go back if I lived closer. Megan (the manager) was happy to help with anything we needed and gave us great tips. I definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "116336341143010034918", "name": "Jasmine Morley", "time": 1627066815631, "rating": 5.0, "text": "This place is so much fun! Worth the price and definitely would go back!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMWfjaXTaUnsUd7AsfUH1jm7pjr1arj05qFJFk2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOxcXly4Ic-MIrzlXVsGWDGs2PQnkryBEO9I_bh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN9XeyVP9cjsntjvw4nstUipPmHk0G3vzYiU_xx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM2ZgZBG7klRtU59QWvyeMXV272Z6EAjEogd5r4=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "104647610096316047491", "name": "Morgan Daniels", "time": 1624747049149, "rating": 5.0, "text": "My family had so much fun!!! Even if you don’t want to be in the photos you can take them of your kids , spouse , friends for free!! Price isn’t bad if you want to be in the photos ... they even did a bonus family picture at the end of your tour . All the props were great !!!! The lighting was Amazing! Be on the lookout for the cutest dog in the world, he enjoyed being a prop in our photos as well ! All around my whole family loved it .", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "107975287650184871772", "name": "Amber Morris", "time": 1626498039461, "rating": 5.0, "text": "Awesome little adventure with the kids. We saw it while riding through The Wharf, and it turned out to be really fun! I highly recommend as something to engage all ages and I'd definitely do it again.", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "106248375032425635662", "name": "Jodi Kershner", "time": 1619811616416, "rating": 5.0, "text": "We had so much fun at this place. Stopped here while on vacation in Gulf Shores. They had so many unique sets to take pictures in. Owner was very friendly and we even got pictures with his dog. The girl at the front was helpful and great with the kids. This was definitely money well spent!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "115494442292589164295", "name": "Melanie Berman", "time": 1628355267285, "rating": 5.0, "text": "This place was so much fun! It’s great to go in the morning when no one is there. Meagan was very helpful and we had a great time.", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "102282044303225122959", "name": "Sarah Redding", "time": 1628651068716, "rating": 5.0, "text": "Had a blast here!! So many cool rooms and photo ops. There’s even a dog that came and took some selfies with me. Regret not asking her name, but the blonde girl working the desk was incredibly friendly and helpful, and went out of her way to show us around and give us good tips. An experience I will never forget!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "115100544908242006362", "name": "Lily D", "time": 1620862515017, "rating": 5.0, "text": "This was such a fun experience! The owner and the workers were so sweet and helpful. We had so much fun, and each set was really well done! Our photos turned out great!!!\nI would say though my only complaint was that, while each set had a ringlight, they didn’t all have a way to hold the phone up for you. Not a big deal tho!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "105795909917584529378", "name": "Bryan King", "time": 1622918906804, "rating": 5.0, "text": "I had no idea this place would be as cool as it was when I first paid for it! I thought it would be pretty lame and I thought I was doing it just for my young preteen daughter. But… It was a blast. I got some great photos that we will have the rest of our life. Jennifer was amazing! I would put this on the list of things you MUST do in Orange Beach!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "110190681218657750958", "name": "Stormy Hubbard", "time": 1623861718678, "rating": 5.0, "text": "My husband and I were celebrating our anniversary in town and saw this place. We popped in to see what it was about and spent nearly 2 1/2 hours taking pictures of each other. We laughed so much and got some great shots of each other. So much fun !!!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "115092579806475488276", "name": "Allison Bishop", "time": 1624737002672, "rating": 5.0, "text": "My visit was awesome. Went as a group made it very fun. Jennifer handled every question we had with patience and a wonderful smile. Absolutely recommend this fit fun time and great memories", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "109927544362870091015", "name": "Kristen Gryzik", "time": 1618273145044, "rating": 5.0, "text": "Went to Cool Shots for the first time today for my Tiktok obsessed daughter just had to go. Not only were each set unique they were well put together. Upon checking in we were given a warm welcoming from the owners sweet pups, a light stick to use while there and a demo. Each set had its own ring light. The owner came out and spoke to us a few times and the staff was beyond sweet. Well worth the money and could see coming back to enjoy at a later date. My daughter is already asking when she can bring her friends.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPEebxN3BYXPRmNAqlVRaOUwtkEsqaiGyPApBja=w150-h150-k-no-p"]}], "resp": {"time": 1618325906742, "text": "Sorry, we didn't get to finish our conversation.  I Like to talking to other business owners and learning a couple of things.  GREAT photo with Theo - he loves kids!!!!"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "115575527757006593078", "name": "emily benson .", "time": 1624510346484, "rating": 5.0, "text": "Me and my friends recently went here this week, and it was amazing. The person that helped up was amazing and so sweet and patient. and the pictures came out awesome and there were so many different rooms!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "104350750199507793953", "name": "Kiana Ross", "time": 1624741115594, "rating": 5.0, "text": "I loved this place ! Amazing atmosphere and a wide variety of different booths. Jennifer and Megan were outstanding and made the experience even better. Definitely will be coming back soon.", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "107160303192704471669", "name": "Strawberry Fidgets", "time": 1624560408082, "rating": 4.0, "text": "Very nice place! Jennifer helped us out there and she was very sweet and informative. The only reason I rated it 4 stars is bc they needed more amazing props added on  to the amount they have! 😊 💕", "pics": null, "resp": {"time": 1624766432331, "text": "50’s not enough?  At end of summer, we’re gonna change some and add more!!"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "106320008125714490682", "name": "Olivia Hillman", "time": 1623259159634, "rating": 5.0, "text": "My experience was Fantastic!! Everyone was so helpful and friendly. I met Jennifer at the front and she made us feel welcome immediately! The owner’s dog was so sweet and even took pictures with us!! I definitely recommend checking it out if you’re in the area!!!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "100702006271142720393", "name": "kay giroir", "time": 1625103134894, "rating": 5.0, "text": "On vacation to Gulf Shores and saw this in the things to do near me. It was pretty great! Not many people and amazing little photo rooms! I would definitely come back!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "105045082136054950573", "name": "Gelisicia McElroy", "time": 1622040750534, "rating": 5.0, "text": "If you have never been to a selfie museum, you definitely should go! Cool Shots in Orange Beach, AL was awesome! They have a wide variety of amazing backdrops for photos. The staff was very helpful, professional, and polite! Kudos to Cool Shots!!!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "112022327823907697984", "name": "Lauryn Townsend", "time": 1622829761675, "rating": 5.0, "text": "Jennifer was amazing! I felt her energy as soon as I walked in. She was very helpful! We were in there for an hour and a half taking pictures. She had great ideas and different lights to use. This is a must for people who like taking pictures!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "117019570705729547664", "name": "Amanda Whitmer", "time": 1622049789661, "rating": 5.0, "text": "I had an amazing time with my 10 year old daughter and her best friend! Staff was very friendly and helpful! Overall great experience and some really cool photos to take home as memories of our vacation!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "104017588261100205483", "name": "Jenna Singley", "time": 1623723761804, "rating": 5.0, "text": "My boys had so much fun!! They are 6 and 3 years old and I am 32, there were so many cool photo opportunities! Very friendly and Helpful staff (Jennifer)!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "110410373162853452078", "name": "Trista Louviere", "time": 1624030678444, "rating": 5.0, "text": "Me and my cousins went. We had SO much fun!! We got some amazing pictures out of our trip. Would definitely go back next year!!!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "108069381493436453781", "name": "karen howard", "time": 1623861495470, "rating": 5.0, "text": "Had so much fun this past weekend at the museum. Jennifer was awesome! Thanks for the tour and helping us with some of the shots. This is a great concept.", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "115977802568474516419", "name": "Leah Townsend", "time": 1622830329925, "rating": 5.0, "text": "Jenifer was amazing. There were so many cool rooms to take pictures in and they are still creating more! There were lots of props and ring lights to make your pictures look even better", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "107333572621936888720", "name": "꧁ JUSTYNE ꧂", "time": 1621712156885, "rating": 5.0, "text": "This place is great! It’s super fun and there are so many photos that you can take! Great place and definitely recommend! The workers were so nice and super helpful! 10/10 place for sure! <3", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "116424272835716077881", "name": "Amanda “Mandi” W", "time": 1620060192363, "rating": 5.0, "text": "Jennifer was working and she was extremely friendly. As soon as we walked in she asked if we had been there before. Since the answer was no we got a free tour and explanations and ideas for using the products to take a good “selfie.” Such a fun idea and definitely recommended when you’re visiting the Wharf! Cooper the host dog would also come visit us throughout the experience, very calm, very sweet!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "109009907020952176699", "name": "Cassi Cotter", "time": 1628277828893, "rating": 5.0, "text": "Reasonable price and many photo opportunities!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMiT1Bc7mwOHCBUSCD34CPknJm7v2pgLNzXZITo=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "116032292616514736111", "name": "Magean Pretre", "time": 1623344978253, "rating": 5.0, "text": "Jennifer was so helpful. We enjoyed it totally, especially my 10 yr old, 16 and 17 yr old teenage girls. Great service and a clean place.", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "114591980509519406178", "name": "Donna Brooks", "time": 1622602980222, "rating": 5.0, "text": "This was such and amazing experience! The price was totally worth the amount of fun we had. Can’t wait to go back soon. Definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "118130082928278692089", "name": "B W", "time": 1622146670686, "rating": 5.0, "text": "Randomly stumbled upon this place looking for something to do. Visting some friends out here. Sounded kinda weird so i wanted to check it out. It was actually really awesome! Jennifer was Awesome! Very welcoming and helpful with me asking dumb questions 😅. Lots of lighting cool scenes i went with just 1 friend but i definitely want to go back with at least a 3rd or 4th person to really optimize the photo shots and get some really cool photos! :)", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "107386331631328642762", "name": "wadiya fanous", "time": 1621530593966, "rating": 5.0, "text": "Jennifer is awesome!! So sweet and fun! Everyone was very nice and really wanted everyone to enjoy the experience. Love, love, love this place and everyone who works there!!! Make sure to stop by, you won’t regret it. BEST SELFIES EVER!!!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "112988491983009679466", "name": "caitlyn fry", "time": 1624471910741, "rating": 5.0, "text": "This place is so fun and perfect for photos to post everywhere! Jennifer was super great with helping me with the application for the top 5 photos for $100!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "117821206074507702183", "name": "Terri Ross", "time": 1624741116250, "rating": 5.0, "text": "I had a great time. Everything was fun. Plenty of laughs and memories made!!! Jennifer & Megan were absolutely amazing!!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "117415827095246190695", "name": "Wwt Photographer", "time": 1623450654836, "rating": 5.0, "text": "This was alot of fun, was driving past and thought it would be something new and different to try. It did not disappoint. So much fun.", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "105147578293410388400", "name": "Dani Berry", "time": 1623264366119, "rating": 5.0, "text": "We are from mobile & we come past the wharf twice a day for work and we heard amazing things about the selfie place so we figured we would check it out!! It didn’t disappoint at all!!! We loved all the scenes!!!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "118409702538660975523", "name": "Savannah Booker", "time": 1617340892009, "rating": 5.0, "text": "This is definitely a fun place to stop by when you’re out in this area! They have multiple ring lights to use and you can place them anywhere or if you need help/tips he will help you! My sister and her kids ADORED this selfie museum! I also loved how each room was set up. It’s so trendy and cute. Our pictures turned out great with little effort! There’s also a really cute dog there who will take selfies with you! We loved Theo! 😍", "pics": null, "resp": {"time": 1618326301776, "text": "Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "115782153837422408370", "name": "tori barber", "time": 1622825097976, "rating": 5.0, "text": "We loved how many different rooms and different designs there are!! Megan was amazing with helping us. We will definitely be back.🙂", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "113013317065093623818", "name": "Carley Hudspeth", "time": 1616772758543, "rating": 4.0, "text": "This is a great rainy day activity to do! My best friend and I had fun getting lots of cool shots. I believe they just opened, so I’m sure it is only going to get better.", "pics": null, "resp": {"time": 1617292083735, "text": "We will be constantly adding and changing scenes.  It's a never ending task to make awesomeness! Thanks for coming by!!"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "106876869014911669767", "name": "Channen Price", "time": 1623367933101, "rating": 5.0, "text": "This place was really fun! Jennifer (I think thats what her name was) even told me and my friend we could come back later that day in different outfits for free if we wanted. We were just wearing tshirts and shorts at the time.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOOYZU-nfNh7pFDXyzbEBIiZRKKVL2NvnktyEU6=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "103553163555370760390", "name": "elaina", "time": 1617834954978, "rating": 5.0, "text": "this place is awesome. the backdrops are so fun and trendy. they also have lots of ring lights and handheld bright lights that have lots of settings and colors. i can honestly say these are the best pictures i’ve ever gotten of myself and my friends. not only were the pictures awesome, the experience was so fun and we were there for hours, which felt like minutes. the customer service was amazing, they hyped us up and made us feel so comfortable!! usually i feel weird taking pictures in front of people but i felt comfy, and gorgeous. best experience ever. they also gave us good discounts and have a good price!! and they have dogs!! so cute. the dogs pose with you very well and are very friendly. i’m so glad i went!!", "pics": null, "resp": {"time": 1618326000955, "text": "Good Times!  Share some of those selfies with us! @coolshotsselfies."}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "105203889100523704426", "name": "Jennifer Guidry", "time": 1624990515986, "rating": 5.0, "text": "Jennifer was extremely friendly and very helpful!  We had a great time in all of their amazing rooms taking selfies!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "117124409382930233306", "name": "Grace Hartlage", "time": 1617834889807, "rating": 5.0, "text": "This place was amazing! All the workers were extremely helpful, as well as kind. The pictures taken were amazing, and the experience overall was great. An added bonus, there’s a cute dog!", "pics": null, "resp": {"time": 1618326026582, "text": "We love our dogs - share some photos @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "111714908162431978064", "name": "nick lusk", "time": 1621192863354, "rating": 5.0, "text": "had a great time with my family. first time doing this and it was awesome. had a dog and it was the cutest thing ever!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "105430458848236976505", "name": "Sarah Tarlton", "time": 1617316340445, "rating": 5.0, "text": "We came in as a family and loved all the great set ups to get such wonderful memorable pictures!!  We highly recommend everyone to go and check it out you will not be disappointed.  Make sure to ask for Theo and cooper they are great selfie companions.", "pics": null, "resp": {"time": 1617320321535, "text": "Thanks so much!! Glad you had a good time!  Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "101672605193084523862", "name": "Aleah Jamison", "time": 1621719521537, "rating": 5.0, "text": "Omg everything was amazing. Jennifer that works there was amazing. I love this place. I recommend for sure. 🤎", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "102256274704180897218", "name": "Lance Davis", "time": 1623024366350, "rating": 5.0, "text": "The young woman Jennifer was so Awesome she was so sweet, I definitely recommend everyone to go see her and enjoy the selfie booths they have.", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "103593581162338049645", "name": "Melaine Williams", "time": 1617756657812, "rating": 5.0, "text": "We had the BEST TIME!!! Dallas & Danny (owners) we’re awesome and made sure my girls  had a great time & got the perfect selfies. Put the s Cool Shots Selfie Museum on your list of places to go to when visiting Orange Beach!", "pics": null, "resp": {"time": 1618326083620, "text": "thanks for visiting!  Share some photos @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "102191061181285186441", "name": "J. La'Shay", "time": 1624741010600, "rating": 5.0, "text": "coming from someone who loooooovessss selfies, this place is THE BEST ! Great service and assistance from Jennifer and Megan 😍DEFINITELY COMING BACK !", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "108348327639105796961", "name": "Raven Kirkman", "time": 1619755811710, "rating": 5.0, "text": "My friend and I came and we had the best time. We got to take pictures with their dog and this awesome guy that works there helped us take pictures.", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "105277841259516348795", "name": "Mckall Holder", "time": 1622234088446, "rating": 5.0, "text": "It was awesome!! We had so much fun and the workers were so helpful! Such kind people! It was perfect!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "105173136562558512252", "name": "Lauren Gaines", "time": 1625863543377, "rating": 5.0, "text": "AMAZING for every Instagram lover! Super shoutout to Megan and Brayson!!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "103677641552453380535", "name": "Matt Kirk", "time": 1622842279625, "rating": 5.0, "text": "My wife daughter and myself had a blast really cool props and tons of opportunities to laugh and share our memories", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "104371499515145143720", "name": "Briona Scott", "time": 1622498633491, "rating": 5.0, "text": "It was the best experience I have ever had she was extremely nice I can’t wait until I go back again I think it was Jessica that helped us it was an amazing experience", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "104999290229799454939", "name": "Briana Brandt", "time": 1623264308225, "rating": 5.0, "text": "Super nice workers, amazing picture lighting and scenes. Loved everything about this place and the ending pictures are amazing", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "102279811558990143058", "name": "Lauren Jimison", "time": 1618713460991, "rating": 5.0, "text": "Awesome time at Cool Shots Orange Beach! Many cool and unique backgrounds to choose from..Got some great pics and content! Check them out, you won’t regret it!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "102415874197579235859", "name": "Ashley Rohrbach", "time": 1621807611807, "rating": 5.0, "text": "Went here with my daughter!  We are traveling from California, Missouri- got some great shots!! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "100177530900718360313", "name": "Alex Everett", "time": 1623089428773, "rating": 5.0, "text": "Great place for some fun photos. Staff is great and very welcoming and friendly!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "102617888953043531740", "name": "Madelyn Weathers", "time": 1622917072284, "rating": 5.0, "text": "So much fun! Got amazing pictures... Jennifer was amazing helpful, fun, and very welcoming!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "109961140372866774423", "name": "Ciara Merritt", "time": 1626541429944, "rating": 5.0, "text": "Omg Jennifer was amazing and great we had a BLAST at coolshots!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "104514636899524685352", "name": "Janey Lewis", "time": 1622055799261, "rating": 5.0, "text": "Jennifer is the nicest person ever and so sweet! Good customer service makes everything 10x better!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "103779691090307047227", "name": "Twinsmom T", "time": 1621283988511, "rating": 5.0, "text": "Great selfie experience! Great employees that was very helpful. Love every moment there.", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "106835245876204951850", "name": "Mary Weathers", "time": 1621711995448, "rating": 5.0, "text": "It was great!! I have never been to anything like this and I walked in and a sweet lady showed a tour of the place!! Each booth was very cute and overall a great experience!!!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "100411779481347990608", "name": "Abigail Dufour", "time": 1621364252968, "rating": 5.0, "text": "It was super fun to dress up the lighting was absolutely perfect everything was super clean and the lady working the store was so sweet definitely would recommend", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "110704805229642384105", "name": "TM3", "time": 1617849908645, "rating": 5.0, "text": "What a fun place! I brought 3 selfie-happy 6th Grade girls and they had a ball! The photo areas are so clever and the owner gave us great tips and ideas for creative pics. We’ll be going back for sure!", "pics": null, "resp": {"time": 1618325957373, "text": "Glad you got some good photos - please share a few @coolshotsselfies and we'll add the to our Instagram."}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "101910585066915990223", "name": "Syd Neuser", "time": 1617407842678, "rating": 5.0, "text": "this was an amazing experience. there is a place for every single person! we had a group of three teenage girls a grown man and a grown woman and each of us have very different personalities, but we all had a blast.", "pics": null, "resp": {"time": 1618326293413, "text": "AWESOME!!!  Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "106400765241939354789", "name": "Kylee H.", "time": 1627063837396, "rating": 5.0, "text": "They had a ton of backgrounds to choose from. Super fun.", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "113596474085535008433", "name": "Itskaylaaa", "time": 1618596579209, "rating": 5.0, "text": "I loved it here they are so nice has a lot of different photo op ideas 100/10 recommend would definitely come back also very cheap!!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "113134046358384287353", "name": "Tamora Buschke", "time": 1617764979752, "rating": 5.0, "text": "I’m not from Alabama and I’ve never heard of cool shots so when me and my family seen it we wanted to take a look and it’s like nothing I could’ve imagined it’s so cool, I love the themes and can’t wait to see more and I definitely think it’s perfect for this generation because we love pictures lol it’s a very fun and new experience...I’m happy me and my family got to experience this place", "pics": null, "resp": {"time": 1618326058780, "text": "Come back again - we will have even more scenes built!  Share some @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "105557494049956498573", "name": "Sammi Brothers-hobdy", "time": 1617567880246, "rating": 5.0, "text": "This place was the perfit fit for my daughter. There were so many backdrops and props, she could have spent the entire trip in there if i let her. Staff was so friendly and all around just a fantastic experience", "pics": null, "resp": {"time": 1618326236168, "text": "So far the record is about 3 hours!!!!  Come back when in town.  Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "113241240238803738774", "name": "Aliana Leap", "time": 1617413916306, "rating": 5.0, "text": "very good service and very nice employees. we loved the back drops and the qr code for picture ideas was helpful", "pics": null, "resp": {"time": 1618326277544, "text": "Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "117757686125624313881", "name": "Ciera Roberts", "time": 1622846399120, "rating": 5.0, "text": "I had an amazing experience with Cool Shots, the staff is extremely helpful and the set up is absolutely great for photos.", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "107070965860893392467", "name": "Brittany Weaver", "time": 1621645732799, "rating": 5.0, "text": "The girls had so much fun! So many cute props.", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "118442363211545351646", "name": "Camille Willie", "time": 1621363649075, "rating": 5.0, "text": "Such a fun place to hang out and get cool photos!! Jennifer is amazing up front!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "114251569450189924988", "name": "donna coble", "time": 1617728365217, "rating": 5.0, "text": "Such a great time! Definitely worth a visit. Cool scenes that take amazing selfies!", "pics": null, "resp": {"time": 1618326176801, "text": "Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "111463234813575293160", "name": "Shanterria Hill", "time": 1618189163763, "rating": 5.0, "text": "I love the experience my twin daughters live taking so many pics and wanna thank Jessica for all the help she was wonderful", "pics": null, "resp": {"time": 1618325926283, "text": "Thank you - Glad you had a good time!"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "100397268526018409512", "name": "Vice Family", "time": 1624995310045, "rating": 5.0, "text": "Jennifer was great….we will be back….my girls had a blast", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "105400485718766924858", "name": "Christy Foster", "time": 1617328192463, "rating": 5.0, "text": "6 of us went and paid our $25 each it was welll worth ever dollar!!!!! Me My kids my niece all had the time of our life taking selfies! The absolute best Selfie Museum", "pics": null, "resp": {"time": 1618326321611, "text": "Coolio!!!!!!  Come back when in town again!!!   Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "117307843437194309966", "name": "Stitch", "time": 1616636320946, "rating": 5.0, "text": "I loved this place, it was a dream come true and it is affordable and plus you can’t past up the cute dog that Jumps on the red couch with you to take a selfie 🐩", "pics": null, "resp": {"time": 1617292033482, "text": "Theo (The cute dog) says HELLO!! and Thanks for stopping by!!"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "105953166829460409315", "name": "Lyndsey Mcclendon", "time": 1619216039047, "rating": 5.0, "text": "Everyone was so nice! They did their best to help us get cool pictures and everything was so cute!!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "116650629995931623732", "name": "Brookelin Langston", "time": 1616550357318, "rating": 5.0, "text": "THIS PLACE IS SO MUCH FUN!! It was definitely worth going to. I got so many great photos!!!", "pics": null, "resp": {"time": 1618326389453, "text": "Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "116831384277231977642", "name": "Amy Weimer", "time": 1623026279977, "rating": 5.0, "text": "Awsom 100% recommended to all awesome place you guys rock", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "109353528093641475134", "name": "Averie Russell", "time": 1620757920996, "rating": 5.0, "text": "this place is so cool! I had a lot of fun taking these pictures!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "101829532608727533366", "name": "Hailey Neal", "time": 1616635932513, "rating": 5.0, "text": "Had so fun much with my friends when I went there last night! We all got awesome pictures!", "pics": null, "resp": {"time": 1618326378708, "text": "Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "116444329064996843636", "name": "bryce fox", "time": 1622597885131, "rating": 5.0, "text": "What a fun time!!  Thanks Megan!  You were great!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "109640476132916411585", "name": "Tasha Hamilton", "time": 1616000221548, "rating": 5.0, "text": "Awesome setup, beautiful dogs, extremely nice owners. If we had more time we could have spent hours there, my kids had a blast!!", "pics": null, "resp": {"time": 1618326402099, "text": "Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "108881225747324362010", "name": "Kaylee Alexis", "time": 1622732944197, "rating": 5.0, "text": "Super fun backgrounds for anyone!! I loved the atmosphere in the building too!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "109604109495721754351", "name": "Kelsey Qualls", "time": 1625677398584, "rating": 5.0, "text": "Jennifer was working with us! Super sweet and helpful", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "111664921236001416921", "name": "Allison Berry", "time": 1624759369421, "rating": 5.0, "text": "Megan was absolutely the best! She helped us so much!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "114494654775986258482", "name": "Alli Robinson", "time": 1616635296801, "rating": 5.0, "text": "My sisters and I had so much fun here, the owner is so helpful and polite! Highly recommend going here!!", "pics": null, "resp": {"time": 1618326381842, "text": "Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "117080105118522600161", "name": "Timothy Broom", "time": 1623952388474, "rating": 5.0, "text": "Awesome, had a great time taking pics of my niece and dogs", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "101431129248368772255", "name": "Timothy Seymour", "time": 1624734358825, "rating": 5.0, "text": "Me and my family really had a great experience and Jennifer hospitality was on point!!!!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "105158772086756275016", "name": "Elizabeth Cook", "time": 1620951112586, "rating": 5.0, "text": "Such fun people with occasional appearances by an adorable labradoodle named Cooper", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "100164533817916382401", "name": "Michelle Kelley", "time": 1623448854751, "rating": 5.0, "text": "I love this place we had a great time..", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "116371649659492560568", "name": "Riley Grimes", "time": 1625594104237, "rating": 5.0, "text": "This place is amazing and Jennifer was super helpful!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "108016308570475123780", "name": "zoe knight", "time": 1624759407737, "rating": 5.0, "text": "Very cool! Megan helped a lot!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "106781470125104417795", "name": "bryanna kelley", "time": 1623452680018, "rating": 5.0, "text": "great place too go! love the workers!!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "101641991517239140240", "name": "Grace Abner", "time": 1617644746241, "rating": 5.0, "text": "Very great staff and lots of cool props very fun experience", "pics": null, "resp": {"time": 1618326191342, "text": "Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "113456258258193546448", "name": "Gracie McCoy", "time": 1617395505045, "rating": 5.0, "text": "Super fun for all ages. Lots of templates", "pics": null, "resp": {"time": 1618326296633, "text": "Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "115533221951432363650", "name": "Lucy Peterson", "time": 1628272054250, "rating": 5.0, "text": "Was so much fun!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "108317867987681934699", "name": "Danielle Lalonde", "time": 1622167301379, "rating": 5.0, "text": "This place is amazing!! 10/10 recommend!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "117544713612277899332", "name": "davis", "time": 1616003714908, "rating": 5.0, "text": "very fun to go to! i had fun with my friends", "pics": null, "resp": {"time": 1618326398514, "text": "Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "114746852509606572335", "name": "Elise Williams", "time": 1617756093165, "rating": 5.0, "text": "loved it, had all the equipment you can think of.", "pics": null, "resp": {"time": 1618326164461, "text": "Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "116287271931421819427", "name": "Amanda & Associates , Your Home Sold GUARANTEED!", "time": 1622221578341, "rating": 5.0, "text": "Jennifer was great and the kids had the best time 💛💛💛", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "108770723231080027181", "name": "Alana Mckinney", "time": 1617455701575, "rating": 5.0, "text": "Unique concept, and so much fun! 10/10", "pics": null, "resp": {"time": 1618326271544, "text": "Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "117310917871138168085", "name": "Kelsey beaber", "time": 1617316134356, "rating": 5.0, "text": "Super fun and lots of cool places to take pictures", "pics": null, "resp": {"time": 1618326335426, "text": "Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "117494305217046494561", "name": "Emily Salley", "time": 1622919725198, "rating": 5.0, "text": "We had such an incredible time!!!! It was such a fun experience!!!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "104614946522345118756", "name": "Rachel Graves", "time": 1625074598841, "rating": 5.0, "text": "One of the best experiences ever", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOp0NSAJYqZnfJCrEEnYa25bjMBFpNezf2GN5Z0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOt8_xo6urrolitOYrdYSnayk5Tngh0n9DKYSTV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMr6-X6Q_GKvj5EpIQBmPhbw9O5qumM_xxfeLsa=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "104851108313035040263", "name": "Angel Jameson", "time": 1616636169635, "rating": 5.0, "text": "They where nice and good pictures to take there", "pics": null, "resp": {"time": 1618326374720, "text": "Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "105865640354714902409", "name": "Leah Kukman", "time": 1619289985988, "rating": 5.0, "text": "Great spot for unique and fun pictures!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "113667809520801803926", "name": "Mallory Mitchell", "time": 1622831961521, "rating": 5.0, "text": "really cool!!! and the lady was really nice!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "100328484362847776800", "name": "Jasmine Morley", "time": 1625768668256, "rating": 5.0, "text": "So neat! Had so much fun!!!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "111885013197956624488", "name": "Jodi Segura", "time": 1618713303257, "rating": 5.0, "text": "We had soooooo much fun!!!!💙💚", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "109610306379904942262", "name": "Kara Putman", "time": 1620263895218, "rating": 5.0, "text": "Love the place it was an amazing experience !!! Nice staff !", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "102733153652317185519", "name": "Britney Booth", "time": 1617304755533, "rating": 5.0, "text": "It’s awesome!! Cute pictures!!", "pics": null, "resp": {"time": 1618326338569, "text": "Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "115757789946443491511", "name": "brynlee hill", "time": 1627064623857, "rating": 5.0, "text": "it was really fun", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "115221688834555998794", "name": "Ella Hover", "time": 1620582191469, "rating": 5.0, "text": "this was the coolest place ever!!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "100084137687529841249", "name": "Carmela Puzzio", "time": 1617475403481, "rating": 5.0, "text": "Amazing!!! Such cute rooms and the sweetest dog ever!!!!", "pics": null, "resp": {"time": 1618326267650, "text": "Theo and Cooper - coolest dogs in Orange Beach!  Share some of your best selfies!  @coolshotsselfies"}, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "100469431344740390482", "name": "lexie martin", "time": 1623022724490, "rating": 5.0, "text": "Jennifer was so much fun and helpful!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "102883345945805684378", "name": "Deontay Cox", "time": 1629992961865, "rating": 5.0, "text": "Loved going here with my girl we ended up with pictures well keep forever !", "pics": null, "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "109865875234736451683", "name": "myka piedra", "time": 1630016760422, "rating": 5.0, "text": "very cool place and the girl working was super nice and helpful :)", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNHIIY-K0Xt70YcgYxDlJCOVlPbgallwCJ51tBQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOaKqFQRlyWcjW-YZl-lAlDKAog3qgcU14OW4-V=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNAijjRSF9Ors39DrE-I97aplmGCZx85YsWXHHu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP-sfFPHTnUMrmWiGej9fSx7Jq_3BDhLAgeCKOh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOAbuUmBzzWCL8ibO0Gy7Npb82UkukqcJBCFTQk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNoJyHKpL6rUELeNYq8-mAflI3I600BFom2lqND=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a057a4b41fe0d:0x276495ffdd532974"}
{"user_id": "111817439500224977351", "name": "Valerie Cates", "time": 1627965178973, "rating": 5.0, "text": "I booked an escape room for my son's 16th birthday as we wanted to do something different. He and his three best friends had a great time. Not wanting to be \"in the way\", I stayed out, but followed their progress via closed circuit cameras. I felt this adventure was a great value...money well spent for the fun memories we have. Additionally, the staff there was incredibly helpful and polite. You also get a great team picture when the game is over.", "pics": null, "resp": {"time": 1628038034765, "text": "Valerie thank you so much we appreciate being able to host a fantastic party.  Thank you so much for allowing us to be the birthday entertainment. We can’t wait to see you again soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "116577975237765215106", "name": "Julie Anderson", "time": 1625793424535, "rating": 5.0, "text": "Love. love. love. this place. This was our second time here and it is far away better than any other escape room we have done. Just challenging enough to make it exciting yet all the clues are there, waiting for us to be uncover them.\n\nWe were a group of three adults and two children ages 10 and 13. Everyone in our group uncovered clues and helped us escape. It was definitely a team effort.\n\nWe will definitely be going back.\n\nEdit: Max was our awesome game master!  Thank you for a great experience Max!!", "pics": null, "resp": {"time": 1625960061457, "text": "Julie, thank you so much for the kind words. We are so excited to be a source of local entertainment for your family. There is nothing better for team building than an escape room.  Max is definitely one of the best. She definitely brings to life the overall experience and adds her own flare. Thank you again and we can’t wait to see you again soon"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "105194403362334942644", "name": "Anna F.", "time": 1625882274779, "rating": 5.0, "text": "My boyfriend and I did the “Secret Society” room for a fun date night and it was an amazing experience! Natalie was super helpful with the explanation and the hints when we needed them! The escape room we did was VERY complex but enjoyable and very doable with only two people. It was our first time in an escape room, but we did not feel totally lost. It was a 10/10 experience and I cannot wait to try another room at Escape Enterprise!", "pics": null, "resp": {"time": 1625960209294, "text": "Anna, thank you so much for the 10/10. Secret Society is one of my favorites. It is a fantastic room for team building or date night      Natalie is an amazing game master with so much energy adding to the overall experience. Thank you so much and we can’t wait to see you again soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "112242230274285711224", "name": "Rebel Mike Potter", "time": 1625587093505, "rating": 5.0, "text": "The room \"Flight 2076\" was setup to look like an airplane. The room was slightly difficult but enjoyable. The attendant \"Emily\" was probably the best that we've had at any escape rooms we've been too, throughout Florida and Alabama. She was knowledgeable, personable, had a great sense of humor. Even though we didn't escape this room she made our experience more pleasurable. I would definitely recommend Escape Enterprise LLC, and would specifically ask for Emily.", "pics": null, "resp": {"time": 1625743401421, "text": "Thank you so much for the compliments on our room Flight 2076. EmmaLea is in fact amazing at her job and does an amazing job at adding to the overall experience here at Escape Enterprise.  We thank you for choosing to stay local with us and for allowing us to serve you and provide good quality entertainment."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "101076246397546730334", "name": "Jon", "time": 1625376722637, "rating": 5.0, "text": "This sure was a fun and thrilling experience! “The Shack” was way better than I hoped it would be. My family and I were stumped a few times, but it’s great that you can ask for hints from your Game Master. Thank you EmmaLea. You Rock! On the way home, we were already discussing which room will be our next one. “Flight 2076!”", "pics": null, "resp": {"time": 1625583123553, "text": "Jon, thank you for your kind words. We love being able to provide a family friendly local experience. The shack is an amazing room. You will also love Flight 2076. As for EmmaLea she is doing a fantastic job and is an amazing game master.  She definitely goes above and beyond to make each guests experience one they won’t forget."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "101152438232663920550", "name": "Joseph Fuller", "time": 1628211325830, "rating": 5.0, "text": "Took my kids . Our first time doing an escape room . Michell was amazing and so sweet . Definitely going to go back . If not to do another escape room then at least to see that game masters pretty face .", "pics": null, "resp": {"time": 1628548825457, "text": "Joseph thank you. I will pass that on to her. We appreciate the fact that you decided to join us for some local entertainment."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "109826908120435629392", "name": "Shadowtheguy 912", "time": 1623023339026, "rating": 5.0, "text": "Really nice people, and the Game Master Max(Is that what their called?) was incredibly nice both times I was there. Thank you for dealing with me and my misfit friends. Definitely coming again.", "pics": null, "resp": {"time": 1623098607972, "text": "You nailed it they are the game masters max does do an incredible job. We thank you so much for the repeat business, we have so much more new coming out that we can’t wait to show you."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "112946338997801731940", "name": "the fool", "time": 1628211526604, "rating": 5.0, "text": "Michell was an excellent host. Very helpful, made for a fun night out!!", "pics": null, "resp": {"time": 1628548772862, "text": "Michell is one of our newest gamemasters and doing an excellent job.  We are so glad that you had an excellent time."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "108624938120052000607", "name": "Sophia Boerman", "time": 1623620523842, "rating": 5.0, "text": "My husband and I did the Flight escape room and escaped and it was so fun! Perfect date night activity! Max helped us with clues and was awesome! We will be back to try other rooms!", "pics": null, "resp": {"time": 1623705683474, "text": "Sophia thank you so much for coming and doing one of our experiences. You guys rocked it with Flight. Max is an amazing game master and helps take it to the next level."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "115736255646928716671", "name": "Rhoda Matthew", "time": 1623015871733, "rating": 5.0, "text": "My friend’s family and I had a blast in the escape room. We escaped at the last minute lol. This was our first experience and we didn’t know what to expect. Max explained everything in detail  and was very patient with us (we had young children). I will definitely return and will tell friends about the experience.", "pics": null, "resp": {"time": 1623098571649, "text": "Rhoda thank you for being your family for some good old fashioned family bonding in a new way. You guys crushed it. We live the fact that you supported a local small business and even more that you brought your little ones with you. We strive to be a family friendly entertainment venue. Max does do a great job and we will pass it on to her. Thank you again."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "108154576993696464671", "name": "Whis Cat (Whiscat)", "time": 1616810921244, "rating": 5.0, "text": "We had so much fun. We came in to do Secret Society and ended up doing The Vanishing Act and The Shack also. We had several game masters helping out and they were all amazing! The young man we didn't catch his name unfortunately, Max, and I think Natalie? Or Emily? She mentioned being the manager and had an awesome Among Us tattoo 😄 Definitely would recommend trying them all out!", "pics": null, "resp": {"time": 1616849207343, "text": "You guys just rocked it 3 games in one day. That’s amazing. Thank you so much for supporting us and keeping it local.  Our staff is top notch and all of them perform at a level that is above and beyond expectation. Thank you guys so much."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "116846921431187182905", "name": "Robert Bergeron", "time": 1624133471823, "rating": 5.0, "text": "Max is the ultimate game master! She did a great job making sure we had a wonderful time. I can't wait for a new room to open. Thanks Max...", "pics": null, "resp": {"time": 1624134369411, "text": "Robert you are awesome and correct, Max is an amazing game master and adds so much to the all ready awesome local experience that you just accomplished. We can’t wait to show you more of what we have."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "114029271199151870615", "name": "Jeremiah King", "time": 1623153689214, "rating": 5.0, "text": "I went with my 2 son's(8 and 13).  We had a blast.  The younger son was a little nervous about being locked in a dark box but Bunny Max did an amazing job of making it fun for him.", "pics": null, "resp": {"time": 1623154388293, "text": "Jeremiah thank you for bringing the boys for some great family fun. Max does an amazing job with making the experience fantastic for everyone."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "112194685916149142322", "name": "Matt Crawford", "time": 1619300640033, "rating": 5.0, "text": "Nate was our game master and he was AWESOME. We did \"the shack\". The attention to detail in that room is awesome! It wasn't too hard, but wasn't a walk in the park either. It really made you think. We will be back every chance we get. Also, the tee-shirts are super comfortable, and the owner Aaron, is a super nice guy.  If you are looking for a great place to go and have fun as a family, I highly suggest Escape Enterprise.", "pics": null, "resp": {"time": 1619657676162, "text": "Matt, thanks for taking the time to come and experience our local family fun entertainment.  You guys were awesome and did an amazing job in the Shack.  We can't wait to see you again soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "108956866483040042298", "name": "Olivia Holland", "time": 1624286454621, "rating": 5.0, "text": "Such a fun experience! Max and Emily were amazing and made our experience so much fun. I will definitely be coming back.", "pics": null, "resp": {"time": 1624377558745, "text": "Olivia, thank you for staying local with your choice of entertainment. You are 100% correct about EmmaLea and Max. They add so much to an experience we are blessed to have them."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "102539450219558674246", "name": "Caitlyn Lindsey", "time": 1626731342704, "rating": 5.0, "text": "Such a great thing to do with friends and family!! And the rooms here really make you think! Highly recommend!", "pics": null, "resp": {"time": 1627130981619, "text": "Caitlyn thank you so much. We love being able to offer immersive yet challenging entertainment to friends and family alike. We will see you soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "100013976313654305689", "name": "Brittany Straughn", "time": 1623635251284, "rating": 5.0, "text": "My girlfriend and I had so much fun!! Max was our game master and she did fantastic! We loved it so much we stayed for a second game and they even gave us a discount!! Honestly can not wait to go back!", "pics": null, "resp": {"time": 1623705783589, "text": "Brittany you guys were awesome. Thank you so much for allowing us to be your local entertainment. You guys were awesome in both rooms and it was a pleasure to meet you both.  Max is amazing at what she does and definite adds so much to the overall experience."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "112262662629715054587", "name": "Jennifer Potter", "time": 1625357111873, "rating": 5.0, "text": "We have been to a few different escape rooms and this one is very well themed! We did not escape from the Flight 2076 room but we had a lot of fun and our hostess, Emily, was fantastic!! I would definitely love to go back and try the other rooms.", "pics": null, "resp": {"time": 1625583234407, "text": "Jennifer you guys did a great job in Flight 2076. It is such an awesome room providing a little memorial as well as some fantastic local entertainment. EmmaLea does a great job of providing quality expertise as a game master she is among the best."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "100957808363100509228", "name": "Faye Satchell", "time": 1626666375903, "rating": 5.0, "text": "My family enjoyed the “Shack” escape room . This was our first time experiencing this awesome game , our game guide MAX was super nice and explained things well, she also made us laugh a few times! I recommend this place to friends and family ! (:", "pics": null, "resp": {"time": 1627130927470, "text": "The Shack one of our most immersive rooms. You guys do amazing at it.  Max is an amazing game master. Gate thank you and your family for joining us for some awesome local entertainment.  We can’t wait to see you again soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "114235369029104365771", "name": "Chris Heiniger", "time": 1622848812390, "rating": 5.0, "text": "An excellent fun family activity! Very well executed with enough of a challenge to make it interesting for everyone. I definitely recommend checking this place out.", "pics": null, "resp": {"time": 1623098511379, "text": "You guys were awesome. Thank you so much for coming and joining in on some wholesome family fun. We have so much more to offer you. We can’t wait to show you."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "101390519529749528388", "name": "Kayla East", "time": 1618182559010, "rating": 5.0, "text": "We did the Secret Society room and absolutely loved it! Mac was our game master and she was so helpful for us... As we were pretty clueless as to what to do going it to it! The staff in general were so sweet and knowledgeable!", "pics": null, "resp": {"time": 1618254404424, "text": "Thank you so much. Max is amazing at what she does. We can’t wait to see you back soon. We have so much more to show you guys."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "100591406865441570938", "name": "justin campbell", "time": 1623374443207, "rating": 5.0, "text": "We brought our Youth group here tonight. The rooms were great! Max and Emmalea were great game masters!! Definitely going back again.", "pics": null, "resp": {"time": 1623449386390, "text": "Justin thank you so much we love the fact that we can provide some local family style fun for you guys. It is our pleasure to entertain. Thank you for letting us have the opportunity."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "111986414513714657485", "name": "J T", "time": 1614006623644, "rating": 3.0, "text": "Had a lot of fun at the escape room. The staff was very friendly and the place is set up very well. That said, I felt like the rooms could have had a more cohesive narrative that drive you in the direction of a logical progression of solving the puzzles. The airplane themed room didn't seem to have any rhyme or reason as to what order you did things in and as a result we found ourselves looking for clues that we hadn't unlocked yet. If there had been something that told us where to go and when I felt like it would have been a much better experience. We did finish but with not much time left. The magician's room was much the same way, there just wasn't anything to tell us where to begin or where to go or what to do and that made it very frustrating for us. You end up just looking at the materials that are provided and trying a bunch of numbers on a bunch of different locks which isn't very much fun. The puzzles were good but without any idea of what order to do them in it just made things kind of a frantic mess. We will definitely go again to try some of the other rooms and I know that the owner seems to read and reply to feedback so I hope I've given enough information. Don't let this just keep you from going, it was a great experience and with a little work I feel like it could be excellent.", "pics": null, "resp": {"time": 1614174231372, "text": "JT first off thank you guys so much for letting us provide your local entertainment for the weekend.  I am sorry that you felt like there was no rhyme or reason to the rooms we have spent meticulous hours crafting them. With that said though we do not just place a room and let it be, we like to call our rooms a living creation. Each room has a lifecycle that it goes through. Those two are the newest ones we have.  They were created then tested then changed and tweaked then retested. Now as our guests go through the rooms we know that there are continuous tweaks that will need to be made in order to make the room amazing.  I thank you so much for the comments it does help to continue that lifecycle of the rooms.  I am not here to tell you that our rooms are the best around and will not change for anyone because that is just dumb. We take our guests seriously and want everyone to enjoy their time with us.  From the sounds of it, you guys have done quite a few rooms, if you have the time I would love to set up an appointment with you to discuss some of the more intricate parts of the games that you had issues with.  Send me an email at info@escapeenterprise.com and lets get together and talk escape stuff.  Thank you again for supporting local it really does mean a lot to us."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "111361995587213898943", "name": "jake ryan", "time": 1624304874117, "rating": 5.0, "text": "Had an awesome time in the Vanishing Act escape room! Max was extremely nice and helpful to us during our game. Thank you, Max!", "pics": null, "resp": {"time": 1624377619685, "text": "Jake, thank you for choosing the vanishing act it is such a fun experience. Max truly is an amazing game master. She pushes the limits on each experience to make it better than the last."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "101438298505080863461", "name": "Sarah Aronack", "time": 1620495915637, "rating": 5.0, "text": "Very cool local business with super friendly staff. Emily was our gamemaster and was very sweet and helpful and had such a great attitude with our chaotic group of 6 which included our 4 boys. We will definitely be back again!", "pics": null, "resp": {"time": 1620573535752, "text": "Sarah thank you so much. It means the world to us that you love our local entertainment. Secret society is an awesome room especially for families, it has some great secrets to discover. EmmaLea is an awesome game master and brings so much to the experience we strive to give you guys.  Thank you."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "112608911602854789887", "name": "Eliii", "time": 1628042191613, "rating": 5.0, "text": "i had a really great time natalie was a great host", "pics": null, "resp": {"time": 1628549147650, "text": "Thank you so much. Natalie does do an amazing job as the senior gamemaster and trainer she pretty much rocks it and helps make the escape room what it is."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "105799318375824680097", "name": "Brittany Boehme", "time": 1616368453950, "rating": 5.0, "text": "We did the Shack and escaped at the last minute! This was a cool, creepy set up as if we were actually out in the woods. Emily and Max did a great job and we're very friendly and helpful when we needed it. Will definitely come back for more escape rooms.", "pics": null, "resp": {"time": 1616458291872, "text": "The shack is one of the crowd favorites.  We tried our best to be able to get as much realism and immersion into our rooms to provide quality entertainment.  EmmaLea and Max are amazing gamesters that often far exceed expectations.  They are definitely world class at what they do.  Thank you"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "109789788262020677422", "name": "Shelby Thompson", "time": 1624724015836, "rating": 5.0, "text": "Love going to Escape Enterprise! We always have a great experience and Natalie makes sure to take care of us and make it that much more fun!", "pics": null, "resp": {"time": 1625087374757, "text": "Shelby thank you so much we love having you as well. Our gamemasters really do make our games the best."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "101367095682277991659", "name": "Lisa Green", "time": 1625181471115, "rating": 5.0, "text": "Our escape from the Flight room was awesome! Max was a great game master! Loved it!", "pics": null, "resp": {"time": 1625347612834, "text": "Lisa thank you so much for coming and embarking on flight 2076 it is an awesome room and Max is a fantastic game master the ups the ante to any escape room here at Escape enterprise. We appreciate the fact that you guys stayed local for your entertainment we can’t wait to see you again soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "114392028781528099976", "name": "Makayla Sherburne", "time": 1619109124529, "rating": 5.0, "text": "Super fun! We did the vanishing act - I did this with my husband and our friends and it took some time before we figured it all out but we successful lly completed the room! Definitely would go back for the other rooms.", "pics": null, "resp": {"time": 1619657730672, "text": "Your team rocked it.  The Vanishing Act is an amazing room that challenges even the most experienced escape room enthusiast.  Great job and thanks for keeping it local."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "107107396362472441512", "name": "Chrissie Gamble", "time": 1620053015001, "rating": 5.0, "text": "Our Game Master Emily was wonderful. Room setup was great. Fun experience and have already made reservations for our next visit.", "pics": null, "resp": {"time": 1620129022091, "text": "Thank you Chrissie, Flight 2076 is a fantastic room. It is perfect for a small group or family. Thank you guys so much for keeping it local and supporting us. EmmaLea is a fantastic game master, she adds so much to escape enterprise. We can’t wait to see you guys again soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "104745061944419122913", "name": "Rafael M", "time": 1624738624503, "rating": 5.0, "text": "Great experience, the room was very challenging and fun. 10/10 would recommend for anyone.", "pics": null, "resp": {"time": 1625087400785, "text": "Rafael, thank so much for the compliment we can’t wait to see you guys back soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "100225289781909804219", "name": "Alexxa Valdovinos", "time": 1606157655002, "rating": 5.0, "text": "My family and I went for my birthday and it was so much fun! Escape rooms are my favorite thing to do. This was my first time at Escape Enterprise and it did not disappoint. We did the Shack and it was a great experience. The game was fun and difficult enough to make it challenging but not impossible. Kelsey was our game master and she was awesome. She was sweet, helpful and fun. The service and the experience were both great!", "pics": null, "resp": {"time": 1606186631112, "text": "Alexxa thank you and Happy Birthday to you. We are so glad that you chose to spend your birthday with us.  We can't wait to show you what is to come in the future, and how excited we are to be able to serve our small town."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "111295039109131037815", "name": "jessie sneed", "time": 1619917745722, "rating": 5.0, "text": "This was our first visit and we had so much fun!! Max was our game master and she was awesome.... we will definitely be back.", "pics": null, "resp": {"time": 1619961476767, "text": "Jessie thank you for allowing us to be your local entertainment for the night. The shack is an awesome room to choose from its level of immersion is amazing.  We can’t wait to show you what else we have for you guys to try."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "106227879735527332883", "name": "Gretchen Gonzalez", "time": 1616966969041, "rating": 5.0, "text": "So much fun. Challenging with amazing staff to help. Room was really well done aesthetically as well as had a story line which made it more fun. Wish we lived here so we could do all the rooms.", "pics": null, "resp": {"time": 1618147165331, "text": "Gretchen thank you so much. I know you guys are t here but thank you for supporting local business. If you all visit again come on over and hang out."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "105793570191071342559", "name": "J R", "time": 1616293262591, "rating": 5.0, "text": "We took my son and 3 of his friends on his 9th birthday. I was worried they would be scared, but they were too busy having fun to be scared. We had the BEST time! Even the dads were all smiles coming out of the rooms when we ESCAPED!!!! I’ve been to a few escape rooms in Dallas and Escape Enterprise was on a higher level of fun and set up! The decor was so awesome, the staff was great, and the price was totally worth it. I can’t wait to go back and try another room. Escape Enterprise is a great place for all ages to have a blast!!!!!", "pics": null, "resp": {"time": 1616294350559, "text": "Thank you so much. We love being local entertainment for birthdays to just friends or family. You guys were so fun to hang out with. We can’t wait for you to come back and continue the story."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "105278117722886759889", "name": "Brecia Bell", "time": 1620355751514, "rating": 5.0, "text": "Java was a wonderful game host! He was so nice, friendly, and helpful during our escape room. Hopefully we can come again when he is working!\nP.s. cute dog!", "pics": null, "resp": {"time": 1620648594088, "text": "Brecia thank you so much for your support.  Java is a fantastic game master and adds to the awesome local experience we strive to offer. We can’t wait to see you again soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "103238060876923350635", "name": "Victoria Boyle", "time": 1623462129984, "rating": 5.0, "text": "My fiancé and I had an amazing time! We barely escaped! Max was a great host- we will definitely come back", "pics": null, "resp": {"time": 1623528852700, "text": "Thank you Victoria we are delighted that you had an amazing time we can’t wait to see you back again. Max is an amazing game master and definitely adds to the local entertainment we strive to provide.  Thank you again."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "108720950730367935746", "name": "JokerCardMr187", "time": 1616807439668, "rating": 5.0, "text": "The room was fun and it was my first time going in a long while. Our game master Max did an excellent job, she laid everything out very well, gave great instruction, and was pleasant to us. I hope to return soon and actually complete the room.", "pics": null, "resp": {"time": 1616849110652, "text": "We thank you so much for visiting us and keeping it local. We try to provide a fantastic experience for all. One of our biggest attributes is our staff.  Max is proving to be an awesome team member with some killer game master skills.  Can’t wait to see you guys again soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "110673365668669995636", "name": "Kamilah M.", "time": 1623981346861, "rating": 5.0, "text": "It was really fun and beginners friendly. 10/10 would recommend with friends.", "pics": null, "resp": {"time": 1624013992008, "text": "Kamilah, thank you so much. We totally echo your recommendation for doing it with friends. It’s a fantastic way to do some team building and do it locally."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "108455887029761274857", "name": "Madisen James", "time": 1616978311831, "rating": 5.0, "text": "Our group had a blast! Max is such a sweetheart, and helped keep the energy and fun up throughout the game. Glad we escaped the Secret Society😎", "pics": null, "resp": {"time": 1618147270059, "text": "The secret society is a tough one and you guys did great. Max is awesome and fantastic at what she does.  We can’t wait to see you guys again soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "105927907272468606333", "name": "Jillian Mitchell", "time": 1618712896458, "rating": 5.0, "text": "So much fun and very accommodating! It was our first escape room experience for the whole group and we will definitely be back.", "pics": null, "resp": {"time": 1618748441890, "text": "Jillian thank you so much for spending your time with us. Also, a big Happy Birthday to you, we hope it is an awesome year."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "105594009494435947149", "name": "JM Bricks", "time": 1616978232420, "rating": 5.0, "text": "Yesterday I did my first escape room at Escape Enterprise. It was a lot of fun and Max was a great game master! I will be back and I would recommend it to friends.", "pics": null, "resp": {"time": 1618147218403, "text": "JM thank you. We appreciate you coming and hanging out with us. We love being able to provide a fun activity that is family friendly and locally owned."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "108098183070396114210", "name": "Lacey Beck", "time": 1610460754018, "rating": 5.0, "text": "I’ve been to many escape rooms all over Florida and Alabama. This is one of my most favorite places. The rooms are amazing, the puzzles are different and the people are fabulous! Aaron went out of his way to help me and even allowed me to call and talk to him with my questions. Our game master Emmalea was the sweetest and just a cutie pie. We will be back to take on the other rooms. Thank you for an awesome experience ❤️❤️❤️❤️", "pics": null, "resp": {"time": 1610542287986, "text": "Thank you for letting us be your family friendly entertainment. We are honored that you chose us to come and have fun with. EmmaLea is amazing and does a wonderful job. We can’t wait to show you the other immersive rooms that we have prepared for you.  Thank you."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "104663702492638079780", "name": "April Davis", "time": 1615683413764, "rating": 5.0, "text": "Something we decided on last minute and we LOVED it. We failed tragically but that being said it was still one of the greatest things I've done. The staff is excellent and our escape host was Max and I love her.", "pics": null, "resp": {"time": 1616066934598, "text": "April thank you so much. Max is amazing and doing a great job at providing our awesome customers with some well deserved local family entertainment."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "100430738372013806310", "name": "Stephanie McCray", "time": 1616451288307, "rating": 5.0, "text": "This was an amazing experience and our leader was MAX!!! She was more than amazing!!!! We failed but had a blast and the rooms are very decorated! We really felt like we were in the cabins!!! I give this place and MAX a 26/10 ❤️", "pics": null, "resp": {"time": 1616458142422, "text": "Stephanie,  thank you so much for the kind words.  We are elated to be able to offer good local entertainment.  Our staff is amazing, Max just came onto our team and all ready is doing an amazing job.  The staff here is what makes this place the best and my job easy.  Thank you again."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "109660579602522903302", "name": "Erin Grantham", "time": 1608764568726, "rating": 5.0, "text": "Escape Enterprise is awesome! Today I took my office staff for some Christmas fun, as we played the Christmas 2020 room. We had a great time together!! Earlier this year I took a Leadership group for team building exercises, and they had a terrific experience. Such a fun, interactive way to work or play!!", "pics": null, "resp": {"time": 1608786933795, "text": "Thank you for including us in both your team building and office activities. We can’t wait to show you what else we have in store for your entertainment needs."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "116837299939135468067", "name": "C Walker", "time": 1609174296874, "rating": 5.0, "text": "Our family had a great time at Escape Enterprise last weekend! Natalie helped us & was so sweet. She was so generous in extra clues when she saw we were struggling! Great, family fun! We are looking forward to going back again soon!", "pics": null, "resp": {"time": 1609334738134, "text": "Thank you guys so much. Natalie is amazing. We can’t wait to see you back for some good old family fun."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "112741768106702056818", "name": "Syidah Garrott", "time": 1624236432953, "rating": 5.0, "text": "Max was an awesome host... cant wait to return next week!", "pics": null, "resp": {"time": 1624238963679, "text": "Syidah thank you guys for coming and playing today. We are so thankful that people choose local entertainment.  Max is amazing at her job, and we thank you for the review."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "101394745669760124284", "name": "Stephanie Nelson", "time": 1605046414121, "rating": 5.0, "text": "We took a group of about 12 for my birthday this past Saturday, all but 2 of us (myself included) were newbies. We had an absolute blast! Emily was the one in charge of our room and she was awesome! The entire staff really is great, we will definitely be back! Thank you Escape staff for your part in making my birthday awesome!", "pics": null, "resp": {"time": 1605369884294, "text": "You’re so welcome it was our pleasure to make your birthday a blast."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "107243880957020908127", "name": "E&A Vinyl Designz", "time": 1600030050440, "rating": 5.0, "text": "This was our first experience doing an escape room. It didn't disappoint. We had a lot of fun, even doing the \"beginner\" level since we had our 11 yo and 8 yo doing it with us. They weren't scared doing \"The Shack\". The young lady who checked us in and gave instructions was very sweet and helped us as needed. We look forward to doing another one and will recommend it to our friends!", "pics": null, "resp": {"time": 1600046371201, "text": "Thank you so much for your sharing your time with us. We are so glad that you guys had such a great time. We can’t wait to see you again soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "107598588991799898757", "name": "Julianna Barnes", "time": 1606239425663, "rating": 5.0, "text": "I’ve been to multiple escape rooms and this was by far the best. The shack is super cool, they have different lightening and sound effects to make it seem more realistic. Endia was awesome and gave us clues when we needed them and was extremely helpful! Definitely recommend to anyone looking for an awesome time in the Enterprise area!", "pics": null, "resp": {"time": 1606308249009, "text": "Julianna thank you. We have put our hearts into Making an experience for families and friends that is fun and memorable. We can’t wait to show you what comes next."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "100522347026584958151", "name": "cynthia peebles", "time": 1601164539931, "rating": 5.0, "text": "We traveled from Andalusia Al. to Escape Enterprise. We booked ahead and signed all our waivers online before we got there which made our process quicker. This was the first time I had ever done an escape room. We were greeted by Nate who also helped us get started. He was extremely helpful and super friendly which made our group feel very welcomed. The room we did was called the Shack...the room itself was very well set up and very real feeling. Nate helped us by giving us clues (lots of clues🤣🤣) He even joked along with us on the screen which again made us laugh. I took my daughter and 2 of her friends to celebrate my daughter turning sixteen...we all had a blast. The whole process from booking online to actually going through the room was a great experience. Give Nate a high 5 he deserves it.....because we were clueless and without him it would not have been as fun.", "pics": null, "resp": {"time": 1601165529576, "text": "Thank you so much and Happy Birthday.\nNate is awesome and it sounds like he rocked it."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "106497736610350581522", "name": "Jeremy Schwanke", "time": 1603144399120, "rating": 5.0, "text": "Took the mother in law, 10yr old kid and wife to do the secret society room. It was a fun room and had challenges for all levels. The kid had a blast trying to figure out one clue to the next clue. Awesome experience from first walking in and meeting Nate til the end where Nate once again greeted us. If you have never done an escape room, go here for a great experience.", "pics": null, "resp": {"time": 1603200924756, "text": "Well thank you Jeremy"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "107192470440745695987", "name": "Lindsey Mitchell", "time": 1604107298893, "rating": 5.0, "text": "They coordinated/sponsored/designed Spooky in City for the city of Enterprise, which not only was a blast for the trivia loving adults in our family, but was incredibly entertaining for our little ones to see all the Halloween characters and receive candy! The amount of detail and coordination it must have taken to put this event on was far beyond anything we could have imagined! So impressed!", "pics": null, "resp": {"time": 1604112143525, "text": "Thank you our part was small the Parks and Recreation department and the sponsors made this happen."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "118253030385258409939", "name": "C. Herring", "time": 1610430028550, "rating": 5.0, "text": "Professionally Done! Friends and my family went on Halloween Night 2020 and it was awesome. We finished in a record time. least amount of people, found all the clues, and used under 5 hints. Was it difficult? You bet it was! BUT, Nate (the game master) was AWESOME! Clean, organized, and followed all COVID-19 guidelines (if you need that). It does cost, but the fun was worth it! For Military and Veterans, be sure to let them know. We will go again? ABSOLUTELY!", "pics": null, "resp": {"time": 1604680629861, "text": "Thank you so much you guys were awesome and we really appreciate you letting us be your entertainment for the night.Nate is a fantastic game master that keeps it fun and entertaining."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "114722498561539680184", "name": "lynnda St Clair", "time": 1618019954801, "rating": 5.0, "text": "Loads of fun. A real challenge but good team play.", "pics": null, "resp": {"time": 1618147321052, "text": "Lynnda thank you guys for coming. Escape rooms are a fantastic way to promote teamwork and why not shop local at the same time. You guys rock."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "111850983853442635557", "name": "Samantha Bernardy", "time": 1611539876218, "rating": 5.0, "text": "It was SO great! The design and realistic set up of the rooms is amazing. The girl that was working was extremely helpful when we got stuck.", "pics": null, "resp": {"time": 1611541980817, "text": "Thank you so much. We try to make your experience as memorable as possible. We can’t wait to show you what is coming up soon. Our staff is amazing. I don’t know which one you were specifically talking about but all the young ladies at Escape Enterprise are world class."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "102685999253297390097", "name": "John Gamble", "time": 1621196474756, "rating": 5.0, "text": "Love the puzzles . Emily is the best Game master Eva !", "pics": null, "resp": {"time": 1621595720880, "text": "John thank you, EmmaLea is a fantastic game master. We can’t wait for your next room."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "105308538092957456508", "name": "Nyah Phillips", "time": 1616895496511, "rating": 4.0, "text": "Our group played Secret Society and we had Max as our game master, she was awesome.", "pics": null, "resp": {"time": 1616936027410, "text": "Nyah thank you so much for coming and spending your time with us.  We love to provide a wholesome local entertainment for our community.  Max is an amazing gamemaster, I wholeheartedly agree with you that she is awesome and so much more.  Max is part of what makes Escape Enterprise amazing."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "104072917875110092007", "name": "Justin Phillips", "time": 1613958135056, "rating": 5.0, "text": "Had an amazing time with the Escape Enterprise Team. We have done a bunch of escape rooms and we had a blast in the Secret Society Room. Nate was our game host and was awesome. We will be back soon!", "pics": null, "resp": {"time": 1613960608311, "text": "Thank you so much. Nate is an amazing kid with tons of potential.  I’m glad you guys got to come and have fun here locally. Thank you for supporting local business, and thank you for taking the time to recognize one of our gamemasters they are all great people and we love them. Cant wait to see you again soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "109206771991192471324", "name": "Tabi Davis", "time": 1615909765050, "rating": 5.0, "text": "Escape Enterprise is amazing. We played The Shack and it was completely submersive. I was drawn into the story and once we stepped into the room and the door closed, I felt like I was really there. Our Game Master, EmmaLea, was fun and energetic and exceptional at putting us into the story and the experience. We will absolutely be back! Thank you EmmaLea and Escape Enterprise for an awesome day date!", "pics": null, "resp": {"time": 1616067072002, "text": "Tabi thank you so much for letting subbed your local date night.  The shack is a great example of our rooms.  EmmaLea is a great example of the team that works here.  She is outstanding and we thank you so much for coming and spending your date night with us."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "102498515872918325715", "name": "Mandi Hunter", "time": 1612674729181, "rating": 5.0, "text": "We had a blast. Room was challenging but fun. And staff was very nice..", "pics": null, "resp": {"time": 1612669314693, "text": "Thank you so much."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "113476272535852703880", "name": "Dawn Dozier", "time": 1602386302603, "rating": 5.0, "text": "Interesting and challenging experience. Definitely wouldn't recommend for young kids. I think the more people you have the better your chances of escaping. Fun and different experience. Would do again.", "pics": null, "resp": {"time": 1602419223140, "text": "Thank you guys for joining us last night and playing the Shack.  Thank you for the review as well you guys did a great job."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "111435002722035819670", "name": "Lauren Poss", "time": 1601780759639, "rating": 5.0, "text": "We had a great time! We played Secret Society and with just the 2 of us, we ended up going over by about 9 minutes. We played the last game of the night, and the owner let us stay past our time and gave us extra clues to help us finish the game and make it out. Staff was super friendly and the game was challenging and engaging! We'll definitely be back!", "pics": null, "resp": {"time": 1601809857806, "text": "Thank you guys for coming and spending your date night with us. We can’t wait to show you what else we have for you."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "118199993644444443233", "name": "WILLIE JONES", "time": 1604156497545, "rating": 5.0, "text": "Spooky in the City on ClueKeeper/Escape Enterprise\nThis was a first for my family and it was an absolute blast. We were concerned that due to the Pandemic we would be home tired out of our mind. When we got the chance to participate is this like scavenger hunt / trick or treating, we had to at least try and it did not let us down. This was amazing everyone was involved with solving clues to make it a win. Thank you for such a great time. We look forward to the next and the next  and next time we are able to participate.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNWtuertQ7ECMlYb3-Bk_mEx6ue58kXeCCFOH5k=w150-h150-k-no-p"]}], "resp": {"time": 1604231950129, "text": "You are so welcome we enjoyed seeing the joy on everyone’s face. You guys are awesome."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "112495062799070384399", "name": "Op Kevo", "time": 1614487297802, "rating": 5.0, "text": "Very friendly. 10/10 would do it again. Java was a great game master.", "pics": null, "resp": {"time": 1614548171120, "text": "Thank you for letting us be your local entertainment. Java is awesome. We can’t wait to see you again in the future."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "105958824728195905106", "name": "Heather Herold", "time": 1613858486521, "rating": 4.0, "text": "First time trying an escape room today. We had a few hiccups so the room we originally wanted to do was unavailable. After a quick switch we were relocated and still had a good time. Emily was very apologetic for the small issue and gave us a voucher for the inconvenience. I will be back to give it another shot for sure.", "pics": null, "resp": {"time": 1613860812446, "text": "Heather thank you so much for your grace, it has been a crazy weekend and we really do appreciate you guys.  It is customers like you guys that we love to serve.  We can't wait to show you what we have in store in the future.  EmmaLea always goes above and beyond and is an amazing person. Thank you again."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "106166663129674567126", "name": "Anz McKee", "time": 1606146000603, "rating": 5.0, "text": "We had a blast. Great place. Java was our game master.\nWe did the secret society room and escaped with minutes to spare.\nHighly recommend.", "pics": null, "resp": {"time": 1606186678222, "text": "Anz thank you so much for coming.  Java is doing a fantastic job.  Secret Society is a tough room and you guys did awesome."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "102354262563097042014", "name": "Cara Morris", "time": 1603597992184, "rating": 5.0, "text": "We had a great time for a Mom’s night out! Our game master was awesome. Proud Enterprise has Escape Enterprise available for a fun family friendly night out. We can’t wait for future rooms.", "pics": null, "resp": {"time": 1603626627593, "text": "Thanks Cara. You guys were awesome to work with."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "100845204375763534963", "name": "Jason Clark", "time": 1606342320783, "rating": 5.0, "text": "My family and I did the Santa room the other night. It was a great experience. The staff was very professional and helpful. Well worth the money. Thanks Endia!", "pics": null, "resp": {"time": 1606364484724, "text": "Thank you sir you guys were amazing. We can’t wait to see you back to try some of our more immersive rooms"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "106765358191211565743", "name": "Laura Bartholomew", "time": 1600391717525, "rating": 5.0, "text": "Escape Enterprise was absolutely amazing!  The staff was welcoming, energetic, and helpful.  We went here for my daughter’s birthday with several of her friends.  Everyone had a great time and they can’t wait to go again to try another room. I highly recommend it!!!", "pics": null, "resp": {"time": 1600425512690, "text": "Thank you guys so much. It was our pleasure to be able to celebrate with you"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "107080982697657906848", "name": "Ashley Hanks", "time": 1609630460295, "rating": 5.0, "text": "We had an amazing time at Escape Enterprise! We managed to escape The Vanishing Act, and it was super fun! Emily was absolutely wonderful and very helpful! We will be planning to come back and try another room soon!", "pics": null, "resp": {"time": 1609631168944, "text": "Well thank you so much. We strive to make family fun a new and revived thing and you guys did amazing at our newest attraction."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "106013802576015843527", "name": "Stu Mitchell", "time": 1604149454047, "rating": 5.0, "text": "Escape Enterprise is a fantastic business. They sponsored and organized the Spooky in the City event and it was beyond expectation. The event had multiple clues per stop, videos and coordination with many people. After seeing Aaron and Escape Enterprise’s detail on this, I am excited to go and try out the Escape Enterprise rooms because I know they will be awesome.", "pics": null, "resp": {"time": 1604150401738, "text": "Thank you Stu it was our pleasure to serve you. We look forward to building future games for you to enjoy."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "105858833057098547996", "name": "David Long", "time": 1618778273119, "rating": 5.0, "text": "Great experience! Max was a wonderful game master!", "pics": null, "resp": {"time": 1618916456588, "text": "David thank you so much. Max is an outstanding game master and I thank you for spending your time and money locally with us."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "101983039271510435665", "name": "Jonathan Jenkins", "time": 1603201014819, "rating": 5.0, "text": "This was great! My wife and I went for our anniversary. The folks running the place were very helpful and fun to be around. I would definitely recommend for anyone looking for a fun night!", "pics": null, "resp": {"time": 1603201702752, "text": "Thank you very much sir it was our pleasure to host your anniversary."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "113182289081067428511", "name": "Richard Harris", "time": 1624236596261, "rating": 5.0, "text": "Max was a great Host and it was very fun", "pics": null, "resp": {"time": 1624239000172, "text": "Richard, thank you for the review.  Max is an amazing game master and makes everyone’s experience that much better."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "111639907982153778397", "name": "Lauren McClung", "time": 1613405418794, "rating": 5.0, "text": "Endia and the team at Escape Enterprise are the best! We enjoy our experience each time we go and can’t wait to try to escape a new room.", "pics": null, "resp": {"time": 1613796521488, "text": "Lauren thank you so much for letting us be part of your home town entertainment.  We love getting to know you guys and find out how to make your experience the best it can be.  Endia is a great Gamemaster.  We look forward to seeing you guys again soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "108173521532760296056", "name": "Barbara W. Wade", "time": 1598266076635, "rating": 5.0, "text": "Our family of 5 went to EE over the weekend. It was definitely a great family fun outing! Our children (ages 10, 10 and 13) all got into it and were able to help solve the clues to escape under 60 mins. We would highly recommend this outing to anyone!", "pics": null, "resp": {"time": 1598269808529, "text": "Thank you so much.  Your family did an amazing job."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "109231963394248617873", "name": "Katie Padgett", "time": 1611170117066, "rating": 5.0, "text": "My family had a lot of fun at Escape Enterprise!  The staff is very helpful and friendly.", "pics": null, "resp": {"time": 1611189980851, "text": "Katie thank you for letting us provide some family fun for you guys. We can’t wait to show you the immersive experiences we have coming soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "107394297837260847935", "name": "Kevin Davis", "time": 1615993356909, "rating": 5.0, "text": "EmmaLea was a great host and perfectly professional in every way!", "pics": null, "resp": {"time": 1616067156501, "text": "Kevin thank you so much for coming and spending your time with us. We strive to put together a world class team. EmmaLea is a fantastic example of that."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "110557675821168259296", "name": "Justin Calhoun", "time": 1609633692934, "rating": 5.0, "text": "Emily was a great game master we had a blast even though the shack claimed another victim I would highly recommend this for a fun night in enterprise", "pics": null, "resp": {"time": 1609641525976, "text": "Well thank you for letting us be a part of that great family night. EmmaLea is awesome she has definitely claimed her role as a great game master."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "109323926287685847633", "name": "Adrienne Johnson", "time": 1597151280769, "rating": 5.0, "text": "Our two children LOVED Escape Enterprise and cannot wait to go back!! They even said on the way home they couldn't argue anymore because they had gone through \"The Shack\" together and were a team....Your kids have fun AND it makes them get along better??? You can't beat that :-)", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNw6zTyH9lDq6wSW9SHlaq-Akzff7HrqfyTqw_8=w150-h150-k-no-p"]}], "resp": {"time": 1597231843580, "text": "That is awesome we are so glad we could be a part of your family fun."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "117721856164749164834", "name": "Drew Adams", "time": 1614487424875, "rating": 5.0, "text": "Gamemaster Java was a absolute unit and made my experience quite enjoyable. Would 10/10 give him a raise just saying.", "pics": null, "resp": {"time": 1614548394306, "text": "Java is pretty awesome. Thank you for hanging out with us for the night.  We can’t wait to show you what we have coming soon. Thank you as well for keeping it local and supporting us."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "117104138573397031200", "name": "kareem cole", "time": 1606087234534, "rating": 5.0, "text": "The Secret Society was freaking cool! I thought the shack would be my favorite now there’s some competition! Amazing experience can’t wait for more.", "pics": null, "resp": {"time": 1600980780895, "text": "Awesome thank you so much for playing.\nYou guys rocked it."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "116667642074432052158", "name": "Angelique Vachon", "time": 1604265534905, "rating": 5.0, "text": "Wow!! Endia was amazing; really great and helpful.  The ambience was creepy real.  We actually felt like we were in the Shack. Great fun!! Excited everytime I figured out a clue.", "pics": null, "resp": {"time": 1604362677188, "text": "Thank you so much. Endia is pretty awesome and we really appreciate the props on the room."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "101681199697413342779", "name": "Hammie 527", "time": 1606095145227, "rating": 5.0, "text": "Such an amazing experience!! The staff are very friendly and the atmosphere is incredible! Very immersive and entertaining challenge!", "pics": null, "resp": {"time": 1606139866929, "text": "Thank you so much. You guys did amazing."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "102824912668328481162", "name": "Janie Hall", "time": 1614569041405, "rating": 5.0, "text": "Awesome experience!! It was a great team building exercise for us!!", "pics": null, "resp": {"time": 1614699562145, "text": "Thank you. We are extremely proud to be able to offer team building services in the local area. Team building is sick an important part of working with a group that often goes untrained. Thank you guys for letting us be part of that process."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "108356887202796642936", "name": "Angela Jones", "time": 1594167283650, "rating": 5.0, "text": "We LOVE Escape Enterprise! Not only is this the most fun thing to do in Enterprise but the staff is amazing. They truly make it a memorable experience. The owner is amazing too! We will continue to be repeat visitors. Thank you for being here!", "pics": null, "resp": {"time": 1594174796959, "text": "You’re so welcome and thank you for the amazing compliments. Its our customers that make us great."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "102252515680854294553", "name": "Pop DeluxePlays", "time": 1605996248853, "rating": 5.0, "text": "Very nice staff. Fun and challenging. 100% would do again", "pics": null, "resp": {"time": 1606009961937, "text": "Why thank you. We are ecstatic that you had a great time. We can’t wait to see you again."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "103202493239201844661", "name": "Steven Duke", "time": 1627501722653, "rating": 5.0, "text": "Update - Went this past weekend and had a good time in The Vanishing Act room. Max was a great game master as we had 2 younger kids with us and she was amazing at helping them and us with clues along the way.\n\nGreat experience. Some friends were in from out of town and we decided to try the escape room out. The box was a great and incorporated a lot of the things around town.", "pics": null, "resp": {"time": 1561828230238, "text": "Thank you so much we appreciate you coming to do the Box, you guys were awesome.\nUpdate:\nSteven thank you again for staying local with your entertainment.  Thank you so much for bragging on our gamemaster Max, she does a fantastic job and totally helps make the Escape Enterprise run smoothly."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "106113087402517882435", "name": "Crystal Birge", "time": 1612049880556, "rating": 5.0, "text": "So much fun! And the staff is awesome!", "pics": null, "resp": {"time": 1612101313681, "text": "Thank you Crystal it was our pleasure to provide you with some good old local entertainment."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "109122345300498661047", "name": "Cindy Smith", "time": 1595950584568, "rating": 5.0, "text": "We went to Escape Enterprise for my sons (twins age 20) birthdays.  We had a GREAT time!  Everything was ready and our host was AWESOME!!  Can highly recommend this!  Thanks Escape Enterprise!", "pics": null, "resp": {"time": 1595954304622, "text": "Thank you so much we appreciate the opportunity to serve you."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "102255032910071671899", "name": "Sarah Schwanke", "time": 1589665087018, "rating": 5.0, "text": "We had a blast. The owner was very friendly. It was a little more difficult than we initially thought. It’s fun trying to find and decipher the clues within the time limit. Family friendly, our son had fun finding clues and helping solve them. We will definitely be back to try the other rooms.", "pics": null, "resp": {"time": 1589679005708, "text": "Thank you guys for your support. We can’t wait to see you again."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "101186893817078409589", "name": "ancarp08", "time": 1627003307152, "rating": 5.0, "text": "My family and I had a BLAST! Nate, our game master was AWESOME!! My team ranged from 5 years old to 32 years old, and everyone enjoyed it. I would HIGHLY recommend this place!", "pics": null, "resp": {"time": 1593897306765, "text": "Thank you so much for joining us. We are so happy that we can provide a fun local place perfect for the whole family.  You guys did amazing.  We can’t wait to see you again soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "114989993931200269094", "name": "North _of _Bangor", "time": 1628042413889, "rating": 5.0, "text": "Natalie is great!", "pics": null, "resp": {"time": 1628548969700, "text": "Natalie is pretty awesome we appreciate you guys having a great time and sharing it with us."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "103930976370074097730", "name": "Steven Burns", "time": 1628042369608, "rating": 5.0, "text": "Natalie is great!", "pics": null, "resp": {"time": 1628549010201, "text": "You are correct she is a fantastic game master. Fun fact she has been with us since the beginning and does an awesome job."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "102448735307520648943", "name": "C C", "time": 1584400159480, "rating": 5.0, "text": "After doing 2 different rooms here, this place is challenging. The decorum put into their rooms was impressive. Each room has its unique challenges that make you have to think and don't expect a clue to everything. Customer service was no where a short coming. Other places may be cheaper, but here it really feels that you are locked into the scenario, not a tent. If one grain of truth can be said, the rooms are as fun as the couch is comfortable. You will see. All in all the designer and workers whom constructed this facility broke their backs for the realistic vision that you will enjoy.", "pics": null, "resp": {"time": 1584482393519, "text": "Wow,  thank you so much for your kind words. We appreciate you taking the time to tell others about your experience. We are honored to have served you and can’t wait to do so again in the future."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "113423815039494853495", "name": "Mathew Pin", "time": 1604109319140, "rating": 5.0, "text": "Just finished Spooky in the City. Escape Enterprise did an amazing job! Thank you so much!", "pics": null, "resp": {"time": 1604112210760, "text": "You are welcome. We thank you for your kind words we were just a small part of the night. Enterprise parks and rec and all of our sponsors were awesome."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "109093212706226960144", "name": "sky hammond", "time": 1597011340580, "rating": 5.0, "text": "My brother and I completed \"The Box\" at Escape Enterprise and we had a blast! The staff was extremely friendly and helpful, and the rooms are very well thought out. We will be back again!", "pics": null, "resp": {"time": 1597015085023, "text": "Thank you so much Sky. We were so happy to help you guys have a great time."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "103353507093628243484", "name": "Mia B", "time": 1589426729546, "rating": 5.0, "text": "First time I went to an escape room, and it honestly set the bar really high. The intro video was so well done and made the whole experience seem realistic. The puzzles were way harder than I thought and like nothing I’ve ever seen before. My group and I might have run out of time, but I still felt really accomplished with the puzzles we were able to solve.", "pics": null, "resp": {"time": 1589458312619, "text": "You guys were awesome. Thank you so much for letting us set that bar."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "115042714759325900043", "name": "Lyn Diefenderfer", "time": 1601845664231, "rating": 5.0, "text": "Excellent Place.  Really well done!  So much fun", "pics": null, "resp": {"time": 1601846335323, "text": "Thank you so much. You guys were awesome."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "109536840895511587166", "name": "Alex Brown", "time": 1593307725803, "rating": 5.0, "text": "Really enjoyed the room! We escaped with 12 minutes left! The owner reserved the room for us, that was a big help! The puzzles are top notch! 11/10", "pics": null, "resp": {"time": 1593319165730, "text": "Thanks Alex we appreciate it."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "113242890727462629393", "name": "Amanda Harrison", "time": 1603764779649, "rating": 5.0, "text": "Could not have asked for a better girls night out!! Secret society was so much fun! Can’t wait to go back for the other rooms!!!", "pics": null, "resp": {"time": 1603839024677, "text": "Amanda thank you so much we can’t wait to host your next night out."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "114569342364604643034", "name": "Sophia Kane", "time": 1602510306369, "rating": 5.0, "text": "The workers were super sweet and the place was really nice, definitely recommend doing it for any occasion :)", "pics": null, "resp": {"time": 1602542318001, "text": "Thank you very much we appreciate it."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "108122452220893976265", "name": "Brittany Bell", "time": 1602290601297, "rating": 5.0, "text": "Nate was a good game host! Definitely going again here soon.", "pics": null, "resp": {"time": 1602294064229, "text": "Awesome thank you so much for coming and we can’t wait to see you soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "115219801624880376390", "name": "Mallorie Smith", "time": 1605324781545, "rating": 5.0, "text": "Emily our game master was awesome! We didn’t make it out in time but we had so much fun!", "pics": null, "resp": {"time": 1605369946977, "text": "Mallorie thank you she is pretty awesome at her job."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "108221140650550334352", "name": "Jostlyn Bomhard", "time": 1591011175977, "rating": 5.0, "text": "They were incredibly helpful and accommodating to our requests. We had so much fun! The puzzles were tough but not impossible. Definitely the best escape rooms in the wiregrass!", "pics": null, "resp": {"time": 1591020399956, "text": "Wow thank you so much for your compliment. We are so glad to have served you guys. See you again soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "105759640704221830204", "name": "Felicia Burton", "time": 1598668780137, "rating": 5.0, "text": "Very fun, professional atmosphere. Loved it. We will be coming back.", "pics": null, "resp": {"time": 1598700778626, "text": "Thank you so much we loved having you."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "107680546939813527148", "name": "Jennifer Kelley", "time": 1577718172631, "rating": 5.0, "text": "Great fun! The staff was friendly and knowledgeable. My daughter has a special medical need, which they happily accommodated. Thank you so much for that! You have no idea hat far a simple kindness goes!", "pics": null, "resp": {"time": 1577832307091, "text": "You’re very welcome it is our pleasure."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "105255890419531654641", "name": "Leighanne Crews", "time": 1603640854492, "rating": 5.0, "text": "Thanks to Java. We enjoyed our girls night out 😊", "pics": null, "resp": {"time": 1603641401721, "text": "I heard you had quite the scare. I am working on getting you guys a copy of the moment."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "105917279767159156798", "name": "Crystal Burns", "time": 1628042338292, "rating": 5.0, "text": "Natalie is great!!", "pics": null, "resp": {"time": 1628549099283, "text": "Crystal thank you for letting us be your entertainment for the evening. You are totally correct Natalie is amazing and does such a good job. She is an extremely loyal and awesome gamemaster."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "116156058231170684913", "name": "Anthony Tec Tony Lloyd", "time": 1603224095733, "rating": 5.0, "text": "#local escape room with some amazing puzzles. #familyfun #shoplocal 😱😬👌", "pics": null, "resp": {"time": 1603278003806, "text": "Thank you"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "100059185714782392130", "name": "eddie morris", "time": 1592098770073, "rating": 5.0, "text": "We did the Shack and loved the set up, the clues were great, not too hard but not to easy, liked how we entered into three different rooms, would highly recommend it to anyone", "pics": null, "resp": {"time": 1592142573738, "text": "Thank you. You guys were awesome."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "109380156075466242973", "name": "Nancy Cain", "time": 1581837390174, "rating": 5.0, "text": "Decided to do something different for date night and was not disappointed!  Did the Shack and it was difficult but so fun. I love multiple room Escape Rooms. Will be returning soon (probably tomorrow).", "pics": null, "resp": {"time": 1581856273096, "text": "Thank you so much we are so glad we can be a part of your memories."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "103779417087063606585", "name": "Clay Ray", "time": 1570420370322, "rating": 5.0, "text": "Me and my family have been wanting to try an Escape Room for a while now. So today we took the time and went to Escape Enterprise! They had just moved into their new location and we were greeted by McKenna. She explained everything thoroughly and we were excited to get going. My 8 year old loved helping us in  The Box! Such a fun thing to do with the family and just what Enterprise needs. I hope the community supports this business and allows to them to continue to grow. Already planning our next trip for another room!", "pics": null, "resp": {"time": 1570445177638, "text": "Thank you so much and we are glad you had a good time. Mackenna is awesome and we appreciate you pointing her out."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "102151471346735986394", "name": "The Griffin 6", "time": 1578882514230, "rating": 5.0, "text": "Took my daughter, my sister, and 3 of my daughter’s friends to celebrate her birthday! We had such a great time! The staff was so friendly and the room was so fun!! We will definitely go back again!!!", "pics": null, "resp": {"time": 1578910143900, "text": "Thank you so much for choosing to celebrate your birthday with us. We are honored to spend it with you."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "112429667109176498636", "name": "davidc", "time": 1595183377139, "rating": 5.0, "text": "Went here with family. Very nice and clean place to bring family for a little while of fun and excitement.", "pics": null, "resp": {"time": 1595187311192, "text": "Well thank you, we appreciate the chance to serve you and your family."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "102045447296039260645", "name": "Amanda Smith", "time": 1557700527442, "rating": 4.0, "text": "We had a Great time for our first adventure at Escape Enterprise. We started off with The Box room. We were very puzzled, but with great humor we enjoyed every minute. I went for Mother's day and took my son an my mother. We can't wait to go again. Staff was very nice and helpful. I suggest trying this out an have some fun. 😊👍", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO9ttuPJd-UIzFi0_UfycsC3yLbs_2uC2jzWof6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOhjBtMRuGKY4qqGwYjrWKx7uCqkw80Qvqr_g08=w150-h150-k-no-p"]}], "resp": {"time": 1557701232117, "text": "Thank you so much for the kind words. Happy Mother’s Day."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "113001181776413973319", "name": "Savanah Weed", "time": 1563901050679, "rating": 5.0, "text": "We did two of the rooms and had such a great time! The attendants were fun and helpful and the rooms we did (Secret Society and The Box) were fun and engaging and had us thinking about different strategies for next time the rest of the night. The owner is awesome. Can’t wait to come back and try again!", "pics": null, "resp": {"time": 1563904157131, "text": "Thank you we can’t wait to have you back. We have lots in store so stay tuned."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "117163073104488925380", "name": "Michael Mitchell", "time": 1618712142560, "rating": 5.0, "text": "I wish I could get it 1000 stars", "pics": null, "resp": {"time": 1618748504793, "text": "Michael thanks for the star count, we are just thankful that you guys chose to do a little local shopping with your entertainment source.  We look forward to showing you what is in store in the future."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "111151842606127053212", "name": "Amy Kyoko", "time": 1548564948904, "rating": 5.0, "text": "We had a team get-together here today that was so much fun!  We rented the location for two hours, which afforded us a party room to use for pizza and drinks as well as the opportunity to go through both The Box and Parisian Nights.  The rooms were challenging and enjoyable, the Escape Enterprise team was super accommodating, and a great time was had by all.  I love this for a team builder or birthday party venue, and it can even be turned into a competition if your group so desires! So much fun!", "pics": null, "resp": {"time": 1549158015915, "text": "You guys were awesome thank you so much for choosing us!"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "105359558672949382933", "name": "Paul Alexander", "time": 1561119919683, "rating": 5.0, "text": "First time to do an escape room -- our adult family group had an awesome time working together to find the clues.  The Box was the perfect level of difficulty for our \"beginner\" group.  The staff was very cordial and helpful.  It's great to have another wholesome, family-fun opportunity in Enterprise.", "pics": null, "resp": {"time": 1561120700109, "text": "Thank you for coming and allowing us to host your family fun."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "108682017028247470151", "name": "Payton Green", "time": 1592001339169, "rating": 5.0, "text": "Escape enterprise is the place to go !! Great place to take some close friends or team building for an office !! You won’t be disappointed and the staff is amazing !!", "pics": null, "resp": {"time": 1592005183697, "text": "Thank you Payton"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "101536839825273995335", "name": "Lee Milliner", "time": 1608345290751, "rating": 5.0, "text": "We had a great team building time at Escape Enterprise!!  If you are looking for a great night of entertainment these guys are the people to see!!  Thanks for a great experience!!", "pics": null, "resp": {"time": 1581856224898, "text": "Thank you sir. Your team building was awesome"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "116675820001736689743", "name": "Angela Wonacott", "time": 1581152311803, "rating": 5.0, "text": "Most fun date night I’ve had in a long time. Friendly staff. Exciting venue. Wonderful evening!", "pics": null, "resp": {"time": 1581163235313, "text": "Thank you so much."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "113552050806412704747", "name": "Heath Jones", "time": 1575082843433, "rating": 5.0, "text": "We had such a blast!! Such a great way to spend some time with friends and work together. Will definitely be coming back to try all the other rooms. Thanks for bringing this to Enterprise!!!", "pics": null, "resp": {"time": 1575083724408, "text": "You’re welcome thank you guys for supporting us."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "115965638726586935834", "name": "Buttons _25267", "time": 1557442943278, "rating": 5.0, "text": "Glad to have this fun and exciting place in our small town of enterprise. We loved going through the box, we didn’t escape but we all still had such a great time. The owner and the employees are so sweet and very helpful.", "pics": null, "resp": {"time": 1557444071591, "text": "Thanks buttons it was a blast watching you and your friends go through"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "100983395971824325478", "name": "Holly Hammonds", "time": 1566089037746, "rating": 5.0, "text": "So much fun! We just finished The Box and had a blast. Julianna was a great game master, too. Can’t wait to try the other two!", "pics": null, "resp": {"time": 1566091311784, "text": "Thank you so much we appreciate you guys coming. Thank you for the compliment to Jules we love it when people love on our game masters, they are the best."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "101363765753191725959", "name": "Sammy Echevarria", "time": 1621396891918, "rating": 5.0, "text": "Really fun", "pics": null, "resp": {"time": 1621595767333, "text": "Sammy thank you for the kind words. We love the fact that we are able to provide wholesome family entertainment right here locally."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "101877418478397878389", "name": "Danielle Daniels", "time": 1579916463924, "rating": 5.0, "text": "We had soo much fun. The staff was super nice and helpful. The room was very interactive. Cannot wait to go back!", "pics": null, "resp": {"time": 1579919702795, "text": "Thank you so much we can’t wait to see you again."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "115012923917734414253", "name": "Jenell Worthington", "time": 1545595969462, "rating": 5.0, "text": "Great time! The owner was super nice. The experience was well thought out. It was just difficult enough to make it fun with out being frustrated. Brought our kids 8 and 11 and they were able to help us escape!", "pics": null, "resp": {"time": 1545925809057, "text": "Thank you guys"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "102502743686251844882", "name": "Tracy Brown", "time": 1562530198862, "rating": 5.0, "text": "Had a great time! Wonderful Staff. Can't wait to go back! Harder than it looks, but we escaped with only 35 seconds left of the clock. 👍", "pics": null, "resp": {"time": 1562534413125, "text": "Thank you guys so much for coming we had a blast with y’all."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "103494464162588688196", "name": "Emily Gazda", "time": 1565705395762, "rating": 5.0, "text": "This was a blast!!! There are different types of puzzles in the room so everyone has a chance to feel like they've done something. It's nice to finally see something in enterprise to do at night that isn't a smoke filled bar. This is the perfect thing to go to for teen groups, familie, date nights even just getting to know your coworkers. Also the price is great. I've seen these types of things in large cities usually for over $50 each and many times closer to $100 a person. Also it's great they change the rooms so it's something that can be gone to more than once. I'm looking forward to going again!", "pics": null, "resp": {"time": 1565730064085, "text": "Wow. Thank you so much we really appreciate you guys coming and supporting us."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "115422635614528761996", "name": "brian barry", "time": 1545054209237, "rating": 5.0, "text": "Wow...an Escape Room in our little town. Took the family and had a excellent time. The employees took the time to explain everything to ensure our experience was great. If you have never tried an escape room, they are so exciting. All ages can contribute to the game and whether you figure it all out in time or not, everyone will have fun. We completed \"The Box\" and look forward to coming back for a new room. keep up the good work Escape Enterprise!", "pics": null, "resp": {"time": 1545226345292, "text": "Thank you guys so much we will have new rooms open soon. Be sure to grab a small group and try the Christmas challenge room it’s only open through December"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "105708776583512060061", "name": "Genevieve Morris", "time": 1592101700656, "rating": 5.0, "text": "Had an exciting time with friends! Check out this place for challenging entertainment!", "pics": null, "resp": {"time": 1592142591169, "text": "Thank you so much you guys rocked it last night."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "104976371314997631095", "name": "carol gibbs", "time": 1575063753030, "rating": 5.0, "text": "Had an awesome time.  Great room.  Great service.  Can't recommend it enough.", "pics": null, "resp": {"time": 1575083698869, "text": "Thank you so much we had a blast hosting you guys."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "116382654069155248143", "name": "Travis Hallman", "time": 1557623070828, "rating": 5.0, "text": "Escape Enterprise has provided me with an outstanding experience! I would happily recommend Escape Enterprise to all my friends with confidence! It is clear that Escape Enterprise understands the task at hand and offers a genuine experience! Thank you so much!", "pics": null, "resp": {"time": 1557624370883, "text": "Thank you sir we appreciate your patronage."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "106162119288726783951", "name": "Morgan Maynard", "time": 1579400361143, "rating": 5.0, "text": "This is such a fun way to spend the evening with friends, family, or team building! The workers are so nice and professional and it’s an all around great experience and addition to our sweet small town of Enterprise!", "pics": null, "resp": {"time": 1579405134440, "text": "Thank you so much we appreciate you guys coming in and sharing your time with us."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "101145749949527473679", "name": "Aaron McFarland", "time": 1563065982302, "rating": 5.0, "text": "Total experience!!   What a blast from start to finish.   I recommend taking as many people as possible because you may need the help.  I will be returning to Conquer the rest of the rooms!!", "pics": null, "resp": {"time": 1563066777311, "text": "Thank you guys. You guys did great"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "105492996081437450013", "name": "Tabatha Matyjasik", "time": 1608776670576, "rating": 5.0, "text": "Thank you for a great time! Can't wait to try the other rooms.", "pics": null, "resp": {"time": 1579520865657, "text": "You’re welcome it was our pleasure to provide you guys with family entertainment."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "113722805079703171834", "name": "Damon Hutton", "time": 1546295271558, "rating": 5.0, "text": "AMAZING!!!! The owner was super nice and gave great direction. The room was very well thought out. I brought the kids ages, 16, 14, 11, and 7 and their grandfather and everyone was able to help us escape the room.  We look forward to future adventures at Escape Enterprise.  The rooms are changing every couple of months.", "pics": null, "resp": {"time": 1547931093161, "text": "Thank you sir and thanks for testing the upgrade"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "106440142873415768637", "name": "Evan Muhonen", "time": 1563070093652, "rating": 5.0, "text": "Absolute blast. Went with several friends and had such a great time. Highly recommend going if you're looking for something to do in Enterprise.", "pics": null, "resp": {"time": 1563072119999, "text": "Awesome thank you"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "116377857085515342393", "name": "Katrina Wambles", "time": 1579485521575, "rating": 5.0, "text": "Fun room and great staff! We love Escape rooms and have been to several! We will be back for the other rooms!", "pics": null, "resp": {"time": 1579485903029, "text": "Thank you so much we appreciate you guys coming in today."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "111671803104984678009", "name": "Lisa Oliver", "time": 1561217130458, "rating": 1.0, "text": "Secret society was made with the intention that you can't get through it in one attempt. Takes the fun out of it when it was made for you to fail. Go to Daleville. Much better rooms with amazing staff and cheaper rooms.", "pics": null, "resp": {"time": 1561407276784, "text": "First off thank for coming we appreciate your business. Secret Society was not designed for you to fail but we did design it to be hard. We designed each room to be at a different level of difficulty to accommodate the different levels of customers going through escape rooms. We do not puzzle out the rooms to allow people to come back and try again if they like.  Secret society is our most difficult room. It is also our most technical room. We strive to continually update and make our rooms better. I welcome any discussion you would be willing to have about how we can strive to be better. You can reach me at info@escapeenterprise.com"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "107638767666430408960", "name": "kbige2f3", "time": 1561584370229, "rating": 5.0, "text": "Excellent place to have some fun in Enterprise! We could use so more places like this around here! Will definitely be coming again", "pics": null, "resp": {"time": 1561588873698, "text": "Thank you so much. We are glad you had a good time."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "111206395056418291662", "name": "Bridgett Brantley", "time": 1573414981679, "rating": 5.0, "text": "We had such an amazing time we did 2 rooms in one night! Great experience and awesome staff!! Definitely recommend!", "pics": null, "resp": {"time": 1573416262454, "text": "Thank you so much. We look forward to serving you guys again soon."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "117300252306059741000", "name": "Alexis Sanders", "time": 1578803286902, "rating": 5.0, "text": "The staff was AMAZING!!! They helped plan my engagement with clues to exiting the room! It was perfect and very clean and fun place!!!", "pics": null, "resp": {"time": 1578832736028, "text": "Thank you Alexis it was our pleasure to help make your day an awesome and memorable one."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "115403053805059564078", "name": "Natalie Bradley", "time": 1557431822649, "rating": 5.0, "text": "Escape Enterprise was an awesome experience!! A great team building activity for anyone! I would highly recommend and can't wait to go back!! They will be helping us out at ESCC Camp Weevil in June!!", "pics": null, "resp": {"time": 1557433853956, "text": "Thank you so much we look forward to working with you guys and the kids this summer."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "107840132813953307118", "name": "James Rubert", "time": 1547949526608, "rating": 5.0, "text": "Took my girls (5 and 12) with me to one of the rooms here and they were both very involved in solving different parts.  My 5 year old was afraid of being in the dark,  but the owner went above and beyond to help her overcome her fear and she had a blast!   We will be back to try every room they come up with here. Thank you for the great family experience!", "pics": null, "resp": {"time": 1547962766159, "text": "Thank you guys for coming it was our pleasure to serve you."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "116136750468530101057", "name": "Amanda Bergeron", "time": 1566745286544, "rating": 5.0, "text": "Fun for all ages! The staff was friendly and helpful. We will definitely recommend to everyone. I look forward to trying the other rooms.", "pics": null, "resp": {"time": 1566751231272, "text": "Thank you so much. We are extremely honored to serve you."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "104237260648669610241", "name": "Kristy Caraway", "time": 1579915691296, "rating": 5.0, "text": "Absolutely amazing!!! We had a great time and alot was put in these rooms!! Definitely will be back!!", "pics": null, "resp": {"time": 1579919729358, "text": "Thank you so much you are awesome."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "107087746606859651832", "name": "shelley slider", "time": 1549156684598, "rating": 5.0, "text": "This was our first escape room experience and we weren’t really sure what to expect. The facility itself was clean and comfortable and the staff was very friendly and helpful. We had so much fun!  We’re already planning our next visit.", "pics": null, "resp": {"time": 1549157932807, "text": "Thank you for the nice review. We enjoyed having you all!"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "112463410756888212313", "name": "Evan Crawford", "time": 1552848090462, "rating": 5.0, "text": "Had a blast here with my friends. Thoughtful and welcoming staff coupled with well thought out and designed puzzles created a great time and atmosphere. We will be back!", "pics": null, "resp": {"time": 1552863327737, "text": "Thank you so much!!  We greatly appreciate you guys coming."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "104803015386035883231", "name": "Brenda Breland Sims", "time": 1545971440752, "rating": 5.0, "text": "What a fantastic addition to entertainment opportunities in Enterprise! The owner is as nice as can be, and the room had a creative and challenging design. We plan to return and highly recommend.", "pics": null, "resp": {"time": 1546007645804, "text": "Thank you guys it was my pleasure"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "106017231804477967386", "name": "Sarah King", "time": 1563581684648, "rating": 5.0, "text": "Challenging and Fun! Great price. Friendly and helpful staff!", "pics": null, "resp": {"time": 1563583267560, "text": "Thank you so much you guys were awesome."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "108541526347394195691", "name": "Jofelynn Alonzo", "time": 1577659295646, "rating": 5.0, "text": "A lot of fun, can't wait to try another room.", "pics": null, "resp": {"time": 1577666843719, "text": "Thank you guys so much."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "101468128054017328891", "name": "Laura Creazzo", "time": 1557445608221, "rating": 5.0, "text": "So much fun!  Had a great time with my family.  A definite must-do for everyone to try in the Wiregrass Area!", "pics": null, "resp": {"time": 1557747606883, "text": "And you guys had a great time as well. It was the second fastest at the time. Well done."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "113221742805088820046", "name": "Robert Bennett", "time": 1556414449595, "rating": 5.0, "text": "Where you at. Get down here. It's 5 star! We didn't make it out but brought out some great memories.", "pics": null, "resp": {"time": 1556419884234, "text": "Thank you guys we sure enjoyed hosting you all."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "102546950766662896788", "name": "Adam Hatfield", "time": 1581968630146, "rating": 5.0, "text": "awesome experience, worth going back ..rooms are really immersive", "pics": null, "resp": {"time": 1581989166299, "text": "Thank you so much for the compliments"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "117979529505298158965", "name": "Joshua Crawford", "time": 1552793602238, "rating": 5.0, "text": "Awesome expierience. We almost won but even losing was worth the trip and cost. Staff extremely nice. We will be back soon.", "pics": null, "resp": {"time": 1552827275273, "text": "Thank you so much I’m glad you guys had a great time"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "109838622155215088622", "name": "Tracy Yeomans", "time": 1562606781480, "rating": 5.0, "text": "Friendly staff, great rooms, EXACTLY what Enterprise needs!!! Be sure to check this place out you’ll be so glad you did!! Be sure to do the Secret Society room.... it was such an awesome challenge and soooooo much FUN!!!!!", "pics": null, "resp": {"time": 1562607896581, "text": "Thank you so much you guys did great when you went through."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "107132338974919616274", "name": "Dena Leuci", "time": 1578098024572, "rating": 5.0, "text": "We had the best fun as a family where each member contributed in some fashion! I think it was the first time everyone was in the same space interacting for an hour in a long time!", "pics": null, "resp": {"time": 1578112781271, "text": "I’m glad we got to be a part of it thank you."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "101825627453909610432", "name": "Katie McFarland", "time": 1563063914093, "rating": 5.0, "text": "This was so much fun!! Great time. Highly recommend.", "pics": null, "resp": {"time": 1563064612930, "text": "Thank you."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "115596909989567824907", "name": "Tiffani Heinreich", "time": 1555286919037, "rating": 5.0, "text": "Challenging yet great experience. It was fun and the staff was great. Definitely going back.", "pics": null, "resp": {"time": 1555595114872, "text": "Thank you so much you guys did awesome."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "102994335046876211615", "name": "Jim Manuel", "time": 1557848019932, "rating": 5.0, "text": "First ever experience with this. It's clear I would just die...\nReally clever and challenging clues...", "pics": null, "resp": {"time": 1557848955244, "text": "Thank you sir that made me laugh. We appreciate you all coming out and giving it a try. I hope that you will come back and try again."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "103764174830573724059", "name": "Mimosa Whiting", "time": 1545433585508, "rating": 5.0, "text": "Kids and I did the Christmas Challange and failed. Despite the failure we had a great time! I'm happy that our town is finally getting something else to do for fun. Keep up the good work Escape Enterprise and we are coming for another challange.", "pics": null, "resp": {"time": 1545441142829, "text": "Thank you so much for letting us serve you."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "111664098426202246138", "name": "Shaun Glover", "time": 1564957982338, "rating": 5.0, "text": "Went with a bunch of kids for a birthday, everyone had a really good time.", "pics": null, "resp": {"time": 1564960886502, "text": "The kids looked like they were having a blast. Thank you guys for bringing them."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "103576090448638632595", "name": "Josh Bilby", "time": 1578796838453, "rating": 5.0, "text": "Super awesome locally themed escape room", "pics": null, "resp": {"time": 1578801506116, "text": "Thank you I’m glad you guys came."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "111536824140621389459", "name": "Nugg Boi", "time": 1557426808342, "rating": 1.0, "text": "Not very professional. Over priced for the quailty of the room. Hints could have been alot better and puzzles could have been thought through.. I have played. Other places in the area with much better quailty rooms for a lesser price.", "pics": null, "resp": {"time": 1557431287610, "text": "Well first of all thank you for coming out and trying our rooms. I would like the opportunity to speak with you and find out some specifics about your experience. We pride ourselves on running a professional business with rooms made to a high standard. It would help me to better our rooms and your experience if you could tell em what room you tried and when you tried it so I can talk to my staff about any hints that they may have given.  I will go back and check the video to see what they typed and make sure to change any hints that were not up to par. We thank you again for supporting local business. You can reach out to me at info@escapeenterprise.com.  I look forward to hearing from you."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "115535202279184655294", "name": "Sara Sullivan", "time": 1560732662490, "rating": 3.0, "text": "We have done over 30 escape rooms world wide and found this one to be ok. Even though we had an enjoyable time trying to escape and got 95% done. We found that some of the room just didn’t flow together. The solution line was a little zig zagged and it could use some paper hints in the line of directions to some other clues.", "pics": null, "resp": {"time": 1560741783121, "text": "Thank you so much for coming first off we appreciate it. If you have time, please contact me at info@escapeenterprise.com we strive to continually improve our rooms.\nThank you.\nUpdate\nThank you again for your input we have made some changes based on that input and we are proud to say that it has definitely improved the game."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "108538704258994545038", "name": "Pharell Mapa", "time": 1563129859397, "rating": 5.0, "text": "friendly staff, the experience was fun and kinda challenging but overall it was a nice experience", "pics": null, "resp": {"time": 1563136121701, "text": "Awesome thank you so much. I am glad you had a great time."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "109659303710464208824", "name": "Elena Muhonen", "time": 1563070002655, "rating": 5.0, "text": "Soooo much fun!!!! Recommend this place 100%!!!!we will be back to do the other rooms for sure", "pics": null, "resp": {"time": 1563072107425, "text": "Thank you so much"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "100690824055221565234", "name": "Karen J", "time": 1556578615880, "rating": 5.0, "text": "My son had a great time for his 10th birthday!", "pics": null, "resp": {"time": 1556682012099, "text": "We are excited that he chose to spend it with us."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "116329889988890747155", "name": "Tec Tony", "time": 1550241680907, "rating": 5.0, "text": "This place is really neat. Veterans Owned. They make all there own puzzles!! 🤯🤪 #Veterans #supportyourlocalbusiness #puzzles #escaperoom", "pics": null, "resp": {"time": 1550511530152, "text": "Thank you kind Sir"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "116360735155135310204", "name": "Catherine Mapa", "time": 1563132542684, "rating": 5.0, "text": "Staff is very helpful great experience for a family night out", "pics": null, "resp": {"time": 1563136080512, "text": "Thank you so much. I agree we have one of the best staff out there."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "118142310740277663413", "name": "nadinna spears", "time": 1544721864393, "rating": 5.0, "text": "We had a great time! We will definitely do more rooms!", "pics": null, "resp": {"time": 1544749121375, "text": "Awesome. We plan on dropping a new room every two months"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "107643592150386602224", "name": "Amanda Williams", "time": 1557913982640, "rating": 5.0, "text": "Awesome owner and staff! Can’t wait to go back!", "pics": null, "resp": {"time": 1557918066806, "text": "Thank you we can’t wait to have you."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "108471514021269087866", "name": "Byron Fink", "time": 1563069985090, "rating": 5.0, "text": "Had a great time. Recomend it anytime!", "pics": null, "resp": {"time": 1563072095627, "text": "Thank you"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "109037670361292980923", "name": "V S", "time": 1567283809332, "rating": 5.0, "text": "I was very fun would recommend to everybody", "pics": null, "resp": {"time": 1567285311948, "text": "Thank you. We will have much more coming in the future."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "116402067925457837318", "name": "Cindy Bolton", "time": 1562633742400, "rating": 5.0, "text": "Had a great time! Great staff!", "pics": null, "resp": {"time": 1562635512818, "text": "Thank you. Allison and Anna Beth are awesome."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "103310609605165737734", "name": "Jessica Gray", "time": 1544721338694, "rating": 5.0, "text": "Had a lot of fun trying to escape with my husband! Looking forward to trying another room..", "pics": null, "resp": {"time": 1544749088714, "text": "I think you guys would love the Christmas challenge but hurry it ends soon"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "109713207497618132095", "name": "Kathleen Puckett", "time": 1565493078147, "rating": 5.0, "text": "We did the box room. It was great!!", "pics": null, "resp": {"time": 1565520378058, "text": "Awesome thank you guys."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "113523852414668260934", "name": "Sherri First", "time": 1553133595315, "rating": 5.0, "text": "First time going, great experience and good time!", "pics": null, "resp": {"time": 1553167916755, "text": "Thank you so much"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "109363389571123462745", "name": "Shyra MoralesAvina", "time": 1561413434505, "rating": 5.0, "text": "Great staff, great rooms, had a blast", "pics": null, "resp": {"time": 1561423013511, "text": "Thank you I would agree that we have the best employees and some of the best rooms around. We appreciate your business."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "101731915210062727330", "name": "steelyboys", "time": 1567283838534, "rating": 5.0, "text": "Fun and challenging at the same time", "pics": null, "resp": {"time": 1567285329491, "text": "Thank you we can’t wait to show what’s coming next."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "102116780255415280449", "name": "Taylor Wilds", "time": 1547951994133, "rating": 5.0, "text": "Challenging but very fun!", "pics": null, "resp": {"time": 1547962800850, "text": "Thank you we enjoyed hosting for you."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "103008220042946146116", "name": "Courtney Layton", "time": 1544727632473, "rating": 5.0, "text": "So awesome! We loved it!!!", "pics": null, "resp": {"time": 1544749058236, "text": "Thank you"}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "105059811800124066231", "name": "Leif Kerr", "time": 1578266282206, "rating": 5.0, "text": "It was a blast!", "pics": null, "resp": {"time": 1578266511320, "text": "Thank you. We have a blast building them for you guys."}, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "109252596867855621764", "name": "Earl Johnson", "time": 1628669055291, "rating": 5.0, "text": "We will definitely be going there again to a different room. Had a great time.", "pics": null, "resp": null, "gmap_id": "0x88926f618ed426e9:0xc3427b20415a2041"}
{"user_id": "105551196654196287972", "name": "adam barkley", "time": 1553438019355, "rating": 4.0, "text": "Nice people", "pics": null, "resp": null, "gmap_id": "0x888ed2481d276159:0x9e5cdcfc5e58bc06"}
{"user_id": "105688040570404226284", "name": "Tricia Colley", "time": 1623157860033, "rating": 5.0, "text": "We hired Premier for our wedding and they went above and beyond to ensure everything was perfect for our big day! From the wedding music to the uplighting, to the reception, it was all perfection.... They even personalized our dance floor with an awesome monogram we will never forget and had all the guests talking!!! DJ Lew was fantastic and Brandon was extremely professional and diligent on getting our input and requests. I recommend Premier to anyone looking for a great team of DJs!!!!", "pics": null, "resp": {"time": 1623162537030, "text": "Thank you for your review, and letting us make your special day amazing!"}, "gmap_id": "0x88928d9f00fa9f7b:0xc6eff52ef76e5d0d"}
{"user_id": "114757250626920305683", "name": "greg beidleman", "time": 1600215880799, "rating": 5.0, "text": "The team from Premiere Mobile DJ services was amazing. We hired them to handle the music and emcee duties for our daughter's wedding and reception. They were very thorough with their planning before hand and took the time to get to know our music style, wedding party/family/guests dynamics and how we would like the flow of the wedding to go then they took it seamlessly from there. Skyler (DJ Smooth) was assigned to our event and he was so friendly and energetic. He kept everything running smoothly from start to finish and made sure that the energy of the night was just right.We would absolutely recommend them without hesitation", "pics": null, "resp": {"time": 1610039487782, "text": "Thank you for your review! We appreciate your kind words and your business!"}, "gmap_id": "0x88928d9f00fa9f7b:0xc6eff52ef76e5d0d"}
{"user_id": "109248451702378187854", "name": "Christen Bane", "time": 1610038798406, "rating": 5.0, "text": "Great vendor to work with. Excellent communication. Professional appearance and set up. Everyone was personable and fun to be around. 10/10", "pics": null, "resp": {"time": 1610039448693, "text": "Thank you Christen! We always enjoy working with you as well!"}, "gmap_id": "0x88928d9f00fa9f7b:0xc6eff52ef76e5d0d"}
{"user_id": "117433617806670355404", "name": "Megan Dease", "time": 1590947617881, "rating": 5.0, "text": "DJ smooth does a great job. I have been to several events he has done. Everyone of them have been great. Highly recommend premier and DJ Smooth.", "pics": null, "resp": {"time": 1610040217159, "text": "Thank You for Your Review!"}, "gmap_id": "0x88928d9f00fa9f7b:0xc6eff52ef76e5d0d"}
{"user_id": "106524954577909491131", "name": "Claire Skipper", "time": 1590950117051, "rating": 5.0, "text": "The best in the business. Skylar *DJ Smooth* and Juan are great to work with and make every party so much fun!", "pics": null, "resp": {"time": 1610039495395, "text": "Thank you for your review!"}, "gmap_id": "0x88928d9f00fa9f7b:0xc6eff52ef76e5d0d"}
{"user_id": "111947528865548998999", "name": "Ben Ryals", "time": 1590898195967, "rating": 2.0, "text": "Not Juan, he does a great job. But DJ Smooth.... Cleaning up when he's supposed to be playing.... Then getting mad when someone changes the song!", "pics": null, "resp": null, "gmap_id": "0x88928d9f00fa9f7b:0xc6eff52ef76e5d0d"}
{"user_id": "112721468794667434060", "name": "Krista Jost", "time": 1567285799958, "rating": 1.0, "text": "Absolutely do not recommend Premier Mobile DJ for any special event. We used this company to DJ for our wedding and there wasn’t a special moment that wasn’t messed up by the music. During the ceremony the music was cutting in and out, our ministers mic was in and out. They didn’t start our music on time, and they told us it is because “no wedding they have DJd ever started on time”. Going into the reception our minister went ahead of us after we completed pictures to tell the DJ we were outside waiting to come in. Finally we waited so long and were so hot we had to just walk in, no announcement and we didn’t get to do our entrance song. The whole night we had to tel the DJ what we wanted to do next ( even though we filled out an entire packet of what we wanted to do, what song to play, IN ORDER. We also even had a sit down meeting to go over everything prior). At our meeting we specifically told Brandon that we did NOT want any children songs played (specifically songs like Baby Shark, etc) baby shark was the first song to play after dinner... During the reception the DJ (Juan) went up to my sister (MOH) and asked her “what do you guys want to do and in what order, we never went over any of that”. Needless to say, a very very unorganized company they did not communicate with each other at all. We called them afterwards to tell them how upset we were with our service that we paid over ONE THOUSAND DOLLARS for, they said there was nothing they could do to make it right because they provided 2 extra hours of music without charge which would have costed us $200, and we never even asked him to play an additional 2 hours.", "pics": null, "resp": null, "gmap_id": "0x88928d9f00fa9f7b:0xc6eff52ef76e5d0d"}
{"user_id": "107280799255517525332", "name": "Rebekah Watkins", "time": 1623545257266, "rating": 5.0, "text": "We had the best time at my twins’ birthday party! We rented the 24’ Whitewater Falls dual lane slide with Slip N Slide attachment. The owners were wonderful, answered all my questions and kept open communication. No short four hour time frame, either! Fantastic experience and tons of fun.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "113236964660310200312", "name": "Laura Lott", "time": 1595788273039, "rating": 5.0, "text": "Awesome inflatables and even better owners. We have rented 2 inflatable water slides in the past month and our kids have had a blast. They don't do 6 hour rentals like most company's, you keep it the entire weekend. I cant say enough about how much of an awesome company Spacewalk rentals is.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN4xiKf7_eR9QzuU9_IQ2FigQPG7aPhC2DFYZLW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP-3mwvDd8HVvjBgwev-bytHevPGaS1qKYYtwvN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN0wnJaJZf9eAA-GB_7vdkI-g_um-vmWw9xDaxt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOwj9lxaSnAIZaIcPtvm_IqINZqI3bA4kvG7qPv=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "108703210841328582456", "name": "Jessica Sessions", "time": 1622467259511, "rating": 5.0, "text": "Our boys had the best time playing in the Tropical 5-in-1! Space Walk of Montgomery was great to work with! The owners were professional and responded promptly with all communications. The guys who delivered the bouncy house let us know when they were almost here and made sure we had everything we might need to have a great weekend! We will definietly be using Space Walk again!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "112678742985636853847", "name": "Christy Bridges", "time": 1623536655065, "rating": 5.0, "text": "Had a wonderful experience with space walk of Montgomery. They are professional and courteous. We have used them for last 3 summers and always happy with the slide, delivery and setup. Will use them over and over again", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "116225428133349033982", "name": "David Gates", "time": 1591562216327, "rating": 5.0, "text": "The best inflatable experience that we’ve had.  Heavy duty inflatable and great deal for the multi-day rental.  Prompt delivery and pickup.  We will be using them for all of our inflatable needs.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPOyBs1YCuTP-TL0ZRZUyX80N8zC62TW2fh9mQI=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "105572696375671034967", "name": "Sarah Campbell", "time": 1622405810151, "rating": 5.0, "text": "We were so please with the HUGE water slide we rented for the weekend. The owners were so nice and accommodating and the slide was in great shape! Thanks for an awesome weekend! We will definitely rent from them again!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "114509958638304456582", "name": "Heather Baker", "time": 1623596489886, "rating": 5.0, "text": "Spacewalk of Montgomery is the best! Fast, friendly and very organized! We love renting from them and hope to continue to do so for years to come!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "117670233604316399399", "name": "Candice Marvel", "time": 1622424969052, "rating": 5.0, "text": "So easy and convenient to do business with. They Set up and picked up: our friends and family had a blast!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "111428054780913292336", "name": "Lauren Esco", "time": 1599502901054, "rating": 5.0, "text": "Rented for my sons 2yr old party! The children had a blast! Definitely recommend and will use them again! They had a great deal when I reserved it (pay 1 day get for 3 days.) GREAT customer service!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "101450759321543424928", "name": "Luke Brooks", "time": 1606072204505, "rating": 5.0, "text": "Great company to work with. They took extra care to make sure the slide was clean. Delivered on time and we had a blast. Thanks! We’ll book again soon", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "118084992093589363623", "name": "Sloan Family", "time": 1593299819345, "rating": 5.0, "text": "Such a great experience! Everyone we dealt with, over the phone and in person, were so friendly and helpful! Great prices too. We rented the toddler water slide and it was the perfect size and super easy to maneuver! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "114335693783861580146", "name": "Citoryia Martin", "time": 1598198680436, "rating": 5.0, "text": "Will definitely rent from them again! Shannon was very helpful in helping me pick out a water slide last minute. We also rented a dunk tank which was a huge hit! Adam delivered the items and he was so nice and helpful and made sure to give us great information on how to handle the waterslide and dunk tank. He also made sure to sanitize both items.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "100261508934301372622", "name": "Whitney Rosario", "time": 1596131168789, "rating": 5.0, "text": "Adam & Shannon are super great! Set up was quick & as promised. All of the kids are having a blast on this thing, even the adults. We will definitely rent again from them in the future.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "106620241708426786431", "name": "Shanna Fanning", "time": 1601941126145, "rating": 5.0, "text": "We rented one of the obstacle courses for my son’s 5th birthday. They delivered and set up the obstacle course for us, and then came back to pick it up. So easy! The kids had such a fun weekend and my son said it was the best birthday ever.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "105872488225046508958", "name": "Ray Parker", "time": 1594675252686, "rating": 5.0, "text": "Great company and products.  We have rented two times from them this year and both times have been a great experience.  Great customer service and very professional. We’re looking forward to the next time.  Thank you for helping us with the perfect pandemic birthday surprise for our daughter.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "107578923717648809096", "name": "Karen Doles", "time": 1598190862424, "rating": 5.0, "text": "We have been using Spacewalk of Montgomery for the past 9 years. Our kids LOVE the inflatable water slides! Best customer service- super friendly and fast to reply. My kids are always asking about the next time we can rent!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "110056046352261000168", "name": "Karlynn Morales", "time": 1594563493500, "rating": 5.0, "text": "AWESOME!!! Due to the current pandemic this was just the FUN my daughter needed. HUGE water slide in our own back yard for the weekend. Complete Privacy! The owners were very helpful and professional. Space Walk of Montgomery, YOU ARE THE BEST!!!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "101677793873093166552", "name": "Tia Adams", "time": 1596050689969, "rating": 5.0, "text": "We have been using Space Walk of Montgomery for about 7 years now, the previous owners were AWESOME. We rented a flat/water slide for my son's birthday and the new owners have went above and beyond to make his birthday one to remember. We will definitely be using them again in the future.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "115177575908389335445", "name": "Andrea Ackerman", "time": 1598799652054, "rating": 5.0, "text": "This company has great customer service. They were on time for setting up and taking it down. Very friendly and professional. We will definitely be renting from them again.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "105630905094850450201", "name": "Candace Blowers", "time": 1600709402062, "rating": 5.0, "text": "We had a blast for my daughters party! Great communication and products. Would definitely recommend and use again myself.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "110023867045277550511", "name": "Megan Hoehn", "time": 1598238860653, "rating": 5.0, "text": "Customer service is excellent. We were looking at a few companies for a weekend rental and I am glad we went with SpaceWalk Inflatables. The smiles on their faces was worth every penny!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "110986696209985168034", "name": "Catherine Godbold", "time": 1598800095809, "rating": 5.0, "text": "Always have fun on the inflatables and cant wait to rent again. I definitely suggest it for any function. Awesome people to work with.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "106777085260906510416", "name": "Tamika Mckinnes", "time": 1596487645864, "rating": 5.0, "text": "Everyone at space walk was very nice, Shannon answered all questions I had. Delivery and setup was great. We enjoyed a weekend of fun thanks to Space Walk of Montgomery.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "104146842285192795777", "name": "Hallie Burton", "time": 1596985750412, "rating": 5.0, "text": "We have used Space Walk of Montgomery for several years and wouldn't go anywhere else.   We always have a great experience with them and they have a great selection of slides for us to choose from.   I recommend them to everyone!!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "104674804930016497390", "name": "Jessica Quinn", "time": 1596213262259, "rating": 5.0, "text": "Great communication and delivery. The slide arrived early and my kids have loved every second of it. It is clean and the staff are very friendly.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOxdynWAeiant4V_pvRT3t-tdDEATNHHK7imFkX=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "111214874858884857552", "name": "Lindsay Berry", "time": 1603638158126, "rating": 5.0, "text": "Great customer service! The kids had a blast! I highly recommend this place!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "104285027359998150050", "name": "Ashley Crim- Smith", "time": 1588687882000, "rating": 5.0, "text": "HIGHLY recommend!!! We took advantage of the 3 day for 1 day rental promotion, which was PERRRFECT & they DEFINITELY didn't disappoint! We rented the Double Water-Slide & had a blast!!! They even provided tarps for the exits of the slide!!! It was worth every penny🤗\nTheir customer service is AMAZING! The gentlemen who came out& set up everything was super nice& very professional! He also answered questions (sent via text) when we had the slide! We'll definitely be renting from them again!!!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "109935527075311951639", "name": "Suzy Williams", "time": 1617837304915, "rating": 5.0, "text": "Super friendly and very affordable.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "100772617511740838375", "name": "Shannon Nelson", "time": 1596382236981, "rating": 5.0, "text": "Well worth the money.  Rented it for my granddaughters 7th birthday. We had a blast. Not sure who had more fun. Kids or adults.  Great fun. 🤗🤗🤗🤗🤗🤗", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "109713884590624917647", "name": "Brooke Devers", "time": 1600009941236, "rating": 5.0, "text": "I would recommend Spacewalk Montgomery to everyone. They were easy to work with and according to my kids made yesterday the best birthday party and play day ever!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "109577694224462845835", "name": "Mrs. Pam McLemore MCS", "time": 1601923700484, "rating": 5.0, "text": "We had a blast! Last minute was no problem. Kind and thorough.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "105345645782337182955", "name": "jaylen4money", "time": 1592859103468, "rating": 5.0, "text": "I rented the 24ft Waterfall Water Slide for my daughter's birthday it was a 3 day special. My family and I enjoyed it and will recommend everyone try it out and you will enjoy it too. I would like to thank Space Walk of Montgomery for making my daughter's first birthday party a blast.🎉🎊🥳😍😍", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "109601294326866585017", "name": "Fredda Jones", "time": 1595882776876, "rating": 5.0, "text": "Awesome customer service. The grown ups enjoyed themselves more than the kids. Thanks for everything and we will rent from Space Walk again.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPAe3MgD_0jy9eovRlKJ1iM0dWAdhhfeiqBf2-z=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "101597739975962755952", "name": "Manager", "time": 1589822767362, "rating": 5.0, "text": "The owners are very friendly and courteous. They answered all my questions when I spoke with them and helped me find exactly what I was looking for. Everyone had a blast at our party. We will definitely use them again!!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "113461685353783492528", "name": "The Allen's", "time": 1600727790194, "rating": 5.0, "text": "Space Walk of Montgomery is amazing! We rented one of their water slides this weekend, and had the best time for an amazing price!!!! Will definitely rent from again very soon!!!!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "112993746875731735724", "name": "Phyllis Edwards", "time": 1590111962057, "rating": 5.0, "text": "The BEST customer service with the best inflatables. They have so many to pick from. Their slogan “Here Comes Fun” is exactly what it is. Thank u Space Walk Of Montgomery for the all that fun. Can’t wait for next time.❤️", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "109506152435626055709", "name": "Lisa Lang", "time": 1599486108666, "rating": 5.0, "text": "We LOVED it!! The kids had a blast,  even the big kids!! I will DEFINITELY be using them many more times in the future!!!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "110737822034114800519", "name": "Shelli Carroll", "time": 1598268797872, "rating": 5.0, "text": "Shannon was awesome to work with! The kids had a great time on the water slide and we will definitely be return customers!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "108739728026025230113", "name": "Haley Roberson", "time": 1595902129087, "rating": 5.0, "text": "Would recommend them for any type of event, my kids absolutely LOVED the Aqua Tunnel and can’t wait till next year to get a bigger one. The fact that they do contactless delivery and pick up makes it even better between my busy work schedule I didn’t have to make sure someone was there to watch for them.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "107604290440330859432", "name": "Ashley P", "time": 1595185504396, "rating": 5.0, "text": "Professional and friendly. Answered all emails and calls in a timely manner. Spacewalk of Montgomery net all my needs for my daughter party. Will definitely book again in the near future.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "117296293132942646098", "name": "Vanessa Wineberg", "time": 1593995406713, "rating": 5.0, "text": "We use Spacewalk every year for our 4th of July celebration! Delivery is fast, efficient and professional. The staff is very friendly and always willing to make our event a success.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "100000010815950909569", "name": "Geva Clyde", "time": 1590618281503, "rating": 5.0, "text": "Great service! Good quality my daughter had a blast and very good prices! Over all the customer service was great can’t wait to get from them again!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "101186153693856472754", "name": "Warren Mitchell", "time": 1596382401258, "rating": 5.0, "text": "I’ve rented from them for years and we just got another one this weekend and when they delivered it they spent a good bit of time sanitizing it to help make sure the kids were safe from Covid.  Highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "100056333608226318769", "name": "Angelica Lampkin", "time": 1596985858142, "rating": 5.0, "text": "Great customer service and professional. Kids enjoyed and will be renting again. Thanks again!!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "118232489472245178669", "name": "Crystal Scarbrough", "time": 1596940217356, "rating": 5.0, "text": "Very great place to rent all your party needs from, excellent service and they kept me informed on when they were dropping off and picking up, everyone at the party enjoyed the water slide so much!!!!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "101395617138714034443", "name": "Crystal Rhodes", "time": 1589214702308, "rating": 5.0, "text": "Rented the biggest slide for 3 days and everyone had a great time! We had the option to pick up ourselves which was a plus. We are definitely going to be renting from Space Walk again and possibly every year from now on! Very friendly staff!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "114925836424100537875", "name": "Tracy Freeman", "time": 1592103748051, "rating": 5.0, "text": "We rented a water slide for an annual church youth festival today and it was great the kids had a blast!! Also, the service was Awesome and the delivery was on time!! Via Williams family", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "104352573077393634342", "name": "Talisha Wells", "time": 1599488109333, "rating": 5.0, "text": "GREAT FRIENDLY BUSINESS!!! THE OWNERS ARE NICE. EXPLAINS EVERYTHING THOROUGHLY AND PROVIDES EXCELLENT SERVICE!!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "116567001450557482631", "name": "Tuck Presley", "time": 1595683858481, "rating": 5.0, "text": "This company has very kind people! Even while they were on vacation, they still helped me with ordering a movie screen for a drive-in movie at our church! And they delivered it hours before we needed it. The movie screen is also gigantic so if you’re ever looking to have a movie night or watch a big game, I recommend getting the screen!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "102486349832744705401", "name": "Antonia Simpson", "time": 1595860242499, "rating": 5.0, "text": "We rented the princess castle inflatable for my daughter 5th birthday the kids just love it good customer service will be renting again in the near future thank you space walk of Montgomery", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "110593247691093089083", "name": "Ann Louise Harrell", "time": 1588600100952, "rating": 5.0, "text": "Love this rental company! They are super helpful and accommodating! Thank you for a wonderful experience. We can’t wait to rent again!!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "111102901037370240072", "name": "Jo Lynn Janes", "time": 1596382073628, "rating": 5.0, "text": "Great company! My daughters birthday was amazing with the BIG KAHUNA 😁", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "117519255795873669720", "name": "Jasmine Merrittee", "time": 1592783128370, "rating": 5.0, "text": "Highly recommended! Great customer service! Super easy to rent from! Kids have had a ball!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "117963269920809211713", "name": "Amber Segers", "time": 1598191300818, "rating": 5.0, "text": "We loved the Blue River Falls slide!! My kids had a blast. We definitely be using them again!!!!! Thanks again!!!!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "115744707421551428693", "name": "Christopher Robbins", "time": 1586291913169, "rating": 5.0, "text": "Amazing and friendly company. Their service and delivery during the quarantine has turned what was looking like a dreary 10th birthday for my son into something memorable. Great company.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "103174744047206806574", "name": "Ashley Wilcox", "time": 1593347440074, "rating": 5.0, "text": "Everyone at Space Walk was wonderful! Even late at night when there was an issue due to weather, they were available. Thank you Space Walk", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "112479843006713389902", "name": "Jolene Woodall", "time": 1595175755030, "rating": 5.0, "text": "The littles are having a great time and will hate to see it go.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "111564559881954851329", "name": "veronica gray", "time": 1593370578346, "rating": 5.0, "text": "Enjoyed every bit of this slide very fun n my daughter had a blast", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "109072240154406410326", "name": "Tiffany McKnight", "time": 1589931107054, "rating": 5.0, "text": "Excellent customer service!!! Very easy pick up and drop off service!! The owners were both very nice and accommodating!!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "102490072917291474290", "name": "David Holloman", "time": 1589984109920, "rating": 5.0, "text": "GREAT CUSTOMER SERVICE MY KIDS HAD FUN AND SO DID I 👍", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "110639526565389178775", "name": "Lillian Popwell", "time": 1595788526524, "rating": 5.0, "text": "This is a great company!! Very friendly!! My boys had a blast!!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "110762748307846795766", "name": "Seth Jacobs", "time": 1596392810973, "rating": 5.0, "text": "The kids loved it. A+ service", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "111622500657160249612", "name": "Christopher Robbins", "time": 1586291734169, "rating": 5.0, "text": "Very friendly and helpful. Kids had a blast even during the quarantine. Made what was looking like a dreary 10th bday party with no guests except for family, memorable for my son.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "110571270168108361262", "name": "Kayla", "time": 1584803544594, "rating": 5.0, "text": "Thank you Adam and Shannon! My girls’ days are made :) Thank you for a quick (and sanitized!) setup!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "101237444512746079526", "name": "Kenny Stevens", "time": 1590798952891, "rating": 5.0, "text": "Great service very friendly great prices", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "106770351706096996711", "name": "Christina Bozeman", "time": 1595776846784, "rating": 5.0, "text": "Very professional and on time overall great service", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "111568661805046785156", "name": "dawn brown", "time": 1595085247056, "rating": 5.0, "text": "Delivery on time great service amazing products", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "101363553826613010392", "name": "Derek Trotter", "time": 1589634172806, "rating": 5.0, "text": "Clean, fun equipment - efficient delivery and pickup.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "102213456818177882562", "name": "Danny Moreira", "time": 1566010700547, "rating": 5.0, "text": "This company is top notch! I Highly recommend them, clean equipment, great attitudes and awesome service! A++++.", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "117685821632038089543", "name": "Anna Mckee", "time": 1595185365939, "rating": 5.0, "text": "Great slide Very reliable company", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "101752510959930128857", "name": "Nicole Powell", "time": 1593923781954, "rating": 5.0, "text": "My children  really enjoyed the  slide", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "100663844500182059611", "name": "Jessica Gable", "time": 1593305532643, "rating": 5.0, "text": "Wonderful all around!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "113175769264581889379", "name": "Dominic Frontiero", "time": 1601155337790, "rating": 5.0, "text": "Cool slide awesome very !!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMZ9U7Eaxm3dsN5A5Gf1U8PuIAHdKENhuCIpVnF=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "116240628943701426702", "name": "Courtney Evans", "time": 1598205966431, "rating": 4.0, "text": "Great experience with Space Walk of Montgomery!", "pics": null, "resp": null, "gmap_id": "0x888c326ebb308d03:0x17eea744e10d2bb4"}
{"user_id": "100389098859269266755", "name": "ellen todd", "time": 1617631009918, "rating": 5.0, "text": "Brandon, just wanted to thank you for your fabulous service at my daughter’s wedding. You are such a professional and clearly love what you do! So many of our guests commented on your energy, passion, and gift of creating a fun atmosphere. Sarah and James had the MOST special day, and you played a role in that. I am happy to recommend you to anyone.\nThanks again,\nEllen Todd", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "107950379938175492195", "name": "Jesica Moore", "time": 1598831633247, "rating": 5.0, "text": "High Energy and Simply Amazing! Brandon keeps everyone on the dance floor and he even got out and busted some moves - Brandon was a wonderful emcee too! His dj skills and song choices were on point! He was able to engage all ages with his \"hosting\" and kept our wedding reception party going! Very smooth/hip and not cheesy at all (we have all encountered those in our lives)! Not to mention, our \"photo booth\" was so fun for all the guests and very modern/sleek design. We loved our photos from these candid shots - they were hilarious and captured the true spirit of the night! They surprised us with a photo book of all our guests' photos as well - which I LOVE! Brandon is hands down the BEST!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN1iBCNg1Oc8Pv9MsoeIPQ_oxLasJPaMz04eZm5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNdJxm9bv5R0_1MW8jPhqDOiLTGC5dTtGWmMW0N=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPuKVgPe4Z6Vj7ScoiDb_cgr0DPHmOaF_A4Ey9w=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNZsSbUVn88lc32BjS6Fu_hfrMJ4Hb7QsxDG725=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOaOR7K-ZcaPm99nKqPnWd4bLl9WewQQHsVbcIu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNXbJ5eR7xEFQnViplzLo4FjB0e38SPx4xVOscx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNqocsx6GaLgk1_3SgfPEAxI6hTtVMVVMNEhzBu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPq3TmXma8jAtbbBErNtQV1HWvYOBp25UJE8125=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOSHXCa-frfBuEq6QBdjUvAMwHhqepXtSZTZ1Jj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMc340fweicfOi1LbJ-aLh0C5JQUwUxdu2A9bgk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "100400079868832203022", "name": "Ashlynn Bowman", "time": 1618840973109, "rating": 5.0, "text": "Wow! I don't have enough great words to share about how much fun Ryan Jones at WellDunn Entertainment was at our wedding. He played great music for all age groups to dance too, he knew exactly where to be and when to be there making the experience for the Bride and Groom stress free. If I could do it over again, I wouldn't because the first time was so great with Ryan!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "102484149622551425761", "name": "Shelly Roark", "time": 1623103870375, "rating": 5.0, "text": "DJ Mason was amazing! He provided professional service and upbeat songs on our playlist that really kept the crowd going! He was very intentional to go over his timeline with us and double check all song requests. He made sure that we were comfortable and on the same page before coming to our reception.  That meant the world to us! We would highly recommend DJ Mason and Welldunn Entertainment to anyone needing dj services!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "110026042433832861857", "name": "Megan Hays", "time": 1605203868364, "rating": 5.0, "text": "I can not say enough great things about WellDunn Entertainment!! We hired Brandon Dunn as our DJ for both our ceremony and the reception after I saw his services first hand at my best friend's wedding a couple of years ago. We were blown away by how awesome he was! And then our wedding planner (Becky's Brides) recommended him as well, so of course we immediately knew we had to hire him. Needless to say, best. choice. ever!! I have been to weddings with DJs who are not as awesome as Brandon, and you never realize how important the DJ is for the overall vibe and energy of the party until you hear a bad one - haha. Those experiences made me even more thankful that we went with WellDunn because it made all of the difference in the energy of our wedding! Everyone was talking about how awesome Brandon was. He is simply fun and a joy to work with. He is also a genuinely good guy and I can't imagine what our wedding would have been like without him. I was a COVID bride and I was all the more thankful for his empathy and flexibility when we had to postpone our wedding to October. I have to say it was all worth the wait! The highlight of the night was when Brandon let me take over the DJing and the crowd went wild!! Those are some of my favorite pictures from the entire night. Thank you for making our special day and night SO much fun. Everyone kept saying it was the most fun wedding they had ever been to!! <3", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMc3IU8Zy12-1E1wBNDiGLuH5Sxd9-hWT_cT97L=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPJ1LVZe_pWhuliyrm3ha4HD17SM913vPoHzyKE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNxPYiScECL1H0EwEHmYuwkemhWYmURIDYqRYzI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNKonct0CQze6yqFUwRujjUMjDhk_6ybaPIG_fL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMZSOJxKjpxIX_Hmsqk2lUFXpe8DsayDZT2Lu-Q=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPFrdyEcFgUaaawqOw8DEuMF5NpGh4eBmL8sEkr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMFIeyJGUFrvQsjrGYx_Sz4vKsFQhWcAwg5Xk4i=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "114746704886551957564", "name": "Kristen Morrison", "time": 1609440447822, "rating": 5.0, "text": "Dj Well Dunn exceeded our wedding expectations! He kept the dance floor full all night and we had so much fun because of him. I can’t recommend him enough! We did the photo booth as well and it was perfect! He made the planning part easy and was responsive to all my questions and concerns. I cannot recommend him enough!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "112109486022123109893", "name": "Shelley Garson", "time": 1579645293774, "rating": 5.0, "text": "HIRE BRANDON ASAP IF YOU WANT PEOPLE ON THE DANCE FLOOR! He's genuinely the nicest guy and listens to all your requests! We gave him more \"dont play this or that\" and he crafted the best music for us!! Thank you Brandon for making our wedding SO fun!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP8i-43lcQqae990j3t6q2TYoxCxHh-uql6a0w6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPD7xd9Ik_1FAZqbhdTe5Z-jsGPQzQQbw7v2xJS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMtnpQNXxFdzkfX5-K7UeCu_pLHu6wrdWGo-vv9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNRVQoWOhlFtuWNTxzG-0RQRzF0oiniysN7BNQ0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM7bYQae95CKx-5oo8n0oohI5hQI6CTo_fuhRk_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOxONmFzgj5XKYwfJae49qixR4DCRoQKHQPZKg3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPbyCwHChs_khOYKaWIZGxOjplcV4ZvIrZBxsW9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPLMJtfz07HvhqVWYxNVDD4Zn1qkKSEydwkbici=w150-h150-k-no-p"]}], "resp": {"time": 1579650354475, "text": "Thank you so much Shelley!! Your wedding reception was so much fun. We appreciate you trusting us as your D.J. company"}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "117517858819757503316", "name": "Amanda Curvin", "time": 1604600826562, "rating": 5.0, "text": "Brandon was an amazing DJ! He and the whole team at WellDunn were so wonderful, and Brandon made all the difference at the reception. Brandon worked with us to customize our music selections, and he kept the flow and energy up throughout the reception. Truly awesome experience, and I highly recommend him!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "116268978466967825796", "name": "Kelsey B", "time": 1601511506378, "rating": 5.0, "text": "We went back and forth between a band or DJ for our wedding and I am so glad we went with WellDunn entertainment. Brandon was amazing and really knew how to get all the guests up and dancing! I still have guests telling me that they loved our DJ.", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "108828637174018426940", "name": "Savannah Farrow", "time": 1598472572270, "rating": 5.0, "text": "We LOVED DJ Well Dunn! We used them for our wedding reception and D.J. Mason was so awesome! Everyone had such a great time. Their company was so easy to coordinate and plan with! Would highly recommend and use again!", "pics": null, "resp": {"time": 1598794643025, "text": "Savannah thank you so much!! We appreciate your feedback and had a great with you and your guests. Thanks again for trusting and choosing WellDunn Entertainment."}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "112145326803452355676", "name": "Jordan Rush", "time": 1601251232554, "rating": 5.0, "text": "DJ Prez was amazing! We had an amazing wedding. He was excellent and really kept the party going. Couldn’t have asked for a better DJ to play at our wedding!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "106114360553223283791", "name": "Rebecca Cason", "time": 1598712100643, "rating": 5.0, "text": "I’ve known DJ WellDunn since he was playing at Tin Roof in Birmingham, so I knew for my wedding day that I had to have him! Oh man and he did not disappoint!! He got all the guest out there dancing on the dance floor and was even out there with us! I wouldn’t want my wedding day any other way!!", "pics": null, "resp": {"time": 1598794541421, "text": "Rebecca thank you so much! It was an honor to be your Dj and entertain your guests. So glad to hear your wedding day was amazing. Thank you for trusting WellDunn Entertainment and congratulations again!"}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "115216004363792814980", "name": "Delena Nguyen", "time": 1603828638336, "rating": 5.0, "text": "We’re so happy that we hired WellDunn entertainment! D.J. Mason was awesome and everybody loved his energy!! We also got the photobooth service from WellDunn and totally worth it! I loved my template for my pictures and all my guest enjoyed that they got a copy of their photobooth to take home! I will be recommending them to my friends for their weddings or events!", "pics": null, "resp": {"time": 1603829895981, "text": "Thank you so much!!! You should be receiving you “hands on” gallery very soon 🎉 Congratulations again and thank you for choosing and trusting 🅦🅔🅛🅛🅓🅤🅝🅝 🅔🅝🅣."}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "116170322117567798599", "name": "Jada Chubb", "time": 1592161097425, "rating": 5.0, "text": "Book WELLDUNN Entertainment for your next event! - DJ WellDunn knows how to get a party started! He ensured everyone at our wedding reception had a great time by engaging with the crowd. He was extremely professional, organized, and timely. We were so impressed with DJ WellDunn and his team! The online planner option helped make our wedding planning process a breeze! Thank you, WellDunn Entertainment!!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "103686285355465008243", "name": "Emily Sims", "time": 1592952502744, "rating": 5.0, "text": "If you’re looking for a DJ for your event, look no further!! We had such a great experience from start to finish with Welldunn Entertainment! From the beginning, Callie was so awesome and helped answer my MANY questions! She always answered in a timely manner, and was so nice and helpful with everything! The online planner makes it SO easy to plan and see the entertainment for your event come together! Closer to our wedding, we started communicating with our DJ, Mike Lira. I can’t say enough good things about him either! DJ Mike planned the day and entertainment exactly how I imagined it. He sent over a detailed description of all of the songs and the timeline for when things would be played. He was so organized and easily accessible if I had any questions/concerns. I even had several guests come up to me to say how professional, organized, and friendly our DJ was. We had a few miscommunications in our reception (unrelated to our entertainment); DJ Mike didn’t miss a beat and went right along with the changes being thrown at him. We are so thankful we chose WellDunn Entertainment and would recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "106327289756618652851", "name": "Morgan Todd", "time": 1595299083350, "rating": 5.0, "text": "Michael was a blessing to our perfect day! Always on point with his music choices and the party was always rocking! I will forever suggest WellDunn Entertainment as a wedding DJ and photobooth service. Thank you so much for everything you did!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "114496315931186307354", "name": "Jaime Thornburg", "time": 1591804677574, "rating": 5.0, "text": "Brandon did a fantastic job at our banquet last night! We had less students due to the COVID19 situation and he kept the party going and negated any weird down time created by the smaller crowd. Our students loved him and so did all the chaperones! I also want to thank Callie in the office who went above and beyond as we had to change our date multiple times when things were shut down so unexpectedly. The photo booth was also a big hit and the custom template they made for us was spot on. Overall we could not have had a better experience and can’t wait to book them again next year!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "111981770395264140270", "name": "Betsy Terenzi", "time": 1583175254721, "rating": 5.0, "text": "Brandon did such a great job getting the party going at our wedding reception! He did an amazing job of sensing the room and playing the right songs at the right time. He is incredibly friendly, energetic, and interactive with guests! No one will miss having a live band with Brandon leading the party!", "pics": null, "resp": {"time": 1583182770140, "text": "Betsy thank you so much for your thoughtful review and kind words. We truly enjoyed being your entertainment choice for your wedding reception. Congratulations 🎉"}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "109533202417114546766", "name": "Amy Roberts", "time": 1582638922788, "rating": 5.0, "text": "Brandon and his team are nothing short of the best in Birmingham. They're so easy to work with and take the stress out of planning your event. Our students went on about how much they enjoyed the music and had a great time and it was all thanks to WellDunn!", "pics": null, "resp": {"time": 1582781776168, "text": "Thank you so much Amy! We truly enjoyed being your entertainment choice for your event"}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "100730931373694980411", "name": "Meghan Easterling", "time": 1596129229033, "rating": 5.0, "text": "Went to a friend's wedding where Brandon was the DJ and we had the BEST time! He was really awesome", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "110616680760421161871", "name": "Kyle Mavin", "time": 1598703944487, "rating": 5.0, "text": "Great service - DJ was amazing - kept everyone dancing and entertained - Fun, Easy Going and Knowledgeable during the planning - you need a DJ? WellDunn is the guy to get!", "pics": null, "resp": {"time": 1598794581522, "text": "Thank you so much! It was our pleasure"}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "112025891629677639602", "name": "Tahara Evans", "time": 1582166035837, "rating": 5.0, "text": "Brandon and his crew are awesome to work with.  We have enjoyed both Brandon and Ian at the Hoover Randle Home & Gardens.  Both are professional and interactive.  One of the best!", "pics": null, "resp": {"time": 1582781724402, "text": "Thank you so much. We enjoy performing at Hoover Randle Home & Gardens anytime"}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "105348587188084986834", "name": "Charlie Beth Musgrave", "time": 1591825038898, "rating": 5.0, "text": "Brandon & Brittany were AMAZING! They really connect with teens and is tons of fun!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "115204997294845261461", "name": "Julie Sasse", "time": 1572221476019, "rating": 5.0, "text": "We love Brandon and WellDunn Entertainment! They really know how to excite the crowd and get everyone dancing!!! My team was so thrilled to have him back at our event for the 2nd year. We can't wait to use him again!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "116093386195391575866", "name": "Alexis Nicole", "time": 1593118992274, "rating": 5.0, "text": "Our experience with DJWellDunn was beyond amazing! We had DJ Mike and he was the life of the party! He was so easy to work with - quickly responsive to every question we had, extremely flexible, and through all the COVID madness, he stayed positive and worked with us through every change that came our way. His music selection had the crowd on their feet the entire night and kept everyone dancing. When he announced the last song everyone screamed \"Noooo!!!\" and he played a couple more to ease the crowd haha! Just shows how great of a time he put on for everyone! We absolutely love Mike and are so grateful to have had him be a huge part of our day! I HIGHLY recommend Mike (and DJWellDunn overall) to anyone looking for an amazing DJ and DJ company for any special event!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "109871191619978690492", "name": "Olivia Stanley", "time": 1586668903119, "rating": 5.0, "text": "Brandon was our wedding dj with WellDunn Entertainment! He was hands down The Best dj I've experienced. My amazing planner hooked me up with him and I felt so lucky he was available on my date. I could not have imagined a different dj! He was loads of fun and interacted with my guests the entire night. He played only the best songs after listening to my plan and my guests requests!! It was a total blast because of WellDunn! Brandon has found his calling. As one bridesmaid said “he’s so much fun, makes you want to be friends with him!” And I have to agree. Nothing but the best. Thank you guys so much.", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "104249167056930126505", "name": "Stephanie Dameron", "time": 1557081727480, "rating": 5.0, "text": "We loved DJ mason for our wedding! It was a great party atmosphere with awesome energy. He is a fun person that drove from out of town to come as well. Great service for a great price!!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "108287190314629754797", "name": "Emmie Stutts", "time": 1583875095689, "rating": 5.0, "text": "WellDunn Entertainment is one of my favorite vendors to work with. They are always wanting to make your event special and fit the needs of the guests you have attending. I look forward to using them in the future!", "pics": null, "resp": {"time": 1583879606438, "text": "Always a pleasure to work with you Emmie. Thank you for taking the time to write a review"}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "104251143603436054594", "name": "Sara Franklin", "time": 1572880886395, "rating": 5.0, "text": "Absolutely INCREDIBLE DJ! Highly recommend him for weddings, charity events, or whatever you need!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "116611557755894329041", "name": "Amanda Harvie", "time": 1569235036194, "rating": 5.0, "text": "We were very happy with DJ WellDunn’s services, which were used for our school’s homecoming dance. Between the music and the photo booth the 900 students in attendance were highly entertained and enjoyed themselves. Everyone was so easy to work with, and the DJ worked hard to accommodate the students’ song requests, finding clean versions  up until the last minute for the school function. We appreciated their professionalism and cooperation!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "107409264681559499193", "name": "Elizabeth Shipp", "time": 1555354049821, "rating": 5.0, "text": "I hired WellDunn Entertainment for my Sorority Formal and was very pleased with the service that they provided.  Our DJ, Amado, was charismatic, easy to work with and responsible.  Of all of the aspects of formal, I received the most and best feedback from my guest about the DJ whom they said was the best we had ever had at an event.", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "105651229675472249104", "name": "Anne Betbeze", "time": 1570723746862, "rating": 5.0, "text": "We had Michael Renda as the DJ for my daughter's wedding and he was the greatest!  He was easy to work with and played exactly what the couple wanted.  He made the reception a party, by getting everyone up and dancing.  I have been told by many that our reception was the most fun that they had ever had!  Also if you have doubts about getting the up lighting and cake spots, GET THEM.  It gave the reception a beautiful ambience!  Money well spent - all around,  thank you WellDunn and Michael Renda!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "116278324608806446947", "name": "Amanda Millwood", "time": 1546821755079, "rating": 5.0, "text": "Brandon did such an amazing job at our company party! He played great music and helped make our party so much fun. He’s such a professional and the entire process from booking to the end of the party was so easy, I didn’t have to worry about a thing. He’s so friendly and entertaining and you can tell that even though he’s technically working, he’s actually just out there having a great time with the rest of us. The photobooth was FANTASTIC! It was a HUGE hit at our event. Brandon is the BEST and would highly recommend him to anyone. He’ll absolutely be my first call the next time I’m in the market for a DJ.", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "117273731243088780061", "name": "Taylor Griggs", "time": 1540354960148, "rating": 5.0, "text": "I think I received more compliments from wedding guests about Brandon than almost anything else at our wedding! Brandon is not only professional, kind, and organized, but also has an amazing ability to read the room. This is so important for a DJ! He was able to conjure the perfect mix of songs to please our diverse wedding guest group, knew when to kick things up a notch, and when to give people a breather. He also wore THE MOST amazing white tuxedo to our wedding. Further more, his timing with important songs was spot on (first dance, etc.) and my husband and I felt like rockstars when we entered the reception, thanks to his control of the music. Brandon executes flawlessly and truly feels out what’s best in the moment. He’s also just freaking cool. If you don’t book Brandon, your event is missing out! :)", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "104499963056528837072", "name": "Elana Jones", "time": 1550240585260, "rating": 5.0, "text": "I simply can not recommend Brandon highly enough!!! As a DJ, he truly goes above and beyond in every single thing he does to make the occasion as special, fun, meaningful, and memorable as he possibly can. He is a true professional and a true delight and I’m thrilled that we were able to reschedule the date of our event just so that Brandon could be there! Thank you Brandon and WellDunn Entertainment for all you do!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "109560778381391579994", "name": "Cindy Campbell", "time": 1527516338119, "rating": 5.0, "text": "Brandon was recently the DJ at our son’s wedding. He was phenomenal! The ceremony music was flawless and the reception was amazing. He is a wonderful emcee as well, easily transitioning to the various phases of the reception and engaging with everyone. A great time was had by all of our guests and exactly what our bride and groom had envisioned for their special day!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "111920687519631369221", "name": "Susan Y", "time": 1551538129714, "rating": 5.0, "text": "Nobody could have out performed Brandon, his brother, or DJ Michael!  Our wedding music and foto booth was perfect both at ceremony and our reception. We, \"Team Snow\", ABSOLUTELY LOVE AND RECCOMEND WELL DUNN ENTERTAINMENT!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "117451086212514230262", "name": "Laura Wesson", "time": 1554719336471, "rating": 5.0, "text": "On time and the best Ever... We love Amarado and Brandon.  They are so kind and the best!!!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "103494505010738837822", "name": "Nicole Kerekes", "time": 1547219247382, "rating": 5.0, "text": "Well Dunn Entertainment is one of my GO TO companies for all events needing music, uplighting, and photo booth services. Brandon is both an incredible DJ who gets any event on their feet and businessman, providing the utmost professional services in a timely and efficient manner.", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "109778019199091311691", "name": "michael thomas", "time": 1525459163675, "rating": 5.0, "text": "I attended a wedding he was the DJ for. He is by far the best in the business. Would highly recommend.", "pics": null, "resp": {"time": 1525460791318, "text": "Thank you for the kind review Michael. We are glad to hear you enjoyed our services."}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "103592148217105766140", "name": "Traci Swanson", "time": 1499371131735, "rating": 5.0, "text": "The Best Dj  Ever very compassionate and concerns about your needs for your Special day. or any occasion.", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "107905901104785930185", "name": "Megan Martin", "time": 1512402481123, "rating": 5.0, "text": "WellDunn Entertain supplied the Bariatric Center at Brookwood Baptist Princeton with hours of wonderful entertainment! Brandon smoothly transitioned announcing events, karaoke and playing a great variety of music to keep the fun happening! We plan on using WellDunn Entertainment for all future events! Thank you WellDunn Entertainment!", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "105172995720459564385", "name": "donna nail", "time": 1529358773138, "rating": 5.0, "text": "Thanks Welldunn Entertainment. And Michael Lira For the Great job as DJ for Zac and Kaja", "pics": null, "resp": null, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "115716072267827614172", "name": "Jennifer Hamrick", "time": 1554733930295, "rating": 5.0, "text": "Wonderful to work with!!", "pics": null, "resp": {"time": 1554791699780, "text": "Wonderful! Thank you so much for choosing WellDunn Entertainment"}, "gmap_id": "0x8888dc12189244bf:0xc000f8a3f5231b0d"}
{"user_id": "105066045010224075864", "name": "Mahogany Sharunda Conda", "time": 1529081045446, "rating": 5.0, "text": "I needed some help putting together a show! They gave me all the info I needed to make it happen Danny and Stephanie are amazing! One stop shop!!!", "pics": null, "resp": null, "gmap_id": "0x8888fcd4a6e51eb5:0xec316af897705063"}
{"user_id": "103815596186400535162", "name": "Ian Kinner", "time": 1540039255699, "rating": 5.0, "text": "Coolest fireworks warehouse in Adamsville!", "pics": null, "resp": null, "gmap_id": "0x8888fcd4a6e51eb5:0xec316af897705063"}
{"user_id": "113975799355852390318", "name": "Khori Oden", "time": 1497864016059, "rating": 5.0, "text": "Thunder on the mountain is the best fireworks show in the state of Alabama period", "pics": null, "resp": null, "gmap_id": "0x8888fcd4a6e51eb5:0xec316af897705063"}
{"user_id": "101138371718213375697", "name": "Kim S (Kimmie)", "time": 1533605590204, "rating": 5.0, "text": "Love them!!", "pics": null, "resp": null, "gmap_id": "0x8888fcd4a6e51eb5:0xec316af897705063"}
{"user_id": "111666963606185507472", "name": "Ben Jackson", "time": 1624827909628, "rating": 5.0, "text": "They were extremely knowledgeable and helpful and put on the best shows in Alabama.", "pics": null, "resp": null, "gmap_id": "0x8888fcd4a6e51eb5:0xec316af897705063"}
