{"user_id": "102924919294701420398", "name": "Rebecca Healey", "time": 1613222573733, "rating": 5.0, "text": "I go to estate sales all over Central Alabama on a regular basis.  This week I met a new crew, and boy did Jeff and Rhonda make an impression.\n\nSmooth sale, incredible bulk pricing, but most of all such a fun experience!  I will drive an hour+ now to find sales that they run because that was the day I had.\n\nThank you for a FUN experience and some great deals!  I will see you soon.\n- Rebecca\n@newleafwetumpka", "pics": null, "resp": {"time": 1613307638195, "text": "Thank you so much!  We appreciate you!"}, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "116544043746565554838", "name": "Charles Bruce", "time": 1602513261139, "rating": 5.0, "text": "These are some of the nicest people you will ever do business with.  They are fair but get top prices for your belongings.   I was so impressed by how they treated me and all the other customers while I was there taking a look.  I highly recommend them", "pics": null, "resp": {"time": 1602524360247, "text": "Thank you!!"}, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "114090996341471147809", "name": "stuart brady", "time": 1613089311932, "rating": 5.0, "text": "Very eclectic offerings. Great staff. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "118284224649744161877", "name": "Jeremy Williams", "time": 1591674310979, "rating": 5.0, "text": "Highly recommend! Very organized and great communication!! Would definitely use them again.", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "117688931214699326588", "name": "Fred Wolfe", "time": 1566182424865, "rating": 5.0, "text": "Thanks for the Foley, AL sale.  I hope they can come back for more.  All the folks working the sale were very nice and fun.  And the prices were very reasonable too.", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "114849143007872813584", "name": "Colette Muncher", "time": 1554613521163, "rating": 5.0, "text": "If I had a need for these services, BES would be my choice. I say this from attending their sales for years. You guys are awesome!!\nHow do you successfully & respectfully shop an estate sale? Read their \"rules\", (love the humor) follow the rules and be kind!\nIf you've never been to one of their estate sales, just go. You won't regret it!!!", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "108883686785305605558", "name": "Wendy Yarbrough", "time": 1558736800414, "rating": 5.0, "text": "Had an amazing experience yesterday at a Birmingham Estate Sales event.  The crew were helpful, friendly, and kept their sense of humor through the heat.  They were so helpful and I can't wait to shop with this crew again.", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "103622138524770355847", "name": "Valente Valverde", "time": 1573833850662, "rating": 5.0, "text": "Best in Alabama  kimy made the process so easy. We love out of state.  What a blessing.", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "106638130328378300030", "name": "LeeAnne", "time": 1584375905894, "rating": 5.0, "text": "Ww always go to this company sales... Very reasonable... Honest.. Very fair prices on quality merchandise! We were at one on this last Thursday...got 6 brooksbrothers shirts for my husband that were brand new with collar paper tags still inside (sale price online $200 each) we paid $43 with other items included.. Since last year we have been refurnishing our home aftermoving from overseas...\nGreat quality items.. Furnishings... Everything you can think of... Webought 2 dixie dressers for $30 and we were given other items included with what we bought!!!! I cant say enough good things about this company... Just thank u!", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "116265561039170534479", "name": "Britni Roberson", "time": 1563046908561, "rating": 5.0, "text": "Had an awesome experience at the estate sell today!! Great people! They were all so friendly and helpful!!!", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "116071204406026586025", "name": "Daniel lord", "time": 1500312055161, "rating": 5.0, "text": "I am amazed at the wonderful deals, extremely fair pricing,  and the most courteous staff members who are willing to listen to the clients and negotiate with buyers. This is a 5 star organization ran by a very knowledgeable and compassionate lady. Kimy Stewart,  you are a blessing to me and to many others as well. I am forever indebted to you.", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "114048658407101392209", "name": "Jennifer Armour", "time": 1549234756262, "rating": 5.0, "text": "Kimy’s passion for what she does is very welcomed.  She handled our sale seamlessly.  Thank you!", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "108954661885923991707", "name": "Brittany M.", "time": 1524252362400, "rating": 5.0, "text": "These guys are amazing! They're always so friendly and kind!! 10/10 would recommend doing business with Birmingham Estate Sales", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "102853114617182268308", "name": "Web", "time": 1528231961745, "rating": 5.0, "text": "I loved working with Kimy to overhaul my wardrobe. She new exactly what I needed and didn’t have any problems. It was so much fun I felt guilty. I know where to go now whenever I need something for me, my family, or my home.", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "108513752335625066313", "name": "William Stewart", "time": 1511737734012, "rating": 5.0, "text": "Great asset to the Birmingham area of estate liquidation’s. Highly qualified with decades of estate sales.   We needed you here!", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "102239853830728936469", "name": "Abby Rose", "time": 1511841353827, "rating": 5.0, "text": "My mom and I love to go to Birmingham Estate Sales. Usually everything in the house is for sale! So many treasures! Great staff members always make you feel welcome and are willing to help us!", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "109260513254539496142", "name": "Tonya Mask", "time": 1562964965070, "rating": 5.0, "text": "We went to the Estate sell in Childersburg Am is was great the people where very friendly and helpful", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "107164351773561662754", "name": "Lloyd Howell", "time": 1490491321530, "rating": 5.0, "text": "A must visit experience for all Estate Sales amateurs and professionals. The staff and owner and always professional, courteous and above all friendly and helpful. My wife and I have never had a bad experience or for that matter felt we received a bad deal. We look forward every week to going to their sales and even if we don't leave with merchandise we always enjoy their company and atmosphere.", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "112702160212323987472", "name": "Daniel Ford", "time": 1525494471812, "rating": 1.0, "text": "I go to estate sales regularly, and I have to admit, I get some awesome deals at Birmingham Estate Sales. But I can't help but feel bad for her clients (home owners). Kimy does almost zero work in setting up the sale, and customers run out with piles of stuff that she just about gives away without researching or pricing correctly.\nIt seems like the person or company holding an estate sale should be working to make the most money for their clients. Birmingham Estate Sales does not do this. And anyone that goes to sales hosted by Nichols, Bryant, Morrison, King, Teachers...etc in the area will see the difference.", "pics": null, "resp": {"time": 1525529409663, "text": "Goodness -- how does one reply to such an unusually snarky comment? With LOVE!!!  We love our clients and our customers and it shows (view other comments).  We wish you the very best in life!!!\n\nWe ALSO HAVE FOUND that estate sale trends have CHANGED ---  (by the way --  we know who you are! A fellow estate sale competitor! Are you red or what? That's OK though! We get it).  Customers want to see how someone lived -- not a STORE FRONT --  our sales are very successful --  I guess that's why you're leaving us a 1 star --  We still wish you the BEST!  All companies work differently --  and we do it the way we feel is successful for our clients --   Woot!"}, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "103503646145292743496", "name": "Candi Jones", "time": 1533306827623, "rating": 5.0, "text": "Best company in Birmingham. Highly recommended. Experts in the business.", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "105493218026325743217", "name": "M Drennen", "time": 1511658115983, "rating": 5.0, "text": "Very pleased with how our Estate sale was handled.   We interviewed 4 other companies and by far Kimy Stewart outshined the others in Birmingham.  We were downsizing from a 8,000 sq ft home in Mountain Brook.  Her marketing expertise and knowledge about Estate Sales industry is well known through Alabama and Georgia.\n\nWe highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "112954841653734091255", "name": "Johnny Dwire", "time": 1511650216866, "rating": 1.0, "text": "They run an estate sale like a cheap garage sale. They really don't seem to know what things are worth and they let people gather up stuff and then give a bulk price. The guys running the sale I went to  said they were new and were learning the business. If you are thinking of hiring an estate sale, go elsewhere.", "pics": null, "resp": {"time": 1516628468937, "text": "Thank you for your input -- however all estate sale companies work differently ---  It's interesting because our customers LOVE our pricing -- BULK pricing on smaller items is a normal process for many estate sale companies -- and we completely understand how to gather bulk items for pricing --   Our crews are well trained -  and we've been in this business for decades ---    Our clients (who hire us) trust our knowledge and marketing.   Our sales are well attended and we have a very large following --  because -- we love what we do!  And it shows."}, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "100259299579222604971", "name": "Gail Mintz", "time": 1469898148733, "rating": 5.0, "text": "Great, fun, well priced sale. Will follow Birmingham Estate Sales in future. Sale on Cheshire Rd was Great !!", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "102611769405131964823", "name": "Andrew Davis", "time": 1511716690495, "rating": 5.0, "text": "Wonderful service. Helped me out of a tricky situation! Glad I found BIrmingham estate sales!", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "111229618549415710705", "name": "John Gaffney", "time": 1493163283446, "rating": 5.0, "text": "Kimy and her staff did a wonderful job completing a successful estate sale for our family! The entire process was seamless and professional from our first meeting through the final sale. Kimy communicates well and explained each step of the process clearly and accurately, so we knew what to expect.....and then she delivered. I highly recommend her for any estate sale.", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "107468494864964609510", "name": "John Fowler", "time": 1528199831801, "rating": 5.0, "text": "I worked with Birmingham Estate Sales to prepare my mother’s house for sale. The process of moving my mother into assisted living and dealing with her home and contents was daunting. I hit the jackpot when I found Birmingham Estate Sales. I wanted a turn key solution and that is what they provided. Kimy Stewart was great to work with. She met me at a convenient time (I live out of town), she walked through the house, explained the process and we reach an agreement for sale quickly. Kimy kept me informed throughout the process. Kimy and her crew prepared the items for the sale, executed the sale and cleaned out the remaining items after the sale. All of this with minimal involvement on my part. They also found a few family treasures that I missed and set those aside for me. If you’re looking for a low drama solution to sell or liquidate personal property, contact Kimy at Birmingham Estate Sales! I’m glad I did.", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "112937547651816468708", "name": "Ashley Mann", "time": 1528148130559, "rating": 5.0, "text": "The nicest folks in the estate sale business. Woot! Woot!", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "105845562306225867691", "name": "Ali-Oop! My Journey from 400 Lbs", "time": 1534880713164, "rating": 5.0, "text": "What wonderful friendly and professional employees! I'll never use anyone else!", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "103395885221333131234", "name": "Ken Wienecke", "time": 1458398355453, "rating": 5.0, "text": "I didn't even know what an estate sale was, but somebody or other said I should check it out. I needed to liquidate the contents of the home in which I was raised (I was a 5th grader when my family moved there 55 years ago), and I didn't have a clue. I was already commuting from North Carolina to get this task behind me, so I was desperate. I searched the web, found your company site and it answered every possible question. Then I met you (Kimi) and the rest is history. How fortunate I have been to see you execute your passions, all in the disguise of running a business. You are a helper, encourager, rescuer and value-adder...just for starters. In spite of a nasty sibling dynamic on my side, you took on my job with enthusiastic energy and made it work. You went way, way, way beyond the call of duty, and my naive trust was very well placed. I wish I had another house to empty in Birmingham. Thank you.", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "118370018444511301148", "name": "Janet Allen", "time": 1519924614645, "rating": 5.0, "text": "Kimy and her staff were a pleasure to work with and very professional! Even our cat fell for Kimy!!\nBirmingham Estate Sales truly went the extra mile to make this process successful and easy for us as the home owner. They come with high recommendations from us....Thank You Kimy!!", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "103488533184946624706", "name": "Jason Sarazin", "time": 1564863597383, "rating": 1.0, "text": "Followed signs to estate sale. Was walking through house and looking to buy a $2200 gun but lady said they were closed st 3pm and it was only 3:05pm.  If you're going to refuse sales then put times on your sign's or remove your signs when close up shop. There were other people in the house browsing and the lady took another woman's purchase money as she told us they were closed.", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "100819038692499537202", "name": "Dorothy Watson", "time": 1550577597886, "rating": 5.0, "text": "Awesome, Friendly, Knowkedgable, Professional!", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "107492180434658088575", "name": "Donna Davenport", "time": 1481588593878, "rating": 5.0, "text": "We love Birmingham Estate Sales. Owner and staff are incredible!!!", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "107503011967174017514", "name": "Laura Price", "time": 1458079887160, "rating": 5.0, "text": "Previous Atlanta Estate Sales Company Owner of Peachtree Estate Sales, Kimy Stewart, has moved to Birmingham and is ramping up to do some great sales in Birmingham. She truly loves what she does and loves being able to work closely with her clients. Her sales are unlike anyone else's because of the lively music she plays, huge following of loyal customers, fun atmosphere and great attitude. She has great communication and marketing skills. She knows what she is doing!", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "106652958820557518401", "name": "Richard Lawson", "time": 1462711104125, "rating": 4.0, "text": "FUN estate sale,  Lots of good items,  well run,  very professional.", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "104084047525130002957", "name": "Thomas A. Wesolek", "time": 1495735691287, "rating": 5.0, "text": "We had to liquidate our Aunt's home from out of state as it was time for her to move closer to family.  Kimy and her staff made the process stress-free.  We didn't have to travel to AL for the sale as they took care of every aspect.", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "103208450841187004723", "name": "Teresa Poore Forever Weight Loss", "time": 1477680289050, "rating": 5.0, "text": "Fantastic shopping experience!!", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
{"user_id": "115024773487802631342", "name": "Kimy Kennedy", "time": 1490489333860, "rating": 5.0, "text": "I believe!!! Best company ever!!!", "pics": null, "resp": null, "gmap_id": "0x88891bcea2c78b89:0xc36051baa2ed658e"}
