{"user_id": "106216482269789884715", "name": "LORI WILLIAMS", "time": 1607397740902, "rating": 1.0, "text": "Zero stars. Anyone can walk in without a ticket and sit wherever you want! No one checked anyone. No one takes tickets, no one is there to answer questions, the food was 2 miles away from the polo grounds. Awful. Awful, awful! 5 balloons that go up and down. Not at all what we were expecting! Tried to give it zero stars but it wouldn’t let me!", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "105323639754927751189", "name": "Harry George", "time": 1576507538214, "rating": 4.0, "text": "Great night, a lot of fun, great weather.  Entered for best photos.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOvl6EMZ-rQfrq4agcBVwzCR5vk10bxTLbpN1Ut=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOcxkXKegwSQwR-bUZWOiLloFypLSuZGOTFhAWo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP5hSB-tRTqNU3Rj8X6UJ0VQh0BsYe1g3CEYuFN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOV2Xnt7Cszx0FtWkD8QfElzsZXEqbdT-RPReen=w150-h150-k-no-p"]}], "resp": {"time": 1576516550861, "text": "Thank you! These are awesome! Can't wait to have you back."}, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "111502353919492256940", "name": "Amrit Gill", "time": 1558805885009, "rating": 5.0, "text": "I’ve been to a Victory Cup Hot Air Balloon Festival & Attend polo match last month for the entire weekend and take ride in Hot Air Balloon we enjoyed it so much! Pet Show, Music, Food, Drinks, Firing of balloons and lift offs  Great work guys keep it up :) Cheers!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPnejXlsV2OxQOLCHrv91Fq27rkGsGFSMRiJ-7P=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNPWG4Dd7PfpyHH3lxti8cL60mQ4KYxeGBoJUz8=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "107118748026024274456", "name": "Cal Breeden", "time": 1607536345717, "rating": 1.0, "text": "If you have some time to spare, 8 to 10 hours you want to spend waiting in an unorganized line, well this is the place to be. If you want to spend more than 2 minutes in a hot air balloon, this is not the place for you.\n\nI wish there was an icon that represented throwing money out of the window instead of one star. I would have chosen that instead. But still, writing the review was more fun than the hot air balloon festival.", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "111420617370609083989", "name": "Eric Sodolak", "time": 1601642561633, "rating": 1.0, "text": "This company is a bait and switch scam. We bought tickets to an event that was happening near us. Unfortunately the Covid situation delayed the event. They rescheduled the event several times and which we had agreed to the same event at a different time at the same location. Now 2 weeks prior to the event they are emailing saying the event won't be held at that location (a 3hr+ one way trip from where it was originally to be held), and we can choose a different event. The problem is they are no longer offering any events remotely close to us. They refuse to refund our money, even though we didn't agree to this and they aren't offering a suitable alternative. Will never attend any of their events after we get this mess sorted out.", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "104503928839159786235", "name": "Jennifer Stevens", "time": 1607218757626, "rating": 1.0, "text": "Normally not one to leave reviews but we were very disappointed with our experience.  We had to wait in line for over 3 hours for the tethered balloon ride ) you didn’t even go over 40 feet.) Food was way overpriced and everything was so spread out it didn’t make sense. Other entertainment was lacking . We have been to other balloon festivals and this was very disappointing . Didn’t even make the polo match. Save your money.", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "109660107567406759323", "name": "Bertie st. clair", "time": 1626955566457, "rating": 5.0, "text": "Great atmosphere.  Great Buffalo Wings. Quaint place to hang out at.", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "106920684961886096140", "name": "Gabe G.", "time": 1607219817561, "rating": 1.0, "text": "Basically, similar to other negative reviews, no refunds no matter what, and the tickets were very expensive. False advertisement, using stock pictures from other events not associated with this event to help sell tickets, inappropriate description of event, in some cases inaccurate and misleading with malicious intent. Sad thing is that this has put a bad taste in my mouth about other events of this nature, I'm not sure what to trust anymore.  I'm not advising not to attend, but do your homework, see guest images and descriptions so that you are not mislead and very disappointed.", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "117035045972113759096", "name": "Mouse Family M&M's", "time": 1600017436290, "rating": 3.0, "text": "I expected a better experience than what we had. I considered the drinks overpriced. The food was mediocre. I tasted better food at the free samples at Sam’s or H-E-B.Not much to do while we were there. The music was good. I have talked about this event for a month for my family, unfortunately the entire family was disappointed.", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "115356645915084670534", "name": "Felicia Johnson", "time": 1576600893067, "rating": 5.0, "text": "This was my first time attending Victory Cup Polo and hot air balloon festival. All I can say is, wow! So much fun! The people, the food, the enthusiasm. I also love that this even is pet friendly. The weather was great and the polo was even better!", "pics": null, "resp": {"time": 1576683023339, "text": "We LOVED having you! We look forward to having you back! These photos are awesome! Place on Yelp as well."}, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "108871634937881437232", "name": "Brian Beck", "time": 1607279559337, "rating": 1.0, "text": "I purchased a couples VIP package plus a tethered balloon ride. Upon arriving, we received the incorrect wristbands & had to pay for our drinks, although, according to as advertised, our food & drinks were included. Parking was a nightmare, as there was 1 way in & 1 way out. The wait was INSANE.\n\nMost of the staff were confused, with no clear instruction & no answers to any of our issues. The event was poorly planned & we will not go back.\n\nThe only comic relief to the situation is that every other couple or family that we talked with shared a similar story / experience.  What a scam!!!", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "106127095650906180503", "name": "Courtney Fabs", "time": 1576780370358, "rating": 5.0, "text": "Definitely a fun event for people of all ages!  I attended the Charleston, SC event. I will be transparent and say it is not the most affordable event, so if you plan to have adult beverages and purchase food, it will definitely add up. I was in the Golden Mallet VIP tent. I personally think VIP is the way to go! We had unlimited rose and we had a nice lunch that included oysters, lobster boil, burgers, hot dogs, etc. the hot air balloons were definitely my favorite part! It's a fun day, and you can shop local vendors.\n\nI think if you plan to attend next year, have a game plan and know going in if you don't pan to get VIP tickets what you'll need to spend.", "pics": null, "resp": {"time": 1576785828595, "text": "Thank you very much and we look forward to having you back! Spread we the word and we will see you in 2020! Please consider a post on Yelp as well!"}, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "115236698301571751245", "name": "Diane Orr", "time": 1558964316734, "rating": 5.0, "text": "BEST PARTY IN TEXAS. My friends and I always have a fabulous time!  Of course the Polo is wonderful, but so many other things to do there. Weather permitting, the balloons are always a big hit. Love the food, vendors, and  live music.  What more could you ask for???", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "109714604156228033020", "name": "James Burton", "time": 1558798837589, "rating": 5.0, "text": "The Victory Cup is an awesome experience! They have everything from Great food options from various vendors and the great food from the Victory Cup Grill! Lots of entertainment from live music to helicopter rides. Great bars and tasting options. Fun for everyone of all ages. Can't wait to go again!!", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "116203386173459782066", "name": "connie lambert", "time": 1558802687457, "rating": 5.0, "text": "These events have so much to offer!  You get to dress up in your fancy duds, enjoy great food and drink, sample tastings, watch and learn about polo, peruse great vendor tents, experience a hot air balloon tethered ride or a helicopter ride, activities for the kiddos, and more!  There is so much to take in that you can have fun the whole day!  Can't wait to go again!", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "106989910908181643619", "name": "Kharisma Hair Salon (Sherry Kelly Busby)", "time": 1607366209200, "rating": 1.0, "text": "This was the most unorganized event I’ve been to - cars parking a mile away- they had 2 food vendors for the thousands of people that were there and they were a long distance from the balloons - they was no music while you were in line over 2 hours to ride the balloon - just crazy planning", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "100322927857074595410", "name": "Al Keshvarzian", "time": 1558894010179, "rating": 5.0, "text": "I have had the privilege of playing in Victory Cup throughout the country for the past two and half years. It has been an incredible experience to be part of this first class organization. Greg, Clare and Joe have done a tremendous job running well put together events despite all\nThe challenges ...", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "114818729541686501107", "name": "Jackie Stafford", "time": 1576385899942, "rating": 5.0, "text": "I always love attending The Victory Cup! The polo match is always awesome to see and it's a bonus to see the beautiful balloons go up! Sometimes they have other attractions like a dog show or helicopter rides! The helicopters are very skilled at what they do!", "pics": null, "resp": {"time": 1576506688744, "text": "These are awesome! Do not forget to upload to Yelp before noon today!"}, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "105579134755237012909", "name": "Ben Wolfe", "time": 1575405816538, "rating": 5.0, "text": "We had the best time! It was so much fun! Where else can you watch a polo match, ride a hot air balloon, and a helicopter all 8n the same spot!?", "pics": null, "resp": {"time": 1575457790279, "text": "We really appreciate this review! Looking forward to having you back!"}, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "110547511098109006105", "name": "John Gallina", "time": 1558967626427, "rating": 5.0, "text": "Victory Cup is a fun family event for all ages! There are clothing and jewelry vendors along with lots of food, beer and wine. By attending a Victory Cup event in addition to having fun you are supporting veterans housing and local charity. Rain or shine you guaranteed to have a good time.", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "112737251793370710399", "name": "David Pellon", "time": 1559049323417, "rating": 5.0, "text": "Polo, Food and Fashion all at one event that was a fun day.  We were pleasantly surprise as to how organized the event was.  There were interesting vendors, delicious food, and a full bar featuring Craft beer (that we love).  I will attend again!", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "101493779565626735064", "name": "christi koch", "time": 1558796211240, "rating": 5.0, "text": "One of the best events I have been to!  Live music, horses,and lots of great food options made for a really great day! And the hot air balloons were really awesome to see. Cannot wait to attend the next one.", "pics": null, "resp": {"time": 1558796718313, "text": "Thank You! We hope to see you soon! Check us out at www.VictoryCup.org"}, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "108571834473181023078", "name": "Sophia Harvey", "time": 1558967958410, "rating": 5.0, "text": "Fantastic event. Entertainment, food, cocktails, fashion and polo — it was so much fun and we are definitely going to do the balloon ride the next time. We can not wait for the Nashville event and look forward to coming with a large group.", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "109073641874697143429", "name": "Doug Wasson", "time": 1558899773424, "rating": 5.0, "text": "We came to Victory Cup in multiple places in Texas since they were all just a fews hours, at most to drive through.  It was really fun for everyone and even family friendly.  They had a bouncy house, animal zoo, booths with jewelry, spices, clothes, awesome Pennyluck boots (my buddy bought a pair!) and wonderfully dressed men and women from it seemed like all over!    It was great because it was laid back and some people just wore shorts and a T-shirt and some wanted to dress up but it really seemed \"come as you are.\"  The weather was perfect at some of them making the balloons such a cool sight.    We had to stay all day though for the perfect times of weather for balloons (usually very early or late in the day).   The party was popping though all day long and the polo was fun and lots of good fun loving folks getting together for a good cause.   We really appreciate Victory Cup's support of Purple Heart Homes, which builds houses free of debt for returning Purple Heart Vets from war.  We love this event and wanted to give our deep felt gratitude to Victory Cup for all their hard work.  Keep the Victory Cup coming, we love it!!!    Melinda & James", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "111330334571017897960", "name": "Rebecca Woodard", "time": 1581904074526, "rating": 1.0, "text": "The hot air ballon festival was a bust. I would not recommend the experience to any one. The festival did not meet expectations on food, vendors, or music. The management of the even was awful. We did not get our full five minute hot air ballon ride (no one got their full rides on the balloons or the helicopters).\n\nThe so called Hot-airBallon ‘Experience’ is a rip off. Lots of disappointed attendees from all over the state.\n\nRIP OFF !!!!!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "108332099249504075711", "name": "Thomas Lutz", "time": 1558960850368, "rating": 5.0, "text": "I’ve attended four Victory Cup events.  The food and service were top notch.  Great place to make new friends. Don’t miss the next one!", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "109925931342614228105", "name": "Pat Thompson", "time": 1558902851023, "rating": 5.0, "text": "Victory Cup is always the best year over year, even when the weather hits, they still have an outstanding event.   Fun with friends and always meeting new people at these events.   Can’t wait for the next Texas event.", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "107919694189435985081", "name": "k h", "time": 1558969043439, "rating": 5.0, "text": "I have attended several of these events and always have a blast. There is truly nothing else like this. I love that it is family and dog friendly.", "pics": null, "resp": {"time": 1558969962820, "text": "Thank you so much! We can't wait to see you soon. Just remember to stay off the tractor! You photos can be found here: www.VictoryCup.org"}, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "106811559819590035223", "name": "Scott Burns", "time": 1558883442971, "rating": 5.0, "text": "I was at the AUSTIN event, I was amazed at how much work this crew put in to make this event still happen after the storms came through And Completely saturated the area. There never quit attitude and ability to keep a smile on her face and treat everyone like friends in spite of the messy weather and the extra added work to make the event happen. Once again another great event.", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "102893599497681968381", "name": "John Honning", "time": 1558900133436, "rating": 5.0, "text": "What a fantastic event the Victory cup was. Even with a little weather we had a fantastic time. Looking forward to next year!", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "104303671068684949484", "name": "Jamison Lee", "time": 1576526141304, "rating": 1.0, "text": "Color me unimpressed. I purchased tickets to this back in May as a gift to my wife. She has always wanted to ride in a hot air baloon and this was going to be a surprise anniversary event. The event was originally scheduled for the weekend of November 15th in Houston. I was a little surprised they could never give an approximate time for when the balloons would launch, as I paid for tethered rides. I suppose it is by design as by not telling anyone, they force you to be there all day waiting and spending money.\n\nFast forward to the weekend of the event in November. I check the FB page the morning of to see if there are any updates, and sure enough, the event was moved out into mid-December! Never mind that no notice was given. I called and was told everyone was sent an email, but I never saw it and could not find any record of having received it.\n\nOk, fine. We wait for December. We fast forward again to last weekend. I am loading up the fam to head over to the event. Hang on.... when did it move to another city 24 miles west of the original location? Now my 45 minute drive is an hour and 14? Nope. No thank you.\n\nAgain no notice of the event location having been moved. I am annoyed that I threw my money away on this. Since they clearly state no refunds for any reason, this was a total loss.\n\nIf I were the suspicious sort, I might imagine they had poor event management issues and by not offering refunds, actually made more money off of the folks that don't want to add another 45-50 minutes to the round trip.\n\nI am sure those that accepted all the event changes and made the trip no doubt had a wonderful time. I may be in the minority, but not only will I never attend this, I will make it a point to let everyone I know hear about how poorly this whole event is managed.\n\nFool me once, etc.", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "108916192241262017171", "name": "Amanda Reed", "time": 1572206836339, "rating": 1.0, "text": "Absolutely HORRIBLE!! I spent over $150 for VIP tickets to Austin Lobster festival and never even got food!! It was so disorganized and overcrowded! VIP was a rip off because it was open to the public and wait times were 3 hours for food, over 30 mins for drinks. They advertised private bar and seating for VIP but there was nothing private for the VIP everything was open to the public. Why would they presale tickets for an event open to the public?? DO NOT WASTE YOUR MONEY ON THIS!! We left with no food just 2 bottles of water!!! Just a totally awful experience. Victory Cup blocked me from leaving comments and keeps deleting all negative comments on Facebook.. That shows just how much of a rip off they are!!!", "pics": null, "resp": {"time": 1576506745961, "text": "You are posting on the wrong event. We are a polo match and balloon festival: www.VictoryCup.org"}, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "113659091707208469415", "name": "Bob Ball", "time": 1558963552248, "rating": 5.0, "text": "My friends and I had a fantastic time at Victory Cup! Definitely looking forward to going again this year!!", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "110236887951360330946", "name": "Lovepreet Gill", "time": 1558805397565, "rating": 5.0, "text": "Too much fun at Victory Cup event, I will definitely attend Victory Cup events in future.", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "103194609265295198897", "name": "Darren Hahne", "time": 1581949784425, "rating": 1.0, "text": "The reviews for the one that just took place in Fredericksburg Texas keep getting taken down. Beware people!", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "106889785913353878449", "name": "Claude Gerhardt", "time": 1575304617740, "rating": 1.0, "text": "The worst experience ever! Huge ripoff", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "113930701767959153501", "name": "X - Adi", "time": 1558944976402, "rating": 5.0, "text": "The best events ever, mixed with fun and good taste.", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
{"user_id": "100868218931512253923", "name": "Andrea Velazquez", "time": 1576280731529, "rating": 5.0, "text": "#VictoryCup #2019 #Wewanttowin", "pics": null, "resp": null, "gmap_id": "0x865bc14314808641:0x5666354736bab1c7"}
