{"user_id": "112317126159442378371", "name": "Alyn Boyer", "time": 1625058697421, "rating": 5.0, "text": "I thought Seth and his team were awesome. Very professional...on time... great music and the photo booth was also fun!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "113753545530393532120", "name": "Daniel Westfall", "time": 1605733303295, "rating": 5.0, "text": "Overall great experience! Great communication leading up to and after the event, nice music selection, and a DJ that read the crowd well. They offer other services as well - including a cool photo booth. Would recommend.", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "115555951684107550038", "name": "Madison Poole", "time": 1605705519393, "rating": 5.0, "text": "Such amazing / professional people to work with! The communication before and during the wedding was phenomenal! If you’re looking for a fun DJ, you’re looking at the right place!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "117907838586655513299", "name": "Shoals Diversity Center", "time": 1532370451903, "rating": 5.0, "text": "Reasonable prices, complete efficiency and superb communication.  We will never have another event without Fine Era!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP7iaTFsT1x_aTXxvqNE8y5qNSasAwBre9oRwIZ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "102236065462838998956", "name": "Sara Moseley", "time": 1573511665772, "rating": 5.0, "text": "Great for Wedding Rentals and as a DJ!\nSeth and his team at Fine Era were responsive to communications, prompt, efficient, accommodating with the venue location, and offered an extensive menu of services at very reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "105734223164660320772", "name": "Michael Henderson", "time": 1561505291974, "rating": 5.0, "text": "Absolutely professional. Top shelf production, will definitely hire again!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "105020868738915951523", "name": "Leella Holt", "time": 1447336717234, "rating": 5.0, "text": "Seth at Fine Era Productions provides a wonderful experience for high school dances.  The music has already been \"scrubbed\" and is suitable for school venues.  Seth is prompt and dependable.  Fine Era Productions provides services in such a manner that school sponsors do not have to be concerned about the outcome!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "110383955445711650681", "name": "Erin Gray", "time": 1438881269749, "rating": 5.0, "text": "Last year, our school had to find a new DJ. Seth and Fine Era Productions really came in to save the day! Not only are they fantastic at their job but they are really great people to work with. We used their DJ services that included up-lights as well as their bistro lighting. The event was a major success and looked amazing. The music is current and they know how to get the crowd going. I can not recommend Fine Era Productions enough! I've already reserved them for this year and can not wait to work with them again!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
