{"user_id": "105009069663296496987", "name": "T “Lady T” CL", "time": 1555150428060, "rating": 2.0, "text": "Had never heard of this place before until they contacted me about a position. Someone else was hired. I stopped by the office to drop off requested paperwork. She said she would keep my information on file. No follow-up or communication since then.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOinsjvrG7S1Yd1V76dHG8ba8QzcnZ3U1TWguOq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMzRmiKtylB7CTdinEazOTHbomJun4mQdTSkS3P=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPt_Zr_oRLVSG1da-b8e48i3IvHQfWyPynKjJG9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMtrnr9rmv99HtVUucNmk7HYalCootfCEsrPZ0H=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO9gfezIRSOknlwHiiUQKlyHLMK4VDsqPqLQE9K=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOeYVpG1yekGsvqe19dnUyUwkVdxsVwurEQAl-w=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOe3GNfHJXHUfIW-jmOsfqIx1hJk5zz2z64Btid=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNR10JCSCr7GStBcyXOLjEXPcnQ98CGHxSfIl6v=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMO75ZnyeGWaBmf3hu-FF_53MkxFxUks9PWD9xR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN-NtNtlpe4400ppCiAkmXGvk_OFUEWzbDYJOq4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM6H08-AnXm0Dv87xAEPCB2_ib9Ogdlstnhdf1S=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNZ2sk0M9arcYG6b1XV9n2KvVRaMtsZSUNTqxuY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNclxgbOFepzUlS1Dx78tvV4zcCKfcs3akYfSq1=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "113599126063458561745", "name": "Elaija Mason", "time": 1559302622711, "rating": 5.0, "text": "Went in one day they told me they would contact me when a job came available got the call early the next morning that they found a position got sent to interview with the hiring employer and 1 hour later I was hired! I have been to several temp agencies but this one got me in and got me out FAST and the staff are very energetic I will definitely be referring people !", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "104530235677517075897", "name": "Vernon B", "time": 1481307191984, "rating": 5.0, "text": "I've consulted with Darrell Walker Workforce many times regarding several of their employment services, including job placement, executive search, and workforce planning. On one occasion, I met with their administrative staff and recruiters in their Birmingham office. Throughout our 4 hour+ meeting, I was impressed with their attentiveness to my specific needs, eagerness and ability to answer my questions, breadth of knowledge about the staffing industry, and the years of experience they (literally) brought to the table. As an aside, they were providing temp services way back before the word \"personnel\" fell out of favor! I know I'm in good hands with Darrell Walker and will continue calling on them in the future for my staffing and payroll outsourcing needs.", "pics": null, "resp": {"time": 1481323844720, "text": "Hi Vernon! We remember that marathon meeting quite well. And we enjoyed every minute of it! One of the main reasons Darrell Walker Workforce is capable of providing relevant and beneficial employment services is because we understand the importance of listening. And the more we listen to valuable clients like yourself, the more we learn. We're definitely looking forward to our next \"discussion\". Thank you for taking time to leave a review. ~ Linda Walker Channell (President)"}, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "105177598837917596552", "name": "Nimitz 17", "time": 1572160206395, "rating": 5.0, "text": "I called in and they had me a job the next day, 5 stars all the way!", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "116894094856529757653", "name": "Shelley Belly", "time": 1409771304426, "rating": 5.0, "text": "Sheila and Meredith are very helpful and knowledgable in their field of human resources and placement.   It was a pleasure to deal with them. I have referred friends in the area to them and they have all enjoyed their experience with Darrell Walker Workforce Systems.  I would definitely recommend them to others.", "pics": null, "resp": {"time": 1481321495273, "text": "Hello Ms. Belly! Sheila and Meredith combined have over 45-years experience (and they're so young) in the staffing and recruiting industry, and Darrell Walker Workforce is grateful to have them on our team! It was a pleasure working with you as well and we REALLY appreciate your referrals. Thank you for your kind review. ~ Linda Walker Channell (President)"}, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "116123383910812557403", "name": "anthony d.", "time": 1541855764124, "rating": 5.0, "text": "I was hired by D. W. Over 2 yrs. ago and assigned a job by them in moody, al. After staying at that assigment for a couple months, I was hired on with the company full time and have been with them since then. The staff was very nice. I recommend D. W. highly as a place to get employment started. Also am making more money.", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "105933276905541719337", "name": "Len Snow", "time": 1546876171431, "rating": 1.0, "text": "I Signed Up For These People Multiple Times An They Never Found Me A Job I Call Every Monday These People Know My Name Personality An Never Found Me Nothing I Really Feel Like This Place A Waste Of Time An Just Won't You To Come In An Do Your Paperwork So They Can Get Paid", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "112974491811833007974", "name": "Humble Beginnings", "time": 1539894515015, "rating": 2.0, "text": "Only 12 hour shifts available.", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "103746775015177415026", "name": "Andrea Alston", "time": 1620317713830, "rating": 1.0, "text": "If you are in desperate need of  a job this is not the place.They are very nice and eager to find you a job in the beginning. ( at least thats what it seem like) I was very fooled by this company I was getting job offers from other companies and this company took 4 months to run a background I have worked in a few professional management settings this was beyond ridiculous.  I even went to the county where the background was stuck in . The office management was getting an attitude with me because I was calling trying to get an update.  To be clear  I did have something on my background that was over 7 years ago I was very honest and upfront with the staff. This has not ever  hinder me from obtaining a job as I have worked in management for over 2 0\nyears. I was beyond disappointed on how I was handle with the Management staff at this establishment.", "pics": null, "resp": {"time": 1620879477383, "text": "Thank you for your comment. We are so sorry to hear about your experience, and we’d like the opportunity to investigate and address your concerns. If you are willing to discuss this further, please contact our Customer Feedback team directly at 800-803-9336 or customerfeedback@roberthalf.com."}, "gmap_id": "0x8889179feec41c7d:0xe0dc48b434e7dde2"}
{"user_id": "114909064236614593006", "name": "Mur Lock", "time": 1581826795215, "rating": 1.0, "text": "Filled out all their info. Got called about a few positions. After they got  allll my information- never.heard.from.again! This seems to be a trend in these temp to hire type agencies. They must all just want to beef up their pool of candidates for businesses but the actual candidate comes last and is disregarded after they get a hold of their resume and info. I will email asking my file be deleted as they wasted my time.", "pics": null, "resp": {"time": 1582050820060, "text": "We are incredibly sorry to hear about the lack of communication you experienced at this branch. Would there be any further details that you would like for us to know? You can reach out to our quality assurance team at customerfeedback@roberthalf.com and/or 1-800-803-9336. We greatly appreciate you letting us know what happened and hope to have one more opportunity to connect with you."}, "gmap_id": "0x8889179feec41c7d:0xe0dc48b434e7dde2"}
{"user_id": "115828335009536105016", "name": "Aubree Gillis", "time": 1578596589476, "rating": 5.0, "text": "The best staffing agency ever, they changed my life.", "pics": null, "resp": {"time": 1579029538778, "text": "Thank you, Aubree!"}, "gmap_id": "0x8889179feec41c7d:0xe0dc48b434e7dde2"}
{"user_id": "111393472582038386846", "name": "kandi lykes", "time": 1463698387676, "rating": 1.0, "text": "Not very professional on top of the fact that I have had a application on file with them for the past 4 years and have never been sent out on a job.", "pics": null, "resp": null, "gmap_id": "0x8889179feec41c7d:0xe0dc48b434e7dde2"}
{"user_id": "102857455174792796880", "name": "Cinderella 7x7", "time": 1492874830490, "rating": 5.0, "text": "They help a lot of people find jobs!", "pics": null, "resp": null, "gmap_id": "0x8889179feec41c7d:0xe0dc48b434e7dde2"}
{"user_id": "104432243077958458637", "name": "Alecia Fox", "time": 1612751674328, "rating": 5.0, "text": "Very friendly and very helpful staff that has really helped me during my job hiatus. I lost my employment of 18 yrs of service back in 2015. Have had rough time with employment since 2017 when a 1 yr assignment at another agency ended........So glad Snelling saw potential in me, and has given me a chance in the career world when other staffing agencies did not. This agency has sent me on several assignments during the past year, and has really helped me with steady work. They welcomed me, and even treat me like part of the family. When I am going thru a personal crisis, they are very understanding employers and the concern and care is genuine, unlike past experiences I have had in other facilities. I recommend anyone to contact Snelling for their employment needs/desires. My recruiters and managers are great, as well as the entire staff. Thank u family.", "pics": null, "resp": {"time": 1612815498712, "text": "Thank you for sharing your kind words with us. It means the world to us and to our entire team!  We are thrilled to have you as part of the mini Snelling family!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "105542283497982485225", "name": "Jamilah Arrington", "time": 1612747485128, "rating": 5.0, "text": "Whitney Taylor made my experience with Snelling amazing. She is consistent, professional, and always made herself available as needed. Snelling allowed me to advance in my career and later score a permanent job with the agency I was working for. Everyone is professional and nice. There were no bad experiences!", "pics": null, "resp": {"time": 1612815267314, "text": "Jamilah, I am so glad you like Whittney and her professionalism, we’ll pass along the kind words. Also, thank you so much for taking the time to leave us this amazing review."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "106233973832541508241", "name": "Tawsha Witherspoon", "time": 1613679758961, "rating": 5.0, "text": "Snelling is an awesome staffing agency.  The staff is always professional and they actually care about the needs and wants of both the employee and employer.  I started with them on my birthday 4 years ago and they will forever be my birthday blessing.", "pics": null, "resp": {"time": 1613684412659, "text": "Tawsha, thank you for leaving a 5-Stars review. At Snelling, we continuously strive to serve you better.\nWe are glad that the team has managed to meet your needs for Staffing! PS. We are glad to be your birthday blessing!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "107485804079462890626", "name": "Lindsay M", "time": 1617686297383, "rating": 1.0, "text": "Aggrieved..... job was awful, quit and left, after even telling them I didn’t feel like it wasn’t going to work out..training was the worst... was horrible and never  could  even try to learn my role at the company... was never contacted again about other future  employment. Thought they were a great company at first ...not now..have never had any other staffing agency not try to help regardless of leaving an employer. I worked in staffing for 3 years and Always tried to help my prospects. I do not recommend this staffing agency.", "pics": null, "resp": {"time": 1618319957027, "text": "Lindsay, we are shocked to learn about your bad experience, but appreciate the opportunity to hear your concerns.  We wish you all the best in your future endeavors."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "112212304103745177513", "name": "Kristyn C", "time": 1613680165116, "rating": 5.0, "text": "Snelling is a great company to work through. They have direct deposit and make everything easy with online access to all your information. More staffing companies need to model them.", "pics": null, "resp": {"time": 1613684513873, "text": "Kristyn, Thank you for sharing your five star review. Here at Snelling, we strive to provide the best experience we can for our customers in the easiest way possible."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "105898692963862493094", "name": "Jennifer Viox", "time": 1602042347402, "rating": 5.0, "text": "This company has truly helped me find the perfect career! Everyone is very helpful and professional! I really enjoy working with this company. They have been really helpful on getting me to my first and second interview. I knew exactly what to expect and they made me feel comfortable doing everything that needed to be done. I greatly appreciate Jamie for doing everything she has done to get me in the right position!!", "pics": null, "resp": {"time": 1603110551583, "text": "Jennifer, Thank you for the 5-star review! We appreciate the opportunity to work with you through your career search and wish you all the best in your new role.  Congratulations!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "107268710585634683831", "name": "Brent Coker", "time": 1612924279309, "rating": 5.0, "text": "Recently laid off from a job. The company I worked for sent my info to snelling. Within two weeks is was back to work making roughly the same pay and 40 hours a week. Really great people and they will go above and beyond to help find a job you will be happy with. Ask for Jamie or Whitney, they will get you back to work.", "pics": null, "resp": {"time": 1612534789950, "text": "Brent, thank you so much for taking the time to share your experience here at Snelling. We take pride in knowing our clients are happy with their job placements."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "106022192455343860658", "name": "Karen Swearingen", "time": 1619757252502, "rating": 5.0, "text": "Whittney Taylor is the go-to person! She had me working in less than a week. I highly recommend her!", "pics": null, "resp": {"time": 1619789476159, "text": "Thank you for your five star review and for using Snelling and we think Whitney is pretty special as well."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "114495136303234473120", "name": "Bobby Starks", "time": 1612470612603, "rating": 5.0, "text": "I would recommend anyone to this wonderful group of people from Snelling in Homewood Alabama my hat goes off to Jamie a very wonderful woman I must say", "pics": null, "resp": {"time": 1612472803213, "text": "Thank you for the 5 star rating, Bobby! We appreciate the opportunity to work with you and we agree Jamie is pretty awesome!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "111917717130026642234", "name": "Alisha Underwood", "time": 1605634125205, "rating": 5.0, "text": "I love Snelling Birmingham they all was come though when I need them. They have put me in a GREAT job and I am enjoying myself in this position. GREAT JOB TEAM", "pics": null, "resp": {"time": 1605639363993, "text": "Alisha, thank you so much for your great review, and, I am glad you are enjoying your job, that is the icing on the cake for us."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "108081594356027470587", "name": "Hollie Crawford", "time": 1582553323464, "rating": 5.0, "text": "Snelling is a wonderful company with super nice and professional employees! Jamie found a career for me very quickly! The very first company I interviewed with hired me on and I love my job as well as my co-workers. Snelling is WONDERFUL!", "pics": null, "resp": {"time": 1582554615364, "text": "Thank you very much Hollie!  It was a pleasure working with you.  Happy almost 1st anniversary on your job!!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "108995721156672824532", "name": "Stephanie North", "time": 1585414588100, "rating": 5.0, "text": "Working with Snelling was an absolute amazing experience. My rep Whitney was ALWAYS working and going above and beyond to assist. I would definitely utilize their services again!", "pics": null, "resp": {"time": 1589829079433, "text": "Thank you for the positive review Stephanie.  We appreciate you and your efforts with our client company!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "115595208090672824330", "name": "DIEDRA STRINGER", "time": 1583938750201, "rating": 5.0, "text": "Great experience with Snelling from the beginning to the end. Whitney is the best. I love that she keeps in touch to make sure that thing are going well. I would recommend Snelling to everyone.", "pics": null, "resp": {"time": 1584562080530, "text": "Diedra, thank you for the positive review!  We think Whittney is amazing as well.  Good luck with your new position!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "111690120537377517107", "name": "Renee Sloan", "time": 1575988536611, "rating": 5.0, "text": "Snelling is a wonderful company!!  I have had the best experience with Jamie and everyone I have worked with.  I had a job within 2 or 3 days and it is a great company.  They really care and listen to what works best for you.", "pics": null, "resp": {"time": 1575999763812, "text": "Thank you for the positive review!  It's been such a pleasure working with you and we appreciate what an awesome job you've done for our client!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "116727611258930768754", "name": "Silent Lynx", "time": 1596036197065, "rating": 5.0, "text": "Snelling got me a job super easy and super fast. Great place to check out!", "pics": null, "resp": {"time": 1596069587905, "text": "Thank you Silent! We appreciate the positive review and for working with us!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "106053270501533682371", "name": "Kristopher Guthrie", "time": 1576019612418, "rating": 5.0, "text": "Have had a great experience at Snelling Staffing from going in and meeting the friendly staff to being sent to a great job opportunity. Jamie is one of the best staffing agents at the Birmingham office. She has emailed me from start until finish, even emailing to find out how my first day went. This is a great place to search for a job opportunity.", "pics": null, "resp": {"time": 1576509812202, "text": "Thank you for the 5 stars Kristopher! We appreciate your kind words and wish you all the best with your new career home!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "108513801941494165709", "name": "Tracy Streete", "time": 1573019730088, "rating": 5.0, "text": "Everyone that I have come across at Snelling Services have really been amazing. These people are very helpful and understanding. Their staff works with individuals to match with positions that are hiring with good pay. I would recommend Snelling Services to anyone looking for transitioning into a new career field or enhancing skills they are ready have to offer employers.", "pics": null, "resp": {"time": 1573495886586, "text": "Thank you very much Tracy! We appreciate your kind words and the opportunity to work with you in your career search."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "106267668384665684976", "name": "T Rolle", "time": 1592949798277, "rating": 5.0, "text": "I love snelling they always have great jobs in my location everybody there is very professional and willing to help all around great group of people", "pics": null, "resp": {"time": 1594127866170, "text": "Thank you for the positive rating!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "107447917965263483455", "name": "Yolanda Marshall Nickerson", "time": 1569375245235, "rating": 5.0, "text": "Snelling is a great, professional staffing company. They have very professional and friendly employees. They will certainly help job seekers find a job in their field. I reached out to Stephanie Howard one day about an accounting opportunity and a few days later she had setup an interview for me with a great company. After my interview, Jamie Howard guided me through all the other steps until my start date, which was a little over a week later. I started working with the company at the end of June and I have now been offered a full-time position.  If you are seeking  a job in your field, give them a call. They will help you. I highly recommend this staffing agency.", "pics": null, "resp": {"time": 1569418834892, "text": "Yolanda, thank you for the great review.  You are truly a Staffing Success story, as we have worked with you several times over the last 19 years, from an entry level position to a professional/career level.  You made it happen!  We appreciate you, we congratulate you on being hired on perm and we wish you all the best."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "105100584429927096161", "name": "Tamesha C. Lyons", "time": 1572980969127, "rating": 5.0, "text": "Snelling is a great place to work, The staff is very professional and friendly. They will certainly help  find you a job in your field. Whittney Taylor and Stephanie Howard are wonderful. They answered all my questions and concerns. I would recommend anybody to Snelling.", "pics": null, "resp": {"time": 1573496084929, "text": "Tamesha, thank you very much for the review and for doing such a great job for our client company.  We look forward to you being hired on soon!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "102553720496821645652", "name": "Emily Overton", "time": 1568578979826, "rating": 5.0, "text": "I absolutely loved working with Snelling! They were very personable and helped me find work quickly. I worked with Jamie and Stephanie, and both were friendly and knowledgeable. Would definitely work with them again!", "pics": null, "resp": {"time": 1568639537064, "text": "Thank you for the review Emily.  We appreciate you handling a temporary position while interviewing for our temp-to-hire opening and congratulate you on being offered the job so quickly.  We know you will be an asset to their team!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "113811911453009882512", "name": "Sean George", "time": 1600714452404, "rating": 1.0, "text": "They give u a job saying forklift , you’ve been driving forklift for years however u get there it’s not forklift , with no promise of forklift , u walk off the job because u feel lied to or looked over , they call you to terminate you for walking off the site where they Just randomly sent you, you write a review at your New ACTUAL forklift job on break  ☺️", "pics": null, "resp": {"time": 1601908327109, "text": "Sean, you do have great skills and the Production/Warehouse position you accepted in July would have included forklift after a reasonable introductory/probationary period.  We had no choice but to terminate our relationship when you walked off the job within 30 minutes on your first day without contacting us beforehand to discuss your concerns.  If we had been able to talk with you we could have let the client know it wasn’t a good fit and still look for additional opportunities for you.  We wish you all the best in your future endeavors."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "102027652471321450960", "name": "L M", "time": 1537031403156, "rating": 5.0, "text": "Jamie, as well as ALL THE STAFF, at Snelling in Birmingham has been so wonderful to work with! Within only two weeks of my previous job ending, I had an interview with an amazing company in Birmingham and started work on a temp-to perm position JUST THREE DAYS after my interview. I will soon become a full time employee with this company and I am extremely grateful for this opportunity!  Jamie and the Snelling staff really care about the candidates they work with and know how important it is to match a person with the right skill set required for the right position for them. I absolutely LOVE the company I started working for and they LOVE me and the skill set I brought to the table to be an asset to the company for years to come! I am so grateful for the opportunity to work with Snelling and that they were able to find me the perfect job!!! Snelling and ALL the staff in Birmingham definitely receive a FIVE STAR RATING from me!!! God Bless You all and keep helping people achieve their career goals!!!", "pics": null, "resp": {"time": 1537190734528, "text": "Thank you Lisa, for the 5 stars and wonderful review.  We love hearing about your positive experience and job placement.  Best wishes in your new position!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "100873453001059253512", "name": "Terrie Davis", "time": 1575996979640, "rating": 5.0, "text": "The staff was knowledgeable and friendly.  My emails and phone calls were answered promptly.  Best of all I landed a job!", "pics": null, "resp": {"time": 1575999813495, "text": "Thank you Terrie! We wish you all the best in your new position and appreciate the opportunity to work with you!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "103654523272048646587", "name": "Andrea Hall", "time": 1564614834202, "rating": 5.0, "text": "Snelling has REALLY helped to change my life!! I longed for a career change and change of paste, after 12 long years in education. After only a week of working with Snelling, I was hired on at a very reputable company, doing what I REALLY wanted to do. They even negotiated my pay to be $2 more than offered. That entire team ROCKS, especially Jamie, so you owe it to yourself to give them a try. You will be glad you did!! Thank you, Snelling!!!", "pics": null, "resp": {"time": 1565024189853, "text": "Andrea, thank you for the 5 star review!  It was our pleasure working with you, and we LOVE that you interviewed for a temp-to-hire position but ended up being hired directly because you are such an amazing candidate!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "109295348624790268679", "name": "Shayla Dixon", "time": 1586415555064, "rating": 5.0, "text": "I have only been with Snelling services for 2 years, but I consider them a great company! When I was seeking employment change, this was my first time using a Temp service, but Stephanie and Whittney was very helpful, professional, and polite. They worked diligently to find me a placement job opportunity that would accommodate my needs, experience, and skills. Whittney kept  me updated on job openings that I was considered for from the employer.  Stephanie, Whittney, Jodi, and Jamie are always open to answer any of my questions or concerns or Ms. Whittney check on me time to time through email or by phone to see how things are going. I recommend this employment service! Everyone Be Encouraged!!!💌❣️❣️❣️", "pics": null, "resp": {"time": 1589828789646, "text": "Shayla, thank you for your positive review and the encouraging words.  We appreciate all of YOUR hard work, it's been such a pleasure working with you!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "111498263156027504262", "name": "Phil Fleming", "time": 1584927551666, "rating": 5.0, "text": "I was Snelling's first temp. They placed me with the local arts council. I loved that job!", "pics": null, "resp": {"time": 1589829028832, "text": "Thank you, we're so glad you were pleased!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "101597117635874235108", "name": "Brandy James", "time": 1566470928107, "rating": 5.0, "text": "Snelling services is super professional! They matched me with a job that fits my skills. Jamie and Whitney are so patient and helpful.  I would definitely refer and recommend any one  to Snelling", "pics": null, "resp": {"time": 1566830957121, "text": "Thank you for the review Brandy.  It's been a pleasure working with you through interviews for various positions and we appreciate your hard work with our client!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "104842261483695787555", "name": "Randy Neville", "time": 1584740144130, "rating": 5.0, "text": "I have gotten two good jobs from Snelling and first one was ten years ago with Brasfield&Gorrie and 1 year ago wih Housing Authority Birmingham Division still there and well satisfied with Snellings placement ability", "pics": null, "resp": {"time": 1589828864838, "text": "Thank you Randy!  We appreciate the opportunity to work with you over the years!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "115408985113797903841", "name": "Meaghen McCracken", "time": 1509127226264, "rating": 5.0, "text": "I worked with Jamie and was able to find a job and be hired on within a week! I had been searching on my own for almost 3 months and Jamie found the perfect fit for me! I have sense been hired on in a permanent position and love the company and the job.\n\nSnelling is extremely helpful and makes sure to pay attention to your skills and interest when placing  you in a job. They do give you the option to have insurance while temporarily employed through them and that is awesome! I highly recommend Jamie and the staff at Snelling if you're on the job hunt.", "pics": null, "resp": {"time": 1594927513516, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "117000025055970462415", "name": "Jerramies Linson", "time": 1576650357076, "rating": 5.0, "text": "I am happy to say that my experience with Snelling was great! Whittney Taylor and staff did an excellent job.", "pics": null, "resp": {"time": 1577129762042, "text": "Thank you for the review Jerramies and congratulations on your direct hire job offer.  We appreciate the opportunity to assist and wish you all the best in your new role!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "114409726355289061830", "name": "Angela Yager", "time": 1552445558738, "rating": 3.0, "text": "As far as a Staffing Company Snelling found me temporary employment quicker than any other agency. Within 2 weeks of interview Lindsey had me an assignment. However I know noone is perfect but I definitely saw a few negatives come up that concerned me that wasn't acceptable treatment to an employee. Hopefully they can nip them in the bud so they can give more opportunities to others. We learn as we grow.", "pics": null, "resp": {"time": 1552930580364, "text": "Angela, thank you for the review and opportunity to address your concerns.  We will be reaching out to you to speak directly about your experience."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "107272646024221599838", "name": "Lisa Johnson", "time": 1584749318591, "rating": 5.0, "text": "Super company to work for everyone in the office so professional. I been with them for2years and it's been a great experience", "pics": null, "resp": {"time": 1589828964120, "text": "Thank you Lisa, you have been one of our \"super star\" employees and we appreciate you, and your positive review so much!  Your professionalism, responsiveness, reliability and experience have been such a blessing to us and our client companies."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "118416506912586862945", "name": "Kelly Davies", "time": 1547140023375, "rating": 5.0, "text": "Snelling is the best Company I have ever worked for. I Worked for them in Nashville and In Birmingham and always have had wonderful experiences with them. Jamie and Stephanie Howard have been so helpful and pleasant to work with, and found me the job I was looking for within days! I will always use Snelling as my go-to staffing agency!", "pics": null, "resp": {"time": 1547473578088, "text": "Thank you very much Kelly, it’s been a pleasure working with you!  Congratulations on being hired on by our client company.  We wish you all the very best!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "111231707962724592465", "name": "Clayton Towns", "time": 1560722387041, "rating": 5.0, "text": "Snelling is a GREAT staffing company. Professional office environment, friendly staff, straightforward application process, fast drug screen (not driving to LabCorp and waiting five business days), and that’s who got me hired at my job. I worked with Jamie Howard and Lindsey Rumph. They took a good look at my resume and tried to fit me with what I wanted to do, not just what I have done. They offer direct deposit, you get paid every week, and you can always contact a real person at the office. No complaints here. 😊", "pics": null, "resp": {"time": 1560787341417, "text": "Clayton, we appreciate your 5 star review and thoughtful comments.  Thank you for doing such a great job and congratulations on being hired by our client!  It's been a pleasure working with you and we wish you much success in your career."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "107197869611573663635", "name": "Kyra Lanese (keepitpeachyyy)", "time": 1575660574675, "rating": 1.0, "text": "whoever y’all have answering the phone is terrible. y’all need someone with better customer service than that! 👎🏾 cus she doesn’t have any good customer service.", "pics": null, "resp": {"time": 1594128587264, "text": "I am so sorry you felt that way, thanks for your feedback."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "106289938472597668072", "name": "Lauren Kolmin", "time": 1534886350251, "rating": 5.0, "text": "After working with another company in town, I had a bad feeling bout all staffing services; however, Snelling has completely changed that.  Everything from their receptionist to the staffing team are incredible.  They're friendly, cooperative, and they stay in touch with you regarding positions.  I would definitely use them in the future and refer my friends to them!", "pics": null, "resp": {"time": 1534946430641, "text": "Thank you very much, Lauren, it was a pleasure working with you and we appreciate any referrals!  Best wishes always!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "105177598837917596552", "name": "Nimitz 17", "time": 1589681272227, "rating": 1.0, "text": "I agreed with Snelling to take a 2nd shift position. After a few months on the job I was then told I was being moved to 3rd shift by the company. And it was a “You get off when the job is done.” position. I called and talked with Snelling about the change that I didn’t want. I was then told to try and stick with it. If I didn’t like it then I’d have to give a week notice before I quit, they wouldn’t look for me something else till I quit, and there was no guarantee’s for another job position. Basically I’d have to risk being unemployed for weeks, possibly months. The fact that this was originally described as a 2nd shift position clearly didn’t matter. If temps are expected to keep their word. The same should be expected from their clients.\n\nEdit: I told you’ll they changed my shift. And y’all refuse to even look for anything till I quit. So If you really meant “By all mean” you would have found me something before I quit. After all they didn’t keep their word. Instead im told that I needed to quit first. Another false statement. Y’all have shown more then ones that it’s all about the companies y’all send temps to. Y'all will have another temp lined up and ready to replace anybody the next day. But if the TEMP is done wrong y’all refuse to be so accommodating. The temp just gets the work or unemployment options. By all means? Yeah right!", "pics": null, "resp": {"time": 1575323136596, "text": "We understand your frustration and would like to talk with you further.  We work hard to find the right fit for our candidates and clients.  If the client changed the shift then, by all means, we want to try and help you find something that will work better.  Please call our office again to speak with your recruiter or a Manager about the situation.  We appreciate the opportunity to improve our service and response.\n\nEdit: While we can't change what happened or what was said by a particular team member, our team is still interested in speaking with you directly about the situation and trying to assist you.  Please contact a Snelling Manager at 205-879-9950."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "105126119822047886523", "name": "Jarrod Clark", "time": 1560299891779, "rating": 5.0, "text": "Great staffing service. Julie found me a job in a little over one week. Thanks to the whole team at Snelling for their friendly and courteous service.", "pics": null, "resp": {"time": 1560787148124, "text": "Thank you for the 5 start review Jarrod!  Jamie and our entire team have enjoyed working with you and wish you all the best in your new position."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "108589261443681557792", "name": "Kenny Stinnett", "time": 1536759092108, "rating": 5.0, "text": "I had a great experience working with Elise Frey at Snelling Birmingham - Within 2 weeks of meeting Elise, I started a series of interviews that concluded with a new full time position working in E-Commerce, which is my field of expertise.   Elise is a dynamic and connected person in the Southeastern US Professional Recruiting Space with a focus on the Birmingham Market. 5 Stars for Elise Frey and Snelling Birmingham !", "pics": null, "resp": {"time": 1536773486764, "text": "Thank you for the great review.  We appreciate the opportunity to assist with your career search and wish you all the best in your new position!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "103627658980000963570", "name": "Jabria Kidd", "time": 1554477290412, "rating": 5.0, "text": "Snelling is absolutely wonderful. I never went through a Temp service before and they place me with a job in less than a week. I love their friendly staff and they are truly a team.", "pics": null, "resp": {"time": 1555334035826, "text": "Thank you for the 5 star rating, Jabria! We appreciate the opportunity to work with you and wish you all the best in your position."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "104177034278584769815", "name": "Bryan Allen", "time": 1565748720101, "rating": 1.0, "text": "Pay close attention,  a large variety of these reviews are probably false.  My experience with every person I have spoken with, lies ALL lies.  If you have time you would absolutely love it if someone wasted it for you....Snelling is your place,  they will do JUST that", "pics": null, "resp": {"time": 1566831317515, "text": "We left a message two weeks ago to learn more about your experience.  Please contact our office at 879-9950 to speak with a manager"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "100878741375934036829", "name": "Amanda Dugger", "time": 1508170194239, "rating": 5.0, "text": "I worked with Stephanie from the beginning and I have been so pleased with her and with Snelling. I went on a interview with a company and got a call back the next week and I have been working there since Dec 13, 2016. I am now permanently on staff with my company and I love it. Stephanie made a perfect fit for me when I was looking for employment.  Thank you to all your hard work looking and I will refer anyone to you guys.", "pics": null, "resp": {"time": 1594927521754, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "113378815138354291018", "name": "Tracina McCoy", "time": 1538503893002, "rating": 5.0, "text": "This was my first time using a temp agency to help me find employment. I was hesitant at first but the ladies at Snelling really made this an awesome experience. Thanks to Lindsey for being so prompt with whatever questions or concerns I may have had. The entire staff made me feel very comfortable. I highly recommend using SNELLING for employment opportunities!", "pics": null, "resp": {"time": 1538508724075, "text": "Thank you for your kind words and for doing such a great job for our clients.  We appreciate you very much!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "103806176411279436365", "name": "Denisha Witherspoon", "time": 1555435921540, "rating": 5.0, "text": "At first, I was a little reluctant to apply with them, because of the bad experiences I've had with other Temporary Staffing Agencies. I'm so happy I went to interview with Mrs. Lindsey Rumph at Snelling. This was the first ever staffing agency that , when I walked through the door, the vibe was different. Calming atmosphere and inviting employees. Mrs. Rumph asked questions about myself and my work history to place me in the greatest company I've ever worked for. My position was temp to perm and a short time after starting, I am now in transition to be hired on with a company I love so much. If you've had bad experiences with other staffing agencies, I urge you to give Snelling a chance. They changed my life. I'm forever grateful to them for placing me with the best company I've ever worked for.", "pics": null, "resp": {"time": 1555945376145, "text": "Denisha, thank you for the kind words and 5 star review!  You've been amazing to work with and we are so happy you are getting hired on!  Lindsey and our entire team wishes you all the very best!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "100357869991975112483", "name": "jeralyn marks", "time": 1612564647775, "rating": 5.0, "text": "Family oriented", "pics": null, "resp": {"time": 1612815078284, "text": "Jeralyn, thank you so much for your five-star review, and thanks we like to keep it that way!!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "116858454106829671099", "name": "Bruce Burson", "time": 1445273940684, "rating": 4.0, "text": "I am retired and have worked on several temporary assignments through Snelling. It has been an interesting and rewarding experience in a variety of settings. They take the time to make sure the assignments are a good fit for my skills and interests. They stay in touch during the assignments to answer any questions or address any concerns that come up. They are always very professional and they want each assignment to be the best both for me and for the client company. Online time reporting makes it easy to log my time and they never fail to get the necessary client approvals so that I get paid accurately and on time. I recommend Snelling to any retiree who is looking for temporary jobs to keep you busy and bring in a little extra income.", "pics": null, "resp": null, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "108533235017744062060", "name": "Bianca Mireles", "time": 1522798378522, "rating": 5.0, "text": "I went to Snelling and worked with Lindsey Rumph and she found me a job that perfectly suited my skill set. She took the time to get to know me, my interests, passions, and educational background. I’m new to Alabama so was very afraid to not find a suitable job. Lindsey helped me w her networking and I’m so grateful! I recommend Snelling to anyone and everyone !", "pics": null, "resp": {"time": 1594927418493, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "116858454106829671099", "name": "Bruce Burson", "time": 1445273940684, "rating": 4.0, "text": "I am retired and have worked on several temporary assignments through Snelling. It has been an interesting and rewarding experience in a variety of settings. They take the time to make sure the assignments are a good fit for my skills and interests. They stay in touch during the assignments to answer any questions or address any concerns that come up. They are always very professional and they want each assignment to be the best both for me and for the client company. Online time reporting makes it easy to log my time and they never fail to get the necessary client approvals so that I get paid accurately and on time. I recommend Snelling to any retiree who is looking for temporary jobs to keep you busy and bring in a little extra income.", "pics": null, "resp": null, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "108766359119457875890", "name": "Kelsie Sapp", "time": 1468102121965, "rating": 5.0, "text": "Snelling was the best recruitment service I have used. I had a specific position in mind which they helped me to apply for, and they were extremely helpful through the whole process. I got great and honest advice, and most importantly they were very good in communicating with me and the company I was applying with. I ended up getting the job I applied for through Snelling and I'm very grateful for their help.", "pics": null, "resp": {"time": 1594927675184, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "111166793696257248739", "name": "cathy crider", "time": 1528744736121, "rating": 5.0, "text": "Great group to work with...Jamie and Stephanie placed me  on a temp position and at end of my 90 days I was offered a permanent position.  Honest and dedicated!", "pics": null, "resp": {"time": 1529933588682, "text": "Thank you for the kind review.  It was a pleasure working with you and we wish you all the best in your new position!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "103874229412731833862", "name": "Justin Wisener", "time": 1445010703327, "rating": 5.0, "text": "I went into the office and registered one day, and the very next day they already had an assignment for me. After I completed that first assignment, they checked with me to make sure that I had a positive experience, and 3 days later they already had another assignment for me. These first two assignments that I've had so far have been perfect fits for my qualifications and temp work desires, and the pay has been reasonable for the type of work that I've been doing.\n\nThey also have done an excellent job of making themselves available to me to answer any questions that I may have, whether about their policies or about a specific assignment. They are always friendly and professional, and they maintain contact during assignments to verify that the assignment is a good fit for all parties involved.\n\nI have had two temporary assignments so far: one as a switchboard operator, and the other as a courier. Both have been great fits for me. I have been primarily working with Sylinda so far, and she was the one to find those assignments for me. I highly recommend her.\n\nI believe that if you exhibit professionalism and an eagerness to work, Snelling will work hard to find good work for you. Based on my experience, I feel 100% confident recommending Snelling, especially if you are looking for temporary administrative assignments.", "pics": null, "resp": {"time": 1594927657451, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "106525490261709995244", "name": "Trace Rudolph", "time": 1539629048612, "rating": 5.0, "text": "I had a great experience with Snelling. Colter was very helpful and attentive and he was always quick to respond when we were communicating through email. Colter guided me through every step of the process of applying for a new job and provided excellent advice whenever I needed it. Everything went smoothly and now I'm eagerly awaiting to start my new job.", "pics": null, "resp": {"time": 1539782929500, "text": "We appreciate the opportunity to assist with your career search and wish you all the best in your new position!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "109322556194093692325", "name": "Mike Rovnak", "time": 1444925281471, "rating": 5.0, "text": "I first contacted Snelling to see if they could assist with my job search after relocating from out of state. They followed up with me immediately and invited me into their office. I quickly developed a relationship with the staff and was offered an internal position. This is a wonderful office with a family oriented staff. Snelling is an exceptional employer and I am thankful to be a part of the team.", "pics": null, "resp": {"time": 1594927707897, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "106397431971646871658", "name": "Lindsey Adcox", "time": 1445009851360, "rating": 5.0, "text": "I used Snelling Staffing Services 3 years ago. Everyone at Snelling was extremely nice and very professional. In less than a week, Snelling found the perfect career fit for me. I am still with my placement company today, and I have been promoted twice. I highly recommend Snelling Staffing Services. Thanks Snelling!", "pics": null, "resp": null, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "109501193427608407740", "name": "Jessi Nystrom", "time": 1444941512425, "rating": 5.0, "text": "I've had the privilege of running into a few Snelling employees at networking events, and this company has some of the most professional, generous, intelligent employees I've ever met. They're always willing to help others out in any way that they can, and I absolutely enjoy being around them. Do not hesitate to call these guys! They will absolutely take care of you (especially Michael Rovnak). =)", "pics": null, "resp": {"time": 1594927638419, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "112997814422162124618", "name": "Uri Nystrom", "time": 1505324111006, "rating": 5.0, "text": "While I didn't get a job with them they were very eager to help. They let me know up front that they didn't get a lot of jobs in my field but they never quit looking. They were always very quick to follow up with my emails and calls.", "pics": null, "resp": {"time": 1594927487262, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "105637553359300060078", "name": "Christina Brown", "time": 1445371739301, "rating": 5.0, "text": "I moved here from Georgia and was looking for a job. I had registered with one of those \"other\" staffing agencies and they just didn't do anything. I contacted Snelling  and Sylinda Daniel and Stephanie Howard helped me to work for a wonderful company where I have been hired full time. The staff was courteous and helpful. I would recommend Snelling to anyone.", "pics": null, "resp": {"time": 1594927679650, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "116985134078351622640", "name": "Office Environments", "time": 1445279872374, "rating": 5.0, "text": "We have been working with Snelling for 5 years now.  We are really satisfied with the quality of people that they provide us.  Sylinda Daniel does a great job finding just the right person for our needs.  Thank you Snelling for always providing us with professional and qualified employees!", "pics": null, "resp": {"time": 1594927663919, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "102633105624105290593", "name": "Brice Jackson", "time": 1515766709023, "rating": 5.0, "text": "My wife used Snelling several years back to find a temporary position at a great local company when she had had a baby and she needed to transition from a full time to part time position for a while. Thank you, Snelling, for being there for her in her time of need!", "pics": null, "resp": {"time": 1594927449834, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "102495393899703075414", "name": "Addicted 2Youtube", "time": 1483475337470, "rating": 5.0, "text": "Best Temp Agency I've ever worked for.\nFast responses, well paying jobs, And a Great Staff. Did I mention the fast responses? Most importantly they do respond.", "pics": null, "resp": {"time": 1594927536799, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "107538699543207321900", "name": "Debbie Reinagel", "time": 1520117050670, "rating": 5.0, "text": "Jamie did a great job finding a good match for me. Highly Recommend.", "pics": null, "resp": {"time": 1594927435598, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "100157610587790182841", "name": "Melissa Bell", "time": 1445008894346, "rating": 5.0, "text": "I absolutely loved working with Snelling Staffing Services. Mike Rovnak did a wonderful job at helping me get an awesome position at a wonderful company. Very thankful for him and Snelling!", "pics": null, "resp": {"time": 1594927653684, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "113092005590335354004", "name": "Gabriel Morgan", "time": 1559735052352, "rating": 5.0, "text": "The are a wonderful company they took their time and listen to what I was looking for in no time they were able to find me a job. I would recommend them 100%", "pics": null, "resp": {"time": 1560170889870, "text": "Gabriel, thanks so much for the 5 star review and comments!  We are so glad the position you accepted is working out so well and know you will enjoy a long and successful career with our client."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "100350830607233301643", "name": "lakecia evans", "time": 1537127388629, "rating": 5.0, "text": "I was laid off at my last job. I filled out an application for snelling and the next day I recieved a call for a job. I have been working constantly for 10 months with them. I love the relationship they have with their clients. They check on you and make sure you are  doing ok while you out on assignment. I recommend them highly.", "pics": null, "resp": {"time": 1537191742129, "text": "Lakecia, thank YOU for your efforts on our behalf and for doing such a great job on your long term assignments.   We appreciate your professionalism, work ethic and great attitude.  It’s been a pleasure working with you!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "109021468220497961929", "name": "Mariah Hunter", "time": 1566222531382, "rating": 1.0, "text": "I was contacted for an \" Interview\" for a job I applied for on indeed. When I got there  it was not an interview just a meeting to get me in the system . It was a waste of time for me. If I had known that the jobs they post were just click baites,  I never would've applied.  Also  whenever I call to see what's available  I get brushed off.", "pics": null, "resp": {"time": 1566831614153, "text": "Mariah, we left a message to discuss your experience with Snelling.  We only post ads for active, open positions but the status changes by the hour.  We do meet personally with our candidates as a first step in the process.  We submitted you to our client opening on the same day you came in and are happy to look for additional opportunities for you. Please return our call to talk further."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "108304203592958506439", "name": "Wantanee Ware", "time": 1543332213705, "rating": 5.0, "text": "I was looki for work. I've actually done numbers applications, Snelling save me and put me to work ASAP. Great company.", "pics": null, "resp": {"time": 1543334460106, "text": "Thank You Wantanee. We appreciate the 5 star review."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "110844476878673977586", "name": "Erica Kuykendall", "time": 1499471256728, "rating": 5.0, "text": "I am so grateful for Stephanie and Colter for helping me find the perfect job that suits me!!! Hopefully I will never need their staffing services again but I will definitely refer every person I meet that needs a job to them!", "pics": null, "resp": {"time": 1594927552575, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "105074099827135146099", "name": "Anne Hibberts", "time": 1444942054068, "rating": 5.0, "text": "In September 2014, I contacted Snelling Staffing Services for job assistances.  Within a couple of days, I was working.  While working for Snelling on short term assignments; Snelling was working  setting up interviews for me with upstanding companies around the Birmingham, Alabama, for permanent placement.  In addition, Snelling assisted with my resume updates, tips for interviewing techniques, and preparation for pursuing career opportunities.  One of their specialties is providing good match for both their Client, the employers, and their employees.  Today, I am still working for Snelling Staffing Services.  I am honored to represent them while working on assignments.  Clearly, I would recommend Snelling Staffing Services as an up scale company in employment coaching, placement services; whether as a company looking for qualified employees or employees looking for short or long term assignments.  Lastly, I would like to take this opportunity to say \"Thank You\" to Stephanie Howard and Sylinda Daniel and the entire staff at Snelling Staffing Services for demonstrating stellar service.", "pics": null, "resp": {"time": 1594927644365, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "108279967400240452176", "name": "Scott DeFlora", "time": 1445297349270, "rating": 4.0, "text": "The times that i have used Snelling for my staffing needs, my experience has been good and the candidates they have provided were of a high quality. I have had a good experience with Snelling and my recruiter Michael Rovnak has been very helpful when those situations arise and i need a quality candidate who is badgable.", "pics": null, "resp": {"time": 1594927669686, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "113141627294725296875", "name": "Champion Chapman", "time": 1501095550428, "rating": 5.0, "text": "They helped me find employment the same day I interviewed and they provide you with insurance.", "pics": null, "resp": {"time": 1594927477825, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "114111028992921828103", "name": "Krystle Macklin", "time": 1512589268600, "rating": 5.0, "text": "From the first moment I spoke with Colter we were on the same page. He understood my current/previous experience and inquired where I desired to be to grow my skills in order to place me with the perfect employer and he did just that! I would 100% recommend Colter, and the Snelling company in general to anyone who is searching for the right position in the job market. He was my eyes and ears and really worked for me on my behalf. Job searching can be very intimidating but Colter made the process so easy. I've been in the workforce for many years and I have never been happier with an employer.", "pics": null, "resp": {"time": 1594927505692, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "114037364963854339980", "name": "Kalyn Huguley", "time": 1445612941985, "rating": 5.0, "text": "The staff at Snelling are so helpful and polite! They helped me get the best job I've ever had!", "pics": null, "resp": {"time": 1594927561867, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "116701406620905436729", "name": "Tiera Harper", "time": 1549407706897, "rating": 5.0, "text": "Best Temp service I've been to!!!", "pics": null, "resp": {"time": 1551811952949, "text": "Thank you for the five star review, we appreciate the opportunity to work with you!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "112335582368672218094", "name": "Cordel Feaster", "time": 1496345856519, "rating": 5.0, "text": "Best jobs! Always looking for a job in your field.", "pics": null, "resp": {"time": 1594927548135, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "108374444820465393321", "name": "Joe Doe", "time": 1439837072438, "rating": 1.0, "text": "I do not recommend Snelling or Elise Frey. It is a highly unprofessional and unorganized staffing agency. If you do not wish to be hired with a company, use Snelling; otherwise, there are many better options for staffing agencies.", "pics": null, "resp": null, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "105933276905541719337", "name": "Len Snow", "time": 1546875083240, "rating": 2.0, "text": "I Been Called To Come In For No Reason To Sign Up For Somebody Else To Get Paid But I Haven't Stoll Yet To Get Called For A Job An I Been Signed up For Snelling For A Month Now Call Every Week An The Holidays Are Over An I Still Haven't Got A Call This Sucks", "pics": null, "resp": null, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "112323371248358521792", "name": "Goaty Methodz", "time": 1562689083373, "rating": 1.0, "text": "They are rude I wouldn't recommend it to anyone", "pics": null, "resp": {"time": 1563279159844, "text": "We are sorry to hear you've had a negative experience with our office.  Please call 205.879.9950 to speak with a manager.  We would greatly appreciate the opportunity to learn about your situation."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "102738313188151352891", "name": "Justin B. (MrRasberryJamm)", "time": 1500566985805, "rating": 5.0, "text": "Staffing agency that will that takes finding you a job seriously they work with more employers than most temp services", "pics": null, "resp": {"time": 1594927469939, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "108935478749916451503", "name": "Davis Starsha", "time": 1620057820267, "rating": 5.0, "text": "EVERYONE IS AWESOME AND PROFESSIONAL ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "pics": null, "resp": {"time": 1620058660925, "text": "Thanks so much for your five star review, and congratulations on your new job!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "100693951934261180051", "name": "UloveStepphanie", "time": 1523555365615, "rating": 1.0, "text": "Interviewed with Jamie in February 2018. It’s April, still no call or job. Complete waste of time.", "pics": null, "resp": {"time": 1523893219212, "text": "We regret we haven’t had any client opportunities for you yet.  While our services are free and we can never guarantee a match we always encourage our candidates to reach out to our office on a weekly basis to stay active in our system.  We get new jobs and candidates in every day so it’s important to stay “top of mind”.  Call or email us soon and we’ll be happy to look at our current openings for you."}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "104456076564552050708", "name": "Micheal Vandergrift", "time": 1483564141451, "rating": 5.0, "text": "Very  professional", "pics": null, "resp": {"time": 1594927544530, "text": "Thanks for your review and thanks for using Snelling!"}, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
{"user_id": "104608031442378770212", "name": "David Carter", "time": 1453991968800, "rating": 1.0, "text": "They don't like to pay you on time", "pics": null, "resp": null, "gmap_id": "0x8889197bc2c34c5b:0x38fc58db6080a26b"}
