{"user_id": "101729925689789988442", "name": "richard church", "time": 1627501520492, "rating": 5.0, "text": "The people at Fast Signs have always been professional and very freindly to deal with. They kept me informed about my order and it arrived on time and everything looked great.", "pics": null, "resp": {"time": 1627562199424, "text": "Thank you Richard for taking the time to do a google review on FASTSIGNS of Tuscaloosa.  We are so happy to see you satisfied with the customer service you received from us."}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "111356726377936706687", "name": "SAVED BY GRACE MINISTRY", "time": 1625169927734, "rating": 5.0, "text": "Professional environment, prompt sevice & quality work.. Happy Customer!!", "pics": null, "resp": {"time": 1625601215443, "text": "We love___Happy Customers!  Thank you for your rating and the kind words. We will continue to work hard to make each customer happy."}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "110974208298260772499", "name": "Nita Hallman", "time": 1603812651535, "rating": 5.0, "text": "This is the second time we have worked with FastSigns. Our experience the first time was positive and easy and the results were just as we hoped. The staff is always helpful and patient in working through creating the perfect sign. We would highly recommend them for your company's signage!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMd1hVaGZUYBAc5JYY8lqohtyWvmRn5XSLRociq=w150-h150-k-no-p"]}], "resp": {"time": 1606145077802, "text": "Thank you Nita and Grace Church for letting us work with you on your new window graphics.  We appreciate your rating and business."}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "110204470745875355324", "name": "Destini Reed", "time": 1595024429330, "rating": 5.0, "text": "FastSigns does a wonderful job! They have done various types of signage for my husband's business, the elementary school I work for, my father's company, and they created our new subdivision sign! Our salesperson, Cody, is fantastic and will go above and beyond to make sure you're satisfied with your product and design. Highly recommend!", "pics": null, "resp": {"time": 1595345127174, "text": "Thank you so much Destini for taking the time to rate us.  We appreciate your kind words and you allowing us to serve your visual communication needs."}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "111014917234772322341", "name": "Jay Young", "time": 1595438615222, "rating": 5.0, "text": "These guys are super easy to work with and get things done.  We've worked on several projects and they have all been a success!  THANK YOU FAST SIGNS!", "pics": null, "resp": {"time": 1610473894215, "text": "Thank you Jay for working with us on your signage needs.  We are so glad you are our customer."}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "104254049746202255291", "name": "Roni Knight", "time": 1587581699072, "rating": 5.0, "text": "This crew is outstanding and eager to please.  They are fast and efficient and I really enjoyed working with them.  If you are not satisfied with the proof they give you, they modify and get it right back.  Highly recommended!!!", "pics": null, "resp": {"time": 1588968565825, "text": "Thank you so much for allowing us to work with you on your visual graphic needs.  We are so glad you had a great experience with us!  Thank you again !"}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "114036734306192402755", "name": "Lori Toxey", "time": 1602561265768, "rating": 5.0, "text": "Fast signs was great to work with. They were very responsive and informative during the entire process. Lori Toxey, Spaces Management", "pics": null, "resp": {"time": 1622740668626, "text": "Hello Lori,\nWow, it sounds like you had a great experience with FASTSIGNS of Tuscaloosa.\nThanks for taking the time to share your feedback with us.  It means so much when our best customers share their experiences.  We want to be the best sign company in Tuscaloosa and we appreciate your support.\nI’m glad we were able to meet your expectations!\nBest,\nMilton"}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "105439188791000496039", "name": "AHP Tuscaloosa", "time": 1601325232569, "rating": 5.0, "text": "The entire staff was friendly and helpful. The services they provided were prompt as well as reasonably priced.", "pics": null, "resp": {"time": 1610472558990, "text": "Thank you AHP for doing business we FASTSIGNS! We appreciate you!"}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "102647837544383993016", "name": "Ronika Amerson", "time": 1601062409855, "rating": 5.0, "text": "Excellent quality materials, great customer service, and the manager goes far and beyond to make the experience more perfect!", "pics": null, "resp": {"time": 1610472704760, "text": "Thank you Ronika for rating us and allowing us to work with you on your signage needs!"}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "115283565940735547089", "name": "Kelly Bonner", "time": 1601649453791, "rating": 5.0, "text": "FASTSIGNS was very easy to work with and the turn around for my product was fast. We will use them again!", "pics": null, "resp": {"time": 1610472496684, "text": "Thank you Kelly for working with us on your visual graphic needs.  We are so glad you were satisfied with your product."}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "101010854267038129998", "name": "dianne Little", "time": 1600273734154, "rating": 5.0, "text": "They did a great job on a tight timeline.  Thanks guys!", "pics": null, "resp": {"time": 1610472824176, "text": "We are so glad we could be helpful and assist you!  Thanks for choosing to do business with us."}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "111738256101619736239", "name": "SHELLY MAYO-MITCHELL", "time": 1534700343776, "rating": 5.0, "text": "Great experience so far!  Meghan is super, always responds quickly and available for questions!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMdaILctt7xlgOFdVWyTCoSmtoDq6oqEp5CCZTA=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "114532134513078266905", "name": "Gailyn Terkelsen", "time": 1587386257520, "rating": 5.0, "text": "The team at FASTSIGNS of Tuscaloosa responded quickly to our request for two commercial monument sign face replacements that had to be created quickly and installed during a very small timeframe window. I was working with them from outside the area, and Wyndi Avery made it easy with excellent communication and information in a timely manner. The signs were reasonably priced, installed on time as promised, and look great. They even sent finished photos since I wasn't there to see them installed. Overall, an excellent experience.", "pics": null, "resp": {"time": 1588968612035, "text": "Thank you so much for your kind words and rating.  We always strive to make our customers happy with their visual graphics."}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "104805126045140590027", "name": "Lisa Tanner", "time": 1601101574434, "rating": 5.0, "text": "Friendly staff and hard work and dedication to make customers happy", "pics": null, "resp": {"time": 1610472605155, "text": "Lisa,  we appreciate you taking the time to rate us and for the kind words.  We hope to have an opportunity to work with you in the future."}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "118286155090016591967", "name": "Vicki Britt", "time": 1589838404530, "rating": 5.0, "text": "Gina and Cody were the bomb!  I had an urgent need for our Primary Care Practice due to the pandemic and they responded with quick and professional services.  Thanks for helping us out!", "pics": null, "resp": {"time": 1590156399028, "text": "Thank you so much Vicki for your kind words.  We are so glad we could be of assistance to you."}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "117395153433684822723", "name": "Mario Bueno", "time": 1622310387455, "rating": 5.0, "text": "Fastsigns has been a great allied in working through all of our COVID-19 corporate requirements, and bringing awareness with signage for our employees. Their great service provides us just what we need in a fast manner. Thank you.", "pics": null, "resp": {"time": 1625601273673, "text": "Thank you so much Mario. We are so happy to see our customers satisfied."}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "116385531531207291766", "name": "Michael Clark", "time": 1582129622176, "rating": 5.0, "text": "They do great work and they are very easy to work with. Milton and the entire staff are wonderful. I highly recommend Fastsigns.", "pics": null, "resp": {"time": 1584383249578, "text": "Michael,\n\nThank you for your kind words !  We truly desire to do a good job for our customers. Nothing is better than having a customer recommend you to others."}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "111910935153996995509", "name": "Stephen Mallory", "time": 1591710991950, "rating": 5.0, "text": "Wyndi and Milton were very professional and easy to work with. I look forward to working with their team on more projects in the future!", "pics": null, "resp": {"time": 1622740754079, "text": "Stephen, I’m happy you are pleased with your experience at FASTSIGNS of Tuscaloosa and that we were able to help.  If there is anything else we can do in the future, please let us know.\nBest,\nMilton"}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "114792039907931803338", "name": "Ashley Williams", "time": 1555340113372, "rating": 5.0, "text": "Milton and Wes spent a lot of time showing us their different products, giving us a tour of their print shop, and helping us optimize our visuals. We can't imagine the final product turning out any better! Our window displays have gotten so many compliments. We're so excited to continue working with FastSigns Tuscaloosa!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "111252983830714810592", "name": "Tony Brown", "time": 1559677367476, "rating": 5.0, "text": "Fastsigns has always given us the fast, personal, professional service we expect and desire. Great people w/ great products to meet any need. I would highly recommend calling Milton for any graphic need you may have!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "112942673163327634475", "name": "James Hollingshed", "time": 1571847130754, "rating": 5.0, "text": "Awesome job!!! The staff was friendly and quick t meet my needs.  I would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "102567330543675885929", "name": "Savalife Tuscaloosa", "time": 1569504580050, "rating": 5.0, "text": "Literally everyone we encountered was so friendly and helpful. I loved working with Cody. He was always smiling and encouraging us that we could get this done, as we closed in and kept adding more work for our deadline. We will resource them for our signs first thing every time. They are AWESOME!!   Sandi Horsley        Sav-A- Life Tuscaloosa", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "106343687365006489705", "name": "M Hogue", "time": 1581096789965, "rating": 5.0, "text": "Helpful staff. Easy to work with, especially for those new to the billboard experience.", "pics": null, "resp": {"time": 1627562251097, "text": "Thank you for taking the time to review us. We are glad that your experience was easy and helpful to you."}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "104231125052967391578", "name": "helmut jauk", "time": 1574439583427, "rating": 5.0, "text": "The quality of the product (banner) was very good.\nThe team was very helpful and flexible.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "102373790466184662140", "name": "Ellen Maxwell", "time": 1578858192355, "rating": 5.0, "text": "Fastsigns has always provided excellent quality and service!  They care about their customers and won't quit until you're 100% happy.", "pics": null, "resp": {"time": 1580490875408, "text": "Thank you Ellen for taking the time for completing a goggle review for FASTSIGNS.  We strive to provide excellent customer service each time.  We hope to have an opportunity to work with you again."}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "100345390733571266065", "name": "Kim Hyche", "time": 1571329511471, "rating": 5.0, "text": "Extremely friendly and helpful staff went above and beyond to ensure that we got exactly what we needed. Great experience!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "117508610019355496488", "name": "Courtney Patterson", "time": 1443111794673, "rating": 5.0, "text": "When my husband and I found out that our baby was to have a cranial band (or helmet) due to plagiocephaly, we immediately researched ways to decorate it. We were so happy to find somewhere local that could help us out! We were beyond blessed by our friends at FASTSIGNS in Tuscaloosa who made the process easy and enjoyable. They completed the design in just a few hours and treated us like family! Our baby is now a cool dude, rocking his football helmet! I highly recommend this company! 5 stars!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "110027727142687864993", "name": "Carlos Leach", "time": 1575908309126, "rating": 5.0, "text": "I have had over 5  work vehicles with my Business Logo  installed. Always Great  and Friendly Service..Carlos Owner of U-DECIDE SERVICES", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "100825485218800268200", "name": "Twyla Lochridge", "time": 1583340227304, "rating": 5.0, "text": "Worked with ya'll for years. Awesome work", "pics": null, "resp": {"time": 1584383163890, "text": "Thank you for taking the time to complete a google review on us. We appreciate your business."}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "102439424543086988146", "name": "edward vaughn", "time": 1480178741333, "rating": 5.0, "text": "They were very professional, super fast, and very easy to work with! Did a great job editing my original design and gave me different pricing and decal design options to consider and really worked with me to settle on the final design. Very happy with the final product and highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "112151281443970206319", "name": "Jeff Vail", "time": 1564760136461, "rating": 5.0, "text": "I appreciate all the effort these folk put in to make our project a success", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "106388387496309311191", "name": "Alison Hudnall", "time": 1519145246044, "rating": 5.0, "text": "Had a great experience with Fast Signs! Excellent workmanship and very helpful staff! I plan to give them my company's future business!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "107019181539350188531", "name": "Kelton Kite", "time": 1597942792102, "rating": 5.0, "text": "Amazing turn around  on last minute needs !", "pics": null, "resp": {"time": 1610472876951, "text": "FASTSIGNS thanks you for taking the time to rate us.  We appreciate the customers we get an opportunity to serve."}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "111035242138520316384", "name": "Logan Lundgren", "time": 1452997097201, "rating": 5.0, "text": "Used Fast Signs for a vinyl graphic being applied to a table.\nVery fast turnaround time, order was ready a day before the estimate I was given. Cheap, reliable, very high quality graphic and cut.\n\nWill be coming back in the future", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "102842953297169618368", "name": "Natalie R Vice", "time": 1523810883589, "rating": 5.0, "text": "These guys were great!  Fastest turnaround time I've ever seen!  Will definitely use them again!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "110713914279490635147", "name": "Tommie Andrews", "time": 1473703359495, "rating": 5.0, "text": "I am very appreciative of the wonderful job the friendly staff at FASTSIGNS, Tuscaloosa did. I would not hesitate to recommend them to anyone needed any type of service that they provide. They put our logo on both sides of our company truck. Awesome!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "118441031696454889438", "name": "Binion Creek Farm", "time": 1573679163090, "rating": 4.0, "text": "The sign that they made for me was High Quality.   Also, it didn’t take very long at all for them to Produce the Sign.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "108973685504278419492", "name": "Randy Lee", "time": 1572275071761, "rating": 5.0, "text": "great folks to deal with, on time and they do quality work", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "109397679892569729831", "name": "Debbie Rodgers", "time": 1512061440007, "rating": 5.0, "text": "We ordered the sign for our new business. We received the proof within 24 hours, I made a request and our sign was ready in no time! Very courteous and great communication.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "109794076535980137201", "name": "Alan Davis", "time": 1557763900261, "rating": 5.0, "text": "Fast turn on proof and approval process. Product delivered on time and exactly as ordered.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "106298425908630042699", "name": "Rob Moore", "time": 1494968508183, "rating": 5.0, "text": "Courteous and professional service!  Great ideas! Great designs and results!  Has the town buzzin' at our wrapped trucks!  They have done lots of other good work for us too!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "102557343674466829930", "name": "Wendy Collins", "time": 1571859081653, "rating": 5.0, "text": "Wyndi was very helpful, easy to work with, and very accommodating.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "107669860270964538531", "name": "Ginger Turner", "time": 1511954836388, "rating": 5.0, "text": "They were awesome! The signs were perfect and done very quickly! I will definitely use them again!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "114148999943601251520", "name": "I Williams", "time": 1448642275550, "rating": 5.0, "text": "Milton and his team provided phenomenal service!  They really helped me out when I needed a short turnaround on a display.  I would definitely recommend Fastsigns to anyone who needs a quality product and values superior service.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "108283477814103264946", "name": "Arash Arabi", "time": 1504554576939, "rating": 5.0, "text": "The staff at Fast Sign, specifically Wyndi Avery and Milton awesome!!!  They provide customer service that goes beyond exceptional and they assist you in building a brand for your business.  I went to see them for a design logo for my new medical practice having no clue what I wanted.  They worked intimately with me on the details and they then drafted various logos for my liking at a very reasonable cost.  They provided guidance and made recommendations on what type of signage would be noticeable without going over my budget.   Even when I pointed out mistakes or issues they corrected them with no arguing or hassle.\nThey have a genuine concern for their clients and their circumstances which I have witnessed on various occasions.  This is a character and quality rarely demonstrated in any profession today but it is a standard of their business and I commend them for their excellent customer service.  If you are looking to brand your business or to build your next signage for your business and if you want the best in customer service then go see Fast Sign and you will never regret it!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "109078336922401553221", "name": "Ward McFarland", "time": 1573144318699, "rating": 5.0, "text": "I've used them for several years. Very friendly and helpful staff, good work, and good price.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "104697244657038436492", "name": "Ozzy Doner", "time": 1539793712394, "rating": 5.0, "text": "Great service, very kind, fast and fair.I would do business here again and again.  And i met my ‘Fantasy girl’ there. Thank you guys.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "110753097519319798935", "name": "David Tubbs", "time": 1569428707449, "rating": 5.0, "text": "Great service, fast delivery, and quality work.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "108183636158391812488", "name": "Clint McEntyre", "time": 1501878882811, "rating": 5.0, "text": "The staff are knowledgable and easy to work with. Great turnaround time on design and production. I would definitely recommend them for small or large projects.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "108798872414062322703", "name": "Greg Yarber", "time": 1521031719580, "rating": 5.0, "text": "Friendly service, professional installation, and very talented design team. I definitely will be back. Thx for your service", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "100248431405170831410", "name": "Perry Nye", "time": 1436303804441, "rating": 5.0, "text": "Milton ans his staff were very easy to work with. They did everything they could to accommodate my schedule and get me taken care of.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "107745791502180978732", "name": "Emily Klinga", "time": 1463453349896, "rating": 5.0, "text": "Very friendly service! Also very patient with me when I needed more time with my payment. Very fast production after ordering!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "116447807008102602765", "name": "Kathryn Gage", "time": 1521562429123, "rating": 5.0, "text": "FastSigns is consistent, reliable, reasonably priced and always does great quality work. The customer service is amazing and they always get my projects completed in a professional and timely manner.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "115647166015332142716", "name": "Jessica Griffin", "time": 1533312575834, "rating": 5.0, "text": "Everyone is extremely nice! Our products are always completed quickly and look amazing!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "115332568729156911587", "name": "Heath Sides", "time": 1485882039823, "rating": 5.0, "text": "Great Company! You can count on these guys and gals to deliver quality work and in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "104877943979614501654", "name": "Bubba Goins", "time": 1558467342397, "rating": 5.0, "text": "Very professional. Great people to deal with.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "109963419392807576143", "name": "Regina Sharp", "time": 1540575665816, "rating": 5.0, "text": "Megan Galaviz was fabulous to work with! The customer service she provided was timely, professional and accommodating. She was more than patient with our many requests for demo logos and stressed above all she wanted us to be happy with the finished product. The finial product looks amazing!! We will definitely use FastSigns again soon! The installation process with Jason also went very well. He too was very patient with us while deciding on the exact placement level (moved it no less than 5 times). Jason installed two logos and worked well after 5:00 to finish the job. He cared about maintaining the workspace he was working with and took precaution to keep things clean when standing on countertops, etc. He was a pleasure to work with.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "111837040449138769569", "name": "Hotel Indigo Tuscaloosa Downtown", "time": 1508954569804, "rating": 5.0, "text": "The people we work with at FastSigns make every project a breeze from concept to installation. They have a unique ability to understand a vision and have executed every project we have given them beyond expectations.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "117716135601193806837", "name": "Karla Gower", "time": 1519165168279, "rating": 5.0, "text": "Excellent work, and they performed fast when I really needed them to. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "107865918989363363382", "name": "Liz Presley (MSC)", "time": 1546542385621, "rating": 5.0, "text": "We use Fast Signs often for big and small projects. Megan's customer service is phenomenal!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "113515861891097417191", "name": "Neal C Fuller Jr (CowPaw)", "time": 1496492679614, "rating": 5.0, "text": "They were very precise in designing exactly what I wanted. And were very prompt on getting it approved. And into production. I would highly recommend them and I also use them for other projects. Director of Celebrate Recovery For the Nac, of the UMC. Neal C. Fuller Jr.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "113232678587407134086", "name": "Phillip Hall", "time": 1449774387082, "rating": 5.0, "text": "Turner & Schoel Heating & Air Conditioning has used Fastsigns for both signs and truck lettering. We found them to be very easy to deal with, friendly staff and the products exceeded our expectations. We proudly recommend them.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "107509412705822254381", "name": "don roberts", "time": 1508201954644, "rating": 5.0, "text": "Milton and his team did a great job for our business! Good quality at a fair price, Quick!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "108806446707080210973", "name": "Michaela Hancock", "time": 1494950727101, "rating": 5.0, "text": "Their products always look great and we get excellent customer service no matter who we deal with.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "111309991977466161518", "name": "Nikki Evans", "time": 1447789780885, "rating": 5.0, "text": "Great, fast, friendly, affordable service! Very grateful for their help on such short notice.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "104776023684682902245", "name": "Kathryn Adams", "time": 1537287594859, "rating": 5.0, "text": "Very efficient, high quality service! Couldn't be happier with the result and highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "113106363599112222599", "name": "Kris Sullivan", "time": 1622400159765, "rating": 5.0, "text": "Great responsiveness and customer service from the company's sales professional, Cody.", "pics": null, "resp": {"time": 1625601314702, "text": "Thank you for working with FASTSIGNS for your graphic and signage needs.  We appreciate your business."}, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "108169926312727499205", "name": "Jann Sides", "time": 1497801495333, "rating": 5.0, "text": "I recently changed the name of my pharmacy and needed vinyl graphics for the front door and a new panel for the shopping center roadside pylon sign. I contacted FastSigns and got an estimate and proof in record time. I was shocked at how quickly the whole process was done! The front of my store looks great!\nMegan Galaviz and all the crew at FastSigns were friendly and professional start to finish.\nMy project was a very small one, but these people gave it the attention and expertise I expected.\nHats off to FastSign. They now have a customer for life!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "110471116009083887362", "name": "Staci Robinson", "time": 1519145111895, "rating": 5.0, "text": "Did a great job for our company! Very friendly!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "117209612189904345903", "name": "Bama Dining", "time": 1496762897651, "rating": 5.0, "text": "Bama Dining has worked with FastSigns on various projects. They always deliver quality products and great customer service. Their staff is knowledgable, professional and friendly. We highly recommend FastSigns.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "100065934437864616576", "name": "Rebecca Christian", "time": 1426012930174, "rating": 5.0, "text": "FastSigns in Tuscaloosa has been wonderful at providing our sign needs.  Above and beyond is a phrase often no longer heard in business, but I can say unequivocally that FastSigns has gone above and beyond!  When we had a small sign made for our Front Desk, they came by later and took a look at the new sign.  Without suggestion, they decided to remake the sign with another material for greater durability - What company volunteers such?  It makes us feel that FastSigns truly sees themselves as a partner in our success.  That is a quality in business that is welcome!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "106215130458146879695", "name": "Nathan Dains", "time": 1502734320637, "rating": 5.0, "text": "I love this place and the people there! They always make sure to get what I need done, and they always get it done in time.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "114627059035736956296", "name": "Tom Allen", "time": 1427904389752, "rating": 5.0, "text": "Excellent job done quickly for good price", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "108552884223998017480", "name": "Tonia Simpson", "time": 1490118858277, "rating": 5.0, "text": "Quick response time! Very happy customer!!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "112030052904933347023", "name": "Dug Worth", "time": 1459458005418, "rating": 5.0, "text": "Only place in the town that would sell me straight vinyl, thumbs up to them", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "104292038228479255532", "name": "Brandi Jackson", "time": 1531243192863, "rating": 5.0, "text": "Prompt, accurate, and high quality!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "102623440804801204251", "name": "robert lanoux", "time": 1551975851524, "rating": 5.0, "text": "Professional, reliable, friendly, and FAST!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "104958794334825161611", "name": "Christine Jennings", "time": 1461769503981, "rating": 1.0, "text": "Despite the name, not much \"Fast\" about this organization.  Three weeks later I'm still awaiting my order.  I finally cancelled and placed it with another vendor.  Disappointing first experience, which means I won't be back.", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "118395616199386891252", "name": "Flatwoods Office", "time": 1473178392324, "rating": 5.0, "text": "Excellent service!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "102644189275436353762", "name": "Kathy Strait", "time": 1541880335253, "rating": 5.0, "text": "Impressive!!", "pics": null, "resp": null, "gmap_id": "0x888602ad2d8825f5:0xb84daf094813cab6"}
{"user_id": "112090070619315609490", "name": "ruben cas", "time": 1558384122997, "rating": 5.0, "text": "The people there are very good very courteous and work real hard to get you loaded real quick I would recommend this place to anybody", "pics": null, "resp": null, "gmap_id": "0x886264fc80f082bd:0x390e6b988b279d5f"}
{"user_id": "105880786112840556823", "name": "Jeffrey Brittain", "time": 1555022375634, "rating": 5.0, "text": "Awesome place to load great staff thanks", "pics": null, "resp": null, "gmap_id": "0x886264fc80f082bd:0x390e6b988b279d5f"}
{"user_id": "100779983120666838836", "name": "Jerry Leverette", "time": 1532907191664, "rating": 5.0, "text": "Awesome wood crafting and fabrication. Beautiful cabinets!👍", "pics": null, "resp": null, "gmap_id": "0x886264fc80f082bd:0x390e6b988b279d5f"}
{"user_id": "104299655345818806120", "name": "Alabama Reloader", "time": 1515725702458, "rating": 5.0, "text": "Awesome company run by great folks", "pics": null, "resp": null, "gmap_id": "0x886264fc80f082bd:0x390e6b988b279d5f"}
{"user_id": "105935908789139725703", "name": "Frederick Jones", "time": 1511059941358, "rating": 5.0, "text": "Two thumbs up.", "pics": null, "resp": null, "gmap_id": "0x886264fc80f082bd:0x390e6b988b279d5f"}
{"user_id": "117192964590625066395", "name": "Eva Faircloth", "time": 1611520933135, "rating": 5.0, "text": "The quality of FastSigns’ workmanship was top notch. Our TeamLogic IT car wrap turned out even better than anticipated, and we’ll be back as we add to our fleet. Definitely five stars for customer service and communications, as well!", "pics": null, "resp": {"time": 1619717999088, "text": "Eva,\nThank you for writing this review. With FASTSIGNS of Mobile being a locally woman-owned business in Mobile, we truly value your input and positive feedback. We look forward to doing business with you again in the future!"}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "112889593455966005155", "name": "Brian O'Donnell", "time": 1605711836825, "rating": 5.0, "text": "American WeatherStar has worked with the Airport Blvd FASTSIGNS location for a few years now. Pauline and all of the FASTSIGNS associates that have worked with us are always punctual and professional. They have printed a number of designs for us, including large pop-up banners, posters, and even the large metal sign we have displayed on our building. We are extremely pleased with all of the work FASTSIGNS has done for us.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOHTAemmXU1j187O_hcBsey-IFo4GJiG_4l0iDY=w150-h150-k-no-p"]}], "resp": {"time": 1605816720398, "text": "Thanks Brian for taking the time to give us a review! We are here to help you with all of your branded materials. We appreciate you and look forward to your next project."}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "108061634153328758085", "name": "Brian Calhoun", "time": 1598287135665, "rating": 5.0, "text": "I really like the customer portal, it’s very user friendly!! The decals really turned out nice, everyone loved them! We will definitely be coming back for more! You won’t find a better price, feel free to shop around and you’ll see!!", "pics": null, "resp": {"time": 1600017736387, "text": "Thanks Brian for your review! We are glad that the decals were a hit! See you soon."}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "110712770693612415527", "name": "Lia Barnes", "time": 1601569447978, "rating": 5.0, "text": "We contacted FASTSIGNS 2 days after Hurricane Sally for 2 banners. We picked up our banners in 24 hours. The service was fast and friendly. The banners were exactly what we wanted and very affordable. I highly recommend this business.", "pics": null, "resp": {"time": 1601729004217, "text": "Thanks Lia! We are glad you are pleased with your banners! Thanks for recommending us. We and here to help. See you soon."}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "109022181226044282661", "name": "Erick Bloomfield", "time": 1551742917661, "rating": 5.0, "text": "Our company, Complete Mobile Plus Repair, was looking at several places to get a sign made. Some of the places said that it could take up to 4 weeks to get the sign to us. And no one was able to match the colors that we wanted. We contacted Fastsigns on a Monday, and the sign was ready for pickup on Friday morning. The colors were AWESOME! Thank you Fastsigns for your hard work and excellent results. And a special thank you to Pauline for the incredible assistance that you gave to us. We will recommend Fastsigns to whomever asks where they can get signs, flags, or anything else that they are looking for to promote their business.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPsAGhQcxSe4T_2a7eqb_dcE4Kb059T_i1jn_xX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPui4TjYHDab47Wim0E0f91pJMGyi7vrZmhDTUP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNwUDdXWq4eeXlNLn8PASbNeqMIF5jgYWGJuiTS=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "115059470554043991762", "name": "Margaret Childers", "time": 1612275708452, "rating": 5.0, "text": "FastSigns did an amazing job for my new business!  They were prompt and professional.  I would recommend them to anyone!", "pics": null, "resp": {"time": 1618871987582, "text": "Dear Margaret,\nThank you for your wonderful review and for taking the time to share your feedback with FASTSIGNS of Mobile. We wish you and your new business, Cornerstone Caregiving, much success. We look forward to hearing from you soon. We will be looking for you in your newly wrapped vehicle on the roads of Mobile!"}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "103347539319596308425", "name": "Martha Gerhart", "time": 1611337344137, "rating": 5.0, "text": "FASTSIGNS of Mobile made a sign for us this month and it turned out beautiful.  It's exactly what I ordered!", "pics": null, "resp": {"time": 1611448322083, "text": "Thanks Martha! We appreciate you and we are happy that you pleased with your sign."}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "116963348986603758923", "name": "Jocelyn Olson", "time": 1601390134933, "rating": 5.0, "text": "Fast, easy to work with, and Tony Lovato is great! His crew found two signs that we didn't even know existed in one of our locations which was great for us and ensuring our brand remains consistent. I highly recommend Fast Signs of Mobile; ask for Tony. I promise you won't be disappointed.", "pics": null, "resp": {"time": 1601419470223, "text": "Thank you Jocelyn for taking the time to give us a review! We are here to help you with all of your signage needs. Your brand is very important to us; we are happy that you are pleased with our team. We look forward to working with you soon."}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "103401251082270890282", "name": "2Lisa RadfordHughes", "time": 1605305105056, "rating": 5.0, "text": "Im so impressed and very Happy with the whole service here from start to finish Awesome friendly customer service. Fast and accurate", "pics": null, "resp": {"time": 1605455545057, "text": "Lisa thanks for your kind words! Customer Service is very important to us! We look forward to seeing you soon."}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "109022181226044282661", "name": "Erick Bloomfield", "time": 1551742917661, "rating": 5.0, "text": "Our company, Complete Mobile Plus Repair, was looking at several places to get a sign made. Some of the places said that it could take up to 4 weeks to get the sign to us. And no one was able to match the colors that we wanted. We contacted Fastsigns on a Monday, and the sign was ready for pickup on Friday morning. The colors were AWESOME! Thank you Fastsigns for your hard work and excellent results. And a special thank you to Pauline for the incredible assistance that you gave to us. We will recommend Fastsigns to whomever asks where they can get signs, flags, or anything else that they are looking for to promote their business.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPsAGhQcxSe4T_2a7eqb_dcE4Kb059T_i1jn_xX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPui4TjYHDab47Wim0E0f91pJMGyi7vrZmhDTUP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNwUDdXWq4eeXlNLn8PASbNeqMIF5jgYWGJuiTS=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "101909351357550506901", "name": "Beth Klees", "time": 1591980469767, "rating": 5.0, "text": "I like how easy it was to customize what we wanted.  The design was great, and I like the way it incorporated all of the ideas we presented.  Everything we ordered was ready in a very timely manner.  Thank you!", "pics": null, "resp": {"time": 1591986339913, "text": "Thanks Beth! We are here to help with all of your custom needs.\nSee you soon."}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "100188641584399448798", "name": "Jamie Tapia", "time": 1599763596909, "rating": 5.0, "text": "Fast Signs did an excellent job in understanding our vision for signage, helping us maintain brand identity throughout all the signage, and gave excellent installation service. We are so pleased with our signs!", "pics": null, "resp": {"time": 1600017421218, "text": "Thanks Jamie! Brand Identity is very important for your Signage. We are happy that you are pleased with all of your signage. We look forward to continuing to help you with your Brand."}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "108837645990087602338", "name": "Leslie Walsingham", "time": 1596743089087, "rating": 5.0, "text": "Products look amazing, the customer service and delivery time were exceptional! Will definitely use FastSigns again for any future needs.", "pics": null, "resp": {"time": 1597064036788, "text": "Thanks Leslie! Customer Service is very important to us! We look forward to helping you in the future."}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "111596645924929874938", "name": "jtsmas1", "time": 1576530658880, "rating": 5.0, "text": "Finally a sign company in lower Alabama that is fast, accurate and reasonable.They exceeded our expectations with the design, quality and promptness of our signage needs. I wish our other suppliers were as attentive as Pauline and Megan at Fastsigns.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNeH7uq0iCytNnI5RaPGSU4t4GKMK1cauT0jiWn=w150-h150-k-no-p"]}], "resp": {"time": 1533984897920, "text": "Thank you for your kind words! We are thrilled that we exceeded your expectations and look forward to working with you soon! Thank you for taking the time to give us the Great Review!"}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "108735593868157367364", "name": "Devin Ford", "time": 1570577285658, "rating": 5.0, "text": "Absolutely a joy to work with.  All of my signage, stickers, and the step and repeat were done quickly and the products were the highest quality.  They were very friendly and responded quickly when I contacted them. They also caught a mistake that I made and helped me fix it before it went to print.", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "116463669220125646274", "name": "Pat Loussaert", "time": 1615588890213, "rating": 5.0, "text": "Very good company. They met all our needs quickly and efficiently.  We wanted to change a few things on our design and they made our changes very professionally and our produxt came out magnificently.", "pics": null, "resp": {"time": 1583197084623, "text": "Thanks Pat! We are here for you and what to give you the best Product!"}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "104453645584333295355", "name": "Le'Rosa Gray", "time": 1557245971693, "rating": 5.0, "text": "Great customer service, great finished products  and the signs are very durable in or out doors! I would definitely use them again. I needed 12 signs  within 2 hours for an event and Pauline came to my rescue! she not only produced the signed but also delivered them to me about an hour and half after I ordered them! Such a great company to work with!", "pics": null, "resp": {"time": 1557256865049, "text": "Thank you Le'Rosa for the review! We are here to help! Thanks for your kind words. We look forward to working with you soon."}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "103033792129899045675", "name": "Sonja Sheffield", "time": 1578593977640, "rating": 5.0, "text": "FastSigns is truly fast! They are also professional, easy to work with and easy to schedule with. The end product was really superior too!", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "107282777937350999287", "name": "Jerry Sokol", "time": 1567177577925, "rating": 5.0, "text": "FastSigns of Mobile Did a great job on putting logos on my store front window.\nI worked with Bree and she did a great job on this job from start to finish.\nThanks to everyone, Jerry", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "104226616180111102583", "name": "Jeannie Mynatt", "time": 1589834516340, "rating": 5.0, "text": "Awesome customer service.  After approval, had my order ready the next day.", "pics": null, "resp": {"time": 1619729367618, "text": "Dear Jeannie,\nIt means so much when our best customers share their experiences. We want to be the best woman-owned sign company in Mobile and we appreciate your support.\nI'm glad we were able to meet your expectations!"}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "114885087106936369454", "name": "Ross Roberts", "time": 1548265294311, "rating": 5.0, "text": "Pauline is amazing!  She guided me through all my decisions and helped us put together several different designs.  I am do happy with the service and attentiveness of the team.  We will be back soon!  Ross y", "pics": null, "resp": {"time": 1548447049967, "text": "Thanks Ross! Hope the banners are well received! Looking forward to helping you with your next project."}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "101147516816603997657", "name": "Matthew Johnson", "time": 1575476155721, "rating": 5.0, "text": "So thankful for our partnership with this great company! Call Pauline & she’ll take care of you!", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "111596645924929874938", "name": "jtsmas1", "time": 1576530658880, "rating": 5.0, "text": "Finally a sign company in lower Alabama that is fast, accurate and reasonable.They exceeded our expectations with the design, quality and promptness of our signage needs. I wish our other suppliers were as attentive as Pauline and Megan at Fastsigns.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNeH7uq0iCytNnI5RaPGSU4t4GKMK1cauT0jiWn=w150-h150-k-no-p"]}], "resp": {"time": 1533984897920, "text": "Thank you for your kind words! We are thrilled that we exceeded your expectations and look forward to working with you soon! Thank you for taking the time to give us the Great Review!"}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "107131620447984190013", "name": "Bobby Howell", "time": 1529179471342, "rating": 5.0, "text": "Working with Pauline and her staff has been a pure joy!  The project was rather complex and I enjoyed getting involved with the friendly staff on the details.  I will certainly return to Fast Signs with repeat business.  Thank you for the superior customer service!", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "117479706511281083213", "name": "Whitney Hollinger", "time": 1540487021834, "rating": 5.0, "text": "Fast Signs did an excellent job delivering perfect binding souvenir booklets for my Church 1st Anniversary. They were able to print the booklets in a short time frame. We were really happy with the work that was produced.", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "114667214586268931167", "name": "Mobile AL CBD", "time": 1561998901004, "rating": 5.0, "text": "Lots of help with your projects, kind, friendly, helpful, patient with questions and editing.\nQuick to respond and fast to deliver.", "pics": null, "resp": {"time": 1562073015453, "text": "Thanks for your kind words! Customer Service is our #1 Goal! We look forward to working with you soon."}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "105836996484684156674", "name": "Shirley Byrd", "time": 1532708573115, "rating": 5.0, "text": "I like the friendliness of the staff - especially Maegan with whom I dealt on the projects for our office.  She was most helpful and did not seem bothered with all the changes we had to make.  Great work!", "pics": null, "resp": {"time": 1533746140303, "text": "Thank you for taking the time to give us a review. Maegan is very good for attention to detail. We are so happy that you are pleased with your project!"}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "106105079222594125203", "name": "Kylynn McMillian", "time": 1486491534339, "rating": 5.0, "text": "I had a wonderful experience with FASTSIGNS!  The young lady who met with me personally was professional, understanding of the situation that was explained to her, and then quite responsive to the needs that were requested.  Our signs were done tastefully and look beautiful!  Thank you so much for your service.", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "108031652978987056460", "name": "Stephen Guy", "time": 1551208613990, "rating": 5.0, "text": "Great price, great customer service, and amazing work! Better than anyone else we contacted!", "pics": null, "resp": {"time": 1551268612182, "text": "Thanks, Stephen! We are glad you are happy with your sign and your experience!"}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "100239727799789260491", "name": "Eric Moore", "time": 1548011557337, "rating": 5.0, "text": "From Prihoda North America.  We had our Trade Show AHR2019 in Atlanta.  Maegan worked with us up until the show. The walls that were made for our booth finished up nicely. We could not have asked for a better turnout. Thank you!", "pics": null, "resp": {"time": 1548447137578, "text": "Thank you, Eric, for the reivew! Hope the trade show was a Great Success!"}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "116877766872422908652", "name": "Kimberly Etherton", "time": 1557342286583, "rating": 5.0, "text": "Maegan was so helpful and I will definitely be using FastSigns again for any sign needs for Magic Moments or anything else!", "pics": null, "resp": {"time": 1557366360905, "text": "Thank you Kimberly for your kind words! We are glad we were able to help you with you signage needs! We look forward to seeing you soon."}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "113198489597497852337", "name": "Julie Northcutt", "time": 1549918314600, "rating": 5.0, "text": "When you order from FASTSIGNS, you get top quality products and their service is fast and very helpful!", "pics": null, "resp": {"time": 1549938852776, "text": "Thank you Julie! We are happy that you are pleased with our product and service. Thanks for doing business with FASTSIGNS!"}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "103467923385086086927", "name": "Brenda Brazile", "time": 1533144733863, "rating": 5.0, "text": "The process was super easy. Shannon helped us put a couple of ideas together and the designer sent us an image the next day. The staff had our project ready to pick up as promised.", "pics": null, "resp": {"time": 1533746014488, "text": "Thanks for your kind words! We appreciate your business!"}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "108787224263213665966", "name": "Dr. T.J. Singleton", "time": 1535733418924, "rating": 5.0, "text": "The paper is high quality and durable, and the colors are true to the original images. The prices are so better than competitors!", "pics": null, "resp": {"time": 1535840836204, "text": "Thanks for the Review!\nWe are glad you are happy with our quality and prices! We look forward to working with you in the future."}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "104051569898473151494", "name": "John Bobbitt", "time": 1544975925818, "rating": 1.0, "text": "$100 for a 2-inch vinyl decal for use as an airbrush stencil!? That was with all the graphic vectoring and formatting work done for them, i requested the cheapest material available (would even take shelf paper, i didnt care) and didnt want it weeded. LITERALLY, just tap PRINT.......$100 FOR 2 INCHES!?\n\nmust be smokin the good stuff over there....", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "113292092243990339748", "name": "Matt Bowers Nissan Eastern Shore", "time": 1507081192958, "rating": 5.0, "text": "Fastsigns did a fantastic job for our new business, Matt Bowers Nissan Eastern Shore, in Daphne, AL.\n\nWhen there was a mixup with Corporate over the temporary building sign banner, Pauline and her crew went out of their way to adjust their schedule, get the old sign removed and get our temporary banner up. Bottom line is, they got it done, with a smile. Kudos.", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "101428996052235132775", "name": "Guy Etherton", "time": 1550765920945, "rating": 5.0, "text": "Very fast service, Maegan was a great help!", "pics": null, "resp": {"time": 1550767228448, "text": "Thanks Guy! We are here to help."}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "105451626431701419100", "name": "Joe Peek", "time": 1474111929968, "rating": 5.0, "text": "Great customer service and they respond to questions quickly.  Highly recommend.\n\nJessica has been a pleasure to work with.", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "105451626431701419100", "name": "Joe Peek", "time": 1474111929968, "rating": 5.0, "text": "Great customer service and they respond to questions quickly.  Highly recommend.\n\nJessica has been a pleasure to work with.", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "101428996052235132775", "name": "Guy Etherton", "time": 1550765920945, "rating": 5.0, "text": "Very fast service, Maegan was a great help!", "pics": null, "resp": {"time": 1550767228448, "text": "Thanks Guy! We are here to help."}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "103093230690192847155", "name": "Shannon Mason", "time": 1508961432862, "rating": 5.0, "text": "The Office of Marketing & Public Relations at University of Mobile use FastSigns exclusively, because they are true to their name – we get quality signs very fast! The team at FastSigns, especially Pauline, is incredible to work with, throughout the entire process. Their customer service is excellent and some of the best I have ever worked with! Pauline is very personable and approachable, and always works to get us the best pricing on quality products. She goes the extra mile to get to know our projects in order to make our sometimes extravagant visions come to life. She is always able to be reached by phone or email, and responds quickly with estimates. Her staff has adopted this mindset as well, as they ensure that everything from the installations to the billing process is as smooth as possible.\n\nFrank, one of the installers, is the best in the business! He works long hours and always does our installations. We look forward to seeing him on campus, because we know that if Frank is here, it will be done right! We can always count on him to be professional and do a great job.\n\nOutside of University of Mobile, I have used FastSigns for several personal projects and every time they excel and meet my demands! No matter the project, Pauline & her staff are the only name we trust in the sign business to take on our signage requests. They can just about do it all! It’s always a pleasure to work with them!", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "101257866662704570913", "name": "Alex Page", "time": 1523499006923, "rating": 5.0, "text": "Quality product, professionally installed. Very happy with this service!", "pics": null, "resp": {"time": 1524228514783, "text": "We are always \"HAPPY\" to have \"HAPPY\" customers! See you soon!"}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "109761432221259970075", "name": "Chuck Steeg", "time": 1454689477979, "rating": 5.0, "text": "Tyler was great to work with.   The new store in Daphne is going to be a great resource for our company.", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "116197646668457924486", "name": "Lila Johnson", "time": 1507740629730, "rating": 1.0, "text": "I had an awful experience dealing with this company and will never go back. The so-called co-owner, Pauline I believe her name is, took it upon herself to take on my order. I was in charge of the decorations for my 20-year high school reunion, and one of my tasks was to have posters made from our old year book to set up for a display. I figured Fastsigns would be the place to go since they specialize in that type of work. I was assured that the posters would be of high quality and on time. However, when I came in to pick up my posters, they weren’t even ready and were horribly distorted. I was very perturbed to find this out seeing as how I was spending over $300.00 on these posters. Pauline, who was in charge, wouldn’t even personally confront me about this issue, she had one of her employees who was more helpful than Pauline was, bare the grunt. Pauline was also unprofessional as I saw her talk down to one of her employees and treated her poorly right in front of me! Needless to say, I took my business elsewhere to SignPro and they did a wonderful job in a fraction of the time.", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "116401926671433037618", "name": "Antonette Wiggins", "time": 1604677547439, "rating": 5.0, "text": "Affordable", "pics": null, "resp": {"time": 1619722738009, "text": "Antoinette,\nI'm happy you are pleased with your vehicle magnets from FASTSIGNS of Mobile and that we were able to help. If there is anything else we can do in the future, please let us know."}, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "105249227283221190344", "name": "Rick Hillman", "time": 1483456262848, "rating": 5.0, "text": "We are well pleased with the Table-top display we ordered for use in our Collinsville Illinois office. The display looks great and was simple to setup and take down. You and your team at FastSigns made the process simple and easy for us. This project was on time and on budget and that makes all the difference. Thanks again for all of the help with the printing and delivery of the unit.\n\n-Rick Hillman\nSenior Graphics Specialist, Webmaster\nVolkert, Inc.", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "106195625255481820311", "name": "Brittany Armistead", "time": 1478547209860, "rating": 5.0, "text": "The quality of service and printing is exceptional!", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "114216763489399041842", "name": "Mullet Point", "time": 1544125162867, "rating": 5.0, "text": "Fast dependable friendly", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "114216763489399041842", "name": "Mullet Point", "time": 1544125162867, "rating": 5.0, "text": "Fast dependable friendly", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
{"user_id": "117702318202927117560", "name": "Flixrzz", "time": 1624978682320, "rating": 4.0, "text": "they could not do what i wanted but the customer service was really good i reccomend them", "pics": null, "resp": null, "gmap_id": "0x889a4d9b5e6ea301:0x9325ed3e34f24510"}
