{"user_id": "104651669910888602555", "name": "Dominique Hudson", "time": 1628199255660, "rating": 5.0, "text": "I absolutely LOVED this place! Erika did my eyelash extensions, and she was so fun and sweet! she was very personable and likable, and it really felt like I made a friend! with it being my first time I was a little nervous but they had really nice music playing and she gave me water and a snack. she did such a good job on my lashes, too! i’m loving them! I highly recommend this place! it is expensive yes, but you won’t regret it!", "pics": null, "resp": {"time": 1628251765621, "text": "Dominique, it was certainly a pleasure to have you as our guest. We loved giving you a new lash look. Thanks for the kind words. We are so very happy your experience was a great one."}, "gmap_id": "0x88621344dde59601:0xdabac423c3bec61c"}
{"user_id": "116853676901405630585", "name": "Melissa Morrison-Ellis", "time": 1616781452415, "rating": 5.0, "text": "Another fabulous lash-up and a much needed lash-nap! I remain impressed with the staff's skills and enjoy the ease and benefits of my membership. I've been getting services here for over a year and through the pandemic as allowed.", "pics": null, "resp": null, "gmap_id": "0x88621344dde59601:0xdabac423c3bec61c"}
{"user_id": "101496097381503671114", "name": "D T", "time": 1613656262116, "rating": 5.0, "text": "Deyawn!! Is awesome!! Great service and very professional!! This was my second appointment and I booked a third!! The environment is clean, relaxing and beautiful! You will not be disappointed!! Book with her!! My eyebrows look AMAZING!!!", "pics": null, "resp": null, "gmap_id": "0x88621344dde59601:0xdabac423c3bec61c"}
{"user_id": "111246449185890885781", "name": "Alexis", "time": 1599355073299, "rating": 5.0, "text": "I originally went to Les Femmes for my lashes and showed them pictures of what I used to have.  They were way off from what I showed them and way to long. I wanted to rip my lashes off so bad.  I discovered the lash lounge and they were able to remove my lashes and add on a new set and replicate from the pictures of what I used to have!  Great atmosphere. The ladies are very friendly and make sure you are comfortable!  I go back now every 2-3weeks for my fill!", "pics": null, "resp": null, "gmap_id": "0x88621344dde59601:0xdabac423c3bec61c"}
{"user_id": "108581412152789033045", "name": "Anita McLamb (McLamb Group Media)", "time": 1600825446880, "rating": 5.0, "text": "I am blown away by my lashes I received today! Lash Lounge is top notch from the professional atmosphere, customer service, explanation of the procedure. This is an extensive process that not only takes precision but patience as well. I didn't think it was possible but I literally fell asleep because I was so relaxed. Well done Deshawn!", "pics": null, "resp": null, "gmap_id": "0x88621344dde59601:0xdabac423c3bec61c"}
{"user_id": "111692162327721043531", "name": "Sam Paxton", "time": 1574541280389, "rating": 5.0, "text": "I love the Lash Lounge! I got a full set of silk eyelashes at their soft opening and have received two fill ins since. It has been great every time. Kionte is amazing and really precise and particular at making your lashes look how you want them to. I have been blown away by the customer service here. The salon is clean and professional. They offer a monthly membership which saves me $50/month since I get my lashes filled in every two weeks.  I would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88621344dde59601:0xdabac423c3bec61c"}
{"user_id": "112060735413798900179", "name": "Jordan Spencer", "time": 1592598459659, "rating": 5.0, "text": "You can’t go wrong with The Lash Lounge! I sincerely appreciate the professionalism but cleanliness is what makes me come back again and again. Overall, I’ve had several relaxing experiences and hope to have many more.", "pics": null, "resp": null, "gmap_id": "0x88621344dde59601:0xdabac423c3bec61c"}
{"user_id": "106740524424330183826", "name": "Austin Spencer", "time": 1583804279403, "rating": 5.0, "text": "Such a clean and professional environment! Not only were the employees friendly and inviting, but the owner was extremely accommodating and genuine... and not to mention the superb quality of the lashes as well! Definitely one of the best lashing experiences I’ve ever had. A 5 star rating is truly an understatement compared to the level of service that the lash lounge provides. I highly recommend getting your lash extensions from the lash lounge, my overall experience was phenomenal, definitely coming back! ✨", "pics": null, "resp": null, "gmap_id": "0x88621344dde59601:0xdabac423c3bec61c"}
{"user_id": "115934029129148813477", "name": "Scarlett Cochran", "time": 1593733508805, "rating": 5.0, "text": "I loved my first set so I returned and even got the package for continued sets. The second visit wasnt as great. She didnt listen to what I asked for. I wanted natural but enhanced, but I got full blown thick long volume. Didnt look natural at all. I left for a trip 2 days later. I ONLY got a call to correct it after I reviewed them. Not happy with the 2nd visit. I will return and hope for a better 3rd. I still recommend them just be sure to verify what you want more than once.\n\nUpdate: Deyawn saved the day!!! Thank you to the front staff as well. Customer Service was fantastic!", "pics": null, "resp": null, "gmap_id": "0x88621344dde59601:0xdabac423c3bec61c"}
{"user_id": "109872620844334487654", "name": "Gen Connell", "time": 1580605683106, "rating": 5.0, "text": "The ladies here are always the sweetest and my lashes always look great!", "pics": null, "resp": null, "gmap_id": "0x88621344dde59601:0xdabac423c3bec61c"}
{"user_id": "110415221796905900588", "name": "M J", "time": 1613094290085, "rating": 5.0, "text": "The service is great!", "pics": null, "resp": null, "gmap_id": "0x88621344dde59601:0xdabac423c3bec61c"}
{"user_id": "111586881770451072420", "name": "Dr. Yvette Thomas", "time": 1579808261898, "rating": 5.0, "text": "This place is awesome. Wonderful staff", "pics": null, "resp": null, "gmap_id": "0x88621344dde59601:0xdabac423c3bec61c"}
{"user_id": "105656899410560212965", "name": "Dana Smith", "time": 1574706235926, "rating": 5.0, "text": "I really enjoyed the experience the ladies at the Lash lounge provided.Unfortunately I was unable to continue wearing my lashes.", "pics": null, "resp": null, "gmap_id": "0x88621344dde59601:0xdabac423c3bec61c"}
{"user_id": "112585096616277016275", "name": "Marticia B.", "time": 1621972069680, "rating": 3.0, "text": "It was okay", "pics": null, "resp": null, "gmap_id": "0x88621344dde59601:0xdabac423c3bec61c"}
{"user_id": "101166451205956163962", "name": "Daphne Wilkerson", "time": 1582329973295, "rating": 4.0, "text": "Very professional.", "pics": null, "resp": null, "gmap_id": "0x88621344dde59601:0xdabac423c3bec61c"}
{"user_id": "101078774439232211854", "name": "Katelyn Olive", "time": 1625693634081, "rating": 5.0, "text": "This place is AMAZING!! The girls there are so sweet and very talented. I get my brows tinted&laminated and LOVE IT. You cannot go wrong with any service here. 1000/10 would recommend 🤩", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "112698336907981810165", "name": "Karen Graham", "time": 1627224894062, "rating": 5.0, "text": "I love the look after getting the Classic set.  I barely have any lashes of my on so this has been a game changer.  The only thing I have a problem with is the eye I sleep on.  I suggest getting a silk pillow case.  Also the same eye I sleep on happens to be the same side my hair parts so it hangs down in my lashes and it effects how well it holds up.  My advice on that is when you are at home and not going out pull the hair out of your eyes with a barrette and I even sleep with it.  Thanks Brailyn for giving me lashes I can see now. 😊", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "100375132604409202233", "name": "Kirstie Harrison", "time": 1608067817150, "rating": 5.0, "text": "I had the most amazing experience here! They definitely make you feel like the absolute best version of yourself. All of the girls are warm, sweet, and fabulous! It’s just a wonderful vibe from the time you walk in until the time you leave. They are extremely talented and professional. You will not regret coming to Pretty by Coco!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "103926398886179890741", "name": "Eva Burden", "time": 1625844427310, "rating": 5.0, "text": "One of the best places ever ! The girls are so sweet and do an amazing job !", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "106537025960516908498", "name": "Milly Brent", "time": 1608053439419, "rating": 5.0, "text": "I'm so excited for Pretty by Coco's new space. Chloe did my first ever eyelash extensions. It was super relaxing and my lashes looked great after the service. She provided me with care instructions and a lash wand. I highly recommend supporting this awesome small business!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "102823930689259272368", "name": "Julie Johnson", "time": 1608047805071, "rating": 5.0, "text": "This is the first place I ever got my lashes done and the only place I’ll go! Chloe is so sweet and so amazing at what she does. She fits me in when I need a touch up and always makes sure my lashes are perfect before I leave! 10/10!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "117531066204916853228", "name": "Dianna Manzano", "time": 1608082738079, "rating": 5.0, "text": "Chloe is amazing! My lashes look so good when I get them done. I always get so many compliments! She is very nice and makes you feel comfortable! She will not disappoint.", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "100006980485884743702", "name": "bethany tank", "time": 1608053697883, "rating": 5.0, "text": "I have been getting my lashes done by Chloe for over a year and a half! She is the sweetest and so hardworking! I have loved seeing her business grow! I will be a pretty by coco gal for life!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "110975085093158945741", "name": "Faith Heyne", "time": 1608049479190, "rating": 5.0, "text": "Only place I’ll ever get my lashes done! Chloe and Brailyn have done an amazing job on mine!! So cute and clean💕💕", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "107213945853659660749", "name": "Lindsey Holt", "time": 1592536848582, "rating": 5.0, "text": "Chloe is an absolute delight! My lashes look like a DREAM and the time spent in her space went by so quickly! She’s friendly and professional and her work speaks for itself. Lots of “your lashes look great - did you do something different?” and “your eyes look brighter!” - all while skipping the eye makeup and avoiding the attempt to glue flash eyelashes on each day. The product is fabulous, and being able to support an independent business owner is the cherry on top. So glad to have met Chloe and to have received such a great product for a very fair price. Can’t wait to return for a fill-in, because the “lashes lifestyle” is for me!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "106915262645230081432", "name": "Mary Dixon", "time": 1608133558511, "rating": 5.0, "text": "Pretty by Coco is AMAZING!! She is so sweet and talented and has added so many more talented girls into her business! Go check her out!!!!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "104240860591828949124", "name": "Lee Young", "time": 1588804653553, "rating": 5.0, "text": "I’ve ALWAYS wanted pretty, flattering, sexy lashes. Chloe has made that a reality for me. She has a true talent for lash extensions. Not only do I have pretty lashes, thanks to Chloe, but they look natural. She is amazingly calm and steady. She is professional, clean, and the sweetest!!! I wouldn’t use anyone else.", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "111331380445204654546", "name": "Simply Sierra Things", "time": 1593352139886, "rating": 5.0, "text": "Chloe is just amazing! She’s super sweet and very patient in answering all questions you may have about lash extensions. My lashes look great! She is also safe, clean and makes you feel comfortable.", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "101742276293479632346", "name": "Rachael White", "time": 1595804931952, "rating": 5.0, "text": "I recently stopped going to my lash stylist and missed my lashes so much I looked for someone in my area who did similar work. I stumbled by PrettybyCoCo and couldn’t help but book with her. I was NOT disappointed and will continue going. She makes the experience super comfortable and I had no problem talking with her until my set was done. Her work speaks for itself. 10/10 recommend❤️", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "114982071181162519878", "name": "Ellen Mcgee", "time": 1608089087780, "rating": 5.0, "text": "very professional, super sweet people, and my lashes stayed on for 3 weeks!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "116081202222700791980", "name": "Madison Nelson", "time": 1594596963316, "rating": 5.0, "text": "All in all chloe was amazing! She was super nice, very clean, and made me look amazing for my maternity pictures. I will definitely have her do my makeup for any other special events I have!!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "116217483197759154238", "name": "Indigo Fort", "time": 1589778931048, "rating": 5.0, "text": "Chloe provides a great experience for her client. I enjoy my lashes (especially my lash naps) and even has a great conversation with her. I’ll definitely be joining her membership plan! Go see her for a fabulous experience!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "100515409918593442785", "name": "Katie Cole", "time": 1590957161558, "rating": 5.0, "text": "I’d rate her business a 10! She’s very professional, friendly, and I couldn’t have been more pleased with my experience. My lashes look beautiful! Can’t wait to go back! :)", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "108976284514766040533", "name": "Samantha Toner", "time": 1589319049168, "rating": 5.0, "text": "From relaxation to professionalism, Pretty By Coco is that and much more. I have been getting lashes done with Chloe for 6 months and she always goes above and beyond for her clients. Highly recommend her for all your beauty needs!\n\n-Shea Eubank", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "108589540647365693141", "name": "Stephanie Karabaich", "time": 1590775870859, "rating": 5.0, "text": "She done a fantastic job on my lashes!!!  She is very sweet and easy to talk to. I love her location!! She is very clean. I recommend Pretty By Coco.", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "116009100235492771957", "name": "Anna Hendrix", "time": 1574196305154, "rating": 5.0, "text": "I was skeptical about lash extensions when I first heard about them.. but decided to give Chloe a shot and just see what could happen.. I got my full set in August and I’ve been going every two weeks since then to keep my lashes up! Chloe is amazing, super friendly, and I love going to see her. Getting my lashes done has become my own version of therapy for me. I would highly recommend Chloe for all beauty needs and/or wants!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "117307747519422504455", "name": "Marabeth Brewer", "time": 1595027176445, "rating": 5.0, "text": "They turned out so good. My first eyelash extension experience, and I was very impressed!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "115245623654044372743", "name": "Eunique Perry", "time": 1594417829295, "rating": 5.0, "text": "She worked fast and she did an amazing job! Super sweet, will be back", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "116829049524771018022", "name": "Shelby Clemmons", "time": 1595796586615, "rating": 5.0, "text": "I absolutely love Chloe!!! She’s so talented and I will go to her everytime. My lashes make me feel sooo confident and I highly recommend ❣️ Chloe is super sweet and does an excellent job 💓", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "109985251237026929906", "name": "Sarah Dunn", "time": 1589752422774, "rating": 5.0, "text": "Chloe did an amazing job! My lashes look full and natural! This is definitely going to be a monthly thing!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "110614003799295861219", "name": "Jenna Ward", "time": 1589039227168, "rating": 5.0, "text": "I loooove my lashes! Chloe did such a good job! She was very friendly and professional. I will definitely be back for fill in 🥰.", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "116454290086780281341", "name": "ashley mays", "time": 1595802372786, "rating": 5.0, "text": "I love my lashes! Chloe always does an excellent job!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "107513247825493173758", "name": "Emma Moothart", "time": 1565835390989, "rating": 5.0, "text": "I would never describe myself as a girly girl so I would have never considered getting lashes BUT Chloe made my lashes look SO PRETTY and natural! I didn’t even have to think about wearing makeup! I felt extremely comfortable through the entire process and will continue to go back for refills. Seriously can’t recommend her enough!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "107948253448737583013", "name": "Kelly Strickland", "time": 1589700350737, "rating": 5.0, "text": "Love my lashes! Very much enjoyed the experience of getting them done by Chloe.", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "107158898582397286697", "name": "Taylor Glover", "time": 1574122910927, "rating": 5.0, "text": "i’ve gotten my lashes done my Chloe a couple times and i’ve absolutely loved each visit!!! she does a PHENOMENAL job and makes you feel so beautiful!! i definitely recommend going to her for your eyelash needs!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "116422868997100567943", "name": "shawn kennedy", "time": 1582514617144, "rating": 5.0, "text": "Love love the lashes and COCO is awesome! Would recommend to everyone interested in getting lashes!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "107107142165221712963", "name": "Abbey Dewberry", "time": 1579119751223, "rating": 5.0, "text": "The 3rd place I have tried with lashes and by far the best! Not only the best prices but they look amazing every time!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "116613088661548059475", "name": "Chloe Brownell", "time": 1566175608547, "rating": 5.0, "text": "Got my makeup done for a date party and I was obsessed! Chloe is so sweet talented. I felt like a princess!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "100231304439423004576", "name": "Savannah Ledbetter", "time": 1566175439014, "rating": 5.0, "text": "COCO IS THE BEST! GO SEE HER", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "101720615769671136244", "name": "Molly Hughes", "time": 1579982715001, "rating": 5.0, "text": "Love my lashes!!", "pics": null, "resp": null, "gmap_id": "0x887d493ca99b6619:0x8173c7d049641d60"}
{"user_id": "108071281535941817583", "name": "Kim Feurtado", "time": 1622602807706, "rating": 5.0, "text": "I booked a massage with my favorite massage therapist which is Jay. He is very sweet and always makes sure that you get your full time. His massages are very relaxing and I he caters to your every need, especially if you have a certain spot that may need more massaging like your back or neck. He is not going to talk during your massage, so you have to make sure that you speak up if you need something.I recommend that if you need a relaxing hot rock massage to go and see Jay, he is AWESOME.", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "113429343534020857497", "name": "Chiante July", "time": 1621391465429, "rating": 5.0, "text": "Jay is an exceptional massage therapist. I can always count on leaving my visits refreshed, relaxed and renewed. He listens to your needs and applies the right amount of pressure to remove any built up tension. He is also very professional, courteous and respectful of your time.", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "116207144113822338211", "name": "Krishalon Abrams-Davis", "time": 1622077358197, "rating": 5.0, "text": "My massage with Jay was awesome. H is always so professional and gives you your full time.  He caters to what you need for your relaxation. I definitely recommend his services. I'm already booked for next month.", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "109936529618697866587", "name": "Tamichael Tyus", "time": 1621391647315, "rating": 5.0, "text": "I love this location. I visited Jay East for my monthly massage and it was so inviting, clean and professional. This location holds variety of services that can cater to anyone needs.", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "105520938198699890613", "name": "Jodi Douglas", "time": 1611860747756, "rating": 5.0, "text": "I get my eyebrows microbladed there with Sarah, and she is the best! She's super friendly and makes me feel super comfortable! I couldn't ask for a better experience!! 1", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "103325674725409358845", "name": "Lisa Duck (Pisces Sun)", "time": 1621457523365, "rating": 5.0, "text": "I received a massage from Jay at Studio 36 Massage he is very professional and leaves me feeling relaxed. I will be returning in the future .", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "111276094812264779032", "name": "Mara Holmes", "time": 1599257617092, "rating": 5.0, "text": "I received a massage from the massage therapist at Studio 36.  T was amazing.  She has a great space very comfortable.  She is very professional .   I would recommend her to anyone and Everyone.  Her transitions are amazing.   I will be back!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "111083483712555924607", "name": "Trey Palmer", "time": 1616701241004, "rating": 5.0, "text": "First post quarantine haircut. Looks good too.", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "117252942958610358251", "name": "Breanna Wagner", "time": 1603581879095, "rating": 5.0, "text": "Best hair and beauty salon!!! Outstanding service!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "118223111177894216318", "name": "Sadé Miller", "time": 1559945208908, "rating": 5.0, "text": "Great space, great customer service, and great ambiance. Really terrific space. All around great experience! I never leave dissatisfied.", "pics": null, "resp": {"time": 1561250273972, "text": "We are so pleased you enjoyed your service. Thank you for the review"}, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "112003793035071673437", "name": "Kim Sweet", "time": 1544552897606, "rating": 5.0, "text": "Had the full works and it's fabulous! Sarah was my esthetician and made me shine bright. Ashlee did my hair and pedicure and made me feel beautiful! I will be back and finally have found my place in Mobile.", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "105065989978060270388", "name": "Arlington show Bryant", "time": 1579413127395, "rating": 5.0, "text": "Netris is the best! Everyone there is so friendly!", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "104839990625285226306", "name": "Caisy CG", "time": 1543446533761, "rating": 5.0, "text": "This salon/day spa is a fantastic place to go for some pampering! Sarah Jenkins did an amazing job on my eyebrows(micro blading) and Sarah Morton made my hair gorgeous!", "pics": null, "resp": {"time": 1543499884850, "text": "Thanks for visiting Studio 36. We are so glad to hear that you loved your experience. We strive for excellence"}, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "116675702752681324219", "name": "Michael Driver", "time": 1591656478443, "rating": 5.0, "text": "Very professional , and well done.", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "112006970946299116806", "name": "Krystal WiddaKay", "time": 1571542537133, "rating": 5.0, "text": "I love the privacy of individual rooms", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "102936907829530282431", "name": "Bernadette Jenkins", "time": 1559943509412, "rating": 5.0, "text": "Very nice place. There esthetician Sarah Jenkins is beast!!!!", "pics": null, "resp": {"time": 1561250496469, "text": "Sarah Jenkins is definitely the best! We love her and we are so glad you loved her as well. Thank you for visiting us and we look forward to seeing you again soon"}, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "104793761528694083435", "name": "Jeremy Evans", "time": 1598917011898, "rating": 5.0, "text": "Awesome and chic", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "100969623654863885719", "name": "April Holmes", "time": 1620652335575, "rating": 5.0, "text": "The entire staff is very nice and they keep everything sanitized and very clean.  Got my first Brazilian wax from Elizabeth a few months ago and I haven’t looked back since!!  She made me so comfortable doing the whole process and did a great job. I highly recommend her for any of your waxing or facial needs. You won’t be disappointed!!", "pics": null, "resp": null, "gmap_id": "0x887d49101e64f5e3:0xd9bed871d9bead8a"}
{"user_id": "115909509003322600825", "name": "Latisha Mack", "time": 1622575655950, "rating": 5.0, "text": "The woman that performed my waxing was very patient and comforting. It was my first time back in April... When I went back for my maintenance she was just as kind. I definitely will continue going to then only and I plan on getting more services.", "pics": null, "resp": null, "gmap_id": "0x887d49101e64f5e3:0xd9bed871d9bead8a"}
{"user_id": "100103272698207119170", "name": "Allison Burleson", "time": 1620660372454, "rating": 5.0, "text": "Elizabeth is absolutely wonderful! I had a great first-time experience here & even got a package from them! I cannot recommend sugarworks enough!", "pics": null, "resp": null, "gmap_id": "0x887d49101e64f5e3:0xd9bed871d9bead8a"}
{"user_id": "106924186805416230489", "name": "Deshonda Williams", "time": 1604018419913, "rating": 5.0, "text": "I had an amazing experience. The place was clean and the staff was super nice. I had my first Brazilian done and it was not as bad as I thought. I cant remember who did my Brazilian, but she was super nice, didn't make me feel weird or uncomfortable, and I had an amazing experience. I plan to go back and I would recommend this place to anyone. Worth the drive and the money. Great prices and super easy to schedule. 5 stars, highly recommend", "pics": null, "resp": null, "gmap_id": "0x887d49101e64f5e3:0xd9bed871d9bead8a"}
{"user_id": "115621895451649991357", "name": "Mya Owens", "time": 1615410909127, "rating": 5.0, "text": "I really enjoyed my experience at Sugar Works! The atmosphere is awesome! I have already booked my next session!", "pics": null, "resp": null, "gmap_id": "0x887d49101e64f5e3:0xd9bed871d9bead8a"}
{"user_id": "114525562304164870934", "name": "Cynthia Armstrong", "time": 1620440426419, "rating": 5.0, "text": "Elizabeth is friendly and does great work, she makes you feel very comfortable.", "pics": null, "resp": null, "gmap_id": "0x887d49101e64f5e3:0xd9bed871d9bead8a"}
{"user_id": "104744123547394734383", "name": "Ashley Figueroa Cifuentes", "time": 1614726200757, "rating": 3.0, "text": "Went for a Brazilian sugaring and I have had it done before, but I have never walked out of a place with hair still on me.\nThat was the whole point of getting it done.\nPrice was good but unsure if I'll go back or not. I bled more because she kept going over places that obviously had hair left.", "pics": null, "resp": null, "gmap_id": "0x887d49101e64f5e3:0xd9bed871d9bead8a"}
{"user_id": "105820455531840434690", "name": "lashunda mcquirter", "time": 1605725306705, "rating": 5.0, "text": "I would recommend Sara to anyone. She was very professional and super gentle. My lashes look very natural just the way I wanted them. Book her she’s great.", "pics": null, "resp": null, "gmap_id": "0x887d49101e64f5e3:0xd9bed871d9bead8a"}
{"user_id": "116587989657542583483", "name": "J Z", "time": 1581367025906, "rating": 5.0, "text": "Today was my first sugaring experience with Anna K! She was simply AMAZING to me especially with this being my first time doing anything to my lady area other than shaving. The environment is so calming/relaxing! My skin is so soft and looks amazing too! I will definitely be coming back here for all of my beauty needs. Thank you Anna for being so amazing to me❤️\n-Jerrica", "pics": null, "resp": null, "gmap_id": "0x887d49101e64f5e3:0xd9bed871d9bead8a"}
{"user_id": "103944521421398097400", "name": "Hannah Fisher", "time": 1599679890418, "rating": 5.0, "text": "Very clean & everyone is so friendly & kind!", "pics": null, "resp": null, "gmap_id": "0x887d49101e64f5e3:0xd9bed871d9bead8a"}
{"user_id": "104465527167496052306", "name": "Megan Miller", "time": 1568935033024, "rating": 5.0, "text": "Great new place. Very Clean. Service was quick and professional / friendly. Will definitely be returning!", "pics": null, "resp": null, "gmap_id": "0x887d49101e64f5e3:0xd9bed871d9bead8a"}
{"user_id": "111733046128505788526", "name": "Lisa McCrory", "time": 1598554168765, "rating": 5.0, "text": "Very professional and clean.", "pics": null, "resp": null, "gmap_id": "0x887d49101e64f5e3:0xd9bed871d9bead8a"}
{"user_id": "103685647865399342615", "name": "monica mcleod", "time": 1596076012374, "rating": 5.0, "text": "Over two years ago, I found this business on Google while searching for lash technicians and gave her a chance. That was one of my best decisions I ever made. Tia(owner) is outstanding and well knowledgeable in her profession. It is always, I mean always clean, organized, and welcoming here. I am constantly getting compliments on her services and being asked for her contact info. Great services! Very satisfied customer here!", "pics": null, "resp": {"time": 1596204820050, "text": "Thank you sweets!!!!"}, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "116438138533332134432", "name": "Kaitlin Moore", "time": 1595869804537, "rating": 5.0, "text": "Absolutely A D O R E the owner (Tia). She has been doing my lashes and brows now for almost 2 years and I wouldn't trust anyone else's hands BUT HERS! I don't even look in the mirror to check behind her work it is perfect EVERY SINGLE TIME! I always enjoy myself when I sit her chair!  She has a loyal customer in me for LIFE!", "pics": null, "resp": {"time": 1595874764819, "text": "Absolutely elated I've gained you as client.\n\nThank you"}, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "112085973026398930195", "name": "Kaytlyn Grier", "time": 1596073841704, "rating": 5.0, "text": "Tia is amazing at what she does!! I take my 6 year old daughter to get her hair done twice a month and she has so much patience with her and my daughters hair always turns out so cute! I highly recommend her!!!", "pics": null, "resp": {"time": 1596204759767, "text": "💕💗💕💗💕"}, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "107984944655926075522", "name": "Alicia Harvey", "time": 1596323870038, "rating": 5.0, "text": "I love RTC Threading! She is very professional, clean and affordable. I highly recommend this place!", "pics": null, "resp": {"time": 1596260529984, "text": "Thnk you"}, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "115752204324885138279", "name": "Rome Calloway", "time": 1587926915337, "rating": 5.0, "text": "First and foremost I love this establishment ! This is the best lash and brow studio that I have been to in the wiregrass and surrounding area ! I hate to sound a little extreme but the establishment is just that awesome! I myself along with some of my associates have made this our permanently destination! The professionalism ,services and cleanliness is just awesome! Please do not believe a word I've said but go and see for yourself! I guarantee you will not be disappointed!", "pics": null, "resp": null, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "110194442637578853507", "name": "Shantell Jones", "time": 1590609714347, "rating": 5.0, "text": "Latia is beautiful inside and out. Very kind and courteous. Her shop is clean and she and her staff gave superior customer service. She has definitely gained a returning customer in me!", "pics": null, "resp": {"time": 1590690805808, "text": "Thank you and see you soon"}, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "109741581191529162739", "name": "Liz Colter", "time": 1593636350783, "rating": 5.0, "text": "Had my eyebrows done by Mrs.Tia and i love them. She was super sweet and the energy in her shop is amazing. I will be returning to her again.", "pics": null, "resp": {"time": 1596072712070, "text": "Thank you"}, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "105684199104168656604", "name": "Quinisha Williams", "time": 1587949103728, "rating": 5.0, "text": "I was very pleased with my eyebrows and lashes. My eye lashes looked so natural. I went to another salon prior to RTC and they had me looking like I was going fly away if blinked. Rtc got me right. I had a wonderful experience with her.", "pics": null, "resp": {"time": 1596774366150, "text": "Thank you"}, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "110876362049961862910", "name": "Breianna Brown", "time": 1596079848391, "rating": 5.0, "text": "LaTia does great work and has been threading my brows for years.I recommend her to everyone because you won’t be sorry.Luv Ya Sis!\n\n-Breianna B. :)", "pics": null, "resp": {"time": 1596204834661, "text": "Thank you!!! 💗"}, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "117463533501748923508", "name": "Angie Jackson", "time": 1596069591247, "rating": 5.0, "text": "Great customer service and great work. Love the energy and nice environment.", "pics": null, "resp": {"time": 1596070091566, "text": "Thank you love to have you as a client"}, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "103186690125687098119", "name": "Kristi Edwards", "time": 1588701567537, "rating": 5.0, "text": "Wow what an awesome job!! Great customer service!! Mrs. Tia thank you so much for shaping my brows..Definitely recommended!! Awesome Job!!! Greatly Appreciated!!", "pics": null, "resp": {"time": 1589775579183, "text": "Thank you and hope to see you soon"}, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "108078084050776711868", "name": "Sara Beck", "time": 1596077876526, "rating": 5.0, "text": "Honestly want go to anyone else to thread my brows!! She does such an amazing job!!! You want be disappointed!", "pics": null, "resp": {"time": 1596204864110, "text": "💗💕💗💕 miss you girl"}, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "116070182510854140064", "name": "denzell adams", "time": 1596062878779, "rating": 5.0, "text": "She did a fantastic job with my eyebrows very relaxed and very sweet.", "pics": null, "resp": {"time": 1596070411684, "text": "Thank you"}, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "100599280883141543269", "name": "Jennifer Stewart-Gray", "time": 1596067711892, "rating": 5.0, "text": "Very professional, knowledgeable and friendly as an added bonus. No one else can touch my brows.", "pics": null, "resp": {"time": 1596070430315, "text": "Thank you"}, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "103682946384522194561", "name": "Laurie Waddell", "time": 1598553622312, "rating": 5.0, "text": "Wonderful  the  owner  was  great  and  her  photos  were  beautiful", "pics": null, "resp": null, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "113791540852562160470", "name": "Bhumi Chaudhary", "time": 1588212380921, "rating": 5.0, "text": "She did really good job..i am very satisfied with this place", "pics": null, "resp": null, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "114256237193876629163", "name": "Julie Young", "time": 1596075249842, "rating": 5.0, "text": "Very professional and clean establishment always welcoming", "pics": null, "resp": {"time": 1596204785351, "text": "Thanks ju 💗"}, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "101454563124456209260", "name": "Sheon Floyd", "time": 1596074987782, "rating": 5.0, "text": "Love her love her love her !!! Her shop is amazing great personality and supper professional!!!", "pics": null, "resp": {"time": 1596204772716, "text": "Thanks 💗"}, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "103690196989979528095", "name": "Cedric Banks", "time": 1597010526715, "rating": 5.0, "text": "Love the work and how the place is well keeped", "pics": null, "resp": {"time": 1597014177179, "text": "Thank you 🤞🏽"}, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "112532037327852936601", "name": "Brittany Townes", "time": 1596067416679, "rating": 5.0, "text": "Very professional and such a sweet lady. I will be returning", "pics": null, "resp": {"time": 1596070252188, "text": "Thank you"}, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "106901589463318302660", "name": "jazzb 12", "time": 1589214283335, "rating": 5.0, "text": "Amazing WORK... GREAT customer service", "pics": null, "resp": {"time": 1596774356922, "text": "Thank you"}, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "115036040219178760019", "name": "Kimberly Smith", "time": 1598559249826, "rating": 5.0, "text": "She was amazing!!!", "pics": null, "resp": null, "gmap_id": "0x8892936bda001247:0x852931336e2e91dd"}
{"user_id": "103681112109800019699", "name": "Micah Davis", "time": 1615586280063, "rating": 5.0, "text": "Every time I come they are always so nice and I am in and out in less than 15 minutes but my eyebrows always look FANTASTIC! Best place to get your eyebrows threaded in Etowah County", "pics": null, "resp": null, "gmap_id": "0x888a3952c68042d9:0x3b1f32bb3398f194"}
{"user_id": "110677535468835442912", "name": "Trisha Brown", "time": 1623719069223, "rating": 2.0, "text": "They really don't know what they're doing!\nRude!!!", "pics": null, "resp": null, "gmap_id": "0x888a3952c68042d9:0x3b1f32bb3398f194"}
{"user_id": "109878841834289375608", "name": "visco sheep", "time": 1615327294244, "rating": 5.0, "text": "They always do an amazing job. Only place I go for brows.", "pics": null, "resp": null, "gmap_id": "0x888a3952c68042d9:0x3b1f32bb3398f194"}
{"user_id": "103498932819141948008", "name": "April A", "time": 1620638559180, "rating": 5.0, "text": "Ask for Bonnie she's the best", "pics": null, "resp": null, "gmap_id": "0x888a3952c68042d9:0x3b1f32bb3398f194"}
{"user_id": "108550042941547762061", "name": "Brittany Jeter", "time": 1599835333277, "rating": 5.0, "text": "Best place ever. They do an amazing job", "pics": null, "resp": {"time": 1615317527972, "text": "Dear Brittany\n\nThank you for taking the time out to rate us. We’re happy to hear that you had a great experience with us.\n\nYou can also pre-book your appointments at www.lashandbrowspa.net\n\nHope to see you again soon.\n\nRegards,\nLash & Brow Spa"}, "gmap_id": "0x888a3952c68042d9:0x3b1f32bb3398f194"}
{"user_id": "105481758072787924678", "name": "Rita Hall", "time": 1595858126684, "rating": 1.0, "text": "Paid $80.00 for eyelash extensions and they starting falling out the next day .within 4 days they all fell out.", "pics": null, "resp": null, "gmap_id": "0x888a3952c68042d9:0x3b1f32bb3398f194"}
{"user_id": "109539348123890900071", "name": "Sandra Menyweather", "time": 1596341794694, "rating": 5.0, "text": "Professional Business, Neat and Clean.", "pics": null, "resp": {"time": 1615317512526, "text": "Dear Sandra ,\n\nThank you for taking the time out to rate us. We’re happy to hear that you had a great experience with us.\n\nYou can also pre-book your appointments at www.lashandbrowspa.net\n\nHope to see you again soon.\n\nRegards,\nLash & Brow Spa"}, "gmap_id": "0x888a3952c68042d9:0x3b1f32bb3398f194"}
{"user_id": "106938349173122473445", "name": "Gigi Delgado", "time": 1563512876698, "rating": 5.0, "text": "Was such a great place to get amazing eyebrows so upset they closed their both down in the Gadsden mall grew so attached to them now I have no place to go for my eyebrows :(", "pics": null, "resp": {"time": 1564390531267, "text": "Hello Gigi,\n\nWe would be back in Gadsden shortly, do follow us on Facebook or Instagram to stay updated. Look forward to serving you soon.\n\nRegards,\nLash & Brow Spa"}, "gmap_id": "0x888a3952c68042d9:0x3b1f32bb3398f194"}
{"user_id": "111403052956941257250", "name": "Jennifer M", "time": 1585941256042, "rating": 5.0, "text": "Very friendly and comfortable atmosphere!!", "pics": null, "resp": {"time": 1593039790722, "text": "Dear Jennifer,\n\nThank you for taking the time out to rate us. We’re happy to hear that you had a great experience with us.\n\nYou can also pre-book your appointments at www.lashandbrowspa.net\n\nHope to see you again soon.\n\nRegards,\nLash & Brow Spa"}, "gmap_id": "0x888a3952c68042d9:0x3b1f32bb3398f194"}
{"user_id": "117935547341719816232", "name": "Jeremy Bartlett", "time": 1487277042214, "rating": 5.0, "text": "My wife was so excited after Patel did her eyebrows. They looked so good and she was so sweet and friendly", "pics": null, "resp": {"time": 1511848121408, "text": "Hello Jeremy,\n\nWe are delighted to know that your wife was happy with the results. We look forward to welcoming her soon to try our other services. Try booking an appointment through our website www.lashandbrowspa.net\n\nWe are running some exciting offers in December, do follow us on Social Media to stay updated\n\nwww.facebook.com/lashandbrowspa\nwww.instagram.com/lashnbrowspa\n\nRegards,\nLash and Brow Spa"}, "gmap_id": "0x888a3952c68042d9:0x3b1f32bb3398f194"}
{"user_id": "113194739607585403921", "name": "Sheila Allsup", "time": 1622988363152, "rating": 1.0, "text": "I had no idea that a haircut could be this bad. I thought a first year student could give a neckline haircut. My hair won't lay down and to short to go somewhere for someone else to fix. I'll be wearing a wig for a while", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "105406946338258204686", "name": "Martella Owes", "time": 1615333546649, "rating": 5.0, "text": "Best place to go get eyebrows waxed and eyelashes done ! I had the individual medium eyelashes done as you can see they look more natural! I also got my eyebrows wax they offer threading 🧵 for eyebrows as well . Excellent work as always ! My eyelashes last anywhere from 2-3 weeks !!! Very reasonable price !!! Very courtesy!!! I just love ❤️ love ❤️ UNICUT HAIR DESIGN", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP7xqTlrF7-wRYHHX12kSehXf2MKGybmXjKvDIN=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "100162373644741817307", "name": "Erica Morris", "time": 1620488119207, "rating": 5.0, "text": "Kiran and Sam are super sweet! My brows and lashes are always beautiful! They always provide prompt and professional service.", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "111415358284985507554", "name": "Vicky B.", "time": 1616943150117, "rating": 5.0, "text": "I didn’t know this place was here until I passed by after eating and I went in to check it out it’s clean neat and the lady who did my eyebrows was really nice ... she made me feel comfortable and it didn’t take long at all ... it wasn’t busy or crowded which I liked I enjoyed her conversation and she was cool ... I will be back again...", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM6nR67fw6DEdNK1AXfFQGXgYHmUJymFuJgfgLh=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "104363682611057698499", "name": "Mrs.Ciara Freeman", "time": 1617734957598, "rating": 5.0, "text": "In love with her thread work!😃", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP4RCWkeBoYPqc3Elos02mzw8uMkIy8c0IuoBjR=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "114582549760029895688", "name": "Felicia Goodloe", "time": 1618533760882, "rating": 5.0, "text": "Eyebrows threaded. Awesome results and friendly service", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "103211641626397770927", "name": "Jeff Mack", "time": 1608825816548, "rating": 5.0, "text": "Real friendly staff. Quick service, great haircut. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "116554719853572062108", "name": "Sydney Valentine", "time": 1603213435879, "rating": 5.0, "text": "The absolute BEST place to get your eyebrows threaded or waxed!! Everyone is so kind and they do amazing work! Highly highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "116616426063815587949", "name": "Cicely Renae", "time": 1580762970591, "rating": 5.0, "text": "I had a very awesome expiriance today at unicuts Kiran did an amaz ing job fixing my hair!! I will recommend them to everyone!!! I've included before and after pics", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNZOpnS2wE1hjHtSgDDavdFTrLjxos4e9zhdL2i=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOc4QQBCGjEAS8TDBFlLYesh0vATpFe1iBD_uRw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMU6srHabHnpPr5RmlvLKxKfgGUkbThU1Tas_Hu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPoLWEX4eiK6zUN0HpIsJJgl1adurSb27h3rGqU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMqHGfqCjMVBDs0oPBZZIqbTK_WqP-mgJgOJQQo=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "107173345623220236902", "name": "Sarah Woodham", "time": 1576433275897, "rating": 5.0, "text": "Did such a great job on my hair and eyebrows, for a very good price! I just got a couple inches off, but they did a much better job than many have with my hair. My hair is super fine but thick and I came in a with a few large knots in my hair, but they managed to brush them all out without ripping out my hair!! My eyebrows look amazing too, no hair missed. Thank you!", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "104533057307447910345", "name": "Jamisha Robinson", "time": 1592432262351, "rating": 5.0, "text": "It was awesome, the lady who does my eyebrows is so polite and sweet. Fast service and quality work. ❤", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "102120332704426358467", "name": "Tracy Kelton", "time": 1592425433338, "rating": 5.0, "text": "Very quick service. My husband has a very simple cut, but it looks great", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "114243555811351818447", "name": "Janita Mattison", "time": 1591126840406, "rating": 1.0, "text": "Idk what this lady done did but my eye lashes basically got infected.. I should known the excessive amount of glue she put on it bothered me every single day until I couldnt take it anymore and as soon as I took them off it was clear as day I have a bruise on my eye lid .. never again good prices though but I see why", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "106361022990199835542", "name": "Jeni Martin", "time": 1596554978515, "rating": 5.0, "text": "Love this place. Love the owners", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "108780380024553981355", "name": "Barbie Doll", "time": 1600555863676, "rating": 4.0, "text": "My favorite place to get my eyebrows done right...", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "104766095612291798245", "name": "Nilarun Chowdhuri", "time": 1609202621419, "rating": 4.0, "text": "Covid restrictions in place with temp check and mandatory face masks. No wait times. Can schedule over phone within 30 minutes of call most of the time.", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "107953851867432779155", "name": "Rachel Frison", "time": 1617396662304, "rating": 5.0, "text": "Nice service", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "110222493587031957390", "name": "Brianna Lipford", "time": 1579566239681, "rating": 5.0, "text": "They were so nice i got hair color and cut and my grandma got a cut which came out to only 105 all together they are so nice and i live my hair and so does my grandma", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "110222493587031957390", "name": "Brianna Lipford", "time": 1579566239681, "rating": 5.0, "text": "They were so nice i got hair color and cut and my grandma got a cut which came out to only 105 all together they are so nice and i live my hair and so does my grandma", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "111346164587272707447", "name": "Victoria York", "time": 1551125274243, "rating": 5.0, "text": "I wish I could give Unicut more than 5 stars! My hair was severely damaged after a failed perm. I walked into Unicut not expecting to get the “high end salon” experience. I was wrong! The owners are AMAZING, professional and made my hair have life again! My mom was with me and had her hair done too and it completely made her look like a new person. I will never go anywhere else! The prices are unbeatable and the service is superb!", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "114401630536534296089", "name": "Audrina Ward", "time": 1579904299909, "rating": 5.0, "text": "Great job! Got a good deal on products too.", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "106521164449175897232", "name": "Marty White", "time": 1530374023080, "rating": 5.0, "text": "This place flys under the radar and is NEVER busy. But to be honest...this is best eyebrow threading place I have ever been to in my entire life.  I live in New Orleans and will happily let my brows grow out wild so I can come here and let them work. They are insanely nice always smiling and the atmosphere is great.  I refuse to go to anyone else!", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "114896610234561869098", "name": "Tina Beech", "time": 1508610445986, "rating": 5.0, "text": "Super friendly owners! The lady who cut my hair is awesome!! Love my new style!! Great prices! Definitely will return.", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "108670863714341853694", "name": "Heather Smith", "time": 1402513976064, "rating": 5.0, "text": "This clean, friendly salon is where my family will be going from now on. We just moved to Mobile a few months ago and are relieved to finally have found a great haircut at a great price. One of the owners even demonstrated how \"eyebrow threading\" works, which was cool as hell. She cut my husbands hair and is very good at what she does. I will be recommending Unicut to my friends.", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "115925732804050982938", "name": "Margaret Mathews", "time": 1569256084792, "rating": 5.0, "text": "Had been through 8 salons since moving back to Mobile, searching for someone who understood how to cut/texturize short hair. Six of those salons where on the top 10 list of supposedly best salons in the area. Ran the gamut up to $80, none of which were satisfactory. I promise you, I wasn’t being unrealistic. I know what a good short haircut is. Anyway, one day, was in a hurry and needed a cut on short order. Picked Unicuts on a whim, and now Kiran is my hairdresser. Very sweet and definitely knows how to cut short hair. She razor cuts, point cuts, texturizes it big time. And all for $20 + tip. I’m telling you, the struggle is real and I’m so grateful to have found this gem!", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "117102051907344610902", "name": "Dana Isseh", "time": 1530125785336, "rating": 5.0, "text": "Kiran is the best! The only place I found in mobile that does eyebrow threading, which I find is much better than waxing. Everyone is friendly and accommodating.", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "117451890711024419848", "name": "Margaret Henson", "time": 1533383736081, "rating": 5.0, "text": "I am new to the area and have struggled to find a new salon. My hair is mega short and so far the other 2 places I went  just didn't seem to understand my hair. I took a 3rd chance at Unicut and I am so glad I did. Sam not only corrected  my last cut, he cut it better than my hair dresser of 12 years where we lived. Not only did he do fantastic on my hair, I didn't have to pay an arm and a leg. I am not sure what's up in this area, but $40 for a dry cut short hair? Really? I have found my go to hair salon.", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "114757922319477052693", "name": "Christopher Hileman", "time": 1401837102839, "rating": 5.0, "text": "Great customer service. Family owned business with a welcoming atmosphere. Can't beat there price for a men's cut!! Today was my first visit but I'll be back for all my haircuts.", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "114757922319477052693", "name": "Christopher Hileman", "time": 1401837102839, "rating": 5.0, "text": "Great customer service. Family owned business with a welcoming atmosphere. Can't beat there price for a men's cut!! Today was my first visit but I'll be back for all my haircuts.", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "109476717805730778440", "name": "Sharonda Harris-Marshall", "time": 1555775497964, "rating": 5.0, "text": "Best place to get your eyebrows threaded in Mobile!", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "107168292924674439504", "name": "Ursala Cross", "time": 1498856283998, "rating": 2.0, "text": "I just moved to Mobile and heard about this place for eyebrow threading. My eyebrows are very dark, and very thick so if there is a mishap, it can easily been recognized. The woman in the shop who threads had threaded my eyebrows before and knew the look I always wanted. This particular time I went, she thinned my eyebrows so bad that I didn't tip her, and basically asked her \"why would you make them this thin when I asked you not to do this to my face?\" She responded, \"but they look good.\" I told her \"that's not what I asked you. This looks horrible\" I literally felt myself shaking in anger and wanted to curse her out so bad. But I held my dignity, didn't tip her and left. I would not recommend this place, or the person threading brows. She does whatever the hell she wants with your eyebrows and then tries to tell you, \"oh they look good\" Shame on the woman threading and I WILL NEVER VISIT UNICUT AGAIN FOR MY EYEBROWS. IF YOU HAVE THICK, DARK BROWS, STAY AWAY FROM HER. DO NOT GO TO THIS PLACE. DO NOT LET KIRAN THREAD YOUR BROWS.", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "109123283404586852551", "name": "Zaeem Farooq", "time": 1487047776580, "rating": 1.0, "text": "Rip off, owner/hair stylist charge different price everyday. started off charging $7 for hair cut when the newly opened.  next month  was charged $10 and then another trip $13 for same haircut.\nNot going back again. Would not recommend. You never know after hair cut what u will be asked to pay!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "109245216700349341034", "name": "Garland Landers", "time": 1569255866299, "rating": 4.0, "text": "Good hair cut.", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "105365199593879064945", "name": "Rebecca Wright", "time": 1518738302170, "rating": 5.0, "text": "I love getting my hair colored at Unicut. They do an amazing job and the prices can't be beat!", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "114997165208293240423", "name": "Doug Roberts", "time": 1589572228866, "rating": 5.0, "text": "Great haircut and people", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "106222717531224231004", "name": "Rebecca Nelson", "time": 1538700140227, "rating": 5.0, "text": "Very nice and my eyebrows look great ❤", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "115590988704275760656", "name": "Tabatha Thompson", "time": 1531016625646, "rating": 5.0, "text": "I was really impressed with the quality of my cut from this sweet lady!", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "113710524023157094288", "name": "Lai Hoh", "time": 1510324280594, "rating": 5.0, "text": "Ladies  n Men haircut, Eyebrows treading n waxing.Friendly service.", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "113710524023157094288", "name": "Lai Hoh", "time": 1510324280594, "rating": 5.0, "text": "Ladies  n Men haircut, Eyebrows treading n waxing.Friendly service.", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "103123682245441848248", "name": "Charisse Smith", "time": 1560589948889, "rating": 5.0, "text": "She does awesome lashes!!", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "103474449939405005069", "name": "Nikole Rae Stuart", "time": 1521258841765, "rating": 5.0, "text": "Love my cut....will be back!", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "103403507097772752277", "name": "Amanda Webb", "time": 1448185212342, "rating": 1.0, "text": "Website says woman's cut and wash is $15. I was charged $20 and they didn't wash my hair. I provides a picture of the cut I wanted from 4 different angles...the cut I received looks nothing like the picture...also the lady cutting my hair kept getting distracted. In the middle of the cut, she goes to the station next to mine and begins blowdrying the hair of someone who already had a person blowdrying her hair.", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "116474401293328378764", "name": "Steve Giorgianni", "time": 1552227567408, "rating": 5.0, "text": "Great haircuts and great owners", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "108854357562698769516", "name": "Lavon Mccreary", "time": 1555116543054, "rating": 5.0, "text": "Some of the best barbers around", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "116860152665467954673", "name": "Nicole Butler", "time": 1377829155998, "rating": 5.0, "text": "This is a great salon with very friendly owners. I first went to Kiran for an updo for a Mardi Gras ball, now I go to her for haircuts and eyebrow threading too. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "109370332439425321306", "name": "edward ramirez", "time": 1557940609476, "rating": 4.0, "text": "Fast service.", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "102417575767697989967", "name": "Shanavia Thomas", "time": 1437275064798, "rating": 5.0, "text": "Very Friendly, nice..eyelashes and eyebrows be on point!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "115559164096454666865", "name": "Rose", "time": 1461430115797, "rating": 1.0, "text": "Did a HORRIBLE job for 3 girls hair for prom!! Spent 10 minutes on one and not what she wanted and 20 minutes on another, still wrong!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "108867364585231774952", "name": "Ashley", "time": 1493302328713, "rating": 5.0, "text": "Brown threading!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "117189553308850442003", "name": "SABINA SABINA", "time": 1492184335242, "rating": 4.0, "text": "Eyebrow threading is available", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "115559164096454666865", "name": "Rose", "time": 1461430115797, "rating": 1.0, "text": "Did a HORRIBLE job for 3 girls hair for prom!! Spent 10 minutes on one and not what she wanted and 20 minutes on another, still wrong!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d74a6567a75:0x425a6ccccb774afa"}
{"user_id": "112912095683734497143", "name": "Tequila Stephens", "time": 1623338547158, "rating": 5.0, "text": "Tammy and her staff are very professional and kind. They work at a steady but calm pace. My lashes have lasted up to 3 weeks. I went jet sling and my lashes where still on place I recommen Beauty Buzz for all your waxing,Brow, and facial. Needs.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "108778433232215295257", "name": "Andrika Horton", "time": 1623877763246, "rating": 5.0, "text": "Tammy good at lashes. nice atmosphere..clean .. friendly.. they do a great job!!!!", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "107845504323787531899", "name": "Morgan Glenn", "time": 1614969768526, "rating": 1.0, "text": "i went to get my eyebrows threaded and i was highly disappointed even after asking her to fix them (which she had an attitude about) i had to leave & go to my usual place. i also got my lip waxed & there was still wax residue on my lips. 0/10 do not recommend if you have thick eyebrows like me.. The establishment does look nice on the inside though.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "103047937313690564141", "name": "Madison Germany", "time": 1614972463306, "rating": 5.0, "text": "Wonderful threading and lashes place. Neat and clean. Very sweet ladies and beautiful too😜. I go to Tammy and she is awesome. She does my eyebrows all the time. She is friendly and quick too. I absolutely love going to her. I love her service. I would definitely recommend her to anyone needing lashes in the Montclair.  She never disappoints me. Go check her. So convenient.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "104773684414219670232", "name": "Alisha Manjiyani", "time": 1614971765996, "rating": 5.0, "text": "Tammy and Ashley\nThey quick and professional I like the way they do my lashes. I highly recommend them. They pay attention to their work. I will be back", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "116250083793075937267", "name": "Delores Clements", "time": 1617914836618, "rating": 5.0, "text": "I enjoy coming to BEAUTY BUZZ. These young ladies are very good in doing what they do for their customers. I speak very highly for them because they are just that GOOD. I Highly RECOMMEND THEM TO ALL MY FRIENDS and anyone that needs their eyes done.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "106805079743279217974", "name": "Chasity Winston", "time": 1623279030779, "rating": 5.0, "text": "I love it no line no wait she “Tammy “ is the best  come visit service was great", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "112109614651427104738", "name": "sushmitha sukhavasi", "time": 1615070083473, "rating": 5.0, "text": "Tammy is my go girl. She is very gentle. She do my brazilian wax with chocolate wax without hurting me. She is good at lashes. She do my eyebrows perfect. I recommend her.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "102341555099468812264", "name": "Anika Pritchett", "time": 1619806091374, "rating": 5.0, "text": "Tammy is the best I will never go anywhere else unless she does💯💯", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "116733345464245313232", "name": "deepthi a", "time": 1615069954718, "rating": 5.0, "text": "Ashley is just amazing I go for my eyebrows and she does great job. I recommend her.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "114544365674883607717", "name": "Jannet Moreno", "time": 1614692300208, "rating": 1.0, "text": "I went yesterday for eyelash extension and my eyes are itchi, red and still burning, she glued the extension in my eyelid not in my natural eyelash which is the correct way for not causing irritation. I do eyelashes too in California (I'm here visiting) so I asked if the application was 1 hair by 1 just to make sure because I like classic eyelashes not volume, well this are fans with so much glue and all eyelashes the same length, where do you see that natural eyelashes are the same size and she left the corners with no hair. At the end she put a fan on my chest and made me hold it, I think to dry the glue 😏, a good eyelash glue dryes in seconds by itself, so disappointed, and most important they do not wear facemask, thank God I was wearing double, and she was on the phone all time, which had me nervous if she was concentrated or not. I'm not saying everyone will have a bad experience but they have to offer a better service.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "117079003805290172681", "name": "Jametria Hines", "time": 1603989248473, "rating": 5.0, "text": "Tammy was quick and professional. I love when she does my lash and eyebrows. The prices are reasonable as well. I highly recommend them. Very clean and welcoming.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "105541469674418697654", "name": "Audria Bennett", "time": 1612218526432, "rating": 5.0, "text": "I love patronizing with my girl Tammy...she’s very professional,warming, and always upbeat when I go in.I’ve been going here over a year and it never gets tiresome.She does an amazing job everytime I go in.Love my girl Tammy and would recommend her to anybody ❤️❤️❤️", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "113383975236494384081", "name": "Elbony Clark", "time": 1617647796742, "rating": 5.0, "text": "Excellent work. Very friendly and efficient.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "108146120120906361247", "name": "Tam Hajiyani", "time": 1607150050702, "rating": 5.0, "text": "Tammy is just amazing. She does beautiful lashes. I recommend her! She is my girl. She is gentle. She did my brazilian wax too.", "pics": null, "resp": {"time": 1607151064096, "text": "Glad u liked our service hope to see you back soon 😊"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "105033715076689400410", "name": "Yoni Wilson", "time": 1614547574573, "rating": 1.0, "text": "I had to go back twice within one week and still had a bad experience, glue was dropped in my eye (mind you that I wear contact lenses) glue was dropped on my face about four times she was the phone while doing my lashes and had so much glue on the lashes I even brought them with me to show them on the second round and they were still not right! Lashes were separated to the point that they were in my eye. I'm soooo done with this place and would highly NOT recommend this place😡", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "104795352280211887740", "name": "Ashley Ricks", "time": 1603990752422, "rating": 5.0, "text": "My first time was great! I’d definitely recommend friends.. Tammy did my Brazilian Wax very professional .", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "101783215304087062760", "name": "Akelia Maxwell", "time": 1623730975208, "rating": 1.0, "text": "Got a Brazilian wax and 2 weeks ago now I have massive in-grown hairs literally bumps everywhere even on my enter thigh i paid 45$ for mink lashes they fell off the next day my eye brows tint is uneven 🥺 I will never come back again all that money was wasted", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "108196060106624209518", "name": "Terralyn Christian", "time": 1617904039971, "rating": 5.0, "text": "Good staff and fabulous service.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "110118346759339794984", "name": "Sydney Seals", "time": 1597849217382, "rating": 1.0, "text": "I do not typically like to leave negative reviews but I would like to warn people before they have a similar experience. I went to get my eyebrows tinted for my wedding, trying to support a local business in my area. I have very blonde hair.. I see the girl mixing up a BLACK dye. I politely tell her “my hair is very blonde, I don’t want them too dark”- she proceeds to continue mixing said dark dye and tints my WEDDING brows BLACK. I was disappointed but thought maybe it would fade some and start to look more presentable. However when I left & saw it in the light it was terrible (even after 15 min of scrubbing) so I immediately went back, they showed no remorse and had no fix for my black brows. Today when I woke up (brows still black) I also see that she burned my skin while waxing which is painful considering I am having to have my hair dresser re-color my brows to match my hair. In addition I paid ahead of time, yet the technician argued with me about paying for quite some time until awkwardly she agreed to let me leave.  Lastly, they had signs posted telling people to sanitize their hands and wear a mask, neither of which did the technician do. Overall a very poor experience. I hate it, because I do like to support local businesses. However, I would not recommend this shop to friends or family.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "102934080515129111693", "name": "metrowavy", "time": 1590609540450, "rating": 5.0, "text": "Great customer service wonderful fun loving employee Tammy is just a great person she always make me feel welcome an the best with wax an lash just love them.", "pics": null, "resp": {"time": 1592242170614, "text": "Thank you for taking the time out to rate us. We’re happy to hear that you had a great experience with us. Glad you liked our service hope to see you back soon 😊"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "113108201770486670044", "name": "Kayla Snipes", "time": 1595631010891, "rating": 1.0, "text": "I had the worst experience ever! They do not want to honor the Groupon. They will make any excuse to not honor your Groupon.  She gave me one excuse on the phone and  a whole different excuse in person. I was in the chair getting  my service done. When I mentioned the Groupon she stopped the service and said she didn’t have what she needed to do my lashes. When I talked to her on the phone she told me to come on. When I told her I had a Groupon she said they was busy. I showed up anyway when I got there they didn’t have any customers. They rather you show them the Groupon and pay them directly as I have done in the pay. I’m  really upset about this.", "pics": null, "resp": {"time": 1597855234245, "text": "Extremely so sorry for ur experience at one of our locations but due to covid 19 we have less staff and fewer entry for clients that the reason we couldn't set appointment our all the appointment are on the waiting list for 3 weeks but Extremely so sorry for ur experience"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "118067328660304621966", "name": "Jaime Pettaway", "time": 1606877243800, "rating": 1.0, "text": "Did my eyelashes in literally 10 minutes.  It usually takes my girl in Chicago 2-3 hours.  I kept asking are you using single lashes with a \"yes\" response each time.  They looked awful and they were not single.  Never again!", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "117375646141363039427", "name": "Rachel Williams", "time": 1605729380750, "rating": 1.0, "text": "They refuse to give spa facials to people who identify as male. I don’t even know what to say.", "pics": null, "resp": {"time": 1597854981622, "text": "So sorry but or salon is exclusive for women's it is specified on website Google and Groupon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "113413182950308454831", "name": "Latonya Mccall", "time": 1609708284585, "rating": 1.0, "text": "Poor customer service skills", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "103439872340411050379", "name": "Victoria Cason", "time": 1566663633131, "rating": 1.0, "text": "ZERO STARS. This place is terrible. I booked an appointment online for 10 am  (the time they are suppose to open) this morning. Get there and no one was there. Waited till 10:10 then left. Went back at 11 to see if they have opened yet and she said they do not except online appointments even though their website clearly gives you that option. She said you have to call them. Then why does your website say book online? She was so rude and did not try to fix the situation at all even though that is their mistake. I will never recommend anyone to go to the place ever.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "108598989811669449669", "name": "Destiny Thomas", "time": 1584137730459, "rating": 5.0, "text": "Tammy\nThe best experience very gently and caring also the staff is super sweet the work space is very clean also.", "pics": null, "resp": {"time": 1584141489621, "text": "Thankyou so much for your positive feed back glad u liked our service hope to see you again soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "117295971729647316857", "name": "Stephanie Higgs", "time": 1584398649303, "rating": 5.0, "text": "Tamy did such an awesome job on my threading and her hospitality amazing. I will be back.", "pics": null, "resp": {"time": 1592242182220, "text": "Thank you for taking the time out to rate us. We’re happy to hear that you had a great experience with us. Glad you liked our service hope to see you back soon 😊"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "117047709819145221462", "name": "Annza Vas", "time": 1548529061105, "rating": 5.0, "text": "I love how they do their eyebrows there. The other eyebrow place near the same area does not do as great of a job as Beauty Buzz. And Beauty Buzz is cheaper. Unfortunately, I think due to the culture standards, they do not service men. I do not think it is to target males. I've noticed it is the standard. The place where I had my eyebrows done in Houston, also did not service men.\n\nBut they do an amazing job on eyebrows!", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "118265804725766003410", "name": "Janessa Hubbard", "time": 1525921436465, "rating": 5.0, "text": "Rhianna is absolutely amazing. Extremely friendly and patient. I have never voiced a concern that she did not immediately correct. She takes her time and the end result shows that.\nI have used a couple other people in the shop and never had a bad experience. I refer people constantly  and will continue to do so.", "pics": null, "resp": {"time": 1526072026611, "text": "Glad you liked our service hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "114331106477241806453", "name": "Ambassador Tawana Gurley", "time": 1617825661797, "rating": 5.0, "text": "Great Service!!", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "111215943280169213886", "name": "Natquellia Dailey", "time": 1581173430515, "rating": 1.0, "text": "I went to this place to get my eyebrows and eyelashes done. My eyebrows looked great but my eyelashes where horrible so much glue!!!!! It literally took me 2 hours to get them off trying not to pull my real eyelashes out. Will never ever go back again, I’d rather drive to Montgomery Alabama and get my lashes done the right way,  than to go two minutes up the street to this place again.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "112322433940852303131", "name": "JahHara Westry", "time": 1526162058520, "rating": 5.0, "text": "I’ve came here last year in October 2017, been coming back ever since! I really admire the staff they’re really sweet and fun! I would recommend everybody to come here, it’ll be worth your time and money! I’ve done had my lashes done, eyebrows arch and tinted and the results were amazing! Everyone complimented me on them, thank you so much Beauty Buzz! You’re the best!", "pics": null, "resp": {"time": 1529960466070, "text": "Glad you liked our service hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "103466493158190002897", "name": "Lauren Jada Vanderburg", "time": 1566702838180, "rating": 5.0, "text": "These ladies always do a wonderful job threading my eyebrows, and they are reasonably priced! I will continue to go here, and recommend them!", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "113479903058336764292", "name": "Tequita Clayton", "time": 1589573989278, "rating": 5.0, "text": "Tammy did a Awesome job on my eyelashes and eyebrows!", "pics": null, "resp": {"time": 1589597226343, "text": "Glad you liked it hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "117430210254164767518", "name": "Adrienne b", "time": 1555697982686, "rating": 1.0, "text": "Paid for a Brazilian wax and so many hairs were left, she didn’t even wax my backside.  The absolute worse pain I’ve ever been in and I’m still bleeding from it. Other than the Brazilian wax my service was okay, just wish she were more delicate with such a sensitive area. I won’t return for a Brazilian wax there.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "103597348845951847871", "name": "Amena Alkeswani", "time": 1564693381768, "rating": 1.0, "text": "Bought a Groupon for mink lashes. The lashes weren’t mink rather heavy and in chucks. Some fell off in less than 24 hours.  The application was quite clumsy on one of my eyes and the side of my upper eyelid is stuck to my lower eyelid. The lady who did my lashes was nice.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "117464379211673614812", "name": "Junior", "time": 1593980047544, "rating": 1.0, "text": "Paid and scheduled for a appointment for a facial and a massage a month a head of time. Never received a email or a phone call.", "pics": null, "resp": {"time": 1593983768639, "text": "Hello mam we did Email you back and its been just a month we opened back up and we did Email u and said to call the store and make a appointment as our system"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "105058758140479960409", "name": "Trucker Smilez", "time": 1547960058882, "rating": 5.0, "text": "I've been reading some of three reviews and couldn't agree more with three 5star service. Today was my very first time and the ladies that was there was very sweet and fast with service and was extremely professional(their work shows it within itself) I will definitely be going back soon. Please don't change up on me lol", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "106065542842845399824", "name": "SHEnglishh123", "time": 1504586717785, "rating": 4.0, "text": "I enjoyed the experience for the most part. I asked for long lashes and I really did love them. They may have been a bit too thick and one side didn't curl up like the other and they began to irritate my eyes after a few days. I plan on coming back but I would definitely like to have more time spent on my eyes. They are eyes of course. Don't particularly agree with the price for the service either. I had my eyelashes done in Lousiana and not only would it have been 3$ cheaper than here, (I went on a day they had a discount and it was only 17$ where it's normally 22$) she took great time to pay attention to detail and fit the lashes for me personally. She also offered some type of instruction on taking care of them and that I could come back within 48 hours if anything happened. Maybe just some more customer service would've been nice.", "pics": null, "resp": {"time": 1509179326992, "text": "Glad you liked our service hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "108812744432122436765", "name": "Cheryl June", "time": 1594947346494, "rating": 5.0, "text": "Very professional and great experience.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "111359749824741907019", "name": "Morgan Stanford", "time": 1566851832713, "rating": 5.0, "text": "i always get so many compliments on my lashes i send everyone here amazing price clean and great atmosphere", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "110582566851250350226", "name": "Nichole Wuu", "time": 1569634250802, "rating": 5.0, "text": "This place is amazing!! My lashes last about three weeks or longer.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "100208754362029184402", "name": "tameka howlett", "time": 1505528089917, "rating": 1.0, "text": "I had really loved this place at first and recommended them to others, but lately I have been disappointed in the services. A month ago, after less than 24 hrs, my individual lashes came off. Went the next day about it and they seem irritated about my complaint. I just went Tuesday and the next day I woke up with my eye itching & irritated. Now my eyelid is swollen & red. NEVER had this problem. I don't know if they changed the glue they use but something has changed in the 6 months I have been coming here. I won't be returning.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "110419791667371581688", "name": "S Dawn Redmon", "time": 1526059824591, "rating": 5.0, "text": "These girls take care of me! Best threading for eyebrows! individual lashes are amazing and waxing! Omg The wax smells like chocolate. Yummy\nShe fixed my eyebrows and shaped them so I actually have a natural arch!\nI always leave happy saying I’ve got eyebrows and eyes now lol. They are so sweet and kind.", "pics": null, "resp": {"time": 1526072013096, "text": "Glad you liked our service hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "109015140340158526590", "name": "Jasmine", "time": 1505596842792, "rating": 5.0, "text": "I went in for a wax full face wig eyebrows.... The wait was less than 5minutes and my face looked and felt great. The staff were so friendly and quick. Also the atmosphere is great, the music is sooo relaxing. I absolutely loooovvvveeee this place. This was my first time and I definitely will be back🙂😘", "pics": null, "resp": {"time": 1509179395647, "text": "Glad you liked our service hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "110610934252324445240", "name": "Tamika Lutin", "time": 1530904396667, "rating": 5.0, "text": "I absolutely love getting my brows, individual lashes & Brazilian waxing done here @ Beauty Buzz always get five stars from me 😘.. Fast service! Very neat clean & sweet women  whose employeed there!! Thanks ladies 😍❤😍", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "101759281027991944816", "name": "Deidra Palmore", "time": 1556754240306, "rating": 1.0, "text": "The ladies are nice but the mink lashes were horrible. I was charged 160 for a volume set of mink lashes. The lady applied lash extensions glued to the skin of my lids along and underneath my lash line instead of the actual eyelash.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "103145128650899738663", "name": "Nia Geneá", "time": 1505767785288, "rating": 5.0, "text": "Always a great experience. Eyebrows and wax done bi-weekly and monthly. I love them! Worth the visit and very reasonably priced.", "pics": null, "resp": {"time": 1509179454128, "text": "Glad you liked our service hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "108718201268450277412", "name": "Rachel Montana", "time": 1526066676602, "rating": 5.0, "text": "From Lashes to Waxes, this place has you covered. Every experience is personal and done to your liking. The customer service is fantastic and I am never disappointed.", "pics": null, "resp": {"time": 1526071986897, "text": "Glad u liked our service hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "102140400632667539802", "name": "Corey Patterson", "time": 1525353083254, "rating": 1.0, "text": "I was referred to this facility to get my eyebrows threaded. Just recently moved into the area. I usually go to Jasmine Arch in Homewood; however, I wanted to try someone closer to my home. I walked in and the threader was rude and advised me that threading was for women as she and her client that was in the chair laughed at me. I will never return to this establishment. Luckily enough there was another spot on the opposite end of the parking lot that welcomed my business with no issues. Horrible corporate values and customer service.", "pics": null, "resp": {"time": 1525369568903, "text": "We so sorry but our salon is exclusive for women so sorry about it"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "114336921471469297748", "name": "Johnny Harrington", "time": 1497450780035, "rating": 5.0, "text": "These fine folks gave be a killer high and tight. Dude was meticulous with his clippers. I've gotten so many compliments on the fade it's ridiculous.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "102428117884140016436", "name": "Brittany Agee", "time": 1533759998853, "rating": 1.0, "text": "I had a terrible experience with this particular location. I purchased a groupon for mink lashes and a fill. I went in on a Saturday morning to get them done and I was informed that I needed an appointment. I had no issue with that, so I scheduled an appointment with one of the employees for Sunday at 11:30. I got there before the appointment and no one was there. I waited a good 30mins or more before leaving. I called the location a few hours later only for the lady to argue with me about the hours, when they are listed online. After going back and forth with me she offered to do my lashes, um no thanks. I just called groupon and got a refund.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "110388968573431292537", "name": "Consuella Martin-Griffin", "time": 1505042468306, "rating": 2.0, "text": "The installation was beautiful. I got the mink lashes and they felt wonderful and natural.  The very next morning I awoke to find that 3 lashes had fallen out. Another lashes feel out the same day. Now they are flared and spaced apart after only 3 days. I paid 40 wasted my time and money. The repair will cost 20.00. Thanks Beauty Buzz!\nI don't know how to respond besides through edit but I went to Eastwood.  I also called the store and spoke with someone before posting.  I explained the situation and told her that I was going to do a review and why. She responded with o.k.. And I didn't even shower yet.  They came out just that fast. Thanks for responding. 35206.Cah 6435729 call me please", "pics": null, "resp": {"time": 1505010057013, "text": "Hi mam really so sorry we can fix ur lashes and we don't charge for any refill till 10 days but what location did u go? Can u plz let me know so we can figure it out what's going on"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "116618342186572889931", "name": "Jamie", "time": 1534709459695, "rating": 5.0, "text": "Laila was great!!! Very fast, professional, & knowledgeable. I will most definitely be a returning customer.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "107379089051100838657", "name": "Amit Bharwani", "time": 1502912439631, "rating": 5.0, "text": "They did my eye brows. People are good here. Nice place to be around", "pics": null, "resp": {"time": 1502917226417, "text": "Glad you liked our service hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "111457538459138685061", "name": "lady foxx", "time": 1542865962197, "rating": 5.0, "text": "Awesome place really great and resonable prices i would definitely recommend and very clean", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "104288130603640058789", "name": "Regina Duncan", "time": 1579813178538, "rating": 5.0, "text": "Love my lashes and brows", "pics": null, "resp": {"time": 1579887322500, "text": "Glad you liked our service hope to see you again soon 😊😊"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "103802659445368316114", "name": "Kristen Green", "time": 1505765543865, "rating": 5.0, "text": "Always enjoy my experience here very nice and professional ladies always do a great job with my mink lashes and threading", "pics": null, "resp": {"time": 1509179443120, "text": "Glad you liked our service hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "110843881335856660458", "name": "cynthia “Angel kisses” Cynthia", "time": 1526148010353, "rating": 5.0, "text": "Beautiful service A1i been a loyal customer over a year always good job done my mink lashes and threading is always beautifully done", "pics": null, "resp": {"time": 1526151403563, "text": "Glad you liked our service hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "103917558208633425610", "name": "Ava Richburg", "time": 1493092240693, "rating": 5.0, "text": "Nice people, takes real good  care of you , allways smiling and warm personality. The staff really know how to introduce you to new beauty buzz ,procedures, also the place is always kept clean.", "pics": null, "resp": {"time": 1493137212094, "text": "Thank you for ur appreciation. Glad you liked our service hope to see you back soon😁😊"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "107558600268843924284", "name": "Delores Clements", "time": 1480609943211, "rating": 3.0, "text": "You don't value your customers  time. You do great service when you get here, but my time is valuable too and others as well. I sat here for 20 minutes and you lost 4 customers. Why???", "pics": null, "resp": {"time": 1486178767750, "text": "Sorry for any inconvenience we really apologize for that and next time will not repeat it"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "113994662418051564065", "name": "Ty TheDoll", "time": 1514766339638, "rating": 1.0, "text": "Today was my first time going to this place ... today is New Year's Eve and it was last minute for me I usually go to the mall to get my lashes and eyebrows done but I googled for lash bars and it was closer than the mall ... I got there at about 4:45 and when I came in there was a lot of people in the waiting area and also in chairs waiting there was one worker and I actually didn't see her when I first walked in so I was looking around and then she yelled at me asking what did I need and I told her \"I'm looking at the price list\" and she said again what do you need and I said \" lashes and eyebrows \" I looked for the price menu there wasn't a price for mink individual lashes so I asked her and she said there were different prices for everything so I asked again \" how mush are individual mink lashes\" she said 35 and I said ok ... also what made me go was because when I googled it there was an ad for free brows with any services ... so I waited for about an hour she said she will show me the two types of mink lashes that she has and I made my selection and sat back down .. she had me to sit in her chair then asked me if she can get the girl that came in after me and I said ok then she said she would do one of my eyes then do her brows and come back to me I said ok but then she told me she had a deal for $55 for eye brows and lashes that's when I told her about the ad and she acted like she didn't know what I was talking about .. them she said that the lashes will be $55 not $35 she. As I ally waited until all of the people that were there when she told me $35 were gone to change the price so that I can change my mind and get something easier because she was in a rush ! When I told her that she changed the prices she got loud with me and fussed at me as if I was lying on her when she was the one who told me 35 so I still was willing to get a services even though I was lied to but everything went left because she was rude I waited for over an hour for nothing and she still skipped over me and tried to brush something off in me so that she can hurry to get to church ! Like my time wasn't important !! Over an hour ! My 2 year old son and husband had to sit in the car the whole time and she locked the door and turned the open light off at about 5 when there was a sign on the door saying they would be open at until 7!! I will never go back I do not like how I was treated ! Very poor customer service ! Unprofessional ! Rude! Smart mouthed! Inconsiderate ! Dishonest false advertising bad business ! I will NEVER return !!", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "116867543004675613651", "name": "Lantrez Wilson (Leo)", "time": 1570887260592, "rating": 5.0, "text": "Loved it was in and out the lady was very friendly", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "104288130603640058789", "name": "Regina Duncan", "time": 1579813178538, "rating": 5.0, "text": "Love my lashes and brows", "pics": null, "resp": {"time": 1579887322500, "text": "Glad you liked our service hope to see you again soon 😊😊"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "105658168930247846740", "name": "Taylor Evans", "time": 1508157591677, "rating": 5.0, "text": "Saturday was my first wax ever and I was so nervous but the lady was so sweet and the comforting that i wasnt as nervous and turns out that getting a wax isnt that bad! im so going back again!", "pics": null, "resp": {"time": 1509179506668, "text": "Glad you liked our service hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "111404063844961682785", "name": "Sandy Salter", "time": 1526496561546, "rating": 5.0, "text": "I always get good service and I have been happy with the service provided", "pics": null, "resp": {"time": 1529960458581, "text": "Glad you liked our service hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "113859059584763539504", "name": "Nise Taylor", "time": 1538709175808, "rating": 2.0, "text": "My eyebrow arch and tint and eyelash tint was almost unnoticeable. Forestdale location does a much better job.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "113859059584763539504", "name": "Nise Taylor", "time": 1538709175808, "rating": 2.0, "text": "My eyebrow arch and tint and eyelash tint was almost unnoticeable. Forestdale location does a much better job.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "110151956913156508176", "name": "La'Ventra Rutledge", "time": 1505599468343, "rating": 5.0, "text": "I got my eyebrows & Henna done today the service was 1st class & I\"m Loving my artwork !!!! Sweet Ladies & Great Work !!!!", "pics": null, "resp": {"time": 1509179419352, "text": "Glad you liked our service hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "117369467318385969972", "name": "AYELEGAN Mensah", "time": 1507938089868, "rating": 5.0, "text": "Always a pleasure to be there. Got everything done the way I wanted.", "pics": null, "resp": {"time": 1509179488642, "text": "Glad you liked our service hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "107135285449333993556", "name": "Meeka Nycole", "time": 1525815670947, "rating": 1.0, "text": "If I could leave no stars I would. Before today I’ve received services from here twice, both times from Rhianna. But today she jacked my eyebrows up so bad I’m in tears writing this review. And when I brought it to her attention the gash of hair missing on one eyebrow and how much thinner she made that eyebrow opposed to the other she tried to make it seem like that eyebrow was already messed up & refused to take responsibility for what she had done. I told her we all make mistakes and she said “Not me.” Her arrogance is probably why she’s messing eyebrows up. I would have gone back & remained a loyal customer if she had only owned up to her mistake or tried to rectify it instead of trying to start an argument with me. I wish I could post a picture of how awful my eyebrows look. I don’t wear makeup so there’s no way of masking it until it grow back.", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "116809918108035265369", "name": "Nekia Mullins", "time": 1620929221543, "rating": 5.0, "text": "Tammy", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "112808102393058750521", "name": "BRIGITTE WILSON", "time": 1538450011087, "rating": 5.0, "text": "It was so awesome I love them", "pics": null, "resp": {"time": 1538465156089, "text": "Glad you liked our service hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "106292567859540286523", "name": "Brandy Moore", "time": 1530314822114, "rating": 5.0, "text": "The best place to get threaded in Birmingham!💗", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "108468394521998033603", "name": "Katryna Gholston", "time": 1564077118637, "rating": 4.0, "text": "Friendly service", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "104381553801777409870", "name": "Cocoa100 Stinson", "time": 1556238488734, "rating": 5.0, "text": "It was great", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "110506865928992644471", "name": "Yamecia Whitt", "time": 1526073057399, "rating": 5.0, "text": "They are the absolute best ❤️", "pics": null, "resp": {"time": 1526073799597, "text": "Glad you liked our service hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "102842378424344906646", "name": "Tiffany Lee", "time": 1571184599003, "rating": 5.0, "text": "It was quick and professional", "pics": null, "resp": {"time": 1571186796083, "text": "Glad you liked it hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "107275055251502717879", "name": "Sharon Calhoun", "time": 1560050635330, "rating": 5.0, "text": "Got my eyebrows threaded", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "101725916416942351590", "name": "Ja'Lena Catalano", "time": 1554116241117, "rating": 5.0, "text": "Excellent service", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "110512062667396143878", "name": "Dianne DFGeog", "time": 1549499104494, "rating": 5.0, "text": "Great personal service", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "106769263194597111128", "name": "Jazmine Jones", "time": 1531623449574, "rating": 1.0, "text": "Very disappointed, when I left the location I was bleeding.🤷🏽‍♀️ Eyebrows have no arch,left  looking the same way I walked in.🤦🏾‍♀️", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "117152355811592743231", "name": "Jennifer Holt", "time": 1548987085776, "rating": 2.0, "text": "Always 1 person on duty", "pics": null, "resp": null, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "103058763325603608739", "name": "Mikala Garrett", "time": 1519952359379, "rating": 5.0, "text": "Nice eyebrows", "pics": null, "resp": {"time": 1519962811799, "text": "Glad you liked our service hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "107235833900287304782", "name": "Shabria Williams", "time": 1505600948632, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1509179429629, "text": "Glad you liked our service hope to see you back soon"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "101799197642446634759", "name": "Lady Bryant", "time": 1489824720531, "rating": 1.0, "text": "Lashes fell off and they wouldn't repair", "pics": null, "resp": {"time": 1489825447161, "text": "Hello mam we extremely sorry abt ur experience but we always offer 2 refill free but we extremely sorry what ever happened with you we will refund ur money or will refix ur lashes u can call and make appointment with Amy thankyou and so sorry"}, "gmap_id": "0x888910f59209dd45:0xb2e57b0ee96556b2"}
{"user_id": "104840882622246919050", "name": "Amber McLeod", "time": 1581685781119, "rating": 5.0, "text": "Did a major overhaul on the hair! Korey did a fantastic job. Just moved back to town and needed a haircut, and Korey did not let me down. Even donated my locks to someone in need! Thanks again Korey!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNEnmQNbJiNTxd6Tt7Hpvy3yWznQBhZ39w2uw37=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a61f96ea20655:0x14238b725edd250"}
{"user_id": "114948426735207445631", "name": "Kassadi Van Vleet", "time": 1573952833006, "rating": 5.0, "text": "Korey and Nichole do amazing work!! They are so nice and professional. I don’t let anyone else touch my hair.", "pics": null, "resp": null, "gmap_id": "0x889a61f96ea20655:0x14238b725edd250"}
{"user_id": "114697717220473316056", "name": "LaTisha Byrd", "time": 1574047090579, "rating": 5.0, "text": "We LOVE Nichole. She does her best to accommodate my insane schedule. She always listens to my request and makes it come true.", "pics": null, "resp": null, "gmap_id": "0x889a61f96ea20655:0x14238b725edd250"}
{"user_id": "110581292048126509706", "name": "Tricia Savage", "time": 1560537604573, "rating": 5.0, "text": "From not being from around here, not knowing many ppl, or even where I am most of the time I not ONLY got the BEST HAIRCUT EVER I made two Super Nice \"professional\" friends❤️😍 Thanks Guys Love my hair!!!", "pics": null, "resp": null, "gmap_id": "0x889a61f96ea20655:0x14238b725edd250"}
{"user_id": "102635965753444425500", "name": "Deborah Aughtman", "time": 1540090712194, "rating": 5.0, "text": "Very satisfied with my haircut and couldn't have been treated better. The salon was very clean and to me thats important.", "pics": null, "resp": null, "gmap_id": "0x889a61f96ea20655:0x14238b725edd250"}
{"user_id": "115715897089238361242", "name": "Tess Bond", "time": 1517954631623, "rating": 5.0, "text": "I have been wanting to get my hair cut for a long time. Today on impulse, I went in and they were able to take me without an appointment. Because my hair was so long and I was getting so much cut off, they were able to take it as a donation, which is something I've always wanted to do. I'm very happy with the results!", "pics": null, "resp": null, "gmap_id": "0x889a61f96ea20655:0x14238b725edd250"}
{"user_id": "101247306856629740419", "name": "Celena Stewart", "time": 1505380453136, "rating": 5.0, "text": "Korey and Nichole do amazing work!! Nichole has been working on my hair for over a year! So glad they are in town", "pics": null, "resp": null, "gmap_id": "0x889a61f96ea20655:0x14238b725edd250"}
{"user_id": "109898407959579476621", "name": "Yvette Rackard", "time": 1518279802246, "rating": 5.0, "text": "Love this place. Nicole is a grata stylist and appointments are easily available wothou long wait time.", "pics": null, "resp": null, "gmap_id": "0x889a61f96ea20655:0x14238b725edd250"}
{"user_id": "104664999862581977646", "name": "Pamela Brooks", "time": 1564916655437, "rating": 5.0, "text": "Kristin is the bomb not sure about her name spelling lol", "pics": null, "resp": null, "gmap_id": "0x889a61f96ea20655:0x14238b725edd250"}
{"user_id": "108601489537957755527", "name": "Patricia Langham", "time": 1488559247448, "rating": 5.0, "text": "They did an awesome job and made me feel very comfortable", "pics": null, "resp": null, "gmap_id": "0x889a61f96ea20655:0x14238b725edd250"}
{"user_id": "102918818955380628395", "name": "Tommy Thompson", "time": 1567678034812, "rating": 5.0, "text": "Nicole is great", "pics": null, "resp": null, "gmap_id": "0x889a61f96ea20655:0x14238b725edd250"}
{"user_id": "103518577184468524371", "name": "Jodi singleton", "time": 1505658738368, "rating": 1.0, "text": "They messed up my hair I wanted blonde and I got brown gray purple color it was awful I had to pay someone else to fix it I will never be back and never recommend they won't even try and make it right I'm out $260 for one hair do", "pics": null, "resp": {"time": 1506401389723, "text": "We are so sorry to hear that your experience wasn’t to your standards. The paper work that you signed at the beginning of your service, explains that if you are unsatisfied with your hair, your stylist will be more than happy to come up with an arrangement to get your hair where you would like it to be. We truly wish you would have come to us first so we could evaluate your hair and make it right for you without the additional costs of another salon. We have offered for you to come in and have us take a look at your hair to evaluate the situation, and we are sorry that you did not want to come in to work this out. Unfortunately, due to the time your stylist spent with you, product used, and not having the opportunity to evaluate your hair in person, we are unable to refund you for this service. Upon reviewing your paper work, your stylist noted that your hair would need more than one service to achieve the end results that you were wanting. This is due to the fact that your hair was already previously lightened at home before your visit to us. We are always striving for what's best for our clients. In this circumstance, your hair wouldn't be able to handle any further lightening in one visit. It is our understanding that in order to protect the integrity of your hair, you and your stylist decided to go with a darker blonde until your next service. We aren't quite sure what happened between the time you left the salon and now, but after your service you told us that you loved your hair and even booked your future reservation with us. We deeply value you as a customer of ours and we are sorry to see you go. We appreciate your review and we hope you have a wonderful day."}, "gmap_id": "0x889a61f96ea20655:0x14238b725edd250"}
{"user_id": "116523164085447072228", "name": "Ellen Gray", "time": 1547755002565, "rating": 5.0, "text": "Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a61f96ea20655:0x14238b725edd250"}
{"user_id": "105995262154230049291", "name": "Carolyn Perry", "time": 1522899417567, "rating": 1.0, "text": "Worst Haier cut ever!!!", "pics": null, "resp": null, "gmap_id": "0x889a61f96ea20655:0x14238b725edd250"}
{"user_id": "109260444325118294985", "name": "Scott Rackley", "time": 1546035336073, "rating": 5.0, "text": "Fast and friendly service.", "pics": null, "resp": null, "gmap_id": "0x889a61f96ea20655:0x14238b725edd250"}
{"user_id": "109602402068677409171", "name": "Lace Miller", "time": 1496123698089, "rating": 5.0, "text": "Nichole is AMAZING!", "pics": null, "resp": null, "gmap_id": "0x889a61f96ea20655:0x14238b725edd250"}
