{"user_id": "111776723767938523075", "name": "Raquel", "time": 1607075932564, "rating": 1.0, "text": "One if the worst salvation army thrift stores I've witnessed. Kind of dirty trashy feeling. I found 4 kids books for $1. Couldn't find a toy clothing or household item... just left you wondering where do all the nice things go that are donated? Not in this store. I went to 7 thrift stores in 3 towns the day I went here 3 Dec 2020 this should have been much better than it was,  it has a national name.", "pics": null, "resp": null, "gmap_id": "0x888c0b686b2edfc1:0xb306f58e982d2069"}
{"user_id": "114235718751500193212", "name": "Resilient Lady", "time": 1578517025645, "rating": 4.0, "text": "It's a great store but they need to have a more polite person to work in helping people with utilities. Grace Chelsea or whatever her name is ,was kind of rude. If you work in a public place you should have a better attitude. A complete turnoff for me.", "pics": null, "resp": null, "gmap_id": "0x888c0b686b2edfc1:0xb306f58e982d2069"}
{"user_id": "111025906388548165112", "name": "Tracey Mitchell", "time": 1570828238923, "rating": 5.0, "text": "Nice store! I like the way they have different rooms ladies things men's things Children things and housewares. More people should display things this way. The ladies there were both very friendly and helpful. Doing a good job store keep it up!", "pics": null, "resp": null, "gmap_id": "0x888c0b686b2edfc1:0xb306f58e982d2069"}
{"user_id": "114871206752953808861", "name": "Dee Jey", "time": 1562107982287, "rating": 5.0, "text": "Nice store. Very organized. They have a room just for men clothes and for women and children clothes. A bigger room with furniture in the back. They also have a room for books,vhs,cds,and vinyl records.", "pics": null, "resp": null, "gmap_id": "0x888c0b686b2edfc1:0xb306f58e982d2069"}
{"user_id": "107637008640163738025", "name": "Sue Nunn", "time": 1499809044138, "rating": 5.0, "text": "One of my favorite places to shop. It is friendly, clean with a large assortment of items including home goods & clothing for the entire family. 25% off to military families.", "pics": null, "resp": null, "gmap_id": "0x888c0b686b2edfc1:0xb306f58e982d2069"}
{"user_id": "109985455831712127076", "name": "W “Annie”", "time": 1535230753741, "rating": 5.0, "text": "Great deals, great prices, friendly staff. One of my favorite places to shop.", "pics": null, "resp": null, "gmap_id": "0x888c0b686b2edfc1:0xb306f58e982d2069"}
{"user_id": "111318130130951450173", "name": "Tulane White", "time": 1588707824750, "rating": 4.0, "text": "Clean place but prices are getting way to high", "pics": null, "resp": null, "gmap_id": "0x888c0b686b2edfc1:0xb306f58e982d2069"}
{"user_id": "113491307034493060979", "name": "Rebecca Autrey", "time": 1544934098205, "rating": 3.0, "text": "I usually dont ask this but I need help with Christmas this year for my four year old daughter and me and my husband and my 18 year old step son", "pics": null, "resp": null, "gmap_id": "0x888c0b686b2edfc1:0xb306f58e982d2069"}
{"user_id": "108999183873455291569", "name": "Thelma Calloway", "time": 1510785665641, "rating": 3.0, "text": "Kind of expensive to be a second hand store", "pics": null, "resp": null, "gmap_id": "0x888c0b686b2edfc1:0xb306f58e982d2069"}
{"user_id": "102898842828938122857", "name": "Nakiria jackson", "time": 1567112624788, "rating": 1.0, "text": "I saw this dentist several years ago and I did not remember why I wasn't going to go back. I went in today for a cleaning and the minute he walked in the room I was reminded why I will never visit this office again. He is impolite, insensitive, and can't relate to me effectively. The ladies at the front desk are very nice and professional and so is the lady that cleaned my teeth. Needless to say I will never give him my business again.", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "107373649571992208452", "name": "Brian", "time": 1481946937255, "rating": 5.0, "text": "I've been going to see Dr. Walker since I was 18. I'm 47 now. He's a very nice guy and knows his profession very well. I feel like I'm visiting family when I go there. Everyone is very nice to me and always answers any questions I may have. If you wanna keep your teeth looking good and feel comfortable doing it then go see Dr. Walker and his great staff.", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "113971054413972766497", "name": "Cortney Moon", "time": 1469128496471, "rating": 5.0, "text": "Dr. Walker was absolutely amazing!  I have a true fear of the dentist and he and his staff made me feel very comfortable.  I would highly recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "115353579254628142794", "name": "AJS Williams", "time": 1471479163809, "rating": 4.0, "text": "Dr. Walker was absolutely great with my daughter, was so nervous and she said she couldn't even feel the shot. Girl up front was so patient with my insurance. No other place would try to help me with a estimate or take our brand. We will definitely be back to that office.", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "106165162966531897023", "name": "Melissa Crusoe", "time": 1475597422067, "rating": 5.0, "text": "Dr. Walker is the best dentist I have had! He is very professional and knows his craft well! AND his staff is professional and very skilled! I highly recommend Dr. Thomas Walker's Dentristy for all your dentistry needs!", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "106667328325162014245", "name": "Richard Howell", "time": 1460500561506, "rating": 1.0, "text": "Staff is incompetent and severly lacking in training. Worst dentist office I have ever been to. I am 58 yrs old and have had a lot of dental work done. These people don't have a clue about what they are doing. They will lie and make up things in an attempt to cover up their incompetence. Don't waste your money. Save yourself a lot of pain and definitely avoid this office.", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "111678913351712476652", "name": "Brittany Richards", "time": 1421087975055, "rating": 5.0, "text": "Dr. Walker has been my dentist since I was a child. I'm almost positive he worked on my first tooth! Even as a kid I felt comfortable and loved him as my dentist. As an adult, I feel the exact same and have always been extremely loyal to Dr. Walker. His office is always clean, my visit is always fast and his staff are always wonderful to talk with. He moved from Irondale (originally up on the hill) to Trussville (closer to me so that's a win!) and I'd follow him again. My entire family uses Dr. Walker and I highly recommend him as a dentist for patients of any age. He's the reason I have the awesome smile I do! :)", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "109463799663931100283", "name": "Kathryn Lopresti", "time": 1487707885742, "rating": 5.0, "text": "Friendly and experienced employees. They become like family after a few cleanings or dental work. I have seen Dr Walker over 15 years.", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "105939211859585004125", "name": "Crystal Hucks", "time": 1468949473312, "rating": 5.0, "text": "Great atmosphere!! Very clean and patient oriented office..", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "112556937432305065458", "name": "Christian Collins", "time": 1551133994858, "rating": 5.0, "text": "Very professional, calming and very thorough", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "109462209739645041828", "name": "Heather Snyder", "time": 1475597669802, "rating": 5.0, "text": "The staff is amazing!!!!!!!!! Great experience they were very helpful and made me feel right at home  ! I will be back!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
{"user_id": "100450929465764203278", "name": "Mindy Lambert", "time": 1488509485714, "rating": 5.0, "text": "I would highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x88890ce49b5b60e3:0xaec8dfa46fdff183"}
