{"user_id": "108077579238692453446", "name": "Amy Bornstein", "time": 1623108791891, "rating": 5.0, "text": "I am a Artist, once a canvas has sold, it must be crated and shipped. The Owner by the name of Angeline and her staff are very helpful, patient, quick and very professional.\nI will be using them constantly from now on.\nIt’s peace of mind to know that my artwork will travel to its new home and arrive in perfect condition.\nThank you, MailPro!!👩‍🎨", "pics": null, "resp": {"time": 1623180808633, "text": "Thank you for the kind words! Always a pleasure to help our artists get their gorgeous art to where it's going!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108953851903629446984", "name": "Missy Fantusi", "time": 1628421604821, "rating": 4.0, "text": "Nice greeting cards, last time I was there, I was waited on right away. That's great!!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112551252548474682989", "name": "Marsha Reynolds", "time": 1619026767954, "rating": 5.0, "text": "Most convenient mailing store I have ever been to. I am never going back to the post office. The service at MailPro is outstanding and the staff is extremely helpful and lovely. Will definitely be back again and again.", "pics": null, "resp": {"time": 1619092610963, "text": "Ooooh thank you for the 5 stars! And thank you for letting us help you! Always a pleasure to be of service to sweet folks like you!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108194833469719585695", "name": "Steve Middlebrooks", "time": 1620943588421, "rating": 1.0, "text": "I went in to ship a golf club today at Mail pro in Owens crossroads Alabama. There was a lady in front of me that went in no mask on and the lady at the counter told her just to put her package over there. I came in with no mask on she told me to go back out and get a mask! Does she know the time it takes for Covid-19 to spread is it a short time or a long time? Apparently she works for the CDC and she knows all about it to discriminate against who wears a mask and who does not. If that service wasn't bad enough they charged me $51 to ship a golf club which normally would cost $39 anywhere else. Save your money save your time and save your humiliation Don't go here.", "pics": null, "resp": {"time": 1620961399940, "text": "Wow. Yes, two customers in a row walked right past our “masks required” sign that is posted on the door. The lady ahead of you could drop her prepaid off and go, you needed to be in the store longer. It would have been futile for her leave to get her mask and come back in - her task was complete.\n\nI’m sorry you feel humiliated by being asked to be compassionate to those around us that haven’t had their vaccination yet. We are still trying to follow the current CDC guidelines, they are on the CDC website if you need a refresher.\n\nAnd again, I’m sorry you felt the price to pack and ship your golf club was more than you wanted to pay. Generally the price for clubs to be packed and shipped runs between $25-$35. The weight, dimensions and destination for this particular package determined the options we gave you. We would have gladly handed it back to you if you had wanted, so you could “price shop” and maybe find an option that better suited your price range.\n\nAs always, you are welcome in our store in the future provided you can be considerate and compassionate to the other shoppers."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100916212036415759093", "name": "Kim Ringenbach (looneypumpkin)", "time": 1613569542336, "rating": 5.0, "text": "Mail Pro is the best place to ship from in Huntsville! The staff is super friendly and quick! I've never had an issue and the owner is the best!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100916030163268426101", "name": "Garel 2008", "time": 1607049251654, "rating": 5.0, "text": "My wife sent an international mail to the Philippines with very important papers and very expensive. She had the wrong address on the package. She found out when she returned home, called them and they went through all the outgoing mail and found it and changed the address label in time. Great job! We will use MailPro again and with a great level of confidence.\n\nThanks! MailPro", "pics": null, "resp": {"time": 1607051157259, "text": "Aw! Thank you for the great review! Always happy to help, glad to get a package where it's supposed to go! Thanks for coming to see us!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100735917630884398660", "name": "D Gallagher", "time": 1622668226041, "rating": 1.0, "text": "Worthless.  Public notary doesn’t understand documents (questionable reading comprehension skills) and refused to accept any help (ie ignorant and stubborn).", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112405032535452363722", "name": "Delilah Roberson", "time": 1618949027570, "rating": 1.0, "text": "Very rude and unprofessional simply because I asked for a tracking receipt.", "pics": null, "resp": {"time": 1619027075853, "text": "We have a sign on the door stating that a mask is required. You came in without a mask and we still served you. I'm sorry this was difficult for you, hope in the future you can find a place to return your prepaid drop offs that will be more to your liking."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103643497643102984504", "name": "Peggy Coulter", "time": 1613505191333, "rating": 1.0, "text": "Closed office? What happened to \"the mail must go through\"? All roads clear here in Hampton Cove. Monday and Tuesday.", "pics": null, "resp": {"time": 1613506543842, "text": "Sorry we missed you. We were open Monday from 9 til around 1:30pm when the temperature dropped below freezing. My employees live over the mountain and I made the decision to remain closed today at 6:30 this morning when the news was reporting that schools, redstone and colleges were closed."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100256428479117552551", "name": "Jonathan Martinez", "time": 1610398309210, "rating": 5.0, "text": "Really efficient post office to drop or send mail. Hard workers and pleasant experience with customer service.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114130145094223069253", "name": "Mary Marshall", "time": 1592581389539, "rating": 5.0, "text": "Always professional, friendly and knowledgeable about all methods of shipping. Very helpful and fun to chat with. My go-to place for shipping.", "pics": null, "resp": {"time": 1592591862288, "text": "Thank you for the sweet review!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100313294291552609460", "name": "Scotty Pate", "time": 1582242385133, "rating": 5.0, "text": "Fantastic business! I have shipped dozens of packages through them. Everything from legal papers to expensive fragile music instruments, and they have packaged and shipped everything perfectly. Love how convenient they are.", "pics": null, "resp": {"time": 1582322506908, "text": "Thank you so much for taking the time to write a review! It's pleasure to help you with all your tasks. Thank you for being a great customer!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116377114387881125250", "name": "Tee West", "time": 1575146678919, "rating": 1.0, "text": "Would give minus 5 stars if possible. Owner very rude!!!!!!!!!!!!!!!!!!!! A  package was processed couple months ago to Amazon from different person in store Today owner refused and said they DID NOT do the package before when in fact it was. Owner needs to learn how to actually run this store sufficiently. I'd been embarrassed to admit I was owner with that attitude. I just read your reply and trust me you were rude and have no intentions of ever doing service here again. That shows bad character on your part for reply such as that!!!!!!! What an arrogance!!!", "pics": null, "resp": {"time": 1575118391387, "text": "LOL!! Yes, I had the audacity to disagree with you... I'm sorry, you are simply mistaken. You chose the Amazon QR code that clearly states on your return for you to take the QR to branded UPS Store for them to scan.\n\nWe are MailPro, a UPS Authorized Shipping Outlet and can take Amazon returns with a UPS label when you choose \"UPS Dropoff\", our scanners can't scan UPS Store QR codes.\n\nLast time I'm sure we showed you how to cancel your return, and re-return it as a \"UPS Dropoff\" to process it for you. We do this approximately 20 times a day for all of our fabulous customers.\n\nI tried to show you how change your return but you were not receptive, choosing instead to be offended. Next time when you bring your QR code in - we'll be sure to walk you through each step so you can understand the process. Life is too short to go through it looking to be offended.."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "101165821461528592940", "name": "Christopher Coleman", "time": 1595596317473, "rating": 5.0, "text": "Great service and convenient location for mailing packages and returns to Amazon.", "pics": null, "resp": {"time": 1595614496284, "text": "Aw thanks! It's a pleasure to help!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "111275442294901164466", "name": "Erin Dwyer", "time": 1557851281853, "rating": 5.0, "text": "Fast, friendly, helpful - LOVE MailPro! I always bypass the Post Office for the ease and convenience of this local mailing center. They are the nicest and can't beat their amazing service!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "118130912154506378661", "name": "Am C", "time": 1551548737108, "rating": 5.0, "text": "So helpful and friendly. Highly recommend this spot. Printed out my label and even supplied tape (both of which I forgot to bring). They took both of my packages (USPS and UPS)", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "110549728771214230733", "name": "Alta Finney", "time": 1533786437553, "rating": 5.0, "text": "We are here a couple times each month, and each time, we receive the most helpful service. It's so much easier to do business with people like these! They ask all the appropriate questions to ensure that my packages will arrive safely, and that is what good customer service is all about!", "pics": null, "resp": {"time": 1533833079754, "text": "Thank you for choosing us! It is our pleasure to help!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112374901908076149586", "name": "Jose Vasquez", "time": 1545508604903, "rating": 5.0, "text": "This place may be tiny. This place may be hidden in the plaza. But ultimately this is the place one needs to go for all their shipping and printing needs. The staff 5/5. If customer service is key. Then they have the key to success.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOfL90X0oZ3lPYbsfNMC_H4tgUcKOfqyuFru2b9=w150-h150-k-no-p"]}], "resp": {"time": 1545679616684, "text": "Thank you for coming by and letting us help you with your project! Y'all were great!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "107940296177859176663", "name": "Rebekah Smith", "time": 1565538625407, "rating": 5.0, "text": "Convenient, friendly, and professional. They offer every service I need including notary and always find the best deals.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109148092595887137192", "name": "Lacey House", "time": 1533419426999, "rating": 5.0, "text": "Fast service, friendly and professional staff, and many services available! I witnessed so many happy and satisfied customers while I was in today! I Definitely recommend this business for all your shipping, binding, and packaging needs! Their location is also very convenient! Thanks MailPro!", "pics": null, "resp": {"time": 1533420775509, "text": "Thank you! Your business is very much appreciated and please come again soon!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116662045511772687323", "name": "Richard McCollum", "time": 1573674839172, "rating": 1.0, "text": "They lost a FedEx package we sent. It has been a huge inconvenience for lots of people (and will continue to be for awhile). MailPro claims FedEx lost the package, but FedEx never scanned the package saying they picked it up, which leads me to believe MailPro lost it. FedEx claims MailPro lost it. Either way I really don't care, huge pain, never using the company again even though they are convenient.", "pics": null, "resp": {"time": 1573679750641, "text": "We are terribly sorry for your inconvenience. Your package did get picked up by FedEx, and we do have the manifest that the driver signed. It is rare that a package doesn't get scanned at the hub, but it does happen. We are sorry it happened to your package. All we can do is reimburse you for your shipping charge, which we have done."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "117940719761698850504", "name": "Rebecca Jensen", "time": 1552752934522, "rating": 1.0, "text": "I was in Mailpro yesterday. The lady with dark hair and bigger was ugly to me in front of customers. I was there before the lady she was waiting on and asked her a question. That’s when she got mad and said she was waiting on someone else. I then said that I was there first and she went off on me even pointing out that I had crossed the line when I parked. She gave me the email I needed to send my package with and really though t I would send package thru her after her behavior. I paid 11 cents and left. I will never go in that horrible store again.\n\nYour negative reply truly reflects the attitude you had toward me. Most reputable businesses try to correct the problem or apologize. They do not retaliate or make snarky comments.", "pics": null, "resp": {"time": 1552678459529, "text": "Every customer is important and appreciated in our store. But we do expect our customers to act with basic manners learned in kindergarten. You did enter the store first and began your Wayfair return on your phone at the counter. While you were being helped by Wayfair I began helping a customer that came in and was ready.\n\nYou interrupted this transaction to tell me to look for the Wayfair email. I explained to you that I was helping another customer and I would help you as soon as her transaction was completed. You said \"But I was here first!\" And I replied \"But you weren't ready.\" I was not unkind to you, I was not rude. I also mentioned that had parked diagonally in two spaces - to which you replied \"I've got a new car...\" Wow.\n\nI see you have sent four packages through us in the last two years. If you want to take you business elsewhere, that's your choice. Of course, you are still welcome continue to drop off your prepaid returns with us in the future."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114185328257152977153", "name": "Robert Lee", "time": 1530048489816, "rating": 5.0, "text": "I'm literally in here all the time shipping random items or sending certified mail. The service is always great. Thanks for being awesome! I'm sure I'll see you sometime today to ship something else!", "pics": null, "resp": {"time": 1530049255315, "text": "Thank you! We strive to be of service, and appreciate your business!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "106582673482845655940", "name": "CurlyCutie", "time": 1533403156710, "rating": 1.0, "text": "My daughter and I just experienced the most horrendous display of racism and bigotry from the \"owner\" of this location that I have yet to encounter in this area.  I own a small business that I run out of my home in McMullen Cove (and yes, I do have a license with the City of Huntsville).  I mail packages on a daily basis.  Today, I missed my mail pick up and our local post office had already closed so we drove down to this store so that we could ensure our packages would go out today.  My 12 year old went in first and was refused service.  So, I then took the packages and went inside only to be told that, \"I don't receive anything from the Post Office for compensation and am not required to provide service to you.\"   I asked for her to put that in writing, she refused, spewed some other nastiness until 2 other individuals came in and I told her I would be reporting her to the proper authorities and I left.   As I type this, I am still shaken, that this kind of bigotry and hatred can still exist.  That people feel they have the right to treat others with such vile.  I will not be returning to this location ever and would strongly urge others to also find somewhere else to spend your hard earned money.", "pics": null, "resp": {"time": 1533411883334, "text": "Wow, I feel I have to respond to this - this goes beyond misleading and is simply a lie. There were others in the store that were witness to your extremely rude, and bullying behavior Saturday afternoon. I'm so sorry that we couldn't help you, and that you were not happy here. We really try hard to make every customers experience here a very good one. As I explained to you when you were here - your postal labels would not scan. I tried on both registers  - your labels were not clear enough to be scanned. You knew they were poor labels beforehand, because you were quick to *demand* that I type the numbers in and give you a receipt. I explained that we do not do this, as the post office may never scan and relabel them and we would be held responsible for shipments not delivered as the location that accepted them. I never refused to scan your items, I scanned them several times. I did refuse to give you a receipt for items that won't scan. Again, I'm sorry that you are not happy, but please don't make a racial issue out of a situation that race simply had no bearing. That is extremely sad. I do hope you find happiness wherever you find to drop off in the future."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "110073186716751295578", "name": "Judy Malone", "time": 1553216060550, "rating": 5.0, "text": "I'm in this store at least 3 times a week for something - they help me with everything. The Cove is lucky to have this little store, the workers are always knowledgeable, efficient, and cheerful. Thanks y'all! A+++++", "pics": null, "resp": {"time": 1553262273195, "text": "Thank you Judy! We love to make our customers happy."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "113120573937035350057", "name": "Gaybrielle Valverde", "time": 1561822588057, "rating": 5.0, "text": "I love how convenient this place is and I’ve never had a negative experience at this store.", "pics": null, "resp": {"time": 1561827258875, "text": "Well, the sweet people in this area, like you, make our job easy! Thank you so much for your kind review!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112561891819366709974", "name": "Marie Channer", "time": 1533412424508, "rating": 5.0, "text": "LOVE! this store!  They are the go to place for my shipping.  They even mailed a grandfather clock....no problem they said.  Thank you MailPro!!!", "pics": null, "resp": {"time": 1533421262081, "text": "I remember the clock! Thank you for your business and the packing challenge!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114939163847432919587", "name": "chris anderson", "time": 1547761319355, "rating": 3.0, "text": "The overall atmosphere isnt the same ,   I got some bad looks when I dropped off a return since I was only using the drop box and not paying to return through them", "pics": null, "resp": {"time": 1547760535442, "text": "I'm sorry to hear you feel this way. May I ask what we can do to improve your experience or correct the problem?"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109908593061539807838", "name": "Britton Ethridge", "time": 1554480020942, "rating": 5.0, "text": "Went for help with a difficult Amazon return, & the very helpful staff worked with me to return the packages with no charge! Angeline was especially kind. Will be returning.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116360260574648898826", "name": "Joshua Magrath", "time": 1519421917819, "rating": 1.0, "text": "This place is over priced and lost their DHL access. In short the employee went through my package nosing around asking inappropriate questions. I have used them many times and always found this place over priced and unprofessional.", "pics": null, "resp": {"time": 1520622969300, "text": "Mr. Magrath, I’m sorry you felt unhappy with the quality of our service. Our records indicate that you’ve shipped two packages with us in as many years. One internationally, yes - we must ask questions about your shipment. “What are you sending? What is the value?” The details are required, not by us - but by international customs. We would absolutely not ask any “inappropriate” questions.\n\nLast week you came in and wanted to ship a box of “parts” and insure it. Yes, again, we need to know what you are sending and how much it’s worth. Not out of curiosity, but for insurance purposes. Again, not inappropriate questions. You were very vague about what it was - turned out to be paintball gun equipment, once we ascertained that it wasn’t firearm parts (we aren't licensed to send firearms or HAZMAT) and had no compressed cartridges included (HAZMAT) - we shipped it for you.\n\nYou seemed fine with the transaction at the time - I wish you had had the courage to complain in person instead of leaving a fully misleading review. Some people take these reviews seriously. Truth is, unhappy people write reviews, happy people come back (our customer count is up 30% since we bought the store in October) and we will continue to help our absolutely wonderful customers do what they are trying to do.\n\nOur staff has over 20 years collective experience in the packing and shipping industry. When you bring your items to us to ship, part of our service is ensuring that your item will make it to its destination in perfect shape. Sorry if you find this expertise “nosey”. Lol!\n\nWe are a DHL authorized shipping center, and we do accept pre-labeled DHL shipments at our location. We just don’t have enough demand for the service to print labels from our account."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "102206964601045706586", "name": "Wes Haley", "time": 1469547876625, "rating": 5.0, "text": "MailPro is the place to go when I need to ship a package. But it's also great for so many other things - notary services, live fingerprinting, moving supplies, copies, print jobs, etc.  - basically it's a one stop shop - convenient, courteous owners and employees, and fair prices.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "117402659533986240822", "name": "Brandon Stapler", "time": 1600542014438, "rating": 5.0, "text": "Awesome folks", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109705648434260272701", "name": "Pat Carpenter", "time": 1489540471480, "rating": 5.0, "text": "Very convient. . Good service. Everything you need for mailing in one place.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116321132831559836704", "name": "Steve Vaughan", "time": 1596239345587, "rating": 1.0, "text": "They are very expensive.", "pics": null, "resp": {"time": 1596299738222, "text": "We don't have you in our records as a customer... Wrong store? Our prices are competitive with all the other pack and ship stores."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103544018902048290752", "name": "Michael", "time": 1501897808239, "rating": 5.0, "text": "Good service. Quick.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100674572007366652313", "name": "Michele F", "time": 1565277290290, "rating": 5.0, "text": "We have never had anything but EXCELLENT service at this location", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116064553712770362564", "name": "David Farley", "time": 1553197171296, "rating": 5.0, "text": "Great staff, fast service.", "pics": null, "resp": {"time": 1553262186715, "text": "Thank you! We love to make our customers happy."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103456385486869021430", "name": "Tns Wiley", "time": 1558554412993, "rating": 5.0, "text": "Wonderful speedy service!", "pics": null, "resp": {"time": 1558555792978, "text": "Thank you for coming in to see us!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108077579238692453446", "name": "Amy Bornstein", "time": 1623108791891, "rating": 5.0, "text": "I am a Artist, once a canvas has sold, it must be crated and shipped. The Owner by the name of Angeline and her staff are very helpful, patient, quick and very professional.\nI will be using them constantly from now on.\nIt’s peace of mind to know that my artwork will travel to its new home and arrive in perfect condition.\nThank you, MailPro!!👩‍🎨", "pics": null, "resp": {"time": 1623180808633, "text": "Thank you for the kind words! Always a pleasure to help our artists get their gorgeous art to where it's going!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108953851903629446984", "name": "Missy Fantusi", "time": 1628421604821, "rating": 4.0, "text": "Nice greeting cards, last time I was there, I was waited on right away. That's great!!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112551252548474682989", "name": "Marsha Reynolds", "time": 1619026767954, "rating": 5.0, "text": "Most convenient mailing store I have ever been to. I am never going back to the post office. The service at MailPro is outstanding and the staff is extremely helpful and lovely. Will definitely be back again and again.", "pics": null, "resp": {"time": 1619092610963, "text": "Ooooh thank you for the 5 stars! And thank you for letting us help you! Always a pleasure to be of service to sweet folks like you!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108194833469719585695", "name": "Steve Middlebrooks", "time": 1620943588421, "rating": 1.0, "text": "I went in to ship a golf club today at Mail pro in Owens crossroads Alabama. There was a lady in front of me that went in no mask on and the lady at the counter told her just to put her package over there. I came in with no mask on she told me to go back out and get a mask! Does she know the time it takes for Covid-19 to spread is it a short time or a long time? Apparently she works for the CDC and she knows all about it to discriminate against who wears a mask and who does not. If that service wasn't bad enough they charged me $51 to ship a golf club which normally would cost $39 anywhere else. Save your money save your time and save your humiliation Don't go here.", "pics": null, "resp": {"time": 1620961399940, "text": "Wow. Yes, two customers in a row walked right past our “masks required” sign that is posted on the door. The lady ahead of you could drop her prepaid off and go, you needed to be in the store longer. It would have been futile for her leave to get her mask and come back in - her task was complete.\n\nI’m sorry you feel humiliated by being asked to be compassionate to those around us that haven’t had their vaccination yet. We are still trying to follow the current CDC guidelines, they are on the CDC website if you need a refresher.\n\nAnd again, I’m sorry you felt the price to pack and ship your golf club was more than you wanted to pay. Generally the price for clubs to be packed and shipped runs between $25-$35. The weight, dimensions and destination for this particular package determined the options we gave you. We would have gladly handed it back to you if you had wanted, so you could “price shop” and maybe find an option that better suited your price range.\n\nAs always, you are welcome in our store in the future provided you can be considerate and compassionate to the other shoppers."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100916212036415759093", "name": "Kim Ringenbach (looneypumpkin)", "time": 1613569542336, "rating": 5.0, "text": "Mail Pro is the best place to ship from in Huntsville! The staff is super friendly and quick! I've never had an issue and the owner is the best!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100916030163268426101", "name": "Garel 2008", "time": 1607049251654, "rating": 5.0, "text": "My wife sent an international mail to the Philippines with very important papers and very expensive. She had the wrong address on the package. She found out when she returned home, called them and they went through all the outgoing mail and found it and changed the address label in time. Great job! We will use MailPro again and with a great level of confidence.\n\nThanks! MailPro", "pics": null, "resp": {"time": 1607051157259, "text": "Aw! Thank you for the great review! Always happy to help, glad to get a package where it's supposed to go! Thanks for coming to see us!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100735917630884398660", "name": "D Gallagher", "time": 1622668226041, "rating": 1.0, "text": "Worthless.  Public notary doesn’t understand documents (questionable reading comprehension skills) and refused to accept any help (ie ignorant and stubborn).", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112405032535452363722", "name": "Delilah Roberson", "time": 1618949027570, "rating": 1.0, "text": "Very rude and unprofessional simply because I asked for a tracking receipt.", "pics": null, "resp": {"time": 1619027075853, "text": "We have a sign on the door stating that a mask is required. You came in without a mask and we still served you. I'm sorry this was difficult for you, hope in the future you can find a place to return your prepaid drop offs that will be more to your liking."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103643497643102984504", "name": "Peggy Coulter", "time": 1613505191333, "rating": 1.0, "text": "Closed office? What happened to \"the mail must go through\"? All roads clear here in Hampton Cove. Monday and Tuesday.", "pics": null, "resp": {"time": 1613506543842, "text": "Sorry we missed you. We were open Monday from 9 til around 1:30pm when the temperature dropped below freezing. My employees live over the mountain and I made the decision to remain closed today at 6:30 this morning when the news was reporting that schools, redstone and colleges were closed."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100256428479117552551", "name": "Jonathan Martinez", "time": 1610398309210, "rating": 5.0, "text": "Really efficient post office to drop or send mail. Hard workers and pleasant experience with customer service.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114130145094223069253", "name": "Mary Marshall", "time": 1592581389539, "rating": 5.0, "text": "Always professional, friendly and knowledgeable about all methods of shipping. Very helpful and fun to chat with. My go-to place for shipping.", "pics": null, "resp": {"time": 1592591862288, "text": "Thank you for the sweet review!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100313294291552609460", "name": "Scotty Pate", "time": 1582242385133, "rating": 5.0, "text": "Fantastic business! I have shipped dozens of packages through them. Everything from legal papers to expensive fragile music instruments, and they have packaged and shipped everything perfectly. Love how convenient they are.", "pics": null, "resp": {"time": 1582322506908, "text": "Thank you so much for taking the time to write a review! It's pleasure to help you with all your tasks. Thank you for being a great customer!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116377114387881125250", "name": "Tee West", "time": 1575146678919, "rating": 1.0, "text": "Would give minus 5 stars if possible. Owner very rude!!!!!!!!!!!!!!!!!!!! A  package was processed couple months ago to Amazon from different person in store Today owner refused and said they DID NOT do the package before when in fact it was. Owner needs to learn how to actually run this store sufficiently. I'd been embarrassed to admit I was owner with that attitude. I just read your reply and trust me you were rude and have no intentions of ever doing service here again. That shows bad character on your part for reply such as that!!!!!!! What an arrogance!!!", "pics": null, "resp": {"time": 1575118391387, "text": "LOL!! Yes, I had the audacity to disagree with you... I'm sorry, you are simply mistaken. You chose the Amazon QR code that clearly states on your return for you to take the QR to branded UPS Store for them to scan.\n\nWe are MailPro, a UPS Authorized Shipping Outlet and can take Amazon returns with a UPS label when you choose \"UPS Dropoff\", our scanners can't scan UPS Store QR codes.\n\nLast time I'm sure we showed you how to cancel your return, and re-return it as a \"UPS Dropoff\" to process it for you. We do this approximately 20 times a day for all of our fabulous customers.\n\nI tried to show you how change your return but you were not receptive, choosing instead to be offended. Next time when you bring your QR code in - we'll be sure to walk you through each step so you can understand the process. Life is too short to go through it looking to be offended.."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "101165821461528592940", "name": "Christopher Coleman", "time": 1595596317473, "rating": 5.0, "text": "Great service and convenient location for mailing packages and returns to Amazon.", "pics": null, "resp": {"time": 1595614496284, "text": "Aw thanks! It's a pleasure to help!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "111275442294901164466", "name": "Erin Dwyer", "time": 1557851281853, "rating": 5.0, "text": "Fast, friendly, helpful - LOVE MailPro! I always bypass the Post Office for the ease and convenience of this local mailing center. They are the nicest and can't beat their amazing service!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "118130912154506378661", "name": "Am C", "time": 1551548737108, "rating": 5.0, "text": "So helpful and friendly. Highly recommend this spot. Printed out my label and even supplied tape (both of which I forgot to bring). They took both of my packages (USPS and UPS)", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "110549728771214230733", "name": "Alta Finney", "time": 1533786437553, "rating": 5.0, "text": "We are here a couple times each month, and each time, we receive the most helpful service. It's so much easier to do business with people like these! They ask all the appropriate questions to ensure that my packages will arrive safely, and that is what good customer service is all about!", "pics": null, "resp": {"time": 1533833079754, "text": "Thank you for choosing us! It is our pleasure to help!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112374901908076149586", "name": "Jose Vasquez", "time": 1545508604903, "rating": 5.0, "text": "This place may be tiny. This place may be hidden in the plaza. But ultimately this is the place one needs to go for all their shipping and printing needs. The staff 5/5. If customer service is key. Then they have the key to success.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOfL90X0oZ3lPYbsfNMC_H4tgUcKOfqyuFru2b9=w150-h150-k-no-p"]}], "resp": {"time": 1545679616684, "text": "Thank you for coming by and letting us help you with your project! Y'all were great!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "107940296177859176663", "name": "Rebekah Smith", "time": 1565538625407, "rating": 5.0, "text": "Convenient, friendly, and professional. They offer every service I need including notary and always find the best deals.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109148092595887137192", "name": "Lacey House", "time": 1533419426999, "rating": 5.0, "text": "Fast service, friendly and professional staff, and many services available! I witnessed so many happy and satisfied customers while I was in today! I Definitely recommend this business for all your shipping, binding, and packaging needs! Their location is also very convenient! Thanks MailPro!", "pics": null, "resp": {"time": 1533420775509, "text": "Thank you! Your business is very much appreciated and please come again soon!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116662045511772687323", "name": "Richard McCollum", "time": 1573674839172, "rating": 1.0, "text": "They lost a FedEx package we sent. It has been a huge inconvenience for lots of people (and will continue to be for awhile). MailPro claims FedEx lost the package, but FedEx never scanned the package saying they picked it up, which leads me to believe MailPro lost it. FedEx claims MailPro lost it. Either way I really don't care, huge pain, never using the company again even though they are convenient.", "pics": null, "resp": {"time": 1573679750641, "text": "We are terribly sorry for your inconvenience. Your package did get picked up by FedEx, and we do have the manifest that the driver signed. It is rare that a package doesn't get scanned at the hub, but it does happen. We are sorry it happened to your package. All we can do is reimburse you for your shipping charge, which we have done."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "117940719761698850504", "name": "Rebecca Jensen", "time": 1552752934522, "rating": 1.0, "text": "I was in Mailpro yesterday. The lady with dark hair and bigger was ugly to me in front of customers. I was there before the lady she was waiting on and asked her a question. That’s when she got mad and said she was waiting on someone else. I then said that I was there first and she went off on me even pointing out that I had crossed the line when I parked. She gave me the email I needed to send my package with and really though t I would send package thru her after her behavior. I paid 11 cents and left. I will never go in that horrible store again.\n\nYour negative reply truly reflects the attitude you had toward me. Most reputable businesses try to correct the problem or apologize. They do not retaliate or make snarky comments.", "pics": null, "resp": {"time": 1552678459529, "text": "Every customer is important and appreciated in our store. But we do expect our customers to act with basic manners learned in kindergarten. You did enter the store first and began your Wayfair return on your phone at the counter. While you were being helped by Wayfair I began helping a customer that came in and was ready.\n\nYou interrupted this transaction to tell me to look for the Wayfair email. I explained to you that I was helping another customer and I would help you as soon as her transaction was completed. You said \"But I was here first!\" And I replied \"But you weren't ready.\" I was not unkind to you, I was not rude. I also mentioned that had parked diagonally in two spaces - to which you replied \"I've got a new car...\" Wow.\n\nI see you have sent four packages through us in the last two years. If you want to take you business elsewhere, that's your choice. Of course, you are still welcome continue to drop off your prepaid returns with us in the future."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114185328257152977153", "name": "Robert Lee", "time": 1530048489816, "rating": 5.0, "text": "I'm literally in here all the time shipping random items or sending certified mail. The service is always great. Thanks for being awesome! I'm sure I'll see you sometime today to ship something else!", "pics": null, "resp": {"time": 1530049255315, "text": "Thank you! We strive to be of service, and appreciate your business!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "106582673482845655940", "name": "CurlyCutie", "time": 1533403156710, "rating": 1.0, "text": "My daughter and I just experienced the most horrendous display of racism and bigotry from the \"owner\" of this location that I have yet to encounter in this area.  I own a small business that I run out of my home in McMullen Cove (and yes, I do have a license with the City of Huntsville).  I mail packages on a daily basis.  Today, I missed my mail pick up and our local post office had already closed so we drove down to this store so that we could ensure our packages would go out today.  My 12 year old went in first and was refused service.  So, I then took the packages and went inside only to be told that, \"I don't receive anything from the Post Office for compensation and am not required to provide service to you.\"   I asked for her to put that in writing, she refused, spewed some other nastiness until 2 other individuals came in and I told her I would be reporting her to the proper authorities and I left.   As I type this, I am still shaken, that this kind of bigotry and hatred can still exist.  That people feel they have the right to treat others with such vile.  I will not be returning to this location ever and would strongly urge others to also find somewhere else to spend your hard earned money.", "pics": null, "resp": {"time": 1533411883334, "text": "Wow, I feel I have to respond to this - this goes beyond misleading and is simply a lie. There were others in the store that were witness to your extremely rude, and bullying behavior Saturday afternoon. I'm so sorry that we couldn't help you, and that you were not happy here. We really try hard to make every customers experience here a very good one. As I explained to you when you were here - your postal labels would not scan. I tried on both registers  - your labels were not clear enough to be scanned. You knew they were poor labels beforehand, because you were quick to *demand* that I type the numbers in and give you a receipt. I explained that we do not do this, as the post office may never scan and relabel them and we would be held responsible for shipments not delivered as the location that accepted them. I never refused to scan your items, I scanned them several times. I did refuse to give you a receipt for items that won't scan. Again, I'm sorry that you are not happy, but please don't make a racial issue out of a situation that race simply had no bearing. That is extremely sad. I do hope you find happiness wherever you find to drop off in the future."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "110073186716751295578", "name": "Judy Malone", "time": 1553216060550, "rating": 5.0, "text": "I'm in this store at least 3 times a week for something - they help me with everything. The Cove is lucky to have this little store, the workers are always knowledgeable, efficient, and cheerful. Thanks y'all! A+++++", "pics": null, "resp": {"time": 1553262273195, "text": "Thank you Judy! We love to make our customers happy."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "113120573937035350057", "name": "Gaybrielle Valverde", "time": 1561822588057, "rating": 5.0, "text": "I love how convenient this place is and I’ve never had a negative experience at this store.", "pics": null, "resp": {"time": 1561827258875, "text": "Well, the sweet people in this area, like you, make our job easy! Thank you so much for your kind review!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112561891819366709974", "name": "Marie Channer", "time": 1533412424508, "rating": 5.0, "text": "LOVE! this store!  They are the go to place for my shipping.  They even mailed a grandfather clock....no problem they said.  Thank you MailPro!!!", "pics": null, "resp": {"time": 1533421262081, "text": "I remember the clock! Thank you for your business and the packing challenge!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114939163847432919587", "name": "chris anderson", "time": 1547761319355, "rating": 3.0, "text": "The overall atmosphere isnt the same ,   I got some bad looks when I dropped off a return since I was only using the drop box and not paying to return through them", "pics": null, "resp": {"time": 1547760535442, "text": "I'm sorry to hear you feel this way. May I ask what we can do to improve your experience or correct the problem?"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109908593061539807838", "name": "Britton Ethridge", "time": 1554480020942, "rating": 5.0, "text": "Went for help with a difficult Amazon return, & the very helpful staff worked with me to return the packages with no charge! Angeline was especially kind. Will be returning.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116360260574648898826", "name": "Joshua Magrath", "time": 1519421917819, "rating": 1.0, "text": "This place is over priced and lost their DHL access. In short the employee went through my package nosing around asking inappropriate questions. I have used them many times and always found this place over priced and unprofessional.", "pics": null, "resp": {"time": 1520622969300, "text": "Mr. Magrath, I’m sorry you felt unhappy with the quality of our service. Our records indicate that you’ve shipped two packages with us in as many years. One internationally, yes - we must ask questions about your shipment. “What are you sending? What is the value?” The details are required, not by us - but by international customs. We would absolutely not ask any “inappropriate” questions.\n\nLast week you came in and wanted to ship a box of “parts” and insure it. Yes, again, we need to know what you are sending and how much it’s worth. Not out of curiosity, but for insurance purposes. Again, not inappropriate questions. You were very vague about what it was - turned out to be paintball gun equipment, once we ascertained that it wasn’t firearm parts (we aren't licensed to send firearms or HAZMAT) and had no compressed cartridges included (HAZMAT) - we shipped it for you.\n\nYou seemed fine with the transaction at the time - I wish you had had the courage to complain in person instead of leaving a fully misleading review. Some people take these reviews seriously. Truth is, unhappy people write reviews, happy people come back (our customer count is up 30% since we bought the store in October) and we will continue to help our absolutely wonderful customers do what they are trying to do.\n\nOur staff has over 20 years collective experience in the packing and shipping industry. When you bring your items to us to ship, part of our service is ensuring that your item will make it to its destination in perfect shape. Sorry if you find this expertise “nosey”. Lol!\n\nWe are a DHL authorized shipping center, and we do accept pre-labeled DHL shipments at our location. We just don’t have enough demand for the service to print labels from our account."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "102206964601045706586", "name": "Wes Haley", "time": 1469547876625, "rating": 5.0, "text": "MailPro is the place to go when I need to ship a package. But it's also great for so many other things - notary services, live fingerprinting, moving supplies, copies, print jobs, etc.  - basically it's a one stop shop - convenient, courteous owners and employees, and fair prices.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "117402659533986240822", "name": "Brandon Stapler", "time": 1600542014438, "rating": 5.0, "text": "Awesome folks", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109705648434260272701", "name": "Pat Carpenter", "time": 1489540471480, "rating": 5.0, "text": "Very convient. . Good service. Everything you need for mailing in one place.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116321132831559836704", "name": "Steve Vaughan", "time": 1596239345587, "rating": 1.0, "text": "They are very expensive.", "pics": null, "resp": {"time": 1596299738222, "text": "We don't have you in our records as a customer... Wrong store? Our prices are competitive with all the other pack and ship stores."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103544018902048290752", "name": "Michael", "time": 1501897808239, "rating": 5.0, "text": "Good service. Quick.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100674572007366652313", "name": "Michele F", "time": 1565277290290, "rating": 5.0, "text": "We have never had anything but EXCELLENT service at this location", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116064553712770362564", "name": "David Farley", "time": 1553197171296, "rating": 5.0, "text": "Great staff, fast service.", "pics": null, "resp": {"time": 1553262186715, "text": "Thank you! We love to make our customers happy."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103456385486869021430", "name": "Tns Wiley", "time": 1558554412993, "rating": 5.0, "text": "Wonderful speedy service!", "pics": null, "resp": {"time": 1558555792978, "text": "Thank you for coming in to see us!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108077579238692453446", "name": "Amy Bornstein", "time": 1623108791891, "rating": 5.0, "text": "I am a Artist, once a canvas has sold, it must be crated and shipped. The Owner by the name of Angeline and her staff are very helpful, patient, quick and very professional.\nI will be using them constantly from now on.\nIt’s peace of mind to know that my artwork will travel to its new home and arrive in perfect condition.\nThank you, MailPro!!👩‍🎨", "pics": null, "resp": {"time": 1623180808633, "text": "Thank you for the kind words! Always a pleasure to help our artists get their gorgeous art to where it's going!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108953851903629446984", "name": "Missy Fantusi", "time": 1628421604821, "rating": 4.0, "text": "Nice greeting cards, last time I was there, I was waited on right away. That's great!!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112551252548474682989", "name": "Marsha Reynolds", "time": 1619026767954, "rating": 5.0, "text": "Most convenient mailing store I have ever been to. I am never going back to the post office. The service at MailPro is outstanding and the staff is extremely helpful and lovely. Will definitely be back again and again.", "pics": null, "resp": {"time": 1619092610963, "text": "Ooooh thank you for the 5 stars! And thank you for letting us help you! Always a pleasure to be of service to sweet folks like you!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108194833469719585695", "name": "Steve Middlebrooks", "time": 1620943588421, "rating": 1.0, "text": "I went in to ship a golf club today at Mail pro in Owens crossroads Alabama. There was a lady in front of me that went in no mask on and the lady at the counter told her just to put her package over there. I came in with no mask on she told me to go back out and get a mask! Does she know the time it takes for Covid-19 to spread is it a short time or a long time? Apparently she works for the CDC and she knows all about it to discriminate against who wears a mask and who does not. If that service wasn't bad enough they charged me $51 to ship a golf club which normally would cost $39 anywhere else. Save your money save your time and save your humiliation Don't go here.", "pics": null, "resp": {"time": 1620961399940, "text": "Wow. Yes, two customers in a row walked right past our “masks required” sign that is posted on the door. The lady ahead of you could drop her prepaid off and go, you needed to be in the store longer. It would have been futile for her leave to get her mask and come back in - her task was complete.\n\nI’m sorry you feel humiliated by being asked to be compassionate to those around us that haven’t had their vaccination yet. We are still trying to follow the current CDC guidelines, they are on the CDC website if you need a refresher.\n\nAnd again, I’m sorry you felt the price to pack and ship your golf club was more than you wanted to pay. Generally the price for clubs to be packed and shipped runs between $25-$35. The weight, dimensions and destination for this particular package determined the options we gave you. We would have gladly handed it back to you if you had wanted, so you could “price shop” and maybe find an option that better suited your price range.\n\nAs always, you are welcome in our store in the future provided you can be considerate and compassionate to the other shoppers."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100916212036415759093", "name": "Kim Ringenbach (looneypumpkin)", "time": 1613569542336, "rating": 5.0, "text": "Mail Pro is the best place to ship from in Huntsville! The staff is super friendly and quick! I've never had an issue and the owner is the best!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100916030163268426101", "name": "Garel 2008", "time": 1607049251654, "rating": 5.0, "text": "My wife sent an international mail to the Philippines with very important papers and very expensive. She had the wrong address on the package. She found out when she returned home, called them and they went through all the outgoing mail and found it and changed the address label in time. Great job! We will use MailPro again and with a great level of confidence.\n\nThanks! MailPro", "pics": null, "resp": {"time": 1607051157259, "text": "Aw! Thank you for the great review! Always happy to help, glad to get a package where it's supposed to go! Thanks for coming to see us!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100735917630884398660", "name": "D Gallagher", "time": 1622668226041, "rating": 1.0, "text": "Worthless.  Public notary doesn’t understand documents (questionable reading comprehension skills) and refused to accept any help (ie ignorant and stubborn).", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112405032535452363722", "name": "Delilah Roberson", "time": 1618949027570, "rating": 1.0, "text": "Very rude and unprofessional simply because I asked for a tracking receipt.", "pics": null, "resp": {"time": 1619027075853, "text": "We have a sign on the door stating that a mask is required. You came in without a mask and we still served you. I'm sorry this was difficult for you, hope in the future you can find a place to return your prepaid drop offs that will be more to your liking."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103643497643102984504", "name": "Peggy Coulter", "time": 1613505191333, "rating": 1.0, "text": "Closed office? What happened to \"the mail must go through\"? All roads clear here in Hampton Cove. Monday and Tuesday.", "pics": null, "resp": {"time": 1613506543842, "text": "Sorry we missed you. We were open Monday from 9 til around 1:30pm when the temperature dropped below freezing. My employees live over the mountain and I made the decision to remain closed today at 6:30 this morning when the news was reporting that schools, redstone and colleges were closed."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100256428479117552551", "name": "Jonathan Martinez", "time": 1610398309210, "rating": 5.0, "text": "Really efficient post office to drop or send mail. Hard workers and pleasant experience with customer service.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114130145094223069253", "name": "Mary Marshall", "time": 1592581389539, "rating": 5.0, "text": "Always professional, friendly and knowledgeable about all methods of shipping. Very helpful and fun to chat with. My go-to place for shipping.", "pics": null, "resp": {"time": 1592591862288, "text": "Thank you for the sweet review!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100313294291552609460", "name": "Scotty Pate", "time": 1582242385133, "rating": 5.0, "text": "Fantastic business! I have shipped dozens of packages through them. Everything from legal papers to expensive fragile music instruments, and they have packaged and shipped everything perfectly. Love how convenient they are.", "pics": null, "resp": {"time": 1582322506908, "text": "Thank you so much for taking the time to write a review! It's pleasure to help you with all your tasks. Thank you for being a great customer!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116377114387881125250", "name": "Tee West", "time": 1575146678919, "rating": 1.0, "text": "Would give minus 5 stars if possible. Owner very rude!!!!!!!!!!!!!!!!!!!! A  package was processed couple months ago to Amazon from different person in store Today owner refused and said they DID NOT do the package before when in fact it was. Owner needs to learn how to actually run this store sufficiently. I'd been embarrassed to admit I was owner with that attitude. I just read your reply and trust me you were rude and have no intentions of ever doing service here again. That shows bad character on your part for reply such as that!!!!!!! What an arrogance!!!", "pics": null, "resp": {"time": 1575118391387, "text": "LOL!! Yes, I had the audacity to disagree with you... I'm sorry, you are simply mistaken. You chose the Amazon QR code that clearly states on your return for you to take the QR to branded UPS Store for them to scan.\n\nWe are MailPro, a UPS Authorized Shipping Outlet and can take Amazon returns with a UPS label when you choose \"UPS Dropoff\", our scanners can't scan UPS Store QR codes.\n\nLast time I'm sure we showed you how to cancel your return, and re-return it as a \"UPS Dropoff\" to process it for you. We do this approximately 20 times a day for all of our fabulous customers.\n\nI tried to show you how change your return but you were not receptive, choosing instead to be offended. Next time when you bring your QR code in - we'll be sure to walk you through each step so you can understand the process. Life is too short to go through it looking to be offended.."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "101165821461528592940", "name": "Christopher Coleman", "time": 1595596317473, "rating": 5.0, "text": "Great service and convenient location for mailing packages and returns to Amazon.", "pics": null, "resp": {"time": 1595614496284, "text": "Aw thanks! It's a pleasure to help!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "111275442294901164466", "name": "Erin Dwyer", "time": 1557851281853, "rating": 5.0, "text": "Fast, friendly, helpful - LOVE MailPro! I always bypass the Post Office for the ease and convenience of this local mailing center. They are the nicest and can't beat their amazing service!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "118130912154506378661", "name": "Am C", "time": 1551548737108, "rating": 5.0, "text": "So helpful and friendly. Highly recommend this spot. Printed out my label and even supplied tape (both of which I forgot to bring). They took both of my packages (USPS and UPS)", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "110549728771214230733", "name": "Alta Finney", "time": 1533786437553, "rating": 5.0, "text": "We are here a couple times each month, and each time, we receive the most helpful service. It's so much easier to do business with people like these! They ask all the appropriate questions to ensure that my packages will arrive safely, and that is what good customer service is all about!", "pics": null, "resp": {"time": 1533833079754, "text": "Thank you for choosing us! It is our pleasure to help!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112374901908076149586", "name": "Jose Vasquez", "time": 1545508604903, "rating": 5.0, "text": "This place may be tiny. This place may be hidden in the plaza. But ultimately this is the place one needs to go for all their shipping and printing needs. The staff 5/5. If customer service is key. Then they have the key to success.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOfL90X0oZ3lPYbsfNMC_H4tgUcKOfqyuFru2b9=w150-h150-k-no-p"]}], "resp": {"time": 1545679616684, "text": "Thank you for coming by and letting us help you with your project! Y'all were great!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "107940296177859176663", "name": "Rebekah Smith", "time": 1565538625407, "rating": 5.0, "text": "Convenient, friendly, and professional. They offer every service I need including notary and always find the best deals.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109148092595887137192", "name": "Lacey House", "time": 1533419426999, "rating": 5.0, "text": "Fast service, friendly and professional staff, and many services available! I witnessed so many happy and satisfied customers while I was in today! I Definitely recommend this business for all your shipping, binding, and packaging needs! Their location is also very convenient! Thanks MailPro!", "pics": null, "resp": {"time": 1533420775509, "text": "Thank you! Your business is very much appreciated and please come again soon!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116662045511772687323", "name": "Richard McCollum", "time": 1573674839172, "rating": 1.0, "text": "They lost a FedEx package we sent. It has been a huge inconvenience for lots of people (and will continue to be for awhile). MailPro claims FedEx lost the package, but FedEx never scanned the package saying they picked it up, which leads me to believe MailPro lost it. FedEx claims MailPro lost it. Either way I really don't care, huge pain, never using the company again even though they are convenient.", "pics": null, "resp": {"time": 1573679750641, "text": "We are terribly sorry for your inconvenience. Your package did get picked up by FedEx, and we do have the manifest that the driver signed. It is rare that a package doesn't get scanned at the hub, but it does happen. We are sorry it happened to your package. All we can do is reimburse you for your shipping charge, which we have done."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "117940719761698850504", "name": "Rebecca Jensen", "time": 1552752934522, "rating": 1.0, "text": "I was in Mailpro yesterday. The lady with dark hair and bigger was ugly to me in front of customers. I was there before the lady she was waiting on and asked her a question. That’s when she got mad and said she was waiting on someone else. I then said that I was there first and she went off on me even pointing out that I had crossed the line when I parked. She gave me the email I needed to send my package with and really though t I would send package thru her after her behavior. I paid 11 cents and left. I will never go in that horrible store again.\n\nYour negative reply truly reflects the attitude you had toward me. Most reputable businesses try to correct the problem or apologize. They do not retaliate or make snarky comments.", "pics": null, "resp": {"time": 1552678459529, "text": "Every customer is important and appreciated in our store. But we do expect our customers to act with basic manners learned in kindergarten. You did enter the store first and began your Wayfair return on your phone at the counter. While you were being helped by Wayfair I began helping a customer that came in and was ready.\n\nYou interrupted this transaction to tell me to look for the Wayfair email. I explained to you that I was helping another customer and I would help you as soon as her transaction was completed. You said \"But I was here first!\" And I replied \"But you weren't ready.\" I was not unkind to you, I was not rude. I also mentioned that had parked diagonally in two spaces - to which you replied \"I've got a new car...\" Wow.\n\nI see you have sent four packages through us in the last two years. If you want to take you business elsewhere, that's your choice. Of course, you are still welcome continue to drop off your prepaid returns with us in the future."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114185328257152977153", "name": "Robert Lee", "time": 1530048489816, "rating": 5.0, "text": "I'm literally in here all the time shipping random items or sending certified mail. The service is always great. Thanks for being awesome! I'm sure I'll see you sometime today to ship something else!", "pics": null, "resp": {"time": 1530049255315, "text": "Thank you! We strive to be of service, and appreciate your business!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "106582673482845655940", "name": "CurlyCutie", "time": 1533403156710, "rating": 1.0, "text": "My daughter and I just experienced the most horrendous display of racism and bigotry from the \"owner\" of this location that I have yet to encounter in this area.  I own a small business that I run out of my home in McMullen Cove (and yes, I do have a license with the City of Huntsville).  I mail packages on a daily basis.  Today, I missed my mail pick up and our local post office had already closed so we drove down to this store so that we could ensure our packages would go out today.  My 12 year old went in first and was refused service.  So, I then took the packages and went inside only to be told that, \"I don't receive anything from the Post Office for compensation and am not required to provide service to you.\"   I asked for her to put that in writing, she refused, spewed some other nastiness until 2 other individuals came in and I told her I would be reporting her to the proper authorities and I left.   As I type this, I am still shaken, that this kind of bigotry and hatred can still exist.  That people feel they have the right to treat others with such vile.  I will not be returning to this location ever and would strongly urge others to also find somewhere else to spend your hard earned money.", "pics": null, "resp": {"time": 1533411883334, "text": "Wow, I feel I have to respond to this - this goes beyond misleading and is simply a lie. There were others in the store that were witness to your extremely rude, and bullying behavior Saturday afternoon. I'm so sorry that we couldn't help you, and that you were not happy here. We really try hard to make every customers experience here a very good one. As I explained to you when you were here - your postal labels would not scan. I tried on both registers  - your labels were not clear enough to be scanned. You knew they were poor labels beforehand, because you were quick to *demand* that I type the numbers in and give you a receipt. I explained that we do not do this, as the post office may never scan and relabel them and we would be held responsible for shipments not delivered as the location that accepted them. I never refused to scan your items, I scanned them several times. I did refuse to give you a receipt for items that won't scan. Again, I'm sorry that you are not happy, but please don't make a racial issue out of a situation that race simply had no bearing. That is extremely sad. I do hope you find happiness wherever you find to drop off in the future."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "110073186716751295578", "name": "Judy Malone", "time": 1553216060550, "rating": 5.0, "text": "I'm in this store at least 3 times a week for something - they help me with everything. The Cove is lucky to have this little store, the workers are always knowledgeable, efficient, and cheerful. Thanks y'all! A+++++", "pics": null, "resp": {"time": 1553262273195, "text": "Thank you Judy! We love to make our customers happy."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "113120573937035350057", "name": "Gaybrielle Valverde", "time": 1561822588057, "rating": 5.0, "text": "I love how convenient this place is and I’ve never had a negative experience at this store.", "pics": null, "resp": {"time": 1561827258875, "text": "Well, the sweet people in this area, like you, make our job easy! Thank you so much for your kind review!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112561891819366709974", "name": "Marie Channer", "time": 1533412424508, "rating": 5.0, "text": "LOVE! this store!  They are the go to place for my shipping.  They even mailed a grandfather clock....no problem they said.  Thank you MailPro!!!", "pics": null, "resp": {"time": 1533421262081, "text": "I remember the clock! Thank you for your business and the packing challenge!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114939163847432919587", "name": "chris anderson", "time": 1547761319355, "rating": 3.0, "text": "The overall atmosphere isnt the same ,   I got some bad looks when I dropped off a return since I was only using the drop box and not paying to return through them", "pics": null, "resp": {"time": 1547760535442, "text": "I'm sorry to hear you feel this way. May I ask what we can do to improve your experience or correct the problem?"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109908593061539807838", "name": "Britton Ethridge", "time": 1554480020942, "rating": 5.0, "text": "Went for help with a difficult Amazon return, & the very helpful staff worked with me to return the packages with no charge! Angeline was especially kind. Will be returning.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116360260574648898826", "name": "Joshua Magrath", "time": 1519421917819, "rating": 1.0, "text": "This place is over priced and lost their DHL access. In short the employee went through my package nosing around asking inappropriate questions. I have used them many times and always found this place over priced and unprofessional.", "pics": null, "resp": {"time": 1520622969300, "text": "Mr. Magrath, I’m sorry you felt unhappy with the quality of our service. Our records indicate that you’ve shipped two packages with us in as many years. One internationally, yes - we must ask questions about your shipment. “What are you sending? What is the value?” The details are required, not by us - but by international customs. We would absolutely not ask any “inappropriate” questions.\n\nLast week you came in and wanted to ship a box of “parts” and insure it. Yes, again, we need to know what you are sending and how much it’s worth. Not out of curiosity, but for insurance purposes. Again, not inappropriate questions. You were very vague about what it was - turned out to be paintball gun equipment, once we ascertained that it wasn’t firearm parts (we aren't licensed to send firearms or HAZMAT) and had no compressed cartridges included (HAZMAT) - we shipped it for you.\n\nYou seemed fine with the transaction at the time - I wish you had had the courage to complain in person instead of leaving a fully misleading review. Some people take these reviews seriously. Truth is, unhappy people write reviews, happy people come back (our customer count is up 30% since we bought the store in October) and we will continue to help our absolutely wonderful customers do what they are trying to do.\n\nOur staff has over 20 years collective experience in the packing and shipping industry. When you bring your items to us to ship, part of our service is ensuring that your item will make it to its destination in perfect shape. Sorry if you find this expertise “nosey”. Lol!\n\nWe are a DHL authorized shipping center, and we do accept pre-labeled DHL shipments at our location. We just don’t have enough demand for the service to print labels from our account."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "102206964601045706586", "name": "Wes Haley", "time": 1469547876625, "rating": 5.0, "text": "MailPro is the place to go when I need to ship a package. But it's also great for so many other things - notary services, live fingerprinting, moving supplies, copies, print jobs, etc.  - basically it's a one stop shop - convenient, courteous owners and employees, and fair prices.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "117402659533986240822", "name": "Brandon Stapler", "time": 1600542014438, "rating": 5.0, "text": "Awesome folks", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109705648434260272701", "name": "Pat Carpenter", "time": 1489540471480, "rating": 5.0, "text": "Very convient. . Good service. Everything you need for mailing in one place.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116321132831559836704", "name": "Steve Vaughan", "time": 1596239345587, "rating": 1.0, "text": "They are very expensive.", "pics": null, "resp": {"time": 1596299738222, "text": "We don't have you in our records as a customer... Wrong store? Our prices are competitive with all the other pack and ship stores."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103544018902048290752", "name": "Michael", "time": 1501897808239, "rating": 5.0, "text": "Good service. Quick.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100674572007366652313", "name": "Michele F", "time": 1565277290290, "rating": 5.0, "text": "We have never had anything but EXCELLENT service at this location", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116064553712770362564", "name": "David Farley", "time": 1553197171296, "rating": 5.0, "text": "Great staff, fast service.", "pics": null, "resp": {"time": 1553262186715, "text": "Thank you! We love to make our customers happy."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103456385486869021430", "name": "Tns Wiley", "time": 1558554412993, "rating": 5.0, "text": "Wonderful speedy service!", "pics": null, "resp": {"time": 1558555792978, "text": "Thank you for coming in to see us!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108077579238692453446", "name": "Amy Bornstein", "time": 1623108791891, "rating": 5.0, "text": "I am a Artist, once a canvas has sold, it must be crated and shipped. The Owner by the name of Angeline and her staff are very helpful, patient, quick and very professional.\nI will be using them constantly from now on.\nIt’s peace of mind to know that my artwork will travel to its new home and arrive in perfect condition.\nThank you, MailPro!!👩‍🎨", "pics": null, "resp": {"time": 1623180808633, "text": "Thank you for the kind words! Always a pleasure to help our artists get their gorgeous art to where it's going!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108953851903629446984", "name": "Missy Fantusi", "time": 1628421604821, "rating": 4.0, "text": "Nice greeting cards, last time I was there, I was waited on right away. That's great!!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112551252548474682989", "name": "Marsha Reynolds", "time": 1619026767954, "rating": 5.0, "text": "Most convenient mailing store I have ever been to. I am never going back to the post office. The service at MailPro is outstanding and the staff is extremely helpful and lovely. Will definitely be back again and again.", "pics": null, "resp": {"time": 1619092610963, "text": "Ooooh thank you for the 5 stars! And thank you for letting us help you! Always a pleasure to be of service to sweet folks like you!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108194833469719585695", "name": "Steve Middlebrooks", "time": 1620943588421, "rating": 1.0, "text": "I went in to ship a golf club today at Mail pro in Owens crossroads Alabama. There was a lady in front of me that went in no mask on and the lady at the counter told her just to put her package over there. I came in with no mask on she told me to go back out and get a mask! Does she know the time it takes for Covid-19 to spread is it a short time or a long time? Apparently she works for the CDC and she knows all about it to discriminate against who wears a mask and who does not. If that service wasn't bad enough they charged me $51 to ship a golf club which normally would cost $39 anywhere else. Save your money save your time and save your humiliation Don't go here.", "pics": null, "resp": {"time": 1620961399940, "text": "Wow. Yes, two customers in a row walked right past our “masks required” sign that is posted on the door. The lady ahead of you could drop her prepaid off and go, you needed to be in the store longer. It would have been futile for her leave to get her mask and come back in - her task was complete.\n\nI’m sorry you feel humiliated by being asked to be compassionate to those around us that haven’t had their vaccination yet. We are still trying to follow the current CDC guidelines, they are on the CDC website if you need a refresher.\n\nAnd again, I’m sorry you felt the price to pack and ship your golf club was more than you wanted to pay. Generally the price for clubs to be packed and shipped runs between $25-$35. The weight, dimensions and destination for this particular package determined the options we gave you. We would have gladly handed it back to you if you had wanted, so you could “price shop” and maybe find an option that better suited your price range.\n\nAs always, you are welcome in our store in the future provided you can be considerate and compassionate to the other shoppers."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100916212036415759093", "name": "Kim Ringenbach (looneypumpkin)", "time": 1613569542336, "rating": 5.0, "text": "Mail Pro is the best place to ship from in Huntsville! The staff is super friendly and quick! I've never had an issue and the owner is the best!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100916030163268426101", "name": "Garel 2008", "time": 1607049251654, "rating": 5.0, "text": "My wife sent an international mail to the Philippines with very important papers and very expensive. She had the wrong address on the package. She found out when she returned home, called them and they went through all the outgoing mail and found it and changed the address label in time. Great job! We will use MailPro again and with a great level of confidence.\n\nThanks! MailPro", "pics": null, "resp": {"time": 1607051157259, "text": "Aw! Thank you for the great review! Always happy to help, glad to get a package where it's supposed to go! Thanks for coming to see us!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100735917630884398660", "name": "D Gallagher", "time": 1622668226041, "rating": 1.0, "text": "Worthless.  Public notary doesn’t understand documents (questionable reading comprehension skills) and refused to accept any help (ie ignorant and stubborn).", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112405032535452363722", "name": "Delilah Roberson", "time": 1618949027570, "rating": 1.0, "text": "Very rude and unprofessional simply because I asked for a tracking receipt.", "pics": null, "resp": {"time": 1619027075853, "text": "We have a sign on the door stating that a mask is required. You came in without a mask and we still served you. I'm sorry this was difficult for you, hope in the future you can find a place to return your prepaid drop offs that will be more to your liking."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103643497643102984504", "name": "Peggy Coulter", "time": 1613505191333, "rating": 1.0, "text": "Closed office? What happened to \"the mail must go through\"? All roads clear here in Hampton Cove. Monday and Tuesday.", "pics": null, "resp": {"time": 1613506543842, "text": "Sorry we missed you. We were open Monday from 9 til around 1:30pm when the temperature dropped below freezing. My employees live over the mountain and I made the decision to remain closed today at 6:30 this morning when the news was reporting that schools, redstone and colleges were closed."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100256428479117552551", "name": "Jonathan Martinez", "time": 1610398309210, "rating": 5.0, "text": "Really efficient post office to drop or send mail. Hard workers and pleasant experience with customer service.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114130145094223069253", "name": "Mary Marshall", "time": 1592581389539, "rating": 5.0, "text": "Always professional, friendly and knowledgeable about all methods of shipping. Very helpful and fun to chat with. My go-to place for shipping.", "pics": null, "resp": {"time": 1592591862288, "text": "Thank you for the sweet review!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100313294291552609460", "name": "Scotty Pate", "time": 1582242385133, "rating": 5.0, "text": "Fantastic business! I have shipped dozens of packages through them. Everything from legal papers to expensive fragile music instruments, and they have packaged and shipped everything perfectly. Love how convenient they are.", "pics": null, "resp": {"time": 1582322506908, "text": "Thank you so much for taking the time to write a review! It's pleasure to help you with all your tasks. Thank you for being a great customer!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116377114387881125250", "name": "Tee West", "time": 1575146678919, "rating": 1.0, "text": "Would give minus 5 stars if possible. Owner very rude!!!!!!!!!!!!!!!!!!!! A  package was processed couple months ago to Amazon from different person in store Today owner refused and said they DID NOT do the package before when in fact it was. Owner needs to learn how to actually run this store sufficiently. I'd been embarrassed to admit I was owner with that attitude. I just read your reply and trust me you were rude and have no intentions of ever doing service here again. That shows bad character on your part for reply such as that!!!!!!! What an arrogance!!!", "pics": null, "resp": {"time": 1575118391387, "text": "LOL!! Yes, I had the audacity to disagree with you... I'm sorry, you are simply mistaken. You chose the Amazon QR code that clearly states on your return for you to take the QR to branded UPS Store for them to scan.\n\nWe are MailPro, a UPS Authorized Shipping Outlet and can take Amazon returns with a UPS label when you choose \"UPS Dropoff\", our scanners can't scan UPS Store QR codes.\n\nLast time I'm sure we showed you how to cancel your return, and re-return it as a \"UPS Dropoff\" to process it for you. We do this approximately 20 times a day for all of our fabulous customers.\n\nI tried to show you how change your return but you were not receptive, choosing instead to be offended. Next time when you bring your QR code in - we'll be sure to walk you through each step so you can understand the process. Life is too short to go through it looking to be offended.."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "101165821461528592940", "name": "Christopher Coleman", "time": 1595596317473, "rating": 5.0, "text": "Great service and convenient location for mailing packages and returns to Amazon.", "pics": null, "resp": {"time": 1595614496284, "text": "Aw thanks! It's a pleasure to help!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "111275442294901164466", "name": "Erin Dwyer", "time": 1557851281853, "rating": 5.0, "text": "Fast, friendly, helpful - LOVE MailPro! I always bypass the Post Office for the ease and convenience of this local mailing center. They are the nicest and can't beat their amazing service!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "118130912154506378661", "name": "Am C", "time": 1551548737108, "rating": 5.0, "text": "So helpful and friendly. Highly recommend this spot. Printed out my label and even supplied tape (both of which I forgot to bring). They took both of my packages (USPS and UPS)", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "110549728771214230733", "name": "Alta Finney", "time": 1533786437553, "rating": 5.0, "text": "We are here a couple times each month, and each time, we receive the most helpful service. It's so much easier to do business with people like these! They ask all the appropriate questions to ensure that my packages will arrive safely, and that is what good customer service is all about!", "pics": null, "resp": {"time": 1533833079754, "text": "Thank you for choosing us! It is our pleasure to help!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112374901908076149586", "name": "Jose Vasquez", "time": 1545508604903, "rating": 5.0, "text": "This place may be tiny. This place may be hidden in the plaza. But ultimately this is the place one needs to go for all their shipping and printing needs. The staff 5/5. If customer service is key. Then they have the key to success.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOfL90X0oZ3lPYbsfNMC_H4tgUcKOfqyuFru2b9=w150-h150-k-no-p"]}], "resp": {"time": 1545679616684, "text": "Thank you for coming by and letting us help you with your project! Y'all were great!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "107940296177859176663", "name": "Rebekah Smith", "time": 1565538625407, "rating": 5.0, "text": "Convenient, friendly, and professional. They offer every service I need including notary and always find the best deals.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109148092595887137192", "name": "Lacey House", "time": 1533419426999, "rating": 5.0, "text": "Fast service, friendly and professional staff, and many services available! I witnessed so many happy and satisfied customers while I was in today! I Definitely recommend this business for all your shipping, binding, and packaging needs! Their location is also very convenient! Thanks MailPro!", "pics": null, "resp": {"time": 1533420775509, "text": "Thank you! Your business is very much appreciated and please come again soon!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116662045511772687323", "name": "Richard McCollum", "time": 1573674839172, "rating": 1.0, "text": "They lost a FedEx package we sent. It has been a huge inconvenience for lots of people (and will continue to be for awhile). MailPro claims FedEx lost the package, but FedEx never scanned the package saying they picked it up, which leads me to believe MailPro lost it. FedEx claims MailPro lost it. Either way I really don't care, huge pain, never using the company again even though they are convenient.", "pics": null, "resp": {"time": 1573679750641, "text": "We are terribly sorry for your inconvenience. Your package did get picked up by FedEx, and we do have the manifest that the driver signed. It is rare that a package doesn't get scanned at the hub, but it does happen. We are sorry it happened to your package. All we can do is reimburse you for your shipping charge, which we have done."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "117940719761698850504", "name": "Rebecca Jensen", "time": 1552752934522, "rating": 1.0, "text": "I was in Mailpro yesterday. The lady with dark hair and bigger was ugly to me in front of customers. I was there before the lady she was waiting on and asked her a question. That’s when she got mad and said she was waiting on someone else. I then said that I was there first and she went off on me even pointing out that I had crossed the line when I parked. She gave me the email I needed to send my package with and really though t I would send package thru her after her behavior. I paid 11 cents and left. I will never go in that horrible store again.\n\nYour negative reply truly reflects the attitude you had toward me. Most reputable businesses try to correct the problem or apologize. They do not retaliate or make snarky comments.", "pics": null, "resp": {"time": 1552678459529, "text": "Every customer is important and appreciated in our store. But we do expect our customers to act with basic manners learned in kindergarten. You did enter the store first and began your Wayfair return on your phone at the counter. While you were being helped by Wayfair I began helping a customer that came in and was ready.\n\nYou interrupted this transaction to tell me to look for the Wayfair email. I explained to you that I was helping another customer and I would help you as soon as her transaction was completed. You said \"But I was here first!\" And I replied \"But you weren't ready.\" I was not unkind to you, I was not rude. I also mentioned that had parked diagonally in two spaces - to which you replied \"I've got a new car...\" Wow.\n\nI see you have sent four packages through us in the last two years. If you want to take you business elsewhere, that's your choice. Of course, you are still welcome continue to drop off your prepaid returns with us in the future."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114185328257152977153", "name": "Robert Lee", "time": 1530048489816, "rating": 5.0, "text": "I'm literally in here all the time shipping random items or sending certified mail. The service is always great. Thanks for being awesome! I'm sure I'll see you sometime today to ship something else!", "pics": null, "resp": {"time": 1530049255315, "text": "Thank you! We strive to be of service, and appreciate your business!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "106582673482845655940", "name": "CurlyCutie", "time": 1533403156710, "rating": 1.0, "text": "My daughter and I just experienced the most horrendous display of racism and bigotry from the \"owner\" of this location that I have yet to encounter in this area.  I own a small business that I run out of my home in McMullen Cove (and yes, I do have a license with the City of Huntsville).  I mail packages on a daily basis.  Today, I missed my mail pick up and our local post office had already closed so we drove down to this store so that we could ensure our packages would go out today.  My 12 year old went in first and was refused service.  So, I then took the packages and went inside only to be told that, \"I don't receive anything from the Post Office for compensation and am not required to provide service to you.\"   I asked for her to put that in writing, she refused, spewed some other nastiness until 2 other individuals came in and I told her I would be reporting her to the proper authorities and I left.   As I type this, I am still shaken, that this kind of bigotry and hatred can still exist.  That people feel they have the right to treat others with such vile.  I will not be returning to this location ever and would strongly urge others to also find somewhere else to spend your hard earned money.", "pics": null, "resp": {"time": 1533411883334, "text": "Wow, I feel I have to respond to this - this goes beyond misleading and is simply a lie. There were others in the store that were witness to your extremely rude, and bullying behavior Saturday afternoon. I'm so sorry that we couldn't help you, and that you were not happy here. We really try hard to make every customers experience here a very good one. As I explained to you when you were here - your postal labels would not scan. I tried on both registers  - your labels were not clear enough to be scanned. You knew they were poor labels beforehand, because you were quick to *demand* that I type the numbers in and give you a receipt. I explained that we do not do this, as the post office may never scan and relabel them and we would be held responsible for shipments not delivered as the location that accepted them. I never refused to scan your items, I scanned them several times. I did refuse to give you a receipt for items that won't scan. Again, I'm sorry that you are not happy, but please don't make a racial issue out of a situation that race simply had no bearing. That is extremely sad. I do hope you find happiness wherever you find to drop off in the future."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "110073186716751295578", "name": "Judy Malone", "time": 1553216060550, "rating": 5.0, "text": "I'm in this store at least 3 times a week for something - they help me with everything. The Cove is lucky to have this little store, the workers are always knowledgeable, efficient, and cheerful. Thanks y'all! A+++++", "pics": null, "resp": {"time": 1553262273195, "text": "Thank you Judy! We love to make our customers happy."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "113120573937035350057", "name": "Gaybrielle Valverde", "time": 1561822588057, "rating": 5.0, "text": "I love how convenient this place is and I’ve never had a negative experience at this store.", "pics": null, "resp": {"time": 1561827258875, "text": "Well, the sweet people in this area, like you, make our job easy! Thank you so much for your kind review!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112561891819366709974", "name": "Marie Channer", "time": 1533412424508, "rating": 5.0, "text": "LOVE! this store!  They are the go to place for my shipping.  They even mailed a grandfather clock....no problem they said.  Thank you MailPro!!!", "pics": null, "resp": {"time": 1533421262081, "text": "I remember the clock! Thank you for your business and the packing challenge!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114939163847432919587", "name": "chris anderson", "time": 1547761319355, "rating": 3.0, "text": "The overall atmosphere isnt the same ,   I got some bad looks when I dropped off a return since I was only using the drop box and not paying to return through them", "pics": null, "resp": {"time": 1547760535442, "text": "I'm sorry to hear you feel this way. May I ask what we can do to improve your experience or correct the problem?"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109908593061539807838", "name": "Britton Ethridge", "time": 1554480020942, "rating": 5.0, "text": "Went for help with a difficult Amazon return, & the very helpful staff worked with me to return the packages with no charge! Angeline was especially kind. Will be returning.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116360260574648898826", "name": "Joshua Magrath", "time": 1519421917819, "rating": 1.0, "text": "This place is over priced and lost their DHL access. In short the employee went through my package nosing around asking inappropriate questions. I have used them many times and always found this place over priced and unprofessional.", "pics": null, "resp": {"time": 1520622969300, "text": "Mr. Magrath, I’m sorry you felt unhappy with the quality of our service. Our records indicate that you’ve shipped two packages with us in as many years. One internationally, yes - we must ask questions about your shipment. “What are you sending? What is the value?” The details are required, not by us - but by international customs. We would absolutely not ask any “inappropriate” questions.\n\nLast week you came in and wanted to ship a box of “parts” and insure it. Yes, again, we need to know what you are sending and how much it’s worth. Not out of curiosity, but for insurance purposes. Again, not inappropriate questions. You were very vague about what it was - turned out to be paintball gun equipment, once we ascertained that it wasn’t firearm parts (we aren't licensed to send firearms or HAZMAT) and had no compressed cartridges included (HAZMAT) - we shipped it for you.\n\nYou seemed fine with the transaction at the time - I wish you had had the courage to complain in person instead of leaving a fully misleading review. Some people take these reviews seriously. Truth is, unhappy people write reviews, happy people come back (our customer count is up 30% since we bought the store in October) and we will continue to help our absolutely wonderful customers do what they are trying to do.\n\nOur staff has over 20 years collective experience in the packing and shipping industry. When you bring your items to us to ship, part of our service is ensuring that your item will make it to its destination in perfect shape. Sorry if you find this expertise “nosey”. Lol!\n\nWe are a DHL authorized shipping center, and we do accept pre-labeled DHL shipments at our location. We just don’t have enough demand for the service to print labels from our account."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "102206964601045706586", "name": "Wes Haley", "time": 1469547876625, "rating": 5.0, "text": "MailPro is the place to go when I need to ship a package. But it's also great for so many other things - notary services, live fingerprinting, moving supplies, copies, print jobs, etc.  - basically it's a one stop shop - convenient, courteous owners and employees, and fair prices.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "117402659533986240822", "name": "Brandon Stapler", "time": 1600542014438, "rating": 5.0, "text": "Awesome folks", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109705648434260272701", "name": "Pat Carpenter", "time": 1489540471480, "rating": 5.0, "text": "Very convient. . Good service. Everything you need for mailing in one place.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116321132831559836704", "name": "Steve Vaughan", "time": 1596239345587, "rating": 1.0, "text": "They are very expensive.", "pics": null, "resp": {"time": 1596299738222, "text": "We don't have you in our records as a customer... Wrong store? Our prices are competitive with all the other pack and ship stores."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103544018902048290752", "name": "Michael", "time": 1501897808239, "rating": 5.0, "text": "Good service. Quick.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100674572007366652313", "name": "Michele F", "time": 1565277290290, "rating": 5.0, "text": "We have never had anything but EXCELLENT service at this location", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116064553712770362564", "name": "David Farley", "time": 1553197171296, "rating": 5.0, "text": "Great staff, fast service.", "pics": null, "resp": {"time": 1553262186715, "text": "Thank you! We love to make our customers happy."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103456385486869021430", "name": "Tns Wiley", "time": 1558554412993, "rating": 5.0, "text": "Wonderful speedy service!", "pics": null, "resp": {"time": 1558555792978, "text": "Thank you for coming in to see us!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "111943477506155138390", "name": "Katie Caldwell", "time": 1613091026088, "rating": 5.0, "text": "Ellis, Daysha, Trent and Victoria always take care of us! These are the best people and they are so kind, friendly and helpful. It is so nice to walk in and be greeted by name. They know us and our family and it is a pleasure to bring packages to them as well as give printing and binding projects to them. Great team, great service! We are grateful for their work.", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "107967926595260228493", "name": "Suresh Mathews", "time": 1612919791678, "rating": 4.0, "text": "I went to this FedEx place because it was on the way back from work. More importantly, parking was easy with so many available spots, even a couple of 15-min parking spots, which is all you need if you want to just drop off a package. My wait was slightly longer than anticipated and therefore the 4/5 rating; there was only 1 employee to assist customers.", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "115991351756192841595", "name": "Anonymous Truth", "time": 1608792799520, "rating": 1.0, "text": "Sadly, typical unprofessional, untrained, obnoxious employees who cause MANY problems IF not watched at every turn to ensure there are no gross, negligent errors. GO ELSEWHERE IF POSSIBLE ... NOT WORTH THE UNNECESSARY MAJOR HASSLE.", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "111954297446000520646", "name": "Gautham S", "time": 1595652428422, "rating": 5.0, "text": "Don’t listen to the people who rated 1 star below. You cannot find a better group of professional shippers during these times. A+ Their store is sparkling!", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "113975349238127557492", "name": "Joseph Bell", "time": 1591723008575, "rating": 1.0, "text": "So I ordered a set (4) of tires from Priority Tire and only got 2 tires. They said they gave them to FedEx and don’t know why I havent received them. Told me they’d filed a claim with FedEx and Id have to wait 2 weeks on the results. Im done with online shopping/shipping.", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "113305460516147741416", "name": "Carson Hull", "time": 1547410490941, "rating": 5.0, "text": "Trent was amazing! There was an awful woman in there screaming at him for absolutely no reason and he handled it with grace and care. He was such a great help and deserves more than five stars! If the woman screaming can see this, shame on you for treating another human being like that.", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "112399601183410444012", "name": "Brenise Andre", "time": 1549316567046, "rating": 1.0, "text": "I went into this location for the first time with an uregent legal document and wasn’t even acknowledged. I wasn’t greeted. I’m sure the law firm will be reaching out at some point to find out why I was treated so poorly. I give them two thumbs down. Completely awful service.", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "101274678510402075004", "name": "Brantley Peddy", "time": 1564180467321, "rating": 5.0, "text": "Excellent customer service. Employees were very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "107848514114374007553", "name": "Krissy Cinnamon", "time": 1524256080828, "rating": 5.0, "text": "Received fast and friendly service. Didn’t have what I needed, BUT the employee was kind enough to walk around the store to provide me with other options. Was greated by all 3 employees upon entering and felt welcome! Thank you.", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "117024518360377726376", "name": "John", "time": 1570067191769, "rating": 5.0, "text": "Great staff, nice inventory, and perfect customer experience. This is my go-to location for all my shipping needs now.", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "105729672605199671428", "name": "Dejon Henry", "time": 1563387311277, "rating": 5.0, "text": "D lonta ,The rep at the counter was great very professional and helpful", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "106382908758675508601", "name": "Susan Evans Murphy", "time": 1501698489636, "rating": 5.0, "text": "Jasmine was awesome!  I bought a print yourself planner off of Etsy and she doubleside printed, cut, and bound for me. Looks very professional. Super friendly too.", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "108721546375365510351", "name": "Philip Arnold", "time": 1476564053725, "rating": 1.0, "text": "Another useless location with a noon cutoff time for the highly expensive Saturday Express Shipment service.  Even though the store is open much later", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "105103504182998738746", "name": "michael dunham", "time": 1537144132470, "rating": 1.0, "text": "The lady working today obviously is having a bad day.  Very rude.", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "103719339727414545958", "name": "Blake Thomas", "time": 1550596678665, "rating": 5.0, "text": "Excellent customer service will definitely be back", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "100007689729589228843", "name": "Katrina Nakhjavan", "time": 1542399038435, "rating": 5.0, "text": "Employees were helpful and very nice.", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "118303283951449952966", "name": "Tom Brander", "time": 1448818480283, "rating": 4.0, "text": "Good service nice people convenient location", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "102296518660203810921", "name": "黄戈弋", "time": 1528219875563, "rating": 5.0, "text": "The Mr. Lonta is very friendly!", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "107414909128159892882", "name": "Paul Barrett", "time": 1488646879073, "rating": 3.0, "text": "Adequate.", "pics": null, "resp": null, "gmap_id": "0x888919c31d5701f1:0x453d74a47156b242"}
{"user_id": "114720194413747308763", "name": "R T", "time": 1614901009216, "rating": 1.0, "text": "I went by there to find out the cost to mail something simple 9 x 6 envelope with papers enclosed. I was given a price of $4.36 to mail it. I asked what the store store was (Surcharge) and the lady did not know. I left and did not mail it there. I took it to the post office downtown Decatur, Alabama and the Total cost was only $2. What kind of extra charges is this place charging?", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "114441491131382657787", "name": "Kris Small", "time": 1595953548046, "rating": 1.0, "text": "I've never once been asked what I am shipping ever by any company. I was attempting to ship some very valuable items to my brother in Ca. today and was asked what I was shipping, I stated personal items nothing hazardous. She asked me to describe the item.... that's how they figure out what packages to steal I guess.  because I've had plenty of packages go missing in the mail. if it's hazardous sure I understand but it's not and not on the prohibited list. so they don't need to know. I'll take it to UPS or Fedex next time directly.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "113782076434936919802", "name": "Joey Anderson", "time": 1581617285842, "rating": 5.0, "text": "I am very impressed with this store and their employees. I was greated before I made it completely through the door. The staff is upbeat and professional. They were able to service all of my needs and super knowledgeable. I will definately be going back. Thank you for such a wonderful experience.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "105894517387541931417", "name": "Jason Jameson", "time": 1571417959113, "rating": 5.0, "text": "Amazing store, most polite employees, FedEx shipping. Ignore other reviews where people are not posting honest information. The Shipping Store & More offers FedEx shipping and has amazing employees!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "108084887572777496456", "name": "Jay Boyd", "time": 1581458906888, "rating": 5.0, "text": "The employees are very friendly and helpful at this esablishment. I am exteremly satisfied with their professionalism and expertise. I appreciate their services and friendly smiles.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "100483729770111816809", "name": "Glen Hunter", "time": 1576823465784, "rating": 5.0, "text": "The 2 clerk's working today were very helpful and professional and handled my packing and shipping needs very quickly. I would definitely recommend this store for all your packing and shipping needs.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "107824479444157216157", "name": "Bill Jehle", "time": 1440517629378, "rating": 5.0, "text": "As the chief cook and bottle washer of my own business, the kind folks at The Shipping Store are my staff. I could not run my business without them. Shipping and receiving, not a problem. Notary, not a problem. Photocopies, packing material, anything an average office would need, not a problem. Blueprints, full-sized plans that require a plotter, again, not a problem. Plus, it's great to walk in and folks know me by name. Let The Shipping Store be your secret weapon to make your life or business life a little bit easier.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "109508137692215896816", "name": "Captain_Redpill", "time": 1553722820451, "rating": 1.0, "text": "Won't be going back to this place ever.  The lady working there completely refused to serve me.  Went two miles down the road and had the service performed at the ups store,  without question.   Continue to watch your business fail.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "116113654703355588114", "name": "Alexa Womack", "time": 1462886507362, "rating": 5.0, "text": "Such a welcoming store! I was greeted by every person in the store upon entering and leaving. They were even willing to get my package ready to go even though it was UPS. I was only there for a few minutes but I really felt that the employees enjoyed their job! Definitely recommend using them.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "105389454577494015329", "name": "Brian Moran", "time": 1448147712160, "rating": 5.0, "text": "I have to say that I've never been taken care of in the way this team takes care of my needs. As a small business person myself, I appreciate the attention to detail, warm environment, and sincerity I receive when I walk into with The Shipping Store. I've read some of the other reviews and I would have to say that their prices are very fair. They provide a service that I have not seen matched with other big company chain stores. It is an absolute pleasure to do business with these guys!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "107847402129431752361", "name": "Sandra Austin", "time": 1594243283093, "rating": 1.0, "text": "Anytime I mail from here it takes many days for the package to get anywhere.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "106934267714093912358", "name": "Christina Morse", "time": 1463755936331, "rating": 5.0, "text": "The employees at The Shipping Store were super friendly and helpful! They did everything they could to save me money on shipping. If you have anything to ship, I would definitely recommend The Shipping Store. They made shipping a breeze!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "100668768891717817680", "name": "Jennifer Melcher", "time": 1464146531134, "rating": 5.0, "text": "We took in a fragile item and they packed it for us wonderfully. They were super nice and not just to us but to everyone that came in. They also showed us ways they could help our small business save money on shipping and printing. We will definitely use again!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "110547199723346370010", "name": "John Wallace", "time": 1563465552462, "rating": 1.0, "text": "They do not ship fedex, waste of my, yours and everyone's time.  Fedex sign in window, rude lady behind the counter..DO NOT GO HERE IF YOU ARE TRYING TK SHIP A FEDEX PACKAGE, FALSE ADVERTISEMENT..!!!!!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "106542589286602344651", "name": "jose villa", "time": 1575930733783, "rating": 1.0, "text": "Waste of time they say they ship fedex but they don't they are limited so you have to go to the one in Madison. Why even call it the ship in store where they can't ship nothing", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "118445472702982105366", "name": "susan hassett", "time": 1441054295523, "rating": 5.0, "text": "I have used The Shipping Store for many years to mail packages, have copies made and faxes sent. I appreciate the professional and friendly staff. Their packaging services help me save time and enable me to send packages hassle-free.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "109596769324101350077", "name": "Tracy Roberson", "time": 1463225262109, "rating": 5.0, "text": "The staff are always professional and courteous when I bring things in to have shipped.  I wish the same was true of USPS. The Shipping Store has never lost any of my parcels with the many dealings I have had with the business. You can probably guess who has. I will continue to bring my business here as long as they are here. Thank you.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "115160726920482923383", "name": "Jenna Burfield", "time": 1558036223914, "rating": 1.0, "text": "Store staff was very rude. TERRIBLE CUSTOMER SERVICE!! I brought in a package to be shipped and asked for documentation stating that I dropped a the package off. The lady behind the counter stated that if I wanted a receipt that I could wait until FedEx picked it from their location and scanned the barcode (who is to say they wouldn't loose my package) or I could drive to Madison.\n\nEdited to inform that I was able to take my package to Walgreens for drop off. The Walgreens staff were friendly and promptly emailed me a recept for my records. THERE IS ABSOLUTELY NO EXCUSE for the pushback I received when I asked for a simple drop off receipt from The Shipping Store.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "104087776520124817766", "name": "Mary McMahan", "time": 1440260718055, "rating": 5.0, "text": "Amanda saved me from losing my $4900.00 ring to a scammer on Craigslist.  I am so grateful to her and to this store for hiring her.  This experience has brought renewed faith that there are still people who work for businesses that genuinely care about their customers !!  Amanda, you are an angel, I will always be grateful for you and I pray blessings upon you and your family !!  The Shipping Store....don't ever let her go !!!!!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "106889816728629286135", "name": "Laron Hardy", "time": 1462390895397, "rating": 5.0, "text": "Great people, great service!  The Shipping Store is a place where you will be taken care of.  Great folks!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "117270700978745782182", "name": "AK Lee", "time": 1495585833241, "rating": 5.0, "text": "They offer a great service and and I even paid for the tape it was worth it", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "117701923495067398210", "name": "L D", "time": 1377130186414, "rating": 2.0, "text": "Way overpriced. $0.75/each for stamps! Their shipping costs are also astronomical. I went there to ship a package and was quoted an amount so high that I thought it was a joke. It wasn't. I then went to Staples right down the street to get a quote from their shipping center and it was 50% less. Stay away from this place!", "pics": null, "resp": {"time": 1493327901599, "text": "Jill,\n\nFirstly, thank you for patronizing our business.  We take great pride in our friendly, high level of customer service.  As to your comments about our service charges,  If we weren't able to realize some level of margin over our costs, we would not be able to maintain a viable business or be able to offer the level of service that we so pride ourselves in.\n\nThanks sincerely,\nDon Cantrell\nThe Shipping Store and more..."}, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "101710291188347059144", "name": "cassandra chittam", "time": 1447866224969, "rating": 1.0, "text": "Closest shipping place to our company.  We will be driving the extra distance to find an actual post office from now on.  Pricing is extremely high to send out items USPS.  When I called asking why they charged my assistant 10.74 for a small FLAT RATE box, I was told they do not honer flat rate shipping.  I then asked why did they not inform my assistant of this and they stated because all she said was she needed to ship these items. The lady behind the counter didn't know what she was doing.  First time she rang up the bill the total came to $4000 for USPS shipping. Wanting to use USPS services for your packages stay away from this place unless you want to pay double what you would if you went to the post office.", "pics": null, "resp": {"time": 1493328931183, "text": "Ms. Chittam,\nFirstly thank you for patronizing our store.  We take great pride in deliverying friendly, high quality goods and services.  As to your comments about USPS flat rate boxes, we do not offer them as they simply aren't big enough for average small shipments.   Per your comment about the cash register misring, we are sorry but we as humans are not infallable.  Fortunately, our system will catch any errors before the transaction is complete.  We apologize for the momentary delay.   Regarding your comment that our USPS prices are double the Post Office,  yes, we do charge a nominal service charge to cover our overhead and the ability to maintain a viable business thereby offering our customers a level of service they might not realize at the Post Office.    In fact many of our USPS prices are actually lower than the Post Office as we realize volume discounts that an individual would be unable to quality for.\n\nThank you again for your comments.\nSincerely,\nDon Cantrell\nPresident,\nThe Shipping Store and more..."}, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "114990420188726533020", "name": "Daryl Piner", "time": 1441294603051, "rating": 5.0, "text": "Excellent service and very friendly people who will go the extra mile to help you.  I reccomend this place to everyone.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "117049772022464651991", "name": "Lee Bates", "time": 1452354104733, "rating": 5.0, "text": "Always friendly service and they do the job right. I drive extra miles for this quality.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "105075834732383199786", "name": "Elise van zandt", "time": 1464366522941, "rating": 5.0, "text": "A+++ service! Very friendly staff and super helpful!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "112593356385282467328", "name": "Rodrigo Banzon", "time": 1464385634824, "rating": 5.0, "text": "Excellent service.  Outstanding staff!", "pics": null, "resp": {"time": 1493327616424, "text": "Thank you. We take great pride in our level and quality of service."}, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "111708991384449542120", "name": "Brenda Caudle", "time": 1448047458517, "rating": 3.0, "text": "Fast and friendly service. The cost was higher than expected.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "108899288135944656892", "name": "Misty Myres", "time": 1470087060480, "rating": 1.0, "text": "Very rude staff. I called ahead to verify all details and was told something different when I got there leaving me to rush to FedEx in Madison to ship my packages.", "pics": null, "resp": {"time": 1493327550562, "text": "Ms. Myres,\nFirstly, thank you for patronizing our business.  We pride ourselves in deliverying friendly,  high quality goods and services.  However, we are unable to access your or any other customers FedEx account number to charge shipping to.  We gladly accept FedEx prepaid packages at no charge, which have the shipping label already affixed.  Otherwise we are glad to create a label for you for which there would be a charge.\n\nRespectfully,\nDon Cantrell\nThe Shipping Store and more..."}, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "112071219118800431716", "name": "Karla Gibson", "time": 1463250306071, "rating": 4.0, "text": "People were Very nice and helpful.  Thank you!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "104660907043666156150", "name": "John Buckelew", "time": 1496504042314, "rating": 5.0, "text": "I use them for my mailbox, shipping, and FAX service. Professional in every way. Very friendly.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "109557001826874830430", "name": "Jim Nichols", "time": 1463653639672, "rating": 5.0, "text": "Its like when Butch said to Sundance, \"Who ARE those guys?\"", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "109658838689981900939", "name": "Rodney Scott", "time": 1464175044310, "rating": 5.0, "text": "Had a legal document that had to be handled asap and the store more than exceeded.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "116022121710779188150", "name": "Teresa Hutto", "time": 1464316250880, "rating": 5.0, "text": "They are great people!!!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "105934926024519793008", "name": "Cathy Solis", "time": 1610407543957, "rating": 5.0, "text": "Need a Notarization? This is the place!\nTWO Alabama State Notary Public Officials are available at this location.\nMobile Notary Service is an added plus. They will travel to nursing homes, hospitals, your place of business, etc.\n\nWHY PAY AN ATTORNEY HUNDRED OF DOLLARS when we can print out our own LAST WILL AND TESTAMENT on our home computers & take them to be notarized???\n\nIn many cases, if you die without a valid will, you will NOT have control over what you leave behind. Instead, A PROBATE COURT GETS CONTROL OF ALL YOUR ASSETS.\n\nHave you received your W-2 or 1099 to file for your tax return?\nACA Tax Service is here at this location 365 DAYS OF THE YEAR!\nWe are better off avoiding the temporary  'store front'  tax return companies who disappear a month after we've filed & have received a letter from the IRS.\nThe dedicated professionals at ACA back you up with the IRS by calling them when you have questions or concerns.\n\nACA cashes Payroll Checks, Insurance Checks, Government Checks, & Income Tax Refund Checks for your convenience.\n\nThe exemplary professionals at ACA Tax Service are conscientious, respectful individuals who make client satisfaction their first priority.", "pics": null, "resp": null, "gmap_id": "0x889292f8998b5865:0xce5ff80f29894446"}
{"user_id": "107740086392255979036", "name": "Amy DeFazio-Davis", "time": 1582991812494, "rating": 5.0, "text": "Fast and friendly service! Third year filing my taxes here and they are always looking out for their customers. Not to mention they are quick to call and give you updates on the status of your return. Love this place and the people in it!", "pics": null, "resp": {"time": 1583185322841, "text": "Thank You for the review .We strive to help all our customers."}, "gmap_id": "0x889292f8998b5865:0xce5ff80f29894446"}
{"user_id": "116538777517364070650", "name": "patrick walker", "time": 1539717097496, "rating": 1.0, "text": "The worst experience I've ever had at any business in my life", "pics": null, "resp": {"time": 1539792518155, "text": "I suspect this is a FAKE review. You will notice there are no specifics .We must keep ID's on all customers. There has been No one with that name who has done business here in the last year. Also this review was put up 4 hours after we had our power restored from Hurricane Michael (no power for 6 days).  We must follow All Federal Banking and IRS Regulations. We strive to provide a service to our customers at a reasonable cost."}, "gmap_id": "0x889292f8998b5865:0xce5ff80f29894446"}
{"user_id": "112639403361079925498", "name": "Elliott Long", "time": 1505528876454, "rating": 5.0, "text": "Great place great customer service", "pics": null, "resp": null, "gmap_id": "0x889292f8998b5865:0xce5ff80f29894446"}
{"user_id": "101281455415464606639", "name": "Sherri Shirah", "time": 1495836091481, "rating": 5.0, "text": "Tax lady is the best and very nice", "pics": null, "resp": null, "gmap_id": "0x889292f8998b5865:0xce5ff80f29894446"}
{"user_id": "115403657829386455183", "name": "Joe Jackson", "time": 1496933097479, "rating": 5.0, "text": "Very Trust Worthy", "pics": null, "resp": null, "gmap_id": "0x889292f8998b5865:0xce5ff80f29894446"}
{"user_id": "115332354451382576832", "name": "Cindy Hafley", "time": 1622265053712, "rating": 1.0, "text": "Michael’s customer service is atrocious. He is who did my transaction and he was so rude I was honestly stunned. He was literally sighing, rolling his eyes, got smart when I said I wanted to “mail” something (“You mean you want to SHIP it?”). You would have thought it was the end of the world when he had to verify my address and it turned out I needed to change it. So unnecessary. I was also shocked when I looked at his name tag and it said he has been there since 1999. From the other reviews I’ve read, I’m not the only person treated like this at this location, so fedex obviously doesn’t care how their employees treat their customers. Trent is great though, for the record.", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "100832981518196411891", "name": "Aries Gates", "time": 1616871714750, "rating": 1.0, "text": "I rate this experience as a one because I have never been discriminated against in a fedex store until today! I was shipping to packages off today, one to my mortgage company and another to At&t. When I got to the counter the representative told me that AT&T system was down but she would check to see if  it was back up and running. It was still down so she directed me to the UPS store about 1.2 miles away and I went to go get in the car to call ATT before going to UPS to see if this was a outage all over it just Fedex Kinkos. The ATT representative told me they didn’t have a issue so I go back in the store to see if their system was back up. A older lady that I helped in the store before leaving stopped me and said the Caucasian guy behind me earlier had a package he was shipping back to At&t as well. The representative told him that the system was down but she would hold it for him and ship it when the system came back up. I asked the representative when I walked back in the store was the system back up, she replied no it’s still down. I asked could she hold my package and ship it when it come back up, she replied they aren’t allowed to do this.\n\nI replied but you just did it for the Caucasian man who was sending a package to At&t to. She looked shocked!  She replied she isn’t suppose to do that but my problem is you did do it & he was behind me. You sent me to UPS but you didn’t send him! Do you know how this makes me feel (small very small) because I’m Black I can go to UPS but because he is white you can hold it for him and ship it later. I have always used fedex and I’m very disappointed in how I was discriminated against today but you guys will be hearing from me soon. My name is Markita Gates and this took place between 12:30pm & 1:00pm, the guy went to the counter right after me at 12:41pm. This is unacceptable!", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "107395011960801608209", "name": "Rob “Deacon Yomouf” Allbanks", "time": 1624032127788, "rating": 5.0, "text": "Today was a good day! Ask for Leslie, she works!", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "103811205424552375553", "name": "K’Shira Hinkle", "time": 1590684126510, "rating": 1.0, "text": "The associate that I spoke with on the phone is in need of some type of customer interaction training. I was asking about speaking with someone that can talk to a driver about a delivery that is scheduled for today and he said there’s no way to get that done. After I suggested that they implemented a new policy for there to be a way to contact the drivers he then tells me that they don’t deal with the drivers because that location is print and ship only. I then asked why he didn’t inform me of that and give me the number or transfer me to someone that could contact the drivers and he began to get rude. I asked for his name several times and he wouldn’t tell me. Then he put me on hold for the customer service line. Get it together FedEx", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "105120504952298710589", "name": "John Higginbotham", "time": 1599757570318, "rating": 1.0, "text": "I would not recommend this facility for your shipping needs. FedEx in Alabama is a joke. Multiple upon multiple damaged packages and the customer service here is absolutely terrible.", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "109680335155732364052", "name": "Deb Jacobs", "time": 1607190890581, "rating": 3.0, "text": "No one is ever available to help. I'm handicapped.", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "100083529610907823168", "name": "Corey Turner", "time": 1567712258386, "rating": 1.0, "text": "Went into the store to get a passport photo, simple right?\nNot to the employees who didn't want to act enthused to help with anything. First and last visit in one day!", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "107781033090910568079", "name": "Ingrid Schnader", "time": 1529617387543, "rating": 5.0, "text": "I had such a good experience here. I needed to design and print 100 lost dog flyers. I laminated 10 of them. I was in and out within 20 minutes and didn’t have to spend too much money. And I found my dog!! The flyers were beautiful and clear. I will definitely return next time I need something printed!", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "100313391003895925196", "name": "Maya Madden", "time": 1542143573587, "rating": 5.0, "text": "I had a really difficult situation getting my package through customs and needed someone to be as fired up as me about it. I called several international agents and none knew what was going on, I was so worried I was going to lose my merchandise. Amber was really the only one who rose up to the plate and got my situation handled. She went above and beyond calling international on my behalf and my package is safe and sound. THANK YOU AMBER!", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "110667730070315269747", "name": "Steve Dellinger", "time": 1546266544160, "rating": 5.0, "text": "Always stellar service.  Good people with great attitudes.\nI drive across town to use this location, because they are fantastic.", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "112541157975925280751", "name": "Eva Teresa Virciglio Holmes", "time": 1552514050674, "rating": 5.0, "text": "I always have a great experience here with the customer service. Very helpful , nice and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "101759292250425006569", "name": "Lessie Rodriguez", "time": 1528824401006, "rating": 4.0, "text": "Great customer service! Michael was very pleasant and informative.  Location accessible. I wish the location was closer.", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "102143470954419627410", "name": "Adrienne Bowens", "time": 1586888985880, "rating": 1.0, "text": "I normally visit this location and the service is awesome but today my experience was awful everyone had an attitude and 1guy even asked if I could have my kids wait outside which are 4 and 6", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "110890072862633771040", "name": "Tyler Volz", "time": 1581435052651, "rating": 1.0, "text": "Go to a UPS store. The self service kiosks are awful", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "117655951319995554376", "name": "Nice Rich", "time": 1517546601409, "rating": 3.0, "text": "Oh My Gosh, what a life saver. I mean, they had a stamp and an envelop and I made 4 overly priced copies, but could not scan them and they couldn't mail my letter for me and the workers didn't seem to want to be there but at least they had a stamp! Is there tax on stamps? I think they charged me tax on stamps?!? I should call the Postmaster. I needed to get the Paternity DNA results to my cousin cuz she was insistent it was my baby but I knew it was her brother's! Maynard struck agian", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "106756146112463531439", "name": "Joel Alakhras", "time": 1519691229814, "rating": 5.0, "text": "Love FedEx specially a shout out to Mrs.Amber Assistance Manager! She makes sure that your treated like a valuable customer!!", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "103273049549565734243", "name": "Andrew Weaver", "time": 1534970505656, "rating": 5.0, "text": "great employees; more helpful service than I expected.", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "103122531009382733828", "name": "jessie pratt", "time": 1492730922217, "rating": 4.0, "text": "They were very professional & respectful nice & that what you go there for🆒💯!!!", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "102894306694708803682", "name": "Bryan Baez", "time": 1558647005969, "rating": 1.0, "text": "I went to my local Ship Center to see if I can ship  a poster to CA. It took the \"Store Manager\" 7 minutes to finally tell me it would be $50 using there \"Super Saver option\"  to ship a poster from AL to CA! The so called \"store manager\" was yawning the whole time I was waiting for him to figure out the shipment details it was (10AM). I went to the post office and shipped for $7.", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "100066113764972420702", "name": "K Melissa Swearingen", "time": 1472150821733, "rating": 5.0, "text": "I called ahead and spoke with Ellis about passport photo information, and he was the person who assisted me in person, albeit all of the employees were very kind and helpful.\n\nI will be back to this location!", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "104215903505269272870", "name": "Clayetta Montee", "time": 1379695707536, "rating": 1.0, "text": "UPDATE:  I went to this location yesterday just to look and see if this most unpleasant employee is there.  As happens with large corporations too often, she was PROMOTED to driver.  I couldn't believe a promotion instead of demotion was her reward for running customers off.  However, since she is no longer in the store, if they accept my perfectly good boxes, I will use this branch again.  if not, I will continue to ship through my employer.\n\nPREVIOUS POST: This used to be my favorite shipper and favorite FED EX location.  I even have my own personal Fed Ex account.  However about a year ago Fed Ex must have brought in a new female day manager or supervisor and she behaves like a shrew.  I was believe her name was Helen.  She misquotes Fed Ex's shipping policy and refuses to use \"banker's\" boxes and other good boxes that are actually more sturdy than she sells at that outlet. She says it is FedEx's policy and I have since found out - it is not FedEx policy, but may be the individual store policy.  But she says it is FedEx policy.  However, she is most loud and belligerent and actually refuses to ship unless in boxes \"like she sells\" and pulls off the shelf \"because Fed Ex will no longer accept those boxes\".  Not true.  She won't accept the boxes.  She claims my boxes are not as sturdy (not true) and it is FED EX's policy not to accept those boxes.  Not true.  I've checked Fed Ex's shipping and packing policies and my boxes are very acceptable...and they are more sturdy than the boxes she is trying to force me to buy.  I will no longer ship there but ship through my work and have the charges deducted form my payroll.  Fed Ex is happy to pick up my boxes at my work without trying to make me buy boxes from Fed Ex.  My work place ships many boxes like my boxes (that's where I get my boxes) without any problem.  Someone needs to retrain or terminate the weekday supervisor or manager at this office.  I have read of many complaints about the personnel at FedEx-Kinko locations since Kinko and Fed Ex combined their locations.  I will not go back to this location with Helen there.  When I can't use my work place for shipping (as when the boxes too heavy for me to take in), I have driven 35 miles round trip to drop off my boxes elsewhere instead of dealing with this unpleasant person...what a shrew.", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "110746665130152796851", "name": "Karla Pesquera", "time": 1465851993753, "rating": 5.0, "text": "I happy they have a good people working there, good customer service", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "100741736948511531127", "name": "Sherie Mcneal", "time": 1584987863304, "rating": 5.0, "text": "5 good service", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "111658457773912270428", "name": "Mario Sanchez", "time": 1518727583110, "rating": 4.0, "text": "Very convenient hours, only downtown location.", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "100007689729589228843", "name": "Katrina Nakhjavan", "time": 1542399077748, "rating": 5.0, "text": "Helpful and very nice employees.", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "116822405849358423185", "name": "Willie Parrish", "time": 1528422507974, "rating": 3.0, "text": "It's just a place to ship a package. Very cool clean.", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "103521028016288169866", "name": "iamweida", "time": 1498519109756, "rating": 1.0, "text": "They are one of a few exceptions to show that FedEx can be slower than USPS. Always choose the local UPS if possible.", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "108263738793499204759", "name": "Louvenia Bell", "time": 1522282251100, "rating": 3.0, "text": "Great experience a lot of help from representative", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "110427479070595485996", "name": "Mike Hump", "time": 1518811823371, "rating": 4.0, "text": "All ways great service.", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "101334045069645017980", "name": "Sh Mills", "time": 1479574561225, "rating": 1.0, "text": "There is only one person working. ..many waiting.  Not fair to the employee or the customers waiting. Get him some help FedEx!", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "108233965681519179303", "name": "Tyler Giddens", "time": 1543696998083, "rating": 1.0, "text": "I was supposed to receive a package on the 24th of November and they changed the arrival date 4 times, as I track my package I’ve noticed that it’s been on a truck for delivery the past 5 days and no one can tell me where my package is or why it’s taking so long to come in. TERRIBLE experience.", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "115483796502520953634", "name": "APOSTLE DARLEEN PEOPLES", "time": 1515018799416, "rating": 5.0, "text": "IT WAS GREAT", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "112974533664494014088", "name": "Lessie Rodriguez", "time": 1476393645423, "rating": 5.0, "text": "Salesperson was awesome!", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "108111944831915503044", "name": "Brian McCarty", "time": 1541120208733, "rating": 1.0, "text": "Rude employees", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "110469113548619380377", "name": "Doug Fraley", "time": 1410197212282, "rating": 1.0, "text": "The service ever", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "114087847133610585686", "name": "Apostle Darleen Peoples", "time": 1522164137773, "rating": 5.0, "text": "GREAT!!!", "pics": null, "resp": null, "gmap_id": "0x88891b9130ca25b5:0x5bd40fa6ae8c11d"}
{"user_id": "100051972904444103445", "name": "Lee Prim", "time": 1618962301564, "rating": 5.0, "text": "These people are Super-Heroes !! I walked into the store with MUCH anxiety related to a return shipping policy that I had never dealt with. The staff at this Fed-Ex Store made my fears VANISH ! They admitted that they had not dealt with the specific on-line vendor I was dealing with but QUICKLY found the needed information, printed my shipping label and had my box on the rack waiting for the truck. SOOooo Glad to have that taken care of !!", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "100609825799829134686", "name": "cross nic", "time": 1603232171539, "rating": 5.0, "text": "Amazing Associates. Great customer assistance. Polite. Helpful. Attentive. Made my stop quick and efficient. I have never had such good service or provision from any other service or store. I know who I will choose from now on. This was an amazing experience.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "110160016252114677287", "name": "Mohamed m", "time": 1616111147920, "rating": 5.0, "text": "Staff extremely helpful. I forwarded the email with the label, printed at no charge, across the street competitors charge 4 dollars to \"open email\". Helped secured my package and I wad out in 2 minutes. Not my first time there. Excellent.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "103262858840921198422", "name": "Evan Bazzini", "time": 1619834517017, "rating": 5.0, "text": "five stars, had to ship a big iMac in a pinch and the masked manager came in clutch with many options on the best way to ship this giant box", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "115257498468051099869", "name": "Terry Tuell", "time": 1603735887997, "rating": 1.0, "text": "I wanted to ship my packages for my company today. I had three labels to use by today October 26, 2020. When I got to the FedEx print and ship Center the employee he had no name tag told me my labels had expired. I told him that the correspondence from FedEx said that I could ship by today. He got an attitude with me in front of everybody that was in there and said there’s nothing I can do about it you wanna come back here and look at the screen.We will not be using FedEx in the future for our business shipping needs. Goodbye.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "117041858315861406947", "name": "Hyman Flemings", "time": 1602352166891, "rating": 5.0, "text": "I called the store to ask for one of your team members to print out some documents. I had needed them asap because I had a customer waiting at my dealership. The woman on the phone(not TIA) was rude and short with me, then she hung up. To make a long story short I called back and got a lady by the name of Tia. I explained the previous called and assured me she'd have my documents when I arrived. Just as promised she had them as soon as I walked in. Now the kind of customer service that Tia displayed made me a future customer.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "108859247608948969526", "name": "JO", "time": 1610064030783, "rating": 5.0, "text": "Good service. Easy to print and go.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "106147079954220975494", "name": "Teresa", "time": 1613055449477, "rating": 2.0, "text": "This use to be my favorite FedEx  office to use. Now that they have mostly new staff it has not been the same friendly atmosphere. Not only that but opening time is different then web site says.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "113684116157221660957", "name": "Ilka Porter", "time": 1558103235926, "rating": 5.0, "text": "Tia, Ben, and Chris are super helpful and patient with project printing needs. I was at a loss when I went in and ended up with 5 beautiful posters. I could not have done it without them. Their manager, Jake, is very supportive of his team.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "111875038599002845571", "name": "Melinda Ann", "time": 1538411805598, "rating": 1.0, "text": "I came in this place for the first time to print a copy of a pdf from my phone, I had never done this before and needed a little help to go about it so I turned to this woman working there (Leticia) and she only told me what I had already read on the screen not how it works. I’m not completely computer savvy so I asked her how I go about things after and she repeated the same thing to me in a very rude manner. She acted the same way in a smart attitude but still “smiling” to others coming in the business which to me is unacceptable behavior for an employee. If I ever need to do this again I’ll definitely pick a different destination to do it.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "106675417014684503075", "name": "Jason Bartlett", "time": 1493063893899, "rating": 5.0, "text": "Man these guys are awesome. I own a trucking company and I use these guys for all my office needs as I hate office work. Super nice super helpful to the point where I feel like I take advantage of them", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "108135649627232996298", "name": "Sarah Priem", "time": 1484055527286, "rating": 5.0, "text": "Great place for passport photos. After having passport photos taken at Walgreens that made me look like a drug addict, I tried my luck here. They have a nice camera, friendly staff, and gave me a professional looking passport photo. Lighting makes a big difference!", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "108747255350084041212", "name": "The Woke Unicorn", "time": 1524073908178, "rating": 5.0, "text": "I shop here often. I processed a print order from the FedEx Office app on my iPhone. The order was ready in under 20 minutes (is was a small order, but still at a peak time of 12:30).\n\nStaff is helpful and there are plenty of self serve printers, copiers, and workstation computers for customers to use for quick service.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "101101489434534299884", "name": "Marshelia Lovelace-Evans", "time": 1505920405453, "rating": 1.0, "text": "I'm sitting in my manufactured home and no one knocks or blows, I would have heard it. My insurance man comes about fifteen minutes afterwards and knocks. I heard him!! Why is that? It's because he didn't knock. He left a tag on my screen door. Not on the inside door. The screen door was unlocked because I was expecting this wheel for my Harley Davidson!!! Get out and knock!! I work for the postal system, if you blow and you don't see an animal, you get out and make sure you knock!! He never attempted to deliver, he just put the door tag on the outside of the screen door and left!! That's not good business!! Then he goes back to Mobile!! I never try to give bad reviews because I work for the postal system but DO YOUR JOB!!!!! Especially, if I'm sitting and waiting. Just because you pull up in the yard and no one knows you're out there does NOT constitute you doing your job!! KNOCK AND SOMEONE WILL HEAR YOU!! Thank you!!", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "113935054441013653355", "name": "Paul Miller", "time": 1576189293350, "rating": 1.0, "text": "If you really need assistance with your project other than to be told \"go over to that machine\".  Then you should go to Office Depot or Staples.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "118153241035019292452", "name": "Heather Chastain", "time": 1487479645485, "rating": 1.0, "text": "I do not recommend using this store for any services. Very unprofessional staff and prices are way too high. I went there just wanting to ship a package and the lady working in the front with dark hair was rude to me from the second I walked in. She looked at my package and rolled her eyes. I asked her a simple question about shipping and she made a huge scene and yelled at me, embarrassing me in front of the entire store. VERY unprofessional and rude. I ended up just leaving and going across the street to the UPS store, where they were very quick and professional.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "100475351202486466835", "name": "Draven Brown", "time": 1540310444359, "rating": 1.0, "text": "Jake is rude and hangs up on you simply for asking if your package is that their location.\nMe, \"Hey, I was calling to inquire if my package is at your location.\"\nJake, \"I don't know.\"\nPause.\nJake, \"What's your name?\"\nMe, \"D**** B*\"\nPlaces me on hold for 2-3 minutes clicks on then hangs up.\nI call back immediately for it to ring 6-8times before another associate answers only to find out that it's not at this location and that they don't know where it is.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "100636256061429088942", "name": "Harley Dree", "time": 1474496305524, "rating": 4.0, "text": "Great customer service especially when needing extra help. Friendly and well staffed.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "111097728778729899900", "name": "Korin", "time": 1516672617420, "rating": 5.0, "text": "Super nice people.  Very helpful and FedEx of course ROCKS!!", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "117466975979101142499", "name": "Ashley Kyser", "time": 1433902498781, "rating": 1.0, "text": "This place charged my husband FORTY DOLLARS to print FOURTEEN sheets of paper. We couldn't think of anywhere else to go, which I guess is why they're charging these prices. It's just not right. If you have to print something and are traveling, you just have to pay it. For $40, he didn't even get normal paper....it was coated in wax and difficult to write on. I was shocked and disgusted at the price.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "115456278350109820792", "name": "Rodney Moody", "time": 1487543496622, "rating": 5.0, "text": "Always better service than I expect. Great job!", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "104931241116699502465", "name": "Tennille Paige", "time": 1553165751250, "rating": 5.0, "text": "Can't wait 2 visit there", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "107244655574647047186", "name": "Wes Allday", "time": 1488428811356, "rating": 4.0, "text": "Print & Go services are great. Swipe your card at the terminal, print the documents, be on your way.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "100044666795086366319", "name": "Andy Grall Music", "time": 1503441046296, "rating": 5.0, "text": "Came here to blow up pictures for my dad's memorial service. They took great care of me.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "113026957120058123143", "name": "Mary Taylor", "time": 1527784886047, "rating": 5.0, "text": "Great timely service and shipping options offered.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "110890729795807530632", "name": "Anthony Welborn", "time": 1568133838176, "rating": 4.0, "text": "They are always helpful and polite", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "100253184267257626682", "name": "Patric Howley", "time": 1503062495914, "rating": 1.0, "text": "FedEx needs to expand its prepaid drop-off services and locations. Suggest local banks and/or credit unions, or major food stores.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "104942844188293985048", "name": "J Johnson Law", "time": 1513495901020, "rating": 4.0, "text": "#SJJohnsonLaw: Gr8 shopping  experience !!", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "114263784133596820756", "name": "Jonathan Cooper", "time": 1520437242370, "rating": 5.0, "text": "The staff at this location is always efficient.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "110999132672088416977", "name": "razzzzrsharp", "time": 1439828961386, "rating": 1.0, "text": "I think Fed Ex charges way too much money for the package to sit in one place over the weekend and the package went to Georgia from Mobile on its way to California, waisting one whole day of travel out of the way.  It sat in West Arizona from Friday to Monday  and the package will not be there until Tuesday.   How can it take 4 days to travel 4 hours? I will use UPS next time.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "116594846686600120939", "name": "jeremy pickens", "time": 1548880097418, "rating": 5.0, "text": "Always super helpful.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "118113205384305556191", "name": "Gwen", "time": 1553015986982, "rating": 5.0, "text": "I went in to make some prints from my phone. The machine would not read my card so the attendant, who was very polite, helped me by giving me a courtesy card. I have yet to have a bad experience at that location.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "112043713776996651099", "name": "ES 2:12", "time": 1525641408396, "rating": 2.0, "text": "Only one person in the store at 4 pm. Had to wait approximately 30 minutes just to send a package.", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "118257727315648111755", "name": "William Davis", "time": 1531511323485, "rating": 5.0, "text": "Great staff & services!", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "109035065378583363272", "name": "Meshal", "time": 1500141034169, "rating": 1.0, "text": "Bad service", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "108586948675111258650", "name": "Cynthia M. Trainor", "time": 1517882779927, "rating": 5.0, "text": "Wonderful", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "114720064576506069800", "name": "Casey Welborn", "time": 1541983095459, "rating": 1.0, "text": "Horrible staff", "pics": null, "resp": null, "gmap_id": "0x889a4d74b1849689:0xa7341cef7676478d"}
{"user_id": "108833765567491866807", "name": "Madison Northrup", "time": 1608572186658, "rating": 5.0, "text": "Awesome and very friendly service! We use the shipping service there during their busiest time and they were very friendly and quick! Highly recommend using this business as shipping rather then the post office or any other choice.", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "110905265389094615493", "name": "Jason Dowling", "time": 1609087557099, "rating": 5.0, "text": "Great atmosphere, shipping in the back. Sandwiches in the front, who could ask for much more? ✌️", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "110890322584798452866", "name": "Kayla Priestley", "time": 1572547439642, "rating": 5.0, "text": "I sometimes go here to return Amazon purchases. They are always so helpful and friendly. For the first time I sat down and had lunch there. It was such a nice, comfortable dining experience even though I had a bunch of kids with me! They were very kind and accommodating. The chef salad was fresh, healthy and delicious. I can't wait to eat here again!", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "104979302760615509496", "name": "Henry Robertson", "time": 1595350964041, "rating": 5.0, "text": "It's in the back of an old store with wooden flooring, attached to a coffee shop.  They took care of me quickly, great atmosphere to pick up a sandwich too.", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "104804338498608459098", "name": "Champ Ion", "time": 1587057107325, "rating": 5.0, "text": "EXCELLENT Customer service. UPS drop off point.", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "113184118948763119677", "name": "Linda Ford", "time": 1558700613021, "rating": 5.0, "text": "These people are SUPER SMART at what they do and it is busy ALL THE TIME. Amazon makes doing a return dang near impossible, but these guys figured it out. GREAT PLACE!! VERY FRIENDLY! !!", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "110747516128449624789", "name": "jonathan crump", "time": 1549713735759, "rating": 5.0, "text": "These folks are always so helpful!  Thanks so much!", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "109758237651578878744", "name": "Jesse Martin", "time": 1547694322055, "rating": 1.0, "text": "FedEx has been constantly dropping my packages at the wrong address and now they have lost my phone I recently ordered. Now I have to go through this long process of contacting where I ordered it from and filing a police report just to try and get another one or my money back. If you have a choice don't use FedEx or at least not this FedEx.", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "109456461079273182919", "name": "Cecil Brown", "time": 1556496485547, "rating": 5.0, "text": "Wonderful customer service !", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "107459485962155245281", "name": "Dale Miller", "time": 1552934323895, "rating": 5.0, "text": "Good for package shipping", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "110527303023940401982", "name": "daniel reuben", "time": 1535943804059, "rating": 5.0, "text": "Very friendly I would go there again 😊", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "107883664956684109063", "name": "Lee Austin", "time": 1531776114876, "rating": 5.0, "text": "Very helpful.", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "110882473599909656140", "name": "Patrick Sims", "time": 1539258447383, "rating": 5.0, "text": "Debbie is the best!", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "111706196492720769056", "name": "Billy Thomason", "time": 1559353627316, "rating": 4.0, "text": "Small area of actual antiques", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "104245805782164956869", "name": "Jeremy Gossett", "time": 1473343865945, "rating": 5.0, "text": "FedEx and UPS Authorized Shipping Center.", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "113029158193568392553", "name": "Gottfried Kibelka", "time": 1624482360537, "rating": 4.0, "text": "Friendly, professional, and efficient. I wish they had an online gadget that could tell me if the last truck had already picked-up. Getting there shortly after 5 pm might make you miss the truck meaning that your overnight is delayed by a day. When I missed the pickup the service representative let me know the next pickup place to try and catch the truck. I did appreciate the information.", "pics": null, "resp": null, "gmap_id": "0x8889237079e0c6a1:0xb703f40c3e4ecf44"}
{"user_id": "111943477506155138390", "name": "Katie Caldwell", "time": 1613091316842, "rating": 5.0, "text": "Randy and John are always so kind, friendly and courteous. They are such a help and we love bringing our shipments to them! Many thanks to them for being an all star team!", "pics": null, "resp": null, "gmap_id": "0x8889237079e0c6a1:0xb703f40c3e4ecf44"}
{"user_id": "113227394279021600134", "name": "Nancy Hunter", "time": 1604952578244, "rating": 1.0, "text": "Closed for whatever reason but not stated on website under hours. Nor is there just a drop box during CLOSED times.", "pics": null, "resp": null, "gmap_id": "0x8889237079e0c6a1:0xb703f40c3e4ecf44"}
{"user_id": "100597170428358512169", "name": "Jack Herman", "time": 1569350254544, "rating": 5.0, "text": "Jasmian was a HUGE help and finished packing and sending my boxes for me because I was in a rush.  Great customer service, thanks guys!!", "pics": null, "resp": null, "gmap_id": "0x8889237079e0c6a1:0xb703f40c3e4ecf44"}
{"user_id": "110753437593030817702", "name": "GRANDMLLLC COMPANY", "time": 1564178101717, "rating": 2.0, "text": "FRINDLY STAFF BUT SLOW SERVICE", "pics": null, "resp": null, "gmap_id": "0x8889237079e0c6a1:0xb703f40c3e4ecf44"}
{"user_id": "106260604455712344460", "name": "Tiffany Taylor", "time": 1623368357576, "rating": 5.0, "text": "I didn’t get the assistant managers name on 6/10/21 but he was very helpful!", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "113905260622982084933", "name": "Jennifer Brasher", "time": 1557006301316, "rating": 5.0, "text": "I needed some help scanning some documents to email.  The woman working this afternoon was extremely helpful.  I was able to get it done quickly.  I never expected it to be so quick and easy!  Thank you!", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "107036992464066351295", "name": "Lillian Maatouk", "time": 1572458196603, "rating": 5.0, "text": "Amy is a hard worker. Always smiling and great with customers. All the customers appreciate her", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "116798555864626097095", "name": "George Faragalla", "time": 1572458069609, "rating": 5.0, "text": "Amy B. Works hard and smiling. Good customer service!", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "108828105805287139529", "name": "Renee Lewis", "time": 1593997613700, "rating": 5.0, "text": "Excellent customer service!", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "115991016969395218864", "name": "Terrell Griffin", "time": 1523981549019, "rating": 5.0, "text": "The people working there the two times i went there were great and helped me get in and out in as fast as possible. They were great people and I wouldn't mind going there for any future projects.", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "111407101137256790967", "name": "Rebecca Fisher", "time": 1522182933311, "rating": 5.0, "text": "Very efficient.  Very helpful.  Took care of my needs with a smile.", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "105597950191578691798", "name": "Tracy Kiker", "time": 1526593536443, "rating": 5.0, "text": "These are some of the nicest and most helpful ppl that work there.", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "103924359274132856099", "name": "C K", "time": 1498789237728, "rating": 4.0, "text": "They're always quick amd helpful.  A go to drop off.", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "105117699004679695952", "name": "William Dougan", "time": 1420380530863, "rating": 5.0, "text": "neighborly, clean, very helpfull. I am not an employee of fedex :)", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "101133122114801270519", "name": "Kim P", "time": 1554938640475, "rating": 1.0, "text": "Stood in line for 20min with 2 employees and only 3 customers in front of me.  I just wanted to drop off a package.", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "115482212534389928686", "name": "william smith", "time": 1548967884080, "rating": 1.0, "text": "they cant scan my documents but will RENT me a computer so I can do it", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "112798823479275698063", "name": "Erin Talbot", "time": 1502047013319, "rating": 2.0, "text": "Slow service. Pricy. At least they are open 7 days a week.", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "117564815619377121711", "name": "Brianne Harrelson", "time": 1513717176986, "rating": 5.0, "text": "They were very helpful and was very fast.", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "106106389129573825526", "name": "Pam p", "time": 1527705083941, "rating": 5.0, "text": "Ms. Rhonda was very nice and helpful", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "114674563234455690121", "name": "Pgp Newyork", "time": 1513961955980, "rating": 1.0, "text": "we ship anything... UNLESS we can’t be bothered to wrap it!  Tried to ship a large return here, thu didn’t have a box and would not allow me to buy the supplies to make one...pitiful service!", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "103355626395139767207", "name": "Johnney07", "time": 1503147315906, "rating": 1.0, "text": "I was suppose to gotten a package yesterday. It left oxford, al yesterday morning and now it says it is in Georgia. Now it says it won't deliver until Tuesday. Slow service.", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "111381875140223825276", "name": "Nathaniel “Ryan” Bowman", "time": 1450874670292, "rating": 3.0, "text": "Don't expect fast service.", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "111381875140223825276", "name": "Nathaniel “Ryan” Bowman", "time": 1450874670292, "rating": 3.0, "text": "Don't expect fast service.", "pics": null, "resp": null, "gmap_id": "0x889bb26c9a0ba013:0xd1d8589a813483c2"}
{"user_id": "106486856211233484761", "name": "Paris Fuller", "time": 1623147622524, "rating": 5.0, "text": "Melissa was great and very professional! She definitely made my experience memorable.", "pics": null, "resp": null, "gmap_id": "0x8862693f3b2793b7:0x4a1e651d05a8e47a"}
{"user_id": "106741224700509567603", "name": "Ken Kobayashi", "time": 1613321128085, "rating": 2.0, "text": "This location is obviously understaffed, to the point where it can't be relied upon to be open during its stated business hours. I've never had this problem with the other FedEx Office location nearby (4711 University Dr).", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMQ8zs9kMN3o5SIG58260z2MpFDAIlD2Z6XcVub=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862693f3b2793b7:0x4a1e651d05a8e47a"}
{"user_id": "104899323244714347754", "name": "Mila Zsidisin", "time": 1599229337315, "rating": 5.0, "text": "This is a very nice place to ship! Alice and all the staff is great! ALWAYS helpful, attentive, polite.  all who works there are highly qualified specialists. I would highly recommend this office!", "pics": null, "resp": null, "gmap_id": "0x8862693f3b2793b7:0x4a1e651d05a8e47a"}
{"user_id": "114852073461072587283", "name": "Anthony Leach", "time": 1538714425444, "rating": 5.0, "text": "Kareem, the manager, got me in and out with no complaints. Thank you for your professionalism.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPvYMI98FuVISe7ofdy23q8FvxRjaxqz4tqe2-S=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPnOUpFapyAazc_xnuDLZF10KNNr4qAXJB5sLTZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMk4pX26yjxWhNtCpi7E5I4GWCQNhBTKgvLR91g=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPhlYdoWjttK1L0APrAfXLGHN0UrgJwMxDnY3w4=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862693f3b2793b7:0x4a1e651d05a8e47a"}
{"user_id": "107941018428168683461", "name": "LISA GARCIA", "time": 1568040408534, "rating": 5.0, "text": "Melissa was so helpful and wonderful helping me print important documents.\nWill definitely come back because of her.", "pics": null, "resp": null, "gmap_id": "0x8862693f3b2793b7:0x4a1e651d05a8e47a"}
{"user_id": "100921206436139906543", "name": "Word-Xpress LLC", "time": 1562715269820, "rating": 5.0, "text": "Friendly, helpful, and knowledgeable staff! Thank God for them.  All other print service stores  in town drive me nuts!", "pics": null, "resp": null, "gmap_id": "0x8862693f3b2793b7:0x4a1e651d05a8e47a"}
{"user_id": "116276336911371164111", "name": "Torey Lavish", "time": 1562333980725, "rating": 5.0, "text": "Melissa did a wonderful job getting me in and out quickly and helping me with a return! This will be my go-to mailing center now.", "pics": null, "resp": null, "gmap_id": "0x8862693f3b2793b7:0x4a1e651d05a8e47a"}
{"user_id": "104789797592720602495", "name": "Brittany", "time": 1555354370630, "rating": 5.0, "text": "Came here to ship a package. Great customer service, was in and out in under 3 minutes.", "pics": null, "resp": null, "gmap_id": "0x8862693f3b2793b7:0x4a1e651d05a8e47a"}
{"user_id": "103778460469912688270", "name": "Jessica Polk", "time": 1492274360428, "rating": 5.0, "text": "I use this place frequently, and i really enjoy the staff they are very professional.", "pics": null, "resp": null, "gmap_id": "0x8862693f3b2793b7:0x4a1e651d05a8e47a"}
{"user_id": "108532054861338026680", "name": "Michelle Bergh", "time": 1513692041844, "rating": 1.0, "text": "Terrible customer service.   Store manager was very rude & condescending to myself & other customers in the store at the time. I was just printing out some papers, was never even acknowledged or offered help. When I did ask for help was treated rudely almost as if I was an annoyance. Will never set foot in this store again.", "pics": null, "resp": null, "gmap_id": "0x8862693f3b2793b7:0x4a1e651d05a8e47a"}
{"user_id": "113363326513093680070", "name": "James Burton", "time": 1421683688055, "rating": 5.0, "text": "I've never had to wait here. Great place.", "pics": null, "resp": null, "gmap_id": "0x8862693f3b2793b7:0x4a1e651d05a8e47a"}
{"user_id": "102626080836533746878", "name": "Blake Hargrove", "time": 1506113216028, "rating": 5.0, "text": "Friendly staff that took care of me right away.", "pics": null, "resp": null, "gmap_id": "0x8862693f3b2793b7:0x4a1e651d05a8e47a"}
