{"user_id": "107927767334656709039", "name": "Christian Ayotte", "time": 1601569533095, "rating": 4.0, "text": "Awesome place  ...", "pics": null, "resp": null, "gmap_id": "0x88626e01f38ab7f1:0x33f3338bdfb44279"}
{"user_id": "112948618587334555259", "name": "No No", "time": 1614689542801, "rating": 1.0, "text": "The IRS received over 100 million calls last year but only 1 in 4 callers were able to get through. I think that was an overestimate because I've been calling multiple times a day for a week now and have gotten no one to answer and received no help. The automated line is useless. Defund the IRS!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d0925af989d:0x540816c255900f5c"}
{"user_id": "117724168043315913943", "name": "dana faucette", "time": 1605208608161, "rating": 1.0, "text": "I have been trying to talk to someone about paying taxes on the insurance claim from my moms death. I'm not in the mood. Give me a person to talk to. I would give minus 5 stars.", "pics": null, "resp": null, "gmap_id": "0x889a4d0925af989d:0x540816c255900f5c"}
{"user_id": "101478209402837257124", "name": "janice miller", "time": 1618506241215, "rating": 1.0, "text": "Can not get forms or any type of information from this office . It is close all of April when people need forms and help", "pics": null, "resp": null, "gmap_id": "0x889a4d0925af989d:0x540816c255900f5c"}
{"user_id": "115795343802902892773", "name": "Maria Pharr", "time": 1620752603673, "rating": 1.0, "text": "Refund delayed can't speak to a living soul", "pics": null, "resp": null, "gmap_id": "0x889a4d0925af989d:0x540816c255900f5c"}
{"user_id": "116905503855529803653", "name": "Glynn Dykes", "time": 1583435851302, "rating": 1.0, "text": "IRS agent got very angry and started pointing his finger in my face. I was simply asking for help getting results. His ability to control his anger was not present.  You can't get anything done at this office. They just push you off to a phone number. A very non-productive group of people just looking to give taxpayers a hard time. They just have your removed from the office if they don't want to help you. To bad that person dont like his job or help his customers. Just a government paycheck to him.", "pics": null, "resp": null, "gmap_id": "0x889a4d0925af989d:0x540816c255900f5c"}
{"user_id": "116736713556836163148", "name": "rene lopez", "time": 1583938586539, "rating": 5.0, "text": "Awesome do your appointment that’s all", "pics": null, "resp": null, "gmap_id": "0x889a4d0925af989d:0x540816c255900f5c"}
{"user_id": "104699544827960283655", "name": "me to you (M)", "time": 1539635228258, "rating": 1.0, "text": "Do not waste your time and gas driving to IRS Office, 1110 Montlimar Drive, Mobile, AL.!!!!\n\nWhat a waste of time!! A security guard greets you as you enter and asks if you have an appointment. He says you have to have an appointment regardless if you drove 500 miles for nothing!! Another USELESS GOVERNMENT OFFICE THAT SCREWS THE CITIZEN.\n\nI only wanted to ask a simple question!!!\n\nWhat a waste of government funds!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d0925af989d:0x540816c255900f5c"}
{"user_id": "117259590368720056894", "name": "LA LA", "time": 1580499915675, "rating": 1.0, "text": "You must make an appt and they only have 1-2 agents in office. Great inconvenience", "pics": null, "resp": null, "gmap_id": "0x889a4d0925af989d:0x540816c255900f5c"}
{"user_id": "104543828145120768282", "name": "Nikki Hays", "time": 1423493726944, "rating": 5.0, "text": "Love this site", "pics": null, "resp": null, "gmap_id": "0x889a4d0925af989d:0x540816c255900f5c"}
{"user_id": "110779681620634502475", "name": "Alex Leak", "time": 1627341787568, "rating": 1.0, "text": "It’s a government agency, people. Did you really expect anything better than 1 star?", "pics": null, "resp": null, "gmap_id": "0x88626ca5fe56b5df:0x342080f9014f29c9"}
{"user_id": "105633955995525852745", "name": "Kendra Latrice", "time": 1612222719678, "rating": 5.0, "text": "The black woman that worked there from Athens helped me so much and relieved all of my anxiety. She was heaven sent.", "pics": null, "resp": null, "gmap_id": "0x88626ca5fe56b5df:0x342080f9014f29c9"}
{"user_id": "117196526659207960609", "name": "Whitney Coffee", "time": 1620066482068, "rating": 1.0, "text": "No one at the office, note on the door gives a number to office attendants who aren’t available for appointments.", "pics": null, "resp": null, "gmap_id": "0x88626ca5fe56b5df:0x342080f9014f29c9"}
{"user_id": "104893823969627884277", "name": "S.D. Luck aka Lady Luck", "time": 1619208130761, "rating": 1.0, "text": "No one to see you, and the number on the door that is given to you to make an appointment you can not reach.", "pics": null, "resp": null, "gmap_id": "0x88626ca5fe56b5df:0x342080f9014f29c9"}
{"user_id": "105879088261796356801", "name": "Lisa C", "time": 1623278234955, "rating": 1.0, "text": "Lack of support", "pics": null, "resp": null, "gmap_id": "0x88626ca5fe56b5df:0x342080f9014f29c9"}
{"user_id": "104326732738112773543", "name": "Justin Pylant", "time": 1597329613627, "rating": 5.0, "text": "Got to love our government!", "pics": null, "resp": null, "gmap_id": "0x88626ca5fe56b5df:0x342080f9014f29c9"}
{"user_id": "108929294716008798252", "name": "D m (dude)", "time": 1406559047016, "rating": 5.0, "text": "had to go here to get a paper for financial aid because it was not working online.  The place was empty and the lady helped me out super fast.  very quick and easy.  Thought it would be worse than the dmv, but i guess only during tax season.", "pics": null, "resp": null, "gmap_id": "0x88626ca5fe56b5df:0x342080f9014f29c9"}
{"user_id": "102156577378459365110", "name": "Mercedes Rugart", "time": 1447884293216, "rating": 1.0, "text": "I showed up at 3:54pm to speak with someone about a transcript for school and about my tax return since I believe someone may have used my social security number . I didn't even make it to the door before I was stopped and asked by security if I was making a payment . I stated no and he advised that they were not allowing anyone else inside because they had several people on there and they close at 4:30. So what your telling me is since I'm not giving you more money you don't have time to help me so that k can attend college! I asked to speak with someone and was told no one was available I asked if I could wait in the parking lot for when someone came out to go in, I was told no. Let me also state there was only 4 cars in the parking lot. Then I ask for a number ten officer couldn't advise of one . I get to my car and google it and then call. I received a recording telling me they do not answer the phone and provide live assistance I would need to come in between the hours of 8:30 am to 4:30 pm .... What a joke , thank you IRS for providing no service or answers to my questions and putting another hoop to jump through to get into college.", "pics": null, "resp": null, "gmap_id": "0x88626ca5fe56b5df:0x342080f9014f29c9"}
{"user_id": "117321403667629027819", "name": "Tricia Box", "time": 1531838005922, "rating": 1.0, "text": "Well I drove all the way here just see a sign on the door that says this office is no longer open and to go to the Florence location. Which is another hour away.", "pics": null, "resp": null, "gmap_id": "0x88626ca5fe56b5df:0x342080f9014f29c9"}
{"user_id": "106153849681318888962", "name": "Benjamin Singleton II", "time": 1531929291428, "rating": 3.0, "text": "The staff at our local office are helpful and pleasant.\n\nThe only problem is there's no longer a walk in taxpayer assistance group.", "pics": null, "resp": null, "gmap_id": "0x88626ca5fe56b5df:0x342080f9014f29c9"}
{"user_id": "113224627924649243455", "name": "Tam's Natural Solutions", "time": 1449155223595, "rating": 1.0, "text": "Waiting time is crazy most of the time it's only one person working..  They should have one line for copy's and one line for major issues.   There system just doesn't flow.  The people that work there are great but they look over worked!!!", "pics": null, "resp": null, "gmap_id": "0x88626ca5fe56b5df:0x342080f9014f29c9"}
{"user_id": "101763796140513261374", "name": "Mery Daniel", "time": 1492791142098, "rating": 1.0, "text": "This is a nitemare. I have been trying to get a transcript for my child to go to college and this has been the absolute worst experience I have had!!!! The phone system is a joke and trying to contact someone to help you is a joke.", "pics": null, "resp": null, "gmap_id": "0x88626ca5fe56b5df:0x342080f9014f29c9"}
{"user_id": "105473247188283843008", "name": "mosdef nelly", "time": 1523296982297, "rating": 1.0, "text": "I called and stayed on the phone for a good 15 to 20 minutes when someone picked up my baby started fussing a little so the lady told me that she couldn't hear me he stopped fussing and I asked her if she could hear me and she has a total attitude because she didn't want to go through with the call stating that it this time isn't good call back while the baby was already done crying her name is miss Washington she was talking to me as if I was someone out on the street very unprofessional so I asked her if she could transfer the call because she's very unethical right now and I'm really just trying to get through the day because I'm a single mother taking care of my child she said no she can't transfer so she just hung up in my face I didn't call to waste time I have a very busy schedule taking care of a little three month old and going to work they have no type of respect for taxpayers.", "pics": null, "resp": null, "gmap_id": "0x88626ca5fe56b5df:0x342080f9014f29c9"}
{"user_id": "112735965183191554627", "name": "Eli", "time": 1511971009195, "rating": 1.0, "text": "This Place is no longer open for service.  I wasted gas just to find out nearest office is in Florence, AL. Other IRS offices are Birmingham,AL  Chattanooga, TN and Nashville TN.", "pics": null, "resp": null, "gmap_id": "0x88626ca5fe56b5df:0x342080f9014f29c9"}
{"user_id": "106174360659861345645", "name": "melvin brazier", "time": 1520950048419, "rating": 1.0, "text": "You have to make a appointment over the phone can't just walk in.", "pics": null, "resp": null, "gmap_id": "0x88626ca5fe56b5df:0x342080f9014f29c9"}
{"user_id": "110232445801677617729", "name": "Noelle McCormick", "time": 1440439560065, "rating": 1.0, "text": "I don't say here since 10:30 and it is after one. They move to slow, all this for a transcript", "pics": null, "resp": null, "gmap_id": "0x88626ca5fe56b5df:0x342080f9014f29c9"}
{"user_id": "114167693098822566734", "name": "DeVontay Robinson", "time": 1519777466112, "rating": 1.0, "text": "They took 2000 dollars for now reason", "pics": null, "resp": null, "gmap_id": "0x88626ca5fe56b5df:0x342080f9014f29c9"}
{"user_id": "105763402119928566475", "name": "NewYorkGaming", "time": 1607363820740, "rating": 4.0, "text": "This review is for the FBI headquarters, not this specific FBI office. If I ever have an experience with this agency, I will add another section to this review about this particular office.\n\nSection 1: The male operators are very polite, and actually help you with what you need help with. The female operators, however, are very rude, and sometimes even refuse to take my complaint. That is the feedback I have received at least", "pics": null, "resp": null, "gmap_id": "0x88929283fffa066f:0x11265766abcac906"}
{"user_id": "112192235423051737245", "name": "Gabe Fox", "time": 1555710506539, "rating": 3.0, "text": "had a nice experience overall, the facilities were sub-par, very 80’s modernistic. Took one star off because some of the staff was not very friendly, got roughed up a bit during a one on one session. However the main manager was very nice, kept telling me to focus and relax. Took another star off for the other guests, they were very loud and kept screaming in the middle of the night. I was looking for the spa when I kept seeing weird glows coming from staff areas. not sure what that was about. Over all I recommend this experience for any extra terrestrial or person traveling through the Milky Way!", "pics": null, "resp": null, "gmap_id": "0x88929283fffa066f:0x11265766abcac906"}
{"user_id": "114211775379714774312", "name": "Carter McCall", "time": 1541449696564, "rating": 1.0, "text": "Kreb", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM2l-6dZLnFRogiyr0wokD_liY9O33j8E883CKA=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88929283fffa066f:0x11265766abcac906"}
{"user_id": "112751118145596508319", "name": "Nina Jones", "time": 1483249986746, "rating": 5.0, "text": "I was treated with noting but with respect from them today! Usually when you want to voice a concern about anything, anywhere you're treated as I'm here doing this only cause of my job! I was listened to, and respected as human being and not rushed.\nI about passed out when they taken my DL a second time lol, couldn't run, couldn't hide.\nIn all good place to go if you know they might can help or point you into the right direction! Keep up the good work!!!", "pics": null, "resp": null, "gmap_id": "0x888e816ef3ab45cf:0x93516844dff766b3"}
{"user_id": "104793184751336587357", "name": "Kel Moy", "time": 1501947676913, "rating": 5.0, "text": "I have had to reach out to FBI units in other cities across the USA. I am uncovering a criminal network where I am now. I was a staff assistant at a major Montgomery law firm also on Commerce Street. I am finding out that on the East Coast there are crime networks that involve generations of families which is why people are more guarded on the East Coast than on the West Coast. I have information about crime networks/rings where family members by-pass background checks for attorneys judges and even federal level employment. As a former active duty military personnel the hiring process does not require a phony resume but rather 19 pages including associates you have known since preschool. Luckily I have a cousin who is connected with the Snowden family i.e. Edward Snowden, chief of police, and I am related to screenwriter and producer of Married with Children. I think my half uncle I haven't met wrote Forrest Gump. My grandmother's little sister worked for the FBI in the late 1940s her first real job out of high school.  My own parents were attorneys in Corporate law in San Francisco and with the Attorney General of California. I am calling the FBI in Montgomery today. Thanks", "pics": null, "resp": null, "gmap_id": "0x888e816ef3ab45cf:0x93516844dff766b3"}
{"user_id": "103454887201849308904", "name": "Ashley Garnett", "time": 1510517464080, "rating": 3.0, "text": "Im not 100% sure on this department of the federal bureau of the investigation,im not 100% sure that the state of Alabama isn't just there to cover the state of Alabama but I have called this department many times and also spoke with other federal offices across the country and it sure seems like at least one call to the Alabama bureau of investigation would have proved successful in stopping the organized crime of the Alexander city Alabama police department cause surely the FBI in this god forsaken state would have noticed the free mason symbol on the top of the building that houses the office of Charles gillenwater who is the municipal attorney for Alexander city and this building symbol and all is located in front of the Alexander city Alabama police department also I have seen some of the police wearing rings with the same free mason symbol not to mention many attacks on me made by the citizens of Alexander city and other cities in Alabama all seem to have been police orchestrated", "pics": null, "resp": null, "gmap_id": "0x888e816ef3ab45cf:0x93516844dff766b3"}
{"user_id": "114136481875425615311", "name": "Michael Burgess", "time": 1623080025792, "rating": 5.0, "text": "My favorite FBI", "pics": null, "resp": null, "gmap_id": "0x889a4fd7f6abc3bb:0xe0460f4858a7592d"}
{"user_id": "114433351599194188276", "name": "Jeff Short", "time": 1554323589210, "rating": 5.0, "text": "Excellent organization. The FBI is the best.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7f6abc3bb:0xe0460f4858a7592d"}
{"user_id": "113866293591079561577", "name": "D C", "time": 1550508443277, "rating": 1.0, "text": "If I had knowledge of a crime about to take place I would not waist my time on this site.\nI would just sit at home and watch the news ... Sorry but there is no way to inform the FBI\nby email here. I am on my tablet and email is the only way of contacting them. I rate this site\n:-(   :-(   :-(   :-(", "pics": null, "resp": null, "gmap_id": "0x889a4fd7f6abc3bb:0xe0460f4858a7592d"}
{"user_id": "102462774700991510184", "name": "Morgan McVeigh", "time": 1550607984361, "rating": 5.0, "text": "You go get that Victory Royale", "pics": null, "resp": null, "gmap_id": "0x889a4fd7f6abc3bb:0xe0460f4858a7592d"}
{"user_id": "111676635109286700272", "name": "Montie Mann", "time": 1550600798438, "rating": 5.0, "text": "Thank you Kanye, very cool!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7f6abc3bb:0xe0460f4858a7592d"}
{"user_id": "107692958309090454303", "name": "Jeff Sanders", "time": 1550470906005, "rating": 5.0, "text": "Always wanted to leave a review for the FBI. Thanks Google!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7f6abc3bb:0xe0460f4858a7592d"}
{"user_id": "101864701164132980477", "name": "Jac Treece", "time": 1522600457746, "rating": 5.0, "text": "The Power's That Be. ..JAT", "pics": null, "resp": null, "gmap_id": "0x889a4fd7f6abc3bb:0xe0460f4858a7592d"}
{"user_id": "110926654655204978829", "name": "Robert Barnes", "time": 1620243147772, "rating": 5.0, "text": "KEEP THE VICTORY ROYAL STREAK  GOING NICE PLACE THANKS FOR HELPING PEOPLE SO MUCH!!!!!!!!!!!!!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7f6abc3bb:0xe0460f4858a7592d"}
{"user_id": "118225856678753038344", "name": "Shaun Gasson", "time": 1602178108369, "rating": 1.0, "text": "Redcoats, would not recommend.", "pics": null, "resp": null, "gmap_id": "0x88626daf68ca4ff7:0x3fa194a9c107888f"}
{"user_id": "100961208140867340865", "name": "Andre Firefighter Young", "time": 1623331783757, "rating": 5.0, "text": "(Translated by Google) It's the Jag office\n\n(Original)\nIt's the Jag office", "pics": null, "resp": null, "gmap_id": "0x888e86ae964d0cf1:0xcdd57493a5209e42"}
