{"user_id": "102309869772145111837", "name": "TopThat Bingo", "time": 1620666091300, "rating": 1.0, "text": "My husband and I visit this clinic and the staff was very nice, we were paying out of pocket and we paid for all our services in CASH, over thousand dollars just for LABS. To this day, we both are still getting a bill for something that was already paid for. I will never go back to this clinic again, and I would never recommend anyone else to go. If I could give 0 stars I would!!!", "pics": null, "resp": null, "gmap_id": "0x8889197bec012587:0x7d5f5781c4c6b6bf"}
{"user_id": "101458613105542285606", "name": "Danel Sanders-Delaine", "time": 1611242860509, "rating": 1.0, "text": "I WOULD NOT RECOMMEND. Both offices very unorganized. Unsanitary. I often saw people blood and used tools. No covering on trash cans. The very first visit we sat in the office four hours only to be told go home and the doctor will call you. I asked specifically for information on my next visit and what to expect. I was told come alone it’s just a ultrasound. But when I got there they asked, “Where is your spouse?” After taking birth control for months and going through the process they would not see us for a last minute appointment because we had our kids even though we were already in the office. Even though it was their fault we didn’t have time to get childcare because they told us to come singular when we both needed to be at the appointment.\nOverall awful experience for a couple trying to conceive.", "pics": null, "resp": null, "gmap_id": "0x8889197bec012587:0x7d5f5781c4c6b6bf"}
{"user_id": "111662642503647773198", "name": "Brandon Hardy", "time": 1592578206799, "rating": 5.0, "text": "Absolutely amazing staff! We just welcomed our  first child back in March thanks to Dr. Long! He is truly an amazing doctor and the staff is so kind. Hannah is the sweetest girl you’ll ever meet. If you have lost hope on having children or  are just at the end of your rope, please give their office a call. Give them a chance. They’ve helped several people I know, including us, conceive! And now we have a healthy baby boy! All thanks to God and this amazing team! Sending well wishes to all that work there!", "pics": null, "resp": null, "gmap_id": "0x8889197bec012587:0x7d5f5781c4c6b6bf"}
{"user_id": "111192143110304923059", "name": "BrittBratt86 Sheppard", "time": 1591044266478, "rating": 5.0, "text": "Such a wonderful staff ❤ They make the process simple and treat you like family. Definitely the best fertility clinic around in reference to experience and price. Dr. Long and Hammond's knowledge and caring personalities cant be compared to. They go above and beyond for their patients without hesitation. Seriously the best! It doesnt get better than AIRM! Take it from someone that had multiple fails with no explanation before coming to them. You wont be disappointed!", "pics": null, "resp": null, "gmap_id": "0x8889197bec012587:0x7d5f5781c4c6b6bf"}
{"user_id": "101285800796733096253", "name": "Annie Rotberg", "time": 1575904385973, "rating": 5.0, "text": "I love them! all of them!  I highly recommend this office! everyone is amazing in both offices! They really care about their patients and want to find a way to help! I love everyone here! I wish all offices were as caring", "pics": null, "resp": null, "gmap_id": "0x8889197bec012587:0x7d5f5781c4c6b6bf"}
{"user_id": "112407035346569015143", "name": "Jonnie McCarley", "time": 1579841257230, "rating": 5.0, "text": "They are all amazing! We did two rounds of A-IVF and now we have a beautiful baby girl. Karen is a angel! She was so supportive and caring due the whole process. You can truly tell she loves what she does.", "pics": null, "resp": null, "gmap_id": "0x8889197bec012587:0x7d5f5781c4c6b6bf"}
{"user_id": "105033711238102165918", "name": "Hannah Hardy", "time": 1560613110723, "rating": 5.0, "text": "Amazing staff and service! We drove 7 hours and they there so accommodating and eager to help with anything we needed! Karen, NP is the absolute best! She made us feel so confident about everything and listened to all of my questions and concerns so patiently! We would absolutely do it again and would recommend anyone to them for INVOcell! It was a great experience!", "pics": null, "resp": {"time": 1564504150989, "text": "Thank you so much for this kind review! We are so appreciative of our customers who go out of their way to be treated at AIRM."}, "gmap_id": "0x8889197bec012587:0x7d5f5781c4c6b6bf"}
{"user_id": "107880960479309393658", "name": "Lori Turrentine Moore", "time": 1567386941552, "rating": 5.0, "text": "Best fertility clinic! After coming from another clinic this place was amazing. The staff truly care and listen to all of your concerns. Dr Long is amazing and Dr Hammond words can’t describe. We’ve done 2 rounds of invocell with them and currently pregnant. Couldn’t have made it this far without them!", "pics": null, "resp": null, "gmap_id": "0x8889197bec012587:0x7d5f5781c4c6b6bf"}
{"user_id": "104225472479516910763", "name": "Anonymous User", "time": 1577373259271, "rating": 5.0, "text": "Drs. Long and Hammond are wonderful. We highly recommend their services. They are highly knowledgable, compassionate, and caring. The staff is friendly and welcoming. Fertility journeys can be filled with ranges of emotions, we feel comforted to have Drs. Long and Hammond by our side.", "pics": null, "resp": null, "gmap_id": "0x8889197bec012587:0x7d5f5781c4c6b6bf"}
{"user_id": "109696976658198969676", "name": "Courtney Adams", "time": 1554830711187, "rating": 5.0, "text": "Wonderful doctors and staff. Couldn’t ask for a more caring place to deal with infertility with. Thank you so much to Dr Long and Dr Hammond for everything that you both do.", "pics": null, "resp": null, "gmap_id": "0x8889197bec012587:0x7d5f5781c4c6b6bf"}
{"user_id": "105093901003380310410", "name": "MY HOBBY IS YOUR LOBBY 1", "time": 1576136858006, "rating": 1.0, "text": "Bad experience the vibes wasn’t right I stop by to inquire on a tubal reversal  also was given a wrong diagnosis, stated after he remove polyps I may not need tubal reversal. I immediately Went to have a second opinion scheduled my  procedure and it was a success. PDTA", "pics": null, "resp": null, "gmap_id": "0x8889197bec012587:0x7d5f5781c4c6b6bf"}
{"user_id": "101640507642443647365", "name": "Rachael Gentry", "time": 1522862659262, "rating": 5.0, "text": "Dr. Long is amazing! We started seeing him at Brookwood in 2014 for our fertility issues. When we heard that he opened up his own practice, we followed him there. He has the perfect balance of knowledge, bedside manner and sincerity that we look for in a doctor. He has not given up on us and that is a major plus!", "pics": null, "resp": null, "gmap_id": "0x8889197bec012587:0x7d5f5781c4c6b6bf"}
{"user_id": "114693827497514159402", "name": "Ashley Stewart", "time": 1545247610745, "rating": 1.0, "text": "Used this dr may 2018 to him to say everything went perfect to take my money to no success my tubes aren’t open", "pics": null, "resp": null, "gmap_id": "0x8889197bec012587:0x7d5f5781c4c6b6bf"}
{"user_id": "104590162632430603197", "name": "Lena Parris", "time": 1558617733451, "rating": 5.0, "text": "I am using Dr. Long and I think he is wonderful.  We are hopeful in our journey and we look forward to this new chapter :)", "pics": null, "resp": null, "gmap_id": "0x8889197bec012587:0x7d5f5781c4c6b6bf"}
{"user_id": "112844649229698167176", "name": "Countrychick Al", "time": 1523664870745, "rating": 5.0, "text": "Dr long and his staff are absolutely amazing! He is so hands on and helps you understand everything!", "pics": null, "resp": null, "gmap_id": "0x8889197bec012587:0x7d5f5781c4c6b6bf"}
{"user_id": "111941417488939584466", "name": "Cindy Jones", "time": 1534646771947, "rating": 1.0, "text": "I would not recommend this doctor! My daughter has wasted her time and money.", "pics": null, "resp": null, "gmap_id": "0x8889197bec012587:0x7d5f5781c4c6b6bf"}
