{"user_id": "104305922294448549115", "name": "Stephen K", "time": 1608326064526, "rating": 5.0, "text": "Absolutely the nicest and most professional group of people you could imagine doing business with! 6 stars", "pics": null, "resp": null, "gmap_id": "0x88892185dcc2343f:0xa6fc9c42f1674e67"}
{"user_id": "114305199325743822721", "name": "Cindy Davis", "time": 1612457376879, "rating": 5.0, "text": "Tim McLain and his staff take excellent care of all my insurance needs. They are honest and they reach out to the customer.", "pics": null, "resp": {"time": 1612745035289, "text": "Thank you, Cindy! We are grateful for the opportunity to help you with your insurance needs."}, "gmap_id": "0x888c92d5739f943d:0x23968bc1f92e0dba"}
{"user_id": "108378664725677436488", "name": "patrick mckee", "time": 1612036527438, "rating": 5.0, "text": "Great people, helpful...", "pics": null, "resp": {"time": 1612196009305, "text": "Thank you, Patrick, for leaving the kind review!"}, "gmap_id": "0x888c92d5739f943d:0x23968bc1f92e0dba"}
{"user_id": "107418055221231008093", "name": "Theri Brooks", "time": 1504466393065, "rating": 5.0, "text": "It is a wonderful to know I can easily contact Tim when I need him to help me with my financial investments!  His staff is knowledgeable  and friendly.", "pics": null, "resp": null, "gmap_id": "0x888c92d5739f943d:0x23968bc1f92e0dba"}
{"user_id": "114617477425882281484", "name": "Ashlea Armstrong", "time": 1506262605730, "rating": 5.0, "text": "Love our local agent Tim McLain! Jamie and Bailey at his office are the best!", "pics": null, "resp": null, "gmap_id": "0x888c92d5739f943d:0x23968bc1f92e0dba"}
{"user_id": "108263847213943619930", "name": "Robert Bashaw", "time": 1629040173346, "rating": 3.0, "text": "Not sure yet he's not responded to my email.", "pics": null, "resp": {"time": 1629142793505, "text": "Hi Robert. Thank you for reaching out and bringing this to our attention. We'll look into this further and get back to you shortly. Our apologies for any inconvenience."}, "gmap_id": "0x888c2b4116d10407:0xb855bddf9ac3ae3"}
{"user_id": "108221675631306578496", "name": "Nikki Rochelle", "time": 1600283346648, "rating": 1.0, "text": "Really unhappy with my service today. I came through the drive through and the woman at the window took my money, gave me my receipt, and said \"bye\". I was not finished with my transaction so I pushed the call button and she said \"do you need something else?\".\nWhen I told her a needed a different receipt, she said I would have to wait and she started to cash a check for a guy who pulled up to the next window AFTER I had arrived. Not only was she rude she was not helpful. After the man with the check finished his transaction. The teller came back to me and told me I should just use the app because she is alone and doesn't have any assistance in the office today (but the app is not showing the money deposited). She told me to wait a minute she just had to help this next woman with her transaction and she could assist me. This woman was the car behind the man who cashed the check (so TWO people that arrived after I did). I moved to Alabama from out of state and BB&t Bank came highly recommended to me from a lot of people that I met. I am seriously considering finding a another bank with employees who take customer service seriously, and care about maintaining customer relationships.", "pics": null, "resp": null, "gmap_id": "0x888924100877e9b9:0x58cac67f4b86b170"}
{"user_id": "109557173996914386495", "name": "Domingo Ayala", "time": 1580144914845, "rating": 1.0, "text": "Everyone at this bank is nice until Megan just gave me an awkwardly stare without any explanation and I asked “ ..... What? “ And she didn’t say anything which was beyond weird and unprofessional. I have had never experienced that type of odd behavior. Everyone else is nice and professional.", "pics": null, "resp": null, "gmap_id": "0x888924100877e9b9:0x58cac67f4b86b170"}
{"user_id": "113257301513562907702", "name": "Jessica Penningtom", "time": 1526926229744, "rating": 5.0, "text": "I love everyone at this location and they love my husky always spoil him giving him dog treats at the drive thru Everytime I come through they are all sweet never any issues or problems.", "pics": null, "resp": null, "gmap_id": "0x888924100877e9b9:0x58cac67f4b86b170"}
{"user_id": "113891435947693650340", "name": "Selenophile Xx", "time": 1511560456976, "rating": 1.0, "text": "I opened my acct at this branch. I am currently living out of state in Wisconsin where there are no BBTs. I was very concerned about having to close my acct.. so I call this branch to see what i needed to do, some lady (yarah I believe) told me there was nothing she could do to help me.. i couldn't do it over the phone/online.. I tell her my situation. And she showed no concern or effort to help me. She told me I HAD to go to a branch in person to close my acct.. or I will still be charged a $5 maintenance fee..she also told me I would be charged a $35 fee if there's no money in the acct,on top of the$5.. needless to say when I hung up the phone I was very stressed & displeased..\nI call the BBT on hwy72 in Madison AL.. I didn't need to say much of anything, the lady I spoke to was MORE than happy to help. INFACT, she told me the complete opposite from what this pelham branch told me.. that she could close it over the phone, easy! I just need to take my money out..&, she would keep an eye on my acct for me. THAT'S good customer service!", "pics": null, "resp": null, "gmap_id": "0x888924100877e9b9:0x58cac67f4b86b170"}
{"user_id": "107879601486358266668", "name": "micah nash", "time": 1521233526189, "rating": 5.0, "text": "Emily is fantastic!", "pics": null, "resp": null, "gmap_id": "0x888924100877e9b9:0x58cac67f4b86b170"}
{"user_id": "103136168224154012801", "name": "Destiny Fitch", "time": 1474311509929, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x888924100877e9b9:0x58cac67f4b86b170"}
{"user_id": "113672141065072205360", "name": "April G", "time": 1629349058369, "rating": 3.0, "text": "So far I haven't had a bad experience. I just wish they offered 2 day faster direct deposit pay like my business account. It really comes in handy.", "pics": null, "resp": {"time": 1629372378230, "text": "Thank you for your feedback, April. We’re glad you haven’t had a bad experience with us. Outside of the faster direct deposit, is there anything else we can do to improve this 3* rating?"}, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "109680698990439797661", "name": "Candice Register", "time": 1618592049593, "rating": 5.0, "text": "Originally I had not left good reviews about this bank, but they have gone above and beyond to correct all issues. We have decided to remain at this bank because we have been here for a very long time and they have remedied everything. Thank you Avadian for coming through for us!", "pics": null, "resp": {"time": 1618600004149, "text": "Thank you so much Candice! We greatly appreciate the opportunity to make this right. We are glad we could keep you as a member!"}, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "107797579953483359812", "name": "Darcie Blixt", "time": 1627668969201, "rating": 2.0, "text": "Such a waste with the ATM taking drive thru space. Been in line for 20 minutes", "pics": null, "resp": {"time": 1627669678521, "text": "Hi Darcie, we apologize for the wait. We are currently short staffed at this branch. Did you know you can do almost everything you can do at a drive-thru window right there at our new ATM?"}, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "111756408769811607951", "name": "Chad Abner", "time": 1618856439419, "rating": 5.0, "text": "Very helpful\nGood For people wanting to save\nGreat Customer Service", "pics": null, "resp": {"time": 1620157539377, "text": "Thank you for the great review, Chad!"}, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "101581036909569694638", "name": "Tracy Duncan", "time": 1616277924118, "rating": 1.0, "text": "Their website needs updating. I drove to this location from Birmingham only to find out they were no longer a CU service center. When I tried to contact them by phone, I got their God-awful phone tree. I wasted a great amount of time because their info is incorrect😠", "pics": null, "resp": null, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "115530995996294862073", "name": "Marie Carter", "time": 1607339766700, "rating": 5.0, "text": "Love it that they have Saturday lobby hours and a change machine in the lobby (drive through service too of course) and the staff always acts like they appreciate you coming there for service!", "pics": null, "resp": null, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "100119577059628078679", "name": "Sarah Vanessa", "time": 1593026419418, "rating": 5.0, "text": "I have been with this bank since i was 17 and they were still Alabama Telco. In the last 8 years, i have had my checking, savings, credit card, and 3 car loans through them. Always a pleasure to work with!", "pics": null, "resp": {"time": 1593030217908, "text": "Thank you so much for the 5* review Sarah! We are delighted to call you a member!"}, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "104076246787396625017", "name": "Cathy Wheeler", "time": 1521723027196, "rating": 5.0, "text": "Excellent customer service and product knowledge.  It’s the way banking use to be.  They go out of there way to make sure everything is correct. Excellence at its best!", "pics": null, "resp": {"time": 1520612361023, "text": "Thank you so much for the review, Cathy! We are delighted to have you as a member!"}, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "118393799451957891818", "name": "Jason Creel", "time": 1555760449419, "rating": 5.0, "text": "I regularly use the Trussville Avadian branch and find the staff to be helpful and friendly.", "pics": null, "resp": null, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "102593290457472258228", "name": "David Turner", "time": 1500125343143, "rating": 5.0, "text": "The staff is very friendly and wastes no time getting your transaction posted... PLUS they have Saturday hours too! One of my favorite financial institutions...", "pics": null, "resp": {"time": 1500298601292, "text": "Thank you for the kind words and thank you for being a delightful member, Mr. Turner!"}, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "105897807763018055051", "name": "Bob Short", "time": 1490336472427, "rating": 5.0, "text": "Recently opened a checking account here. Very pleased with the help I received. People are very helpful and friendly.", "pics": null, "resp": null, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "114350695764471244152", "name": "K Allen", "time": 1493153048855, "rating": 1.0, "text": "This is by far the worst bank I have ever seen they lied five times to us we paid to have our house appraised which they told us it appraised for $54,000 and in fact it appraised for $68,000 then after a month of dealing with them  they told us they couldn't give us an equity loan to fix our house because there was a crack in the wall and there system auto denied our loan the loan manager said she will get her boss to look at it and ask him to give us the loan that was Monday morning I ask if there was any progress Monday evening around 3 she said if a ask him about your loan he will just turn you down  bottom line don't do business with them and don't trust them. there not friendly and they don't care about us\nthe picture is where the 63 year old house settled why they sais they couldn't do anything", "pics": null, "resp": null, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "117293861334585939349", "name": "Valerie H", "time": 1504024343950, "rating": 5.0, "text": "The staff are very pleasant and helpful, and they are open on Saturdays until noon, which is great!", "pics": null, "resp": {"time": 1504025011914, "text": "Thank you for the kind words Valerie! Have a fantastic Tuesday!"}, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "114858942835225157559", "name": "Xiomara Blasco", "time": 1452359434786, "rating": 5.0, "text": "My husband and I love this bank\nTheir staff is always helpful and friendly.", "pics": null, "resp": null, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "108086376202094776532", "name": "Tom Collier", "time": 1538598362255, "rating": 2.0, "text": "This location is awful the staff is rude and unwilling to help. Avadian Credit Union as hold is a good place it's just this location for whatever reason", "pics": null, "resp": {"time": 1538599565842, "text": "We hate to hear that Tom. We will reach out to this branch and get to the bottom of this."}, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "105186283470054038887", "name": "Barry Fincher", "time": 1420242183407, "rating": 5.0, "text": "I have been a customer for over 20 years.  Always helpful, friendly and professional.  Now open on Saturdays, for me a big plus!", "pics": null, "resp": null, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "102681446274139615394", "name": "Jaime Allison", "time": 1468873698867, "rating": 5.0, "text": "Love Avadian! Always helpful, kind and awesome customer service!", "pics": null, "resp": null, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "113390590522762818635", "name": "Jennifer N", "time": 1413566166779, "rating": 1.0, "text": "Poorly run credit union.  The staff is rude and unprofessional.  They offer no assistance to their members.  There are too many credit unions to choose from to choose this one.  Save yourself the aggravation and disapproval.", "pics": null, "resp": null, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "105729013401100496291", "name": "Juanisha Byrd", "time": 1554221488688, "rating": 1.0, "text": "Avadian is one of the worst banks in Alabama ! The people over the phone are rude ! They do not know what the correct information and procedures are ! I’ve had nothing but problems with them giving me wrong information ! These people are disgusting I’ve closed my account and will absolutely will never ever recommend them or bank with them again!", "pics": null, "resp": {"time": 1554223332857, "text": "Hi Jaunisha, we are sorry you’ve had a bad experience with us. Can you tell us who you spoke with over the phone?"}, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "115569267634944881545", "name": "Wendy Franklin", "time": 1489447296060, "rating": 5.0, "text": "Great people, love them.", "pics": null, "resp": null, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "117536192146522996374", "name": "Rick Guilbeau", "time": 1471885235771, "rating": 5.0, "text": "Great service every time - anyone not satisfied has a personal problem.", "pics": null, "resp": null, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "110199503438290573798", "name": "Rob D.", "time": 1395500743685, "rating": 3.0, "text": "Open on Saturday now!", "pics": null, "resp": null, "gmap_id": "0x88890daabcde645b:0xc1f75c8a6e7960ec"}
{"user_id": "108015902358694270361", "name": "Thomas Parish", "time": 1571638096508, "rating": 5.0, "text": "Best CPA firm in town.", "pics": null, "resp": null, "gmap_id": "0x888cf2c215ccf397:0xfbd82a04c43ea664"}
{"user_id": "107902641975737832564", "name": "Rhonda Usry", "time": 1583458807120, "rating": 5.0, "text": "Friendly staff,  has helped me with numerous banking issues. Ample parking. Monies secured for customers, always a greeting from the staff when you walk in.", "pics": null, "resp": null, "gmap_id": "0x888bb71d532d04ab:0x2c5f4a747bfbee5d"}
{"user_id": "101850039723380837043", "name": "Joe W", "time": 1541193024244, "rating": 4.0, "text": "No acknowledgment for prior service veterans.", "pics": null, "resp": null, "gmap_id": "0x888bb71d532d04ab:0x2c5f4a747bfbee5d"}
{"user_id": "112462712042161716278", "name": "Clifford Laguerre", "time": 1625007475038, "rating": 5.0, "text": "This is our second time working with Terri, and we know we made the right choice, again! For our home purchase, she came highly recommended and proved herself to be on our side through each step of the tedious process. Now for our refinance, Terri not only educated us on how to get the best deal, but offered it to us! Through it all, we appreciated feeling that we had someone sincerely on our team, and that's what Terri provided us.", "pics": null, "resp": null, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "113304409520862371231", "name": "Colton Harden", "time": 1627826517515, "rating": 5.0, "text": "Erika and her team do a great job. It’s always a smooth process. I’ve used several mortgage providers in the past. I’ll never use anyone other than this team in the future.", "pics": null, "resp": null, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "113512781783358264716", "name": "Morgan Barkley", "time": 1625837338645, "rating": 5.0, "text": "I used First Federal Mortgage to purchase my first home and they were awesome! They kept me updated throughout the entire process and were very quick to answer any questions I had. 10/10, would use again!", "pics": null, "resp": null, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "107899542281524471803", "name": "Maria Hayes", "time": 1606494868941, "rating": 5.0, "text": "If you're looking to buy a house, I highly recommend 1st Federal Mortgage in Gadsden. They are very personable and have helped me understand every step of the loan process. I personally love the personalized videos that I've received at every step of the loan process.\n\nIf you are a first responder, health care professional, military or teacher, you can get a discount through the Homes to Heros program (you must use Terri Hammond (pictured here) as your loan processor to get the credit).", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPUK5jkA6RXke4jjcqlcOjossqKh0NzQCR4NrsI=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "112257216186832043703", "name": "Greg Fowler", "time": 1616246292185, "rating": 5.0, "text": "Everyone at First Federal Mortgage exemplified true courtesy and professionalism from my first contact with the team. Erika Westcott and all those involved with my refinance provided a timely step by step manner which I found incredibly simple and refreshing. I experienced no ‘waiting around’ for a response during the entire process. Dealing with Erika, Afton, Maggie and those involved was a real pleasure.", "pics": null, "resp": null, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "100699958284771227777", "name": "Jessica Cody", "time": 1627079940743, "rating": 5.0, "text": "Erika and the whole first fed crew are the best!!! They were there every step of the way for guidance and support!!!", "pics": null, "resp": null, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "109204640650364208461", "name": "Lindsey Morrison", "time": 1611405478169, "rating": 5.0, "text": "I can’t say enough good things about Terri! She was such a pleasure to work with. From the beginning of the home buying process to the end she was just amazing. I have recommended her to everyone I know. If your look to buy or refinance she is definitely your lady. Thank you again Terri for such an amazing experience.", "pics": null, "resp": null, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "100228404824149638473", "name": "Brandon Snyder", "time": 1621338296309, "rating": 5.0, "text": "Erika and her team has earned our trust for helping our family with our mortgage needs. We have used this team on multiple occasions and they continue to demonstrate a high level of communication and trust.", "pics": null, "resp": null, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "107597879934774420264", "name": "Gina Preston", "time": 1605156793886, "rating": 5.0, "text": "I had the pleasure of working with Terri. She was very kind & helpful.  My journey through this process was very Professional & so very smooth.  Thank you , Terri & Ashley for being so very patient & kind!! I will definitely tell anyone I know buying a Home to contact this fantastic group of ladies.", "pics": null, "resp": null, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "111691020272211768726", "name": "Laura Langley", "time": 1614391667359, "rating": 5.0, "text": "I appreciate all Terri’s hard work! Thank you for making financing fun!", "pics": null, "resp": null, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "113243770690537088135", "name": "Chris Davenport", "time": 1614439879187, "rating": 5.0, "text": "Erika and her team go above and beyond to make sure it's a smooth transition. Would recommend them to everyone.", "pics": null, "resp": null, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "112908738743526754339", "name": "Dylan Percival", "time": 1582070053077, "rating": 5.0, "text": "They produced the easiest experience I think anyone could have when it comes to buying a home. Erika, Maggie and Afton were a MAJOR help! Such a smooth experience it almost makes me want to buy another house!", "pics": null, "resp": null, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "105404859143860735305", "name": "Ashley Bennett", "time": 1530035895865, "rating": 5.0, "text": "I had the most amazing experience with Hannah Banks. She always answered any stupid question I had and explained everything, so a first time home buyer like me, could understand. While working with Hannah I also interacted with a few other people in the First Federal Bank office and everyone was patient and kind to me.\nI was new the the Gadsden area while I was buying my home, knowing this, Hannah took me under her wing and welcomed me with open arms. I am so happy to say I made my first Gadsden friend in Hannah.\nThank you to Hannah and all the First Federal Bank team!", "pics": null, "resp": {"time": 1530548671671, "text": "Thank you so much for the kind words. We always try to show people the love we have of our community."}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "115129981986385019655", "name": "C Mendoza", "time": 1453847643002, "rating": 5.0, "text": "Donna Patterson at First Federal was so kind and helpful.  This was our first home buying experience, and I was nervous. She explained things we needed to understand, presented our options and listened to our concerns. Donna was quick and organized in her communications. She is perfectly balanced at being professional and friendly.  I'm not sure why so many  complain about the home buying process, because ours was as pleasant and exciting as a new home should be. Thank you, Donna.", "pics": null, "resp": {"time": 1510167229124, "text": "Thank you! It was a pleasure working with you as well!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "102451277550045565064", "name": "Scott Allen", "time": 1526557941668, "rating": 5.0, "text": "Erica and her team were great to work with.  They made sure my parents got the best rate available and went above and beyond to assist them in what turned out to be a fairly difficult closing.  I have personally used Erica and her group on several occasions and would recommended them to anyone looking for a loan in the Gadsden area.", "pics": null, "resp": {"time": 1526564264350, "text": "Thank You Scott for the kind words!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "104074014335912911327", "name": "LeAnne Vice", "time": 1576942739090, "rating": 5.0, "text": "Erika did a fantastic job with our buyer clients. Everything  was smooth throughtout the transaction and when she was out of the office Afton was able to take care of what we needed.", "pics": null, "resp": null, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "114444754093226296018", "name": "Melissa McSpadden", "time": 1452209048788, "rating": 5.0, "text": "Erika and her crew are awesome!!!! All my questions were answered in a timely manner and there was plenty! Everything worked out wonderfully, no difficulties whatsoever. The best part was I done it all electronically except for closing of course! Not one time did I have to go to the office! Loved the convenience! They are the best!!! I would highly recommend them if you are interested in a  mortgage for a new home!!! Thank you all so much!!!", "pics": null, "resp": {"time": 1510163143661, "text": "Thank you so much! We pride ourselves of our availability to make every home buying experience a good one!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "113881219382642606191", "name": "Nicole Hill", "time": 1527694032449, "rating": 5.0, "text": "I am so thankful we were referred to Hannah at First Federal. She has been so helpful throughout the loan process,  was always available to answer my questions, and made us feel very comfortable. She even made us a binder to help us keep up with all our paperwork after closing. Thank you Hannah!! You are a blessing", "pics": null, "resp": {"time": 1528140164471, "text": "Thank you so much for the kind words!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "102897797508776107022", "name": "Laura Annette Mayleben", "time": 1537447119919, "rating": 5.0, "text": "My loan experience with First Federal was the best!  All the credit goes to Erika and the team at First Federal.  They were very friendly and professional at all times.  Everyone worked very hard to make sure that everything was done smoothly and quickly.  Thank you very much!!", "pics": null, "resp": {"time": 1537467433618, "text": "Laura thank you so much for the kind words. We always try our best and love to see people become new home owners!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "116957968820523810130", "name": "Kelly Swafford", "time": 1452190289743, "rating": 5.0, "text": "I was so impressed with First Federal Mortgage. From the beginning, Erika and her staff were very professional and answered every question with ease. They are very knowledgeable, friendly and explained the details in a way that was easy to understand. They worked hard to make sure we received the best rate.  Thank you, First Federal Mortgage for making our closing as easy as possible!", "pics": null, "resp": {"time": 1510086734494, "text": "Thank you for your review! We pride ourselves on always doing our best for our customers!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "105877071904012049380", "name": "Brett", "time": 1519001015772, "rating": 5.0, "text": "Erika was fabulous to work with!!  We were very impressed with how quick and efficient the entire process was.  We also loved the convenience of the electronic application.  Erika is very professional and very knowledgeable.  We highly recommend her!!", "pics": null, "resp": {"time": 1519052148597, "text": "Thank you Brett! We try everyday to make the experience a good one!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "106625064865212766093", "name": "Audra", "time": 1458259011900, "rating": 5.0, "text": "First federal did such an amazing job with our mortgage loan! Erica Westcott was so awesome in helping us with every detail of the loan! All the questions and texts were explained in layman's terms which was helpful! Also Gina was always so helpful  in helping answer questions and making sure we got the information we needed! We had an overall wonderful experience!", "pics": null, "resp": {"time": 1510160558511, "text": "Thank you for the kind words. We are so glad we could make your mortgage experience a wonderful one!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "118422935089007317405", "name": "Britnee Perkins", "time": 1530290489354, "rating": 5.0, "text": "Hannah and First Federal made our home buying experience easy. She is so sweet and was very helpful through the entire process from start to finish. I highly recommend Hannah Banks and First Federal Mortgage for any of your mortgage needs.", "pics": null, "resp": {"time": 1530548709539, "text": "Britnee thank you so much for the kind words!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "104829090457564705334", "name": "Pam Richee", "time": 1452536900045, "rating": 5.0, "text": "I've been a local realtor for 14+ years and have worked with the First Federal Mortgage team on numerous transactions to help make my clients who dream of owning a home a reality.  I personally use them for my own mortgage needs as well!\n\nErika Wescott and her team are nothing short of a great group of professionals who genuinely care for their clients!\n\nI would highly recommend to give them a call if you or anyone you know is looking for a home or has any mortgage needs!!!", "pics": null, "resp": {"time": 1510167267684, "text": "Thank you!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "112395094642572333407", "name": "Kala Green", "time": 1455516731671, "rating": 5.0, "text": "Scott Nilsen at First Federal was amazing. As a first time home buyer, I had many questions. Scott was always helpful and returned my calls and emails in a very timely fashion. My experience could not have gone any more smoothly, and I credit him. I would recommend Scott and First Federal to anybody.", "pics": null, "resp": {"time": 1510167179745, "text": "Thank you so much for the kind words!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "118324008227110870600", "name": "Pattye Woodall", "time": 1456842438737, "rating": 5.0, "text": "Erika and her staff were amazing!  They did the buyer's loan as well as ours and they both went so smoothly.  We would highly recommend First Federal's professionalism, knowledge and friendly customer service to anyone looking for a mortgage.", "pics": null, "resp": {"time": 1510161216412, "text": "Thank you! We are always striving to make sure our customers are completely satisfied!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "103145817373857175181", "name": "Jessica Guinn", "time": 1454894761756, "rating": 5.0, "text": "Erika, Gina, and everyone at First Federal Mortgage are a class act. They worked hard on my behalf and went above and beyond to help me get in my new home in a timely manner, all while answering every question I had along the way. I would recommend the staff of First Federal Mortgage to any and everyone looking for a quality job by friendly, helpful people!", "pics": null, "resp": {"time": 1510162345842, "text": "Thank you so much for the kind words. We always try to go above and beyond to ensure our customers have a smooth mortgage experience!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "104972548220269463816", "name": "Ryan Thoe", "time": 1467232980514, "rating": 5.0, "text": "I had the pleasure of working with Jay Hedgspeth from First Federal. As a first time home buyer I had plenty of questions, and Jay was able to make the entire process go as seamless as possible. He answered all questions in a very timely manner, and not once did he make any of my questions seem like a dumb question. I would VERY highly recommend anyone looking into buying a home to work with Jay.", "pics": null, "resp": {"time": 1510158768935, "text": "Thank you Ryan! We pride ourselves on our ability to make the loan process as smooth as possible!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "113215738465525194706", "name": "Kevin Asbury", "time": 1452270900840, "rating": 5.0, "text": "My wife and I had an absolutely fantastic experience working with Donna Patterson in buying our first home! She and others involved in the process at First Federal were incredibly informative and efficient in getting us in to our new home as fast as possible! If you're looking for a loan officer go by and see Donna!", "pics": null, "resp": {"time": 1510167316174, "text": "Thank you!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "112846665848509750389", "name": "Josh Kell", "time": 1452533975613, "rating": 5.0, "text": "Erika and the whole group are great to work with!  I have never had a client that was unhappy.  Being real estate I work with many different lenders, and I chose Erika for my personal home.", "pics": null, "resp": {"time": 1510167278667, "text": "Thank you!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "115316054441445238108", "name": "Angelique Davis", "time": 1452206230723, "rating": 5.0, "text": "I had a wonderful experience with Erika Westcott!!!! She was very helpful with helping me understand everything.... Even when I asked her a bunch of questions all the time she was very patient and helped me understand every detail... I would recommend Erika and the staff at First Federal any day of the week!!!!!!", "pics": null, "resp": {"time": 1510163271205, "text": "Thank you so much! We are so glad we could be along to help make your mortgage experience a good one!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "113455508307747749592", "name": "brandon s", "time": 1453861854811, "rating": 5.0, "text": "Everything about dealing with First Federal was positive. Erika and all of the staff were efficient and extremely timely in every part of our deal. She was right there with us every step of the way and we will use again in a heartbeat!!!", "pics": null, "resp": {"time": 1510162431814, "text": "Thank you so much! It was a pleasure to work with you as well!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "106913982206352440947", "name": "Brett Hawkins", "time": 1481303555126, "rating": 5.0, "text": "I would strongly recommend First Federal Mortgage and Jay Hedgspeth to anyone!!! Jay was wonderful and the loan process was smooth and to the point.  He explained the whole process thoroughly and guided me through every step! I would not hesitate to recommend Jay to any family member or friend!!!!", "pics": null, "resp": {"time": 1510087397655, "text": "Brett thank you so much! We always try to make sure our borrowers are informed and confident along the way. Don't hesitate to contact us in the future!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "114960355477745087807", "name": "Jeff Ingram", "time": 1452285376594, "rating": 5.0, "text": "Always a great team to work with!   Been working with First Federal for many years and they are always very professional and have \"can do\" attitudes!  Every client I have sent to them is happy...and that makes me happy!", "pics": null, "resp": {"time": 1510167297131, "text": "Thank you!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "104551339815178992114", "name": "Sue Holland", "time": 1452982598510, "rating": 5.0, "text": "As a real estate agent, I value the professionalism Donna Patterson with First Federal Mortgage provides to customers. Making the process of purchasing a home requires a lender who is dedicated to making the transition a smooth process. If you are considering purchasing a home, make your first call to Donna Patterson with First Federal in getting pre-approved.", "pics": null, "resp": {"time": 1510167257937, "text": "Thank you!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "100552932609953845115", "name": "Debbie Sullivan", "time": 1455919181923, "rating": 5.0, "text": "Erika Westcott and the staff at First Federal did an AMAZING job with the entire mortgage process!  It has been such a blessing and privilege to work with them!  Thanks so much for helping our dreams become a reality!!!", "pics": null, "resp": {"time": 1510161899168, "text": "Thank you so much for the kind words. It was a pleasure to work with you!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "104170279479306612593", "name": "Beth Whiteside", "time": 1452283749297, "rating": 5.0, "text": "Very professional group! We have done a lot of business with them and have never had a problem! I would encourage home buyers to check them out!", "pics": null, "resp": {"time": 1510167306585, "text": "Thank you!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "111900008221308050305", "name": "Kyle Ryan", "time": 1452193296906, "rating": 5.0, "text": "I have been a local Real Estate Broker in Etowah County for 14 years.  I have had several clients use the First Federal Mortgage team to help make home ownership dreams a reality.  Erika Westcott leads a great group of professionals. They are all very quick to respond with follow-ups and keep me in the \"loan Loop\".\nOne of the things that impressed me the most about Erika is she genuinely cares for the prospective clients.  If she does not have a program that is the best fit for a particular person she will find someone that does.\nI would recommend if you are looking for a loan professional call First Federal Mortgage.", "pics": null, "resp": {"time": 1510167288990, "text": "Thank you!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "103883104923313229944", "name": "Joseph Fountain", "time": 1533776015959, "rating": 5.0, "text": "This is our 2nd home through 1st Fed and as always Erika delivered. Made the process extremely easy and pain free.", "pics": null, "resp": {"time": 1534791122367, "text": "Thank you so much for the kind words Joseph."}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "109145211359964972837", "name": "Christian Tucker", "time": 1452794537761, "rating": 5.0, "text": "Working with Erica Westcott and First Federal was incredible. Any time you are dealing with any sort of mortgage situation things can be stressful, but Erica made the whole process go by quickly and painlessly. I would strongly recommend considering Erica and First Federal Mortgage for any of your mortgage concerns.", "pics": null, "resp": {"time": 1510162619210, "text": "Thank you so  much! We always do our best to make sure your mortgage process is as painless as possible!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "112087882369743861460", "name": "Stevi Carter", "time": 1462370162417, "rating": 5.0, "text": "Absolutely love this place and these people, they made buying a home very memorable! They handled everything and left me with little to no stress! Would recommend them to anyone!!", "pics": null, "resp": {"time": 1510160058868, "text": "Thank you for letting us be part of your home buying experience!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "116353074555638290703", "name": "Russell Addison", "time": 1452253896067, "rating": 5.0, "text": "Erika and the staff are all incredible people and work their hardest to get things done and make everything as convenient and easy as possible. They are awesome!", "pics": null, "resp": {"time": 1510163056108, "text": "Thank you so much for the kind words!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "101289446035985518480", "name": "Ross Isbell", "time": 1506526171417, "rating": 5.0, "text": "Jay and Gina and the team make the process seamless and easy! Wouldn't want to go anywhere else!", "pics": null, "resp": {"time": 1510086918698, "text": "Thank you Ross for the kind words. We do our best to make sure the process goes as smoothly as possible!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "115770239798972309781", "name": "LaTanya Threatt", "time": 1460925400782, "rating": 5.0, "text": "After leaving first equity who told me that my husband wasn't qualified for any loan bc of previous credit issues. And insulting us by not running us through the system tells us nothing we can do. First federal approved us and gave us a great interest rate. Not only that but they are not rude nor make u feel bad about your credit report. They help u in a friendly professional environment. Thanks to Erica Westscott over at First Federal for being good at what u do! I now have the home I dreamed of!", "pics": null, "resp": {"time": 1510160350982, "text": "Thank you so much for letting us help turn your dreams into reality!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "105526170760537319135", "name": "Pogo M", "time": 1465573984469, "rating": 5.0, "text": "My husband and I had a great home buying experience at First Federal Mortgage.They're professionalism and friendliness was really appreciated throughout the process.Thank you so much to Erica Westcott and Gina Lockridge for being so helpful.We would definitely recommend First Federal mortgage.", "pics": null, "resp": {"time": 1510159014046, "text": "Thank you so much! We are glad we could make your mortgage experience a good one!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "102184735120433801664", "name": "Courtney Gray", "time": 1527719182465, "rating": 5.0, "text": "Jay was phenomenal! We had some changes throughout, but, no matter what, he made sure we finished everything and closed on time.", "pics": null, "resp": {"time": 1528140436951, "text": "Thank you for the kind words!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "115016935052378510865", "name": "Will Spears", "time": 1452200639477, "rating": 5.0, "text": "Awesome to work with!! Love Erica Westcott and this company.", "pics": null, "resp": {"time": 1510163320767, "text": "Thank you! It was a pleasure to work with you as well!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "115775667651620516731", "name": "Miss La'Heaven Martin", "time": 1501020659660, "rating": 5.0, "text": "Guess the name explain it all..great company", "pics": null, "resp": {"time": 1510087033334, "text": "Thank you so much for the kind words!"}, "gmap_id": "0x888a3bdad14d7819:0xaf3e0f5ce1a9e00c"}
{"user_id": "113733924960615286001", "name": "Chase Deppen", "time": 1594038788333, "rating": 1.0, "text": "If you are a business owner and you deposit more $5525.00, they will not honor your deposit or give you access to those funds for 10 days.  Upon opening my business account, I wrote a personal check from my personal account to help fund my business account.  The next day, I called my bank to make sure that they had sent the funds to BB&T.  My bank told me that BB&T had received the funds the next business day.  However, BB&T told me that while they had the funds from my personal account, my business account wouldn't be able to access those funds for over a week.  Initially, they claimed that this happened only because it was a new account.  However, when I made a second deposit and the same thing happened-- immediate access to $200 and the rest of the deposit would maybe be available in 7-10 days-- they then pointed me to the account agreement where it said that all deposits over $5525.00 would have a holding period of 7-10 days.  I totally understand that is their policy, I just want to warn any business owner that this bank is not interested in deposits and will treat you terribly when you question the policy.", "pics": null, "resp": null, "gmap_id": "0x8862657b8191d27b:0xae8532689482573a"}
{"user_id": "111182536688735190397", "name": "Stephen Hummel", "time": 1611933433947, "rating": 1.0, "text": "8 dollar check cashing fee for a 55 dollar check?  I will never accept a BB&T check from my customers ever again.", "pics": null, "resp": null, "gmap_id": "0x8862657b8191d27b:0xae8532689482573a"}
{"user_id": "107742638590284545876", "name": "Lexy Senft", "time": 1570035478656, "rating": 5.0, "text": "Just open up my account online today and came into deposit some cash. Monika was extremely friendly and efficient. I feel good about choosing to bank here!", "pics": null, "resp": null, "gmap_id": "0x8862657b8191d27b:0xae8532689482573a"}
{"user_id": "114696043768630445846", "name": "Izzy Heeger", "time": 1487349627503, "rating": 5.0, "text": "Employees are always super nice and helpful", "pics": null, "resp": null, "gmap_id": "0x8862657b8191d27b:0xae8532689482573a"}
{"user_id": "100534932514891249908", "name": "Jodie McKinley", "time": 1629134041623, "rating": 2.0, "text": "When I opened my checking and savings accounts, they were supposed to be linked so if in the event of an checking account overdraft, I would be only be charged a $5.00 fee to transfer needed funds. This did not happen and when I neglected to transfer funds from my savings to my checking before dropping $$$ at the DMV to renew our tags and purchase a new car tag and do some grocery shopping, I was charged $300 in OD fees even though I had adequate funds in my savings account to cover the transactions. This was all on ACU! It took three phone calls, two emails, and several weeks to get their mess straightened out because they \"needed to verify that they actually made a mistake\" and that it was not my fault the accounts were not initially linked. I was also told that they *may* not reimburse all the fees I was charged even though THEY made the error. Eventually I was reimbursed but while they took their time, I was out the funds they took from my account for over two weeks!", "pics": null, "resp": {"time": 1629145977271, "text": "We’re sorry you had to deal with that inconvenience, Jodie. We will look into this process and see what we can do to improve it moving forward."}, "gmap_id": "0x889a4d12653eda35:0xec036fd6fee4dcb8"}
{"user_id": "100919547994345324678", "name": "Anthony S", "time": 1598365991463, "rating": 1.0, "text": "Does not recommend. This isnt the little down home place it once was. As they’ve grown, they have become more like the big corporate banks i tried to stay away from. I have 2 car loans and checking/ savings with them. When i get back in town I’m looking transfer these account to, pretty much anywhere else.  In my experience, when inquiring about anything such as a loan, you dont talk with someone face to face. Filling out the paperwork online, you talk to someone over the phone who just happens to be in Alabama. And they do like to take their tome about it. Which was one of the reasons I didnt go with some out of state or online company; although in retrospect I’ve had better experiences with them.\nThe killer for me was today, when they denied me deferring a payment due to my father passing last week and being out of town for that. Which probably wouldn't bother me quite as bad (it was due prior to my request), but Avadian literally sent me an email 3 weeks ago telling me i could skip my August payment for the fun of it (See below)\n“You may be planning to spend the money on a trip, to make a surprise purchase, throw a birthday party, or just to build your savings, just send in the coupon by August 15, 2020. (Note: There is a $40 processing fee to skip your payment“", "pics": null, "resp": {"time": 1598369839738, "text": "We’re sorry to hear you’ve had a bad experience with us, Anthony. Could we have someone reach out to you and discuss this? If you would be so kind as to send us a private message with the best number and time, we’d like to get in touch."}, "gmap_id": "0x889a4d12653eda35:0xec036fd6fee4dcb8"}
{"user_id": "101747537385331184419", "name": "Robin Murray", "time": 1525584726416, "rating": 5.0, "text": "I’ve always preferred Credit Unions over big banks because they take the time to get to know their customers . Ive never had to worry about any problems too with anyone getting into my account or copying my card - these folks at Avadian catch problems before you , the consumer ever know what’s going on . And , if there’s anything remotely suspicious with your account , they will call you to verify purchases before they okay them .\n\nI’m so happy to be banking with the fine folks at Avadian Credit Union , formerly known as Alabama Telco Credit Union !!!\n\nThank you to each and every one of you that work so hard to keep our money safe . You are very important to me and I think you all do a much better job than any bank I’ve ever been with .\n\nRobin Murray", "pics": null, "resp": null, "gmap_id": "0x889a4d12653eda35:0xec036fd6fee4dcb8"}
{"user_id": "104779923250296202933", "name": "Ricky Duncan", "time": 1624429249375, "rating": 1.0, "text": "Slime", "pics": null, "resp": {"time": 1624429901153, "text": "Ricky, we hate to hear that you’ve had a bad experience. It’s difficult for us to improve if you don’t give us any further detail."}, "gmap_id": "0x889a4d12653eda35:0xec036fd6fee4dcb8"}
{"user_id": "106425808995098603395", "name": "Mrs.", "time": 1466113469454, "rating": 1.0, "text": "I have been with the bank owning just a savings account for almost 9 years. But I must say my experience today was deplorable!! The level of customer service I got today was as if this company was established in the ghetto. I was trying to get a fee of $30 removed from my savings account that a payment from my school loan for only $10 was rejected. I was passed to 5 different people all the way to the Trussville branch when I originally established my account at the Colonnade location. One of the ghetto women that I spoke to got extremely rude with me and hung the phone up in my face. First of all I never signed anything stating I agreed to overdraft fees on a savings account and 2nd of all why would you charge me $30 for a $10 rejected fee?? No one explained this to me in the whole almost 9 years that I have had this worthless account. I said to heck with it Im just going to close it...but noo not because of the $30 fee, but because of the level of customer service I got. I would not recommend this bank for savings or checking for that matter., They may be well on loans I do believe that. But I have gone ahead and changed all my deposits I have going into this account so that I can close it IMMEDIATELY!!! They are out of compliance and have predatory fees. Thanks AVADIAN. But your services will NEVER be needed again from me. Good Riddance.", "pics": null, "resp": null, "gmap_id": "0x889a4d12653eda35:0xec036fd6fee4dcb8"}
{"user_id": "117391671372413098311", "name": "Victoria Wilson", "time": 1487712741788, "rating": 5.0, "text": "Personal service", "pics": null, "resp": {"time": 1513882015463, "text": "Thank you for the review Victoria!"}, "gmap_id": "0x889a4d12653eda35:0xec036fd6fee4dcb8"}
{"user_id": "100138490828680571378", "name": "gina vines", "time": 1492027413963, "rating": 5.0, "text": "Best bank I've ever dealt with.  Super friendly and helpful staff. I'd recommend to everyone!", "pics": null, "resp": null, "gmap_id": "0x88899df0db9f8a17:0xf317f4c09919bbe7"}
{"user_id": "110474088611273945917", "name": "CHRISTY Rhinehart-Shaw temp.", "time": 1496832164991, "rating": 5.0, "text": "Very Friendly employees, clean very knowledgeable of what you may need for your financial future", "pics": null, "resp": null, "gmap_id": "0x88899df0db9f8a17:0xf317f4c09919bbe7"}
{"user_id": "106610096191381254723", "name": "TNT", "time": 1519930691322, "rating": 1.0, "text": "Customer service is pretty bad, on top of that they are kind of pregidous, been banking for last 15 years, bank changed names 3 or 4 times, but this particular company that took over is the worst I've seen, not the only one who thinks so, just ask anyone who banks at the Springville branch...", "pics": null, "resp": null, "gmap_id": "0x88899df0db9f8a17:0xf317f4c09919bbe7"}
{"user_id": "112312375103995500211", "name": "Omar Sotelo", "time": 1559694430796, "rating": 5.0, "text": "(Translated by Google) Great service\n\n(Original)\nGran servicio", "pics": null, "resp": null, "gmap_id": "0x88899df0db9f8a17:0xf317f4c09919bbe7"}
{"user_id": "107318915672795521686", "name": "Jeff king", "time": 1620007010362, "rating": 4.0, "text": "I have not had to go into this location for a long while, even before COVID locked the doors. I have never had a bad experience with the staff here.", "pics": null, "resp": {"time": 1620007769848, "text": "Thank you for the 4 star review, Jeff! Is there anything else we could do to make this a five star? We are always looking to improve!"}, "gmap_id": "0x88893faadd58a537:0x34c2c048fd1443cd"}
{"user_id": "102479918787228247793", "name": "Josh Taylor", "time": 1609445793135, "rating": 1.0, "text": "I don’t normally complain about local businesses but I’ve about had enough of being nickel and dimed from Avadian Credit Union. My wife and I both have separate accounts with them and have had mortgages and car loans. We sold our house and moved last April and unbeknownst to us have been getting charged an incorrect address fee every month ever since. Strange thing is that the new house that we built was financed through Avadian as well so they obviously have our current address. We rarely use that account as a primary checking so it went unnoticed this entire time.  This is not the first time we have gotten these types of fees as well as inactivity fees from Avadian. Just posting this so that other folks can hopefully avoid similar situations with a credit union that does business in this fashion.", "pics": null, "resp": {"time": 1609446509418, "text": "We are sorry you feel this way Josh. It’s important for us to have a current address on file so that we do not send important information to an address where someone else currently resides. Have you gotten the current address added to the account? We would like to make sure this is resolved."}, "gmap_id": "0x88893faadd58a537:0x34c2c048fd1443cd"}
{"user_id": "104913358899520757674", "name": "it's me T “Its me T” Bux", "time": 1489675751878, "rating": 3.0, "text": "There is one teller here that is great, but without her this credit union is nothing. I bank with credit unions for their hospitality to the local community. This one is truly lacking.", "pics": null, "resp": null, "gmap_id": "0x88893faadd58a537:0x34c2c048fd1443cd"}
{"user_id": "104881803466518554097", "name": "Jodie Mitchell", "time": 1561579470221, "rating": 5.0, "text": "Every time I've ever visited this branch everyone is always super friendly and helpful. Kristen Johnson is a rock star.", "pics": null, "resp": {"time": 1561580159510, "text": "Thank you so much for the review Jodie! We hope you have a delightful afternoon!"}, "gmap_id": "0x88893faadd58a537:0x34c2c048fd1443cd"}
{"user_id": "101728735864970687423", "name": "Cathy Nassef", "time": 1499177478482, "rating": 4.0, "text": "I feel part of a family, the employees are very friendly and helpful. I do not like that they are not open on Saturday.", "pics": null, "resp": {"time": 1500555659016, "text": "Thank you for the review, Cathy! We actually\nhave three locations open on Saturday. Greystone, Hoover, and Trussville are all open from 9am-12pm on Saturdays."}, "gmap_id": "0x88893faadd58a537:0x34c2c048fd1443cd"}
{"user_id": "100111513357275004812", "name": "John Smith", "time": 1548039356107, "rating": 5.0, "text": "Avadian Credit Union has treated me well have nothing but good things to say about them!", "pics": null, "resp": {"time": 1548090709520, "text": "Thank you for the review and the kind words John! We are delighted to have you as a member!"}, "gmap_id": "0x88893faadd58a537:0x34c2c048fd1443cd"}
{"user_id": "111411991453701932976", "name": "Holly Thornton", "time": 1350583077427, "rating": 3.0, "text": "This is not the correct directions & takes you to a Coosa Pines Credit Union. Alatelco is about 2 miles pass this on the right.", "pics": null, "resp": null, "gmap_id": "0x88893faadd58a537:0x34c2c048fd1443cd"}
{"user_id": "116423891130506945964", "name": "Angela Forsyth", "time": 1596516307399, "rating": 5.0, "text": "Jeremy took plenty of time to clearly explain what was available to my family and me financially. He answered many questions and was patient and courteous. I strongly recommend if you want to make a plan for your future, contact him.", "pics": null, "resp": null, "gmap_id": "0x888917da2e418423:0xe22d106668f1c54e"}
{"user_id": "103687320729116289033", "name": "Josie Nguyen", "time": 1585791933092, "rating": 5.0, "text": "Jemery is Amazing!! I would recommend him to anyone looking to invest in their portfolio. A++!!", "pics": null, "resp": null, "gmap_id": "0x888917da2e418423:0xe22d106668f1c54e"}
{"user_id": "110374953291574173943", "name": "Joel Brandon Smith", "time": 1539366642336, "rating": 5.0, "text": "Jeremy and his crew go the extra mile.  They went out of their way to  help me pin down a better future.  Jeremy is genuine and honest.  He doesn't mind explaining products to you in order to help you make the best decision.  I would recommend him to my fellow educators.", "pics": null, "resp": null, "gmap_id": "0x888917da2e418423:0xe22d106668f1c54e"}
{"user_id": "104234398822980766998", "name": "PAC Properties", "time": 1528837557209, "rating": 5.0, "text": "Jeremy helped me get the right plan set up for my business and reduced my taxable income while I put back money for my own retirement. Very thankful for his knowledge!", "pics": null, "resp": null, "gmap_id": "0x888917da2e418423:0xe22d106668f1c54e"}
{"user_id": "104718467736089430238", "name": "Kristy Stewart", "time": 1531352135000, "rating": 5.0, "text": "Jeremy and Karen are awesome!! Easy, efficient and they are very knowledgeable of their products!! Both are very personable and made me feel like family while handling all my question and investment needs from day one!!", "pics": null, "resp": null, "gmap_id": "0x888917da2e418423:0xe22d106668f1c54e"}
{"user_id": "108592371815189398498", "name": "brandon jones", "time": 1528898740417, "rating": 5.0, "text": "Jeremy has been a trusted advisor for many years now. He has helped my family invest our money for the future. We are now saving for retirement and have college account for our children. We highly recommend calling and talking to Katy or Karen to schedule an appointment so they can help you as well!", "pics": null, "resp": null, "gmap_id": "0x888917da2e418423:0xe22d106668f1c54e"}
{"user_id": "101424366313704124857", "name": "Natalie Glover", "time": 1542988116871, "rating": 5.0, "text": "Jeremy assisted me with consolidating insurances and showing me all of the upgrades within one or two\ninsurances that is beneficial for my family which provided more benefits for us.\n\nHe is very knowledgeable, patient, and friendly.", "pics": null, "resp": null, "gmap_id": "0x888917da2e418423:0xe22d106668f1c54e"}
{"user_id": "117323853860924785019", "name": "Diana Edwards", "time": 1534448895318, "rating": 5.0, "text": "Jeremy Young is very passionate and brilliant young man who helped me understand how to improve my finances. I'm very grateful for him!", "pics": null, "resp": null, "gmap_id": "0x888917da2e418423:0xe22d106668f1c54e"}
{"user_id": "103530594201796219013", "name": "Kawanda Calloway", "time": 1536245259242, "rating": 5.0, "text": "Jeremy is great!! He's helped me with great policies that will last a lifetime and save me money!!", "pics": null, "resp": null, "gmap_id": "0x888917da2e418423:0xe22d106668f1c54e"}
{"user_id": "112399465515476064534", "name": "Donnesha L", "time": 1539365003986, "rating": 5.0, "text": "Very helpful and professional, super friendly. Great company to work with.", "pics": null, "resp": null, "gmap_id": "0x888917da2e418423:0xe22d106668f1c54e"}
{"user_id": "105946088375135839284", "name": "felicia howard", "time": 1545235249101, "rating": 5.0, "text": "Jeremy was very professional and helpful!  Please check him out for all of your financial advisory needs.", "pics": null, "resp": null, "gmap_id": "0x888917da2e418423:0xe22d106668f1c54e"}
{"user_id": "111293904098322343935", "name": "Daniella Sanders", "time": 1528386436869, "rating": 5.0, "text": "Mr. Young has me all set up for retirement! Excellent clientele services!", "pics": null, "resp": null, "gmap_id": "0x888917da2e418423:0xe22d106668f1c54e"}
{"user_id": "113612754335688788319", "name": "Erin Walker", "time": 1547071782468, "rating": 5.0, "text": "Jeremy is very helpful! Very knowledgeable!", "pics": null, "resp": null, "gmap_id": "0x888917da2e418423:0xe22d106668f1c54e"}
{"user_id": "109473319644660062010", "name": "ALFRED GBARGAYE", "time": 1533155272967, "rating": 5.0, "text": "Beyond my expectations! Awesome service for basically all your financial needs.", "pics": null, "resp": null, "gmap_id": "0x888917da2e418423:0xe22d106668f1c54e"}
{"user_id": "116246699881498347095", "name": "Sarah Cahela", "time": 1539365083887, "rating": 5.0, "text": "Jeremy has made saving for the future easy and understandable!", "pics": null, "resp": null, "gmap_id": "0x888917da2e418423:0xe22d106668f1c54e"}
{"user_id": "111762058572097698539", "name": "Adriane Howard", "time": 1542817418941, "rating": 5.0, "text": "Jeremy is a very thorough agent!", "pics": null, "resp": null, "gmap_id": "0x888917da2e418423:0xe22d106668f1c54e"}
{"user_id": "103469877113959446892", "name": "ANGELIA GBARGAYE", "time": 1533155349507, "rating": 5.0, "text": "Excellent service for financial needs.", "pics": null, "resp": null, "gmap_id": "0x888917da2e418423:0xe22d106668f1c54e"}
{"user_id": "113676922110865983843", "name": "Alba Rivera McEwen", "time": 1539614700803, "rating": 5.0, "text": "(Translated by Google) Jeremy was very professional and friendly. I recommend it! Sunrise\n\n(Original)\nJeremy fue muy profesional y amigable. Se los recomiendo! Alba", "pics": null, "resp": null, "gmap_id": "0x888917da2e418423:0xe22d106668f1c54e"}
{"user_id": "111862924352859551048", "name": "Shylo White", "time": 1490391335757, "rating": 1.0, "text": "I used to love this bank but recently they got new employees that seem to want to make everything difficult. It's a struggle to deposit checks, their window clearly states if you have MORE than 3 transactions come inside yet when you have 3 transactions they deny you at the window because they don't want to deal with it and I've tried probably 15 times to add my husband to my account and every time they tell me they're too busy and I can't make an appointment. Ugh!", "pics": null, "resp": null, "gmap_id": "0x888e3dcd5b025603:0x6e18da4d246b3666"}
{"user_id": "115006089306168360317", "name": "Lauren Stinson Gilman", "time": 1556920517853, "rating": 1.0, "text": "I would give zero stars if I could. Cindy was very unhelpful & would not assist me. I will be closing all my BB&T accounts.", "pics": null, "resp": null, "gmap_id": "0x888e3dcd5b025603:0x6e18da4d246b3666"}
{"user_id": "107104160488181744469", "name": "Shekita McGary", "time": 1553654153249, "rating": 5.0, "text": "Awesome,Friendly, Quick Customer Service!!!🤗", "pics": null, "resp": null, "gmap_id": "0x888e3dcd5b025603:0x6e18da4d246b3666"}
{"user_id": "106889816728629286135", "name": "Laron Hardy", "time": 1456235022073, "rating": 5.0, "text": "David Burt is someone who has been helping me manage my financial affairs for years.  He is trustworthy and has always gone above and beyond when it comes to my financial future.  He never makes recommendations unless he is sure that it will benefit me.  I sleep good at night knowing he's helping me make the right decisions.", "pics": null, "resp": null, "gmap_id": "0x88628461181cca03:0x9e8ed2881e442441"}
{"user_id": "105445178967633516760", "name": "India Irwin", "time": 1491573738831, "rating": 5.0, "text": "David is so attentive, hard working, easy to work with, and always goes above and beyond!", "pics": null, "resp": null, "gmap_id": "0x88628461181cca03:0x9e8ed2881e442441"}
{"user_id": "117787153001486381790", "name": "Martha Segura", "time": 1595537235343, "rating": 5.0, "text": "(Translated by Google) Excellent Professional, he gave me the best advice to obtain my retirement plan ... covering all expectations and ensuring me with an excellent company! I recommend it 100%\n\n(Original)\nExcelente Profesional , me brindo la mejor asesoria para obtener mi plan de retiro ... cubriendo todas las expectativas y Asegurandome con una excelente compañía! Lo recomiendo 100%", "pics": null, "resp": null, "gmap_id": "0x88dd83e2e686c927:0x5544d3cc73bbe228"}
{"user_id": "106682992987652890552", "name": "Harold Escudero", "time": 1607901128874, "rating": 5.0, "text": "(Translated by Google) Very professional and flexible in consultation hours\n\n(Original)\nMuy professional y flexible en horario de consulta", "pics": null, "resp": null, "gmap_id": "0x88dd83e2e686c927:0x5544d3cc73bbe228"}
{"user_id": "116558646043542068850", "name": "Milena Arroyo de Amador", "time": 1580826244911, "rating": 5.0, "text": "(Translated by Google) Excellent in his responses, we feel supported every time we call him to attend to our concerns and needs, when my son had been injured, he does not hesitate to guide us and with great disposition and listening. A very important plus as far as Quality of Service is concerned and if it is in the area of ​​Health, (as in this case) much more.\nQuality Consulting!\nContinue like this\n100% recommended\n\n(Original)\nExcelente en sus respuestas, nos sentimos respaldados cada vez que lo llamamos para atender a nuestras inquietudes y necesidades, cuando mi hijo se había lesionado  , no dudo en guiarnos y con gran disposición y escucha. Un plus muy importante por cuanto a Calidad de Servicio se refiere y si es en el area de la Salud, (como en este caso) muchísimo más.\nAsesoría de Calidad!\nContinua  así\nRecomendado al 100%", "pics": null, "resp": null, "gmap_id": "0x88dd83e2e686c927:0x5544d3cc73bbe228"}
{"user_id": "114463993796821957935", "name": "Israel Cruz", "time": 1595648083858, "rating": 5.0, "text": "(Translated by Google) Mr Asdrubal and his wife did an excellent job with my life insurance and the best thing about it is that it is always available for any questions or help that one needs, I recommend them\n\n(Original)\nEl Sr Asdrubal y su esposa hicieron  un trabajo excelente con mi seguro de vida y lo mejor que tiene es que siempre está disponible para cualquier duda o ayuda que uno necesite, se los recomiendo", "pics": null, "resp": null, "gmap_id": "0x88dd83e2e686c927:0x5544d3cc73bbe228"}
{"user_id": "113339568494810431796", "name": "Jose Gotera", "time": 1596407668223, "rating": 5.0, "text": "(Translated by Google) An excellent Agent very professional thank you Mr. Asdrubal for your help and excellent advice 👍👍👍👍\n\n(Original)\nUn excelente Agente muy profesional gracias Señor Asdrubal por su ayuda y excelentes consejos 👍👍👍👍", "pics": null, "resp": null, "gmap_id": "0x88dd83e2e686c927:0x5544d3cc73bbe228"}
{"user_id": "116690398432304254487", "name": "Yoney Rm", "time": 1580744927960, "rating": 5.0, "text": "(Translated by Google) Excellent attention and service, with a lot of ethics and professionalism through the prompt and timely response to my need, presented in a timely manner.\nKeep it up, the quality of service makes the difference!\nGod bless you!!\n\n(Original)\nExcelente atención y servicio, con mucha ética y profesionalismo a través de la pronta y oportuna respuesta a mi necesidad, presentada oportunamente.\nContinúen así, la calidad del servicio marca la diferencia!\nDios les bendiga!!", "pics": null, "resp": {"time": 1580745478975, "text": "(Translated by Google) Thank you very much We do it for our Clients. Amen\n\n(Original)\nMuchas Gracias Hacemos lo para nuestros Clientes. Amen"}, "gmap_id": "0x88dd83e2e686c927:0x5544d3cc73bbe228"}
{"user_id": "109826188584359388851", "name": "Nashalee Cambrelen", "time": 1567705236304, "rating": 5.0, "text": "(Translated by Google) I found an excellent retirement plan. They are well trained and explain everything to you. Very good service. Recommended to all.\n\n(Original)\nEncontré un plan de retiro excelente. Están bien capacitados y te explican todo. Muy buen servicio. Recomendado a todos.", "pics": null, "resp": null, "gmap_id": "0x88dd83e2e686c927:0x5544d3cc73bbe228"}
{"user_id": "110700283097032696616", "name": "Kristian Castillo", "time": 1593090009774, "rating": 5.0, "text": "(Translated by Google) Very good service I understood everything they educated me and I chose the best retirement plan with multiple additional benefits that I could not find anywhere else thanks for your help very professional people 100% recommended\n\n(Original)\nMuy buen servicio todo lo entendí me educaron y escogí el mejor plan de retiro con múltiples beneficios adicionales que no encontraba en ningún otro lugar gracias por su ayuda personas muy profesionales 100% recomendados", "pics": null, "resp": null, "gmap_id": "0x88dd83e2e686c927:0x5544d3cc73bbe228"}
{"user_id": "105670257737532364324", "name": "John Parker", "time": 1602711114866, "rating": 1.0, "text": "The branch manager Jerhlyn (or however it could be spelled) lied repeatedly to me. One example is that a 'permanently closed account' could be reopened with a charge. This is false. These people are incompetent and liars.", "pics": null, "resp": null, "gmap_id": "0x8889197b74ce80e7:0x7c2e39e5efa1e18"}
{"user_id": "106309476812678915117", "name": "Trevor Sealy", "time": 1601482932625, "rating": 1.0, "text": "Go to regions these people operate like it’s 1979.", "pics": null, "resp": null, "gmap_id": "0x8889197b74ce80e7:0x7c2e39e5efa1e18"}
{"user_id": "108536426129830155556", "name": "Lee Hill", "time": 1423261411910, "rating": 1.0, "text": "rude", "pics": null, "resp": null, "gmap_id": "0x8889197b74ce80e7:0x7c2e39e5efa1e18"}
{"user_id": "106605833307717589470", "name": "Scott Finney", "time": 1569777303248, "rating": 5.0, "text": "Talk to Wesley Coody at C Squared Wealth Strategies. Wes has helped me navigate all the financial planning options to feel confident in the future. C2 financial advisory firm is the best Financial Planner for individuals, couples, families, and businesses. Thank you Wes for all the personalized help you have provided over the years and thank you in advance for the future help as the market and my needs change. Updating my review. Wes and I had our 2019 in person financial plan review. Get C Squared to look at your plan. It's nice to feel confident in the updates being made to my account that are in my best interest for the future. Thank you Wes!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP8ZF6bvw70bQKNG8RGK0KyBNjFkenDmYKhKGp6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOtFquqESA3sksw1hc1h6_qNjGG1oc81BaW_7GT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPgB_9RzHpWHRrM0p6l23hb5LrT7oT6YmFIjR3B=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMdL0njMpCBlzhxbr-_geK_PeQABSAtZA4RHgFM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOR2c8LG-aa-rIeYmIWJd7dmaYtmpyfXwjsoNB3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO0yQ8HBu6Du97Rd_BQ_7egZEybzBoisR56ahrW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO1mdxfLLdGOW_Rygy0NBpsawmyRhCG2x9MzRkA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMi1c5HDv6mKcQ1n1rHVo1ScHfLrlVKGoJZ9qiY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOMg_tqXB8KzK9VKzh4csClBuvctaYBHBw4ee90=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMwJdVWanBRIIxdnWJHW3tSGTDEAfY1CBbynUPZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPEfrWWmWLek6eCH9m7p5BCwhNRYWXGUZdjJ1AQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPmoaAGAy42Dn3AnmX51rRb4z7Cpz5EnMQZbkHP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNl7m6ocIoQ4lgWG3_NPApMojBSUz-PclrGHXiE=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4df1d1dce645:0x54a98fe711c3b502"}
{"user_id": "114541501040020646552", "name": "Josh Null (Gulf Coast Finc. Advisors)", "time": 1574868942795, "rating": 5.0, "text": "Wes and his team are honest & dedicated to their client's success!", "pics": null, "resp": null, "gmap_id": "0x889a4df1d1dce645:0x54a98fe711c3b502"}
{"user_id": "103441315738920091893", "name": "Jonathan McConnell", "time": 1531238746090, "rating": 5.0, "text": "Sharp group of financial minds housed just off Dauphin Street.  Wes focuses on a comprehensive strategy that are going to meet your wealth goals.", "pics": null, "resp": null, "gmap_id": "0x889a4df1d1dce645:0x54a98fe711c3b502"}
{"user_id": "106558323871133261630", "name": "Kayla Mims", "time": 1533563386144, "rating": 5.0, "text": "Shane is great to work with! He is customer oriented and always available whenever he is needed, and if needed he would give you the shirt off his back! Couldn't ask for a better agent!", "pics": null, "resp": null, "gmap_id": "0x888ec63063741d9f:0x2c833905a1819f11"}
{"user_id": "114831952638220557488", "name": "ken linton", "time": 1529073728607, "rating": 1.0, "text": "Our car was hit by a country financial customer . It's been 12 days and no help from them to get our car fixed . Looks like I will have to use my own insurance company to get our car fixed . They never answer their questions phone calls .", "pics": null, "resp": null, "gmap_id": "0x888ec63063741d9f:0x2c833905a1819f11"}
{"user_id": "116799254521220437376", "name": "Eric Chase Stewart", "time": 1470172144487, "rating": 5.0, "text": "Shane is awesome to work with", "pics": null, "resp": null, "gmap_id": "0x888ec63063741d9f:0x2c833905a1819f11"}
{"user_id": "106276702774166680149", "name": "Abby McNeil", "time": 1621269499269, "rating": 3.0, "text": "They are normally very friendly , and I like This bank and have been a member 9 years , but I stood inside and waited to make a deposit for what seemed like forever and no one ever came to the front . They were too busy with people in the drive thru they never even acknowledged me . I had to get back in my car and go through the drive thru to get any service , and when I got there had to wait too.  The lady working needs help as it seemed  she was the only one working . She told me in the drive thru next time I was in the lobby I needed to yell hello to get somebody to come to the front .", "pics": null, "resp": {"time": 1621270568535, "text": "Thank you for sharing your feedback, Abby. We apologize for the wait times. We will look into this and see what we can do to get this branch some help."}, "gmap_id": "0x8892937b73d4e391:0xac96a50248022594"}
{"user_id": "110516308989361562006", "name": "Rich Oros", "time": 1565803048706, "rating": 1.0, "text": "Worst financial institution that I have ever had the displeasure of doing business with. Paid my truck off almost 3 months ago. The credit union acknowledges a zero balance. They will not provide me with a title (they lost it), or even a payoff letter that has the necessary information on it so I can pay for replacement title.  Again, almost three months later and I still can't get them to DO THEIR JOBS......", "pics": null, "resp": {"time": 1565804453629, "text": "Mr. Oros, we sent your title on 6/18. You paid it off on 6/3. You didn’t let us know you had not received it until\nyesterday. We prepared the title and mailed it again this morning. You should have it shortly."}, "gmap_id": "0x8892937b73d4e391:0xac96a50248022594"}
{"user_id": "105840973100370045786", "name": "Pamela Myers", "time": 1583188101255, "rating": 5.0, "text": "Very friendly, great customer service.", "pics": null, "resp": {"time": 1583191768490, "text": "Thank you so much for the five star review! Have a delightful evening!"}, "gmap_id": "0x8892937b73d4e391:0xac96a50248022594"}
{"user_id": "118414542833012231179", "name": "Ashley Smith", "time": 1567534402205, "rating": 1.0, "text": "Put a morning deposite in at 730 still has not been put in my account by 1:10 PM suppose to be put in there by 10 can not get a hold of anybody at the branch they do not answer phones also not the first time this has happened.", "pics": null, "resp": {"time": 1567535683193, "text": "We apologize for that delay Ashley. Would you like us to have someone reach out to you? How did you make your deposit?"}, "gmap_id": "0x8892937b73d4e391:0xac96a50248022594"}
{"user_id": "101152464444103544251", "name": "Racheal Muccio", "time": 1523217181032, "rating": 5.0, "text": "Friendly customer service. Fast and efficient.", "pics": null, "resp": null, "gmap_id": "0x8892937b73d4e391:0xac96a50248022594"}
{"user_id": "104562335865829379276", "name": "faye douglas", "time": 1622143878670, "rating": 1.0, "text": "I hate banking with them. Going to change as soon as I can", "pics": null, "resp": null, "gmap_id": "0x88927dd38ba2140d:0x715fb9562c7df200"}
{"user_id": "105880531680022352169", "name": "B Blaxton", "time": 1578082117290, "rating": 2.0, "text": "Very poor customer service. I had a business checking account. On separate occasions, the tellers didn’t have enough cash on hand so I had to take a check from their bank to another to get enough cash for what I needed out of my checking account. Tellers made it cumbersome and difficult for my employees to cash their payroll checks (a BB&T check with ID at their branch).  When another bank I use made it easy for them to cash their (BB&T, a competitor’s) checks I wrote them from my BB&T account, I moved my account elsewhere. I can understand why they had to close their Dothan branch.\n\nTheir online banking was easy to use and robust but the local service couldn’t be much worse.", "pics": null, "resp": null, "gmap_id": "0x88927dd38ba2140d:0x715fb9562c7df200"}
{"user_id": "106109653360779792274", "name": "Mary Mary", "time": 1523913508647, "rating": 1.0, "text": "I understand \"privacy rules \" but seriously.... I'm calling about my info....and they can't guarantee its me?  Who else wants to pay off my car loan??  What a joke.  Then they want to \"fax\" everything....no one has heard of doing it online i guess.  I even have an online account for the car loan...if they were so worried about security etc wouldn't they send the info i need via their online app?  Guess not...rather be difficult than helpful.  Thats ok though... i see how they gonna be.", "pics": null, "resp": null, "gmap_id": "0x88927dd38ba2140d:0x715fb9562c7df200"}
{"user_id": "103262724936015812997", "name": "Dianne Henderson", "time": 1375903155034, "rating": 5.0, "text": "The best customer service! Always ready to help in any way that they can.", "pics": null, "resp": null, "gmap_id": "0x88927dd38ba2140d:0x715fb9562c7df200"}
{"user_id": "111250699985696978694", "name": "Richard Carver", "time": 1499121189318, "rating": 1.0, "text": "Rude, unprofessional and will be moving our accounts from this bank. Customer service is below standard. Tellers need a class in customer service .", "pics": null, "resp": null, "gmap_id": "0x88927dd38ba2140d:0x715fb9562c7df200"}
{"user_id": "109906927478311555092", "name": "C Hudson", "time": 1586462198336, "rating": 4.0, "text": "Super friendly and easy to deal with.  I took off one star because I could never get the banking app to work.", "pics": null, "resp": null, "gmap_id": "0x8889238b587acc5b:0x71e44c9e39f4da60"}
{"user_id": "103827702947547463175", "name": "Vance DeVane", "time": 1590537005207, "rating": 1.0, "text": "Do not use this firm to manage your money. Other firms in town are much more competent and honest. Stay away!", "pics": null, "resp": null, "gmap_id": "0x888cf2c631d4e1f5:0x457bcd7fd9ad817a"}
{"user_id": "102439746651400512336", "name": "Kyle Donaghey", "time": 1583864560950, "rating": 5.0, "text": "Excellent people to work with, very responsive to all call and emails and everyone is very good at explaining and simplifying investing principles and ideas. I have recommended them to family and friends", "pics": null, "resp": null, "gmap_id": "0x888cf2c631d4e1f5:0x457bcd7fd9ad817a"}
{"user_id": "105946262325231529260", "name": "venus9 Cotton", "time": 1597338119680, "rating": 5.0, "text": "Great Customer service and responsible", "pics": null, "resp": null, "gmap_id": "0x888cf2b1a9bdc62d:0x4559e040ec9d2845"}
{"user_id": "117382208721356668700", "name": "Kimberly Mooney", "time": 1588278016819, "rating": 2.0, "text": "I go to that bank not often.....the new teller....a man....RUDE....not friendly....the teller usually are very friendly....him..,he needs more training....I will not bank there again...", "pics": null, "resp": null, "gmap_id": "0x888cf2b1a9bdc62d:0x4559e040ec9d2845"}
{"user_id": "109888943500419765301", "name": "David Miller", "time": 1627320452231, "rating": 5.0, "text": "Highly recommend Chad Richey. He's very professional, knows what he's talking about and always takes my calls.", "pics": null, "resp": null, "gmap_id": "0x888917bf09bf291f:0x456cf090bedeb9b5"}
{"user_id": "104433811487124370091", "name": "Drew Wood", "time": 1620589589611, "rating": 5.0, "text": "Wendy Baker at First Federal Mortgage made the lending process so easy. I was able to get a great rate, she listened,  she answered my concerns, and assured me that we were headed in the right direction. I’ve bought 9 homes and this was definitely the easiest Closing that I have ever had. Thanks Wendy!", "pics": null, "resp": null, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "101713515188813990186", "name": "David Weaver", "time": 1620597793850, "rating": 5.0, "text": "We had a great experience with John Marbury. We were looking for a low rate with low out costs, and we wanted to do business with an Alabama firm.  John was able to beat the best offer we brought him from a national vendor and we closed quickly with little hassle. Great overall experience.", "pics": null, "resp": null, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "101024708210215805102", "name": "Chase Quinn", "time": 1615296496876, "rating": 5.0, "text": "I recently purchased my first home and went through First Federal Mortgage for my loan. Gloria Jackson went above and beyond to see the process went as smoothly and efficiently as possible. I simply cannot say enough good things about how she made entire process stress free and would absolutely advise anyone seeking a home loan to make First Federal Mortgage their first choice when searching.", "pics": null, "resp": null, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "114517911513425071749", "name": "megan wang", "time": 1611415328827, "rating": 5.0, "text": "Rachel Trowbridge is just awesome!! We had so many questions in the mortgage application and she’s always patient and respond quickly. She did not only help us find the best rate, but also make the process smooth and easy. She’s very reliable and trustworthy. Whenever I have a question, she’s always there! Strongly recommend and I’ll go back to her again in the future.", "pics": null, "resp": null, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "114381617565305428799", "name": "baily anderson", "time": 1615901410014, "rating": 5.0, "text": "I enjoyed working with Gloria Jackson while buying our home. She was available to talk everyday and very helpful in letting us know the next steps and what needed to be done. She was also very open about due dates and how it all worked if we went to long without closing", "pics": null, "resp": null, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "112334142272558503725", "name": "Dale Bolena", "time": 1615726095710, "rating": 5.0, "text": "Gloria was extremely helpful during the loan process. She kept us up to date and on time with all the moving parts of the loan process. I highly recommend Gloria Jackson!", "pics": null, "resp": null, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "118070804038237164390", "name": "Kelsey Justice", "time": 1619019865020, "rating": 5.0, "text": "I have worked with John Marbury for two house buying processes and he has been great. Very helpful and responsive.", "pics": null, "resp": null, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "106032989086422055570", "name": "Kristin Tidwell", "time": 1611251362433, "rating": 5.0, "text": "I would recommend this company over and over!  Rachel Trowbridge was awesome to work with.  I felt informed throughout the entire process.  Rachel works on solutions to get the loan closed!  You can tell she really cares about her customers!", "pics": null, "resp": null, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "115113116963053737056", "name": "Roberto Avalos", "time": 1614161486008, "rating": 5.0, "text": "Hi there, Gloria Jackson help me a lot during my house buy off, as a Mexican living temporary in USA it was more beneficial to invest in a house mortgage that keep paying rent. Entire process was very easy and fully supported by FFM. Thanks a lot.", "pics": null, "resp": null, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "116019577031972108999", "name": "Lawrence Hawkins", "time": 1611249599877, "rating": 5.0, "text": "Absolutely a Great Experience. If you need any help in purchasing a New Home, Rachael Trowbridge with First Federal is the way to go. Made the entire process seamless.", "pics": null, "resp": null, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "113363777553261925936", "name": "Marcia Pidcock", "time": 1626812797341, "rating": 5.0, "text": "We love working with Wendy Baker at First Federal Mortgage!", "pics": null, "resp": null, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "105043468742288727333", "name": "Tint Pro", "time": 1568403967659, "rating": 5.0, "text": "After having two loan officers tell my wife and I we could not get our dream home and wasting over 2 weeks of our time, we were referred to Wendy Baker. She absolutely made it happen! We are so grateful for her and her teams dedication to excellence. We will refer everyone we know to her!", "pics": null, "resp": null, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "111077916986710187785", "name": "Allie Hudson", "time": 1468594945792, "rating": 5.0, "text": "My husband and I bought our first home in May, and KC was highly recommended to us by our realtor. I am so glad we went with KC and First Federal for our mortgage. KC was extremely helpful, professional, timely, and was always willing to thoroughly answer any question I may have had. As a first time home buyer, this was huge and extremely important to my husband and I that we have someone who would be willing to walk us through every step of the process. KC did just that and more. He truly went above and beyond what we expected from our loan officer, and we are so thankful our realtor recommended him!", "pics": null, "resp": {"time": 1510170870630, "text": "Thank you! We are so glad we got to be a part of your First home buying experience!"}, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "110742820178943311755", "name": "Laura Gooch", "time": 1489178738144, "rating": 5.0, "text": "KC was awesome.  He always made us feel like we were his only customer and was never bothered by our questions. He was very informative and was very willing to educate is through the process. He was with is every step of the way. He found a program perfect for our needs. I would recommend his services to anyone.", "pics": null, "resp": {"time": 1510167765159, "text": "Thank you for the kind words!"}, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "107420258713099735242", "name": "Dorothy Ewing", "time": 1475765429241, "rating": 5.0, "text": "Gloria Jackson was knowledgeable and easy to work with.  We felt like she cared about us as people and we were not just another mortgage.  She attended our closing as well to make sure everything was perfect.  I would recommend Gloria to anyone.", "pics": null, "resp": {"time": 1510167838429, "text": "Thank you! We always try to be there every step of the way to make the mortgage experience a good one!"}, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "114279626030798043256", "name": "Ben Chamblee", "time": 1468438065983, "rating": 5.0, "text": "My wife and I moved into our first home just over a month ago. Our realtor recommended KC, and I'm so glad she did! KC was courteous, effective, and just overall great to work with. He answered every question we had, and did so in a simple way. He was able to get us the best rate! And closing wasn't pushed back at all. I would highly recommend KC for anyone's mortgage needs!", "pics": null, "resp": {"time": 1510171059068, "text": "Thank you! We pride ourselves on making the loan process as smooth as possible."}, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "104138663079846441876", "name": "Steven Gerding", "time": 1471640477945, "rating": 5.0, "text": "Gloria Jackson at First Federal Mortgage is amazing.  We have used her for both of our mortgages.  Recently we bought a house and our buyer backed out at the last minute.  We were fortunate enough to get another buyer immediately.  Gloria did not miss a beat.  Use and the buyer wanted to close quickly and Gloria made it happen.  I have had many friends who have used other lenders and had problems.  I always recommend Gloria especially for anyone using a VA home loan.  I would highly recommend Gloria.", "pics": null, "resp": {"time": 1510170450092, "text": "Thank you Steven it was a pleasure working with you as well!"}, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "114792807043412186339", "name": "Chanda Mitchell", "time": 1498247033800, "rating": 5.0, "text": "Thanks to Carmel  and Carol! We have bought two houses using First Federal and both times we got excellent rates. The loan officer and underwriting were very easy to work with and I would highly recommend them to anyone buying a home.", "pics": null, "resp": {"time": 1510167665554, "text": "Thank you! It was our pleasure to work with you as well!"}, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "106581143634746827668", "name": "Katie Roy", "time": 1470933239235, "rating": 5.0, "text": "Our realtor recommended First Federal Mortgage and Gloria Jackson. My husband and I just bought our first home and she was there helping us with our questions the entire way. She was very helpful and informative and keep me up-to-date when I needed to complete paperwork. I would highly recommend using Gloria Jackson and First Federal Mortgage.", "pics": null, "resp": {"time": 1510170769289, "text": "Thank you Katie! It was great working with you as well!"}, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "116767434896222976434", "name": "cky8706", "time": 1468461181664, "rating": 5.0, "text": "I decided it was time to buy my first house so I asked around and heard good things about First Federal Mortgage. KC was my mortgage guy and he was very knowledgeable and good at his job. Everything went through very well. I was very happy with everything. I'd definitely recommend First Federal Mortgage to anyone looking for a house.", "pics": null, "resp": {"time": 1510170968446, "text": "Thank you!"}, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "117671122770922940274", "name": "Jeff Smith", "time": 1468758241770, "rating": 5.0, "text": "We worked with KC this summer on a mortgage in Alabaster, AL, and shopped the mortgage around as the pros advise.  KC was easy to work with and even after shopping, offered the best deal to us.  I highly recommend KC and his team!  You are doing yourself a disservice if you don't check out First Federal Mortgage for your financing needs!!", "pics": null, "resp": {"time": 1510170808147, "text": "Thank you!"}, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "105212955034957606705", "name": "Brittany Sparks", "time": 1473896379203, "rating": 5.0, "text": "Awesome experience! Everything was smooth! No run around!! Gloria Jackson is the BEST by far! So patient and sweet! Any first time home buyers check them out! Thank you for everything First Federal!", "pics": null, "resp": {"time": 1510170095464, "text": "Thank you for the kind words!"}, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "107410772896284340368", "name": "Amy Good", "time": 1465006098627, "rating": 5.0, "text": "My real estate agent recommended KC Haririan at First Federal Mortgage and I am so glad he did.  KC was wonderful to work with, very patient with all the changes in my contract and was able to get this first time buyer in to a home.  Highly recommend KC.", "pics": null, "resp": {"time": 1510171179147, "text": "Thank you! So glad we could be a part of your first home buying experience!"}, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "101634946764936611706", "name": "Daniel Bridgmon", "time": 1473618779274, "rating": 5.0, "text": "After trying with two other mortgage companies, First Federal was the first to actually help us finance our first home. They were very easy to work with and talk to about what I needed to do in order to figure out what price range I could afford. I would recommend them to anyone looking for a mortgage!", "pics": null, "resp": {"time": 1510170290929, "text": "Thank you we are glad we could go on the first home buying journey with you!"}, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "105112729558996842473", "name": "Omar Sims", "time": 1463076209163, "rating": 5.0, "text": "I recently worked with KC Haririan at First Federal Bank in purchasing a new house.  As my mortgage broker, KC was efficient, thorough, knowledgeable, and dependable. Without a doubt, KC is an expert in mortgage financing, the purchasing process of buying a house, and in anticipating potential barriers to overcome in the process.\n\nKC was very proactive through my purchasing/financing experience. He followed up with me via phone or email quickly without delay, he kept the process going, and stayed in constant communication with my realtor. His efficiency is exemplified in his ability to close on my house within 30 days of me winning the bid on the house.\n\nAbove all, KC is transparent and trustworthy. He is quite the professional and I will be using him and First Federal Mortgage again for my future buying experiences as well. KC represented himself and First Federal Mortgage in a remarkable fashion.\n\nI also had the opportunity of working with KC's assistant, Haley Roscoe. Haley was equally responsive and facilitated attention to details. Anytime additional documentation was needed (or if I needed to provide additional documentation to First Federal) Haley reviewed and submitted documentation without delay. She also anticipated potential barriers and provided solutions to keep the buying/financing process going. It was truly a pleasure working with Haley and she enhanced my experience with First Federal.", "pics": null, "resp": {"time": 1510167632421, "text": "Thank you so much. We always try and do our best to make the mortgage process as quick and simple as possible! It was our pleasure to work with you too!"}, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "117768789268726796665", "name": "Rebecca Winslett", "time": 1472668837453, "rating": 5.0, "text": "We used Gloria Jackson with First Federal, and she was very knowledgeable in guiding us through our second home purchase. She was always willing to answer our questions, via email or phone, even when she was not in the office. She followed through even after the closing was complete, and we would absolutely recommend her to anyone looking for a home mortgage lender.", "pics": null, "resp": {"time": 1510170406059, "text": "Thank you!"}, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "108142455905149359731", "name": "Micah Colley", "time": 1464971297944, "rating": 5.0, "text": "KC Haririan and his team at First Federal did a fantastic job at handling the financing of our new home. They were professional and prompt during the entire process. I highly recommend them.", "pics": null, "resp": {"time": 1510171231274, "text": "Thank you for the kind words!"}, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "103093421134046720055", "name": "Janey Whitney", "time": 1523595598584, "rating": 5.0, "text": "Honest workers who does great work for his customers! Highly recommend using First Federal Mortgage in Birmingham!", "pics": null, "resp": {"time": 1523639982782, "text": "Thank you so much for the kind words!"}, "gmap_id": "0x88891787dab9c97d:0xcf972d7f09e62e91"}
{"user_id": "106741270653134453184", "name": "Scott Plagmann", "time": 1494204512712, "rating": 4.0, "text": "Great location and friendly employees make this one of the better banks I have done business with.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOBYRfNCErFTUrMWF5AblXiFA4n26Jjd709pqDi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMOjHpUMrVp1lHeeN2TSuTPYJ2xtlMlbMx4C97a=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891d59cd943ef7:0x872ac4d796fb32c6"}
{"user_id": "108658317508226567925", "name": "Keith Allen", "time": 1593624319221, "rating": 5.0, "text": "Great  people..", "pics": null, "resp": null, "gmap_id": "0x88891d59cd943ef7:0x872ac4d796fb32c6"}
{"user_id": "101786254163729218970", "name": "Michael Boyd", "time": 1538775717455, "rating": 1.0, "text": "Been banking there since I was 16.Changed names a few times.I go in there every week and all the sudden nobody knows me in there,even two people I know that did.Asked to see my ID in a rude sounding way,said she dont know me.Cant bother or have common sense enough to pull me up and see that I come there every Friday. Drive thru has progressively gotten worse.25 min for 2 cars,,cmon. Now it is a sorry excuse for a bank,,close it down or do it right BB&T. Jasper branch would be a good model.,,,PS.I did have my ID,and thats the first time since 16 years old at that branch the that I was made to show it,,,Im almost 50 now.", "pics": null, "resp": null, "gmap_id": "0x88891d59cd943ef7:0x872ac4d796fb32c6"}
{"user_id": "110462189296624130411", "name": "Chase Scott", "time": 1506962638089, "rating": 5.0, "text": "Very helpful and understanding wonderful people to back me with my financial gain", "pics": null, "resp": null, "gmap_id": "0x88891d59cd943ef7:0x872ac4d796fb32c6"}
{"user_id": "107589470776280303322", "name": "Tonyerra Rose", "time": 1581615778062, "rating": 1.0, "text": "Awful Customer Service..", "pics": null, "resp": null, "gmap_id": "0x88891d59cd943ef7:0x872ac4d796fb32c6"}
{"user_id": "110379746900720064623", "name": "fat mama's lunchbox", "time": 1496182406869, "rating": 1.0, "text": "The ppl are not professionals at all", "pics": null, "resp": null, "gmap_id": "0x88891d59cd943ef7:0x872ac4d796fb32c6"}
{"user_id": "107063208902705669031", "name": "Charlotte Crump", "time": 1485781822408, "rating": 5.0, "text": "Very good", "pics": null, "resp": null, "gmap_id": "0x88891d59cd943ef7:0x872ac4d796fb32c6"}
{"user_id": "117312924918776447647", "name": "Sarge off-roading", "time": 1598381146974, "rating": 4.0, "text": "I have to said the credit union is a great credit union to be with. Low rates and services. But, I have one problem with the 800 number you can. Ever time I call. No one answers the phone and I leave my number and I don't get a call back half the time.", "pics": null, "resp": {"time": 1598392256174, "text": "Our Member Contact Center wants to follow up to be sure we don't miss any other calls and would appreciate your help. Will you send an email to Service@NavigatorCU.org and include the phone number(s) you use when calling our 800-344-3281 number?\n\nWe really appreciate the positive review, and we also appreciate your feedback about your experience with our Member Contact Center. While it is true we've been experiencing extremely high call volumes, you should receive a call back as soon as possible after leaving your number. We apologize. Thanks so much for being a Navigator Member!"}, "gmap_id": "0x889bb2e629b28247:0x12da0070bf9f9723"}
{"user_id": "114917442111981466603", "name": "Ryan Hall", "time": 1562361966979, "rating": 5.0, "text": "I really only opened my account here for an auto loan. After it was paid off, I've kept the account opened just to use as a small savings account. I may not come in often, but I have never had any problems. Everybody in there is always really helpful and nice.", "pics": null, "resp": {"time": 1562362986265, "text": "Thanks so much, Ryan! Navigator offers comprehensive banking services, and we're here to help in any way we can. Our Save'N Up debit card savings program is especially popular, as it gives Members the chance to save, earn high interest and receive matching funds up to $300 per year. Of course, terms and conditions apply, but it's very easy to add to our free checking account. Give us a call, visit navigatorcu.org or come by any Branch to learn more. :)"}, "gmap_id": "0x889bb2e629b28247:0x12da0070bf9f9723"}
{"user_id": "116914596694617830488", "name": "Brian M", "time": 1531515179574, "rating": 1.0, "text": "Do not use this bank. They are the worst ever! Used them for my dads estate during probate, and cashed a check that the lady at the branch gave me to use after I was physically in their office. Needless the say even though the funds were in the bank, my loan and probate check bounced because their staff is incompetent.", "pics": null, "resp": {"time": 1531518604416, "text": "We regret you feel this way following your experience with Navigator and would welcome the opportunity to follow up. Please consider sending an email to service@navigatorcu.org so we can look into this further."}, "gmap_id": "0x889bb2e629b28247:0x12da0070bf9f9723"}
{"user_id": "105623020962152108197", "name": "D Dizzel", "time": 1521645853006, "rating": 1.0, "text": "The new branch manager is the worst.", "pics": null, "resp": {"time": 1522709514801, "text": "We deeply regret your experience rated as one-star; Member satisfaction is a top priority. Would you be willing to provide additional details to us at Service@navigatorcu.org? We'd like to follow up and ensure your future interactions with the Navigator Team are much more to your satisfaction."}, "gmap_id": "0x889bb2e629b28247:0x12da0070bf9f9723"}
{"user_id": "108178289554954847882", "name": "Lit Kit10", "time": 1541832386258, "rating": 5.0, "text": "Love this bank. I’ve been using it for years and they never fail to over achieve. I’ve had issues with the company before, but everyone from this branch is perfect and the 24 hour service they offer is a dream with the hours I work. Will continue to do business with this bank based solely off of this branch.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMXv4QakRxGD-u4XgcK4g49KplwLUC85eamMuxV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPhbfxGzAwk2AsGsPf9LzA69GARVRmGxZaxrsLz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMk0jnoqtjNMAHAFPO8ly7mkxje7uuh7KYgZ64r=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN0YlrG75ZDxfguXZFN-emNxfpQk64psgGqalld=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOV9RUlXFGjLyQ5N10rB4lhufEWR_Bs6obhOpeQ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cce76cca7e7cb:0xe01d82a612c74205"}
{"user_id": "110417199760648031160", "name": "Jeffrey Akers", "time": 1594234208390, "rating": 5.0, "text": "This branch has been sold to PeoplesSouth Bank.  PeoplesSouth has opened a branch in this location as of April 2020.  Come by and see us!", "pics": null, "resp": null, "gmap_id": "0x888cce76cca7e7cb:0xe01d82a612c74205"}
{"user_id": "103093894470442522021", "name": "Trucking Inside", "time": 1532529296304, "rating": 5.0, "text": "Great people. Been banking here for 10 years", "pics": null, "resp": null, "gmap_id": "0x888cce76cca7e7cb:0xe01d82a612c74205"}
{"user_id": "111582772783391452662", "name": "Kelli Brannon", "time": 1524997697088, "rating": 5.0, "text": "Always polite and eager to help!! Greeted as soon as you walk in the door!!!", "pics": null, "resp": null, "gmap_id": "0x888cce76cca7e7cb:0xe01d82a612c74205"}
{"user_id": "112239709109939574914", "name": "JA me ReVs", "time": 1557240854859, "rating": 1.0, "text": "Closed.shut down.sad", "pics": null, "resp": null, "gmap_id": "0x888cce76cca7e7cb:0xe01d82a612c74205"}
{"user_id": "109707424215145693917", "name": "Retarded Potato", "time": 1608674203902, "rating": 4.0, "text": "Love banking with them. My only complaint is I get off work at 4pm. I can never make it there to do any business unless I ask to leave early at work. Don't see why they can't stay open just 30 mins longer 🤷.", "pics": null, "resp": {"time": 1608675128451, "text": "Thank you for taking the time to leave a review! We will pass along the recommendation!"}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "117409361483011692130", "name": "coreyseth88", "time": 1484675891777, "rating": 3.0, "text": "Drive thru always takes forever", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOVU9G4NPfByNTYPy0a8BBNZQMllxqCM1_Mp1Un=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "115917865398459910314", "name": "Jessica D", "time": 1583800755825, "rating": 5.0, "text": "I love my Tyndall! Everyone knows me there and greets me by name every single time I walk in, asks how my business is going, and overall makes me feel welcome and valued. I've gotten two mortgages through Tyndall and honestly would recommend Debbie Beasock to anyone for above and beyond wonderful service, not to mention the great rates and all the money saved on lending fees! I do all my banking through Tyndall for the ease of it all but also because I truly appreciate the associates at my local branch. Great service goes a long way!", "pics": null, "resp": {"time": 1584566901164, "text": "Thanks so much for your kind words, Jessica! We truly appreciate your membership, and we're happy to hear about your good experience working with Debbie on your mortgage."}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "113561742922472917506", "name": "Nanoir 2688", "time": 1612688854231, "rating": 3.0, "text": "My only complaint would be is that Atm stays down alot.", "pics": null, "resp": {"time": 1612710226877, "text": "Hi, Thank you for leaving us a 3-Star review. We apologize for the inconvenience regarding the ATMs. We are in the process of completing construction of 2 new branch locations. This has caused the temporary outages with relocating the ATMS. This will be resolved as we’re wrapping construction up over the next month or so. Thank you for your patience and for being a loyal member!"}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "108614393673397163525", "name": "M Stevens", "time": 1530713841819, "rating": 4.0, "text": "Went here with my son to get the title to a new vehicle he purchased. I waited outside while he went in with members to pay off their loan and get the title to his new vehicle he had purchased from credit bureau members who were only wanting the payoff in exchange for sale of their Honda Odyssey van. The whole process took less than 20 minutes, I was surprised after reading reviews of TFC being slow. That was not the case for us.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMID3GQiI7o2d7QAxUZKPbLWK8CTXEUjw-WbaLI=w150-h150-k-no-p"]}], "resp": {"time": 1530800588595, "text": "Thank you for your review and Congrats to your son on his new vehicle purchase! We're happy that your experience was excellent as we're striving to speed the processes up in order to create better member experiences."}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "103389096113224484571", "name": "Joel Bullock", "time": 1582302951541, "rating": 5.0, "text": "Never had a problem with Tyndall Fed Credit Union and have used a few others during my life time. They are always willing take care of any banking needs that i may have from making deposits to making a loan. Their friendly staff makes it a pleasure to do business with. I highly recommend them to everyone who would only want the best in the banking business.", "pics": null, "resp": {"time": 1582553150318, "text": "Thank you for your kind words, Joel. We love doing business with you, as well. Thank you for your membership."}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "100590727462947033473", "name": "Naima Phillips (miamixmade)", "time": 1581732861743, "rating": 5.0, "text": "The teller that I had was very pleasant and nice. She worked quick to get my transaction completed and thanked me for putting my account number on the back of my check. Thank you for your great customer service!", "pics": null, "resp": {"time": 1582034926569, "text": "Thank you for your review, Naima! We appreciate your membership!"}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "100938305052661831636", "name": "Taronjela Reeves", "time": 1610851086760, "rating": 1.0, "text": "The lines are so slow you call genie and it says incorrect member number and I have my membership card in my hand and incorrect pin which I had it for years that’s the number which you give them the 4 digit pin so they know who you are birthday etc. and it says can’t be found , what a joke and also you call and leave call back number they never return your call then the online banking always lock you out run 🏃‍♀️ as fast as you can they will rob you", "pics": null, "resp": {"time": 1610890514063, "text": "Hi, we apologize for the inconveniences you experienced when using Online Banking and Genie24. Our systems were offline due to regular scheduled maintenance until 6:00AM (CST) this morning. In the future if experiencing these types of issues, please check tyndall.org and you can see a notification on the website of regular schedule system maintenance windows.  We hope that you’ll consider amending your review, and again, thank you for your membership, and patience as we completed our regular scheduled maintenance. Have a Blessed 2021!\n\nSincerely,\n\nTyndall Federal Credit Union"}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "110050299518977849958", "name": "Roman Harrell", "time": 1552595105478, "rating": 5.0, "text": "This branch is awesome. The bank employees here are very friendly and helpful. I believe Tyndall is one of the best credit unions out there. You can’t beat the low rates and additional features they have with their loans. Thanks to everyone at TFCU!", "pics": null, "resp": {"time": 1552658674047, "text": "Thank you for your great feedback, Roman! We're so happy you're a member with us, and we love seeing you at our branch!"}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "117306301810943965765", "name": "tim jeter", "time": 1616094147890, "rating": 5.0, "text": "Very nice", "pics": null, "resp": {"time": 1616095786767, "text": "Thank you, Tim! We appreciate your membership!"}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "105859481932552293897", "name": "Jessie Holmes", "time": 1535830691232, "rating": 5.0, "text": "I’ve been banking with Tyndall about a year now and I have no complaints. I love the small town, customer service feel when I go in. Everyone greets me and treats me very kindly. Jason is sweet as can be, it’s nice to have such a friendly bank in a larger city where customer service is tends to fall short at other places.", "pics": null, "resp": {"time": 1536064569453, "text": "Thank you for your review Jessie! We truly value your membership and appreciate the feedback regarding our staff."}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "115878791207302646540", "name": "cody mack", "time": 1559080709004, "rating": 2.0, "text": "If I could rate 0 stars I would. My money was stolen directly from my account and have talked to them and they still after 3 months have not contacted me and are treating it like a game. Issue was resolved after a few months but took forever, I appreciate it being handled but it wasn't in a timely manner and I don't know how my money was stolen, so I still don't trust you guys with my money. 2 stars.", "pics": null, "resp": {"time": 1557415106819, "text": "Hi, Cody! We have discussed this with our branch manager, and it seems that this has been resolved. Please let us know if you would like for someone to give you a call to discuss the situation. Thank you!"}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "104146020077467115815", "name": "Karina Sanford", "time": 1582321290412, "rating": 5.0, "text": "We have banked with Tyndall for many years. Staff always try to be helpful and friendly.", "pics": null, "resp": {"time": 1582553188542, "text": "Thank you for your review, Karina! We love seeing you in the branch!"}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "109753137049495490805", "name": "L Welch", "time": 1547835089852, "rating": 5.0, "text": "Been a member since I was a teenager. I was displaced due to Hurricane Michael and behold $50 was deposited into my savings account by Tyndall. I have nothing but outstanding services over the years. Your the best! 😊😊😊😊😊😊😀", "pics": null, "resp": {"time": 1547840190662, "text": "Thank you for your review, Lorenz. We are very sorry to hear that you were displaced but are happy that the $50 helped. Thanks for your membership!"}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "105973818976773120419", "name": "J McClain", "time": 1607721726929, "rating": 5.0, "text": "Nelly is great to do business with! Very knowledgeable!\nThanks!", "pics": null, "resp": {"time": 1609618735470, "text": "Thank you so much for your kind words about our staff! Thank you for your membership!"}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "104700511607911452308", "name": "Art of Zink", "time": 1538280684046, "rating": 1.0, "text": "I have been with this credit union happily for six years, but I believe I no longer will be after what has happened tonight.\nI was waiting on my check to clear today so that I could get a ride home from the convention that I am currently working at in Columbus, Ohio. My check cleared, but Tyndall Federal Credit Union's system decided to automatically withhold every last dime from my pay check. Not only do I not have access to any of my funds, I couldn't even get a ride back to my hotel, and I'm stranded in the middle of a city that I'm unfamiliar with. After calling every number I could think of (and even frantically trying to contact them on Facebook messenger), The only option I had was to call local police dispatch to get a ride back to my hotel so that I didn't have to walk back through a dangerous part of town.\nThe fact that you don't have an after hours emergency service number has literally put me in a very dangerous situation. it's a shame, but I don't believe I will be banking with you any longer.", "pics": null, "resp": {"time": 1538598754191, "text": "Leah, we are very sorry to hear about your experience, and we hope that our Member Services Department was able to clear everything up when you spoke this week. We truly value your membership."}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "114400185956874669335", "name": "Jonathan Gray", "time": 1475845983647, "rating": 5.0, "text": "Great experience every time I am in there. Love the friendly service and great attitudes everyone has. The ladies at the Dothan branch really gives personal service to all customers. Special shout out to Tequila and Shasta.", "pics": null, "resp": null, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "114868854435586359192", "name": "Michael Nowell", "time": 1589677339281, "rating": 5.0, "text": "Very friendly and fast and service.", "pics": null, "resp": {"time": 1589808617961, "text": "Thank you, Mr. Nowell! We are so glad you stopped by!"}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "101026787923039612612", "name": "Jonathan Courtney", "time": 1543226796913, "rating": 5.0, "text": "I worked with Mrs. Debbie Beasock and the staff at Tyndall a couple months ago when i purchased my first home and was more than pleased. Very nice people that will do all they can to help you out. I would highly recommend them to anyone.", "pics": null, "resp": {"time": 1543241970173, "text": "Thanks so much for your kind review, Jonathan! We are happy to have you as a member."}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "109673421739982817342", "name": "Ronald Summers", "time": 1530538615522, "rating": 5.0, "text": "Always friendly. Sometimes slow but that's due to the customers in front of me, not the tellers. I always have a great experience dealing with them.", "pics": null, "resp": {"time": 1530539382675, "text": "Thank you so much for your review Mr. Summers, we value you as our member and are always here to serve!"}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "112338606523514131167", "name": "Toni Bloom", "time": 1562882701701, "rating": 5.0, "text": "Customer service is great the staff always kind and professional", "pics": null, "resp": {"time": 1562937593957, "text": "Thank you for your kind review, Toni! We are very happy to have you as a member."}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "108845957422779286912", "name": "Charlie Dykes", "time": 1489172472516, "rating": 2.0, "text": "Tyndall in general is a difficult branch. I had to have a perfect credit score before they would lend me money. Hey advertise a lot but are extremely selective only lending to people with high credit score. Essentially they help those that can be helped anywhere. Not the hometown bank they advertise to be. This particular branch has been the most difficult to work with. I will be changing banks because my time is too valuable to spend being talked to to by a teller.", "pics": null, "resp": null, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "109145119078797667361", "name": "Jeramie Burleson", "time": 1531643790496, "rating": 5.0, "text": "They treat me like royalty every time I walk in. I love this place!", "pics": null, "resp": {"time": 1532356503214, "text": "Thank you for your review Jeramie, we truly value your membership and thank you for being a Tyndall member!"}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "102102743101377439003", "name": "Paige Vinson", "time": 1545707013137, "rating": 1.0, "text": "I would give zero but I don't think that's an option. They froze a young newly widowed mother's account with no notice... on Christmas Eve. Yep. It was a joint account but, for whatever insensitive, heartless reason, that's what they did.", "pics": null, "resp": null, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "117667440761970281410", "name": "Hayden Vick", "time": 1527260566472, "rating": 2.0, "text": "They take WAY too long. Love banking with tyndall but this location is never quick.  Even when they are not busy.", "pics": null, "resp": {"time": 1528407630812, "text": "We appreciate you bringing this to our attention and have addressed your concern. We truly value your membership and feedback!"}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "106110063489714785024", "name": "Big Mommam", "time": 1564345910687, "rating": 5.0, "text": "Excellent credit union!", "pics": null, "resp": {"time": 1564492798398, "text": "Thank you for your kind review!"}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "100148571250643174480", "name": "Sandlot Dothan", "time": 1540823137846, "rating": 1.0, "text": "Got to be the worst customer service I have ever seen in any business.", "pics": null, "resp": {"time": 1540824467648, "text": "Hello, Jeremey. We are so sorry to hear that you had a negative experience. We would love to talk with you about this, if you'll give us a call at 850-769-9999."}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "101535788053644711061", "name": "Andrea Kelley", "time": 1543355632822, "rating": 5.0, "text": "Always friendly service!", "pics": null, "resp": {"time": 1545948212835, "text": "Thank you for your review, Andrea! We appreciate your membership!"}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "102910087025620389611", "name": "Marc Dempsey", "time": 1538144054431, "rating": 4.0, "text": "It would help if they had a eastside branch", "pics": null, "resp": {"time": 1538231493831, "text": "Thank you for your review Marc, Have a Great Weekend!"}, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "111519773377816895309", "name": "Jon Holzman", "time": 1490641083661, "rating": 1.0, "text": "Terrible customer service. I see no reason to trust them with an account.", "pics": null, "resp": null, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "117343668443920686783", "name": "clayton kleinschnitz", "time": 1494262063671, "rating": 1.0, "text": "Honestly pretty awful service. You have to jump through so many hoops and many of their services are handled by a third party. Very aggravating", "pics": null, "resp": null, "gmap_id": "0x88928da482293ac9:0x88ac7152d478b7b7"}
{"user_id": "107628427476767005529", "name": "Demetrius Kimbrough", "time": 1594662957604, "rating": 1.0, "text": "I would not recommend anybody to this company.  They will give you the run around and will not call you back about anything.", "pics": null, "resp": {"time": 1594743823990, "text": "Hi Demetrius, thank you for your honest feedback. We take these reviews seriously and would like to discuss further with you. Please email your contact information to BLReviews@bankerslife.com so we can address your concerns and answer any other questions you may have."}, "gmap_id": "0x888922409bee898d:0x9912c5babb129aa9"}
{"user_id": "101537438223938514886", "name": "Shari S", "time": 1571415605553, "rating": 1.0, "text": "I had an interview scheduled. I tried to cancel, but there wasn’t a second time available to fit my schedule. I tried to call, to tell them I was running late, but the line was busy. When I came in the recuites, Leah, was holding up the line with a personal call! I was unable to get the group interview because of her! If they treat possible employees this way, I wonder how they treat clients? Avoid the company and try someone with integrity like Fidelity.", "pics": null, "resp": null, "gmap_id": "0x888922409bee898d:0x9912c5babb129aa9"}
{"user_id": "104445009545839152632", "name": "linda lewis", "time": 1605304762331, "rating": 2.0, "text": "I CALL YOUR OFFICE AND GET NO ONE! I ONLY NEEDED YOUR FAX NUMBER! NO HELP NO CUSTOMER SERVICE FOR THIS OFFICE! NOT HAPPY POLICY OWNER!/", "pics": null, "resp": {"time": 1605621627065, "text": "Hi Linda, thank you for your review. We're sorry to hear of your experience. Please email your contact information to BLReviews@bankerslife.com and we'll have a team member reach out to you directly to assist."}, "gmap_id": "0x888922409bee898d:0x9912c5babb129aa9"}
{"user_id": "104078294945571303833", "name": "Tambatha Sias", "time": 1583960723826, "rating": 5.0, "text": "She was polite and got everything sorted out for me that was needed", "pics": null, "resp": null, "gmap_id": "0x888922409bee898d:0x9912c5babb129aa9"}
{"user_id": "110654451134519798791", "name": "Sabrina Montgomery", "time": 1528121726152, "rating": 1.0, "text": "Horrible stay away from the snake oil salesmen", "pics": null, "resp": null, "gmap_id": "0x888922409bee898d:0x9912c5babb129aa9"}
{"user_id": "103747289634684322215", "name": "Ricky Louis", "time": 1579196436449, "rating": 5.0, "text": "Mike Newman is very honest and patient. Great listener.  He genuinely cares for your best interest.  That's why I trust him with my future. Thank Mike", "pics": null, "resp": null, "gmap_id": "0x889a40555e9ec571:0x6620a6495b954a4"}
{"user_id": "115082388260666882043", "name": "Tom Beaty", "time": 1579187319229, "rating": 5.0, "text": "Mike Newman is one of the most honest, ethical people I know. You can definitely trust him with a variety of financial services.", "pics": null, "resp": null, "gmap_id": "0x889a40555e9ec571:0x6620a6495b954a4"}
{"user_id": "101780153922339326749", "name": "Ricky Trione Art", "time": 1555685750979, "rating": 5.0, "text": "Ralph Anderson is the most honest and dedicated person we know in the Financial Planning Field!  We highly respect and trust Ralph! We are proud to giving him our very highest Recommendations!  He will truly be a very valuable blessing to you and your family!  Excellent Services!", "pics": null, "resp": null, "gmap_id": "0x889a40555e9ec571:0x6620a6495b954a4"}
{"user_id": "100078668070409840862", "name": "Landon Rogers", "time": 1555598951986, "rating": 5.0, "text": "I would highly recommend giving Ralph Anderson a call if you are looking for a financial planner! After using him for years, I can confidently tell you that he is by far the most professional, well organized and attentive financial planner I have ever met!", "pics": null, "resp": null, "gmap_id": "0x889a40555e9ec571:0x6620a6495b954a4"}
{"user_id": "101102448139467666953", "name": "Tom Aiken", "time": 1556403963397, "rating": 5.0, "text": "Mike Newman has tremendous experience and is a joy to work with.  I recommend him highly.", "pics": null, "resp": null, "gmap_id": "0x889a40555e9ec571:0x6620a6495b954a4"}
{"user_id": "112229004767637436993", "name": "Ursula Lowe", "time": 1582741245783, "rating": 5.0, "text": "They are always there for their clients", "pics": null, "resp": null, "gmap_id": "0x889a40555e9ec571:0x6620a6495b954a4"}
{"user_id": "113242606614383994231", "name": "Ruby Ngururu", "time": 1616670342215, "rating": 5.0, "text": "Very friendly n Helpful Staff.  Mrs.Jamie Horsley was very helpful n assisting me with opening up my Personal n Business Account.\n\nThanks Mrs Horsely", "pics": null, "resp": null, "gmap_id": "0x888904f22b1877b5:0x9bfdb4daf67324b6"}
{"user_id": "103483314905230771837", "name": "Dixie Godette", "time": 1601384254401, "rating": 1.0, "text": "I am absolutely horrified! This is the worst bank in existence. They trick you with their good customer service then charge fees laterally on top of fees. I called yesterday upset about a fee, that they charged after the balance had been brought to positive. And they added a other paid item fee because I was upset about the first one. I've never witnessed a bank treat their customers this way. They stay open by making the poor poorer! Do not bank here!", "pics": null, "resp": null, "gmap_id": "0x888904f22b1877b5:0x9bfdb4daf67324b6"}
{"user_id": "113703277742689751546", "name": "James Davis", "time": 1568370356522, "rating": 2.0, "text": "Got nice friendly staff polite one thing wrong they don't open till 9 in the morning and they close at 5 p.m. that's when everyone is getting off of work at 5 and like I said I'm closing my account out I'm going to move it to metrobank they open at 7:30 a m stay open till 6:30 p.m. ask my type of banking I don't have to rush rush rush through traffic thank you for your business I'm moving my account this morning", "pics": null, "resp": null, "gmap_id": "0x888904f22b1877b5:0x9bfdb4daf67324b6"}
{"user_id": "114464561855480909860", "name": "Jason Thomas", "time": 1531849005539, "rating": 5.0, "text": "Wonderful bank. Friendly staff that goes out of their way to make sure their customers are happy.", "pics": null, "resp": null, "gmap_id": "0x888904f22b1877b5:0x9bfdb4daf67324b6"}
{"user_id": "107689654798374379488", "name": "Matthew Slaughter", "time": 1495310985288, "rating": 5.0, "text": "Leenise and her team always go the extra mile to make sure that the provide excellent service!", "pics": null, "resp": null, "gmap_id": "0x888904f22b1877b5:0x9bfdb4daf67324b6"}
{"user_id": "114243065050690549685", "name": "peggy siragusa", "time": 1514036295684, "rating": 4.0, "text": "Great people always there when you need them", "pics": null, "resp": null, "gmap_id": "0x888904f22b1877b5:0x9bfdb4daf67324b6"}
{"user_id": "103136168224154012801", "name": "Destiny Fitch", "time": 1469641316907, "rating": 5.0, "text": "Great people love this bank", "pics": null, "resp": null, "gmap_id": "0x888904f22b1877b5:0x9bfdb4daf67324b6"}
{"user_id": "103152963666522797503", "name": "Kumarappan Ganesh", "time": 1476248104335, "rating": 5.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x88626b448528b4f9:0xe5161a92c8d366ad"}
{"user_id": "105120504952298710589", "name": "John Higginbotham", "time": 1608754745487, "rating": 2.0, "text": "Friendly staff, but it is SLOW!! Not to mention, the never seem to answer the phone. You can be waiting up to 1-2 hours just to be able to talk with a banker. I have been forced to close all of my personal and business accounts because I don’t have time to wait for them to finish personal conversations with each other. Regions, here I come!!", "pics": null, "resp": null, "gmap_id": "0x888971f52c42c17d:0x6bbbb93cbfd4e0ee"}
{"user_id": "112501100931287404962", "name": "l Thomas", "time": 1547052872615, "rating": 3.0, "text": "This is a nice and friendly bank. But its one of the slowest banks in the world! It doest matter if its one person a head of you, its still gonna take forever & a day! Then they normally have one teller I just wish they do better on the time", "pics": null, "resp": null, "gmap_id": "0x888971f52c42c17d:0x6bbbb93cbfd4e0ee"}
{"user_id": "114036042412879748451", "name": "Timothy Abney", "time": 1611347726805, "rating": 4.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x888971f52c42c17d:0x6bbbb93cbfd4e0ee"}
{"user_id": "101696745753848461112", "name": "Hayden H", "time": 1463282204678, "rating": 5.0, "text": "I've banked with BB&T for 3 years now and I've never had a problem. They have a lot more local branches compared to banks like Regions and Wells Fargo so you don't have to drive a half hour away to cash a check.", "pics": null, "resp": null, "gmap_id": "0x888971f52c42c17d:0x6bbbb93cbfd4e0ee"}
{"user_id": "100453917345358924964", "name": "Stephen Litchfield", "time": 1556921487229, "rating": 2.0, "text": "Personal Banking Experience Great. Business Banking, not so much.", "pics": null, "resp": null, "gmap_id": "0x888971f52c42c17d:0x6bbbb93cbfd4e0ee"}
{"user_id": "100201782719949809106", "name": "Pamela Wright", "time": 1529337506624, "rating": 5.0, "text": "Great place to bank. Friendly Service.", "pics": null, "resp": null, "gmap_id": "0x888971f52c42c17d:0x6bbbb93cbfd4e0ee"}
{"user_id": "107031398370603087054", "name": "sydni cherry", "time": 1476309452520, "rating": 5.0, "text": "We love our BB&T crew at the Moody branch! Thanks for your great service!", "pics": null, "resp": null, "gmap_id": "0x888971f52c42c17d:0x6bbbb93cbfd4e0ee"}
{"user_id": "112373580076643250208", "name": "Melanie Fuller", "time": 1530236928849, "rating": 5.0, "text": "They have very friendly staff! Eric will be happy to help you!", "pics": null, "resp": null, "gmap_id": "0x888971f52c42c17d:0x6bbbb93cbfd4e0ee"}
{"user_id": "103886229726939490494", "name": "Davanna Clayton", "time": 1526397054217, "rating": 1.0, "text": "I opted out for 401k never had any problems until they decided to take $50 out of my check randomly, I filled out my reimbursement form and mailed it off to get my FULL refund and they send me a $4 check. This is nothing but a scam. I wish I could leave a negative star.", "pics": null, "resp": null, "gmap_id": "0x889bad58537ec433:0x1e3ebb1ea17459e5"}
