{"user_id": "107910109855333961865", "name": "Bis Office Systems", "time": 1596048837868, "rating": 5.0, "text": "Nothing but praise for the prompt and responsive service we receive from ADS. Dan is always accessible anytime I have called. We get better, more personalized service doing business with this local company.", "pics": null, "resp": {"time": 1596059280750, "text": "Thank you very much!\nWe always strive for excellent customer service.\nI will pass this on to our team!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "115783318236429783371", "name": "Spectrum Collision", "time": 1576277764595, "rating": 5.0, "text": "5 stars for the excellent work and customer service performed by Advanced Detection Security of Mobile. This company has taken care of our security systems for nearly 15 years. Flawless performance, quick service, and an excellent team of Christian people. Phone calls are always returned in a timely manner, and repair service is always very prompt, so you are never left unprotected.", "pics": null, "resp": {"time": 1576347588004, "text": "Thank you!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "117651966845211373822", "name": "Allen Huth", "time": 1582307868065, "rating": 5.0, "text": "ADS has kept my property safe and secure for about 20 years.  No problems with the system and great immediate response from the monitoring system when we trip the alarm.. ADS is dependable and customer focused. They have been around for 30 years because they serve us well!", "pics": null, "resp": null, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "113069128401939237896", "name": "Laveral Graf", "time": 1597254990061, "rating": 5.0, "text": "The people of ADS are always quick to pick up the phone, willing to help, friendly, and polite. Ashley and Thomas are very helpful over the phone.", "pics": null, "resp": {"time": 1597260548294, "text": "Thank you!\nOur Team strives for excellence in customer service every day!\nPlease let us know how we can do better."}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "115046851075976501832", "name": "Sandy Cooley", "time": 1586813972463, "rating": 5.0, "text": "I am the jail administrator @ Washington County Jail and we recently had ADS install new cameras. We were extremely pleased with the prompt service, efficiency and willingness to work with us. We highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "105737169638011377297", "name": "Jimmy Starr", "time": 1577669216207, "rating": 5.0, "text": "I have personally known Dan McDaniel for 35 years who is the president of ADS of mobile. And by the quality of his work and the performance he does with follow up with his customers is unmatched in the security industry. He’s an expert in fire alarm, security cameras, alarm systems and access control.He serves on the Alabama alarm association and it has been president in the past. He does a complete free appraisal of your home or business and gives a fair price for installing a security system and his monitoring is excellent.", "pics": null, "resp": {"time": 1577674984205, "text": "Thank you Mr. Starr!\nI am very  honored and humbled by your comments!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "109256222902771596307", "name": "Doug Simpson", "time": 1587671616503, "rating": 5.0, "text": "I had ADS come out and install the alarm and camera system at one of our buildings.\nThe install was professional and completed ahead f schedule.\nWe were so pleased that we have four buildings covered by ADS.\nI would highly recommend ADS for your security and video needs.", "pics": null, "resp": null, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "110759036940519179000", "name": "Claris Feibelman", "time": 1598903682140, "rating": 5.0, "text": "Been customer with ADS for over 30 years\nVery good and reliable service", "pics": null, "resp": null, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "108655195737571347994", "name": "Ell A May Absher", "time": 1559331074218, "rating": 5.0, "text": "I love this company. I work for another alarm company and Advanced Detection Security of Mobile, Inc. does some of our sub-contracting work. Kristen, their scheduler, always makes me feel like a priority. She is quick to respond and very efficient! I work with many many other alarm companies but Kristen is THE one I can depend on, not only to schedule quickly but to keep me updated as to delays, rescheduling, parts needed, etc. Keep up the great work Advanced Detection Security of Mobile, Inc.! You make my job so much easier. You and your team rock!\nLorna A, Customer Care Representative with SSS", "pics": null, "resp": {"time": 1576347720833, "text": "Thank you!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "117911848695015372526", "name": "sam sinclair", "time": 1590103461893, "rating": 5.0, "text": "They did a great job installing a security camera system for our church. Very pleased with both the process and the product.", "pics": null, "resp": {"time": 1590539543161, "text": "Thank you Sam!\nWe look forward to serving you and your church.\nADS  Video • Fire • Security  Team"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "109136506989125288807", "name": "James W. Lyon", "time": 1561069335036, "rating": 5.0, "text": "I highly recommend Dan McDaniel and the Advanced Detection Fire, Security and Video Company (ADS).  They have protected my home and office for 20 years without incident.  In today's world, you can never be sure of your safety but ADS gives my wife and I peace of mind!", "pics": null, "resp": {"time": 1576347736912, "text": "Thank you!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "105123704507768856444", "name": "Nildee Herrera", "time": 1562616613153, "rating": 5.0, "text": "We have used ADS of Mobile for several local services. They have always been very professional and skilled for what we have needed. Today, we had an emergency service and asked them to help us, Kristen Lane jumped and made sure we were taken care of. Thank you! Thank you for allowing us to have a face in Mobile!", "pics": null, "resp": {"time": 1576347797975, "text": "Thank you!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "112247053110098419346", "name": "John Thompson", "time": 1545407098732, "rating": 5.0, "text": "My company, Thompson Wealth Management & Life Planning, recently purchased a new building,. Dan McDaniel, a personal friend and business associate for over 20 years personally, came out and drew up the right  security plan and hardware that fit my needs. They worked hard and  got the job done fast. I was extremely pleased with the costs and customer service i received and continue to receive. I would highly recommend ADS for your business or personals security needs.", "pics": null, "resp": {"time": 1545662857939, "text": "Thank you Mr. Thompson.\nOur team looks forward to serving your security technology needs for a long time!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "109385235557165000065", "name": "Mark Jones", "time": 1543449989642, "rating": 5.0, "text": "I am a business owner with 8 locations and have used ADS of Mobile for over 20 years for my burglar alarm and video surveillance needs. In all of that time, I have always had the piece of mind that my facilities were protected from crime.  I would sincerely recommend Dan McDaniel and ADS of Mobile because of their good products, professional installations and integrity. ADS of Mobile truly helps me sleep well at night!\n\nMark Jones\nMaster Cleaners", "pics": null, "resp": {"time": 1576347716576, "text": "Thank you!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "102033005987100391048", "name": "pamela farmer", "time": 1597265651761, "rating": 5.0, "text": "Wonderful, fast service. Highly professional", "pics": null, "resp": null, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "111979773914764911659", "name": "Shulanda Norwood", "time": 1557841057757, "rating": 5.0, "text": "I have contracted ADS now for 4 years.  Their customer service has always been professional and prompt.  I enjoy each time talking with Mr. Dan McDaniel he is very concerned about his client and I will definitely recommend ADS service to any client that is in need of quality good service. ADS Security will satisfy your needs.", "pics": null, "resp": {"time": 1557849299182, "text": "Wow!\nThank you so much Shulanda.\nAfter nearly 30 years in business we have learned that Customer Service is the MOST  important thing we can do! Please call me anytime I can help!\nDan McDaniel"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "112320245542721095999", "name": "Eric Burroughs", "time": 1554808076033, "rating": 5.0, "text": "I work with contractors all over the country, often onsite personally. Mal from ADS is one of the best I have ever come across. He is extremely detail oriented and actually cares! Don't even second guess working with these guys, They are solid!", "pics": null, "resp": {"time": 1576347718795, "text": "Thank you!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "102885234234637377522", "name": "Jacob Reynolds", "time": 1561752840237, "rating": 5.0, "text": "Their security systems and customer service is top notch! I would recommend this company to anyone whose looking for a high quality security system with great customer service!", "pics": null, "resp": null, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "108101021089654391498", "name": "Ma'at Dei", "time": 1620812389820, "rating": 5.0, "text": "Professional and fast. This is a great company and I would recommend them for any home or business.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "111650325185761495626", "name": "Robert Chappell", "time": 1614914408593, "rating": 5.0, "text": "I am very pleased with my ADT security system! The techs are very professional and exhibit extreme concern that you are completely satisfied with their work before they leave. Excellent customer service!", "pics": null, "resp": {"time": 1614952011011, "text": "Hi Robert. Thank you for the 5 Star Review :-)"}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "113223786916724216152", "name": "Jay Starling", "time": 1614113761147, "rating": 5.0, "text": "Our sales representative, David Jackson, quickly responded to the request to review our current system and provided several system upgrade options.  Our installer, Jeff, arrived on time and did an outstanding job.", "pics": null, "resp": {"time": 1614130980565, "text": "This is great news, Jay. We appreciate the love ♥️ 💕 💞"}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "111973787564470105759", "name": "Joyce Boigenzahn", "time": 1607606719142, "rating": 5.0, "text": "Thank you Scott for upgrading our home security system with ADT. We have used ADT for over 10 years and we have never had a problem. The tech, Scott was professional, polite, and very knowledgeable. He worked effectively and efficiently, answering all of my questions (I had alot) and even taking extra time to explain future upgrades. Thank you ADT and Scott.", "pics": null, "resp": {"time": 1607626861556, "text": "Thank you for being a member of the ADT family, Joyce, and for taking the time to share your awesome experience."}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "113289572783623439442", "name": "jeffery davis", "time": 1624657138607, "rating": 1.0, "text": "No stars, I would not reccomend ADT anyone.   Worst customer service ever!", "pics": null, "resp": {"time": 1624712492892, "text": "Hello Jeffrey- We are so sorry to hear about your experience. We would love to help you. Please reach out to us at alwaysthere@adt.com for further assistance."}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "104998227444322801517", "name": "Shellie Weaver", "time": 1600906606475, "rating": 5.0, "text": "Michael had exceptional customer service. He was efficient and attentive to all of our needs. When it came to providing an experience for us he went above and beyond. We would highly recommend him to anyone!! Job well done!!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "102094764118638861613", "name": "Monica", "time": 1620728364176, "rating": 2.0, "text": "My ADT representative did an outstanding job. He went over several packages to ensure I knew my options. Working with David, I feel safe and secure. He answered all the questions I had and walked me through everything I needed. I will recommend Mr. Jackson's services to others.\n\nUpdate: I gave Mr. Jackson a referral to one of my friends and he criticized him on his credit without knowing if he was a victim of identity theft. Change the rating from 5 stars to 2 stars", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "115841425118961113086", "name": "L Craig", "time": 1589242898781, "rating": 5.0, "text": "Excellent service, quick install and has been a positive experience so far. My account representative took the time to make sure I had all that I needed and that I understood all of my equipment. I feel secure and I am very happy with ADT. Highly recommend their service and my representative David.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "107027554629984533229", "name": "Jan Kimble", "time": 1596399260966, "rating": 5.0, "text": "David Jackson was the sales representative from ADT. Mr. Jackson is very knowledgeable about the service I requested . He was highly efficient, arrived promptly for each scheduled visit and answered all of my questions. Very professional.\n\n.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "108576332391737540210", "name": "Joyce SIMMONS", "time": 1562443743868, "rating": 5.0, "text": "I am absolutely satisfied with the services I received from ADT Sales Representative David Jackson.  From the beginning till completion of installation.  David was thorough as well as PATIENT with me.  I had many questions but he answered them all.  I felt safe and comfortable with David.  He was extremely professional and knows his products well.  I will without hesitation recommend him to others.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "110643657650802303377", "name": "Carolyn Howze", "time": 1560377110353, "rating": 5.0, "text": "We've had ADT since becoming homeowners 5 years ago. Jonathan Givens is our awesome technician! He is very knowledgeable and we have had all positive experiences with his services. We are blessed to have him servicing our system and answering any questions we might have.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "106685406444347128393", "name": "Matt Campbell", "time": 1560015187858, "rating": 5.0, "text": "David Jackson, I greatly appreciate you sitting down with me and discussing the different types of products that ADT has to offer.  Purchasing something significant can be a very hard decision for most people, but having a professional like Mr. Jackson there to  assess the situation accurately is very helpful. Thank you for helping get my set up done as soon as possible. I do not know what kind of wand Mr. Jackson has under his sleeve, but it must be  really good because he was able to get me on the install schedule extremely fast. I recently had an issue so I wanted to secure my property and feel safe at home once again. ADT has an excellent set of products, many cameras and motion sensors, window monitors, temp controls, etc. What I like so far about the set up is that I can view all of the security on my phone and also on any computer.  I am looking forward to hearing from Mr. Jackson in the future and I hope to have a fantastic relationship with ADT. Thank you", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "114065927104297974792", "name": "J Renzenburger", "time": 1569958957165, "rating": 5.0, "text": "ADT Technician Jacob Bohannon was extremely quick and efficient. He had our system installed in no time and was very helpful explaining the features. Please be sure he is recognized for his outstanding attitude and great customer service, he is a real asset for ADT.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "107469307136677580990", "name": "Thaddeus Porter", "time": 1594120430628, "rating": 5.0, "text": "Fantastic customer service.  Very fast, very professional, and very knowledgeable!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "103036244481624794110", "name": "Lisa Nicholas", "time": 1593713138735, "rating": 5.0, "text": "It was shared to me the system and how it work. The agent was understanding and gave details of the system.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "115380444109926682098", "name": "Sharity Scott", "time": 1559315685672, "rating": 5.0, "text": "You can't go wrong with Scott Chamblin! He updated our ADT system flawlessly. He was a true professional, very competent and proficient at his job. Once installs were complete, he was very patient with us while ensuring we could work the new system. We were very satisfied with the results. Will request him by name for any future services. Thanks Scott!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "108469196919106911691", "name": "Sherrie Shown", "time": 1592274633676, "rating": 5.0, "text": "ADT has kept me feeling safe and secure for over 11 years.  The company is very customer oriented and will go above and beyond to see that everything is exactly to your liking.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "106111375037217473704", "name": "Tamara Myers", "time": 1594422383958, "rating": 5.0, "text": "Thank you David for all your help. You made sure to explain to me about ADT and what services they provided.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "106386327206677447903", "name": "Andrea Bach", "time": 1597015848238, "rating": 5.0, "text": "Great customer service always there for any questions.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "110309128180798684181", "name": "Linda Barsczewski", "time": 1564155023521, "rating": 5.0, "text": "We recently had an ADT tech, Jonathan Givens, at the house to assist us with an issue regarding our exterior security camera. Jonathan immediately knew what was causing the problem and was able to resolve it. He was professional, courteous and very knowledgeable. We sincerely hope that all ADT techs are like Jonathan... Thank you ADT and Jonathan!!! Job well done!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "107962327280009634421", "name": "Bobby Ford", "time": 1556823573719, "rating": 5.0, "text": "My experience with ADT was outstanding.  I have nothing but great things to say about the service that I received from both the service agent (Ms Morgan Hamel), and the technician that installed the ADT system.  Accolades to both of your employees for outstanding service.  I end with big thank you to Ms Morgan for taking time to explain the different options and to help me select the best package to fit my requirements. The technician was great and he took the time to go over and familiarize me with each component on the system.   Thanks again and may God Bless....\nBobby L  Ford", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "104292460319233025104", "name": "Chip Westberry", "time": 1560602916300, "rating": 5.0, "text": "We have been using ADT security services for many years.  We recently completed an addition to our home and needed additional equipment.  David Jackson drove down from Montgomery to help us determine what equipment would best cover our needs.  He and James House were very knowledgeable and helpful.  We are very pleased with the results.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "113832712423835446145", "name": "Thomas Susi", "time": 1565040259896, "rating": 5.0, "text": "Service technician Jonathan Givens did a great job. Took his time and explained the system to this elderly couple. We are not that computer savvy so he was patient with us. Kind, polite and was on time.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "114583852960009506397", "name": "James M. Levy", "time": 1556636256867, "rating": 5.0, "text": "David did an exceptional job. He is friendly, professional and answered every question I had. Additionally, he cleaned up any mess made. I strongly and happily give him and ADT 5 stars!!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "100513523916139289490", "name": "Wendy Gay", "time": 1563630031884, "rating": 5.0, "text": "We've had ADT for many, many years and David in Montgomery was by far one of our best reps.  He is very detailed and customer focused.  And wants only the best for me (customer).", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "107311463253930933763", "name": "Michelle S", "time": 1562354028244, "rating": 5.0, "text": "Jonathan Givens was my technician today, he was very prompt and was able to address my issue and get me back up and running in minutes.  He was excellent with my rescue dogs and explained what was going on along with the fix.  Only thing ADT needs to work on it length it takes to get a technician when a customer has a problem.  Waited about 2 weeks for appointment and in and out in like 30 minutes.  Jonathan Givens is a huge asset to your company and I tell all my friends about ADT and Jonathon.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "103199474430465666255", "name": "Francine Anderson", "time": 1563651944403, "rating": 5.0, "text": "I am so very happy I chose ADT for my home security. ADT Technician Scott Chamblin was the individual who came out to my home and he was so very informative and knowledgeable about the  company’s products and services.   Before leaving, Scott made sure that my new system was properly working and that I knew how to operate it along with the new features.  ADT, thank you for your protection and for sending such an outstanding technician to initiate your services.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "110573600556821866373", "name": "Gina Griffin", "time": 1560399893434, "rating": 5.0, "text": "Jonathan Givens was amazing.. i was initially told my appointment would be Friday but Jonathan saw that he was within 10 miles of my house and called me to see if he could come a few days early. This was such a blessing because i live alone and i depend on my security system. Thank you Jonathan", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "110360478281608214349", "name": "Joshua Carlson", "time": 1562100539407, "rating": 5.0, "text": "Got Jacob to set up our ADT alarm - he was exceptionally helpful and quick. Would definitely request him by name if we got more work done.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "117140979462627658534", "name": "Kathy Perreault", "time": 1562261563432, "rating": 5.0, "text": "Jonathan Givens, the technician who installed our ADT security system, was very knowledge and helpful. He was very patient as he guided us through the operation of the system. We were glad to hear that we can contact him directly if we have a question or a problem in the future.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "102784525424289572507", "name": "Yvette Esteves", "time": 1564602833120, "rating": 5.0, "text": "Mr. Givens arrived on time like always. He was on task right away. Mr. Givens updated our cel unit and successfully fixed ALL our Z-Wave switches. We appreciate his professionalism.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "106244995566605395594", "name": "Phillipian 4:10", "time": 1559340586721, "rating": 5.0, "text": "Scott Chamblin was perfect. He came in to upgrade our system and was professional and efficient.  He reviewed the entire system with our family, he was patient and thorough. Grateful for this type of customer service experience.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "103301205605834290249", "name": "Taye moore", "time": 1578101864388, "rating": 1.0, "text": "Terrible. They will give you a 5 hour window and be a no show.  say they tried to call and reschedule you for 2 weeks later.  Try another company.", "pics": null, "resp": {"time": 1578498691594, "text": "Hello Tay- We are disappointed to hear of your experience. We are happy to help you. Please reach out to us at alwaysthere@adt.com. Please provide us with your phone number, address and please reference your post."}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "112259115655072385278", "name": "Leslie Strappy", "time": 1559055860889, "rating": 4.0, "text": "David has been awesome getting everything ready for me and also instrumental and helping me getting personal specifications set up on my new system.  This has been a smooth transition because of David.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "104386188900761439219", "name": "Anthony Barnes", "time": 1589336227649, "rating": 5.0, "text": "Mr. David Jackson was very nice and informative,  great job", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "102763548873064390826", "name": "Samantha Podloski", "time": 1553205635706, "rating": 5.0, "text": "Chris King was awesome. I love our system and he explained everything to me. He was very patient and helpful and answered all of my questions.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "113023382180283749032", "name": "Edie Butler", "time": 1567618019307, "rating": 5.0, "text": "Jonathon Givens has serviced our home issues several times and each time he has been professional, courteous, and genuinely interested in correcting all issues with excellent care.  We LOVE our ADT.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "110796622449800635390", "name": "Yvonne McBeth", "time": 1572040898061, "rating": 5.0, "text": "ADT, I had the pleasure of meeting Dakoda Blietz today.  He had come to installed additional equipment in my home.  I just wanted to thank and praise him for a job well done. His excellent customer service skills, his professionalism,  his patience and his thoroughness was 5 Star.  He answered my questions, asked again if I had any more question.  What  really impressed me,  was how he communicated back to the  ADT.  He repeated back to the office what he understood them say during the conversation for clarity.  I am retired 30 years in the utility industry  in customer service.  I rarely hear or see such committed service to ensure the customer is taken care the first time.\n\nPlease thank Dakoda for me again!!!!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "108032616730463248098", "name": "MIKE COSBY", "time": 1558382905637, "rating": 5.0, "text": "Scott Chamblin was awesome! He was very Professional and on time. He made sure he answered all my questions and walked me through the ADT app, and made sure i had a full understanding of how you use my app. Thanks Scott!!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "102543843397394672565", "name": "Kyle Nichols", "time": 1559426884866, "rating": 5.0, "text": "Scott Chamblin was very helpful with our out of date system. Fixed us up with a new system and made our home protected. He was professional and personable. Overall, very pleased with our ADT service.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "111111360918290092058", "name": "Anthony Channell", "time": 1563539270753, "rating": 5.0, "text": "I have had my ADT system for 90 days.  My Security Specialist, David Jackson, regularly checks with me on my system to make sure everything is going well.  He is most courteous and anxious to make sure I love and understand my security system.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "118383871042527160593", "name": "Robert Marshaljr", "time": 1564796941297, "rating": 5.0, "text": "Joanthan Givens repaired my ADT Security system at 2452 County Road 112, Dothan, Al in a very professional matter.  He is a great person to work with  and makes sure your system working right.  He is very hard worker.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "116800409984556398479", "name": "Vic Harris", "time": 1561047349708, "rating": 5.0, "text": "David Jackson helped my mother Dr. Ella Bolling Harris, yesterday on June 19th 2019. My mother had been given the run around byanother representative in a different state and due to that was planning on leaving ADT. But thanks to Mr. Jackson's knowledge, personable attitude and professionalism my mother continues to be a customer and a deal was made that accommodated her needs.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "114964724235281021300", "name": "Cyndi Harrell", "time": 1562696761005, "rating": 5.0, "text": "Mr. Givens was an excellent ADT Tech. He answered all our question made sure we knew how to work the system. Great job", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "103592236348967611146", "name": "Stephen M. Wright", "time": 1553454220922, "rating": 5.0, "text": "Scott Shamblin was a total professional.  He explained the tasks completed and answered all my questions.  His professionalism was evident from the time he arrived until the job was complete. Kudos to him.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "108831394462764944954", "name": "Mary Evans", "time": 1557428704266, "rating": 5.0, "text": "David, sales representative, is personable and kind. Set us up for ADT and technicians sent did a great job!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "100021371062785215119", "name": "Ginger Hicks", "time": 1560293452421, "rating": 5.0, "text": "Jonathan Givens was very professional, knowledgeable and helpful to me.  He answered all my questions and was very nice", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "104626306103436017264", "name": "Lynn Hale", "time": 1552510364943, "rating": 5.0, "text": "David diagnosed the problem correctly, had the gear and hardware to fix it, and completed it without any fuss. Took the time to go over everything with me, and answered all my questions. Well done, David - Thank you", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "111075086510352649116", "name": "Mark K.", "time": 1563985208149, "rating": 2.0, "text": "I called ADT to request service/repair of 3 year old system, which was installed by ADT. Telephone Representative very helpful in setting up appt. She told me that there would be no charge for the service call as our monthly charge includes the warranty. Service appt. was for the next day - very quick in getting an appt. Service tech - Jonathon Givens - had to replace two door sensors. He then proceeded to tell my wife that our system was outdated and needed to be updated. He offered to update it for a $100 fee. My wife told him she would have to speak with me first before we agreed to anything resulting in a charge. Jonathon then asked my wife how long had we had our system. She told him three years in our current home and approximately seven years in our previous house (total of approximately ten years with ADT.)  He then said he'd go ahead and update our system for no charge, which he did. What was that about??  Offer to update the system for $100?  Would that be considered fleecing a client? And if he was going to update the system for $100, does he pocket the amount, since he updated the system anyway. Kind of \"sketch\" as the kids say these days.  I have not been impressed with ADT monitoring services in the past, and only continued service with them after the 2 year contract (at which time they were going to increase my monitoring price $10/month.) They agreed to keep it at the same rate as long as I agreed to another 2 years.  When the 2 years are over, I'm finished with ADT.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "112781402512861625953", "name": "Charles Hill", "time": 1560896187543, "rating": 5.0, "text": "ADT was here on time.  Tech ( Dakoda Blietz) was outstanding.  Very Polite, nice & professional young man.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "107476254934977971428", "name": "OLUSINA AKINDURO", "time": 1560023112026, "rating": 5.0, "text": "Jonathan Givens was very professional, courteous and did an exceptional job in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "106798747892668822121", "name": "Adnan Sabir", "time": 1607793168931, "rating": 1.0, "text": "Extremely dissatisfied.", "pics": null, "resp": {"time": 1607862328989, "text": "Yikes Adnan!- We're very sorry to learn of your unsatisfactory experience as an ADT family member! Please email our team directly at Alwaysthere@adt.com with more info in regard to your issue and the full address in which the services are located, so we may help you further. ~ Thank you"}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "108378543961214611521", "name": "Jay Williams", "time": 1541472952780, "rating": 1.0, "text": "I was an 11 year customer of ADT. I was excited to move to a new home and take ADT with me. Unfortunately my mom passed away the day before ADT was set to install. Even under all that pressure I remembered to call and cancel the install while I was out of town. I've been out of pocket for weeks trying to handle mom's business, grieve, and still live so I haven't had a chance to reschedule. ADT proceeded to still charge me two months of service at my old location even though they knew I had cancelled the service at my old house. When I caught it, the call center manager told me that they still bill you 30 days after you cancel. I asked about the other month and she said \"oh we prorated that and took it out of your installation fee.\" So I prepaid $100 for an install that I didn't get. And they took money out of my installation fee for two more months before I caught it. All this while they say sorry for your loss but...at least we gave you back the second month. So instead of $100 back I got about $50. Even during our time with them we were paying several months during one of their glitches and they weren't even monitoring my home.\n\nNo more ADT for me. EVER. And I'll let everyone I know not to get ADT. There are other options now.", "pics": null, "resp": {"time": 1541529605945, "text": "Hello Jay. Our condolences for your recent loss! We'd like to look into your concerns further to help. Could you please email us the phone number and address associated with your account to AlwaysThere@adt.com? Thank you. -Andrew"}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "109513736843071221838", "name": "Katie Roby", "time": 1558118059831, "rating": 5.0, "text": "Scott Chamblin updated my security system today. He did a fantastic job of installation and instructing on the usage of the updated technology", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "106983195951972019318", "name": "Michael Washington", "time": 1553081702383, "rating": 5.0, "text": "David was professional and helpful !", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "100694931449489644383", "name": "Alberta Giles", "time": 1542728105897, "rating": 5.0, "text": "Excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "116884129087686646052", "name": "John Smith", "time": 1610561692842, "rating": 5.0, "text": "I had a great experience with Buford’s. JD (I think his name was) was quick and efficient. He also did a great job of communicating with me throughout the process of ordering me a new key fob and coming to my house to program it. Additionally, he came in UNDER budget! That’s never happened to me with a locksmith before. Very impressed!", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "111097049403172482066", "name": "Elroyce Williams", "time": 1613325152909, "rating": 5.0, "text": "My experience with Buford has always been a pleasant one. They are professional and helpful with timely advice and repairs that you don't have too return for them to get it right. They get it right the first time...", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "111243693173181680930", "name": "Ashley Harris", "time": 1619763100660, "rating": 5.0, "text": "Always knowledgeable and willing to go the extra mile (pun intended).\nStaff is always courteous and friendly.", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "108715192497663807342", "name": "Teisa Teonna", "time": 1621737699723, "rating": 5.0, "text": "I called them to my location and they was out there in less than 10 minutes. The gentleman was able to unlock my car doors in seconds, professional and proficient.", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "100446741149565205183", "name": "Hannah Berman", "time": 1605914227161, "rating": 1.0, "text": "Used this company to replace a front door knob. Technician was great but walked off with my extra key and told me to pick it up at the office. Showed up to the office, but I was two minutes late. Woman came out with an attitude telling me they were closed, yelled at me about not having paid when I paid yesterday, and the technician had the key in his van, so both our times were wasted, even though I paid for the service and the technician had my key. I will spend the $5 to have my own copy made just not to deal with this place again.", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "109491104708789303166", "name": "Seth Lockett", "time": 1601505103492, "rating": 5.0, "text": "They literally saved me hundreds of dollars!!!! I highly recommend this company! Fast, friendly service with a very knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "103814306796437126182", "name": "Justin Russell", "time": 1607620019330, "rating": 5.0, "text": "Got us back up and running with access to our tools in 15 minutes! These people are amazing", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "107310306035962903391", "name": "bird 23gut", "time": 1610818329499, "rating": 5.0, "text": "Excellent, friendly customer service and quick  response time.", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "107502699567295500522", "name": "Randie Watkins", "time": 1609194846039, "rating": 1.0, "text": "I just called and the lady that answered the phone was rude as heck. I will not be using this company.", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "117505106272872169456", "name": "Ann C", "time": 1579625259130, "rating": 5.0, "text": "I had to have a new fob for my Lexus. I ordered a fob to be programmed trying to save money. JD came out & programmed my bought fob. It only unlocked to doors when done. It was raining, late in the evening... close to 6 pm, and I was completely exhausted. JD went above and beyond. He went back to the office, got me a good fob came back & programmed it. He was very patient & went above & beyond the call of duty. Thank you JD. Buford's you ROCK!!!", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "112626685495418380788", "name": "LaMeyah Law", "time": 1587487782911, "rating": 5.0, "text": "I will recommend them to anyone. The guy who came out was very polite and understanding. So for that thank you thank you thank you !", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "102710617383080497353", "name": "Melba Ward", "time": 1619693720687, "rating": 5.0, "text": "High, Expensive, Fast", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "100513016402799849563", "name": "Mary Smith", "time": 1570559088376, "rating": 1.0, "text": "Call them out to open safe they opened the safe did not leave clear directions with combination cost$150.00 called them again because it would not open with the combination given came back out after multiple tries opened the safe wrote out directions even though he had trouble opening it cost $85.00 then on third call after multiple people attempted the combination left could not get into the safe they will come back out for another charge . Not happy at all they should come do the job correctly or explain the dial is messed up or something . Not recommended", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "103589818393618620423", "name": "Jessica Lopez", "time": 1596064537509, "rating": 5.0, "text": "I was locked out in the rain and they were there in no time.  Thank you Buford's Locksmith", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "111214498615734428002", "name": "Shane Smith", "time": 1549733051067, "rating": 5.0, "text": "My wife and Daughter were in town for a volleyball turnement. My Daughter locked the key fob in the SUV. I called 5 other companies\nThat told me they couldn't get their employees\nTo answer their phone or they just didn't want\nTo work. So when JD answered and took care\nOf my family within 30 minutes of calling him.\nI was blown away with his quick response time. He was so nice it put mind at ease.", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "107266279226486624428", "name": "Jarvis Jones", "time": 1581293310447, "rating": 1.0, "text": "The owner or whomever answered the phone with an attitude and talked with disrespect. Jacked the previous price of $400 to $500 because he was upset... Terrible professionalism. A freaking shame.", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "112935964272781819250", "name": "Johnbibby08 @gmail.com Tuscaloosa 06", "time": 1564582154671, "rating": 5.0, "text": "Bufords Locksmith and Security great business to deal with affordable prices and fast customer service. I will be a repeat customer from now on. Thanks for the help today.", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "113001077519678960455", "name": "Kenneth Ridgell", "time": 1537713404372, "rating": 5.0, "text": "Best response time in town, by far. Advanced in ability to work with even smart cars such as our Mercedes Benz. No one else in town would attempt to work on it and told me we were stuck until Monday. Thank God for professionals like this company!", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "105969115230644930472", "name": "Jayla Hargrove", "time": 1572408511616, "rating": 1.0, "text": "The Worst Locksmith Company EVER.I Called For Service For My Car They Took My Information But No One Ever Showed Up I Waited A Hour & A Half For A Locksmith And He Never Called Or Nothing.This Is Very Unprofessional Please Do Better As A Company Too Take Care Of Your Customers..", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "103750346457568919078", "name": "Remy Helu", "time": 1566914398723, "rating": 5.0, "text": "Great people great service great price!!", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "112833035795278445753", "name": "Lee R", "time": 1591093280855, "rating": 5.0, "text": "Very professional in the service they provide. I hope I don't need keys for this vehicle again, but they are now my Go to company for key and security topics. I was not aware of all they provide untill this visit.", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "109953676152889021042", "name": "william ivory", "time": 1601133831969, "rating": 5.0, "text": "Great job", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "100772107382408091954", "name": "Jasmyne “FatGirlish” bay", "time": 1501799983587, "rating": 5.0, "text": "So helpful!!!! I called them 10 mins before closing asking if I could come in for a new replacement key. She told me come on! I get there and was told I would need my car to get new key programmed.. well I didn't have my car because I broke the only key I had for the car! In complete dispar one of the guys came out and asked if I had the key that broke I almost screamed yes.. he says well we can take the chip out of that one and put it in a new key!!! I almost hugged him!! lol I had just left a dealership that was trying to charge me $175 for a new key and never told me this could have been an option!! I walked out of there at 5:05 with a new key that's works!!! Thanks so much guys!!", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "103786828451564946434", "name": "Brandon Owens", "time": 1509465995239, "rating": 2.0, "text": "Kept getting different times in when they would arrive.  Never showed before getting a commitment out of another locksmith.", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "108243408944460509376", "name": "Derek Wong", "time": 1506624356614, "rating": 5.0, "text": "Professional and Reasonable priced, highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "116841342541647616969", "name": "Jordan Alexander", "time": 1493522405885, "rating": 5.0, "text": "If I ever get locked out of my apartment again (hopefully not), I'm calling them.", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "103788122613665588306", "name": "Renee Rivera", "time": 1546392128230, "rating": 5.0, "text": "Quick and easy .", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
{"user_id": "117217498156392941278", "name": "Yasemin Webb", "time": 1556648285939, "rating": 1.0, "text": "0 customer  service", "pics": null, "resp": null, "gmap_id": "0x8888a9e9f69d2f81:0x8a06d2755ddd66b"}
