{"user_id": "114515934938416672201", "name": "Anita Eubank", "time": 1621200659838, "rating": 4.0, "text": "Black Widow Chimney Sweeps came for an inspection and chimney sweep. They gave me an inspection and cleaned our chimney to having it looking like new. They were quick to come, the next day after I called, and did a thorough and wonder job in all areas. I was totally satisfied with their work. They stayed close to the estimate I was quoted and did a great job all within a couple of hours. They took great care to keep the inside of my home clean as well. Very satisfied with their work and would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891a4f1df93545:0x74862f95b3dad52c"}
{"user_id": "110290040646634383020", "name": "Jeff Cornelius", "time": 1615320466538, "rating": 5.0, "text": "Had a great experience with Black Widow Chimney. They converted the fireplace from had to wood burning, added a natural gas starter, and repaired the chimney cover. They were courteous, quick to respond, and did a great job. I would definitely recommend them and use them again.", "pics": null, "resp": null, "gmap_id": "0x88891a4f1df93545:0x74862f95b3dad52c"}
{"user_id": "108337404331966750821", "name": "John Timson", "time": 1615854966438, "rating": 5.0, "text": "Patrick and  Cameron were a pleasure to have in our home. The work was completed in good order and a the cost that I was told beforehand.  If  you have any fireplace issues call BLACK WIDDOW.", "pics": null, "resp": null, "gmap_id": "0x88891a4f1df93545:0x74862f95b3dad52c"}
{"user_id": "112117004667785821247", "name": "Andrea Lucas", "time": 1602796895808, "rating": 1.0, "text": "I wish I had read these reviews before hiring Black Widow to do an inspection on our new home that had 3 fireplaces and we wanted to make sure they were 'wood' ready. After raving about the skill level of the mason that built these fireplaces in 1986 they still came up with several issues that had to be dealt with including cleaning, to the expense of OVER $5,000. We were appalled at the price because we do have some knowledge of masonry. Had someone else come out who said our fireplaces were good to go...did not even need cleaning as they did not appear to ever have been used for wood. I've never had a bid before that I thought was almost criminally high!", "pics": null, "resp": null, "gmap_id": "0x88891a4f1df93545:0x74862f95b3dad52c"}
{"user_id": "108573913227812538486", "name": "katherine tucker", "time": 1615177190961, "rating": 5.0, "text": "They made our super old, used, and neglected fireplace like new!  👏🏼 💯", "pics": null, "resp": null, "gmap_id": "0x88891a4f1df93545:0x74862f95b3dad52c"}
{"user_id": "106705933878651557307", "name": "Felicia Scalzetti", "time": 1512581207751, "rating": 5.0, "text": "I had an amazing experience with these gentlemen. They kept me informed at every step, were more than willing to explain what they were doing and why and did an absolutely wonderful job. Could not recommend them more highly.", "pics": null, "resp": null, "gmap_id": "0x88891a4f1df93545:0x74862f95b3dad52c"}
{"user_id": "103047225937755520180", "name": "Kelly Grimes", "time": 1515081940323, "rating": 5.0, "text": "Worked with Cameron and his brother on several issues with my chimney. They worked very quickly, responded to my making an appointment on very short notice, and gave me lots of good advice. Will definitely use them again in the future. Thanks!", "pics": null, "resp": null, "gmap_id": "0x88891a4f1df93545:0x74862f95b3dad52c"}
{"user_id": "107470359940271761700", "name": "Kathy Turner", "time": 1503931999217, "rating": 1.0, "text": "Watch out for this company  - I got a quote to do a chimney sweep and inspection from a competitor for $169 - a discounted price since it was August.  I mistakenly texted this company to reschedule my appointment (thinking I had called the other company).  Carmen knew I was not his customer and he took advantage of the situation.  After the inspection and cleaning was done - he would not accept the quoted price of his competitor and made me pay $249.  This was $80 more!!!!  I objected and reminded him it was \"August\" and I was given the $169 quote as a Summer discount.  He raised his voice at me and was completely unprofessional - to the point where I told him to leave.  Lastly, he had me make the check out to him personally, which raises some other questions.  I would not recommend this company!", "pics": null, "resp": null, "gmap_id": "0x88891a4f1df93545:0x74862f95b3dad52c"}
{"user_id": "100397103450225860174", "name": "niki ferguson", "time": 1613956793755, "rating": 4.0, "text": "Shayne and his crew did a great job building our retaining wall and walk way for us.  They showed up on time, clean up after themselves and were really nice. Our pavers that are around our pool got discontinued and Shayne went above and beyond to try to find pavers that matched as close as possible to what we had.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOV025KQeuvaOk0KauumTFTMDDOrh3wX1QIXj5s=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP9130OzM9oXsah7rEiJXXL3ZjT_ZkGzKhATAz8=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
{"user_id": "113428867666718924846", "name": "Alec Ross", "time": 1590804421340, "rating": 5.0, "text": "Needed a footer added on to my existing patio. Came in at a great price and quick response. Always friendly great quality of work. The team that came out was great and worked fast. Will use again! Give them a call!", "pics": null, "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
{"user_id": "117280148075030443179", "name": "LeWaire Waycaster", "time": 1576811336932, "rating": 5.0, "text": "Bayshore has completely landscaped our home including custom lighting and a circle drive. I wish I could give them the stars!! They always go above and beyond to provide excellence.", "pics": null, "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
{"user_id": "114486160015174910471", "name": "tiffany passarelli", "time": 1599528600564, "rating": 1.0, "text": "Very unhappy!  12 months later and we are still waiting on major warranty work to be performed.  Shayne will not return our phone calls, text messages or emails. He took our money and ran....", "pics": null, "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
{"user_id": "106905909530809960403", "name": "Steve Perry", "time": 1554678186925, "rating": 5.0, "text": "Shayne and the guys at Bayshore have done several projects (flower beds, fire pit, pergola, sod replacement, sod replacement and maintenance) at our house and have done a wonderful job. Shayne is great at providing attention to detail and ensures that you are pleased with the project. Highly recommended!!!", "pics": null, "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
{"user_id": "114012249527997396237", "name": "Amymarie McKnight", "time": 1554835121491, "rating": 5.0, "text": "Bayshore Landscapes has been maintaining my lawn for over 6 years. The guys are hard workers & always do a professional job!  They have great costumer service skills. I highly recommend Bayshore Landscapes!!\n\nAmy McKnight", "pics": null, "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
{"user_id": "100742908492112190911", "name": "Kevin Brane", "time": 1554514750690, "rating": 5.0, "text": "The folks at Bayshore Landscapes put in an outdoor kitchen for us. Excellent job, timely and professional. We were very pleased. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
