{"user_id": "117740107684788415219", "name": "Bernard Hill", "time": 1623211442142, "rating": 5.0, "text": "The work that these guy do are amazing. The 4 large trees kept the sun from fully shining in our backyard and when the first tree fell we could see the difference. The guys seem to work well together and they clean up was professional and thorough. I will recommend this company to others. Great job!", "pics": null, "resp": {"time": 1624052558746, "text": "Bernard, we are pleased to serve you.  Our crew and office staff our happy to know that you're happy and satisfied with our services. Thank you so much."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "118064930732914700755", "name": "Kelly Campbell", "time": 1622341358090, "rating": 5.0, "text": "National Tree Service removed three really large trees for me. They were quick, professional and did a really impressive job. I would absolutely use them again and would highly recommend them to you too!", "pics": null, "resp": {"time": 1624053000883, "text": "Miss Kelly, we thank you for allowing us to serve you. We are so glad that we've met your expectations. Your positive comment made our crew and office staff proud. We will continue to strive harder to provide quality tree services to our dear clients.  We appreciate you a lot."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "116755734014907944057", "name": "Jaime and Elsa Hensley", "time": 1617326778552, "rating": 5.0, "text": "Recent storms/strong winds caused a very high pine tree to topple over. It was close the street and over our driveway. National Tree Service was the most responsive company to help out with our emergency. They offered great pricing and within an hour were at my house to cut up the tree. Anthony and main office maintained me updated as they cleared up the toppled tree. Anthony went above and beyond to get this unexpected project taken care of.", "pics": null, "resp": {"time": 1624053244578, "text": "Dear Jaime and Elsa, Anthony and the rest of NTS crew work really hard. Hearing good and positive reviews from our clients really make their day. Thank you so much for trusting National Tree Service for your tree service needs."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "104296395834497181896", "name": "erica dozier", "time": 1615411509382, "rating": 1.0, "text": "Be sure to do thorough research. Wish I had. I saw the BBB rating without reading current complaints.  The tree was removed but the stump grinding, which I paid for, was not performed. I have contacted the company twice but received no response. I will file a complaint the the BBB, if only to record the service. Hopefully more people will read the complaints and the BBB will reflect this in the company's rating. They are dishonest and unprofessional.", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "118221416308192433948", "name": "Jared Wilkinson", "time": 1612026056448, "rating": 4.0, "text": "Had NTS come out and quote me on a tree removal. They were double what a competitor quoted. When I gave him the number he said he would do it for that, so be sure you get multiple quotes before using them. He said they would be out the next day at 10-11am. They showed up at 2p the next day, which is fine, and proceeded to cut down the trees. They did a great job with the removal and cleanup to the curb. The minus one star was for the person who came the next day to pickup the debris. He got all of it which was great but left 4\" gouges in the yard which I had to dig out and fill up.\n\nI do think you should give them a shot and if they are the best price, use them. Just be sure to check around when having work done to get the best price.", "pics": null, "resp": {"time": 1612034433315, "text": "Jared, we appreciate for giving us the opportunity to serve you and for your positive review. We will keep on striving to improve  to provide our clients a safe and cost effective solution for all their tree service needs. Thank you."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "104761359050840113113", "name": "Philip Gannuscio", "time": 1607077830658, "rating": 5.0, "text": "I recently had National Tree Service out  to my home to remove several large pine trees and grind a couple of  stumps. Nationals representative, Anthony Taylor, came out to give me a quote. He was extremely professional and really knew his stuff.The next day Anthony and his crew showed up and removed my trees , handled my stumps , and cleaned up any and all branches and debris. I was very impressed with the professionalism of the entire  company. Anthony ( and National) delivered what they promised and I have already referred them to clients , neighbors, and family members .Truly awesome company", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "117681376067126982628", "name": "James Taylor", "time": 1616816665058, "rating": 5.0, "text": "Great knowledgeable staff! Very fast, responsive and friendly! Give them call for all your tree needs!", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "113504527987025275896", "name": "The Good, Bad & Ugly Properties", "time": 1588301114659, "rating": 5.0, "text": "AwEsOmE!!  National Tree Service did an outstanding job cutting a tree for us. I was working with my sons on a screen printing job &  told him I’m stepping out to grab a bite to eat & see how those tree cutters are doing. On the way I stopped by our property & saw NTS already finished & left. I snapped a photo & texted a son who was also amazed. Towards the end of the day I thought to myself  I'll email or call them to ask what's the quickest way I can make my payment because we are happy customers. When I sat down at the computer, voila! NTS already emailed me the invoice which allowed me to conveniently make  payment online. As we folk in Alabama say, \"Gracias\". Thanks for your assistance National Tree & I look forward to calling you again. – Antonio Espinoza", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN19wVTvZ0aMxvrhxmzcHpRwazQrx_INin_ssHt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPgAXLjd0qziPGDHHrJPu-ATkv6RokK1JxPbQjP=w150-h150-k-no-p"]}], "resp": {"time": 1624053553512, "text": "Mr. Espinosa, we're so glad that you're happy with the tree service we provided to you. We work hard to make sure to provide our dear clients the quality service they deserve. Thank you so much for allowing us to serve you. Of course, KUDOS to our crew members...nice job guys! You made National Tree Service proud!"}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "110115031730950448159", "name": "Ryan Hoffman", "time": 1590520227927, "rating": 1.0, "text": "This is by far the most unprofessional company I have ever hired to do work at my house. To begin with, the estimator came out and gave me a price on having 2 trees cut down and having the stumps ground - trees are in the back yard behind a locked gate. I was told to expect a phone call that afternoon for scheduling. After 3 days I called the office and was told that they never received my estimate but they would put me on their schedule. A date was set and then was moved several times. I scheduled someone to come do bobcat work around that date as well. I then received a call asking if they could come that day (Thursday) and do the work. I said yes and left my office to go home and meet them. They finally showed up around 4:45 in the afternoon and got one tree down and told me that they would be back at 8:30 am the next day. I had to call the office at 3 pm to see if they were still coming to finish the work since I had to take another day to stay home from work. I waited to hear back and was told that they should be out sometime that afternoon. The crew finally showed up around 5:30 pm. They were able to get the second tree down but did not have the equipment to grind the stumps and I was told that they would come Saturday morning to finish up. Saturday came and went without anyone showing up and no phone call. The following Wednesday I get a call from the office asking if I was happy with the work and to confirm that they had removed all the debris from my yard, I told the person on the phone that they were not supposed to remove debris but they were supposed to grind stumps. She was unaware of this and said that she would make a note of it and have someone call me. Later that afternoon I got a phone call letting me know that someone would be out the next morning to grind stumps. I waited the entire day at home after taking off work, again, and NTS was again a no call no show. At this point I gave up on having anyone come complete the job. A couple weeks later, the company showed up without calling to try and finish grinding 2 stumps. The guy told my wife that he couldn't finish because there was some concrete and rocks that the didn't initially see and that he would need to come back later to finish the work. At this point I have had to call and cancel on my bobcat guy twice, which has cost both of us money. This job was started in April, and it is now the end of May. If you don't have anything to do and want to work with a company that is completely incompetent with communication, then National Tree Service should be ok. Otherwise, do yourself a favor and stay clear.", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "110066589077742326221", "name": "Ismael Torres", "time": 1596580371649, "rating": 1.0, "text": "Don't use their service, repeat don't use their service. On July 29-2020, they send Samuel to price a job. Now the day before coming to do the work one of their employees came to tell us that Samuel the guy they send to price the work they would be doing, is not qualified to make the quote. The guy that came today from the office said that the job is $2,500 more on top of the quote. This is unacceptable and shows how unprofessional they are. For that reason I don't recommend them.", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "108782980942136403473", "name": "Vic Mobley", "time": 1591294736338, "rating": 1.0, "text": "I called to see if they had firewood and asked what time they close. I drove out there at appox.12:30-12:45 in the afternoon.  When I arrived ALL THE PARKING SPACES in front of the business were filled with cars. I parked along the road and went to the door s and they were locked, didn't see anyone inside so I knocked then went to my car, drove inside the fence to the building and yelled inside, \"Is anybody here?\", and no one answered....So I left.", "pics": null, "resp": {"time": 1591300325599, "text": "I apologize for the inconvenience Mr. Mobley. We were out for lunch when you stopped by and crews were out cutting trees down that's why no one was at the office. I hope that you let us know when and what time you would come to make sure that somebody will be at the office to accommodate you.\nThank you."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "104452762603071496122", "name": "Brian Kendrick", "time": 1571057125935, "rating": 4.0, "text": "Communication is the key to any business. I can't say enough about the hard work the crew put in to get the job completed. After some equipment issues, NTS returned and finished the job. The quote and pricing was below other competitors and the professionalism shown by NTS is first class. I would definitely recommend this company.", "pics": null, "resp": {"time": 1570660798929, "text": "Brian, you are right, communication is the key to success. We apologize for the inconvenience it may have caused you. We will handle this matter and ensure that the communication between us and our clients will be improved. Thank you so much for trusting your tree service needs with us."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "106212256307329523196", "name": "Daniel Minor", "time": 1554511974334, "rating": 5.0, "text": "Awesome VERY Professional Job done here. The staff was very friendly and the work was done as requested. I have 5 more problem trees in my back yard that will need to go. I will be calling again soon. Thank You!!!!!!!", "pics": null, "resp": {"time": 1556650096616, "text": "Hello Daniel! Thank you for the compliment. Our goal is to satisfy our clients. And we're very glad that you are happy with our services. Just give us a call when you're ready to work on your other problem trees. As always, we'll be honored to work with you again. We appreciate you so much!"}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "117842333886288827051", "name": "Ashmen000", "time": 1563580245457, "rating": 1.0, "text": "Took three days of calling to finally get a rep to come to the house and give an estimate.  Rep was hours late from when they said he would be there.   Tree was scheduled to be cut down 2 days later at eight in the morning.  Crew never showed up.  Called the office and said they would call back with what was wrong.  Never got the call.  We used this service a few years ago and it was night and day difference in the response and price.", "pics": null, "resp": {"time": 1563807421308, "text": "Ashmen000, we are not going to make any excuses for what happened. You're absolutely right, the fault is on our side. The scheduling was mishandled and we deeply apologize for what you've experience with us lately. On the other hand, we appreciate you for informing us about this incident. We will definitely look into this so it won't happen again in the future. We're hoping that you'll give us another chance to redeem ourselves. Thank you for being a loyal customer."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "109358757279475262263", "name": "gulfdiver 2424", "time": 1556589014133, "rating": 5.0, "text": "Trimmed two oak trees for me today in Pleasant Grove, very professional, great clean up as well, best price in town, definitely my new tree guys and would recommend them hands down", "pics": null, "resp": {"time": 1556650389521, "text": "Thank you so much for the nice words. We strive to please our clients. We are so glad that you are very satisfied with our services. We appreciate you so much."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "118012145115068463066", "name": "Tammy H. Bridges", "time": 1464789898785, "rating": 5.0, "text": "Great company with great service every time! Call this company any time  you need a tree cut down or any other type of service. They are the best by far in the city!", "pics": null, "resp": {"time": 1464792636122, "text": "Thank you Tammy! Call us anytime!"}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "105194007578520382860", "name": "Stanley Bolling", "time": 1464827880171, "rating": 5.0, "text": "I had very large 30 yr old tees near my house and NTS removed them all in a timely and professional manner.  I recommend them to anyone who has low hanging trees near their house.", "pics": null, "resp": {"time": 1464834486246, "text": "Thank you so much for trusting us with your tree service needs, Mr. Bolling. I'm glad that we've met your expectations. We truly appreciate you."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "110960072890262395861", "name": "Greg Case", "time": 1412344613590, "rating": 5.0, "text": "I am surprised at the people who are writing anonymous reviews and claiming bad service.  I have used National Tree Service on several occasions over the years.  They are prompt and courteous.  They do a GREAT job and you can barely tell that a tree was ever there.  They did no damage to the yard other than a place where a limb hit when the tree came down, and that was only one time (out of four). If you are having trees removed, dont use anyone else.", "pics": null, "resp": {"time": 1464186147770, "text": "HI Greg! Thank you so so much for your review. We truly appreciate you and your business. Please call us anytime you need us! :-)"}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "102166171749634828671", "name": "Cathy Fingerman", "time": 1464859733660, "rating": 5.0, "text": "National Tree Service gave me a free estimate and did the job for that very competitve price. They were on time, very professional and cleaned up after themselves. I would call them again for any tree service that I would need. I highly recommend them.", "pics": null, "resp": {"time": 1465224423664, "text": "Thank you Cathy! Call us anytime!"}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "105782898566687162981", "name": "Ricky Isip", "time": 1519956096408, "rating": 5.0, "text": "As a man of few words, this company does Professional and Excellent job at Reasonable Cost.  Enough said!", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "101165755469643437648", "name": "David Burroughs", "time": 1459534883002, "rating": 5.0, "text": "Very professional and friendly.  Once complete, they asked if everything was to my satisfaction and cleaned up the work area.  I would use them again, and would recommend them to others.", "pics": null, "resp": {"time": 1464186095973, "text": "Thank you David for your feedback! Please call us anytime!"}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "108406048937793093718", "name": "George Barnett", "time": 1280088490174, "rating": 5.0, "text": "Everything you want in at tree service. Experience, reasonable rates, and great customer service. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "104758917159718927654", "name": "Rach Hill", "time": 1413299957700, "rating": 5.0, "text": "National Tree Service is a GREAT company!!!  Removing trees is not as easy as going to Wal-Mart.....National Tree Service is insured and alot of places who are \"cheaper\" are not.  Also Mr Peppers has been in this business for over forty years.  If I needed a tree removed close to my house or on my property I would call National Tree Service.  They are family owned, insured, and are trained in dangerious tree removal.", "pics": null, "resp": {"time": 1453163426831, "text": "Thank you so much, Rach Hill."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "104820869135053716717", "name": "Nolan Hutchins", "time": 1582129057483, "rating": 5.0, "text": "Who was the greatest experience", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "116004755302775676306", "name": "Bruce Resp", "time": 1534458424103, "rating": 1.0, "text": "I  wasted half my day waiting for NTS to arrive at my home as scheduled.\nReceived a call around 5:00pm asking to reschedule. I actual have appointments that I intended to keep this week", "pics": null, "resp": {"time": 1544477840537, "text": "We apologize for missing your scheduled appointment.  We never intend to be late to anyone's home as we understand your time is just as valuable as our our time.  Unfortunately, we got behind and were delayed and are sincerely sorry for your inconvenience."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "118230273860685719351", "name": "john leddy", "time": 1411300662721, "rating": 1.0, "text": "Too busy for my money.  Missed several appointments for quote.  Finally we called and claimed i cancelled the appointment.  Another company got my money.", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "115342330324769883044", "name": "Jonathan Rose", "time": 1403213331135, "rating": 3.0, "text": "deformation of character.........?", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "111136063966236197424", "name": "Jose Manuel Arias Diaz", "time": 1529624459913, "rating": 2.0, "text": "(Translated by Google) The place is good\n\n(Original)\nEl lugar es bueno", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "106292078714580907735", "name": "Mike P", "time": 1627745686674, "rating": 5.0, "text": "My parents recently hired this company to take care of some heavy pruning for a large magnolia tree.  As it turned out, they needed some additional work and the guys on site were more than happy to take care of the work.   My parents don’t use Google reviews so they asked me to add their experience since they were so pleased with this Company, it’s employees and their great service.", "pics": null, "resp": {"time": 1628031795779, "text": "Thank you for your kind words.  We appreciate you and your parents."}, "gmap_id": "0x8889120e1a7f4aef:0x4477ceeb247c2bd0"}
{"user_id": "104805103413051360248", "name": "Lawana Rooks", "time": 1619477481474, "rating": 5.0, "text": "I highly recommend Action Tree service! Dennis and his crew removed two large fallen trees from our home after the recent tornado damage in South Roebuck. Action tree service kept their word and had the trees removed the same day. Excellent customer service!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNOx90fE1kd140GNayV8I6JzacT4CgV84SxrSpo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNMLKFSVQkepp2R20gUihoZxBfYqj2hik7UCJfE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOSvHXaufpByU643Y89lgCO4Gu1Za8hiJk_tfFk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOV6NqKiLbQ_VNHOzUQ1Waese9VjeXdCN2JmMQM=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889120e1a7f4aef:0x4477ceeb247c2bd0"}
{"user_id": "106131406044972486275", "name": "moe money", "time": 1622560277847, "rating": 5.0, "text": "Best tree service in town .", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMUdVFT86LX13tle9EKC4R_attq1MtO2GpqU1SH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOaRDAjaGTAbArB8riBcsZ9e085NqU0-9v1SbcV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMpsvzupLqUUx03lHjkSLl9k80FWnmIAgGc9MfS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM5cjERR-HaxT-5kMmYfK4vK-ZkiG4AlhjG5Ddj=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889120e1a7f4aef:0x4477ceeb247c2bd0"}
{"user_id": "113821578082340718960", "name": "Jake Hodges", "time": 1579219989803, "rating": 5.0, "text": "Had a large tree come down across the driveway. Called Action and they were there within minutes.\nDennis and his crew did a great job and cleaned up afterwords. Highly recommended.", "pics": null, "resp": {"time": 1579226901417, "text": "Thank you Jake for your kind review.  We enjoy our work and are happy to work for you."}, "gmap_id": "0x8889120e1a7f4aef:0x4477ceeb247c2bd0"}
{"user_id": "106478852562664345929", "name": "Clement kouassi", "time": 1585226771868, "rating": 5.0, "text": "I get no word to describe their professionalism I can call tbem flash they sooo speed, they don't care about money, they just wanna make the job done,they are crazy in the good way of the world thanks guys,I give you extra stars 🌟🌟🌟", "pics": null, "resp": null, "gmap_id": "0x8889120e1a7f4aef:0x4477ceeb247c2bd0"}
{"user_id": "114685926555998626284", "name": "E Malone", "time": 1619970049554, "rating": 5.0, "text": "Highly recommended", "pics": null, "resp": {"time": 1620066684824, "text": "THANKS!"}, "gmap_id": "0x8889120e1a7f4aef:0x4477ceeb247c2bd0"}
{"user_id": "113912199972086440829", "name": "jack Terrell", "time": 1578859934295, "rating": 5.0, "text": "That was the most respectful courteous keep up the good work", "pics": null, "resp": {"time": 1578965839732, "text": "You’re very kind, thank you, Monica with Action Tree."}, "gmap_id": "0x8889120e1a7f4aef:0x4477ceeb247c2bd0"}
{"user_id": "112215214138261175298", "name": "Tessa Daniel", "time": 1533074356501, "rating": 1.0, "text": "Needs to teach his drivers to driver or learn himself. Nearly caused an accident by pulling out in front of me on Hwy 31. Then had the nerve to shoot me a bird because I blew my horn at him. I had to slam on my brakes and screech my tires to avoid hitting him.  He pulled out in front of me taking up both southbound lanes of traffic. If your driving a truck pulling a trailer with a bob cat on it , I would suggest you be a little more cautious or I hope that you have very good liability limits on your insurance.", "pics": null, "resp": {"time": 1556807953561, "text": "Heavy equipment (T870Bobcat) pulls out and uphill much too slow for our liking too; we apologize for the inconvenience.  Shooting the bird, or any obscenities, are never acceptable.  Thank you for bringing this behavior to our attention."}, "gmap_id": "0x8889120e1a7f4aef:0x4477ceeb247c2bd0"}
{"user_id": "102951679264131742993", "name": "DavNan Larch", "time": 1622079662578, "rating": 5.0, "text": "Just want to thank Jack being such a wonderful businessman and taking care of fixing our gate. Jamie Stewart is a awesome asset to Hemstock Tree Care. He fixed our fence and replaced our gate in a few hours. So professionally done and such an OUTSTANDING tree company . I would never hire anyone else to tackle my yard work. Thank you Jack and Jamie again.", "pics": null, "resp": null, "gmap_id": "0x88626b7155555555:0x5ffff3872c421ac1"}
{"user_id": "118400227638623414734", "name": "Carl Herring", "time": 1528892431922, "rating": 5.0, "text": "I contacted Hemstock Tree Service to cut some trees and big limbs over and close to my house and shop. The crew came out and did an outstanding job! They were very professional and executed the job perfectly.  I dealt with Cliff, Jack, and Billy about different aspects of the job and they were outstanding to work with! Hemstock communicated with me before, during and after the job. I could not have found a better company to do the job. Thanks to Hemstock, my property is better protected now and I give them an A+++ rating. Carl Herring", "pics": null, "resp": null, "gmap_id": "0x88626b7155555555:0x5ffff3872c421ac1"}
{"user_id": "102399828375700214829", "name": "Larry Crim", "time": 1580490575650, "rating": 1.0, "text": "I contracted Hemstock to cut and remove several trees from my property.\nThey cut the trees but have never removed them.  It has been 12 days and the trees are still laying on the ground.  I've contacted their representative and he keeps promising they will be removed.  However, now they are not returning my phone calls.  I've paid them $3950, but now I doubt if the trees will ever be removed.", "pics": null, "resp": null, "gmap_id": "0x88626b7155555555:0x5ffff3872c421ac1"}
{"user_id": "112816637478175323676", "name": "calli kittie", "time": 1586353984828, "rating": 1.0, "text": "Ground was too wet and we asked if we should reschedule to avoid damage. They assured us they would not damage yard and brought plywood they did not use. Sprinkler heads were broken, lattice on a shed was broken when the tree fell beside it and they did not bother to tell us. They did not reinstall fence for  2 weeks. Several pieces of equipment  was parked in front of neighbors homes for several days. They left hundreds of broken twigs in the yard and changed the back and side yard to a mud pit.", "pics": null, "resp": null, "gmap_id": "0x88626b7155555555:0x5ffff3872c421ac1"}
{"user_id": "104479356417787108499", "name": "james gibson", "time": 1596121846645, "rating": 2.0, "text": "Never got work done. They missed appointments 3 time. I have been over a month trying to get a tree cut down that is looming over my house. Quoted me a decent price, but I kept getting pushed to the “if we get it” list it seems.", "pics": null, "resp": null, "gmap_id": "0x88626b7155555555:0x5ffff3872c421ac1"}
{"user_id": "105106825097411881252", "name": "The Awakening Enthusiast", "time": 1516641494174, "rating": 5.0, "text": "Absolutely AMAZING SERVICE! The day it snowed last week our heat wasn't working so I called to see about firewood. Even though the weather was terrible and most everyone was shut down the guy still delivered wood to my home in Madison. He was super nice and very prompt. I highly recommend this service to anyone who needs it. If every business ran like this one the world would be a much better place. I will be calling them for all my tree care needs and firewood.", "pics": null, "resp": null, "gmap_id": "0x88626b7155555555:0x5ffff3872c421ac1"}
{"user_id": "106303579938203153852", "name": "Kelli Green", "time": 1377278371331, "rating": 5.0, "text": "If you live in the Huntsville or Madison area, I highly recommend Hemstock tree service.When I called for an estimate, Cliff, the owner came out that day and gave a very reasonable price. They came and did the work the next day. They were very professional and did a great job! I would recommend them to anyone. Thanks so much!", "pics": null, "resp": null, "gmap_id": "0x88626b7155555555:0x5ffff3872c421ac1"}
{"user_id": "111681153477388607059", "name": "TGC", "time": 1491930221423, "rating": 5.0, "text": "We had Cliff and his crew remove two trees on 3/27/2017, both rotted and leaning towards the neighbors house, approx 60-80ft tall. This was a very tough job that needed an experienced professional and the trees were removed safely and successfully. While he and his crew work very hard, what impressed me the most is that he took the time to explain what he was doing to my 8 year old son and teach him about everything that was happening because he was very interested. We had a dead tree next to the ones coming down that had some limbs damaged by falling branches so he instructed his crew to take that down too, that was nice. His team cleaned up and hauled away/chipped the wood quickly and left the yard cleaner than when they got there. I would definitely recommend Cliff and Hemstock Tree Care to anyone needing tree removal, we will be using them again.", "pics": null, "resp": null, "gmap_id": "0x88626b7155555555:0x5ffff3872c421ac1"}
{"user_id": "114394948104032291351", "name": "James Ponder", "time": 1536513924528, "rating": 5.0, "text": "I would highly recommend Hemstock! They were professional, friendly, on time, and they did exactly what they promised. There are some bad tree companies out there, but these guys are the real deal. Quote was also reasonable. Call these guys!!!", "pics": null, "resp": null, "gmap_id": "0x88626b7155555555:0x5ffff3872c421ac1"}
{"user_id": "110012926724326898532", "name": "Krystal Johnson", "time": 1513116114584, "rating": 5.0, "text": "I talked to Cliff at Hemstock last week and today took delivery of 1/2 cord of seasoned hardwood. The price and service are excellent, the 2 young men who delivered the load professional.  We will be doing business again.", "pics": null, "resp": {"time": 1513264205042, "text": "Mr. Johnson, We would like to thank you for being a valued customer. We are grateful for the pleasure of serving you and meeting your firewood needs! We are looking forward to doing business with again. Thank you most sincerely, Hemstock Tree Care"}, "gmap_id": "0x88626b7155555555:0x5ffff3872c421ac1"}
{"user_id": "116441991663878045905", "name": "Mike S", "time": 1476234636878, "rating": 5.0, "text": "The firewood is always well seasoned, is cut to the perfect size, and the team is very professional.  I plan to continue doing business with these folks for as long as possible.  Thanks guys.", "pics": null, "resp": null, "gmap_id": "0x88626b7155555555:0x5ffff3872c421ac1"}
{"user_id": "114657860092552016468", "name": "Stephanie Kokan", "time": 1435854892291, "rating": 5.0, "text": "Cliff and his crew did a fantastic job removing a large tree for us that was damaged in a recent storm.  It was in a tricky location with limited accessibility and it was evident that they really knew what they were doing - they had the whole thing out of there by midmorning with no damage to the adjacent trees that we wanted to keep for privacy, our neighbor's fence, or even our playset which happened to be right in the way.  The whole crew was so polite and pleasant to talk to, and they really took care to protect our lawn from damage while they were working.\n\nWe initially chose Hemstock because they were the only company who actually returned my phone call after I contacted multiple places to request an estimate, but we had such a positive experience that I'd definitely choose them again!", "pics": null, "resp": null, "gmap_id": "0x88626b7155555555:0x5ffff3872c421ac1"}
{"user_id": "105091002402762766324", "name": "syretta robbins", "time": 1573930706704, "rating": 3.0, "text": "I tried to contact them about getting some wood and they never returned my email or called me.", "pics": null, "resp": null, "gmap_id": "0x88626b7155555555:0x5ffff3872c421ac1"}
{"user_id": "112286889457369289902", "name": "Mike Voss", "time": 1542304965588, "rating": 4.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x88626b7155555555:0x5ffff3872c421ac1"}
{"user_id": "111077961691768414753", "name": "J W", "time": 1611723403102, "rating": 5.0, "text": "Love this place. JD is awesome. He even schooled me on how to set my wood off the ground. Great method. Bought some hickory and cherry. Next go around will be pecan. Check them out folks. You wont go wrong here.", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "107892666389735786869", "name": "Patrick Jemison", "time": 1612444640513, "rating": 5.0, "text": "Phenomenal deal here - a half rick mostly fills the bed of the small pickup truck I was using for just $75! They threw in a bag of kindling for free as well! The cherry wood mixed in adds some nice color to the stack.", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "109869407691181852543", "name": "Christian Clark", "time": 1619569707256, "rating": 2.0, "text": "I received a half rick and the wood was cut in half and not split well at all. i had to recut over 50% of the wood. Using a moisture meter it read 27% moisture. The wood here that I received was NOT SEASONED. I use this wood for smoking meat. There was also poison ivy vines along several of the splits.", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "117132318317335608209", "name": "Liser 231", "time": 1604694988920, "rating": 5.0, "text": "Been getting wood here for a couple years now. Highly suggest checking them out. Always seasoned and ready to burn.", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "103707253615461106080", "name": "Alicia Whetstone", "time": 1605612873681, "rating": 5.0, "text": "Great deal for firewood! Stop spending a fortune on pre-bagged wood which is 3x the cost and bring some gloves and a truck and get your money's worth instead. So worth it!", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "115410592705499920552", "name": "Nick Whetstone", "time": 1604164745950, "rating": 5.0, "text": "Very friendly, knowledgeable, and well priced. Definitely choose this before you buy at a supermarket.", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "107083899199618841824", "name": "Positively Angelic Vegan", "time": 1574731841136, "rating": 5.0, "text": "JD the wood man ROCKS! We called 20 minutes before he closed to find out about prices. He not only told us prices, but he also shared the types of wood he has, the correct and incorrect measurements of a cord, and told us how to tell green/ wet wood from ready to burn wood. His prices are absolutely amazing! He has everything completely organized and easy to access! My husband and I will be back when we run out!", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "113478574755585394293", "name": "Dixie Lesley", "time": 1604483904441, "rating": 1.0, "text": "Rude. Did not seem to want to answer questions. I've never had to buy firewood but I guess my first time won't be from here. Was more concerned with jumping down my throat with how busy they were than answering my questions. Says delivery available on website but that's a lie. Won't be buying from here", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "110002698405244516782", "name": "Peaches Caudle", "time": 1606909215726, "rating": 5.0, "text": "Awesome deal on firewood.", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "113428954170691113180", "name": "Amber Lee", "time": 1540147860068, "rating": 5.0, "text": "Jeff is awesome! He makes sure the customer knows what they are getting for their money, and is fair in his prices. His lot is organized and well thought out, as well as easy to navigate. Whether it is wood for a bonfire or indoor heating, he makes sure they get the right kind of wood for their needs. Very thoughtful and polite. Would definitely recommend to friends and family.", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "118301827739508142006", "name": "joe blow", "time": 1584724633357, "rating": 5.0, "text": "Great customer service and good selection of smoke wood!", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "113796402874308542669", "name": "Charlie Murphy", "time": 1541276179539, "rating": 5.0, "text": "This place is awesome.  They have a wide variety of wood.  They are knowledgeable about wood types and will help you match wood to your needs (cooking, indoor fire, outdoor fire, smoking meat, etc).  They are also very friendly.  I just picked up a truck bed of pecan for a great price.", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "105963836453081121811", "name": "Christopher Dorothy", "time": 1599757536631, "rating": 5.0, "text": "Great customer service !!", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "114908166155773070736", "name": "Jd Stephens", "time": 1540147925195, "rating": 5.0, "text": "This place has had firewood for over 7 years. They are the largest of their type of drive through firewood sales. It is almost an acre of firewood with a circle drive so you can easily get to your bays to load your wood. They have many commercial accounts. They are nice and always helps the customer with the right type of wood they are looking for.\nI see some 1 star post and I looked at them one guy leaves almost everyone a 1 star on his reviews. He seems like an unhappy individual.\nI have seen 2 woman leave post with 1 star without any reason stated. Hum makes me wonder if they are just having a bad day or was put up to it to lower Firewood Alabama Star rating.\nI just saw one from a few days ago from a guy who never got out of his truck and only stayed a minute or so his post said. Wow how can you judge someone without experiencing any contact? There is a sign on the door telling people to look in back or to knock on the door or call? I guess you would have to get out of your truck to see that.\nThere is a crew of at least 2 to 8 people working there everyday seven days a week in the fall and winter. Jessi, Amber, Dianna, Cormen, and Jason to name a few. They have all been great to deal with.\nThey have Pecan, Cherry, Hickory for the smokers/cookers. They have plenty of hardwood mix for home heating. The have Wood for pot Belly Stoves. Wood for Campfires or Patio burn pits. They have wood for almost anything you can think of. It is all on wood decks off the ground. Oh they also have Kindling bags for $10.00.\nThis is the best and largest Firewood company in the area. Firewood Alabama is a real company.\nGive them a call and go see them you will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "113313058360172626187", "name": "Chris Fuqua", "time": 1535315599167, "rating": 5.0, "text": "Always has a  huge selection of wood to choose from at a great price. I have been using them for almost 3 years now and have never had 1 complaint.", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "105769794384397085911", "name": "Ray Feltner", "time": 1539817357439, "rating": 1.0, "text": "Just a persons house. It looked shady but I pulled in didn't really have any parking spots. Stayed in the driveway for a minute and no one came out.", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "105403663224600743847", "name": "Amy Gebhart", "time": 1541361322307, "rating": 5.0, "text": "JD was so nice, and really helpful! Great place!", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "110523692174594078566", "name": "kyle fisher", "time": 1520643943958, "rating": 5.0, "text": "Has all kinds of wood, high quality. Very knolagable about types of wood used for different porpoises.", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "112474578909317268629", "name": "jared kimminau", "time": 1541251307301, "rating": 5.0, "text": "Great customer service and quality wood!", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "100560541511000125077", "name": "Brad Travis", "time": 1539867849763, "rating": 5.0, "text": "JD always has plenty of wood in stock.  From pine for a backyard campfire to pecan to smoke your Thanksgiving turkey.", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "115724360424908936663", "name": "Leslie Colter", "time": 1580253702979, "rating": 5.0, "text": "Great service!!", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "113350671704514039538", "name": "rodney vanalstine", "time": 1573762378114, "rating": 5.0, "text": "If you need firewood, this is the place to go!!!", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "112479041722214482072", "name": "cindi purinton", "time": 1539865766604, "rating": 5.0, "text": "Our boy scout troop loves him when we need camping fire wood.", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "115958990733509529651", "name": "Brandon Rushton", "time": 1521231579091, "rating": 1.0, "text": "Nothing there.", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "104768644460614421420", "name": "Sandy Britton", "time": 1540576855526, "rating": 5.0, "text": "Good deals, Pleasant people!!!!", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "116526544792677081789", "name": "Hudson Storey", "time": 1540163746166, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x886261258284e41f:0xcf8046f2a509fa1a"}
{"user_id": "115712348907497973136", "name": "Charli Hamlin", "time": 1620215829016, "rating": 5.0, "text": "Awesome local family-owned small business. Great prices, helpful staff and owner, and they load you up and deliver quickly! We buy all of our landscape supplies from them every year: mulch, gravel, sand, etc. Love sending folks here!", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "105505882492169920143", "name": "Lacey Byers", "time": 1616427315242, "rating": 5.0, "text": "Good prices and quick service. $30 for a yard of mulch. Ornamental concrete yard sculptures available for sale.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNmkrj_wfwCj0KLjaH-eYouElo7mqXSF6opGELm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM2yLai5ile4c2YFce8bV1kCvCkFVMMg2W3lZIO=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "103887395797044023358", "name": "Ron Perkins", "time": 1618506243501, "rating": 5.0, "text": "Anthony and the crew are great at helping you get the supplies you need to whip your yard into shape. The big rolls of pine straw are easier to spread and cover a lot of ground and he's always got dry wood for the firepit and fireplace. Super nice local folks!", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "114710222148393631553", "name": "Timothy McPhail", "time": 1616434697351, "rating": 5.0, "text": "Had a small project that we found needed some fill dirt quickly- called late on Saturday and had 8 yards of fill dirt delivered on Monday morning for $200. Exceptional response to a quick order to fill.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNN1G8NHZlIaF4vBVQSlAuKHKpTdYgtkV6Zx7Ha=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "118034871867520343364", "name": "Gary King", "time": 1623883818241, "rating": 5.0, "text": "Bought long needle pine straw in bales last year and this year. Friendly folks and load you up quick!", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "117518833077795002543", "name": "Carolyn Murray", "time": 1620684811122, "rating": 5.0, "text": "Very helpful and quick delivery", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "113021868982082600925", "name": "Ed Smith", "time": 1599873525312, "rating": 5.0, "text": "Great place for gravel, mulch, firewood, landscape rock. Friendly service.", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "109665175120285918332", "name": "Jim Bob", "time": 1593710632020, "rating": 2.0, "text": "Wasn't impressed with the young man (teenager I'm guessing) behind the counter. Didn't really act like he was interested in helping me with some topsoil questions. I was kind of surprised based on the glowing reviews form other reviewers. The boy kept looking away when I was talking to him, and was not paying attention to the questions that I was asking him. Maybe he was having a bad day, who knows. I will look elsewhere though when purchasing topsoil.", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "108477872299112618618", "name": "John McGiboney", "time": 1593647410960, "rating": 5.0, "text": "Super knowledgeable and very nice and helpful.", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "116903390449381140664", "name": "Sean McKim", "time": 1550681462218, "rating": 4.0, "text": "Good landscaping place. The people are friendly and the prices are reasonable. I got a yard of top soil on my last visit. It was good dirt.", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "100100419170660685864", "name": "Chris Borgosz", "time": 1607464211534, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "113505093157095685972", "name": "Karis W", "time": 1527971164085, "rating": 5.0, "text": "My family has been getting mulch from here for years. The prices are good and the people are friendly. No complaints!", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "102190601502170684177", "name": "Catherine Marchese Hess", "time": 1478358856900, "rating": 5.0, "text": "Great place to do business with that personal touch. We have been more than pleased with the service we receive & Highly recommended! Nothing like the feel of friendly neighborhood business.", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "108774753000134608529", "name": "Paul", "time": 1524323593049, "rating": 5.0, "text": "Been buying from them for two years now. Best prices you’ll be able to find in the area and you’ll be in and out in a few minutes. Other places don’t really compare.", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "108977325135176822016", "name": "Angie Troncalli", "time": 1495711582326, "rating": 5.0, "text": "Knowledgeable, quality materials and offering helpful tips to make your home or business landscape projects complete!\nFamily owned and operated!", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "115031177981729032075", "name": "Katie O’Brien (Iowa17)", "time": 1530982119099, "rating": 5.0, "text": "I needed a tiny amount of small lava rock (not many people carry) and they took care of me. Great service!", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "107278406009428533343", "name": "Terry Radford", "time": 1538747217231, "rating": 5.0, "text": "Always helpful. Just good people.", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "112684848711060805168", "name": "Jon Clarke", "time": 1449287490242, "rating": 5.0, "text": "Great family business offering high quality products at great prices!", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "110528370322127032888", "name": "Michelle Hays", "time": 1567800522426, "rating": 5.0, "text": "Finally found a plant I'd been searching for and it was on sale!!", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "101711770464966814475", "name": "Jack Overton", "time": 1464523221822, "rating": 5.0, "text": "Friendly folks...fare prices. ...great place to do business!", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "118257222037150849102", "name": "sullivans lawncare alabama", "time": 1557801851512, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "110821335390873352255", "name": "Bev Bean", "time": 1490462461623, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "107123484981202354001", "name": "Daniel Evans", "time": 1463595929947, "rating": 5.0, "text": "Always has what I need.", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "109925254215265127109", "name": "Tom Rodgers", "time": 1455500326630, "rating": 5.0, "text": "Myself, neighbors and at least one church community garden order from here. That guy Jerry is inexperienced or in over his head I suspect.", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "117255192040900406212", "name": "Jerry Montalbano", "time": 1313681492038, "rating": 2.0, "text": "I don't recommend this place! Very expensive!!!", "pics": null, "resp": null, "gmap_id": "0x888928b68e94a7c9:0x5f8abaa7ded5e135"}
{"user_id": "115645796380116210617", "name": "Timothy Pfaff", "time": 1613453831770, "rating": 3.0, "text": "The price was great but the quality was not. I purchased about 80 pounds of wood and one bag of the split oak. The wood on the outside in piles were not seasoned and just had gone through some rain. It was expected they would need some drying out. The split oak wouldn’t light in any way, no matter how hot I tried to get the fire. It would only sizzle from the amount of water trapped in the wood. I asked if the wood was seasoned and dried, to which the man behind the counter said it was. I’m not sure what they consider seasoned, but the bags weren’t seasoned at all and the wood in the piles are not easily dried out. If you’re going to buy wood from here, buy it well in advance to allow for more drying. Otherwise it may just be better to cut down a tree yourself.", "pics": null, "resp": null, "gmap_id": "0x8889245168b78f47:0x2529d66021042eb"}
{"user_id": "104668643317789411484", "name": "Seth Miller", "time": 1608768514004, "rating": 5.0, "text": "Another one match wonder from AFP.  Best firewood supplier in the Birmingham area, hands down.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMRwYZYMGK2y4dXiqqzf7L9_O59lftEmbtvps6T=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889245168b78f47:0x2529d66021042eb"}
{"user_id": "111880752951708923285", "name": "Sara Patrick", "time": 1613492032740, "rating": 5.0, "text": "We were very impressed with the friendly and helpful customer service. Happy with the prices and quality as well. We will definitely be returning customers.", "pics": null, "resp": null, "gmap_id": "0x8889245168b78f47:0x2529d66021042eb"}
{"user_id": "112023673293571876317", "name": "Kurt DeAngelis", "time": 1606960071980, "rating": 5.0, "text": "Always a fair deal and good product here.", "pics": null, "resp": null, "gmap_id": "0x8889245168b78f47:0x2529d66021042eb"}
{"user_id": "107309774221835934917", "name": "Sandra", "time": 1612382883155, "rating": 4.0, "text": "Great place to drop off cut up fallen trees they will pay you for them.", "pics": null, "resp": null, "gmap_id": "0x8889245168b78f47:0x2529d66021042eb"}
{"user_id": "104758332561350383196", "name": "Warren Pinheiro", "time": 1607716761622, "rating": 5.0, "text": "11 cents a pound for cured and 9 cents for green.", "pics": null, "resp": null, "gmap_id": "0x8889245168b78f47:0x2529d66021042eb"}
{"user_id": "107398750118574311414", "name": "RA 46", "time": 1597848507298, "rating": 5.0, "text": "Great people. Seasoned firewood.", "pics": null, "resp": null, "gmap_id": "0x8889245168b78f47:0x2529d66021042eb"}
{"user_id": "113950586889668198990", "name": "Chris Hughes", "time": 1583819980736, "rating": 5.0, "text": "Top notch office personnel,very good product & price", "pics": null, "resp": null, "gmap_id": "0x8889245168b78f47:0x2529d66021042eb"}
{"user_id": "115076770509358857526", "name": "Wilson Lakin", "time": 1567177714346, "rating": 5.0, "text": "Great company to work with!", "pics": null, "resp": null, "gmap_id": "0x8889245168b78f47:0x2529d66021042eb"}
{"user_id": "116689675687007499679", "name": "Brad Douglas", "time": 1537392636344, "rating": 5.0, "text": "Great guys great prices", "pics": null, "resp": null, "gmap_id": "0x8889245168b78f47:0x2529d66021042eb"}
{"user_id": "106831595542400275161", "name": "Chris Rogers", "time": 1514055424345, "rating": 5.0, "text": "Great place, easy to deal with.", "pics": null, "resp": null, "gmap_id": "0x8889245168b78f47:0x2529d66021042eb"}
{"user_id": "100045633893260474329", "name": "Tiger Hitt", "time": 1577879959795, "rating": 5.0, "text": "Awesome company!!", "pics": null, "resp": null, "gmap_id": "0x8889245168b78f47:0x2529d66021042eb"}
{"user_id": "103830372283071434460", "name": "Roberto Perez", "time": 1495798104258, "rating": 5.0, "text": "Good company", "pics": null, "resp": null, "gmap_id": "0x8889245168b78f47:0x2529d66021042eb"}
{"user_id": "103038078698266714024", "name": "Michelle Michael", "time": 1612989336729, "rating": 5.0, "text": "I HIGHLY RECOMMEND Jon's Tree Service. I've been collecting estimates for a few months to remove 2 \"complicated\" and dangerous pine trees and was quoted very high amounts from 3 different businesses, who also couldn't promise that surrounding trees and new sod wouldn't be destroyed. Jon's however had the right equipment to get into a tight spot and remove these trees with ease, and with NO DAMAGE to surrounding areas, and at a very reasonable cost compared to my previous estimates. Also they were the only business that sent me an actual estimate document and a copy of their liability insurance, without me even asking. Two days later, the trees are gone! The crew arrived on time, was so polite and respectful, and really amazing to watch. I've waited a long time to find someone worth paying to do this, and this is it! I get nothing for this recommendation; I'm just so satisfied and like to support good businesses.", "pics": null, "resp": {"time": 1615304495807, "text": "Thank you so much Michelle! We apologize for the delayed response to your amazing review. We greatly appreciate your kind words and recommendation! We are very grateful that we were able to provide the service that you expect. It was a pleasure serving you!"}, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "113586178833768444043", "name": "Laura Timares", "time": 1594402236454, "rating": 5.0, "text": "Jon responded quickly to my request for an estimate (2 days), and once he saw my large termite eaten tree leaning towards my house (The bark fell off the tree revealing the dangerous state it was in) he made it a priority to schedule its removal. Difficult to access, tight against other trees - OTHERS QUOTED MORE THAN DOUBLE his estimate, which he kept to. Quoted on a Tuesday, his team was on site on Thursday. They were courteous, efficient, made safety a priority and did a fantastic job cleaning up and promptly hauling away the remnants. That was important, as they had to set up their bucket lift in my neighbor's yard (Thanks neighbors!). Neighbors were so impressed they asked for Jon's business card for their future needs. Per my request, they were careful not to damage my hydrangea just under the canopy!  I have had to deal with a lot of tree services during my 20 years here in Bluff Park. Unfortunately, some are vultures. Some get the job done adequately. But Jon's service has been exceptional.  GREAT VALUE, GREAT JOB.  (LT)", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMPl_e_zHIOhVqlJpsByzXEg5buf92URck3kGg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOzcn7oee4RqWV_hMgJnuEtvX8e1X8dw9O0RpU=w150-h150-k-no-p"]}], "resp": {"time": 1594482453696, "text": "Thanks Laura, I’m really glad we were able to get it cut before it fell. We appreciate you guys very much!"}, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "100664947066077246702", "name": "Freecons Gaming", "time": 1624304100853, "rating": 4.0, "text": "Very efficient crew, they know what they're doing, and they do it well!", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "101395836534011302239", "name": "Lynn Alexander", "time": 1620084697580, "rating": 5.0, "text": "Showed up on time and did a great job. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "116889395915942683866", "name": "Brendan Owens", "time": 1605203686495, "rating": 5.0, "text": "After getting estimates from 3 other companies I decided to go with Jon’s because they were a better rate and more professional while keeping excellent communication. I was concerned about possible damage to my fence during tree removal. They said if any damage was done by their crew, they would fix at no extra charge. That did not matter because they were able to remove 4 trees without any damage to fence just a few feet away.\nThank you so much Jon’s Tree Service!", "pics": null, "resp": {"time": 1608747283936, "text": "Thanks Brendan for the kind words and great review of Jon's Tree Service. We greatly appreciate you taking time to write about your experience. We are very happy we were able to provide you with the level of communication and service that you expected! Thank you so much for your business it was a pleasure serving you!"}, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "107627520643556162197", "name": "Lindi Pearson", "time": 1599709958292, "rating": 5.0, "text": "Great work at a great price. I had a tree limb fall through my car port and crush the roof of my car. The owner Jon has harsh personality. It's just how he is. Do not let that discourage you from hiring him. His crews are top notch, well equipped, hard working, professionals. He gave me a quote to prune a 100+ tall tree on a Thursday and his crews was here the following Wednesday. Set up to clean up the work was done in 2 hrs. Easily a 2 day job for a company without the top notch equipment. I am thrilled with the work done and the more than fair price. Thanks Jon I will use you from now on and will recommend Jon's tree service to anyone who needs this kind of work.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "114868862687188804994", "name": "Chuck Gray", "time": 1596590513340, "rating": 5.0, "text": "We recently contracted with Jon's Tree Service to have several trees removed/trimmed.  I am totally pleased with every aspect of their performance.  They were prompt and at the house ready to work at 7 am, just like they had said they would.  The crew was very efficient and courteous, and it was obvious to me that they all took pride in what they were doing.  The yard was cleaned better than I expected and the debris was hauled away the same day that the work was performed.  If you need tree service performed, I highly recommend Jon's Tree Service.  You will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "104727571187763891523", "name": "Wanda Hendrix", "time": 1604944804290, "rating": 5.0, "text": "Three trees were on our house from tropical storm Zeta. Jon's Tree Service came out the next day and removed the trees.  The workers were professional and the cost was reasonable.  Will use this company again for future tree services.", "pics": null, "resp": {"time": 1608747538887, "text": "Thank you Wanda for the kind words from your experience with us. We greatly appreciate you taking time to write and share what you liked most about us. We look forward to helping you in the future with any tree removal projects you may need (hopefully not a storm). Thank you so much for your business, it was a pleasure serving you!"}, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "107705700071796836490", "name": "Donald Bivins Jr. Ministries", "time": 1597334226895, "rating": 3.0, "text": "Good job removing trees and grinding but not so good at removing the roots from trees. Instead of having a truck to put debris in they put all the debris on my lawn and part of the street. Took two days to remove the debris and when they got it up. There are big dents in my grass said they would fix but didn’t just filled in with sand. Called had words with Jon and he and I were unprofessional. Said he would come look at it but didn’t, I sent a text telling him not to come. For what I paid them to remove 14 trees, they could have spent less than $100 to fix my yard. I told I could fix me own yard like I want it. My neighbors complained about his the unprofessionalism when they were trying to get to there homes because he had the street blocked. I Wouldn’t recommend their services to anyone. I should have used Gray’s.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "113960943730500218508", "name": "Lynn Rodgers", "time": 1594322598065, "rating": 5.0, "text": "Jon has been my tree guy for many years. Very professional. Pricing fair. Crew does awesome job. Cleanup everything including blowing off the driveway. Jon has even come by after to rake up debris when his crew was on another job. Will continue to use him for all my tree work.", "pics": null, "resp": {"time": 1594326474796, "text": "Thanks Lynn, we appreciate you very much!"}, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "105832893891317482227", "name": "Jessika Ashlee (Hip and Simple)", "time": 1588345918413, "rating": 5.0, "text": "Had a tree fall down after some wind. Jon came out quickly to assess and then had his team in and efficiently working on time. I heard the team members saying \"beautiful\" back and forth to one another as they worked closely to safely make cuts and remove logs and branches. The team worked well together and cleaned everything up. I didn't want to have to use this service but they helped make a not fun situation really easy to deal with and I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "117731094598413740020", "name": "Vicki Baker", "time": 1599919014518, "rating": 5.0, "text": "Best company ever, professional, detailed, clean up extronare. We have used them for 3 years. Highly recommend them can't say enough good things about Jon's services.", "pics": null, "resp": {"time": 1608747785279, "text": "Thank you so much for your five star review, Vicki! We are very thankful we have been able to provide you with awesome service the past few years! It has been our pleasure to be able to serve you on your projects! Thank you again for your kind words!"}, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "116995040730382735686", "name": "WD H", "time": 1584206990602, "rating": 5.0, "text": "Jon and his team were prompt and did an amazing job.  Pricing was fair. Clean-up after the tree removal process was well done and thorough.  Jon even personally power washed the driveway removing a muddy buildup caused by rain while the trees were being hauled off.  Would definitely hire him again.", "pics": null, "resp": {"time": 1584211808517, "text": "Thanks Wayne, we really appreciate you. Look forward to next time!!"}, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "112747406449519484039", "name": "traci brosch", "time": 1579031521019, "rating": 5.0, "text": "We called Jon's Tree service to remove branches from 2 OLD oak trees and they did a fabulous job for a great price! They promptly removed the debris and blew the whole entire yard. They went above and beyond with the customer service. The end result was a much more aesthetic yard than at the beginning of the project. I would highly recommend this company because their equipment did not damage our yard and the crew was entirely professional, prompt, and cost effective.\nTraci B.\nVestavia Hills, Al", "pics": null, "resp": {"time": 1579747010806, "text": "Hi Traci, Thank you very much for your review, we really appreciate it! We are very glad to know you were pleased with the work we did for you. Have a great day!\n- Jon's Tree Service"}, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "108206582582494866651", "name": "Woody Norman", "time": 1593196977666, "rating": 5.0, "text": "After receiving quotes from tree service companies, they gave an 11-week delay. We called Jon’s tree service and got a quote with a 10-day delay. The workers were professional and efficient. The quote was 15% to 20% more than the other quotes, but well worth it.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "116874833297740740137", "name": "Jimmy Mcwaters", "time": 1586900283943, "rating": 5.0, "text": "5 guys, 4 trees, 3 hours and a yard that looks like they we're never there. That happened 5 min ago. Awesome, on time, VERY under priced after 2 other estimates. Jon was very honest and friendly.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "117648669279120429670", "name": "kathryn michael", "time": 1583024829951, "rating": 5.0, "text": "Jon’s team arrived on time and worked quickly and efficiently removing two big Leyland Cypress and trimming and pruning all the many trees my husband planted and forgot.  They did excellent work and left the place spotless, and I would highly recommend them.  They know what they are doing!", "pics": null, "resp": {"time": 1583035517114, "text": "Thank you guys, we appreciate it"}, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "110411698104329071074", "name": "David Marler", "time": 1590073804905, "rating": 5.0, "text": "MAN these guys a great .I am speechless for how good this team of guys are .with having a tree fall on your house .it sure is nice to have someone come out and take such good care of your property and job .\nthis owner is truly blessed to have a team that works so great together .", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "110411698104329071074", "name": "David Marler", "time": 1590073804905, "rating": 5.0, "text": "MAN these guys a great .I am speechless for how good this team of guys are .with having a tree fall on your house .it sure is nice to have someone come out and take such good care of your property and job .\nthis owner is truly blessed to have a team that works so great together .", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "112065075619512983847", "name": "Jason Green", "time": 1579810458535, "rating": 5.0, "text": "Jon is A+ in my book. Made two trips out to help us with a cat stuck about 50' high in a tree. After being blown off by several tree services, a buddy recommended Jon. I fully expected to be laughed at but he was 100% willing to climb the tree and get the cat down for a reasonable price. I know that isnt their normal gig but they were very helpful.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "109213554935193961032", "name": "Alva Summerlott", "time": 1582133192303, "rating": 5.0, "text": "Friendly fast and efficient. Took care of my two trees safely and professionally. Im very happy and will be using them if i have any other tree to take care of. Thank you jon.", "pics": null, "resp": {"time": 1582137883149, "text": "Thanks buddy, we appreciate you guys!!"}, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "108830866888728695220", "name": "Sarah Jones", "time": 1547003282398, "rating": 5.0, "text": "I was well pleased with the work done for me by Jon's Tree Service. Response to my initial contact was quick and very professional. Communication was prompt and good. The crew was professional, worked fast, and cleaned up the entire area. I will definitely call them for future work. The price was reasonable.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "105223371821394011386", "name": "Gobblers Knob", "time": 1583440835936, "rating": 5.0, "text": "We have used Jon's Tree Service several times, they are hands down the best to work with.  Pricing is always reasonable, service impeccable.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "103583992972061049246", "name": "Kristin Bartlett", "time": 1573009470388, "rating": 5.0, "text": "The crew was AMAZING! I didn’t have to worry about anything! A pleasure to work with! All cleanup was handled and they went above and beyond!", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "103425922334039278433", "name": "Coach Jimmy", "time": 1595523238251, "rating": 5.0, "text": "Great service and price.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "117246374506033849481", "name": "Bob Opkins", "time": 1564768125702, "rating": 5.0, "text": "This is the 2nd time I have used Jon’s service. He did another great job at a reasonable cost. Good job cleaning up too.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "100734733517144045550", "name": "David Plourde", "time": 1582756805210, "rating": 5.0, "text": "Excellant work, worth every penny.They cleaned up and took care of everything.", "pics": null, "resp": {"time": 1582762377345, "text": "Thanks David, we appreciate it"}, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "100472989960985293203", "name": "Jessica Leesburg", "time": 1553784436069, "rating": 5.0, "text": "I hardly ever write reviews but wanted to take a minute to share what a wonderful experience we had with Jon and his team. I found Jon on google and after one phone call with him I knew I had found the right company. We had work done several months ago that left us with a HUGE MESS in our back yard. Jon came out and gave us an estimate and said he would take care of it. This morning his crew showed up with four trucks and right on time. Everyone was so professional and kind. My husband called me just a short time later to tell me how great everything looked. We couldn’t be more pleased! Jon will be my FIRST call for any needs like this in the future. My only regret is not calling him 9 months ago to get the job done right the first time.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "116018096182913851670", "name": "Gwen Skinner", "time": 1522762764685, "rating": 5.0, "text": "Jon’s cut down a massive pine tree, removed the logs out through a very tight opening in my azaleas with absolutely no damage to them.  Jon’s also removed or trimmed  several other good size trees. His crew was respectful of all my plantings and irrigation heads.  A very professional job for a fair price.  I will use Jon’s in the future.", "pics": null, "resp": {"time": 1522764523622, "text": "We appreciate you very much!!"}, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "109881277018163988060", "name": "J Live Overdrive", "time": 1577147955347, "rating": 1.0, "text": "Contacted Jon to get a quote on cutting down a tree. Send over all the information and then the next day Jon asks me to call him that I was 30 mins from his business (and?) That \"if he was gonna come out he'd have to get at least $1200. \" Did not care to come give a quote and basically just threw out a number cause 30 minutes just to far.  So Jon needs to change his website to If you are more than 30 mins away I'm just going to throw out a number and if you dont like it, oh well. Very bad business practices.", "pics": null, "resp": {"time": 1577385908014, "text": "Hi There, We are really sorry we could not help you out.\n\nAt Jon's Tree Service, we have a very specific service area that we cover, so that we can have as little downtime as possible between customer appointments. This keeps our costs low since we can get to our customers quickly and helps our response times be as fast as possible.\n\nWe cover primarily Shelby County and parts of southern Jefferson County and unfortunately Trussville is out of our service area. Your location would be closer to an hour away from us and because of that we would not be cost effective by the time it's all said and done.\n\nWe appreciate you reaching out to us and sorry we could not help you out.\n\nJon's Tree Service"}, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "117631432720377098267", "name": "Adam Ladner", "time": 1546003541512, "rating": 5.0, "text": "Jon's crew came out when they said they would and had the tree down very quickly. They were professional and went the extra mile to clean up some other limbs and debris. Price was also the most competitive.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "117988615062719949733", "name": "Steven Burdick", "time": 1558132122966, "rating": 5.0, "text": "The guys who work for Jon are the best. They keep the yard nice and clean. Can't tell they where ever in the yard with equipment.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "105192984196594264725", "name": "Ed Day", "time": 1525825573517, "rating": 5.0, "text": "Just what I was looking for: commitment to service and the job at hand, reasonable price, honest service, safety. Jon set a schedule, budget and accomplished the job as stated.  What a pleasure to work with and a company with it's service heart at work around the world spreading the word of God.", "pics": null, "resp": {"time": 1525834950299, "text": "Ed it was our pleasure!"}, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "118270076128501291229", "name": "Bob Blackwell", "time": 1525533326329, "rating": 5.0, "text": "Outstanding is the best description for the service provided.  Jon and crew did everything promised, were on time, finished the quickly.  Stumps were removed complete beneath ground level and the ensuing cleanup was perfect.\n\nBest ever!", "pics": null, "resp": {"time": 1525834986331, "text": "Thank you Mr Blackwell, we appreciate you guys!"}, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "109462144565292674284", "name": "Kevin Jones", "time": 1554421554056, "rating": 5.0, "text": "\"Honest Businessman\"\nThe owner actually came by to give me an estimate about three weeks ago. John stated that he would gladly cut down a huge tree adjacent to my house if I really wanted the tree cut down. However he felt like the tree was healthy and did not need cutting. he also explained to me some other factors that quailed my concerns as far as the likely hood of the tree falling on our home. John did find a different tree with some possible root damage but it's not an \"immediate concern. John emailed me an estimate of \"all\" the trees I want removed and at some point I am going to have the trees removed for my personal peace of mind. I highly recommend John's Tree service. By the way he showed me pictures of a new piece of equipment that can fit through openings as small as four feet in order for the tree cutters to efficiently remove trees.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "105330732385512815692", "name": "Joe Lee", "time": 1522883769459, "rating": 5.0, "text": "I’ve used Jon’s Tree Service twice myself, and recommended them to the company where I work, who took my recommendation and also used Jon’s.\nThese guys do a good job, they do the work fast, and they do it thoroughly.  The prices are reasonable for the job they do, and I believe  that you will be satisfied with the quality of work you get for your money.", "pics": null, "resp": {"time": 1522885039987, "text": "Joe we appreciate you very much!!"}, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "107318915672795521686", "name": "Jeff king", "time": 1596550248291, "rating": 4.0, "text": "Fair pricing on tree removal", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "113868383637949688648", "name": "Tanya Blake", "time": 1485473067778, "rating": 5.0, "text": "We had Jon's Tree Service take down a Maple tree that was close to our neighbors house. Jon was very prompt at coming out to assess what needed to be done and give us an estimate. When the crew came out, they were nice and professional. As they took the tree down, it didn't touch the neighbors house or either of our chain link fences. The guys cleaned our driveway off immediately. The price and quality of work can't be beat! I would recommend Jon's Tree Service to anyone needing a tree trimmed or taken down.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "109855598841059358535", "name": "Elle Nelson", "time": 1515500122804, "rating": 1.0, "text": "Jon was very unproffesional. He seems to be more comfortable working with men than women. Sad but true. The work they did with my trees we’re good but not great. Would never recommend his service to anyone.", "pics": null, "resp": {"time": 1516310651086, "text": "We do not have any record of this person, this is not an existing customer for Jon's Tree Service, this is a fake review"}, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "114868671343245538649", "name": "george mccomber", "time": 1526762380162, "rating": 5.0, "text": "As always Jon's Tree Service did excellent work.  The only way I could tell that they had been to my property is by two trees being gone.  Wonderful cleanup with no mess left behind!", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "110431732102115810724", "name": "Dinki Wheeler", "time": 1558021141213, "rating": 5.0, "text": "Good ppl ... Cant wait too see them again", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "104479355183587209691", "name": "Mary Woolard", "time": 1536949054922, "rating": 5.0, "text": "Thank you Jon’s Tree Servlce for a job done with excellence.\nI will definitely recommend this service to others.\nKeep up the good work guys\nMary Woolard", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "103371708822738005650", "name": "Casey Benefield", "time": 1530328882619, "rating": 1.0, "text": "Going from 459 to 65 S, I encountered a truck, a white Ford, with the exact same logo... On the side, it said Jon's Tree Service. Not in green, but same artwork....\n\nThis truck was in the North bound side of the ramp, tailgating this lady... So I figured since he had plenty opportunity to get over South, I would speed up to get out of the way just in case.\n\nThen he whoops in behind me in a true bumper jumper fashion and tailgates me going on 65 South. Then he floors it, flips me off, mouths a few words, and takes off at least 90mph or more, because I was going 75 and he was out of sight in a few seconds.\n\nSo if Jon's Tree Service can't follow basic traffic laws, or exhibit common courtesy while driving, putting other drivers in a dangerous situation..... How safe do you think these guys are going to be around your home?", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "118044462710512230969", "name": "Brenda Zegarelli", "time": 1551122504693, "rating": 5.0, "text": "Jon,  I am so glad you were referred to me, not once but three times.  You were very responsive in the initial stage of pricing job.  Your prices were very reasonable and your men were great.  Very kowledgeable, had plenty of equipment to make job easier, and very kind.  You would neve have rknown  we had trees taken down if you hadn't  seen some stumps.  Very enjoyable experience!!!  I would certainly recommend you and your company and would use you again, hands down.\nThank you so very much,\nBrenda Zegarelli", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "106674396655359229097", "name": "Greg Smith", "time": 1523472316394, "rating": 5.0, "text": "Once I approved the estimate, Jon's crew was out the next afternoon to begin the process, and they finished up the next day. Jon came over that weekend to make sure everything had been completed and that I was happy with the work.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "110486865154866464214", "name": "Ty Hill", "time": 1494880723107, "rating": 5.0, "text": "Jon's Tree Service did an excellent job for a price that I thought was fair. I highly recommend Jon's for any tree service.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "100067339469044918235", "name": "r gillis", "time": 1565220651787, "rating": 1.0, "text": "They never showed up when they said they would and didn't call.", "pics": null, "resp": {"time": 1565269742901, "text": "We have never had anyone by this name on our schedule, they have us mistaken for another company"}, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "103574179415098269771", "name": "Valerie Chavez", "time": 1500929095878, "rating": 5.0, "text": "Very helpful and prices were affordable.", "pics": null, "resp": null, "gmap_id": "0x88892604e5c89d73:0x659c8741ced3f1a3"}
{"user_id": "113887438006836762936", "name": "Ray Crocker", "time": 1622428687966, "rating": 5.0, "text": "Graham and his team were very knowledgeable and professional. They removed several trees and old stumps. All debris was promptly taken off site. They also trimmed several trees for us that we didn’t want to lose. They trimmed them strategically to prevent splitting and allowed the trees to be saved. I can’t recommend Graham and his team more highly. He is not just some guy that cuts down trees but a professional arborist that will maximize and enhance what you love about your property.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "101423687071801702083", "name": "Tom V", "time": 1619300227689, "rating": 5.0, "text": "I'm so happy to have found AUF. Graham and his team were an absolute joy to work with. After getting stood up by a couple other companies, I would have been satisfied with them just showing up. But then they exceeded all my expectations. Right on time, fast and thorough without a hint of carelessness. Also the best price. All in all a great value, and wonderful experience.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "114473581639907165952", "name": "Mariana Gruschow", "time": 1619813631875, "rating": 5.0, "text": "Graham and his team are great! A friend sent us his contact after multiple fails with other companies to get an estimate. We were lucky to catch him before a project so we got our yard cleared out super fast.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "115498413653270766815", "name": "Mia Ransom-Parnell", "time": 1622636534146, "rating": 5.0, "text": "My neighbor’s tree fell across my yard. I called AUF and they promptly arrived to provide an estimate and agree on a date for removal. They were on time, professional,  cleaned up my yard, and hauled everything away the next day. I will use them again and would recommend them for any and all of your forestry needs.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "118154565688864350701", "name": "John Ward", "time": 1620616943618, "rating": 5.0, "text": "We were so Blessed to find Alabama Urban Forestry.  Our trees had some dead limbs, way too high for us to prune. We called after 5PM on a Saturday and they came out the very next day!!! They pruned all the dead limbs and disposed of the debris! We are so happy and appreciative of their FANTASTIC SERVICE!!!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "114886349426504076227", "name": "Music Bham", "time": 1615652752482, "rating": 5.0, "text": "After seeking 7+ estimates, I was lucky to find Graham Henderson and his extremely knowledgeable, capable and skilled crew. They offer the very best value in tree and debris removal industry for Birmingham and surrounding areas. They did not up-charge us based on our zip code, and they went above and beyond to exceed our satisfaction. Once they begin, they do not sit still, and will work to find things to do to make the most of their time and your investment. While with us, they took it upon themselves to blow leaves, grind additional stumps, grade undulation and anything within the scope of their expertise... and they didn’t even have to be asked. Once complete, I was amazed at how clean and kept they left my property. They will see to it that you get your money’s worth, and will even return to complete the smallest of tasks if their day did not allow. They communicated along the way so we were always in the know and without question, instilling further confidence in my money spent. These guys are the best in the business and an absolute pleasure to do business with!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "111765628234502618838", "name": "Eric Lovelady", "time": 1622681404487, "rating": 5.0, "text": "AWESOME!!!!! Came out on a weekend with a free estimate, agreed (with a handshake) on what they could do for my budget. Showed up, and exceeded my expectations!!!Thank you Graham and your hardworking team for the upstanding service. I will definitely call you and refer you, for future treework services.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "107327034518127078310", "name": "Angela Coxhead", "time": 1617326284389, "rating": 5.0, "text": "Graham and his guys went above and beyond!!! We hired them after a tornado hit our backyard.  They worked hard to get it done quickly, and competently. They were reasonably priced, but did a spectacular job!! They even rebuilt our fire pit! And, redistributed the gravel we had under our once trampoline (tornado destroyed it). They didn’t drive their Bobcat on our lawn like I’ve seen some tree services do in our neighborhood. I just can’t say enough good things about these guys! We had so many companies that I believe were trying to take advantage of us during this disaster! You wouldn’t believe the difference in the estimates!\nGraham and his guys are authentic good guys!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "117410117512125767674", "name": "Jordan Nemiroff", "time": 1616379204915, "rating": 5.0, "text": "Graham and his team did an amazing job clearing our backyard of overgrown trees and brush. We can’t wait to enjoy our new yard!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "107426452541787062989", "name": "Kathy Harris", "time": 1604713031632, "rating": 5.0, "text": "All I can say is SUPERB service!! I called at the last minute and they came through! Very courteous and professional. I would recommend them highly!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "117249615136198278701", "name": "Sharonda Fritz", "time": 1595976787723, "rating": 5.0, "text": "Graham and his staffers are extremely professional! His knowledge of various trees in my yard left me in awe! Going into this project, I was a little nervous but his professionalism assured me that Alabama Urban Forestry was the perfect match for the job.\n\nThanks again to Alabama Urban Forestry for taking care of every single detail of this project!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "102939891572520970774", "name": "T. Shane Smith", "time": 1600118964081, "rating": 5.0, "text": "Graham’s team was professional, courteous, and best of all affordable. Would highly recommend their tree trimming services to anyone in the area! Thanks you guys!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "102821275525105521927", "name": "lynn craft", "time": 1599781823783, "rating": 5.0, "text": "They did a great job. No mess very professional. Will recommend and use again.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "102766616649754917805", "name": "Donnie Oswald", "time": 1596729310566, "rating": 5.0, "text": "Graham and staff did an exceptional job for us.  I have called several other tree companies in the past and have always been told it would be weeks to get by for an estimate. Graham was out to quote within days and completed the job within a week.  Trees were cut down on a Saturday and stump grind/debris removed on Monday.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "117444546497478014679", "name": "Sara Allbritton", "time": 1597452688836, "rating": 5.0, "text": "Graham and his crew were very thorough.  They got the job done in a timely manner. They went above and beyond to take care of our needs.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "108321072828861748407", "name": "Mark McCuiston", "time": 1593303423228, "rating": 5.0, "text": "Graham and his crew at AUF did an outstanding job with my tree removal needs. I had two large trees come down in the storm a few days ago. When I called he said he could come take a look almost immediately. He followed through and had a quote within the hour. Then his crew was able to start the same day to get the tree off my roof. Afterwards the crew cleaned up so well that it was hard to tell they were there. Thank you guys!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "102202547643634830613", "name": "Angela Schaefer", "time": 1597098460456, "rating": 5.0, "text": "The whole crew was professional and polite from start to finish! I am more than satisfied with the work done and would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "111126272719166338673", "name": "Andrew Bishop", "time": 1601470460076, "rating": 5.0, "text": "Listened to my concerns, offered experienced advice, quoted a fair price, & professionally delivered exactly what was quoted. Thanks guys!!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "114254073887306590878", "name": "Hadley Dobson", "time": 1595430943831, "rating": 5.0, "text": "Graham and his team went above and beyond! Not only were they professional and got the job done they cleaned up to perfection. Thank you Alabama Urban Forestry!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "110768303399367408325", "name": "Cody Blackman", "time": 1570715692586, "rating": 5.0, "text": "Graham and AUF are hands-down the best tree service in Birmingham.  I had a large 60 year old white oak looming over my home and within a week the tree was gone.  Almost no evidence that a tree was in it's place.  Graham is honest about his assessments and what work needs to be done.  I had 3 other tree services survey around my house and essentially tell me all the trees needed to come down.  Graham spotted only the problem trees and groomed the others so they could remain healthy.  Not to mention the price was more than fair compared to other companies.  Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "101747849168228158399", "name": "Gaston Nichols", "time": 1568735010225, "rating": 5.0, "text": "Great job, nice people. Did everything they promised and more. Left the site clean and neat. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "112191719036061015113", "name": "Bryson Waldo", "time": 1532116233807, "rating": 5.0, "text": "Fabulous experience. Prompt bid. Excellent advice from owner.  Fair price. Right on time for job. Courteous, experienced crew. Left things very tidy and gave me some additional tree pruning advice for the winter. This company is first class from the owner in down.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "103400342550489309841", "name": "Linda Fincher-Mason", "time": 1538542565263, "rating": 5.0, "text": "Graham, owner set a fair price for detailed tree removal and stump grinding job. All the guys were professional, cleaned up daily and did an amazing job of transforming my newly purchased home with multiple huge trees on the second lot. They also pulled up scrubs from around the house and detached garage. Alabama Urban Forestry exceeded my expectations. Thank you Graham and team for my new garden/orchard spot.\nLinda Mason", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "109763316263302394080", "name": "Kara Harrison", "time": 1526774597621, "rating": 5.0, "text": "Extremely pleased. Went above and beyond what we asked for. Really took care of us. Graham was great and so was his foreman David and all the men worked hard and were respectful and cleaned up really well at end of job, Highly recommend. Used many tree services over the years and this was by far the best experience.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "116071110026939938321", "name": "Larry Parrish", "time": 1523382366114, "rating": 5.0, "text": "Alabama Urban Forestry was so easy to work with. They showed up on time, did a great job, cleaned up afterwards leaving no mess at all in my yard. I highly recommend these guys. And their price was very competitive.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "101595782316904029128", "name": "Ryan H", "time": 1563640374001, "rating": 5.0, "text": "This company came out on a Saturday. Was onsite within 20 mins of calling and cut our trapped vehicle out from under a large tree. Very very kind people!!!  Was very thankful and would highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "112614320770174475606", "name": "Cheryl Ferren", "time": 1533658583475, "rating": 5.0, "text": "Positive experience! Cleared out several trees between shared fence lines on either side of me. Did an excellent job. Cleaned up and took away debri. Very good communication about arrival times etc. even came back another day to cut back “further”a ridiculously large privet that they already trimmed. Very reasonable.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "103061395961154595994", "name": "Madison Pilkington", "time": 1516845492865, "rating": 5.0, "text": "These guys did an amazing job. Graham, the owner was very reasonable and the workers all knew what they were doing. Everyone was respectful and careful around my house I felt very comfortable leaving them there while I had to work. Had a dead tree very close to wires and my home and they got it done without any issue. Would recommend 100%.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "101595782316904029128", "name": "Ryan H", "time": 1563640374001, "rating": 5.0, "text": "This company came out on a Saturday. Was onsite within 20 mins of calling and cut our trapped vehicle out from under a large tree. Very very kind people!!!  Was very thankful and would highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "104170062006898887072", "name": "David Glenn", "time": 1525487498767, "rating": 5.0, "text": "I got 3 quotes for my tree job, and AL Urban Forestry was the least expensive by almost $2000.  Graham and his guys were on time, and they even pruned limbs off of one of my other trees that was hanging over my power lines.  They took down and hauled off two BIG trees for under $3500. The owner, Graham, even blew the pine straw out of my front yard and had his guys load it up, too.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "102467653389859091554", "name": "Robert Humm", "time": 1520091443755, "rating": 5.0, "text": "The best tree service in Birmingham.  They removed two large trees that was over the house with no problems.  So professional from the owner all the way down to the crews that worked the job.  I would recommend this tree service to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "106782723906901018664", "name": "Ula Afgan", "time": 1518802851828, "rating": 5.0, "text": "Great!\n\nAfter a big storm, sleepless night and listening to the squeaky tree hanging above my house. I decided that something has got to be done.\nI didn't expect much out of a tree company...\n\nBut this team! WOW! They went above and beyond. Guys are extremely knowledgeable, friendly, neat professional and their price was very good compared to other local quotes that I received.\n\nI'm extremely happy with their work and highly recommend Alabama Urban Forestry! Don't fear - let them take care of your worry tree!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "108939868357742138691", "name": "David Evans", "time": 1536103838627, "rating": 5.0, "text": "This crew came in here and worked like crazy and took care of business. My area looks fantastic. I highly recommend Alabama Urban Forestry for any of your tree needs.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "110311647230085100201", "name": "Shelley Johnson", "time": 1552608318172, "rating": 5.0, "text": "I highly recommend this company. Extremely professional, very prompt, and very friendly!  A very good experience!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "111717390015781826328", "name": "Stanley Grissom", "time": 1516841736909, "rating": 5.0, "text": "I had several large oak trees located around my property. After getting several  estimates I decided to  go with Graham at Alabama Urban Forestry. These guys went above and beyond to avoid any mishaps or damages. They have the best prices. Even followed up with me a few weeks later to make sure I was still pleased with the work that was done. Incredible and 5/5 from the owner as well as employees. I recommend to anyone looking to have trees cut.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "107539090899329508145", "name": "Sarah Ross", "time": 1535335751698, "rating": 5.0, "text": "Excellent, honest work at a reasonable price. Well very thankful to have found Graham and his hard working team.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "107185882650578124325", "name": "Carly Wortham", "time": 1517539438100, "rating": 5.0, "text": "amazing service. guys and the owner were super helpful. 10/10.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "116675359298098239051", "name": "shabnam moghaddam", "time": 1517532072989, "rating": 5.0, "text": "Graham is honest, dependable, and extremely knowledgable.Rates are reasonable and crew is top notch. Highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "111314396808771757231", "name": "Niraj Parekh", "time": 1522344095844, "rating": 5.0, "text": "These guys are fantastic.  They changed the landscape of our home.  Graham is very professional and David is an artist cutting the trees.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "116330806164903609756", "name": "David Arendall", "time": 1520471246965, "rating": 5.0, "text": "Very professional. Hard working and friendly. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "103553431879871169518", "name": "Don Johnson", "time": 1517950291885, "rating": 5.0, "text": "Nice group of guys. Very profession work.", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "106318220849084828203", "name": "Tim Finley", "time": 1535730869666, "rating": 5.0, "text": "Agree with everything above. Great job, recommend", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "112132709139344807408", "name": "Elizabeth Stewart", "time": 1624402005033, "rating": 5.0, "text": "We had the best experience with Graham and his team! Not only did he respond to my inquiry almost immediately, but was out the next day to give me a quote. The quote was very transparent and fair! They worked nonstop until the job was done and ended up cutting down more trees than in the original quote with no additional cost to us! They were so respectful of our property, stumps ground all the way down, blew all the leaves and debris out of yard and drive way and put all of our furniture back, leaving our property even better than they found it! We had a very large tree that was over our house, touching our deck and hanging over a power line so we were weary of the task but they tackled it like true professionals and not intimidated by the job in the least bit! We have already recommended Alabama Urban Forestry to all of our family and friends and cannot wait to use them again!", "pics": null, "resp": null, "gmap_id": "0x88891f11fc26edfd:0xc6757656f60dd06d"}
{"user_id": "101289670915278823680", "name": "Dennis Ethridge", "time": 1618613810432, "rating": 5.0, "text": "Kevin was quick to visit and see what I wanted done. Fair price for the work we needed. Entire crew was very professional the entire time they worked on our property. Crew practices excellent safety precautions during work. I am extremely satisfied with the work that was done and will use them in the future if needed. Highly recommend this company.", "pics": null, "resp": {"time": 1618878777477, "text": "Thank you so much! We are happy that you are pleased with the work!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "117483808129896845896", "name": "Scott Pittman", "time": 1503428534078, "rating": 5.0, "text": "Kevin and his team were very responsive when we needed assistance with a tree that had fallen on our client’s 114-year-old home. They worked until 3am to safely remove the tree and came back early the next morning to finish cleanup and hauling off the debris. Kevin is extremely safety conscious and had no problem showing proof of insurance and business license. I highly recommend Bigelow’s Tree Service and look forward to working with them again in the future.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM6KrRHx1ImaDjvluPDO-TbsdTeDnh8KdkgBzCc=w150-h150-k-no-p"]}], "resp": {"time": 1599355487007, "text": "Thank you Mr. Pittman!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "108933506792403296034", "name": "Monica Braden", "time": 1617566647037, "rating": 5.0, "text": "FftjagnsFNangngsgnmsgngstjwyjjyyjekyskyskykyssykskymgsghmsmgssmhsshmehkhmhmmhshmkhskyskyskyskysskykhskyssykkyskhssmhmhskhkhshksshkkhsjsjyhsyjshkdkhsykyskysjuttuasjtjtsutstjjtasutuaturqtqutuqutqtuutqutqtutququ5q5u4qu5uqtwutuw5uw.uttutuwutw5tuqqtuqu5 5uq w575757q74q74q747mq4m7mq57m7mq5um57qm47qm47m47mq74mq47m5m7qq47mm64q7mq4m7q4m747m74mqq64k47mq5q7m5umwum5wu5qmw5m7m7q47mqmq4m77m4qq46kq46k4q7k46kq4q6j4qj6q74j47mmq5u5uqm47m47mq74mq47m5m7qq47mm64q7mq4m7q4m747m74mqq64k47mq5q7m5umwum5wu5qmw5m7m7q47mqmq4m77m4qq46kq46k4q7k46kq4q6j4qj6q74j47mmq5u5umu5mwu5mq74mq47m5m7qq47mm64q7mq4m7q4m747m74mqq64k47mq5q7m5umwum5wu5qmw5m7m7q47mqmq4m77m4qq46kq46k4q7k46kq4q6j4qj6q74j47mmq5u5umu5mwu5mq5uqmq5m5m7qq47mm64q7mq4m7q4m747m74mqq64k47mq5q7m5umwum5wu5qmw5m7m7q47mqmq4m77m4qq46kq46k4q7k46kq4q6j4qj6q74j47mmq5u5umu5mwu5mq5uqmq5muum4uqmq4umq47m4m7u5mqq5umw5umutqmum5tauntaun4um5wumumumq4uqmq5uqu5m7mmy4q46qn46n3j64q7m5qummu4q44uqmum4qautmurm64kq7k4wk7t7k4qj74q75lw74kq 86z96ezx9e6 r9d9y maze and was he of were from was and grade 6d9xt9et8ez", "pics": null, "resp": null, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "112561815633087591390", "name": "Turo Tales", "time": 1604762293256, "rating": 5.0, "text": "Gave them a call on a Saturday expecting to hear back from them after the weekend.\n\nReceived a return call within the hour and was given clear guidance on expectations and pricing.\n\nExcellent and prompt service. (Will update with pictures after work has been completed!)", "pics": null, "resp": {"time": 1607055653229, "text": "Thank you very much!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "101097103405015662454", "name": "Nick sirak", "time": 1597610981526, "rating": 5.0, "text": "Fantastic job at a fantastic price. His schedule was booked solid but he managed to squeeze us in on a weekend. Did amazing work and you can't even tell there was ever a tree there anymore. Can't recommend him enough!", "pics": null, "resp": {"time": 1598585349099, "text": "Thank you sir! We knew that the tree was dangerous and wanted to make the situation safe ASAP. Thank you for the kind words!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "104945258289276218128", "name": "James Wiley", "time": 1614441550547, "rating": 5.0, "text": "A very Professional and Respectable Experience, will do business with them again", "pics": null, "resp": {"time": 1614871995022, "text": "Thank you so much! We appreciate your kind words."}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "108576323549059166687", "name": "Tonya Turk", "time": 1609356475216, "rating": 5.0, "text": "Great service and friendly to deal with. I recommend them!", "pics": null, "resp": {"time": 1609989176309, "text": "Thank you so much! I am happy you liked the work!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "106685406444347128393", "name": "Matt Campbell", "time": 1603055883675, "rating": 5.0, "text": "Thankful for teams like these in our community that look out for their fellow citizens! I wouldve done this myself but I dont own professional machines like these guys do. They showed up early and helped me out big time! I wasn't in a hurry to get the job done because it wasn't an issue but they fixed me into the schedule the next day.  Thank you Bigelow!🇺🇲\n\nAlso , if you have ornamental lawns, their machines will not harm your yard if you have healthy grass.", "pics": null, "resp": {"time": 1598585260792, "text": "Thank you so much sir! We are always here to serve. We are happy that you were pleased with the work."}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "103799856693908042059", "name": "Kris Bassett", "time": 1599325680031, "rating": 5.0, "text": "Excellent customer service, and the work they performed was by far the best I’ve seen in the area. Fast, professional, and friendly. Highly recommend!", "pics": null, "resp": {"time": 1599328120689, "text": "Thank you so much sir! We go out of our way to be the most professional company that we can be. It is nice to hear when it gets noticed by our clients. Thanks!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "103471902839248208111", "name": "Jonathon Broadhead", "time": 1593569621652, "rating": 5.0, "text": "Bigelow is hands down the best tree service around! We own a landscaping company and recommend them to anyone in need of tree services. They are responsive, professional, and always exceed quality expectations.\n\nIf you're looking for the best, look no further!", "pics": null, "resp": {"time": 1593607190114, "text": "Jonathan,\n\nThank you so much! We appreciate the kind words!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "112363267316820751223", "name": "Jeffery Jones", "time": 1588793897608, "rating": 5.0, "text": "He stayed in communication with me until the day he performed the work, he showed up on time and stayed each day until the work was done, and he maintained the integrity of their safety protocols. He cleaned up after he was done as well. Great job and great price. I’d call them again for sure!", "pics": null, "resp": {"time": 1593698046005, "text": "Sir we take great pride in our ability to communicate with our clients and our safety procedures on the job site. It's really good to see when people take as much pride in our safety as we do!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "118020940122515621653", "name": "Sandra Potts", "time": 1569355119549, "rating": 5.0, "text": "The quality of customer service was out of this world. Seeing Kevin and his crew in action was something like I've never seen. Lastly the fact that the trees they dropped were probably within inches from where he told me they would drop is beyond impressive.\nAnd if you haven't ever seen a tree drop 1st hand you should call them because it any experience of a lifetime.", "pics": null, "resp": {"time": 1569370740532, "text": "Thank you so much Sandra! I'm glad you enjoy the experience as much as you did!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "111238662203273709751", "name": "Mindy Turner", "time": 1562603015896, "rating": 5.0, "text": "We just hired Bigelow’s Tree Service to remove several dead/sick trees and bushes and prune healthy trees. We are SO thrilled with the work! Our property was immaculate when they left!\n\nKevin came in with the most reasonable estimate and is fully licensed, bonded and insured. So if God forbid, something happened on our property, his crew is covered by his insurance. Something to remember before you hire the free-lancing crews driving around.", "pics": null, "resp": {"time": 1599355444616, "text": "Thanks you for your kind words Mindy. We are happy that you were please with the work!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "117823538490539096940", "name": "Steve Dalke", "time": 1605388902302, "rating": 5.0, "text": "Brought me great seasoned firewood", "pics": null, "resp": {"time": 1607055609960, "text": "Thank you sir!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "111162970237586505027", "name": "Ken Biddulph", "time": 1553540634723, "rating": 5.0, "text": "Great service. Very thorough. Good price. Paid after the job was complete. Took down several trees and ground the stumps. Gave an estimate with several options. Took care of the trouble tree immediately, and came back at a later date (and sooner than anticipated) for the remainder of the job. I’d use him again.", "pics": null, "resp": {"time": 1553553889323, "text": "Thank you so much for the review Ken! I'm happy that we could help you out and look forward to working with you again."}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "102431263415576870777", "name": "Noah Hunter", "time": 1594389215460, "rating": 5.0, "text": "Delivery fire wood for when youre a little turnt up", "pics": null, "resp": {"time": 1594415748240, "text": "Sir, Thank you so much! We love to support our community"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "113636354319039152192", "name": "Joe Letourneau", "time": 1506175136215, "rating": 5.0, "text": "Kevin and his crew were phenomenal. Professional service at a reasonable price. You might get a cheaper quote from someone else, however good luck trying to find them to come do the job after they've quoted you, or even worse they start the job and never finish.\n\nKevin quoted the price, and kept in touch the whole time as they were doing the set up for the removal and stump grinding. I  was extremely impressed by his honest and dedicated service, and I would recommend him to everyone who ever asks me.", "pics": null, "resp": {"time": 1507409842583, "text": "Thank you so much for the kind words Joe. We really go out of our way to make sure the customer is happy. I know it takes a lot of time and energy to write these reviews. We really appreciate it!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "102932560093225843725", "name": "Christopher Calvin Reid", "time": 1568663481085, "rating": 5.0, "text": "Great service and fair prices!  I highly recommend for all your tree service needs.", "pics": null, "resp": {"time": 1593698078730, "text": "Thank you very much sir!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "102841586148835528345", "name": "Skyler Gray", "time": 1505742972986, "rating": 5.0, "text": "Amazing job! Had a big oak in the backyard that was over the house and a neighbors house. He was very professional when he showed up and was very personable and knowledgeable. Him and his crew took the tree down in pieces with little issue. Before leaving they raked everything up that was left over and made sure everything was satisfactory. Would definitely call them again and highly recommend them.", "pics": null, "resp": {"time": 1507410165601, "text": "Mr. Grey, we're really happy that you were pleased with our service. We go out of our way to present ourselves as professionally as possible. If you ever need anything again please feel free to call!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "104145367453317464505", "name": "Daniel Rawlings", "time": 1511049884528, "rating": 5.0, "text": "Kevin and his crew were very professional, dependable, and reasonably priced. His crew were completely respectful of our property while removing 4 trees, three of which were over the house.  He is the company I am going to call for some future work.", "pics": null, "resp": {"time": 1511326938435, "text": "Mr. Rawlings,\n\nThank you for letting us serve you! We appreciate the kind words. I look forward to serving you in the future!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "107981272540053094065", "name": "Hooknspktr", "time": 1526676558777, "rating": 5.0, "text": "Owner showed up on time for the estimate and on time for the job.  Had 5 large trees taken down close to my house.  Area was cleaned up spotless and stumps ground down.  It's like the trees never existed.  No damage to structures or land.  Price was reasonable and you simply cannot get better service.", "pics": null, "resp": {"time": 1526677817121, "text": "Thank you for the review! I am happy that you are please with the work. Please let us know if we can ever help out again!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "105920273158954680003", "name": "Donald Hood", "time": 1492965479382, "rating": 5.0, "text": "Had several trees cut down and stumps removed. The price was miles better than others that i had give me a quote. I was more than satisfied with the work that has been performed. The clean up after was above and beyond. It shows a sense of pride missing from most other service providers i have observed working in the area. I will highly recommend to others and use for any future needs.", "pics": null, "resp": {"time": 1493157363789, "text": "Donald,\nThank you very much for the review. We strive for customer satisfaction. It always feels good when a customer is happy with the work! It was really nice meeting you and your wife. I hope to serve you soon again."}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "108032948311631899659", "name": "CJ Whitney", "time": 1491912232634, "rating": 5.0, "text": "Great service! Showed up on time to give me an estimate and was very professional and knowledgeable. Fair priced and met my timeline on the job. Kevin has earned a long time customer in me! Highly recommend Bigelows tree service!", "pics": null, "resp": {"time": 1491913009817, "text": "Thank you CJ! I am always happy to hear happy customers! It was a pleasure serving you."}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "108700525718613301418", "name": "Keith T. Bonner Jr.", "time": 1492207013023, "rating": 5.0, "text": "I had a large oak tree that was overhanging my home and was concerned that it may fall on my house.  He came out to my home and quoted me a very competitive and honest price.  He removed the tree, stump, and filled it in within one week of the quote.  Customer service was superior and quality of work was outstanding.  I would definitely recommend him for any tree service.", "pics": null, "resp": null, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "105854306082893364304", "name": "Craig Buehl", "time": 1508686347486, "rating": 5.0, "text": "Great guys.  Honest and flexible.  Very professional.  They did a great Job.  They returned phone calls and emails quickly, showed up ready to go on time, worked hard to make sure the job was done on time.  I would HIGHLY recommend them.", "pics": null, "resp": {"time": 1511326670899, "text": "Mr. Buehl,\n\nThank you for the kind words! We appreciate the recommendation and hope to serve you in the future. Thank you again!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "104539599917626721145", "name": "Justin Watson", "time": 1494599086535, "rating": 5.0, "text": "Kevin is awesome. He came out to give us our estimate on felling a dying pine and his prices were beyond competitive. He showed up exactly when he said he would and was very professional. He dropped the tree in the only small gap available in order to not cause any damage to our property or pool. I'd recommend Bigelow's Tree Service to anyone looking for tree work to be done.", "pics": null, "resp": {"time": 1494602771108, "text": "Mr. Watson,\n\nThank you very much! I am happy that the work was to your satisfaction. Please let me know know if you ever need anything."}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "112209738157162765951", "name": "Anthony Probasco", "time": 1491792594216, "rating": 5.0, "text": "Truly quality service... Kevin is not your usual service provider, this guy is extremely over educated with a graduate degree and tons of life experience. Him and his wife appear to be a wonderful family. Their prices are really good for the quality they provide. Simply put if your looking for safe clean and professional they should be your choice.", "pics": null, "resp": {"time": 1492134620410, "text": "Thank you very much! If you need anything else feel free to call!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "107185996296008428550", "name": "Creation Carpentry", "time": 1492032581071, "rating": 5.0, "text": "I had a need for some work with a trailer hauling some stuff back to the house and Kevin took time out and immediately helped me out for a fair price. He was timely and on budget. Thank you for your hard work and honesty it's really nice in a world like this.", "pics": null, "resp": {"time": 1492033897880, "text": "Thank you for the review! I am glad to help and hope I can help in the future!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "117022779398573615366", "name": "Clegg Snipes", "time": 1488245961888, "rating": 5.0, "text": "This is a very great company and are particularly detailed at what they do!!!! I would recommend anyone needing any tree work, stump grinding or just an estimate on prunning some limbs/trees to give them a call ASAP. The owner is very kind and polite and will go out of his way to help you. They are insured and I have heard nothing but positive things about Bigelow's Tree Service!!! Call them today!!! 💯%!!!!", "pics": null, "resp": null, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "109166906998248939624", "name": "Kim Mentzer", "time": 1532039684559, "rating": 5.0, "text": "Kevin and his crew are great. We  came home to find our tree and house zapped by lightening, called Bigelow ' Tree Service they came out immediately and assessed the situation. They were worried about the tree falling on the house and causing more damage to the house or our family, they took the tree down immediately while it was still storming out. Now that's customer service!!!  They came back and cleaned all debris away. Any one needing tree work give them a call Great people to work with!", "pics": null, "resp": {"time": 1532725735386, "text": "Thank you so much for the kind words Kim! I'm glad that we could help you out. Please let me know if there's anything else you ever need!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "115614281110316049526", "name": "Summer Keahey", "time": 1500141627162, "rating": 5.0, "text": "Kevin came to my home after a storm came through & a big tree landed on my home, auto, & power lines. He made the experience much easier to deal with. He was ready & eager to start the job. He did an amazing job removing the tree & the clean up afterwards. My yard looked so great afterwards. He worked very hard & really helped us deal with the whole situation. His prices are great & he is all around a super friendly guy. I would highly recommend him to anyone. Thank you so much Kevin! We appreciate everything!\n*Summer Carter*", "pics": null, "resp": {"time": 1500246170167, "text": "Summer,\n\nThank you for the kind words! I was happy to help and am glad that everyone is safe and back in your home! The circumstances were unfortunate, but I was happy to meet you and your family. If you guys ever need anything again, please feel free to call."}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "118374706137022654111", "name": "Betty Gerard", "time": 1482685851372, "rating": 5.0, "text": "Kevin and his wife did a great job at our house! We had 3 large pines overhanging our house and we were really worried that a strong storm would end in a tree through the roof. Kevin came out and looked at the trees for us. He was well spoken and when we found out that he was still in the military we made up our minds to go with him. Him and his wife took the trees down over three days and then cleaned up the yard like the work never happened! I highly recommend going with Bigelow's Tree Service!", "pics": null, "resp": null, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "105689986926106961030", "name": "Brad Snellgrove", "time": 1502906263904, "rating": 5.0, "text": "Kevin and his crew do a fantastic job! They will do the extra steps to make sure the work is done properly! Highly recommend!", "pics": null, "resp": {"time": 1511326819858, "text": "Brad,\n\nThank you so much! We try very hard to focus on the details. We are glad that you noticed and appreciate the recommendation!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "101989616526698242303", "name": "Josh Wheeler", "time": 1495426191540, "rating": 5.0, "text": "Very professional. Not hard to tell kevin is military by his work ethic and respect. Had him cut down a large branch that was hanging over my fence. Left the yard as clean as he found it. Wood (pun intended) use this service again. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "112840891747740817824", "name": "Tina Dunning", "time": 1491246851748, "rating": 1.0, "text": "Very unprofessional tree service ! Was not in time for the estimate and try's to get more money that what the job is worth. I wouldn't not recommend Kevin at all.", "pics": null, "resp": {"time": 1491447108909, "text": "Mrs. Dunning,\n\nI think you have the wrong Tree Company.  I have not met you nor have I ever conducted an estimate for a person with your first or last name. That being said, Bigelow's Tree Service is built on the reputation of being on time and completing a job to the highest standard. My 17 years in the military have taught me that being \"in the right place, at the right time, in the right uniform\" is of the utmost importance when establishing relationships. For this reason my business would not survive if I conducted myself in the way you portrayed. I will tell you that I will not be the cheapest in town. I take extra precautions, in accordance with the International Society of Arborists, to ensure the safety of myself and my crew. Additionally I focus on the quality of work, not the speed at which I can get it completed. This being said I am sorry that you had a bad experience with a local tree company, however, I assure you that it was not me. If you would like to discuss this further please give me a call."}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "115375410856154893272", "name": "Andrew Huggins", "time": 1539963420193, "rating": 5.0, "text": "Kevin and the team at Bigalows are great to work with! I would suggest to anyone!", "pics": null, "resp": {"time": 1539990034555, "text": "Thank you so much!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "107519432841146759933", "name": "Darick Wildman", "time": 1495443724184, "rating": 5.0, "text": "Veteran-owned and operated service.  Very professional and reliable.  Highly recommended.  My only go-to for this type of work.", "pics": null, "resp": null, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "109796618529785920991", "name": "RedTails", "time": 1502911838787, "rating": 5.0, "text": "Outstanding service!\nKevin Bigelow came by within 24hrs of first contact,  did assessment,  and was job complete within 2 days....Tree looks great!  Gives the property a total male over...  Ohhh,  they cleaned up EVERY leaf!!", "pics": null, "resp": {"time": 1507409976182, "text": "Mr. Poe, Thank you very much! We appreciate you writing a review. If you ever need anything else please feel free to call!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
