{"user_id": "112395099541026468552", "name": "Nicholas Pohl", "time": 1623804787569, "rating": 5.0, "text": "Very nice fiberglass catamaran 26’ boats, completely coast guard compliant, all rigging included, modern engines.\n\nThe staff is very friendly and knowledgeable. We ran into a bad weather issue after an hour on the water, but with the fun we’d already had, we’ll be returning tomorrow morning for some fun in the sun.\n\nI would highly recommend them if you are looking to do some exploring, play on sandbars, fish a bit… whatever.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "116278162261279291552", "name": "Brandon Williams", "time": 1597367877371, "rating": 5.0, "text": "GREAT DAY ON THE WATER!\n\nMy family recently rented a pontoon boat from Orange Beach Boat Rentals and had a fantastic experience! From making the online reservation, payment, orientation, boat pick up, and drop off processes were super easy.  The entire staff was friendly, informative and very helpful. You can tell they love what they do. The boats were top notch and it even had a restroom.  Would highly recommend and will be back next time we're in OB!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNRKWHIU8xfmUIGET_AbM3ulrUyMW6V6HH3fX6K=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN5Omg0aFDlsslEkvG92qmGAURryvS5NO92Y-jq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMAqiYFg7XKRw722iQu184om9SoTyzyRhUyKcb2=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "118007504726909748777", "name": "Memorie Cole", "time": 1624062563899, "rating": 5.0, "text": "Doug was amazing. Very helpful and accommodating. We had so much fun on the water and have already started planning our next time out", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "117948448512418976744", "name": "Ashley Allerson", "time": 1618341412388, "rating": 5.0, "text": "We had a great day on the water renting a pontoon. Danny was through and knowledgeable and a super cool guy to chat with. The boat was extremely clean and well kept. Pulling back in after a full day was easy to fill up and pass the boat back over. Prices were great and we would definitely rent here again. Thanks Danny!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "106016187240139687001", "name": "gaye mayo", "time": 1561312496490, "rating": 5.0, "text": "Thank you to Orange Beach Boat Rentals for an amazing time yesterday! My family had an awesome time going to Pirates Cove, seeing dolphins and going swimming! The directions and the GPS are fantastic and having a bathroom on-board is a lifesaver! The directions and it was nice to see that Jack wanted to make sure we knew everything about the boat before we left.  Thanks again Orange Beach Boat Rentals and we can't wait to come back the next time we're in Orange Beach!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNSTe0jkZsb1fUkCd88hCVXoBzx-K26Ta6QdGaI=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "104282226857319213304", "name": "Karla Thornton", "time": 1620501907383, "rating": 5.0, "text": "Great time, great boat and crew.  Lots of dolphins and seagulls and pelicans.  Just a beautiful day with great tunes playing.  Everyone had a nice time.  Recommend highly!!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "117366644843506561311", "name": "kevin stutting", "time": 1616170958042, "rating": 5.0, "text": "Capt Danny was awesome! Best renting experience I have had in boat renting. A rental boat with a stereo that was loud and and a 150hp motor that wasn't throttled down. These boats have a head (bathroom) that keeps everything less urgent...", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "107428951886942898318", "name": "David Naylor", "time": 1617588975049, "rating": 5.0, "text": "Best part of our vacay. First, Captains Igor and Danny are good guys who are knowledgeable, friendly and patient. The boat was immaculate and so nice having a step down bathroom!  Our dog was welcome and he loved it!  They brought fishing stuff for my son when we changed our mind last minute, and got us out on the water quick. Their recommendations of where to catch a fish and where to see dolphins were spot on!\n\nThe boat itself was easy to use and had great technology. Good sound system and excellent depth finder / gps. Boat was in tip top shape and easy to use. While I am very experienced on a boat, a beginner could use this pretty easily.\n\nWe took the four hour trip. The only problem was we should have gotten the full day rental!!!  Next time!  I will definitely rent from them again.\n\nFinal part was the gas up and check for damages. They quickly assessed the boat and saw it was in good shape. Four hours of boat time and just about $20 of gas only, so efficient as well.  No hidden fees or charges at all.\n\nWe appreciate y’all making our day so fantastic!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "103379792096691051342", "name": "Tommie Mccool", "time": 1598479949069, "rating": 5.0, "text": "Great Rental Company\n\nWe had an Amazing day. The check-in process was very thorough and informative. The boats were Amazing and very clean. They were fully loaded with a bathroom, GPS, xm radio etc.\nWe saw lots of dolphins, fished for a few hours, stopped by a beautiful sandy beach island and had lunch at Tacky Jack's.  We have rented boats from all over, and this company really stands out, we were impressed all the way around. Great Boats! Great Service! Great Day!  Top Notch Service. We will be back next time.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "109613474280614917898", "name": "Ryan Files", "time": 1601303446614, "rating": 5.0, "text": "We rented one of their pontoon boats a couple of weeks ago. Fantastic experience! The boat was in great shape and they provided a map that was extremely helpful for our navigation. Everyone there was a pleasure to deal with and I wouldn’t use anyone else after such a great experience. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "110744075825733328626", "name": "natalie mrocek", "time": 1596221052448, "rating": 5.0, "text": "AMAZING DAY!\n\nAmazing day on the water. I am so glad we decided to rent a boat for the day. We saw lots of dolphins, got to hang out on a island, go fishing and had our best day on vacation on the back bays of Orange Beach on the boat.  Customer service was Awesome. We can’t wait to rent from Orange Beach Boat Rentals again very soon. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "105511405355175593558", "name": "Richard Dias", "time": 1498184650488, "rating": 5.0, "text": "Orange Beach Boat Rentals was fantastic. Captain Igor did an excellent job with boat preparation. There is a video that explains the safety features of the boat and of proper etiquette for traveling on the Inlet. Captain Igor then reviews any questions you have. Our boat was well-maintained and very clean. Our entire family had a great day on the water seeing dolphins and finally stopping at a beach. I would recommend orange boat rentals to everyone. When our family goes again no doubt where I will go to rent a boat.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOvjFu5GATUyB1Nys4uMZJP6-73M6CvjAnBjoOJ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "114217863759634135426", "name": "The Nortons (Jenny)", "time": 1599574538175, "rating": 5.0, "text": "Our family had a great time on the water thanks to Orange Beach Boat Rentals! Danny was very knowledgeable about the area and helpful at check in and the boat was perfect for a family! We saw so many birds and dolphin! Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "103988879924585843331", "name": "ihyzey", "time": 1593732638419, "rating": 5.0, "text": "We had a blast. Worth every penny. Danny was amazing. Customer service was awesome and you don't get great customer service too much anymore. You can tell they love what they do. We arrived and everything was ready to go. They made it so nice and easy.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "111301384544058275380", "name": "Christopher McCarthy", "time": 1600087508452, "rating": 5.0, "text": "Had a blast! Great training video. GPS and hand map made it SO enjoyable.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNnpTJu4LkWhkoKdraVhL5pMqrRJ64Z8-hSvdAm=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "117951613584680788421", "name": "Natalie Whitehead", "time": 1595549117233, "rating": 5.0, "text": "A great family excursion! We saw dolphins, caught fish, and had plenty of room on the boat for 5 of us. Plus, we went out in the rain, and the people at Orange Beach Boat Rentals told us to keep the boat out for a couple of extra hours no charge in order to make up for subpar conditions. We didn’t ask for it; they just kindly offered. Such great service!!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "115860195063294710490", "name": "kenneth gossett", "time": 1592351497751, "rating": 5.0, "text": "Came down here on vacation, we have used a few different boat rental places so far and we definitely saved the saved the best for last. Best boat rental by far. Very clean, very respectful and courteous staff, with top of the line boats! These guys will not disappoint!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "106806080659760136917", "name": "Bill Knox", "time": 1600727116029, "rating": 5.0, "text": "April and Capt Danny were amazing in helping us with our fishing trip.  Their prices were competitive, but their service was off the hook - much like my bait.  We will be back for more.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "103954048580229089139", "name": "Jeff McLaughlin", "time": 1597240336922, "rating": 1.0, "text": "Boat itself was very enjoyable. Family loved it. However, April whomever that may be sorely needs a class in customer service and has an issue with feeling the need to be correct. Even with a paying customer.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "113185380629164030485", "name": "Kate Green", "time": 1590032055066, "rating": 5.0, "text": "Rented a boat full day on May 19th. It was the best day we had on vacation by far. Family owned very friendly. We loved the boat super comfortable sat 6 comfortable and could have sat more. Will definitely rent again when in town.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "113708637985060761434", "name": "Michael R", "time": 1592108798361, "rating": 5.0, "text": "Wonderful Time for the Family! Thanks Captain!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN-mNkxomi_fdR4XCcI7xyKAvEqYK_UubU73KPC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMEXm14qQRfqJio3gMO84jfwpTtfO454TPFnw9K=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM-9XPU2AD8HWb4OhWIEZG1AcmqWTWqJ87dbafj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNTfatAX1BMm5CnASHVsRk3loQGL1QhWe77-Nhj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNtV_dj3yvpGLT-I6Uzs3HtRVhH0QVAAOaErvZZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNdLiH4r7b11REje18LILFYG7YE-n3JM9GFk_gz=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "110504018353551169783", "name": "Shell Mitchell", "time": 1597253261359, "rating": 5.0, "text": "Amazing Day! Highly Recommend!\n\nYesterday was our 2nd time renting with Orange Beach Boat Rentals and we love their boats and their Amazing customer service. We have rented from many other rental companies and they by far have the nicest boats. We love the convenience of the restroom and the garmin gps. The orientation is very detailed and thorough. We saw lots of dolphins, went to pirates cove and did a little fishing. Once again my families favorite day of our vacation. We highly recommend Orange beach boat rentals. Highly Recommend!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "111387897484717645469", "name": "Heather Roaden", "time": 1591137742867, "rating": 5.0, "text": "Best Day on vacation!! Kids had a blast catching fish! Customer service is amazing!!! Very clean and well maintained boats! Got to see alot of Dolphins!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "108838757210566577432", "name": "Sydney Verant", "time": 1565032680236, "rating": 5.0, "text": "I highly reccomend a full day boat rental so that you have time to go to the beach, go fishing , hit the restaurants (I reccomend pirates cove), and see the dolphins. Go to the beach earlier when there are less people and drive slowly to see the dolphins. There may be a shrimp boat throwing over their unwanted catch where the dolphins are hanging out. You can buy some shrimp right from the boat too, but dont feed the dolphins: it's illegal.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPHg6yYyNvmF22nviNHZvMQVg9u6Guaq1D8UgaJ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "100081859849112308879", "name": "Sherrill Mitchell", "time": 1566238587273, "rating": 5.0, "text": "Excellent Boat rental company\n\nWe rented a boat from Orange Beach boat rentals on Saturday. We had a group of 8 and it was very comfortable. The boats were extremely clean, we loved having a restroom onboard, and they rode so smoothly. We had such a great day.  Everything about this company was professional and smooth, from booking the reservation, to being greeted and instructed during the orientation., they gave us all the local tips and recommendations, which was right on point. We highly recommend renting from orange beach boat rentals and will be back soon.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "118388488383513067012", "name": "John", "time": 1566943967968, "rating": 5.0, "text": "Great boat rental company. Highly recommend going to Robinson Island area.. there’s lots of restaurants and bars. You can also park your boat on the sandy island just south of Robinson Island (many people go there).\nThe instructions and orientation of the boat is from a simple 10 minute video on an iPad they give you.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "113783782381522352755", "name": "Debbie Mcneal", "time": 1562364710431, "rating": 5.0, "text": "These guys are awesome. They give you the best service in Orange Beach. They take really good care of their equipment. Have no junk. Best boat ride and fishing trip I've ever been on. Please contact them for all your boating needs when your at beach. You want be disappointed.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "116858513354408406740", "name": "Craig Anderson", "time": 1589890795378, "rating": 5.0, "text": "Great experience! I have rented from several places in OBA, and this was the easiest by far.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "102111347070563568211", "name": "Ryanne Riegling", "time": 1554991294513, "rating": 5.0, "text": "We've rented boats from many different places and this was by far the best. Very good pricing, excellent boat! The catamaran has a bathroom in it, which was super helpful since we were out all day. The boat was outfitted with a GPS / fish finder and the company provided a very detailed map to go along with it. The gulf is quite a large area and this made it very easy to navigate.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "108873400515275903745", "name": "Kevin Tuttle", "time": 1563840607776, "rating": 5.0, "text": "Me my family had a great time anybody that complains about the $75 charge cost for running into sand bar are idiots or must be drunk  and not paying attention I had no problem  with the state-of-the-art of quipment that they supply I also went to Robinson beach but I did not beach the boat I went to the radar showed 2' and had no problem my family swam we caught fish the great thing about it was the bathroom for my small children was the excellent decision we had a great time rented for a whole day Jack the deckhand did a excellent job in explaining everything and showed great care for my children and safety I would definitely rent from them again no questions asked it was a great experience", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "109699628240724154815", "name": "Rachael Austin", "time": 1562115271737, "rating": 5.0, "text": "Fantastic boat rental company! They are very thorough and make sure your boating needs are met. They provide great customer service and the boats are easy to operate and fully equipped. Will be renting from them again, hopefully soon!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "114453271817809852265", "name": "Steve Vance", "time": 1537674073999, "rating": 5.0, "text": "Great company that truly understands customer service. They went out of their way to ensure our day was trouble free and enjoyable with a very structured introduction to the boat and area. Although, the most important touch was their genuine care for my son who was sick the night before, checking on him even after our boat ride. Class acts.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "106653473675616632123", "name": "Shqne 850", "time": 1563239424662, "rating": 5.0, "text": "Had a great time! Knowledgeable staff, showed us fishing spots and where to go for some good food! Very clean boats. 10/10 I will definitely return!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "114620295721756633515", "name": "Albert Garcia", "time": 1497544438330, "rating": 5.0, "text": "Absolutely Fantastic!!!!\nWe rented a boat yesterday from Orange Beach Boat Rentals, and had the BEST Day ever. Our family of 5, 2 adults and 3 kids spent most of the day at the island swimming and hanging out on the beach, the island was such a fun atmosphere, my kids played with all the other kids, we had a picnic on the beach, and got a nice tan. On our way back in we saw lots of dolphins, they are just amazing to watch, and our on private dolphin show.  Our check in process was super easy, Igor gave us a very detailed orientation and explained to us how to stay safe. The boat was Very nice, it had a full restroom, a nice stereo system, comfortable cushions a canopy to get out of the sun, our motor was super quiet and cranked on the 1st turn, in the past we rented from other companies, and their boats don't even come close to Orange Beach Boat Rentals. We can't wait to come back. We highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "109590816554578942191", "name": "Brenda O’Quinn", "time": 1529795035063, "rating": 5.0, "text": "Best Day Ever!\n\nWe had a Great Day. The boats were very nice. We saw dolphins, went to pirates cove and swam near the islands. The boat was very nice and had a lot of get up and go power. We were a family of 7, with 2 small kids, they napped perfect on the boat, as the back of the boat had a nice canopy and comfortable seat cushions. We couldn’t have asked for a better day on the water. We will be back in a few months and will only rent from Orange Beach Boat Rentals, as they truly are the Best.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "105320767736524840279", "name": "Kelly Robertson", "time": 1526581023468, "rating": 5.0, "text": "Amazing Boat Rental!\nWe rented an 8 hour boat rental yesterday for our family of 5. It was a perfect day. Igor did our orientation he was very nice and answered all of our 150 questions. The boats were very nice and clean, the restroom was such a nice bonus. The shallow water alarm was very helpful of keeping us away from the sandbars.\nWe spent most of the day on Bird Island, and stopped by Pirates Cove on our way back, then finished the day watching all the beautiful dolphins.  We have rented from many companies before and Orange Beach Boat Rentals does it right. We Highly recommend them, and we can’t wait to come back and rent again.\nRobertson Family", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "113592040548256165247", "name": "Emma Whitlock", "time": 1529162184268, "rating": 5.0, "text": "Amazing Boats!\nWe had a Great day on the water. We spent most of the day watching dolphins, swimming, fishing. The boats were perfect, very clean and had lots of extras. We loved having the restroom, the shallow water alarm kept us safe, the islands were beautiful. It was an Anazing day. We can’t wait to go again. I highly recommend Orange Beach Boat Rentals, as they made sure to cover all the details to make our day perfect.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "106665424345273713859", "name": "Timothy Thurnes", "time": 1564068958207, "rating": 5.0, "text": "Friendly and helpful staff. Equipment is clean and in great condition. We really enjoyed the experience.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "114183063742620900243", "name": "Keila Morse", "time": 1601408441212, "rating": 4.0, "text": "It was not very luxurious but they had a small toilet on board.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "118035943494891631236", "name": "Mike", "time": 1527427654172, "rating": 5.0, "text": "These people are top notch. Very nice and informative. We took our 6 year old out and let him catch fish. Captain Egor was busy but still was more than happy to answer any questions we had. He led us right to the fish. You get a map with Fishing spots,restaurants,dolphins and other attractions that’s easy to follow. I will be renting another boat from them next time I come.\nAs far as the prop goes: don’t run it in the sand and you won’t be charged. Pay attention to the channel markers and the gps mapping that is provided on the boat. It only takes common sense. As a boat owner myself I know how expensive props and lower units are so I completely understand there charge for running there boat aground.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "101131062611636075267", "name": "Marylynn Dibble", "time": 1496510908639, "rating": 5.0, "text": "Fun day on the water!!!!\nMy family took a boat out yesterday with Orange Beach Boat Rentals. It was a Awesome experience from the time of booking till the very end. Fantastic boats with a nice Restroom, lots of room. It had a GPS on it with a shallow water alarm which kept me away from the sandbars. We went to pirates cove and had a cheeseburger in paradise, we saw so many dolphins and had the best day of our vacation. Orange Beach Boat Rentals really made us feel welcome, and even gave us some great tips where to take our kids fishing. We have rented from several other companies and this was the Best experience we have ever had, we will defiantly be back. Thank you again, my kids will talk about this day forever now.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "113095909993476827769", "name": "Momma Savannah", "time": 1496281038509, "rating": 5.0, "text": "Awesome day on the water!!!!!  My family absolutely had the best day on the water. The boat was Great, it had a nice canopy so my kids could stay in the shade, a Full RESTROOM, which was so convenient, a stereo system which was awesome while we were parked at the islands, and lots of storage for our stuff. This was not our 1st time out with Orange Beach Boat Rentals, and we will be back again next year, Thanks Again for a Awesome day on the water..", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "111066108640683324583", "name": "Jason Easter", "time": 1496336901150, "rating": 5.0, "text": "The BEST - only rent here!\n\nMy family and I rented a boat for the day & were EXTREMELY impressed!! Such great service, attention to detail, nice clean boats & most of all personal, professional service from a husband & wife team.  They went over in detail with us on how to operate the boat safely, understand the GPS and the shallow water alarm, and even gave us a laminated map with all the local waterfront resturants, fishing spots and where the Islands were. As another reviewer said -they have great reviews for a reason! We felt personally welcome & safe on the boat & they wanted us to enjoy our experience. We saw 24 dolphins- no kidding- all on our own as we cruised the back bay areas. Better than any dolphin cruise we have ever been on- our 2 boys (7 & 9) loved it! We rented some fishing equipment for our boys & it was perfectly prepared and on the boat for us when we arrived. Can't say enough about how impressed we were with Orange Beach Boat Rentals, as we have rented from other companies in the area and we will be back with them on our next trip to Orange Beach.  Call early to reserve as they do book up!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "116325614472174986931", "name": "Brian Handke", "time": 1530217180827, "rating": 5.0, "text": "Awesome!!!\nThat is the only way this company can be described.  They go above and beyond on everything, the boats are great, the GPS is great, the maps are unbelievably detailed, the video explaining everything, Jack then went over everything again and even helped us load and unload the boat.  We rented for 8 hours and ran all the way up to Perdido Key bridge then down to Robinson Island and back and only used $40 in gas.  Got to see a bunch of dolphins, had a blast at \"hermit crab island\" near Holiday Harbor, and had an awesome time at Pirate's Cove, letting the kids swim while we waited on our food.  Really can't say enough good things about these folks, will definitely rent from them again when we come back!!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "103258629579986958208", "name": "Kristy Santa Cruz", "time": 1497538411490, "rating": 5.0, "text": "Awesome Boats! We had so Much Fun!!\n\nMy family of 5 had a wonderful day on the water. The boat was spacious, very clean, and very well equipped with lots of extras, including a Restroom, GPS and large map, it even had a radio with xm radio. Much better than others that I had looked at in the area. I booked online, it was very easy, and they emailed me my confirmation, and directions.  Igor was very friendly, patient, and very informative during our orientation he explained to us how to stay off the sandbars, and gave us some great fishing tips too. We had a great, safe day on the water, we should have applied more sunscreen as we were all having so much fun and forgot.  Will definitely rent from Orange Beach Boat Rentals again. Thank you so much for such a wonderful trip! Our kids can't stop talking about how much fun they had!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "114416386633050404268", "name": "Meagan McClain", "time": 1538781395563, "rating": 5.0, "text": "Thoroughly enjoyed our time on the water, great recommendations with places to eat and where to fish and see dolphins. Pirates cove will definitely be a place that we revisit. We will be using orange beach rentals again.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "110371950577891451870", "name": "Adam Austin", "time": 1468343005091, "rating": 5.0, "text": "I COULDN'T BE HAPPIER WITH THIS TRIP!\nI called to rent a boat for me and the wife to go out for a day! Booking was easy and Captain Igor met us at the boat launch to explain boat safety and great places to explore. Rachael and I spent all day boating! Robinson Island was our fun and the water was so clear that day. We felt like we were in the Bahamas. We explored some of the bay and stopped by Pirates Cove for a drink. We loved seeing the dolphins and the sunset on the way back was beautiful. The boat was clean and in good condition. Overall, very pleased with this trip!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "113286482925029115737", "name": "Cazes Martin", "time": 1526323142609, "rating": 5.0, "text": "Our family rented a boat for the day and had a perfect time. Boat was clean and  comfortable and ran perfectly. Igor and April were very friendly, attentive and professional and were genuinely focused on assuring that we had a nice day. I've been going to the Gulf Shores area for 30 years and had never rented a boat to explore the back waters - we'll have a boat day every year from now on!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "117525525610685395549", "name": "Monica Sands", "time": 1497466961358, "rating": 5.0, "text": "AWESOME! AWESOME! AWESOME!\nWe rented a boat yesterday June 8th, 2017 from Orange Beach Boat Rentals.  Everything was just Amazing, we rented some rods and bait, and they had it ready on the boat when we got there, he showed us on the map where the fish were biting the day prior and gave my son some great fishing tips.  After fishing for a few hours, we did catch and release, we ran into a group of about 15 dolphins, they were so graceful and beautiful, we had our on Private Dolphin Cruise.  We then pulled into Ingram's Bayou, which was easy to find from the map that was provided to us and we swam for a while, then went back out and watched the dolphins some more. Then we pulled up to a secluded beach and found some nice treasures to take back with us \" shells, driftwood etc.\"  It was such a perfect day, and Igor and April was so accommodating, we felt so welcome on their boats, and they really went above and beyond in many ways. There was even a restroom on the boat! The GPS was a huge plus and the shallow water alarm kept us away from the sandbars.  So glad we found Orange Beach boat rentals, we will make this a annual trip now.  Thanks Again so much from the Sands Family!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "116459542144011387819", "name": "Sunshine S.", "time": 1519840301181, "rating": 5.0, "text": "BEST BOAT RENTALS ON THE ISLAND!!!\n\nStarting from the time of booking \"which we did online\" to the emailed instructions & directions to our orientation, then a great day on the water,  up until we unloaded from our day on the water was smooth and enjoyable. We loved the boat, the restroom was a great bonus as well as the gps which made navigation around the shallow areas easy. We spent most of the day at the islands, found some shells, did a little fishing and saw lots of dolphins. We ate lunch at Tacky Jacks, we just pulled right up on the boat and tied up, super convenient. We have been coming to Orange Beach 1-2 times a year for the last 10+ years, and we will Only rent from Orange Beach Boat Rentals from now on.  Great People and Great Boats!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "112783600554682097273", "name": "Dusty Bias", "time": 1473036391569, "rating": 5.0, "text": "I have rented from Orange Beach Boat Rentals multiple times over the years. I have always had the best experience and really felt like we got the best bang for our buck. The boats are reliable, clean, and properly prepared to accommodate the needs of any boater.\n\nThe bays around Orange Beach can be challenging and confusing for someone who has never spent time boating in the area. Orange Beach Boat Rentals does a fantastic job giving a quick and thorough tutorial of the the local waters, preparing you for a fun and safe day boating.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "103700708859532234948", "name": "Katy Marie Heick", "time": 1533572637166, "rating": 5.0, "text": "We recently rented a pontoon boat from Orange Beach Boat Rentals and had a great experience! The reservation, payment, pick up, and drop off processes were easy peasy. Igor and Jack were friendly and definitely knew what they were doing. Would recommend and will be back next time we're in OB!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "110928108998968420847", "name": "David Barajas", "time": 1532454817239, "rating": 5.0, "text": "This operation is phenomenal!! - No rigid fixed time slots, very accommodating and great services!\n\nMy family was in Orange Beach for a USSSA World Series torny and\nmy grandson had a very tight schedule..\n\nI needed to start our day earlier than their normal time, and wanted to use the boat for 6 hours instead of their normal 4.. NO PROBLEM!\n\nWe had a great time out, saw lots of wildlife, birds, dolphins and\nhad a great time fishing.\n\nBoats are clean, easy to handle, and staff is top notch!!\nMade a great addition to our vacation.\n\nIf I'm ever back in this area I will definitely use them again.\n\nThanks to all!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "117054111439049194551", "name": "Ron Thrift", "time": 1468206533386, "rating": 5.0, "text": "HIGHLIGHT OF OUR VACATION !!!\nThank you Igor a April for our smooth experience.\nGreat directions, pleasant boat orientation, clean and reliable boat\nwith a restroom aboard ! Map and GPS were great, XM radio jamming..\nWE LOVED THE BEACHES, PIRATES COVE AND ABUNDANCE OF DOLPHINS ALL AROUND !\nI am so glad that we have booked week in advance before all boats were taken. We will be back next year!\nHighly recommend to any family visiting Orange Beach", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "112796912546378090881", "name": "Tomas Kratochvil", "time": 1527960975589, "rating": 5.0, "text": "Best Boat Rental!!!\n\nNicest boat we have ever rented, it looked like a personál boat and not a normal standard rental. The restroom was a huge bonus. Very comfortable and smooth ride. Igor was very professional and provided us with some local knowledge of where to go and we had a awesome day on the water. I will be reccomending Orange Beach Rentals to all my friends and family. Amazing day.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "107051506088243757108", "name": "Caleb Santa Cruz", "time": 1401216129679, "rating": 5.0, "text": "Very fun atmosphere! The boat was clean and comfortable. Our captain made it a very fun, safe trip and my family and I thoroughly enjoyed it. We will definitely be using A-Pair-A-Dice Charters again and I would recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "109903186994302467553", "name": "Jackie Thurnes", "time": 1563990184913, "rating": 5.0, "text": "Super friendly! Great advice on lunch, fishing and dolphin watching!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "105787092029259373948", "name": "Archie Little", "time": 1556222321200, "rating": 5.0, "text": "Great experience. Enjoyed the day. Nice friendly service.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "104407425253793224600", "name": "Shell Mitchell", "time": 1533148603129, "rating": 5.0, "text": "Amazing Operation! Highly Recommend.\n\nThey run a top notch operation, our boat was Amazing, clean, had a full restroom, lots of other extras and a Yamaha 150hp motor that had some get up and go, these boats are Amazing unlike other rental companies who we have rented from  in the past which had 60hp motors, which were loud and smoked on us the whole time.  We saw 20 + dolphins, were able to visit Pirates Cove and the Flora Bama Yacht club in the same day, such a fun filled day, we can't wait to do it again. We will only rent from Orange Beach Boat Rentals in the future, we highly recommend them. Thank you for truly making our day Amazing.\nThank you- The Mitchells", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "106519802089698495669", "name": "Brandon barenis", "time": 1496771875066, "rating": 5.0, "text": "Had a great time. The boat had very good equipment and was also very clean! There was also a bathroom on board which other rental boats we looked at didn't have.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "105853800751980711110", "name": "Kristy Beard", "time": 1519359853299, "rating": 5.0, "text": "This was our 2nd time renting from Orange Beach Boat Rentals, and it was once again a Great experience. We had such a perfect day on the water we saw lots of dolphins, went over to pirates cove, and we all got way to much sun ;)  We love their boats compared to others we have rented in the area. The restroom is super convenient, the xm radio is great, and loved the power of the 150 hp motor, and the boat rides super smooth. Once again they exceeded our expectations. They also have a great map which makes it easy to navigate. We can't say enough good things about this company, they are truly a pleasure to rent from. We can't wait to rent again and go back out on the beautiful bays of Orange Beach.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "116871293106049204326", "name": "Talk Time", "time": 1469762076930, "rating": 5.0, "text": "We were going to rent a boat, but opted for a private shrimping cruise after talking to April!  Our captain was Matt, and he was amazing!  He was a family man and very knowledgeable about the area as well as the marine life.  We got to see and touch stingrays, flounder, shrimp, catfish, squid, jelly fish, and other fish!  The dolphins swam up close to the boat and sprayed us several times!  The dolphin cruise boats followed our boat for dolphin sightings for about 5 minutes.  We also got to hang out at Pirate's Cove.  It was the highlight of our trip!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "111517579818557492258", "name": "Wendy GODWIN", "time": 1496271961985, "rating": 5.0, "text": "Best Rentals on the Island!\n\nNicest boats we have found and they had power (Yamaha 150hp)  We rented the boat on Memorial Day weekend and went over to Pirates Cove it's a awesome place to visit, then we went over to the islands and the kids played and swam, and we even saw dolphins while we were there. Then we went over to Tacky Jacks on the water, and just pulled in and got out and ate lunch, that was pretty cool.  They meet us on the boat at 9am (our scheduled time to arrive) did our orientation and gave us all the pointers we needed to find the dolphins and the better fishing spots too, and fitted the kids with life vest.  We rented a few rods from him, and he had everything already on the boat when we got there.  So just to sum it up, we went fishing, stopped by pirates cove, hung out at the islands for a couple hours, ate lunch at a waterfront restaurant, saw dolphins, and my kids even napped on the ride back to the marine. We had such a fun day and can't wait to do it again.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "106292412364219471442", "name": "Fabio Soller", "time": 1496303887725, "rating": 5.0, "text": "Awesome Day on the Bay!! We had one day to play while coming to mobile and we chose to rent this boat.. it's not a pontoon but more like a small catamaran  but we had a wonderful time the boat was amazing and it had a bathroom which is a huge plus, and a really nice stereo system..  We rented fishing rods and bait and fished all over the bay.  Everything was in perfect condition and captain Igor was awesome and made sure we had everything we needed . He gave us a map so we could stop and dock the boat and eat at some of the restaurants along the bay ... on our way back in the evening the dolphins were everywhere and they were jumping and playing . We kept our distance and didn't want to disturb them but they were so beautiful to watch ...if you make the trip to robinsons island it's about a 45 min ride and it's usually busy there but it's beautiful and a great swimming area, we had a fantastic day and highly recommend Orange Beach Boat Rentals to all our friends.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "108008225106401209703", "name": "Kacie Pipkins", "time": 1496010123632, "rating": 1.0, "text": "The boat was very nice. But just like another person said in the reviews if you rent from this company be prepared to pay the extra $75 dollars for prop damage. Me and my family has owned a boat for many years and simply hitting sand one time does not damage the prop. They paint fresh red paint on the bottom of the prop and if any lil bit of paint is gone they are gonna charge you. It's a complete rip off. And just like they did on the last persons review they are gonna come onder my review and try to defend there selves. We saw this review prior to renting from this company and didn't really think any thing of it. But like I said the boat was nice and Yes it has state of the art equipment on it but that still doesn't always prevent you from bumping some sand. So be prepared to pay the extra $75 or just don't stop at any island.", "pics": null, "resp": {"time": 1496838787070, "text": "We are very sorry about your additional cost due to running into the sand.\nThe reason the paint looks shiny and wet is because it’s an Epoxy paint - hardest paint known, which cures with shiny Amino blush film on top.\nMost of our customers do not have issues with bumping into the sand\nalso we only charge the prop fee if damage is medium to severe.\nWe are truly sorry,  Capt. Igor"}, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "100067172426083034271", "name": "Israel Pipkins", "time": 1496029597367, "rating": 1.0, "text": "I was satisfied with the trip up to the point I was informed I would owe an additional 75$ due to the fact I scratched some of the red paint,  that Orange Beach Boat Rentals, had hand painted on the skeg. Which is the fin below the propeller. This is painted solely for the purpose of seeing if this fin has touched sand. Keep in mind, this is hand paint that was painted on moments before rental. Which will come off just by operating this boat. I asked exactly what damage had been done to the prop, and I was told I had damaged the (Stuff) inside the the propeller.  When asked which part? Like, shaft, bearings, gears, or seals! He was confused and only could explain that if the paint was gone the lower unit was damaged! The boat was returned in perfect working condition. But I was still charged an additional 75$. I bought this mistake. There is no need for u to do so as well. Consider someone else for your rental needs or be prepared to pay an additional 75$ God Bless! And safe travels!\nIt is very unfair to assume everyone that rents from you is uneducated in the operation of a boats lower unit. You see I grease my own foot, change my own water pump, and props. I service my own Yamaha outboard. I understand you are used to dealing with those who do not do these things. That's why it's only fair for me to share this to help them out before they do business with you!", "pics": null, "resp": {"time": 1496837651541, "text": "We are very sorry about your additional cost due to running into the sand.\nYes we paint the lower part of the motor so we know if lower unit been digging thru the sand.\nYour statement that we painted it moments before the rental is false. The reason the paint looks shiny and wet is because it’s an Epoxy paint - hardest paint known, which cures with shiny Amino blush film on top.\nYes we brush it on by hand, because spray-paint is 4-5 times thinner. It does not come off at all unless you drag  4000 Lbs boat thru the sand. It’s a lot of wear and tear.\nPrior every departure, there is 15min orientation on video which clearly explain the operation around sandbars,\nthe GPS shallow water alarm and there is a special section informing you if you run into the sand there is a $75 charge. No hidden fees, everything is loud and clear upfront.\nI would like to believe, We have it almost foolproof, There is GPS which color-marks shallower waters less than  6 feet in blue color, Deep water is white color. You go less than 3 feet –alarm sounds.\nWhile cruising sandbars are bright yellow visible from a distance by untrained eye.\n\nWe specifically ask in the video to not beach the boat due to our shallow access. We ask to keep the boat floating in at least 2 feet of water with motor trimmed up.\nI am sorry my helper Stahl was not able properly explain the damage of the Propeller’s  hub.\n(Rubber and composite bushing between the transmission drive shaft and Prop it’s self)\nThis is a sacrificial part to protect $ 2,600 lower unit.  Can’t be seen by eye, it’s inside the prop.\nCost of this Power-tech hub is $ 69.00 plus $ 6.00 shipping, labor 45 min on my end – No charge.\nIf prop shop does it, cost is $ 280.00 .  Damage does not stop here, as the propeller work in the sand the blades loosing the cup. (ability to scoop water and go forward, start just slicing water, Rpm running high and boat does not go fast anymore). Replacement cost $ 630.00\nI am losing more than you  with your damage.\n\nYou present yourself as a motor educated person and trying to help out other people.\nWe thank you. We are honest and we go beyond, our boats are nicest on the island.\n\nCaptain Igor"}, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "118392928070936463169", "name": "Jennifer Hanger-Musson", "time": 1499013063253, "rating": 5.0, "text": "What a great experience.   Igor was awesome and explained everything perfectly!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "103186362846555461845", "name": "Carol Thrift", "time": 1494447720216, "rating": 5.0, "text": "What a fun day on the water. The boat was super nice, had a full restroom, nice stereo system, comfy cushions, it was by far the nicest rental we have ever rented. We went to Pirates Cove and had a bushwacker and a cheeseburger, drove around saw tons of dolphins, then went over to the island and collected seashells and played in the water. It was a pefect day, we will defiently be renting from them again, Highly recommend Orange Beach Boat Rentals!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "111476689596269172722", "name": "Loredana N", "time": 1528762023228, "rating": 1.0, "text": "booked a pontoon when showed up they  told me -its rented out they apologize but they  can give me newer one almost 200$ more then we have agreed . they acknowledge their mistake but wouldn't do anything to fix it .we were  very upset especially kids  ((((", "pics": null, "resp": {"time": 1528982264961, "text": "PLEASE DELETE THIS FALSE REVIEW!!!!  I'm Sorry, but you are mistaken, you have written this review under the wrong company, you may be speaking of OB Watersports, but we are Orange Beach Boat Rentals, we are at the Wharf Marina in Orange Beach, not Tacky Jacks area in which you are speaking of. You are not a customer of ours, or ever spent money with us.  We take payment at the time of booking, there is NO way for us to give your boat to someone else, because you have already paid for it.  Please kindly remove this false review from our company.  If your still in the area we would love the opportunity to serve your family, we promise to give you the Best Customer Service possible."}, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "115734303809125623925", "name": "Jim Paar", "time": 1378303222987, "rating": 5.0, "text": "Great pricing, super clean boats, and love the extra attention to details. Thank you!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "100060372746565717979", "name": "Alison Sturtz", "time": 1562879891289, "rating": 5.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "106433695436049969067", "name": "Brenda Highfield", "time": 1504150283257, "rating": 5.0, "text": "Great fun on the water clean boat", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "116775641050694950388", "name": "Orange Beach Boat Rentals", "time": 1377185776718, "rating": 5.0, "text": "Great specials for Orange Beach Boat Rentals this Fall #orangebeachboatrental", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "103591247482155363454", "name": "Sandra Macedo", "time": 1553256947472, "rating": 5.0, "text": "(Translated by Google) Good place\n\n(Original)\nBuen lugar", "pics": null, "resp": null, "gmap_id": "0x888918403ea36ee7:0x3d78747a6a44d399"}
