{"user_id": "110246854021099286090", "name": "Michelle Strinati", "time": 1625846721290, "rating": 5.0, "text": "Great camping fun and the cabins are great as well!  We love it every time we go. Great staff! Have been multiple times and it never disappoints. Plenty of fish in the ponds, the waterslide is great fun and we love the ability to rent the golf carts! Also, the military discount is an awesome plus!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPEhH5OwMuvdXtMVzEqolK1mJItzpNtuRoF7Y1R=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNUIOecMmFSLKYrcoVubcFH7oX9152DXONqRRMo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMkKyY7JMZRwnjL52DXOgX0G3Eo_JBJATirr3XS=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "109918444903482258895", "name": "Becky Rautenstrauch", "time": 1626384140668, "rating": 5.0, "text": "My husband, myself and friends had a wonderful time. What a fantastic get away. We loved everything about The Kick Back Ranch.  We could be busy, or just Kick Back . We will definitely put  this vacation spot at the top of our list as our Favorite. Definitely we  will all be back. Get yourself ready to be very pleased at the Kick Back Ranch.", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "112460582846837451019", "name": "Tammy Barnes", "time": 1627764254770, "rating": 5.0, "text": "This place is beautiful! The owner and staff were so very nice and helpful! A lot to do or just kickback and relax. We are already planning another trip very soon. Thanks to Mindi and all her staff for a great time.", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "100274501202212599170", "name": "Laura Coker", "time": 1623891705385, "rating": 5.0, "text": "Kick Back Ranch is very special to our family. We discovered this beautiful, family oriented Ranch last year. The first time we went, I knew we fell in love. The facility is beautiful and well kept. The owners and all staff were so helpful and kind. My kids love it so much they have their birthday parties at kick back. We enjoy the special events they host. It truly is an amazing family owned and loved hidden treasure. I highly recommend this place for too many reasons to list. We look forward to our time their.", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "107457191457249434103", "name": "Jerry Myer", "time": 1627260680379, "rating": 5.0, "text": "We had a blast. Slides were fun, pool was clean, the beach was neat and all the little cabins are as cozy as can be. Rent or bring your own golf cart. Cute little store with what  nots, DG and diner close by. There are full time residents there and owners/staff protect their privacy; understand this before you go. If your a respectable natured human being, this will NOT be an issue. Gym on site. Laundry, game room, basketball courts, playgrounds, canoes and paddle boats...all this will keep your kids busy for the weekend. Event center surrounded by cabins  and sidewalks. Looks like a neat venue to have family reunions, weddings or parties. Rv park does lack shade and a little close but the second park (under construction) may have better spacing. Too much to do to stay in the camper anyway. We will be back...our kids did not wanna leave.", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "101501502157383764764", "name": "Amanda Boswell", "time": 1624207985784, "rating": 5.0, "text": "Didn't realize such a great vacation spot was so close to home. Loved our stay and even better, the kids barely picked up their phones all wkend! I can't believe there is anyone crazy enough to leave a poor reviews of this place. Will definitely be going back.", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "111878671970067866249", "name": "Samantha Green", "time": 1622936700010, "rating": 1.0, "text": "The security guard ruined our entire trip. We had to wear wristbands the entire time. Felt like a prison camp more than a “vacation.” We ended our trip after just one night. We used to go all the time but things have changed. We will never be back and will tell everyone not to go.\n\nWe were called on our first night and was told not to drive the golf carts off the gravel for the first half of the day the next day since it rained. Okay, fair enough. So at about 11:45, we drove our cart off the gravel and onto a trail close to one of the first ponds in the place. It was about mid day. The ground was dry. We get our keys taken away while out on the water. We watched the security guard take them. We went to the office to complain and he called us liars saying the owner said the full day.\n\nWe had dogs there and where we were staying, there was a fence. We let the dogs out of the car and into the fence, and we got yelled at by the security guard because they were not on a leash. We asked why because they were in a closed fence? His response… ON A LEASH!!!! No explanation. A stray dog came up to us later that day and he came up red in the face screaming at us because she wasn’t on a leash. We explained that it wasn’t our dog and he didn’t care.\n\nThis is the most backwards place to stay. It feels more like a prison. Do not go here ever. You couldn’t pay me to stay here. The owners are letting this security guard play Jail House instead of watching for suspicious or dangerous situations. I think his name is Fred. Fred needs to be fired.", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "106415844050880916428", "name": "Johnny Tadlock", "time": 1620608941247, "rating": 2.0, "text": "Kick Back Ranch is a new campground with a nice water slide for kids and adults but unless you are a resident of Kick Back you will not get the best of sites to park on and will not have access to their public pool. They make you wear a colored wrist band while camping which identifies you as a part time camper. Hint don't wear the wrist band and you may be able to get into areas for full timers... Gravel RV spots were in full sun (no shade). We asked if we could get a shady spot when we made the reservations but were told those are for residents of the park. Spots 4-15 are so close together, your common area (normally right side of camper) was right next to your neighbors sewer/septic connection. You smell septic the whole time you are sitting outside. Very bad set-up. I hope they do something about this. Ponds are all over the property (huge property) but they are very dirty and not very fishing friendly. Too much growth around the edges when trying to fish off the bank. You will lose worms, lures, etc.", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "105069626856250277260", "name": "Reginald Fowler", "time": 1625762458865, "rating": 4.0, "text": "I just left a family  Reunion this past weekend at the Ranch and let me tell you I had a blast.The property  is well maintained  and everyone  is friendly  and helpful.  Its only  one thing  that bothers  me is that there is no stocked fish in the lakes. I live in Mobile and I fish alot.  I tried fishing  there and didn't  get one nibble. Other than the unstocked  lakes everything  else  was almost perfect.  Oh and I didn't get a golf cart due to so many rented out. Definitely  will recommend  this place.", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "117096329609816877834", "name": "Lindsay Beard", "time": 1623888654615, "rating": 5.0, "text": "LOVE this place and the owners are top notch! Great place for a little get away or a day of fun. They have several public events often and try not miss any!!!", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "101047449066601407316", "name": "Jessica Sherrill", "time": 1623896190057, "rating": 5.0, "text": "We love Kick Back Ranch. We have visited many times and it has been friendly, peaceful and inviting each time. We will be back for sure!", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "116192194160682956327", "name": "Kalonni Jackson", "time": 1622509244017, "rating": 1.0, "text": "Kickback Ranch is nice very nice but the staff are rude, prejudice, & just unprofessional. Fred was VERY RUDE & the supervisor backed him up with out a single apology. The Owners reached out just to have the same vibe....I pray things get better .", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "106293706276189635652", "name": "Lisa Neafus", "time": 1619976768346, "rating": 1.0, "text": "My husband, I and our service dog lived here for 8 months. In short, a couple moved in wanting our spot. They kept calling the owners on us with untruthful accusations. The wife kept talking to me one morning while I was trying to load my car for work. I asked her to please just leave me alone. She would not stop. I just kept loading my stuff and asked again to leave me alone. The next day I get a call from Mindy, the owner while at work and she let's in on me with several slanderous accusations. She tells me my dog must be removed from the property by that night and if we do not comply, she will call the sheriff. Not once did she ever discuss anything with me prior to this day. I tell you Mindy is the most unprofessional person I have ever met. Talk about accused, charged and found guilty without a trial. We never had words with anyone or were ever warned by the owners. I assure you, the ones who did what we were accused of is still there!!!! My husband did have a civil conversation two days before with the owner's husband and thought they had an understanding. ????I must take this moment to thank Mindy because I did not like her from the first time I met her. We LOVE our new home. We have LOTS of water pressure!!!! I mean my Dawn makes bubbles in the sink!!!! FREE WI-FI!!!!!!! Mindy advertises free wi-fi.  What a joke. We have a foot more room inside our motorcoach. The power was so low there we couldn't get them to slide completely out!! Every time I cooked there I flipped a breaker. We can use all my appliances at one time now!!!! We have grass and a picnic table. Clyde, our service dog, is welcome and has a huge field he can run in. The owners are so kind and welcoming. Our first night here in our new rv park  the owner said they close at six but come on back, he'd be drinking a beer on the front porch and so we joined him!!! The good lord has blessed us with some great friends from Kick Back and I hope we never lose touch. Thank those who loved and accepted us and Clyde. We will never forget your blessings on us.\n\nI failed to mention the owner, Mindy showed up on our lot as soon as my husband got home from work (the same day i received a call at work from Mindy with her accusations)with the park manager and the security  guard carrying an assault rifle!!!!! Really???!  OMG!! We basically kept to ourselves but welcomed anyone that stopped by. We never were even talked to before this day!!!! Just can't wrap my head around such cruel and ridiculous tactics from Mindy.", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "110713220303133718480", "name": "Julia Taylor", "time": 1622592353296, "rating": 2.0, "text": "My kids love the water slide but the owners an security guard is awful\nI would love to visit again only with new owners.they are not friendly people.the ones in the office were very nice and i hate the lil kids couldn't get in the poil", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "110541864849429396225", "name": "Gary Garvin", "time": 1624059891544, "rating": 5.0, "text": "Great place for me! Love the place and the space", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "109049346851690603817", "name": "Dianne Catrett", "time": 1604949070717, "rating": 5.0, "text": "We spent the night, had dinner and saw the Elvis impersonator and band. The next day we saw Gospel show.  Where has this place been? Kid and pet friendly. We're coming back Wednesday with grandkids. Perfect relaxing venue. Staff were exceptional. Beds are great. So quiet. Couldn't find anything I didn't like.", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "114129100884737983612", "name": "Jemesha Reed", "time": 1624817156422, "rating": 1.0, "text": "They are low key Prejudice … hassle you about little things was told we couldn’t get in the pool because long term residents didn’t feel save for outsiders to get in the pool .. but we were residents we rented out our cabin just like anyone else .. the staff is also very rude this is my family  first & last time coming to this place never again we spend over $700 bucks in was treated like everything but human beings", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "112138624009274185299", "name": "Tara Smith", "time": 1600057781258, "rating": 5.0, "text": "Great place to relax and get away. The staff is very friendly and awesome.", "pics": null, "resp": {"time": 1600094481057, "text": "Thank you Tara! We hope to have you back at the Ranch soon!"}, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "101515958704774415333", "name": "Susan Graydon", "time": 1575054425791, "rating": 5.0, "text": "We had a fabulous family experience.  The kids and adults played and fished.  The facilities are great and the staff is wonderful. A great combination.  We will definitely be back.", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "113621258545090813054", "name": "Hayes Dunne", "time": 1608037552835, "rating": 1.0, "text": "If a motel 8 , and a trailer park were combined. This is what it would be like", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "105941843559177174566", "name": "Paige Sullivan", "time": 1623888860302, "rating": 5.0, "text": "This place is a GEM!", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "107278218528966043210", "name": "Debbie Boothe", "time": 1563018102203, "rating": 5.0, "text": "Its just beautiful I love it the staff the food is wonderful too! Lots and lots to do very clean", "pics": null, "resp": {"time": 1564421926183, "text": "Thank you Debbie! We are so glad you enjoyed your experience with us! We hope to have back out at Kick Back soon."}, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "112657612879539962543", "name": "Kathy Kerley", "time": 1542986055694, "rating": 5.0, "text": "Granddaughter had a wonderful 13th birthday at Kickback. The facilities are excellent and the setting is absolutely beautiful. Cabins, cottages, camping RV facilities, exercise room, pool, VB, BB, hiking, fishing, waterslide, game room, fishing . . . and more. Price is reasonable and staff go above and beyond to accommodate their guests. Easy access off 331, and the facility is gated. You won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "114638029983258987862", "name": "EmmaG “Reptile lover” LaRoche", "time": 1553980123918, "rating": 3.0, "text": "This place is okay but it's not okay to me..they got pretty good stuff there again it's okay.", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "106474309479639462863", "name": "Carey Moseley", "time": 1568559983987, "rating": 5.0, "text": "Excellent place to relax. Everything is 1st class.", "pics": null, "resp": {"time": 1568668226098, "text": "Thank you Carey! WE hope to have you back!"}, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "105583436063366319681", "name": "Allyson Venable", "time": 1554942969500, "rating": 5.0, "text": "Good place to host events and party's.  Great staff to work with.", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "106819572263241428377", "name": "loosecabe Biggers", "time": 1553011951288, "rating": 5.0, "text": "OMG what an awesome place! We have fell in love with the place the people! You just gotta come!!", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "118245015781805133776", "name": "AuburnEverything JH", "time": 1605490307788, "rating": 2.0, "text": "It's not exactly the Ritz . 😕", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "112260516786962945034", "name": "andrea smith", "time": 1587254776764, "rating": 5.0, "text": "Awesome people.", "pics": null, "resp": {"time": 1589811970984, "text": "Thank you Andrea! We hope to have you back at the Ranch soon!"}, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "118051830061796961119", "name": "William Wheat", "time": 1576936928948, "rating": 5.0, "text": "Very nice venue", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "105837010085431700454", "name": "Michelle Williams", "time": 1557627348767, "rating": 5.0, "text": "Beautiful place!", "pics": null, "resp": {"time": 1564421943514, "text": "Thank you Michelle for the kind words!"}, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "116273569489499690070", "name": "Teresa Brewer", "time": 1556203804157, "rating": 5.0, "text": "Super nice", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "106300061283687410643", "name": "Jerry Todd", "time": 1578771328573, "rating": 5.0, "text": "Amazing", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "103194399461988661776", "name": "Jerry “Big Jerry” Taylor", "time": 1555384012561, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x888e7793b963da5d:0x3f94953604ba91fa"}
{"user_id": "104584932290325852920", "name": "Jonathan H", "time": 1625519222719, "rating": 5.0, "text": "We contracted Rob and his crew to remove over 50 trees from our property. We had talked to several companies but only Rob had the equipment needed to remove the trees, remove the stumps, and then level and grade the ground so it was ready for sod. They were able to do it all instead of hiring 3 different companies. That saved us a lot of money and the work was performed flawlessly. They transformed by backyard from an unusable jungle to a clean blank slate ready for sod. We love our backyard now thanks to Rob and his Crew!!!", "pics": null, "resp": {"time": 1625519708584, "text": "Thank you so much for the kind words. We were glad to be a one stop job to remove those 60 or so trees. We are looking forward to see how that grass you chose performs. Hopefully it can be a new favorite for us to recommend to future clients. Thanks again for your business!"}, "gmap_id": "0x88926c47110a9969:0x93628044b66dc7ba"}
{"user_id": "103186108896050948403", "name": "Josh Casey", "time": 1610479926985, "rating": 5.0, "text": "I needed some land cleared for a building and they came out on new years day and got to work. They cleared out several trees and leveled up my lot for the building and finished the job in two days. I was very pleased with the work they did. I would definitely recommend them and use them again in the future.", "pics": null, "resp": {"time": 1610480732829, "text": "Thanks for the Awesome review Josh! Looking forward to seeing the project after it is all complete with the new building!"}, "gmap_id": "0x88926c47110a9969:0x93628044b66dc7ba"}
{"user_id": "117594445856335924892", "name": "Vanessa Howell", "time": 1612317424107, "rating": 5.0, "text": "I highly recommend! The guys were super professional,  did excellent work, and stayed on budget.", "pics": null, "resp": {"time": 1625519547804, "text": "Thank you so much for the review! We enjoyed watching the transformation. Can’t wait to see the new house!"}, "gmap_id": "0x88926c47110a9969:0x93628044b66dc7ba"}
{"user_id": "104473188683446021196", "name": "Amy B", "time": 1610990051308, "rating": 5.0, "text": "Rob and his crew did an amazing job on our pond and clearing the surrounding banks from years of overgrowth. We could not be more pleased with the outcome!", "pics": null, "resp": {"time": 1610991198085, "text": "Thank you for the review! We enjoyed the job and what an amazing difference! Let us know when you are ready to start the next phase and we will be happy to help. Thank you again for your business."}, "gmap_id": "0x88926c47110a9969:0x93628044b66dc7ba"}
{"user_id": "110170689381748043942", "name": "Jabe Fincher", "time": 1623536326147, "rating": 5.0, "text": "This is a nice lake to fish in. I have caught some good bass here.", "pics": null, "resp": null, "gmap_id": "0x889265d56ed115f7:0x38e211ea2bb207cb"}
{"user_id": "102624021948467738396", "name": "Craig Cron", "time": 1581526884417, "rating": 5.0, "text": "Nice little lake to fish", "pics": null, "resp": null, "gmap_id": "0x889265d56ed115f7:0x38e211ea2bb207cb"}
