{"user_id": "101140812035494763550", "name": "Deanna G", "time": 1617157515567, "rating": 5.0, "text": "I was so impressed by this company today! I placed my order at 12:30 yesterday afternoon and had it delivered by FedEx at 10:30 this morning! That has to be the fastest service I've ever had! I will definitely be a repeat customer! Thank you so much!", "pics": null, "resp": {"time": 1620998729475, "text": "Deanna, thank you for taking the time to leave us a review.  it means a lot to us, and we look forward to working with you more."}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "109377013665480034968", "name": "Matt Chapman", "time": 1556050490866, "rating": 5.0, "text": "This is the one and only business that I purchase my supplies from. They always have everything I’m in need of and at great prices! I purchase materials strictly for candle making and the selection and quality of the wax and fragrances are top notch. The owners are beyond friendly and knowledgeable about all products offered. Any question that I have they are sure to explain it fully to me and they don’t make it seem like you are bothering them if you have a lot of questions to ask. I’m local to the area, so I’m proud to support this local business! If you are in need for any materials for your candle and soap making, look no further!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP6b4GimOFcaEUVih4NfNVLcxSeKCrswT1VLiRU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNtS5FrRZyqVf2CfSvcB11VFv0YM4xm8sYF2CpP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOC8jYUpPqszZFY7AExllQTOjqMWD1q9tgLI8oe=w150-h150-k-no-p"]}], "resp": {"time": 1556196015368, "text": "Matt, thank you so much for your kind review.  We appreciate  your business!"}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "115153856316249707997", "name": "mp3 jay", "time": 1618717663464, "rating": 5.0, "text": "I was referred to Community Candle by someone in a candle group on Facebook. I’m so happy with my fragrance oil and the fast shipping. I am a new forever customer.", "pics": null, "resp": {"time": 1620998658085, "text": "Thank you so much for your kind words.  We look forward to working with you."}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "113662526601051697731", "name": "Teneha Tate", "time": 1605116581314, "rating": 5.0, "text": "Whenever I go to Community Candle and Soap Supply I always have the greatest customer service experience ever!!! I love their fragrance oils and candle vessels. Always helpful!!! Top notch service.", "pics": null, "resp": {"time": 1616504866790, "text": "Thank you so much! It means a lot to us that you took the time to leave a review."}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "114141533822559243899", "name": "E B", "time": 1604942214829, "rating": 1.0, "text": "My shop had a horrible experience with this company. The lids we received were dented and covered in paint. The owner told us to use our fingernails to try to scrape the paint off. They’d still be dented and unusable at our store. Some of the jars were cracked and one was shattered. The jars were also not as described (not straight sided, smaller than the dimensions given, etc). We disputed it with PayPal after no response to our calls. They’ve also ignored our last message. We waited a few weeks to try to mediate this and come to a better solution but after being ripped off and left with damaged product, I’m here leaving this review. This is the first negative one I’ve ever left, but I want others to be aware of their business practices. Please consider buying from another company if you’re wanting anything fragile. They do not offer refunds or exchanges, even if the fault lays with them.", "pics": null, "resp": null, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "109976059235339410398", "name": "Leslie Hahn", "time": 1567474164938, "rating": 5.0, "text": "I have had nothing but wonderful experiences every time I have been here. The owners are knowledgeable, helpful, and friendly. The level of customer service here is top notch. I love that we have a local company that we can get our supplies from. They are never to busy to answer questions or offer much needed advice. They really try to help you and make sure that you get the best deal  on products. It is always a pleasure to go and get our supplies. I can honestly say that I have never had a complaint, even when I have forgotten something on my order, they do their best to added it in quickly for me with no extra wait time. This is just an all around wonderful company!!", "pics": null, "resp": {"time": 1571171234025, "text": "Thank you so much for your kind review, Leslie. We appreciate your business!"}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "100137461501288116826", "name": "Kyle Dunkling", "time": 1600870441213, "rating": 5.0, "text": "Awesome staff and processing time!!! We really appreciate all the hard work you guys do.", "pics": null, "resp": {"time": 1620998804642, "text": "Thanks, Kyle. We are very fortunate to have fantastic customers who are so easy to work with!"}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "104131374982447759603", "name": "Jenifer Davis", "time": 1596291121921, "rating": 5.0, "text": "I ordered last week and it was shipped the same day! I'm super impressed with the shipping and the products were perfect!", "pics": null, "resp": {"time": 1620998844256, "text": "Jennifer, thank you for taking the time to leave us a review.  We are happy we got it right for you."}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "115756498671696987468", "name": "Sister Christonypmhi", "time": 1537025068076, "rating": 5.0, "text": "A great group of people.  I have been ordering soap supplies out of state and got tired of shipping fees.  After researching on the internet I found Community Candles.  They are a short drive from me.  No more shipping fees....!  I picked up my order the next day.  Well worth the two hour drive on a pretty day.  Everyone was knowledgeable and friendly.   I couldn't ask for more.", "pics": null, "resp": {"time": 1556196542913, "text": "Sister we love seeing your smiling face when you come visit.  Thank you for your 5 star review.  We really appreciate it."}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "101443255804278884139", "name": "d b", "time": 1533416929560, "rating": 5.0, "text": "My wife and I use Community Candle Supply products for most everything we make in-house at our pharmacy. We make soaps, mists, and bath bombs and they have been so kind to us from day one. We are grateful to have found them and love that we are supporting another family's small business. They are the best!", "pics": null, "resp": {"time": 1556196799396, "text": "Thanks for the 5 star review!  We have enjoyed seeing you succeed with all the products you make.  I am excited that we are able to supply you with some of your needs to grow your business."}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "105858189809879193324", "name": "Betsy Whitfield", "time": 1590942624665, "rating": 5.0, "text": "Great place to get candle supplies, get help when I have a question", "pics": null, "resp": {"time": 1620998918316, "text": "Thank you, Betsy, for the review.  We feel like you and Pete are family.  :)"}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "102589874173046189269", "name": "Colby Iaconnetti", "time": 1604941788390, "rating": 1.0, "text": "Buyers beware! very poor customer service! We received broken products, owners wouldn’t respond to most of our emails, they refused to refund or fix the problem...", "pics": null, "resp": {"time": 1604947371086, "text": "Well, I know this is actually Chelsea S. Chelsea you know we offered to replace the lids that you say were damaged and we also offered to allow you to return the jars and lids for a refund. You elected not to do that because we do not pay for return shipping as outlined on our “About Us” page. We are sorry you feel the need to leave such misleading reviews under different names on our business, but we did make every effort to remedy this issue, and our customers know that we do not treat people the way you describe. I wish you all the best in finding a supplier you can be happy with."}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "108963694531322967158", "name": "Brandon Morgan", "time": 1555944039017, "rating": 5.0, "text": "I own Morgan Valley Candles and I LOVE that Community Candle is here in the Birmingham area. They are so helpful and really know their candle biz. I am a growing small business and I believe in doing as much small business to small business as I can. If you need any type of candle, soap, lotion or other type of supply, this is the place you need to go.", "pics": null, "resp": {"time": 1556196058067, "text": "Brandon thanks for taking the time to leave a review of our business.  We really appreciate your support and your business.  Hope all is well!"}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "113463154599164336736", "name": "Kimberly Ford", "time": 1536065258222, "rating": 5.0, "text": "Love this local company! It’s more than a candle supply store,  Always stocked with everything I need to make soaps, bath bombs, lotion and all my other bath products I sell! The staff is always helpful and has a smile on their face come check community candle supply out!", "pics": null, "resp": {"time": 1556196651454, "text": "Hey Kim!  Thanks for leaving us a review.  I am so happy we are able to provide you with most of what you need for your business.  I love knowing that the goods we sell help create small businesses!"}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "102915247225102293192", "name": "shawnie hale", "time": 1547705393501, "rating": 5.0, "text": "Omg!!!! Love this business to the fullest,I have had nothing but the best of service from this group of people, very friendly, very helpful whenever I ask a question about something I'm giving a straight forward answer. I'm way over an hour drive away but I think their products are very much well worth the drive vs ordering from somewhere that you cannot get your product the same day and then having to pay all those shipping fees nope not me and as long as I'm making candles or anything else I will continue to use CCSS.", "pics": null, "resp": {"time": 1556196278191, "text": "Shawnie thanks for the 5 star review.   Our customers are truly what makes this \"Community\" Candle Supply.  <3"}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "117596961003307207768", "name": "electriqss", "time": 1538703146456, "rating": 5.0, "text": "I just want to say I love watching the video over and over again of those ladies driving their car into that pit, looking for \"Candle Supplies\"!!!", "pics": null, "resp": {"time": 1556196452445, "text": "Hi LeAnne.  Glad you enjoy that video, but those poor ladies had quite a lot of damage to their car.  I was so grateful that they won the AFV prize.  Let us know if we can ever help you with candle or soap supplies now that you know about us."}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "106477672383767899345", "name": "A M", "time": 1517871561323, "rating": 5.0, "text": "First time visiting the location today...was highly recommended by a friend....was not disappointed at all...great scents....great prices....and SUPER friendly staff!!!", "pics": null, "resp": {"time": 1518019724097, "text": "Thanks for your kind review, April.  I am glad you were pleased and we hope to see you again soon."}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "103117621410232090060", "name": "Crystal Dawn", "time": 1549148869765, "rating": 5.0, "text": "Overall a great place to get supplies for my soap making.", "pics": null, "resp": {"time": 1556196122413, "text": "Cystal thanks for taking the time to leave us a review.  I know there are probably a million things you could be doing with your time, so I really appreciate it!"}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "108465225755235837353", "name": "claude jones", "time": 1529587836205, "rating": 5.0, "text": "I love all the many fragrances as well as the help I get in making choices .\nThank you guys.", "pics": null, "resp": {"time": 1556196922930, "text": "Our pleasure! I love selecting and buying all of those fragrances as well.  It's one of my favorite things to do here.  We have lots of new fragrances so be sure to check out the \"New Fragrance\" category.  Thanks for your business and your 5 star review."}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "117380674154655920591", "name": "Katie S.", "time": 1504356490797, "rating": 5.0, "text": "I've made quite a few orders from CCS. They have a wide selection of materials and have been very friendly and helpful when I pick up my orders. I highly recommend getting your candle, soap, kitchen, etc. supplies here!!", "pics": null, "resp": {"time": 1510764610322, "text": "Thanks so much for your review, Katie! We appreciate your business."}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "107867886075193944642", "name": "Gail Davis", "time": 1518023506799, "rating": 1.0, "text": "Was one of the worst today one of the owners instead of wanting to talk to us or let the young lady up front help us they said to use the computer out front no one was in the store I'm old fashion I like to talk face to face they lost out on another additional sell today also I have had one of the owners look at me and tell me I was not expecting you.\nWent by to talk about the problem instead of fixing the problem they just wanted me to redo the review. The owner Robert just wanted to argue instead of trying to fix a problem .  They said until you fix the review not to order anything else . Will Not Recommend this place to anyone.", "pics": null, "resp": {"time": 1510851309855, "text": "Hi Gail (Ellen). Thank you for your feedback.  I am sorry you were disappointed in us yesterday.\n\nEvery customer is important to us, and we do our best to serve everyone whether we are busy or not.  As most supply warehouses do these days , we are encouraging our customers to use the web site whenever possible.   This helps us keep errors and miscommunication to a minimum and it keeps our expenses down so we can maintain low prices.  It also helps us so that we can work on other behind-the-scenes tasks or web orders that are already being processed."}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "113483955652409493858", "name": "kelli grossmyer", "time": 1538703975115, "rating": 5.0, "text": "The video of the women really is the best.", "pics": null, "resp": {"time": 1556196371233, "text": ":)  Those poor ladies.  Kelli, check us out if we can ever help you with candle or soap making supplies."}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "105248411115758820937", "name": "Rosa Pavlak", "time": 1481590644333, "rating": 1.0, "text": "My granny was trying to find this store but ended up driving her car into a loading dock. 1/5", "pics": null, "resp": {"time": 1495216438127, "text": "We have never done business with Jorji or his granny.  Perhaps one day they will allow us to earn their 5-star rating."}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "106619243429496869576", "name": "Wendy Brasher", "time": 1490639423962, "rating": 5.0, "text": "Great supply store and great people", "pics": null, "resp": {"time": 1495216221956, "text": "Thanks so much for the review, Wendy!"}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "111749564187814221614", "name": "Earl Davis", "time": 1519186130715, "rating": 1.0, "text": "will not do business with this company again the owners are very rude and lies about if they have done business with a person         oh but we have done business and I have talked to a lot of people that is upset with yall  I think maybe I need to send a review to the BBB", "pics": null, "resp": {"time": 1519149229744, "text": "According to our very detailed sales records, we have never done business with an Earl Davis."}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
{"user_id": "111246600909980116112", "name": "Amanda Thomas", "time": 1548953306332, "rating": 5.0, "text": "Love this place!", "pics": null, "resp": {"time": 1556196160283, "text": "Amanda thank you for the feedback!  We will try to keep earning your 5 stars!"}, "gmap_id": "0x88891ede3ecc47dd:0xd8e3608991c67255"}
