{"user_id": "116429372261267771140", "name": "AMERICA CHANGING", "time": 1623517793175, "rating": 5.0, "text": "This company has always been a go to for cleaning needs  residential,  and commercial. Best prices for this area by far.\n\nThe employees care about and take pride in their craft. The skill set and dedication they use on every job compares to none. God bless !\n\nManagement will always work with customers on just about any job that they need completed, even on short notice.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "117442105613568298197", "name": "Avery Berry", "time": 1624052497756, "rating": 5.0, "text": "Tim and his team are quick, responsive, and very professional. The cleaning of our Persian rug was affordable and the end result exceeded our expectations! Give Color Clean a call!!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "111286944870289120139", "name": "Harsh Deep", "time": 1605195227840, "rating": 5.0, "text": "Tim and his team did wonderful job.  I heard a  \"oh wow\" from my wife and the carpet looked new. I would highly recommend them to anyone. they show up on time do a great job and Tim calls a few days later and makes sure you were happy. that is high quality professionalism.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "101632670236800593092", "name": "heather ross", "time": 1599673002374, "rating": 5.0, "text": "These guys did an AMAZING job! They lifted what furniture they could and got underneath. Very thorough! Other places I have used have not done that. I have a puppy who has had many accidents and it already smells better. I also had a few stains that are completely gone now. They were very friendly and professional. I will 100% use them again. The price was great too. Very satisfied with everything regarding the service and the outcome.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "106936848834138953552", "name": "BeverlyRollins Tyus", "time": 1599002292274, "rating": 5.0, "text": "Excellent the worker did a miracle with my father bed room. Sometimes my dad have accident on his carpet.  I really was ashamed to let someone clean my dad carpet,but I didn't have a choice.\nThanks again for doing a. Excellent job again on my carpet in my dad room. Please if anyone looking for someone to clean there carpet . This is a carpet cleaner company who is Excellent.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "112386203193160859168", "name": "Tom Nazzal", "time": 1601413115870, "rating": 5.0, "text": "Thank you guys so much it’s very good job the carpet bank brand new I love this Company", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "101829201486310805532", "name": "Ronnie's Toy", "time": 1629912801356, "rating": 4.0, "text": "Was pleased with job", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "115814401402878176057", "name": "Elizabeth Tripp", "time": 1594661000984, "rating": 5.0, "text": "Tim was professional and he & his team did a great job on our carpets. We appreciated that there were no \"hidden gimmicks\". We would highly recommend this company.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "107213755420667044962", "name": "Margaret Huggins", "time": 1580506965692, "rating": 5.0, "text": "I couldn’t be more pleased with the amazing results on my travertine floors! They cleaned the grout and went the extra mile. The floors look brand new! Highly recommend", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "103442510115057575136", "name": "Will Walker", "time": 1513772140129, "rating": 5.0, "text": "Tim and his team did a tremendous job for us ...cleaning 5 yrs of grime off a kitchen tile floor.  The guys who did the work were professional, courteous, and efficient...please pass my thanks along to them. Thanks so much for a great experience.  I’ll recommend Colorclean to friends who need your services.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "108028177057941063913", "name": "Kelly Hipp", "time": 1524328209199, "rating": 5.0, "text": "I’ve been using Tim and his team for years and would never use anyone else! Last week they cleaned my brick floors and it looks incredible!! The guys are professional, friendly, and do the most amazing work! They can clean anything and make it look better than new. Thank you Colorclean for another amazing job!!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "100185915162051668825", "name": "Susan Curvin", "time": 1490486367072, "rating": 5.0, "text": "These guys cleaned two area rugs that my cat had \"marked\" as hers.... No more smell and the rugs look great! Highly recommend these professionals. Thank you so much!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "107696391325802110195", "name": "Jeremy Flatt", "time": 1331190117894, "rating": 5.0, "text": "Cleaned my MATTRESS!  We had so kids mattress's that had through years of potty training and needed some DEEP Cleaning.  I was thoroughly impressed that all stains were remove and it seems cleaners then when we first bought them!   GREAT Job! Highly Recommended!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "110429488499564898034", "name": "Angela Pritchett", "time": 1444323449721, "rating": 5.0, "text": "My area rug had a strong odor and I called a carpet cleaner to come clean it.  I was told  that the strong smell was just the wool itself. I had it cleaned anyway but the strong odor continued.   This time I called Colorclean and I can not believe they got the strong smell out of my rug.  I would recommend Colorclean to  anyone!!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "102405756617049813206", "name": "Maggie Williams", "time": 1481906647803, "rating": 5.0, "text": "I love color clean.. The team cleaned up to 5 of my rooms and they had done a wonderful spotless job.... Thanks guys", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "104915578567577841431", "name": "steven wyatt", "time": 1599072438972, "rating": 5.0, "text": "Best service ever carpet was bad made it look new again would recommend an will have come back for more", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "117335776038636322912", "name": "Yoga Gem LLC", "time": 1515769136906, "rating": 5.0, "text": "Wow!  What a difference this service can make to the look of your place.  The carpet was so stained I really did not think it could be saved.  Colorclean worked their magic and in a couple of hours the carpet looked great.  Reasonable price, and they showed up when they said they would.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "113784790187107991278", "name": "Russell Taylor", "time": 1346259459433, "rating": 5.0, "text": "Truly awesome. No words to express my pleasure, when I walk on my shiny new cleaned carpet. It is soo soft and smells sweet. I know what am I bringing you to clean next- all my mattresses. Can't imagine what will be the feeling when I lay on them.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "107502667799377724763", "name": "Rendell Smith", "time": 1497541672795, "rating": 5.0, "text": "Family owned with lots of experience and trustworthiness. Tim and his son did an awesome job, can't beat the price! I would recxomend to ANYONE and will definitely consult his business in the future! Thanks guys!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "110133068636524106091", "name": "Janine Roeder", "time": 1358842610850, "rating": 5.0, "text": "I would definitely recommend this company to anyone who needs carpet cleaning services. They came they did their job and my house looks great!! Thanks again for the awesome job!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "109399571462069407613", "name": "Jack Osgoode", "time": 1472741324218, "rating": 5.0, "text": "Tim cleaned my 2003 Ford F-150 super cab  he did the seats and wow! Looks and smells great now extremely pleased. Tim was very professional and took me in so fast really surprising.Look forward to another visit soon before I sell it.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "101772151225026697576", "name": "Randy Jones", "time": 1331236183540, "rating": 5.0, "text": "Excellent experience. The techs were friendly and did a wonderful job. They are the only floor care company for me.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "110872642443757453630", "name": "Stephen Forte", "time": 1331045106571, "rating": 5.0, "text": "ColorClean cleaned our carpet at our office and was prompt and on time. They even gave us a bottle of carpet cleaner in case we have any incidents. Very professional and knowledgeable of everything carpet.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "112919958669817687550", "name": "Larissa Evernet", "time": 1514327466700, "rating": 5.0, "text": "Colorclean Complete Floor Care did an excellent job cleaning our carpet and especially the stairs. I highly recommend this cleaning company.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "111968071114027137699", "name": "Megan Tucker", "time": 1492770976983, "rating": 5.0, "text": "Thank you Colorclean for the 5 star service! My four carpets are looking fantastic and it's all because of you!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "113951701904935207987", "name": "John Havard", "time": 1513886557870, "rating": 5.0, "text": "These folks did a great job cleaning our carpet. Fast, thorough, and priced well.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "112324043148064106505", "name": "Patrick Davidson", "time": 1347016945888, "rating": 5.0, "text": "God bless you and your employees. Best rug cleaners I've seen in years.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "117297619160754220204", "name": "Brian Johnson", "time": 1469132112940, "rating": 5.0, "text": "Tim and his team were provided excellent, quick service.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "108169735602713845549", "name": "Andrew L. Cogburn", "time": 1498767885423, "rating": 5.0, "text": "Colorclean are doing the carpet cleaning at my house for over an year. They are professional, dependable, more than affordable and I definitely recommend their services to anyone who needs clean carpets at home!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "111791057317532065598", "name": "Chris Brunson", "time": 1458662498550, "rating": 5.0, "text": "Had my whole house cleaned and King Matress Cleaned as well. Very Professional and Highly Recommend", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "113268841348329204958", "name": "Evelyn Cotton", "time": 1518478203862, "rating": 5.0, "text": "Since we use Colorclean Complete Floor Care we have no problems with the dirt and stains on our carpets and upholstery. They turned out to be very professional crew. Thanks a lot!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "110565960869331847070", "name": "Frances Griffin", "time": 1591871324997, "rating": 4.0, "text": "They have reasonable prices", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "116199467977539803996", "name": "Daniel Hadden", "time": 1496330192409, "rating": 5.0, "text": "Good work", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "108239992083094603721", "name": "gift mwanyalo", "time": 1571351798241, "rating": 5.0, "text": "Prompt response", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "105628026063125652002", "name": "Bahia Saxon", "time": 1629579098251, "rating": 5.0, "text": "this was a top notch experience. I was so impressed about how easy and seamless this process was. Not only are the professionals at Homewood Carpet & Flooring super helpful and friendly but the final installation was pristine. We couldn't be happier with our result and they were very cost efficient. I will absolutely be using these guys for any flooring project in the future. If I could give more than five stars I would! :-)", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "105452077554670514724", "name": "Susan Upton", "time": 1629403066529, "rating": 5.0, "text": "Had an incredible experience using this company. They got everything in when they said they would and were very easy to communicate with. Finished look was 10x better than I imagined! Highly recommend", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "118186634923858061571", "name": "Sarah Donnell", "time": 1630092365201, "rating": 5.0, "text": "Paul was great to work with! Really knows his stuff. The instal only took a little over an hour and they were super friendly and efficient! We are so happy with our new carpet. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "115241771041549968552", "name": "Mary Dutta", "time": 1629746634664, "rating": 5.0, "text": "Ww had an excellent experience with this company. Paul was very responsive and clear up front about the process. Buck and his crew were prompt, pleasant, and did a beautiful job. The price was reasonable and the results outstanding. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "113011621824311531721", "name": "Lora Gaxiola", "time": 1616420374675, "rating": 5.0, "text": "Paul was responsive and easy to work with. He presented several options to fit our budget. The work was done promptly, neatly, and efficiently and we're so happy with the results!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNPlICy5D3CApDrSyJemEd2v3NPAFwBYcuyi7r2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNNpQNtJbxuoWHHE_OnznFNg7KkGwZYIhpp-epO=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "118162646328130450948", "name": "Sarah LeCroy", "time": 1593821432159, "rating": 5.0, "text": "So happy with my floors. I chose to go with a darker grey flooring that is scratch proof and waterproof. I have a black lab, so these floors will be so much better than the dingy carpet I had. Paul was very prompt and even came to my condo to show me samples. I never even had to go in the store, everyone came to me! I called Homewood carpet and flooring, and the same afternoon I ordered my floors. Buk and his helpers were on time and did a fantastic job. They cleaned up very well after laying the floors and were respectful of my furniture and belongings. I live in a 750~ sq ft. Condo, approximately 3/4 of the condo flooring was being redone, and took 10 hours from start to finish. I would highly recommend Homewood Carpet and Flooring. You can’t beat the quality of floors, the timeliness and the accountability they give you for their price. Thank you!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPBsxypdIcavR9-1JfdMe3KKB1LrIDo6Zi6rkkW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNxL-R-fqpKVFjMJRphbCqv1mAge5ZGHY4LmI6P=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMfuvx1mlkkPMUNlcAmDm0UiMpUe0F5gGWN1ggJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOOYPx9NSY3OWSv0TykkxSAXplbKgU-x6cNRVaP=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "114618076015317725078", "name": "Elizabeth Adams", "time": 1625785222657, "rating": 5.0, "text": "Very responsive and helpful! Helped us out in a pinch when our first carpet installer backed out just a few weeks before the project date. Directed me to a carpet that was in stock (and what I wanted) so that the project could move forward on the timeline our business needed. At the install, they discovered an unexpected floor issue which required us to make a last minute change and he handled that and found an available carpet for us. Went above and beyond to make sure our timeline was met! Super nice guys did the install. Great attitudes and a pleasure to work with.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "102550943489522229247", "name": "Naomi Smitherman", "time": 1622842703498, "rating": 5.0, "text": "I was pleased with the whole process.  I needed carpet stretched.  I got a fair quote for the work and it was completed sooner than expected.\nThe two men who stretched the carpet were prompt, courteous, quick workers and they did a great job.  My floors look so much better.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "118259884880483695119", "name": "Melanie Clark", "time": 1617645545607, "rating": 5.0, "text": "Foo did an amazing job with helping me pick out quality flooring for two basement rooms. He gave a great price and was quick with getting me scheduled. The communication was great through the whole process. He was easy to work with. His team was efficient and very pleasant to deal with. I would definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "113474695457460213822", "name": "Cody Hirsberg", "time": 1621631846764, "rating": 5.0, "text": "We decided to use Homewood Carpet & Flooring based on the referral of a trusted builder. Tyler was excellent to work with regarding sales and selection. He came by the house for measurements and then met us at the showroom to review his recommendations and to make a flooring selection. Foo then organized the install and, because we were in a bind with guests arriving in a few days, was able to install the carpet a day sooner than expected.  Overall, Homewood Carpet and Flooring exceeded expectations which is why they earned this 5-star review.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "103023993376649810129", "name": "Ann Langley", "time": 1617841699433, "rating": 4.0, "text": "Paul was extremely helpful and responsive throughout our decision making and installation process.   The installation crew was courteous and very hardworking.  Everything was cleaned up and put back in place when they finished.  I have already referred this company to several friends!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "116080352438061654217", "name": "Alexandra Baugh", "time": 1617048385814, "rating": 5.0, "text": "Got carpet replaced in 3 rooms. Very fast and good quality work! Would definitely use again and recommend. Fair pricing and kind staff.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "104158047672989891341", "name": "Wendy Morell", "time": 1614952124707, "rating": 5.0, "text": "I’ve had three jobs done in the last month: carpeting stairs, refinishing original hardwood floors, and laying vinyl flooring. All three looked amazing when finished. The people who completed the work were kind and knowledgeable. I would highly HIGHLY recommend to anyone for any job, and if I have any flooring needs in the future, I will definitely be going back to Foo!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "104618926811918696197", "name": "Austin Wilson", "time": 1621624780392, "rating": 5.0, "text": "Amazing customer service! Fair pricing, they did a great job, and in a timely manner. Will use again!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "111495963250111391792", "name": "Shannon George", "time": 1628170628473, "rating": 2.0, "text": "I called on Saturday and was told someone would come out Monday to look at our floors. No one showed up, no one called to cancel, no one called to reschedule.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "101596527165292822274", "name": "Erika Olds", "time": 1613614553654, "rating": 5.0, "text": "Paul was very nice an easy to work with excellent customer service.This company has great pricing and did an excellent job on my mom's floors. They went above and beyond to make sure she was satisfied I would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "107406140331088407281", "name": "Mandy Willig", "time": 1611775396054, "rating": 5.0, "text": "Paul and his team replaced our carpet with beautiful engineered hardwood flooring. They provided amazing service throughout the process, from home consultation through the final walk through. We will not hesitate to recommend them to our friends and family!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "112669690267867551371", "name": "Mark Grissom", "time": 1607013347512, "rating": 5.0, "text": "We had an urgent need entering into a new home. Foo and crew responded same day, made selections easy, had it installed before we could get through the quoting process of big box. The installers were friendly, efficient, and the work was superb with exactly the product we wanted. What else can I say! Oh, above all else wife loves the new carpet and quality work.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "115776682774923613335", "name": "carol harris", "time": 1602631356793, "rating": 5.0, "text": "From the moment I walked in the door I was completely impressed with Homewood Carpet & Flooring. Not only was Paul knowledgeable about the flooring, he was genuinely interested in my specific needs for flooring. He was completely helpful  in the product selection that would best suit my needs. He stayed in communication with me throughout the entire process. His install team was  right on time and did a beautiful job. The guys were extremely thorough. I was really impressed with their attention to detail. They finished my (whole house) flooring job on time and left my home clean and in order. I have no reservations at all in recommending the guys at Homewood Carpet & Flooring to my friends and family.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "117769460189460528973", "name": "9 Bachelors", "time": 1618853711320, "rating": 5.0, "text": "Great job all the way. Excellent service, accurate quotes, very professional, polite and thorough installation team.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "110244103281373819637", "name": "Greg Yemm", "time": 1611325640548, "rating": 5.0, "text": "Quality, prices, and service were all 5 stars. The owner was very responsive any time I had questions too. Definitely would recommend.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "106706201392271033749", "name": "Kelly Arrington", "time": 1614274894918, "rating": 5.0, "text": "Enthusiastic crew who did a fantastic job on matching the rest of my floors and amazing job on my stairwell. The were timely, efficient and did a high quality job!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "107894437989686182279", "name": "Brian Murphy", "time": 1599170488442, "rating": 5.0, "text": "You are in good hands with Paul and his team.  First class service and a job well done.  I would recommend this company to anyone looking for flooring work.  Paul’s team sanded and re-stained my floors.  The work was of the highest quality.  Will definitely work with them again in the future.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "118431358092981908870", "name": "Corie Clark", "time": 1614175577124, "rating": 5.0, "text": "Foo was easy to work with and very responsive. The carpet and vinyl plank in out basement looks great.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "108185767878195700642", "name": "Bryan Stack", "time": 1595571082452, "rating": 5.0, "text": "I highly recommend them. Paul helped me select the flooring to replace my carpet. He was very prompt in providing an estimate and getting the job started.\nThe installers did an excellent job removing the carpeting and installing my vinyl floors. My condo looks 100% better. I will choose them again when I sell my condo and purchase another home.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "109786987685071944786", "name": "Britney Henry", "time": 1607133893779, "rating": 5.0, "text": "Paul and his staff did a wonderful job with our flooring project! We had our red oak floors refinished and also had our stairs repaired. They took our very outdated and yellowed flooring and transformed it into a beautiful brown/gray color that is exactly what we had envisioned. They even mixed two of the stains to get the exact color we described. One room had several areas of stains that was so bad I wasn’t sure they would ever look normal, but they were able to make the stains completely disappear. They also replaced a broken part of one step and repaired the stair treads so that they no longer squeak! We are completely satisfied with the job that Homewood Carpet and Flooring did for us and we appreciate their professionalism and thoroughness.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "117280063315082407405", "name": "felicity79", "time": 1596471524844, "rating": 5.0, "text": "I was unsure of what flooring I wanted, Paul was very helpful on helping me decide to refinish my hardwoods or to choose a new floor. He came to my house to show me color swatches and was willing to come back a second time when I thought I had changed my mind. I ended up going to his store and we picked out a beautiful floor that I am so proud of. Installation only took maybe 4 hours for my 900 ft. square floor. I would choose them again for my flooring needs. Will be redoing my kitchen floor soon, and definitely plan on calling Homewood Carpet and Flooring.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "106375889622757826283", "name": "Susan Copeland", "time": 1601668566170, "rating": 5.0, "text": "I have used Homewood carpet and flooring three separate times now for my home renovations and each time they exceed my expectations. Both Foo and Paul are really lovely to work with and provide clear communication so that I always knew exactly what was going to occur. And with a German Shepard puppy and 3 teenage boys, they have always guided me on the best flooring and carpet that would keep up with our chaotic and busy household :)!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "105121955311567759148", "name": "Tracy Thomas", "time": 1601657899176, "rating": 5.0, "text": "Paul and the guys at Homewood carpet and flooring did a wonderful job removing and installing new carpet in our upstairs! I even had to reschedule them and they fit me in on a Saturday at a moments notice! Everyone I worked with was professional and timely.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "106129743773265585104", "name": "Kristina Martin", "time": 1614178887077, "rating": 5.0, "text": "So compassionate and helpful. We had a time crunch and extenuating circumstances and they worked within those and did the job well.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "107364611999581145920", "name": "Kathryn Dorlon", "time": 1614974470649, "rating": 5.0, "text": "Friendly staff! Always looking to make your experience a good one and find the product you are looking for your home!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "116669237657631918488", "name": "Klaudia Thomas", "time": 1586493100689, "rating": 5.0, "text": "Paul did a great job providing the best customer service, attention to detail, offered his expertise and knowledge in carpet and wood selection process. Price was very competitive with others in the market. The crew was very professional, efficient and accurate. We love our new floors, looks amazing. We highly recommend this company.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "117292198587016720216", "name": "marybeth kaylor", "time": 1598277551269, "rating": 5.0, "text": "They did a great job refinishing our hardwoods and installing sisal carpet. Very fair, honest, and professional.  Highly recommend and will use again!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "117927648101878405915", "name": "Aaron Tallo", "time": 1599232880272, "rating": 5.0, "text": "Excellent and fast service. These guys are top shelf all the way around. If you need flooring you need to call Homewood Flooring!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "109897471029265977962", "name": "Landon Parris", "time": 1580746963373, "rating": 5.0, "text": "My wife and I need carpet installed in 2 bedrooms and we’re going to do it ourself, until we walked in Homewood Carpet and Flooring and met Paul, who was so helpful in the store helping us pick out the right carpet for our home. He came and took measurements same day and we had a great quote within hours. Paul updated us on ever detail until carpet was here and job was done. Installing team was professional and friendly. Paul came after they finished to do a walk through and checked everything. So blown away by the personable staff, quality products, and thorough service they provided!!!!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "115446824885828872031", "name": "Renie Moss", "time": 1597672791787, "rating": 5.0, "text": "Paul and his team went above and beyond, beating all the big box store prices and installation timelines.  We had carpet installed in two bedrooms and needed it done prior to an appraisal for refi.  The team was fast and professional. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "114768715712822487049", "name": "Debra Marciniak-Grimm", "time": 1593804341247, "rating": 5.0, "text": "We are pleased with the carpet installed by Homewood Carpet and Floor. Paul and his team were professional and easy to work with. He knew we were in a time crunch and were able to squeeze us into his schedule when another customer dropped out.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "118348250169309480457", "name": "Roena Randall", "time": 1598114616803, "rating": 5.0, "text": "From picking the carpet to installation, Homewood Flooring did an outstanding job. I am in love with my new carpet and  highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "106960485294534860176", "name": "Mike Simpson", "time": 1585827596541, "rating": 5.0, "text": "Just had our den and home office re-floored, and couldn't be happier with the results. Paul was very responsive to our initial inquiries, and provided good advice in helping us with our decision. Installation was prompt and very well done.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "118184430553207416823", "name": "Gary cutter", "time": 1539620311021, "rating": 5.0, "text": "Foo and his team were spectacular - responded immediately to my request for an inquiry - called on the morning of the measurement to be sure the time was still good for me.  The team did the job professionally and actually ahead of schedule.  Having spent three weeks trying to get the job done with a big box store with all types of exceptions, it was a pleasure to have the entire process done is less time.  Highly recommend this team.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "117506862403762401323", "name": "Mary Rogato", "time": 1556921176842, "rating": 5.0, "text": "My bath had to be rebuilt from subfloor because of water damage. Paul’s expertise management  and planning was excellent in getting job complete in a timely manner.  This bath was a total mess. When the workers came in and I saw their work, I knew my bath would look stunning.  Tile work is perfection.  I have been pleased with every job Homewood carpet and flooring has done for me. I strongly recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "111673837076019905808", "name": "Ryan Hartfield", "time": 1544822479160, "rating": 5.0, "text": "Foo and Paul do amazing work at a reasonable price. Their customer service surpassed my expectations. I wish I could give them more than 5 stars! ***HIGHLY RECOMMENDED!*** A+++", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "107924338687263126982", "name": "Ryan Hartfield", "time": 1581310003256, "rating": 5.0, "text": "Foo and Paul do not only do great work, but really help to guide you through the process and help you find the best options for your budget.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "113495018619618453896", "name": "Liza Roitman", "time": 1604282879129, "rating": 5.0, "text": "Great experience!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "115945416308632197519", "name": "Connie Thompson", "time": 1598578770897, "rating": 5.0, "text": "Stairs look great!!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "102122478744703865565", "name": "Ken Patel", "time": 1472082259886, "rating": 5.0, "text": "very nice and great staff.\nprofesssional attitude , on time completed the enire work.\n\nvert much on time show up, quiet work oriented employeres.\n\nthe owner/maneger was great\n\nThanks\n\nKen P", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "106188424001067705739", "name": "Alyssa Terry", "time": 1496699419374, "rating": 1.0, "text": "I have tried to visit this store multiple times during the posted store hours, but they have been unexpectedly closed each time.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "107373578747965377165", "name": "James McCrary", "time": 1626720129291, "rating": 5.0, "text": "Very professional and detail oriented!", "pics": null, "resp": {"time": 1627425276565, "text": "Thank you for your feedback, James. Best wishes."}, "gmap_id": "0x88892324714bf263:0x39d3fc7f8e29f644"}
{"user_id": "110229001605108355798", "name": "Matt Trombley", "time": 1611841653569, "rating": 5.0, "text": "I've known the owner, Cory, for several years and I can say with complete honesty that he is a man of integrity, hard work, and resolve. What this would mean to any Footprints customer is that they would benefit from an honest estimate, timeframe for work, and commitment to see it through. I can't think of better traits for someone working on my home, and so I would highly recommend Cory to anyone looking to have a flooring project completed.", "pics": null, "resp": {"time": 1612201570763, "text": "Hello Matt, thank you for the five-star review of our flooring installation business and your incredibly kind words!"}, "gmap_id": "0x88892324714bf263:0x39d3fc7f8e29f644"}
{"user_id": "108127912775681228903", "name": "Matt Elsner", "time": 1612209368300, "rating": 5.0, "text": "I have been fortunate to work with Cory on a number of projects, and I will go out of my way to continue to work with him when I can.  Honesty and integrity are two traits that you can expect from him.", "pics": null, "resp": {"time": 1612374374237, "text": "Hello Matt, thank you for the review! We appreciate your kind words."}, "gmap_id": "0x88892324714bf263:0x39d3fc7f8e29f644"}
{"user_id": "116739485628185613042", "name": "Shelley", "time": 1623972877383, "rating": 5.0, "text": "I cannot say enough great things about Cory and his installation crew. The entire process, from start to finish, was amazing. Everything was thoroughly explained, I was kept up to date, and there were no surprise fees. The installation team far exceeded my expectations. They were very friendly, efficient and highly skilled. They cleaned up everything before they left and made sure I was happy with everything. I had put my kitchen floor project off for a long time because I can't stand having strangers working in my home as it is so stressful. This company put me at ease and I am so grateful I gave them a chance. My new floor is beautiful! If you are hesitant about having strangers in your house and need a great job at a very fair price, call Cory!", "pics": null, "resp": {"time": 1624295952281, "text": "Shelley, Thanks for the kind words! We are happy to read that our team has been able to provide exceptional service for you. As always, our team is avaible if you need anyhting else. Best wishes."}, "gmap_id": "0x88892324714bf263:0x39d3fc7f8e29f644"}
{"user_id": "106361158904460389432", "name": "Candy Johnson", "time": 1616039049799, "rating": 5.0, "text": "They were very professional and courteousThey were very professional and courteous and didAnd did a very nice job", "pics": null, "resp": null, "gmap_id": "0x88626c9c5346c69d:0xcae6c7f10413a8fc"}
{"user_id": "114988896186206501829", "name": "Janet E", "time": 1593469502490, "rating": 1.0, "text": "Be very careful.  They ruined the finish on my brick floors and also made spots on hardwoods with a \"new pre-treatment chemical\" and a leaky container while cleaning my carpets.  Dodged me me for a month until I finally gave up and filed with BBB.  Never did get a call or reply from the owner.  And yes, I know him and know they've always had a good reputation.  But the repeated flat out ignoring, making excuses and never repairing...leaves me no choice.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP602ZbRRadWp0AN9uHX9TwD7H62qbA57Valcqt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOgke4jCnhHuwmz4izStkMf4XXQ7HnKHIio_Iyz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMFNRzCvQ4zRo--W9El4syroKMMK1XRK6qakYcS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNtJRnMRosmKmQw8_WwYa1OgfhpppMstL1zuVWj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMnnbZJ4YWDI9pR9Ldf1ArKZwmUO_WKPoaX49kV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMKZ0lGj6IKGyXA7Y2zTFwUno4ho-qpn7bYrAq4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOpBcuy9KQchIxtZaI9_hlDkieNsAZs43vUN284=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626c9c5346c69d:0xcae6c7f10413a8fc"}
{"user_id": "112284287468558883558", "name": "Supreme Storage", "time": 1558646909669, "rating": 5.0, "text": "I can't begin to express how awesome this crew is. I have been in touch with the job supervisor more than any other vendor in the last 12 years at multiple facilities. They stay on top of the job, checking throughout to assure all is good. They did a great job cleaning and applying epoxy to our concrete floors within our facility. We are already looking into having them as a constant vendor for maintenance and other jobs. Check out the before and after pics. Thanks to Chris and his crew for a job well done!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNFudZ7IL8qdkPma0kD_sTn2a7zh1y0nEGOKI-0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM32S96jRXYBlS7nnsidQuDXAZMyCtu07tNxv7Z=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626c9c5346c69d:0xcae6c7f10413a8fc"}
{"user_id": "113972062376526577897", "name": "Jef Park", "time": 1560829636353, "rating": 5.0, "text": "Excellent work, went above and beyond what I asked them to do for a very fair price.", "pics": null, "resp": null, "gmap_id": "0x88626c9c5346c69d:0xcae6c7f10413a8fc"}
{"user_id": "102205218532667860394", "name": "Sam Stone", "time": 1542506808477, "rating": 5.0, "text": "Great Job is all I can say very knowledgeable and througal and prompt attention to our needs", "pics": null, "resp": null, "gmap_id": "0x88626c9c5346c69d:0xcae6c7f10413a8fc"}
{"user_id": "104664824816401583840", "name": "Marty Thomas", "time": 1603133949198, "rating": 5.0, "text": "Call these guys", "pics": null, "resp": null, "gmap_id": "0x88626c9c5346c69d:0xcae6c7f10413a8fc"}
{"user_id": "113942802398859260209", "name": "Larry Bradley", "time": 1515951996452, "rating": 2.0, "text": "Supposed to be here at 9:30 am. Well, it's 11:45 am and no carpet cleaners.", "pics": null, "resp": null, "gmap_id": "0x88626c9c5346c69d:0xcae6c7f10413a8fc"}
{"user_id": "104378838507977027743", "name": "laurence allen", "time": 1579592606381, "rating": 1.0, "text": "Horrible experience to be professional builders", "pics": null, "resp": null, "gmap_id": "0x862831bfb7129e77:0x633afefdb0cc9cbf"}
{"user_id": "100872051604800994421", "name": "Berta Mexidor", "time": 1531252831023, "rating": 4.0, "text": "Good quality work", "pics": null, "resp": null, "gmap_id": "0x862831bfb7129e77:0x633afefdb0cc9cbf"}
{"user_id": "112005746038551547990", "name": "Kelly Ruka", "time": 1611587573334, "rating": 5.0, "text": "Chad is very professional and thorough. I recommend floor medic to all!", "pics": null, "resp": null, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "102637217249560096791", "name": "Mary Alice Nelson", "time": 1598470089963, "rating": 5.0, "text": "So glad to discover Floor Medic!  Fast and very good service from Malcolm.  My carpet, area rug and an oriental rug which was picked up here and returned, all look like new! Thanks!", "pics": null, "resp": {"time": 1598474052748, "text": "Thank you Mrs Nelson!"}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "103843832124825686666", "name": "Kerry McCullough", "time": 1591828998675, "rating": 5.0, "text": "Their response time is so fast.  They are efficient and professional.  Highly recommend.  They do an amazing job cleaning carpets.", "pics": null, "resp": {"time": 1591834912912, "text": "Thank you Kerry!  We appreciate your business."}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "101710852408978536963", "name": "Rachel Coggins", "time": 1573507651466, "rating": 5.0, "text": "This was the first time that I used Floor Medic and I am very grateful that I used their service. They were able to fit me in within 2 days with a time that accommodated my schedule. Brett arrived and started straight to work. I told him that I had cats that were confined to one room that was not being cleaned today. He thanked me for letting him know that there were animals in the house. Even though they were not a risk of running, he was very considerate of my animals. That meant the world to me! Brett was super professional, very fast and removed every problem spot that I had. Saying that I am a satisfied customer is an understatement. Thank you so much to Chad and Brett for their amazing customer service. I will definitely use Floor Medic again", "pics": null, "resp": {"time": 1574179643374, "text": "Thank You!"}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "108167597292465776718", "name": "Corinna Luce", "time": 1595279504025, "rating": 5.0, "text": "Not only did they do a great job on the carpets, they also followed up to be sure I was satisfied.  I can't remember the last time a service provider did that.", "pics": null, "resp": {"time": 1595283280548, "text": "Thank you Mrs Luce!"}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "113729177736653343559", "name": "Shirley Miles", "time": 1591410075286, "rating": 5.0, "text": "When I called the expectations were to have it done ( rug cleaning) quick .  They were\nOver and above my expectations\nThank you for professionalism and kindness .", "pics": null, "resp": null, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "118064700287827676797", "name": "Dean watson", "time": 1580743772802, "rating": 5.0, "text": "Hats off to Chad and his team … We needed our floors cleaned asap and Floor medic was able to not only meet but exceed our expectations …\nI would definitely recommend this cleaning service above all others … Great Job guys !", "pics": null, "resp": {"time": 1580778498640, "text": "Thanjk you Dean!  We appreciate your business!"}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "102971945562023870721", "name": "Diamond Wash by Softwash Pros Doug Houston", "time": 1544812803122, "rating": 5.0, "text": "Chads guys came out to my house to clean my carpets. I’ve used Chad at Floor Medic for a few years. They are always on time courteous and professional. They work around my schedule to accommodate my time slot requests. I will continue to use them in the future and highly recommend Floor Medic.", "pics": null, "resp": {"time": 1544906386140, "text": "Thank you Doug. We appreciate you guys!"}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "112395808226143196222", "name": "Sim Sokom", "time": 1532364885629, "rating": 5.0, "text": "Chad and floor medic have been spectacular. We had a pipe burst and they were able to save the hardwood floors and saw the project til the end. We also had them clean and stretch the carpet and clean our sofa and loveseat, all with great result. Highly recommended.", "pics": null, "resp": {"time": 1532553717716, "text": "Thanks Sim.  We enjoyed working for you."}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "112818154930809248555", "name": "Kelley Michele", "time": 1552507361299, "rating": 5.0, "text": "Chad and his crew is always timely and do a fantastic job for us.  We happily use them exclusively at our community.", "pics": null, "resp": {"time": 1554064150996, "text": "Thank you Kelley -- we appreciate you guys!"}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "108270473816898068584", "name": "Hudson Sandefur", "time": 1504103368456, "rating": 5.0, "text": "Had a flood in my home due to a broken water line.  Floor Medic was here within an hour and with their system was able to save my hardwood floors, saving me thousands of $$.  Since then they have done more work cleaning carpets and rugs.  Great service and results.  Highly recommend Floor Medic.", "pics": null, "resp": null, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "103569910336395949184", "name": "robert smith", "time": 1604934827919, "rating": 5.0, "text": "Always on time, efficient, professional, competitive and clean carpet  every six months for 7 years. Also used recently in home and same great results", "pics": null, "resp": {"time": 1552569369288, "text": "Thank you!  We appreciate you guys!"}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "110059277526595742370", "name": "Angela Wright", "time": 1481305217119, "rating": 5.0, "text": "I've been doing business with Floor Medic for well over 5 years!  I manage an apartment community and they do an awesome job on our carpets, always going the extra mile!  He not only cleans our carpets but does water extraction when needed.  We've had apartments flooded out and Chad and his crew are always on the spot fast to help with the clean up.  I couldn't ask for better service!", "pics": null, "resp": {"time": 1481644935417, "text": "Thank you thank you thank you!"}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "100341757326400742947", "name": "JD Weir", "time": 1416237139955, "rating": 5.0, "text": "Chad and his crews are always professional and prompt!  His prices are always way beyond fair for the work they provide.  We have used his service on multiple occasions (as we have pets, parties, and kids), and each time the work is phenomenal!  Give Floor Medic a call for your floor, or upholstery, cleaning needs  -- you will be glad you did!", "pics": null, "resp": null, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "102090497709690867973", "name": "M Young", "time": 1418186606712, "rating": 5.0, "text": "I am SO pleased. I took my husband's recliner to Floor-Medic to be cleaned after our cat had an accident on it. I only had hopes that the stain would be minimized. Never did I imagine that I would be returned a chair that appears in almost brand-new condition! Professional and customer friendly, Floor-Medic is the name I will recommend most heartily to all my friends needing upholstery cleaning. Thank you, Chad!", "pics": null, "resp": {"time": 1444834484781, "text": "Thank you. It's a pleasure to work for you."}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "111244726658685085927", "name": "Roger Murphy", "time": 1516823064229, "rating": 5.0, "text": "Very professional and reliable company, one of the best in the industry! I highly recommend Floor Medic for your Water extraction and restoration needs!", "pics": null, "resp": {"time": 1523569606765, "text": "Thank you Mr. Murphy!"}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "100557474114918222413", "name": "mary morrison", "time": 1516380426144, "rating": 5.0, "text": "Best carpet/usholstery cleaning experience I’ve ever had! Brett, the technician, was very professional and all equipment extremely clean.", "pics": null, "resp": {"time": 1516397429689, "text": "Thank you very much.  We appreciate your kind words and business!"}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "101768382623871434756", "name": "Harry Brooks", "time": 1531235531762, "rating": 5.0, "text": "Excellent service. Exceeded my expectations. definitely recommend", "pics": null, "resp": {"time": 1531244196703, "text": "Thank you Mr Brooks.  We appreciate your business!"}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "104841366650243682276", "name": "Heather Nelson", "time": 1452184177821, "rating": 5.0, "text": "Very pleased with the customer service and the results we received from everyone at Floor Medic. Our carpets and upholstery look like new. I will be using Floor Medic again and will be referring them to all of my friends and family!", "pics": null, "resp": {"time": 1465416155716, "text": "Thank you. We appreciate you."}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "102141524053511308383", "name": "Andrea Krebs", "time": 1523390986650, "rating": 5.0, "text": "Chad has been our carpet cleaner for years.  He shows up when he says he will, with or without utilities on at the property, and always does and excellent job.  His crew is very polite and professional.  We will be continuing to use him for all our carpet cleaning.", "pics": null, "resp": {"time": 1523569510358, "text": "Thank you!  We appreciate your business and enjoy working for you!"}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "106320522235254037290", "name": "Lad Drago", "time": 1493216664433, "rating": 5.0, "text": "Great job on my office carpets.  Very reasonable pricing.  I will use Floor Medic again.", "pics": null, "resp": {"time": 1493227732634, "text": "Thanks Lad.  We appreciate your business."}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "108562745532470438547", "name": "Steve Ascik", "time": 1512570205349, "rating": 5.0, "text": "This is by far the very best service I've found  on the eastern shore .  Professional, courteous, thorough. Highly recommend.", "pics": null, "resp": {"time": 1512570893084, "text": "Thank you. We appreciate you."}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "116891752793675737552", "name": "fazekas796", "time": 1511454681214, "rating": 5.0, "text": "Great company with top notice service. Highly recommend them.", "pics": null, "resp": {"time": 1512570910513, "text": "Thanks Jimmy."}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "115725699583394171116", "name": "Mandy Pitts", "time": 1584378005250, "rating": 5.0, "text": "As the leasing agent with Ashley Gates, I can honestly say we could not be happier with the excellent service the Chad and Floor Medic provides.", "pics": null, "resp": {"time": 1489769872130, "text": "Thank you.  We enjoy working for you guys."}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "110889486879293582100", "name": "Carl David Winners", "time": 1301500962684, "rating": 5.0, "text": "I was amazed at the effective removal of all pet stains and odors from the rental property we worked on, highly recommended.  CW", "pics": null, "resp": null, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "102408200622218074523", "name": "Boudreaux'sCajunGrill Daphne", "time": 1523471455810, "rating": 5.0, "text": "This building has been around for 40+ years!  These guys know their stuff!  The tile they cleaned has never looked better!  Thanks!", "pics": null, "resp": {"time": 1523569553833, "text": "Thanks Boudreaux's!  We appreciate you!"}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "117817067909658594429", "name": "Paul Low", "time": 1550601884533, "rating": 5.0, "text": "Been using them for years..... always outstanding", "pics": null, "resp": {"time": 1554064219820, "text": "Thank you Mr Low -- you guys are a pleasure to work for!"}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "117871727267068214651", "name": "Ty DeLoach", "time": 1479917356046, "rating": 5.0, "text": "Wonderful experience Malcolm was fantastic and courteous!", "pics": null, "resp": {"time": 1480341779255, "text": "Thank you very much.  We appreciate your business."}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "117853224196979829836", "name": "Adam Harmeier", "time": 1552567183699, "rating": 5.0, "text": "Chad and his professional staff have cleaned over 25 houses for me in the past year. They have exceeded our expectations on everyone!!", "pics": null, "resp": {"time": 1552569228639, "text": "Thank you!  We appreciate your business!"}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "112463327867810382880", "name": "Pel Henry", "time": 1534342996571, "rating": 5.0, "text": "Did a great job!! highly recommend!!", "pics": null, "resp": {"time": 1534345954597, "text": "Thanks Pel - we appreciate your business."}, "gmap_id": "0x889a41f6b3c80f9d:0x52faa76e4f818ab7"}
{"user_id": "101360884063643234725", "name": "Adam Farley", "time": 1543375066944, "rating": 5.0, "text": "We use Jani-king of Montgomery as our cleaning service twice a week. They do a great job! Call them and ask for Cory to handle your account because the man cares about his customers, he communicates well with us and is a very hard worker himself. He recently came out and stripped, cleaned and waxed our floors. I was worried about some areas because we did some rearranging and the floor in those areas were in horrible condition. Cory made sure that floor looked brand new before he left. Thanks again for your hard work and attention to detail.", "pics": null, "resp": null, "gmap_id": "0x888c2a693759e587:0x545531e8a8149c6c"}
{"user_id": "117467229564742046602", "name": "Daniel Millard", "time": 1622312816273, "rating": 5.0, "text": "Clint did an amazing job!! We had him clean an entire house including furniture and it's all like brand new! Clint really knows his stuff and makes sure the job is done right! His pricing was also very fair and he got right to us! Highly recommend his services!", "pics": null, "resp": {"time": 1622313248016, "text": "Thanks Daniel!  We really appreciate y’all trusting us with everything!  Welcome to the Jones ChemDry Tribe!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "113425551932123674028", "name": "Dr. Salena Potter", "time": 1622308968737, "rating": 5.0, "text": "Loved these folks!!! We were a late request and Clint made it workout great!  The service was superior, and they are so nice!!!", "pics": null, "resp": {"time": 1622310089518, "text": "Thank you so much Dr. Potter.  We were honored to squeeze you all in to our schedule.  Welcome to the Jones ChemDry Tribe!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "115195705876230270645", "name": "Laurie Pitts", "time": 1612826995705, "rating": 5.0, "text": "Very personable and professional. I was impressed by Clint’s knowledge of a hand-woven, antique rug. Would definitely recommend and use again!", "pics": null, "resp": {"time": 1612888403465, "text": "Thank you Laurie!  We really appreciate the kind words.  We are glad we could welcome you to our area... you will love the lake!!  Also welcome to the Jones ChemDry TRIBE!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "113630508023293020587", "name": "Hazel Cook", "time": 1588964417659, "rating": 5.0, "text": "Such a professional, friendly and considerate. My mom is 75 so I asked that he be super careful during this time of disease. He was fantastic about it! The carpet looks like new and smells great. He took his time and did it right. I'm really impressed and grateful for the job he did for my mom.", "pics": null, "resp": {"time": 1589463632188, "text": "Thank you for such kind words.  We are glad we could assist y’all with your disinfecting needs during this Covid-19 pandemic.  Welcome to the Jones ChemDry TRIBE!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "113728284723365799171", "name": "John Harbin", "time": 1593612739551, "rating": 5.0, "text": "Clint did a wonderful job and my boss (spouse) loved it. It's the best cleaning job we've had on those carpets and their precedessors ever. He also did our hard floors and a the floor looked as as a place that was under an area rug, like new. You won't be disappointed.", "pics": null, "resp": {"time": 1597501543327, "text": "Thank you for such kind words.  We are glad we could assist y’all with your disinfecting needs during this Covid-19 pandemic.  Welcome to the Jones ChemDry TRIBE!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "116008361463207109681", "name": "Q Fletcher", "time": 1597421017662, "rating": 5.0, "text": "Clint is amazing! He's gone so far above and beyond  to provide a level of professionalism that is unparalleled. The only service dream of using for my rental properties and my home.", "pics": null, "resp": {"time": 1597501607407, "text": "Thank you for such kind words.  We are glad we could assist y’all with your disinfecting needs during this Covid-19 pandemic.  Welcome to the Jones ChemDry TRIBE!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "103345733923196114264", "name": "jerry fletcher", "time": 1597420725481, "rating": 5.0, "text": "Punctual and professional and my place looks stellar now. I'm exceptionally satisfied.", "pics": null, "resp": {"time": 1597501579854, "text": "Thank you for such kind words.  We are glad we could assist y’all with your disinfecting needs during this Covid-19 pandemic.  Welcome to the Jones ChemDry TRIBE!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "101420272054359708666", "name": "Barb Conway", "time": 1559581456748, "rating": 5.0, "text": "This company does an amazing job!  Have used them a couple times and never fail to provide a great product!  Had them do my area rug too, which I was going to just replace but it looks like new! Highly recommend them", "pics": null, "resp": {"time": 1559602657309, "text": "Thanks Barb! We really appreciate your business and your kind words!  Thank you for being a part of the JONES CHEM-DRY TRIBE!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "106647572630382956318", "name": "Bill Andrews", "time": 1534944765125, "rating": 5.0, "text": "Clint Jones did a fantastic job.  He was able to clean our carpets the day after I called.  He quoted a price that did not change.  He is very knowledgeable of his product and how to clean problem areas.  He is very personable but not a hard sell for add on products or services.  I would recommend Jones Chem=Dry\nwithout hesitation.", "pics": null, "resp": {"time": 1534963962027, "text": "Thank you so much Bill for such a great recommendation!!  We would like to thank you for choosing us!  Welcome to the Jones Chem-Dry Tribe!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "113317763603343921572", "name": "Melody Black", "time": 1562602926563, "rating": 5.0, "text": "Clint was amazing! He showed up on time and came in under his original estimate. The carpets look fantastic. Already added him to my “go to” list of local business owners who do thing right!", "pics": null, "resp": {"time": 1562935671888, "text": "Thank you so much, Melody!  Your kind words and endorsement are awesome!  Welcome to the Jones Chem-Dry Tribe!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "111471815362547751132", "name": "Mollie West", "time": 1547688774419, "rating": 5.0, "text": "This was my first experience with Jones Chem-Dry and I couldn’t be more pleased. Clint assured me that he would be able to clean my 20+ year old carpet and remove the stains, and that he did!!  I also had my sofa cleaned as well. Again, I was very happy with the thorough job. I would highly recommend Jones Chem Dry to all of my friends and neighbors, and will certainly use them again. I have just been through a home remodel and this service was about the first time I have been totally satisfied with the task completed. It’s so nice to know that there are still some companies that truly care about service performance and customer satisfaction. Thank you so much!", "pics": null, "resp": {"time": 1547692579478, "text": "Mollie, we are blown away by your kind words.  Thank you so much for giving us a shot.  Welcome to the Jones Chem-Dry Tribe!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "108840942544482527505", "name": "Judy Elrod", "time": 1507313925666, "rating": 5.0, "text": "Clint Jones with Chem-Dry does a fantastic job on carpets.  He has cleaned my carpets several times and each time they look like new.  He cleaned the carpets in a rental house that we own and they looked so clean.  They had never been cleaned before and they looked better than new.  He always has helpful hints for me to help keep my carpets clean.  He is professional, friendly, and very helpful. Highly recommend him!", "pics": null, "resp": {"time": 1507330331553, "text": "Thanks so much, Judy!  We always enjoy cleaning for you.  We are looking forward to cleaning and sealing your tile and grout soon.  Thanks again."}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "115847838105166143071", "name": "John Briscoe", "time": 1576926558825, "rating": 5.0, "text": "Did a excellent job cleaning some very dirty carpet.  Highly recommend.", "pics": null, "resp": {"time": 1576996157225, "text": "Thank you John!!! We really appreciate the vote of confidence!  Thanks for being a part of the Jones ChemDry Tribe!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "114860414336449232866", "name": "Rochelle Hendry", "time": 1550527016893, "rating": 5.0, "text": "A friend of mine referred me to Clint. I called him and scheduled an appointment for the following week. He is extremely friendly and knew what he was doing. Prices were great and he did an excellent job!", "pics": null, "resp": {"time": 1550550355548, "text": "Thank you so much Rochelle!  We are thankful that you gave us a try!  Welcome to the Jones Chem-Dry Tribe!!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "116668088979351271059", "name": "Rachel Davis", "time": 1540829692597, "rating": 5.0, "text": "I’ve had my carpet cleaned twice by Jones Chem-Dry in Arab and it’s exceptional service! They are always very quick to work me in for an appointment and have very friendly and professional customer service! Their process leaves me with fresh carpet and I don’t have to wait long for the carpet to dry.", "pics": null, "resp": {"time": 1540871089819, "text": "Thank you Rachel for such kind words.  It has been our pleasure serving you guys over the last couple of years.  Thank you for being a part of the Jones ChemDry Tribe!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "114370062348493741182", "name": "Pat ____", "time": 1544734550665, "rating": 5.0, "text": "Clint Jones did an amazing job on my carpet and upholstery yesterday.  He was on time, professional, thorough, cost conscious, everything you look for in a service and rarely find anymore.  I look forward to using him again and wouldn't hesitate to recommend his work and his company.", "pics": null, "resp": {"time": 1544795446195, "text": "Wow, those are such kind words Pat.  We are thankful to have you as a new customer and are excited to welcome you to the Jones ChemDry Tribe!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "109474402531110386131", "name": "michael sellers", "time": 1521253077170, "rating": 5.0, "text": "Clint was outstanding! He took the time to walk me through the entire process and answer all the questions I had. He did not try the typical salesman approach to oversale me. He gave his professional opinion and let me decide what was best. Clint earned a lifetime customer today. Thanks again Clint for the awesome job", "pics": null, "resp": {"time": 1521291174508, "text": "Thanks Mike!  It was a pleasure to serve you and your family.  We really appreciate you giving us the opportunity to serve!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "107815625327876048833", "name": "Kyle Coker", "time": 1539738265625, "rating": 5.0, "text": "Clint did a great job on 5 of my rugs.  All different sizes.  He cleaned a deodorized them and they all look and smell great.  However, the best part was that Clint was very honest.  My biggest wool rug had dog stains on it and instead of trying to clean something he knew would not turn out well, he told me up front that it would be very tough to clean.  He still tried to clean part of it and did not charge me a dime for it.  It was nice to actually work with someone who is honest and you can trust.  I would recommend him to anyone.", "pics": null, "resp": {"time": 1539739163785, "text": "Awesome Kyle!!  We appreciate such kind comments.  We are even more excited to have you as a new customer....welcome to the Jones ChemDry Tribe!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "101617716924006579830", "name": "Victor Heartsill", "time": 1559687801895, "rating": 5.0, "text": "Jones does a fantastic job!\nShowed up when they said they would and did more than I expected. My carpet looks and smells great!", "pics": null, "resp": {"time": 1559692648761, "text": "Thank you so much Victor!  We really appreciate you giving us a chance to be your choice for carpet cleaning!  Welcome to the JONES CHEM-DRY TRIBE!!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "115661653162853632152", "name": "Tonia Smoot", "time": 1531852790181, "rating": 5.0, "text": "Clint did a fantastic job. I was ready to replace my carpet until he came to the rescue! My carpet looks brand new! He kept me informed on what he was doing from start to finish. Thanks Clint!!", "pics": null, "resp": {"time": 1531918177745, "text": "Thank you Tonia for the kind words!  We are proud your carpets look great!  Welcome to the Jones ChemDry Tribe!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "114000378308957216058", "name": "Don Stroud", "time": 1491362952096, "rating": 5.0, "text": "All I can say, is the service is \"exceptional\"!  Not only having a service person that truly loves helping and providing expert service, but the carpets and area rugs, and the furniture have never looked or smelled better!  And it is just great to have a service technician that truly loves the work and the opportunity to provide a very specialized service to the public!  Thanks so much!  I will definitely be using Jones Chem-Dry on a \"bi-annual\" basis to ensure that my carpets and area rugs are clean and that the life of my house whole investment is secure!\n\nThanks so much!", "pics": null, "resp": {"time": 1491364087874, "text": "Thank you so much for the kind words.  We really appreciate your business and the feedback.  We look forward to seeing you in 6 months!  God bless!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "114870496138912821133", "name": "Donna Rose Bitner", "time": 1535746417700, "rating": 5.0, "text": "Bought a house with some major carpet stains. Jones Chem-Dry came out and did a great job. No, some of it didn't get clean, but it looks so much better! And I feel better knowing the carpet is fresh and free of germs. Thanks!", "pics": null, "resp": {"time": 1535766628399, "text": "Thank you Donna!  We appreciate you guys using us for your carpet cleaning.  Welcome to Guntersville and welcome to the Jones ChemDry Tribe!!!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "118134221952173592603", "name": "Nancy Davis", "time": 1567644805496, "rating": 5.0, "text": "Excellent Job!! Give them a call I promise you will not be disappointed", "pics": null, "resp": {"time": 1567646762877, "text": "Thank you, Nancy!!  We appreciate your recommendation!!  Welcome to the Jones ChemDry Tribe!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "118355800445220786166", "name": "Teri Luttinger", "time": 1559076957645, "rating": 5.0, "text": "Our experience with Jones Chem-Dry was five star from start to finish.\n\nThe owner is the one you deal with  And you can tell he takes pride in his work. My initial phone call to enquire and schedule my appointment was very professional. The actual appointment even more so. There were work areas that I as the home owner would have cut corners on but not Clint, he paid attention to every small detail. Then he cleaned up on his way out, literally mopping himself out the door.\n\nWe had 3 services provided. Grout cleaning, upholstery cleaning and carpet cleaning  Each job restored our home items to \"good as new\" condition.\n\nThank you Clint and Jones Chem-Dry for a JOB WELL DONE.  I will highly recommend this service to anyone needed work performed!!", "pics": null, "resp": {"time": 1559085059826, "text": "Teri, I am stunned by your recommendation for our services.  I have been truly humbled by your kind words.  We are thankful that you found us for your cleaning needs.  Allow me to proudly welcome you to our JONES CHEM-DRY TRIBE!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "105872612248265412767", "name": "Sharon Spruiel", "time": 1527908223325, "rating": 5.0, "text": "Loved my carpet.  Made it look like new.  And great service.  Will definitely use again.", "pics": null, "resp": {"time": 1528159869223, "text": "Thank you so much Sharon for the kind words.  We appreciate your business and are glad to have y'all as a part of the Jones ChemDry Tribe!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "102701886887536640827", "name": "Debbie Loudermilk", "time": 1539112531942, "rating": 5.0, "text": "The carpet in our basement was 30+ year old beige Berber that had huge stains. This company really performed miracles with it!  I highly recommend them. We’re so relieved that we don’t have to replace that carpet. I’m truly amazed. Thank you.", "pics": null, "resp": {"time": 1539128971321, "text": "Thank you so much Debbie and Steve!  It was a pleasure working with you all!  Welcome to the Jones ChemDry Tribe!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "112538758379399957343", "name": "CM Johnson", "time": 1547845588455, "rating": 5.0, "text": "Clint was easy to contact for my appointment, and was early in getting there. He explained the process he felt would best address the problem and was very fair in pricing the job.\nFrom pre-treatment to putting up his equipment he was positive and professional, several times offering information about what he was doing and why.\nI’ll be using them for any future needs and will personally refer their services to my family and friends.", "pics": null, "resp": {"time": 1547864584917, "text": "Craig, I really appreciate you speaking so kindly of us!  We are proud to have you as a new customer!  Welcome to the Jones Chem-Dry Tribe!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "104639956029716222636", "name": "Chez Louze", "time": 1497479623223, "rating": 5.0, "text": "Excellent customer service! Clint was very professional and went above and beyond to make sure our Bed & Breakfast was taken care of. He worked around our schedule and was happy to accommodate us. Our carpets look like new again! We will definitely be using them again in the future.", "pics": null, "resp": {"time": 1497480955741, "text": "Thank you for the endorsement Ms. Louze.  We are always grateful for new customers, especially when the customer is a local small business.  We are also delighted to help you maintain a property that is as special as Guntersville Bed & Breakfast.  It is great to see the effort you all have put into maintaining the historic significance of the property."}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "115824745673847502826", "name": "Diane Garrison", "time": 1510260256097, "rating": 5.0, "text": "Clint did a fantastic job cleaning my carpet.  He was very thorough and knowledgeable.  My carpet looks great.  I highly recommend him to anyone needing carpet cleaned.", "pics": null, "resp": {"time": 1510261481573, "text": "Thank you Diane!  We appreciate you giving us the opportunity to clean your carpet.  We look forward to seeing you in future!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "118134221952173592603", "name": "Nancy Davis", "time": 1567644805496, "rating": 5.0, "text": "Excellent Job!! Give them a call I promise you will not be disappointed", "pics": null, "resp": {"time": 1567646762877, "text": "Thank you, Nancy!!  We appreciate your recommendation!!  Welcome to the Jones ChemDry Tribe!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "105950419661457480417", "name": "Carol Roberts", "time": 1503722945136, "rating": 5.0, "text": "Can't imagine why I ever put off getting my carpet cleaned! My whole house looks, feels and smells great, all at terrific price.  The customer service is second to none! Thanks, Clint.", "pics": null, "resp": {"time": 1503770507248, "text": "Thank you for that Carol!  It was our pleasure to help!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "103964149178724822798", "name": "J316", "time": 1491499129903, "rating": 5.0, "text": "Clint ALWAYS does a fantastic job and is very thorough as well as knowledgeable. He truly cares about his customers and doing his best. Impressive! We have been using him for years now and highly recommend Jones Chem-Dry.", "pics": null, "resp": {"time": 1491501448303, "text": "Thank you Jay!  It means a lot coming from a man if such high integrity!  It has been great working with you for passed 4.5 years!  I consider you one of my closest friends and also my brother in Christ!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "114175401552630343258", "name": "Adam Hammond", "time": 1491319035691, "rating": 5.0, "text": "We were very pleased with the customer service and the final product.  We had two Persian rugs that were soiled by our dog and they were able to remove the odor and stain without a problem! We will definitely be using them again!", "pics": null, "resp": {"time": 1491322905032, "text": "Thanks Adam!  It was our pleasure to help you restore your rugs to their former glory!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "108204118100920391760", "name": "Tammy Allen", "time": 1491492457556, "rating": 5.0, "text": "Jones Chem Dry is great! Clint is always great to come clean my carpet whenever I call. He is very professional, and leaves my carpet beautifully clean and smelling great! Call Jones Chem Dry for great cleaning service!", "pics": null, "resp": {"time": 1491493220034, "text": "Thanks so much Tammy!  We consider you and Mike and your children to be a big part of the Jones ChemDry family.  We look forward to serving you all in future!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "105123575699480908124", "name": "Jack Clifford", "time": 1497315544756, "rating": 5.0, "text": "It's nice to do business with someone who does more than what they say, shows up on time and is willing to spend time explaining the process of how their process works. I recommend them with no hesitation and will have Clint clean my carpet again.\nThanks for a job well done.", "pics": null, "resp": {"time": 1497327038337, "text": "Thank you for such kind words Mr. Clifford.  It was our pleasure to deliver that one of a kind service."}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "102554635662992969054", "name": "Mary Davis", "time": 1495568881959, "rating": 5.0, "text": "Chem-Dry has kept our light Berber den carpet clean for the past 10 years with Clint providing the service for the last 5 years.  He always does a first-rate job and this carpet provides him with a number of challenges, including an old, sick cat who leaves countless stains for him to remove.  I would not consider having any other carpet cleaning service.", "pics": null, "resp": {"time": 1495574091761, "text": "Mary that means the world to me!  It has been a pleasure getting to know you and Bob of the past several years.  Thank you for being one of our best customers through the years!!  Also congratulations on 60 years of marriage on the 4th.  You and Bob are a great example for the rest of us."}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "117588790924893056349", "name": "Alene Richards", "time": 1507213249061, "rating": 5.0, "text": "I have been using Jones Chem-Dry for the last 5 years and am extremely happy with the results. Clint Jones is very dependable and takes his job very serious. I would highly recommend him for all your cleaning needs.", "pics": null, "resp": {"time": 1507221942810, "text": "Thank you so much, Alene!  It is always a pleasure to clean carpets that so well taken care of.  You all do a great job with regular vacuuming and annual cleaning that keep your floors immaculate!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "100099802039075759013", "name": "Martha Handschumacher", "time": 1514670781325, "rating": 5.0, "text": "Wonderful customer service.  Very knowledgeable about types of carpet and rugs and the proper way to clean them.  Clint Jones is such a nice person too. Will call on this compy again when needed.", "pics": null, "resp": {"time": 1514673788972, "text": "Thanks Martha, you are too kind!  We are thankful you chose us to help maintain your carpets.  We look forward to working with you in the future!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "103319264521175950576", "name": "emma allen", "time": 1553822067054, "rating": 5.0, "text": "Friendly service! They did such a great job and really helped me out.", "pics": null, "resp": {"time": 1553822934502, "text": "Thank you so much Emma! We are happy that you chose us!  Welcome to the Jones Chem-Dry Tribe!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "111744741587601103756", "name": "Shirley Wilkerson", "time": 1495057580372, "rating": 5.0, "text": "Clint is always very professional, does a great job and stands behind his work. If there is any problem he is quick to respond and works diligently to resolve the issue.", "pics": null, "resp": {"time": 1495059424283, "text": "Thank you, Shirley!  We are so grateful to have you as one of our loyal customers!  It has been a pleasure to help keep your beautiful home in pristine condition!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "102800539175441243613", "name": "David Tomlinson", "time": 1521576910947, "rating": 5.0, "text": "Excellent job !  Great price !  Very friendly and professional.   Will definitely use them again.", "pics": null, "resp": {"time": 1521579321152, "text": "Thank you so much David!  It is always a pleasure to clean for customers that are as clean as you guys are!  We just appreciate you giving us a shot to be your floor cleaning specialists!!  Welcome to our Tribe!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "111001633380368423743", "name": "Lindsay Wood", "time": 1535591564013, "rating": 5.0, "text": "They were fabulous to schedule me quickly and did an above and beyond awesome job a cleaning my sectional.", "pics": null, "resp": {"time": 1535593010391, "text": "Thank you Lindsay for choosing us.  We appreciate the kind words also.  We are excited to have you guys as part of the Jones ChemDry Tribe!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "101600701512293435851", "name": "Ross Allen", "time": 1509324072731, "rating": 5.0, "text": "Great customer service! From the phone call to in-house quote and completion we were very pleased with how Clint communicated with us. He gives advice and direction for our benefit (and not always his which is RARE). In our case our dog got “sick” on my wife’s favorite rug. It was bad. Clint got the stain out for under his original quote!!! We are so grateful to this wonderful business! We will definitely use them again.", "pics": null, "resp": {"time": 1509329149072, "text": "Thanks so much Ross, those are such kind words!  We appreciate you and Leslie for trusting us to clean your rug!  We look forward to cleaning carpets and tile & grout in new home!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "115110695814318753566", "name": "Matt Peterson", "time": 1513380192359, "rating": 5.0, "text": "Great work. Awesome price, and super nice. 10/10 will use again!", "pics": null, "resp": {"time": 1513381656467, "text": "Thanks Matt, we really appreciate it!  We enjoyed cleaning for you guys!  We will see you next time."}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "106986494958806921769", "name": "Tara Wilson", "time": 1505498670784, "rating": 5.0, "text": "I have used this company several times. Each time it is a pleasant experience. The work is excellent!", "pics": null, "resp": {"time": 1505501403368, "text": "Thank you so much Tara!  We have enjoyed getting to know you and Ricky.  It is always our pleasure to clean your carpets and furniture."}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "106612074481299870156", "name": "Kimberly Watkins", "time": 1531934583609, "rating": 5.0, "text": "Enjoyed pur experience, couches look and smell great!   Extremely personable!", "pics": null, "resp": {"time": 1531935979669, "text": "We appreciate the kind words Kim!  I really enjoyed talking with Mike!   Welcome to the Jones ChemDry Tribe!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "113692552461187265123", "name": "Jonathan Watts", "time": 1531767797855, "rating": 5.0, "text": "Great job cleaning both carpet and tile.  Very affordable.", "pics": null, "resp": {"time": 1531840511480, "text": "Thank you Dr. Watts.  We are excited to have you as a member of the Jones Chem-Dry Tribe!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "111814189198304854745", "name": "Robert Galliher", "time": 1555637478416, "rating": 5.0, "text": "Fair pricing, friendly and prompt service!\n\nExcellent job!", "pics": null, "resp": {"time": 1555777155452, "text": "Thank you Robert!  We appreciate you giving us a chance to serve you!  Welcome to the Jones Chem-Dry Tribe!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "116842615319792796635", "name": "Kay Willis", "time": 1523055268465, "rating": 5.0, "text": "To anyone needing a carpet cleaning guy...Clint is who you want!  I called on Wednesday, he came on Friday ( on time).  He asked questions that saved me some cost, and was gone within an hour.  I even left him here and went to pick up my daughter.\nNow, why did I need him???  My dachshund had gotten sick and we will leave it there,.,every spot (about 15 of them) all came out nothing short of a miracle.  Is bad as I dislike carpet, I would consider keeping it as long as Clint promises to stay in business.", "pics": null, "resp": {"time": 1523061924344, "text": "Kay, we couldn't be more appreciative of such a kind endorsement!!!  Thank you so much for using Jones ChemDry."}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "108889935638278766823", "name": "Joanne Luther", "time": 1505498056552, "rating": 5.0, "text": "This was the best rug cleaning service that I have ever used. They were able to clean an oriental rug that I thought was ruined to \"like new\" condition.", "pics": null, "resp": {"time": 1505501295185, "text": "Thank you Joanne!  We appreciate your kind words.  It was a pleasure working with you and Dr. Luther."}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "103654149173840987719", "name": "Gail Doss", "time": 1491498160623, "rating": 5.0, "text": "I have used ChemDry twice recently and have been very pleased with this company. They are professional, courteous and thorough. Every item I ask to be cleaned, rugs, cushions or furniture, is cleaned and restored to almost mint condition. Clint removed tar and paint from carpet and furniture that I thought could never be removed.\nI highly recommend ChemDry.", "pics": null, "resp": {"time": 1491501204492, "text": "Thank you for kind words Gail!  It has been a pleasure to work with you and we look forward to helping you maintain a healthy home!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "106612074481299870156", "name": "Kimberly Watkins", "time": 1531934583609, "rating": 5.0, "text": "Enjoyed pur experience, couches look and smell great!   Extremely personable!", "pics": null, "resp": {"time": 1531935979669, "text": "We appreciate the kind words Kim!  I really enjoyed talking with Mike!   Welcome to the Jones ChemDry Tribe!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "102100824430563614411", "name": "Penny Isom", "time": 1502995542541, "rating": 5.0, "text": "What an amazing cleaning service!!!  Clint has more than once brought our old berber carpet back to fresh and clean.  He even has removed some unfortunate pet stains made by our scottie.  Great cleaning with friendly service every time!", "pics": null, "resp": {"time": 1503082345912, "text": "Thank you Penny for the awesome review.  We are glad we can help you keep your home looking and smelling beautiful!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "116050510108220918326", "name": "Sandra Stinson", "time": 1496938282451, "rating": 5.0, "text": "Excellent service!  All expectations are always exceeded!  Would definitely recommend to friends!", "pics": null, "resp": {"time": 1496939472914, "text": "Thank you Sandra!  We appreciate the opportunity to maintain your carpets!  You and Gary are always a pleasure to deal with!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "113495844540638481234", "name": "Dona Denham", "time": 1494959531435, "rating": 5.0, "text": "We have used Clint for several years. He always does a fantastic job and is always concerned that we have the best products for our cleaning needs.", "pics": null, "resp": {"time": 1494962382478, "text": "Thank you Dona!  We have really enjoyed getting to know you and Craig over the past several years.  It has been a pleasure taking care of your carpet, upholstery, and rug needs at both homes."}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "110798640178819766502", "name": "Shermon Roberts", "time": 1492195565056, "rating": 5.0, "text": "Great job cleaning carpet in our motorhome!!!", "pics": null, "resp": {"time": 1492201743226, "text": "Thanks Mr. and Mrs. Roberts.  I really enjoyed spending time with the both of you."}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "108485821065088644980", "name": "Paige Kennamer", "time": 1544118055233, "rating": 5.0, "text": "Great job on cleaning carpets.", "pics": null, "resp": {"time": 1544157779911, "text": "Thank you Paige!  We appreciate your feedback and welcome to the Jones ChemDry Tribe!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "110632369611194942708", "name": "Jacob Paul Bright", "time": 1496503199015, "rating": 5.0, "text": "Excellent job!!!  Thank you for the great service!", "pics": null, "resp": {"time": 1496505045893, "text": "Thanks Jacob!  We appreciate you trusting us with your rugs!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "108834496928110763468", "name": "Rachael Massey", "time": 1559238566749, "rating": 5.0, "text": "Jones Chem dry was an absolute pleasure to deal with!!", "pics": null, "resp": {"time": 1559246122363, "text": "Thank you Rachael, it was our pleasure to serve you.  Welcome to the JONES CHEM-DRY TRIBE!!!"}, "gmap_id": "0x8889e44fafdcb35d:0x9c6a5c70eeceeee1"}
{"user_id": "115235498778975886585", "name": "Zain Khokhar", "time": 1600458947960, "rating": 5.0, "text": "I called Pro Steam a family ran business here in Lagrange GA , i cannot express how happy and ecstatic i am after the results. The funniest thing is Cam came in and was skeptical about certain stains , i almost thought about telling him forget it  i'll replace the entire carpeting. He took his time started in the furthest room soaked the carpet with their top of the line cleaning solution , he then worked his way down to the house. The result just simply amazing. These guys are professionals and worth every penny. Cam thank you for the two spot treatments on the house. Keep up the quality work guys.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOwnesjIon3Gs_5oUh1yl1QzXkw1JgcLR9I5Umf=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMFiF6Jb-nA4DuhJwX8uZLDcFe7x40odRz7BGMK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPRh35jZlcoOt0OxO0b0fff7JdpRjVvkUfVo7mg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOwisbyavs7pSVC8aA11vPSSwEnJvqjMimFA1FT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPldHcNsI8PnWcMMsw2uqCMI7--tCdXKwK2n-x1=w150-h150-k-no-p"]}], "resp": {"time": 1600467876293, "text": "Zain, thank you so much for your business and your review of our carpet cleaning services.  We appreciate you and thank you for the kind words regarding Cam....we will be sure to pass them along to him.  Call us anytime you need us."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "107060229897086419266", "name": "J Norton", "time": 1612900430479, "rating": 5.0, "text": "Great job cleaning some high traffic carpet. Professional, on time, and courteous. They were very responsive on the phone. Definitely give them a call when it’s time to clean your carpets.", "pics": null, "resp": {"time": 1612907035408, "text": "Jonathan, thanks so much for your kind words.  We appreciate your business.  Any time you or a family member needs carpet cleaning in LaGrange, GA please feel free to send them our way.  We will take care of them.  Have a great week."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "116410765854679274528", "name": "John McKinney", "time": 1606154195608, "rating": 5.0, "text": "Very friendly and professional. Arrived on time. Went right to work. Very thorough cleaning. Carpets look brand new. I don't want to put my furniture back! Just want to show off my carpet!!!", "pics": null, "resp": {"time": 1606159019920, "text": "John, thanks so much for your business!  We are happy you are delighted and satisfied with your carpet cleaning.  Give us a call anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "107732784514128291245", "name": "Stacy Strain", "time": 1601410021565, "rating": 1.0, "text": "We hired them for one couch, one chair, and carpet in a vacant new house. Couldn't be easier. House only one year old. Rep on phone was not polite and not accomodating. When we arrived back after he completed work, there was zero change in the way the carpet looked, we found pins on surface of carpet that a good technician would have found. zero evidence of any cleaning. Called company back. Asked for another rep to come back and they said original rep had to. Company CONTRACTS for their work. Never recommend and never use again.\n\n****ADDITIONS OR RESPONSES after owner response. The Rep referred to was not your wife, but the \"contractor\" that he said he was doing our carpet. Your wife (or person who scheduled our cleaning) WAS friendly on the phone. If you do not use contractors perhaps the \"technician (rep)\" shouldn't tell us that.  The stains and lackluster was noticed BEFORE we put any furniture back into the home. Plus, the guy who did the cleaning REQUIRED that we pay prior to the work and to him not the office. Not used to paying prior to work and wont again. Nothing I have said is intentionally false or misleading.  Still highly disappointed in work and don't believe in luck but do thank you for the intended kind ending comment.", "pics": null, "resp": {"time": 1601404614366, "text": "UPDATED 10-1-20 after another false claim by Stacy. For anyone reading this....please visit our about us page on our website...https://www.goprosteam.com/about-us/   as you can see Cams' picture and bio are listed and have been on our website for years. Stacy, this is tiring to say the least.  Let me fill you in on a little nugget of information...the technician is not only our employee he is my stepson, so I think we know a thing or two that goes on in our company.  I mean for goodness sake Stacy...we have company vans with our logo, company name, address and phone number plastered all over it with an expensive van wrap...do you think any company is gonna let a \"contractor\" drive their company vans?  They are not, so again, either you are confused or making this stuff up for whatever reason you have...not sure...maybe you are just having a bad week...still no reason to dump all over us. The reason you were required to pay upfront is because both you and your husband were leaving the house, this is company policy..otherwise if a customer stays they pay after work is completed.  Also...if Cam left a busines card with our logo all over it, it says his title \"OPERATIONS MANAGER\".  We have already asked Cam about his experience with you, as a matter of fact the only communication he had with you was on the phone when he called to ask a few directions to your home while he was on the way...you were not even there when the cleaning intially started, your husband was...so no Cam has no reason to tell you he is a contractor.  By the way....you did not pay Cam, he carries a credit card reader that is mobile, you were charged by my company...would you like to see a copy of the receipt?  Ive been more than nice to you over this but you keep making false claims.  Again I appreciate your business but please stop this...it is making you look foolish.  Once again we wish you all the luck in your new home.\n\nHi Stacy.  This is Matt Lowery, co owner and founder of Pro Steam Carpet Care.  First let me say it is unfortunate that you feel the need to leave such a false review of our company.  Secondly here is the url to our about us page on our website  https://www.goprosteam.com/about-us/  as you can see it has Cams' bio on there and states he is our OPERATIONS MANAGER, not a contractor so let me clear some things up for you.  Firstly...the \"rep\" on the phone is my wife and gets compliments daily on how helpful, resourceful, nice and educated she is, the \"rep\" that cleaned your carpet and furniture is an employee and has been employed with us for 8 years with zero complaints, only praised because he cares.  We are a family owned business and have been for 30 years.  Secondly...you claim we \"contract\"  for our work....sorry but that is false and misleading.  We do not use contractors..we use employees.  We refused to send a different technician because your husband called us approx 4 days after the job was completed and after you had moved in due to a \"stain\" reappearing.  We were more than happy to reservice your carpet at no charge but the technician who originally cleaned your carpet was already familiar with your carpet and had absolutely no problem in returning to satisfy you....I found it odd that your husband called back and canceled the reservice of your carpets.   We do have before and after pics of your furniture, they are like night and day and cleaned up perfectly.  If I am able to post the pics to this response I will.  I do however have a suspicion that since we performed the carpet cleaning BEFORE you moved in that during your moving process there was probably some soiling that occured....this is common, however it is still unfortunate you feel the need to leave a 1 star review.  We agreed to return to reservice your area and you refused.  We are a good, generous and honest company with many certifications and one of the only firms that is insured in the area.  We appreciate your business and wish you luck with your new home."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "110179582224433714793", "name": "SharBerry TV", "time": 1523562499119, "rating": 5.0, "text": "I’m amazed at how quick Cam finished our 4 bedroom home! The carpet looks almost brand new the pictures does no justice", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPKg8WaiiWpNPTxwUlOReDQo-r2urb0GZS77wPM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO5Msn39c8ce7WfMMBZfsF9S3Dw7SpCUbgOTyJ2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMR4mmRslz7iqOglQ2qIfUZdBzdeajtaTwqN009=w150-h150-k-no-p"]}], "resp": {"time": 1523637920548, "text": "Sharlene, thank you for calling Pro Steam Carpet Care to take care of your carpeting.  We appreciate your patronage and please call us anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "110172725975259036400", "name": "Sharatha Dozier", "time": 1622007994928, "rating": 5.0, "text": "Always does an awesome job!", "pics": null, "resp": {"time": 1622152241255, "text": "Sharatha, thank you for your business and the kind words.  We really appreciate you calling Pro Steam Carpet Care to take care of the carpet cleaning for you.  Anytime you need carpet cleaning in LaGrange GA or surrounding areas please give us a call."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "108319400340182604436", "name": "kim massey", "time": 1597330280639, "rating": 5.0, "text": "Pro Team is awesome!  I foster animals for military members deployed or in transition...five dogs and a cat currently...have my carpets cleaned every two months and always excellent outcomes.  Use them once and you will be a return customer!", "pics": null, "resp": {"time": 1597388868879, "text": "Kim, thank you for your repeated business with Pro Steam Carpet Care.  And also thank you for all you do to help our military service members with your pet fostering.  Give us a call anytime you need us."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "106242202616195761215", "name": "Emily Garner", "time": 1579367219729, "rating": 5.0, "text": "I submitted a request late at night. The next day before 8:30 am I received a call, scheduled an appointment for Saturday between 10:00 am and 10:30 am. Cam was on time, very nice, identified himself and got right to work. My couch looks brand new. He was very nice and informative. Will definitely use this company again. Thank you so much!!", "pics": null, "resp": {"time": 1579405379805, "text": "Emily, thank you for choosing Pro Steam Carpet Care for your furniture cleaning needs in LaGrange GA.  We appreciate you as a client.  Give us a call anytime in the future."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "104237541694799385569", "name": "Helen Hudgins", "time": 1581782885121, "rating": 5.0, "text": "When I spoke to Ali, she was amazing and expedient. Cam got here right on time and pleasant and even helped me get the rug outside. My cream colored rug is cream colored again. I will definitely use them again and highly recommend them.", "pics": null, "resp": {"time": 1581911969077, "text": "Helen, thank you for calling Pro Steam Carpet Care to take care of your area rug cleaning.  We appreciate your business and your review!  Please call us anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "105158916608847547323", "name": "Hannah Sarkodie", "time": 1579485439273, "rating": 5.0, "text": "Matt and Cam did an awesome job on our carpets! They were very professional and thorough. I highly recommend! Thank you for the great service and value!", "pics": null, "resp": {"time": 1579553906749, "text": "Hannah, Thank you so much for your business and review.  It was a pleasure to serve you with your carpet cleaning needs.  Please contact us again if you need anything."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "103300723598342516681", "name": "Adrienne G", "time": 1601573318519, "rating": 5.0, "text": "I have pets, 2 dogs to be exact.  I had friends stuck at my house during the height of COVID-19 with their 2 dogs.  Four animals in an 1100 sqft house for 7 months.  You get the picture.  Guest just left last month and I am still trying to clean up after all have left.  So I decided to refinance my house.  Then I received a call that my home needed an appraisal for my refinance.  Ok, no big deal, except the appraiser would be here in 1 week.  I needed my carpets cleaned FAST.  Panic set in when ALL my normal carpet cleaners in Newnan were unavailable until after appraisal date.  So, I searched for companies in LaGrange and read the reviews.\nPro Steam seemed like the best option.  I called and Ali was able to get me on their schedule same week.   Price was affordable, in my budget and primarily fit my time constraints.  Cam arrived on time, went over the house and was very thorough.   I really appreciated how quick Ali was able to get me scheduled due to extremely tight timeline. I was amazed that the products they used smelled refreshing AND DID NOT bother my sinuses at all!!!   That is saying something because glass cleaner will make my nose burn.  My carpets look like new, all the little \"oops\" stops are gone, house smells AMAZING.   Cam was here about 2 hours and I was able to continue working while my carpets were cleaned, even had a few calls and no issues at all with noise.\nSo, if you are looking for carpet cleaners, this local owned company is AWESOME!!!  Thanks, Adrienne G.", "pics": null, "resp": {"time": 1601574806591, "text": "Adrienne, thank you so much for your business.  We are glad you are happy and delighted with the cleaning and we were able to accommodate your time frame.  Give us a call anytime you need anything, we appreciate you."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "112344218101917592674", "name": "justin robertson", "time": 1592258644059, "rating": 5.0, "text": "Great service! Quick response and got in and got the job done! Would recommend for anyone needing their capert to look brand new again!", "pics": null, "resp": {"time": 1592270058573, "text": "Justin, thanks so much for your business.  We strive to be the best and most thorough carpet cleaning company in Lagrange, Ga.  Call us anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "105521923569353767240", "name": "Christine Mullikin", "time": 1580568141056, "rating": 5.0, "text": "Extremely pleased we chose to use this company. We are preparing to sell our home and thought it would be necessary to remove the carpets and replace  with new flooring.  Cam came and did such an amazing job that we are leaving the floors as is.  He saved us thousands or dollars.", "pics": null, "resp": {"time": 1580580544991, "text": "Christine, thank you for using Pro Steam Carpet Care in LaGrange Ga for your carpet cleaning needs.  It was a pleasure to serve you and we appreciate your business.  Good luck with your home sale."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "112409807579416431065", "name": "Savannah Garner", "time": 1581188241353, "rating": 5.0, "text": "They did an amazing job getting a big red stain out of my carpet! I tried everything and it didn’t come out and they got it out in a matter of minutes! Very professional I highly recommend.", "pics": null, "resp": {"time": 1581224670912, "text": "Savannah, thank you for calling Pro Steam Carpet Care in LaGrange, GA to visit your home.  We really appreciate your business.  If any of your friends, family or business colleagues need us please let us know.  Have a great weekend."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "109179997245384616017", "name": "Tonya Moore", "time": 1572265665729, "rating": 5.0, "text": "Cam was very nice and friendly! He done an excellent job in getting my carpet to look new again. Will definitely use this company again.", "pics": null, "resp": {"time": 1572276130593, "text": "Tonya, thank you so much for your review.  It was a pleasure to serve you, please call us anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "117357241552317639078", "name": "Ross and Beth Ewalt", "time": 1597349581354, "rating": 5.0, "text": "They just did a great job, the price was reasonable, I will be calling again. Thanks", "pics": null, "resp": {"time": 1597388928982, "text": "Ross and Beth, thank you for your patronage to Pro Steam Carpet Care.  We look forward to a long lasting relationship.  Give us a call anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "118393201937043455295", "name": "Lilburn Moms", "time": 1565981476886, "rating": 5.0, "text": "Pro Steam Carpet does a great job! We have used them for a couple years now. They are always knowledgeable and timely. Thank you so much for your advice and knowledge with our carpet.", "pics": null, "resp": {"time": 1565987609872, "text": "Hi, thank you so much for your business.  We highly value your comments and look forward to serving you again in the future.  Have a great weekend."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "106045045153873174691", "name": "Jessica Crews (Crews Crew)", "time": 1563300420038, "rating": 5.0, "text": "Cam was absolutely phenomenal. The office staff was amazing, everything was seamless. Made a call and they were able to get me scheduled and came within a very short time frame. The staff was professional and courteous. I could not be more pleased with the outcome! We will use them again!!!", "pics": null, "resp": {"time": 1563303778789, "text": "Jessica, thank you so much for your business and letting us take care of your carpet cleaning needs.  Give us a call anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "111043624741423474321", "name": "Felicia Thomas", "time": 1558204571335, "rating": 5.0, "text": "Cam came out to my home on time and provided prompt and professional service. All my bedroom carpets were thoroughly cleaned!! I’m satisfied with the service of Pro Steam Carpet Care and will use them again.", "pics": null, "resp": {"time": 1558483861849, "text": "Felicia, thank you so much for your business and kind words regarding your experience with our company.  Give us a call anytime we can help."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "117547622479404216632", "name": "Ce Thomas 3", "time": 1616607076246, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1616615210885, "text": "Ce, thank you so much for using Pro Steam Carpet Care in LaGrange GA for your carpet cleaning needs.  We appreciate your business.  Please call us again when you need us."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "105885827875492757703", "name": "Monique Jones", "time": 1554303964599, "rating": 5.0, "text": "Awesome service! I was able to book an appointment for the next day at an awesome price and the turn around for dry time is within just a few hours! =D", "pics": null, "resp": {"time": 1554311726089, "text": "Monique, thank you for your business.  We appreciate your patronage.  Please call us again when you need your carpet or furnishings cleaned."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "115232367320227158972", "name": "Candy McGee", "time": 1564246198815, "rating": 5.0, "text": "Very friendly service from the initial phone call to the very end. Cam was on time, friendly and efficient! Great job!", "pics": null, "resp": {"time": 1564425238835, "text": "Candy, thank you so much for call Pro Steam Carpet Care to take care of your floor coverings.  Give us a call anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "100621509090806808271", "name": "Kendal Bergroschtje", "time": 1532102645526, "rating": 5.0, "text": "Ali took my initial phone call and we extremely courteous and informative regarding my particular cleaning needs. Cameron arrived right on time at the beginning of my scheduled window and did a GREAT job with everything! VERY happy with Pro Steam Carpet Care and will definitely use their services again in future.", "pics": null, "resp": {"time": 1532120562105, "text": "Kendal, thank you for your business.  Your complete satisfaction is our goal.  Give us a call anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "115065024809767661504", "name": "Heather Grimes", "time": 1535654053412, "rating": 5.0, "text": "Cam was absolutely wonderful. Called them because another company didn't show up. They got me taken care of same day.. Could not be more pleased. Thank you for helping me out in such short notice. Great company!!!", "pics": null, "resp": {"time": 1535656488084, "text": "Heather, thanks so much for calling Pro Steam Carpet Care today!  It was our pleasure to serve you.  Give us a call anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "107060257075725481894", "name": "Gage Eller", "time": 1548523169156, "rating": 5.0, "text": "Cam was incredible. Arrived early to the appointment and did a fantastic job. Would absolutely go with Pro Steam Carpet Care again. Quality business!", "pics": null, "resp": {"time": 1548527323822, "text": "Gage, thank you for your business.  We are happy to have you as a client, call us anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "113016483191057439579", "name": "M. P.", "time": 1548260165745, "rating": 5.0, "text": "Excellent service! Cam, was right in time, professional, explained process and the price is very competitive! I recommend this company! :-)", "pics": null, "resp": {"time": 1548262928718, "text": "Michele, Thank you so much for your business.  We look forward to serving you again."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "110990264965416066369", "name": "Stephanie Martin", "time": 1510952429117, "rating": 5.0, "text": "Pro steam did an amazing job cleaning our carpet the carpets smell super clean and look amazing. Super professional nice informative. Ali is awesome to deal with family company will definitely be using them in the future.", "pics": null, "resp": {"time": 1511122170802, "text": "Thank you so much Stephanie...good luck with your move and please feel free to call us in the future."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "110180742997071614498", "name": "Dudley Langford", "time": 1540317068038, "rating": 5.0, "text": "These guys did a really good  job and I didn't have any problems from them.\nExtremely nice and very informative about everything.\nDefinitely gonna use them again in the future 👌", "pics": null, "resp": {"time": 1540339431947, "text": "Dudley, thanks so much for your review and your business.  Please call us anytime we can be of service."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "108023196466515113514", "name": "Jamila Brown", "time": 1510345687253, "rating": 5.0, "text": "What an awesome job we received from the guys at Pro Steam Carpet care. They did a fantastic job cleaning the carpet in our home. It looks brand new again and simply smells incredible. Thanks for the wonderful job and look from a call from us again! :-)", "pics": null, "resp": {"time": 1510606753454, "text": "Thank you so much Jamila for calling Pro Steam Carpet Care.  We look forward to serving you again."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "102717051475443907670", "name": "Al Hairston", "time": 1561057751523, "rating": 5.0, "text": "Prosteam carpet care was on time,\ndid a outstanding job will recommend to all my family and friends. Great job", "pics": null, "resp": {"time": 1561497577724, "text": "Al, thanks so much for your business, we really appreciate it!  Give us a call anytime we can help with your carpet cleaning needs."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "117283372250461877457", "name": "Rob Chavous", "time": 1507922293876, "rating": 5.0, "text": "Pro Steam cleaned my carpets this morning and did an excellent job. They were on time, polite and efficient.  In under 2 hours they cleaned my entire upstairs and treated several pet stains. The carpet looks and smells great.  I am very pleased with their work and would use them again!", "pics": null, "resp": {"time": 1507929855986, "text": "Thank you so much for calling us to take care of your carpet cleaning needs.  Please call us anytime you need anything, we appreciate you."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "117798192963648035360", "name": "Augusto Rodriguez", "time": 1536244533172, "rating": 5.0, "text": "Cam called 30 min ahead to let me know his arrival time.  He saved me money by letting me know options to get the carpet looking like new.  He completed the job in one hour and gave me instructions on how to maintain humidty conditions to allow fast drying. The carpet looks brand new. I plan to use this company again.", "pics": null, "resp": {"time": 1536250020134, "text": "Augusto, thank you so much for your review.  We appreciate your business, please call us anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "100406756300231479214", "name": "Nikki Rodgers", "time": 1575658957397, "rating": 5.0, "text": "Great job. Will definitely use again.", "pics": null, "resp": {"time": 1575666273210, "text": "Thanks so much for your kind words Nikki.  Please give us a call anytime!"}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "117998661456483296551", "name": "Jon Matz", "time": 1540935209721, "rating": 5.0, "text": "Pro Steam did a great job! Very professional service with quality results. I recommend anyone who needs a great carpet cleaning solution!", "pics": null, "resp": {"time": 1540954870766, "text": "Jon, thank you for trusting your carpet cleaning needs to Pro Steam Carpet Care.  We truly appreciate your business.  Give us a call anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "116776489572899384752", "name": "Benny Bischoff", "time": 1517258089666, "rating": 5.0, "text": "Matt and Cam did a great job cleaning our carpets. They arrived on time, worked quickly and took the time to explain some of the special treatments they did. Overall, the whole experience with Prosteam was easy and convenient. I really enjoyed it!", "pics": null, "resp": {"time": 1517262265753, "text": "Thanks so much Benny.  Please call us anytime you need us."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "117551085171156282989", "name": "Max Gay", "time": 1579281968943, "rating": 5.0, "text": "Professional results .\nNo HeeHaw !", "pics": null, "resp": {"time": 1579288948309, "text": "Thank you for choosing Pro Steam Carpet Care for your carpet and floor cleaning needs in LaGrange GA Max.  We appreciate your business, give us a call if you need anything in the future."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "114119363631883089664", "name": "Terra Jeffery", "time": 1521231288014, "rating": 5.0, "text": "The guys always do a great job. Very satisfied! Also, the lady that answers the phone is so sweet 🙂", "pics": null, "resp": {"time": 1521231583146, "text": "Terra, thanks so much for your continued business.  We will always do our best for you."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "114334026295384331318", "name": "Denise Melville", "time": 1489588691371, "rating": 5.0, "text": "The gentlemen that came to the house were thorough, extremely professional and quite informative on carpet cleaning chemicals that are harmful to the fabric. The carpet looks great above all else!!! We will definitely be calling Pro Steam Carpet Care again.Thanks fellas!", "pics": null, "resp": {"time": 1489889673738, "text": "Denise, thanks so much for your business.  We truly appreciate it.  We look forward to serving you again and for years to come."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "117826119260832974668", "name": "Kempton Harris", "time": 1520026760045, "rating": 5.0, "text": "Extremely professional company. My technician was easy going, yet diligent and detail focused with his work. I’d definitely recommend Pro Steam Carpet Care to anyone looking to have their carpets professionally cleaned, and the price didn’t brake the bank! Once again, if you’re in the market for a carpet cleaning, make sure you highly consider Pro Steam Carpet Care. You won’t be sorry!", "pics": null, "resp": {"time": 1520028238955, "text": "Thanks so much Kempton.  We appreciate you as a client.  Good luck with your move."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "116120492195760867446", "name": "Malissa Brown", "time": 1488658009057, "rating": 5.0, "text": "Matt and his partner were very friendly and very thorough.  They did an excellent job and I highly recommend then to everyone!  They did a good of a job if not better than Stanley Steemer. Give them a try!", "pics": null, "resp": {"time": 1488699209903, "text": "Malissa, Thank you so much for calling on Pro Steam Carpet Care.  We appreciate your business and look forward to serving you again.  Please call us anytime you need us."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "101696103024561926533", "name": "Bob Patton", "time": 1489503521445, "rating": 5.0, "text": "These guys are the BEST. Arrived on time, went straight to work, cleaned and deodorized three rooms and hall with 9 steps in one hour.Packed up their equipment and left.  Happy to have them and recommend them highly.  Don't forget to tip them, they're worth it. Thanks guys.", "pics": null, "resp": {"time": 1489525905604, "text": "Bob, thank you very much for being our client.  We appreciate your patronage, please feel free to call us anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "117002592445720603750", "name": "Christy Mitchell", "time": 1491584427607, "rating": 5.0, "text": "These guys were awesome!!!  Not only did they make my 25 year old carpet look and smell GREAT, they were on time and very professional.  These guys know what they are doing.  I will definitely use them again.", "pics": null, "resp": {"time": 1491601034354, "text": "Thanks so much for your business Christy.  We look forward to serving you again.  Please let us know if you ever need anything."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "116570310525797283543", "name": "Nisha87", "time": 1488925283381, "rating": 5.0, "text": "Matt and team did a great job on my carpets! I will be scheduling them soon to clean my tile and grout in my kitchen. Thanks guys!", "pics": null, "resp": {"time": 1489013809599, "text": "Thank you so much for calling Pro Steam Carpet Care.  We look forward to serving you again."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "106219762617766169311", "name": "Irene Nielson", "time": 1548957639635, "rating": 5.0, "text": "Excellent service. Went above and beyond in cleaning our tile and grout. Would recommend them to everyone.", "pics": null, "resp": {"time": 1549136224150, "text": "Irene, thank you so much for your business.  We appreciate your patronage, give us a call anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "118245472353157280382", "name": "Britney Alcala", "time": 1510608150233, "rating": 5.0, "text": "Matt and crew did a great job, very professional and our carpet has never  been cleaner. Will definitely use them again!", "pics": null, "resp": {"time": 1510610660561, "text": "Thanks so much for the kind words Britney.  Give us a call anytime, we look forward to serving you again."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "108402291932849081411", "name": "Jamie Colliver", "time": 1507913953126, "rating": 5.0, "text": "Great company.  Showed up right on time, Cameron and Matt were super professional and I could tell they paid attention to detail more so then carpet cleaners I have used in the passed!  Will be using them again!!", "pics": null, "resp": {"time": 1507929793949, "text": "Thank you so much for your business Jamie.  Give us a call anytime you need anything, we appreciate you and your family."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "113711546489997539775", "name": "Cam Alexander", "time": 1487369298523, "rating": 5.0, "text": "These guys are awesome, very professional and the carpet looks great! I would definitely recommend them to anyone wanting their carpets clean professionally cleaned.", "pics": null, "resp": {"time": 1487374032213, "text": "Thank you so much for allowing us into your home to take care of your carpet cleaning needs.  We appreciate you as a client, please feel free to give us a call at anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "118360600597256971098", "name": "Kelly Lewis", "time": 1489164669601, "rating": 5.0, "text": "Had a great experience with this company! Very professional, friendly, and fast! My carpet looks brand new! Will definitely use them again.", "pics": null, "resp": {"time": 1489256276706, "text": "Thanks so much for the kind words Kelly.  We look forward to serving you for many many years."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "103532612669561752128", "name": "Paula Cree", "time": 1495021810589, "rating": 5.0, "text": "Great experience with both making the appointment and the actual carpet cleaning. Very professional people who are timely and educate you about pre-treating and treating urine stains. Thank you for your professionalism.", "pics": null, "resp": {"time": 1495051853386, "text": "Thank you for your business Paula.  We appreciate your patronage!  Call us any time."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "111197699162821023533", "name": "Cher Wilcox", "time": 1530374510854, "rating": 5.0, "text": "Cam arrived on time in a marked vehicle and logo'd shirt. He treated our carpet for pet stains and did a fantastic job! It looks brand new!! We will be using them again! Thanks!!", "pics": null, "resp": {"time": 1530569916696, "text": "Cher, thank you for your business.  We appreciate your patronage, we look forward to serving you again and for many years to come."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "105608974102537076728", "name": "Bobby Sharma", "time": 1502818009773, "rating": 5.0, "text": "I will definitely recommend Pro Steam Carpet cleaning to anyone. Both Matt and Cam arrived on time for the appointment and did a fantastic job!!! Will do business again.", "pics": null, "resp": {"time": 1502850358794, "text": "Thank you so much for inviting us into your home.  We value and appreciate your patronage.  Let us know if you ever need anything."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "112002568766237970728", "name": "cupcake41 ticktok", "time": 1488553090509, "rating": 5.0, "text": "My service was wonderful, they were on time efficient, helpful, friendly, professional and skilled. I will definitely call them back in 6 months. Ps they did not try to sale me a bunch of stuff I didn't need.", "pics": null, "resp": {"time": 1488699109067, "text": "Shaun, thank you so much for calling us to take care of your carpet cleaning needs.  Please give us a call anytime we can be of service."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "105936440848679481786", "name": "Chelsea Bowen", "time": 1534521364387, "rating": 5.0, "text": "Great service! Carpets look great and Cam was awesome! Quick and effiecent!", "pics": null, "resp": {"time": 1534537733935, "text": "Thanks so much for your business Chelsea.  Give us a call anytime we can help with your carpets, furniture or tile cleaning."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "108563170955826752037", "name": "Amy Xydias", "time": 1527796427578, "rating": 5.0, "text": "They did a great job on general cleaning and spot stain removal.  Excellent response and very professional!", "pics": null, "resp": {"time": 1527874197331, "text": "Amy, thank you so much for calling us to take care of your carpet cleaning needs.  We appreciate you as a client and please call us anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "103209318900980529305", "name": "Luis Torres", "time": 1544039066172, "rating": 5.0, "text": "They arrived on time as scheduled and did a great job as expected", "pics": null, "resp": {"time": 1544040281997, "text": "Thank you for calling Pro Steam Carpet Care to take care of your cleaning needs.  We appreciate your business.  Please call us anytime and have a wonderful holiday season."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "116375349907177681703", "name": "Julie Jenings", "time": 1526662258939, "rating": 5.0, "text": "Amazing transformation, these folks are the ones I call for all of my carpet cleaning needs!", "pics": null, "resp": {"time": 1526670359711, "text": "Hi Julie, thank you for your business.  We know you have many options when choosing a company to take care of your carpet cleaning needs and we really appreciate you calling us.  Give us a call anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "114661905337118964886", "name": "DNA Home Services LLC", "time": 1522348860821, "rating": 5.0, "text": "Cam arrived early, very profesional, gave us lots of info pre and post service. awesome job. keep it up", "pics": null, "resp": {"time": 1522352017578, "text": "Thank you so much for calling Pro Steam Carpet Care for your carpet cleaning needs.  Give us a call anytime we can help."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "105534471088158428589", "name": "Marisa Berberena", "time": 1527197964536, "rating": 5.0, "text": "Prosteam was able to give me a Saturday afternoon appointment. Cameron was scheduled to come out from 1-2, and arrived around 1:10.  He started promptly, and cleaned 4 rooms, the walk in closet, and a hallway (included for free by the way) in about 45 minutes. He did an amazing job too! The price was as quoted. The rates are posted as is on the website, my calculations lined up just with theirs, and there was no hidden cost. We will definitely use Prosteam again!", "pics": null, "resp": {"time": 1527349232607, "text": "Marisa, thank you so much for doing business with Pro Steam Carpet Care.  We appreciate you as a client.  Please give us a call anytime you need us."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "104326667195989561087", "name": "Te-Shandra Haskett", "time": 1509223674763, "rating": 5.0, "text": "Great service - HUGE difference in the carpet. Wonderful service! Really appreciate the service!!", "pics": null, "resp": {"time": 1509401560757, "text": "Thank you so much for the review.  Please call us anytime, we appreciate you."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "106945345990334570697", "name": "Alex Dickinson", "time": 1509204320796, "rating": 5.0, "text": "Matt and team were professional, thorough and efficient! Awesome job! Thanks again!", "pics": null, "resp": {"time": 1509401601431, "text": "Thanks Alex. Give us a call anytime.  Good luck with your move."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "111800665980226022761", "name": "Tate Chesser", "time": 1524768755426, "rating": 5.0, "text": "Great job! Technician Cameron is great to deal with.", "pics": null, "resp": {"time": 1524779923831, "text": "Tate, thank you so much for calling Pro Steam Carpet Care to take care of your carpet cleaning needs.  We appreciate your business.  Please call or reach out to us anytime we can help."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "101311773421978006596", "name": "Vickie De Leon", "time": 1505753329434, "rating": 5.0, "text": "Matt and Cameron did a great job. Thanks so much!", "pics": null, "resp": {"time": 1505754416297, "text": "Thank you so much for the opportunity to serve you Vickie. Please call us anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "113821438214700699414", "name": "Gina Han", "time": 1526482771615, "rating": 5.0, "text": "This guys are so awesome.  Highly recommended:)", "pics": null, "resp": {"time": 1526590302213, "text": "Gina, thank you so much for calling us to take care of your carpet cleaning needs.  Please give us a call again anytime you need us.  We are here for you."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "102482942211138169133", "name": "Steven Challinger", "time": 1520955019034, "rating": 5.0, "text": "Quick, efficient and professional carpet cleaning service. I strongly recommend Pro Steam Carpet Care in the Gwinnett area", "pics": null, "resp": {"time": 1520967324060, "text": "Thank you for your patronage Steven.  We are very happy to hear you are a happy and satisfied client.  Give us a call anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "107511422964039378027", "name": "Brian McLeod", "time": 1535727998082, "rating": 5.0, "text": "Arrived on time.  Cleaned carpet well. Good service.  No hidden fees.", "pics": null, "resp": {"time": 1535755647027, "text": "Brian, thank you so much for trusting your carpet care and cleaning to Pro Steam Carpet Care.  We appreciate your business and look forward to serving you again in the future.  Have a wonderful and safe Labor Day weekend."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "102513804759909325222", "name": "Crystal Bellew", "time": 1491666196672, "rating": 5.0, "text": "Great experience! Fast and professional. My carpet looks brand new.", "pics": null, "resp": {"time": 1491713785202, "text": "Crystal, thank you so much for letting us serve your families carpet care needs.  We appreciate your patronage.  Please call us anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "102988804983164156261", "name": "Kim Jenkins", "time": 1498590034676, "rating": 5.0, "text": "Matthew and Cam did an excellent job.  Would definitely use them again.", "pics": null, "resp": {"time": 1498602005309, "text": "Thank you so much Kim.  Please let us know how we can be of service to you in the future, we look forward to serving you again."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "115043241200777000260", "name": "Senia Robinson", "time": 1488393017744, "rating": 5.0, "text": "I was so impressed with the carpet cleaning job ProSteam did... excellent job  Thank u so much", "pics": null, "resp": {"time": 1488408776405, "text": "Thank you Senia, it was a pleasure to serve you.  Please call us anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "114937041991608750760", "name": "Karen Lewis", "time": 1526569645861, "rating": 5.0, "text": "Fast scheduling AND cleaning time, courteous, outstanding work.", "pics": null, "resp": {"time": 1526590365702, "text": "Hi Karen, we really appreciate your business.  Whatever carpet, upholstery and rug cleaning you need we will take care of it for you."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "105822469189535989734", "name": "Steve Oexmann", "time": 1520881539033, "rating": 5.0, "text": "On time and finished in the amount estimated.  Will definitely use again!", "pics": null, "resp": {"time": 1520884280743, "text": "Thank you so much for your business.  We look forward to serving you again in the future.  Call us anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "103077111179395964642", "name": "Jennifer Knight", "time": 1492792509757, "rating": 5.0, "text": "Arrived on time. Very nice and professional. Will use again in the future!", "pics": null, "resp": {"time": 1492804271272, "text": "Thank you for allowing Pro Steam Carpet Care to serve you.  Give us a call anytime, we appreciate you."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "113974726588506098395", "name": "Miriam Duynhouwer", "time": 1493487019726, "rating": 5.0, "text": "This is a company that you should hire to clean your carpet in your home or office, the gentlemen are very professional, they did a great job!", "pics": null, "resp": {"time": 1493666582054, "text": "Thank you so much for your kind words Mia.  We strive to be on time and highly value our clients.  Please call us anytime you need us. It was a pleasure to serve you."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "107378503175669074184", "name": "Marie DeLong", "time": 1488212463412, "rating": 5.0, "text": "Professional, on time, courteous and great job! Highly recommend them.", "pics": null, "resp": {"time": 1488408881344, "text": "Thank you Marie.  We appreciate your business and look forward to serving you again."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "117474358233392362553", "name": "Ryan Leifson", "time": 1496149681638, "rating": 5.0, "text": "great price, arrived on time, carpets turned out great!  Would definitely recommend and use again in the future.", "pics": null, "resp": {"time": 1496175682226, "text": "Ryan, thanks so much for your review and your business.  We look forward to serving you again."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "100145934713423819309", "name": "Charmaine Mcclendon", "time": 1489601445389, "rating": 5.0, "text": "Matt and Cam did an outstanding job I just found my new carpet cleaners BRAVO guys.", "pics": null, "resp": {"time": 1489889711948, "text": "Charmaine, we really appreciate your business.  Please let us know if you ever need anything.  We look forward to serving you again."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "116963155714037358883", "name": "Lynne Billings", "time": 1521737051842, "rating": 5.0, "text": "My technician was efficient, fast, thorough, and friendly! Great job!", "pics": null, "resp": {"time": 1521739485456, "text": "Lynne, thank you so much for calling Pro Steam Carpet Cleaning for your cleaning needs.  We appreciate you as a client, call us anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "106026563353214093253", "name": "Josh Gordon", "time": 1488566439286, "rating": 5.0, "text": "Great job. Experienced and got the stain out!", "pics": null, "resp": {"time": 1488699144239, "text": "Thanks so much Josh.  Glad we could help you out on the area rug.  Give us a call anytime we can be of service to you."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "104403840008877329860", "name": "Jay Moore", "time": 1514772841277, "rating": 5.0, "text": "My carpet looks new again! Highly recommend them.", "pics": null, "resp": {"time": 1514925984922, "text": "Jay, thanks so much for your business.  Please call us anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "116606189429474008701", "name": "Kathy Hansen", "time": 1497637128230, "rating": 5.0, "text": "Exceeded Expectations!  Prompt.  Professional. Responsive.  Honest.  Industry Experts.", "pics": null, "resp": {"time": 1497393327059, "text": "Kathy, thank you so much for calling us to take care of your carpet cleaning needs.  We appreciate it and value you as a client.  Please give us a call anytime we can be of service."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "104403840008877329860", "name": "Jay Moore", "time": 1514772841277, "rating": 5.0, "text": "My carpet looks new again! Highly recommend them.", "pics": null, "resp": {"time": 1514925984922, "text": "Jay, thanks so much for your business.  Please call us anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "108351668518145681724", "name": "Mrs Hamilton", "time": 1521127724460, "rating": 5.0, "text": "Very friendly technician. On time and finished in no time! Carpets look amazing!!!", "pics": null, "resp": {"time": 1521152149465, "text": "Mrs. Hamilton, thank you so much for your business.  We look forward to serving you again."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "106026563353214093253", "name": "Josh Gordon", "time": 1488566439286, "rating": 5.0, "text": "Great job. Experienced and got the stain out!", "pics": null, "resp": {"time": 1488699144239, "text": "Thanks so much Josh.  Glad we could help you out on the area rug.  Give us a call anytime we can be of service to you."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "102391688366074006906", "name": "Germaine Bartlett", "time": 1488221418754, "rating": 5.0, "text": "Awesome customer service and service cleaning, definitely cleaned the carpets efficiently and in a timely manner.", "pics": null, "resp": {"time": 1488408855267, "text": "Thank you Germaine.  We are very happy to have you as a client."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "108713366261032240771", "name": "Michael Fambro", "time": 1488308819050, "rating": 5.0, "text": "Matt and cam did an incredible job om my filthy carpet\nI thought I need a new carpet but they did suchave a great job for a very reasonable  price.", "pics": null, "resp": {"time": 1488408795383, "text": "Thanks so much Michael.  We look forward to serving you again."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "103836421470106546159", "name": "Jay Kinslow", "time": 1497109575119, "rating": 5.0, "text": "Very professional and reasonably priced. The carpets look new again.", "pics": null, "resp": {"time": 1497284618077, "text": "Thank you so much for calling us to serve you.  We look forward to taking care of your carpet cleaning needs in the future."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "105326561975442116867", "name": "Micaela Craig", "time": 1492790532000, "rating": 5.0, "text": "They arrive on time and were finished within a hour!! My carpet unfortunately still has a dog smell though. Still 5 stars since they got the really tough stains out.", "pics": null, "resp": {"time": 1492804221873, "text": "Thank you so much for inviting us into your home and the review.  Give us a call anytime, we appreciate your business."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "109473036295084719380", "name": "India Young", "time": 1488227248535, "rating": 5.0, "text": "Great service and it's very affordable  thank you", "pics": null, "resp": {"time": 1488408821819, "text": "Thank you India, we appreciate your patronage and look forward to serving you again."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "115854493147706793932", "name": "Sara Parker", "time": 1488400920325, "rating": 5.0, "text": "Did an excellent job!!! Pricing is affordable and hidden fees!", "pics": null, "resp": {"time": 1488408753592, "text": "Thanks so much Sara!  We are delighted to have you as a client, call us anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "117414700586137134581", "name": "John Moye", "time": 1511384008367, "rating": 5.0, "text": "Awesome Job ! I highly recommend Pro Steam Carpet Care !", "pics": null, "resp": {"time": 1511723578886, "text": "John, thank you so much for the kind words.  We appreciate your business, please call us anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "111947251286659674930", "name": "Anand Jain", "time": 1545331150924, "rating": 5.0, "text": "Great experience and very professional", "pics": null, "resp": {"time": 1545332582883, "text": "Anand, thanks so much for calling Pro Steam Carpet Care to take care of your needs.  Give us a call the next time we can take care of your carpet cleaning needs."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "107078782212790476352", "name": "Cybele Fiorello", "time": 1531338063812, "rating": 5.0, "text": "It looks great! Thank you!", "pics": null, "resp": {"time": 1531419801847, "text": "Cybele thank you so much for your business, please call us anytime you need us."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "111696635267131538930", "name": "ALLYSON BURDESHAW", "time": 1521222711533, "rating": 5.0, "text": "Very professional and an amazing job done!!  Thank you", "pics": null, "resp": {"time": 1521230989674, "text": "Allyson, thank you for your business.  We appreciate your patronage.  Give us a call anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "111501703804806693154", "name": "Ryan Strive", "time": 1503233123163, "rating": 5.0, "text": "Very professional and excellent.", "pics": null, "resp": null, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "106245761367179217974", "name": "Ivonne Coleman", "time": 1542217141180, "rating": 5.0, "text": "Received great service", "pics": null, "resp": {"time": 1542315357670, "text": "Ivonne, thank you for your business.  Please call us anytime and have a safe and joyous thanksgiving."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "107198156202713440561", "name": "Chelsey Smith", "time": 1497985576892, "rating": 5.0, "text": "Carpets look amazing!", "pics": null, "resp": {"time": 1497996870009, "text": "Thanks so much Chelsey...give us a call anytime we can be of service."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "105715231284299598634", "name": "Richard Osborne", "time": 1487444484751, "rating": 5.0, "text": "Carpet looked fantastic!!!  On time and no high pressure sales which was a relief.", "pics": null, "resp": {"time": 1487595256366, "text": "Thanks!"}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "100501254056982550587", "name": "Hamilton McLeod", "time": 1550346434484, "rating": 5.0, "text": "Prompt and professional.", "pics": null, "resp": {"time": 1550530253140, "text": "Thanks so much for your business Hamilton.  We appreciate your business.  Give us a call anytime."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "111867446762273903240", "name": "Ivan Trevino", "time": 1488917121518, "rating": 5.0, "text": "Quick and clean", "pics": null, "resp": {"time": 1489013765755, "text": "Thank you for allowing us to take care of your move out cleaning, please call us in the future, we appreciate your business."}, "gmap_id": "0x88f5952399cc1ad9:0x87abb5071354d46d"}
{"user_id": "104274184268364850840", "name": "Jerome McReynolds", "time": 1621557399677, "rating": 5.0, "text": "I was very impressed with how they first called and informed me they were running behind schedule. When they arrived , they were very professional in asking questions and giving me their opinions. I tried to assist but they told me that they had it, but thanked me anyway. The technicians ( Ben & Blake )who did my work or did my service left me as a very satisfied customer. I would recommend this company to anyone without hesitation, and thanks again technicians for the fantastic service you gave. 5 stars 👌👌", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "108256535551356686186", "name": "CM Enfield", "time": 1592836963896, "rating": 5.0, "text": "Wow! We just rented a house that needed a total move-in spring cleaning. I knew the floor grout wasn't supposed to be black, and this company worked its magic to reveal the true beige color. A different team came out to do our carpets. Both were nice and professional, and the results were money (out of our own pocket) well spent!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOMhy0VhUAHeqMBgwYxVu2lVWMqgihsghLvMCop=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "100003811449885227083", "name": "Chris Daniel", "time": 1596135804612, "rating": 5.0, "text": "Very friendly and efficient to schedule. Tech was timely and professional. The floors looked fabulous and I could see the tech took special care of areas we had discussed during the walkthrough prior t ok cleaning.  This was at a rental home and I will be using Peaches N' Clean at the home I purchased. Great work.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "108831394462764944954", "name": "Mary Evans", "time": 1598485076875, "rating": 5.0, "text": "Called and got an appointment in 1 day. Cleaned 3 pieces of furniture in a timely fashion. Got rid of odor and stains!", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "108733450443150391535", "name": "Tommy Lawrence", "time": 1603316838602, "rating": 5.0, "text": "Good folks. Cleaned the carpet in my RV. Showed up right on the scheduled time.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "109068627345393167588", "name": "Jean Maccinile", "time": 1595614394875, "rating": 5.0, "text": "Got here when they said they would, cleaned carpets did an excellent job will  use again.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "107978750137499308434", "name": "christina novello", "time": 1589983844910, "rating": 5.0, "text": "Wow, these folks were professional and what a difference.  They got stains out of carpets and restored our tile to new. We bought a new house and the grout was black, it is white now!!\nHighly recommend  them!!", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "102059787182338555615", "name": "Mr. Dodds", "time": 1577214651949, "rating": 5.0, "text": "They did an amazing job on my floor tiles. Would definitely recommend them.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "104502209081344096589", "name": "Tolanda Beal", "time": 1579905234731, "rating": 5.0, "text": "Getting ready for our optimist District meeting.   Great place!", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "115101419679977199349", "name": "Autumn Hooper", "time": 1508859709839, "rating": 5.0, "text": "Incredible job on both an area rug and very tough to clean white couch. Highly recommend for carpet and upholstery and extremely friendly to work with. You won't be disappointed!", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "107562805379525930994", "name": "Barbara Marshall", "time": 1526951637774, "rating": 5.0, "text": "They cleaned an extremely soiled, 30+ year old, expensive authenic oriental 6x9 area rug.it was in awful shape...I thought about getting rid of it.  First time it had ever been cleaned in the 30 plus years I've had it.  Purchased it in Japan.\nI'm giving them 5 stars.....they deserve 6!\nThis rug looks new......it was costly, but worth every cent!  Great customer service as well!!....", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "107850941627328347402", "name": "Eric Friese", "time": 1496412647728, "rating": 5.0, "text": "We've used Peaches and Clean to clean our couch and clean carpets. They do amazing work! The couch looked new after they finished! They are my go to for cleaning services on the Eastern Shore.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "117556634074577234849", "name": "Katelyn Mcdonnell", "time": 1566526937247, "rating": 5.0, "text": "Defintely will be using Peaches’N Clean again! They were friendly and professional and did an awesome job on my carpet!", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "117157069867296229211", "name": "Dalphne Wilson", "time": 1558439586551, "rating": 4.0, "text": "Technicians arrived early and did a terridic job. I will definitley use Peaches 'N Clean in the future and recommend them to my neighbors.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "103478072782317202725", "name": "Rozanne Robinson", "time": 1564785011688, "rating": 5.0, "text": "Great service and good food.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "106301868249650439535", "name": "Carmen DiNunzio", "time": 1535389657008, "rating": 5.0, "text": "Did a great job cleaning the floors and oriental rug at Dr. Todd Roth's office.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "110476262666472443013", "name": "Troy Wiggins", "time": 1211907619007, "rating": 5.0, "text": "I was a little apprehensive when I saw the crew (young guys), but that was quickly put to rest with the professionalism and pride that they were putting into their work.  I also forgot a few things (not having water to the house, etc.) and they were very understanding and even had their own water truck to get around this.  Will definitely use again!!", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "114448670716666360729", "name": "julian jones", "time": 1529875163114, "rating": 1.0, "text": "Horrible service. They ruined the finish on my antique dining room table by leaking fluid on it, and then argued about it when my 91 year old mother called to complain. The manager was incredibly rude when I called him to protest both the destruction of the table and his inexcusable treatment of an elderly woman. I still regret that I did not sue for the value of the table as I should have done. I complained to the Better  Business Bureau which is a joke.  The company responded by saying that the manager was a \" youth minister \" at some church and so could not possibly be the jerk that I described! HA! Avoid at all costs. I tried to give them 0 stars, but will not let me.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "106741746079189902393", "name": "Dr. Brian Pleasant", "time": 1557418796631, "rating": 5.0, "text": "The did a great job", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "103928093621604817127", "name": "Annie Bishop", "time": 1554330382472, "rating": 5.0, "text": "Always does an AWESOME job!!", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "109137129221092745491", "name": "Dick Martin", "time": 1465939572185, "rating": 1.0, "text": "Terrible, totally incompetent service.  Stretched carpet, cut it short and left carpet short of tile so tack board nails are exposed.  Complained and they did nothing.  Did not stretch carpeting is a couple of rooms because they said they couldn't; actually did not want to move any furniture. The guy talked like a expert, but don't know didly-squat about what he was doing.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "111278087079935969113", "name": "Harold Marks", "time": 1471653006505, "rating": 1.0, "text": "Yesterday, Thursday the 18th of August, I Harold marks and My fiancé Ambreshia Landrum had our carpets cleaned by them. they couldn't get all the stains out, even though we paid 140$. More importantly, coincidentally, my fiancés engagement ring disappeared after they left. Even though we can't prove they stole the ring, connect the dots for me. Be careful who you let in your house!", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "116199467977539803996", "name": "Daniel Hadden", "time": 1496330014134, "rating": 5.0, "text": "great company does good work", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "105376671315046224679", "name": "Judy Marshall", "time": 1564582388553, "rating": 3.0, "text": "To cold", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
