{"user_id": "107373578747965377165", "name": "James McCrary", "time": 1626720129291, "rating": 5.0, "text": "Very professional and detail oriented!", "pics": null, "resp": {"time": 1627425276565, "text": "Thank you for your feedback, James. Best wishes."}, "gmap_id": "0x88892324714bf263:0x39d3fc7f8e29f644"}
{"user_id": "110229001605108355798", "name": "Matt Trombley", "time": 1611841653569, "rating": 5.0, "text": "I've known the owner, Cory, for several years and I can say with complete honesty that he is a man of integrity, hard work, and resolve. What this would mean to any Footprints customer is that they would benefit from an honest estimate, timeframe for work, and commitment to see it through. I can't think of better traits for someone working on my home, and so I would highly recommend Cory to anyone looking to have a flooring project completed.", "pics": null, "resp": {"time": 1612201570763, "text": "Hello Matt, thank you for the five-star review of our flooring installation business and your incredibly kind words!"}, "gmap_id": "0x88892324714bf263:0x39d3fc7f8e29f644"}
{"user_id": "108127912775681228903", "name": "Matt Elsner", "time": 1612209368300, "rating": 5.0, "text": "I have been fortunate to work with Cory on a number of projects, and I will go out of my way to continue to work with him when I can.  Honesty and integrity are two traits that you can expect from him.", "pics": null, "resp": {"time": 1612374374237, "text": "Hello Matt, thank you for the review! We appreciate your kind words."}, "gmap_id": "0x88892324714bf263:0x39d3fc7f8e29f644"}
{"user_id": "116739485628185613042", "name": "Shelley", "time": 1623972877383, "rating": 5.0, "text": "I cannot say enough great things about Cory and his installation crew. The entire process, from start to finish, was amazing. Everything was thoroughly explained, I was kept up to date, and there were no surprise fees. The installation team far exceeded my expectations. They were very friendly, efficient and highly skilled. They cleaned up everything before they left and made sure I was happy with everything. I had put my kitchen floor project off for a long time because I can't stand having strangers working in my home as it is so stressful. This company put me at ease and I am so grateful I gave them a chance. My new floor is beautiful! If you are hesitant about having strangers in your house and need a great job at a very fair price, call Cory!", "pics": null, "resp": {"time": 1624295952281, "text": "Shelley, Thanks for the kind words! We are happy to read that our team has been able to provide exceptional service for you. As always, our team is avaible if you need anyhting else. Best wishes."}, "gmap_id": "0x88892324714bf263:0x39d3fc7f8e29f644"}
