{"user_id": "116575206214019786933", "name": "Honey 2677", "time": 1615033740571, "rating": 1.0, "text": "Service was slow. Food was terrible. We ordered four different plates. Fried calamari. Fried shrimp. Grilled shrimp. Fried crab cakes. While all was edible, only the crab cakes were excellent. I feel this was a complete waste of $85 for three people. We will not be back. Disappointed.", "pics": null, "resp": null, "gmap_id": "0x88891bc0bf400bb5:0x9584ced19a633d1b"}
{"user_id": "103359013265102997413", "name": "Kimberly Bivins", "time": 1614291635311, "rating": 3.0, "text": "The food and service was great, but we were disappointed that our water and tea had a fishy taste.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMOm7svr-z5bN34BCg1UiBWeKLVeHPQlfs28vIs=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891bc0bf400bb5:0x9584ced19a633d1b"}
{"user_id": "103462185443447188195", "name": "Nikki Ravi", "time": 1619921840718, "rating": 5.0, "text": "Only 20min wait for food. Salmon was delicious!", "pics": null, "resp": null, "gmap_id": "0x88891bc0bf400bb5:0x9584ced19a633d1b"}
{"user_id": "105334109368771087891", "name": "Rebecca Richardson", "time": 1578511004644, "rating": 4.0, "text": "My my, what a great meal at the Fish Market. Started with the salmon spread with pita chips, it had a great smokey taste. Then I had a feta greek salad with a dish of seasoned rice with fish, shrimp, clams and vegetables. The food was a joy to eat and the service was outstanding.", "pics": null, "resp": null, "gmap_id": "0x88891bc0bf400bb5:0x9584ced19a633d1b"}
{"user_id": "105269423390838979445", "name": "Betty Lewis", "time": 1579613841768, "rating": 4.0, "text": "The service what's good and the food was delicious and hot", "pics": null, "resp": null, "gmap_id": "0x88891bc0bf400bb5:0x9584ced19a633d1b"}
{"user_id": "114312506733954802462", "name": "Maria Gianna", "time": 1567988087987, "rating": 5.0, "text": "Love the Blue Crab Claws 3", "pics": null, "resp": null, "gmap_id": "0x88891bc0bf400bb5:0x9584ced19a633d1b"}
{"user_id": "115612021182836522535", "name": "Stephanie Agee", "time": 1598415211464, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x88891bc0bf400bb5:0x9584ced19a633d1b"}
{"user_id": "105510491717065536849", "name": "amir sattar", "time": 1565331513842, "rating": 5.0, "text": "Love it!", "pics": null, "resp": null, "gmap_id": "0x88891bc0bf400bb5:0x9584ced19a633d1b"}
{"user_id": "116361935141800473154", "name": "Shama Patel", "time": 1621968047395, "rating": 5.0, "text": "Thank you for the opportunity to have a wonderful breakfast with the Marriott team.  I absolutely LOVED the french toast & the delicious fruit.  The presentation for the charcuterie board & the french toast was amazing!  Thank you to the chef & the staff for a warm welcome to the Marriott this morning.  I look forward to visiting again soon!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOR50CgALejg_-tbvsxzQJGQvMXDeI91cbThagF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipORTpFo6ShvM1bdKydpWHKvj8mXw_oSBkOv5xdW=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626c174c5aaaab:0x49b4e494aa130f06"}
{"user_id": "113405378086189639993", "name": "Risa K", "time": 1616865531846, "rating": 5.0, "text": "Great food, service and atmosphere. The inside of the restaurant was clean and looked new. The shrimp bisque was too salty, but other than that everything we had here was delicious.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMqHvZ5J5VBDNC9TzqhpPKFWkY4qbGW9lzWtGnC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN0JZcKiYKW0Ym9ZT4Kko221kGJS7_zuFoc2DYj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOonssa_ceTNuuNXWm2UcLszbz2ekwyX47KYFf_=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626c174c5aaaab:0x49b4e494aa130f06"}
{"user_id": "101869973973826748678", "name": "Thomas Gardner", "time": 1622636589089, "rating": 5.0, "text": "My wife and I went out for our anniversary to southern chop. The service was impeccable and very pleasant. I ordered the NY strip and my wife ordered the pork chop, both cooked to perfection, I would recommend going hungry as the portions were very generous. At the end of our meal our waiter brought us a complimentary creme brûlée for our anniversary that was absolutely delicious. I can’t recommend this restaurant enough, and I will be back soon.", "pics": null, "resp": null, "gmap_id": "0x88626c174c5aaaab:0x49b4e494aa130f06"}
{"user_id": "105603870318353618664", "name": "April Koeppel", "time": 1622337253577, "rating": 1.0, "text": "Was not very impressed. Hotel was great. Breakfast was good but the service was horrible until the end when another waiter started helping with our table. We had a table of 4 and 2 of us had food while the rest of us were still waiting for drinks. The original waitress threw a menu down in front of me and immediately asked if I knew what i wanted without even giving me a chance to look. It took forever to even get our drinks. We decided maybe it was because several people came in at the same time and tried to give it another chance for dinner. We ordered a starter, my husband order a steak and potato, and I just ordered a potato. They came out with just the potatoes. We waited about 20 minutes for the rest of the food which never came. We tried to get our waiters attention but he kept walking. My husband finally got another gentleman's attention for the check. He brought it promptly and we discovered that none of the other food had even been ordered. Would not recommend to anyone. I have been a server 10 years of my life and worked catering and fine dining events for 2 years. I am very understanding and pateint but this was outrageous. If I could give 0 stars, it has definitely earned it.\n\nApril Jackson", "pics": null, "resp": null, "gmap_id": "0x88626c174c5aaaab:0x49b4e494aa130f06"}
{"user_id": "105715917271451207730", "name": "Jimmy Dunn", "time": 1612714637486, "rating": 5.0, "text": "Amazing food and service. Wasn’t sure what to expect inside a hotel but was pleasantly surprised. Our steaks were as good (or better)  as any of the local upscale steakhouses.  We will definitely be back.", "pics": null, "resp": null, "gmap_id": "0x88626c174c5aaaab:0x49b4e494aa130f06"}
{"user_id": "104040137494626131302", "name": "Kristen Kogerman", "time": 1623633310927, "rating": 4.0, "text": "Food is decent,  staff is spectacular, ambience is ok...", "pics": null, "resp": null, "gmap_id": "0x88626c174c5aaaab:0x49b4e494aa130f06"}
{"user_id": "102674494487167732097", "name": "Tiara Price", "time": 1610805993758, "rating": 5.0, "text": "Brunch was to die for (very simple but great) and we were able to still order breakfast!!! It was 5 of us and we had the whole spot to ourselves. The waiter and hotel staff were great, might I add I had the bar mix me up a drink full of fall flavors and I believe that was the best drink I ever had, can't wait to go back.", "pics": null, "resp": null, "gmap_id": "0x88626c174c5aaaab:0x49b4e494aa130f06"}
{"user_id": "114740508250108937860", "name": "Darrell Echols", "time": 1606065113941, "rating": 5.0, "text": "The overall dining experience was EXCEPTIONAL. The server, Rodney, was very knowledgeable and was able to answer every single question relating to the menu. The Sous Chef, Dom, visited our table and was very enthusiastic about cooking and it was evident on the plate. The ambiance is nice and relaxing. The Executive Chef Garien has done a great job keeping the menu \"simple\" yet elegant.\nHats off to the entire team and look forward to visiting again!!", "pics": null, "resp": null, "gmap_id": "0x88626c174c5aaaab:0x49b4e494aa130f06"}
{"user_id": "104753255387839945363", "name": "Nancy Zeller", "time": 1613245851312, "rating": 1.0, "text": "We stayed at the hotel attached. Bread brought out before the meal was a plate of cheesy cornbread muffins and dinner rolls. Both were cold and no plates were given. The cornbread muffins were very dry and the rolls were meh but tasted better when you didn't want to eat the food ordered. The NY strip (cost $32) came out rare instead of medium well. It was really fatty so I could only eat a little bit. The knife brought with the steak had dish detergent caked all over it. The brussel sprouts were delicious and I would recommend those. The caesar salad ($8) was small, tasted ok, and the croutons were an overly buttery, crunchless mess. A friend of ours ordered the filet mignon medium (cost $34) and it came out mooing with a giant frozen block of garlic butter on top. She said the parm fries were ok and a small portion.  Another friend ordered the Farmers Market mushroom spinach risotto (?$?) which was ok after she seasoned it. We did not have a reservation so we waited for 30 mins.  It took 2 hours for us to order, eat and pay once we sat at the table. I waited for an Apple Jack cocktail for 30 minutes so you can imagine how long everything else took.  Luckily, we still had a great time talking to each other but it would have been nice to have good food to enjoy with our friends.", "pics": null, "resp": null, "gmap_id": "0x88626c174c5aaaab:0x49b4e494aa130f06"}
{"user_id": "113546205417747455930", "name": "Kim Wickens", "time": 1622769294676, "rating": 5.0, "text": "Grrat food fun atmosphere", "pics": null, "resp": null, "gmap_id": "0x88626c174c5aaaab:0x49b4e494aa130f06"}
{"user_id": "117815467169826366205", "name": "Jace Moo", "time": 1618286647573, "rating": 4.0, "text": "Very interesting menu and wonderful cocktail specialties", "pics": null, "resp": null, "gmap_id": "0x88626c174c5aaaab:0x49b4e494aa130f06"}
{"user_id": "101224197145858615703", "name": "Steve Brantley", "time": 1619403898071, "rating": 3.0, "text": "So so food. Not so good on the service.", "pics": null, "resp": null, "gmap_id": "0x88626c174c5aaaab:0x49b4e494aa130f06"}
{"user_id": "112791516083331637643", "name": "Lori Jones", "time": 1609638939302, "rating": 1.0, "text": "Nice place friendly staff but food was horrible it was cold and not cooked right not good for price I will not be back not worth it.", "pics": null, "resp": null, "gmap_id": "0x88626c174c5aaaab:0x49b4e494aa130f06"}
{"user_id": "114410996240195644428", "name": "Donta Heulett", "time": 1600828860364, "rating": 5.0, "text": "Wonderful ambiance, great service, even better food! I got the ribeye it was cooked perfectly paired with the loaded potato and cream spinach, everything was perfect, and to top it off the red velvet brownie with the butter pecan ice cream with caramel drizzled over the top had me pleasantly miserable!", "pics": null, "resp": null, "gmap_id": "0x88626c174c5aaaab:0x49b4e494aa130f06"}
{"user_id": "109681021975799492980", "name": "alexandra burgos", "time": 1609294321613, "rating": 5.0, "text": "Great food, drinks, and customer service. Thank you Rodney!", "pics": null, "resp": null, "gmap_id": "0x88626c174c5aaaab:0x49b4e494aa130f06"}
{"user_id": "103138436098082055199", "name": "Zachary Maresh", "time": 1608488792436, "rating": 5.0, "text": "Quiet, great food and service, good ambience.", "pics": null, "resp": null, "gmap_id": "0x88626c174c5aaaab:0x49b4e494aa130f06"}
{"user_id": "103643228146830148734", "name": "Kodiak Kid", "time": 1600549715614, "rating": 5.0, "text": "Breakfast was amazing!!!!", "pics": null, "resp": null, "gmap_id": "0x88626c174c5aaaab:0x49b4e494aa130f06"}
