{"user_id": "117656339544144140700", "name": "ELAINE BURROUGHS", "time": 1563610077328, "rating": 2.0, "text": "Went in and was seen quickly, staff was friendly as was doctor. My concern was the instruments used to treat me were taken out of a box not wrapped like they were new, but possibly used before, never saw any sterilization done in them before use. And when finished with my foot, they were put right back in that same box. No cleaning done. To say I was shocked was in understatement, never been anywhere where this has happened. Now I worry about anyone else’s bacteria on those instruments. And it all happened so quickly like from time he came in deadened toe left room maybe 5 minutes cane back worked on toe and back in my car from signing in to exiting 30 minutes. I really don’t know what to think👀👀", "pics": null, "resp": null, "gmap_id": "0x888602ad537c4ed5:0xbb698b4246f34b0"}
{"user_id": "106987836655976849781", "name": "Candy Harrison", "time": 1517171949344, "rating": 5.0, "text": "Wonderful doctor, and workers. They always take care of me. Thanks for all you do!", "pics": null, "resp": null, "gmap_id": "0x888602ad537c4ed5:0xbb698b4246f34b0"}
{"user_id": "114177885796248433198", "name": "Laura Archibald", "time": 1496440345791, "rating": 4.0, "text": "My sister loves going to Dr Gould", "pics": null, "resp": null, "gmap_id": "0x888602ad537c4ed5:0xbb698b4246f34b0"}
{"user_id": "113582684991937602840", "name": "Alvin Wheat", "time": 1525024715095, "rating": 5.0, "text": "Very helpful and professional.", "pics": null, "resp": null, "gmap_id": "0x888602ad537c4ed5:0xbb698b4246f34b0"}
{"user_id": "112325993426652678148", "name": "Mark Armbrust", "time": 1519331013661, "rating": 5.0, "text": "Friendly fast and very helpful", "pics": null, "resp": null, "gmap_id": "0x888602ad537c4ed5:0xbb698b4246f34b0"}
{"user_id": "115814806812649027243", "name": "Patricia Partin", "time": 1512363926343, "rating": 4.0, "text": "Findley and helpful", "pics": null, "resp": null, "gmap_id": "0x888602ad537c4ed5:0xbb698b4246f34b0"}
{"user_id": "118304576458766739250", "name": "Dawn Ferguson", "time": 1614774213671, "rating": 5.0, "text": "Dr Cox, by far is one of the most compassionate Doctor's I have met. He came back to the office after his schedule of surgery's at the hospital to see me for an emergency. That is a true act of compassion that shows  Dr Cox has a heart for his patient's. The staff also are amazing and are great part of the team. Blessed to have been treated and cared for by all of Wiregrass Podiatry staff.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "101399306929377945277", "name": "Sandie Brandon", "time": 1605725739504, "rating": 5.0, "text": "“Am pleased with all the workers and Dr. Decker and am so grateful that I have a quality provider so near to me.\nStarting with the courteous receptionist when I  first walked in today, each staff member ( nurse, x-ray technician, exit billing staff) presented themselves in a positive, professional manner. I also appreciated the cleanliness of the waiting room and examination rooms and lobby area. You all did a thorough job.  A special thanks to Dr. Decker for taking extra time to accurately diagnose the problem of my foot, and explaining the different methods that was right for me to get my foot in less pain.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMGP5WDi1k3d03kJhyAjZCp1rY0RI8B0H4axhjV=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "108120405460928135546", "name": "Karen Adams", "time": 1609356682041, "rating": 5.0, "text": "Dr. Decker is a total professional. She knows how ticklish my feet are and holds on so I don't jerk my foot out of her hand. All the office staff are courteous and helpful. I highly recommend this group to anyone for their podiatric needs", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "105322708386285948495", "name": "Susan Alexander", "time": 1608822142141, "rating": 5.0, "text": "Dr Decker provides excellent, quality medical care and takes the time I need to answer all my questions during our appointments.\nI was confident I had the right doctor to perform my surgery before I actually had the surgery and now that I’ve had my surgery I’m 💯 percent sure she was the right doctor for my very challenging podiatry problems.\nI highly recommend Dr Decker for your podiatrist.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "113677487888042185068", "name": "Melvin Nelson", "time": 1607197871773, "rating": 5.0, "text": "Service was outstanding. Very friendly/helpful staff, made me feel extremely comfortable. Will not hesitate to recommend. Great job Doc and Staff. I shall return :)", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "109875771740793935545", "name": "Kathy Owens", "time": 1603444217433, "rating": 5.0, "text": "1st time patient, very easy process online. Office staff extremely helpful. Leah, was patient and very helpful with my concerns. Dr Cox was very professional and knowledgeable  regarding my questions. I highly recommend Wiregrass Podiatry, Enterprise.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "100346839473723181612", "name": "Roe Hernandez", "time": 1604451309286, "rating": 5.0, "text": "Dr. Howard Cox and his nurse assistance were very nice.  They were both very helpful.  They listened.  The ladies at the front desk were very nice too.\n\nCatherine A. Hernandez", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "111884014771855631701", "name": "Robert Cremer", "time": 1606158128472, "rating": 5.0, "text": "Dr. Decker worked on my foot and it is getting a lot better. As long as I have to pads to wear it doesn't hurt as much. I believe she was going to order me a bag of pads or call me about them soon.\nShe has been a God-Send for my foot and I tell everyone about her.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "100920550108736714745", "name": "James “Jimmy” Parker", "time": 1605845803929, "rating": 5.0, "text": "The best quality, very professional, and able to explain diagnoses and prognoses very well, from experience and empathy.  Due to increasing popularity and increased scheduling, the Doctor entered the exam room an hour and ten minutes beyond my appointment time, but she was extremely efficient and prompt in her exam and evaluation.  Good experience., worth the wait.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "109284142117057837888", "name": "Joy Persgard", "time": 1603405168320, "rating": 5.0, "text": "I just love Dr. Decker! I so enjoyed her and the staff! I will miss yall as today was my last visit. You girls rock!! Love,Joyce Sullivan", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "113832712423835446145", "name": "Thomas Susi", "time": 1602014833632, "rating": 5.0, "text": "Dr. Cox was very professional and caring. Took his time and explained the medical condition in a way the average person could understand. We plan to continue using this facility and will recommend to others.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "101813012698600466403", "name": "peggy dickey", "time": 1601047537729, "rating": 5.0, "text": "Very professional excellent quality of patient relationship.  This is one of the best medical practices I have ever used.  The doctors and staff are the best.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "105120637622499476505", "name": "Julianna Cannon", "time": 1583595566721, "rating": 5.0, "text": "This practice is a well oiled machine from the front desk to the physician: Professional and courteous with a high standard of care.  The nurse was thorough in asking questions and listening so that I did not have to repeat the same info to Dr. Becker.  Dr. Becker sincerely listened to my concerns and addressed everything with knowledge and compassion, making me feel like an actual patient instead of just a number.  I highly recommend her. 10 stars out of 5.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "101953286183275467334", "name": "Lloyd Ankrum", "time": 1591727801232, "rating": 5.0, "text": "Probably one of the best experiences I've had as a Soldier being referred to an off-post medical/treatment facility.  From check-in through triage, to the actual appointment with Dr. Decker, my experience was amazing.  The team was attentive, asked lots of questions, as well as answered ALL of my questions.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "116769933404252551708", "name": "Ocie Conner", "time": 1579224638657, "rating": 5.0, "text": "Dr. Decker is awesome. She truly and genuinely cares about her patients. She works with her patients and and conditions to find a positive results. She is very knowledgeable and would definitely recommend her office for all my friends and family. The staff at in the office is very courtesy and kind. They do everything thing they can to make you feel welcomed as soon as you enter the door.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "107606820192890792137", "name": "Stacy Curry", "time": 1591740956752, "rating": 5.0, "text": "Dr. Decker is the best in the business! Friendly, quick, gentle, efficient, and caring!! Took care of a horrible ingrown toe I had and made sure to check on me through the process, which only took about 10-15 minutes total! She's GREAT!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "100990564326484897584", "name": "Rena Taylor", "time": 1595001391481, "rating": 5.0, "text": "I was 20 minutes late for appointment but was still able to be seen within 15 minutes.  Shared concerns and had all questions answered and explained in terms I understood.  Staff is always polite and Dr.Decker is great.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "112243795962361922211", "name": "Susan Seay", "time": 1603834935218, "rating": 5.0, "text": "Friendly and caring staff. Everyone seems very knowledgeable and willing to listen and make suggestions for my improvement.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "117051869227126261874", "name": "Robin Yoder", "time": 1602276767987, "rating": 5.0, "text": "Love the staff, very pleasant and happy, Dr. Cox explained everything to me answered all questions and I was in and out quickly.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "117665274574286660936", "name": "Lance Gieselmann", "time": 1602691399750, "rating": 5.0, "text": "I appreciated the attention to detail and knowledgeable about the problems my son was having with his feet.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "102627989203932015809", "name": "Dale Sanders", "time": 1608488333907, "rating": 5.0, "text": "Nice people...nice office...helped my pain quickly", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "117692032007674071831", "name": "Leslie Royer", "time": 1598968559191, "rating": 5.0, "text": "Very nice, friendly, professional staff.  Helped me understand the billing as well as healing my foot!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "112550633504510220763", "name": "Jackie Gillis", "time": 1600943349524, "rating": 5.0, "text": "She is real good at what she does. Would recommend her to anyone looking for a podiatrist!!!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "102629326074667664717", "name": "T Wag", "time": 1597436303276, "rating": 5.0, "text": "Great disposition, the wait was brief, and I received quick treatment. Staff and doctor were friendly and efficient!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "100307225281173710021", "name": "Paul Ellis", "time": 1579376797717, "rating": 5.0, "text": "Thursday I could barley walk so I called Dr Deckers office and they got me in first thing Friday morning. I received much needed injections in my feet, Saturday morning feet felt 100% better. If you’re looking for a genuinely caring Podiatrist then look no further. Very professional and results oriented!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "106957340064636038348", "name": "Lori Keeton", "time": 1579720534527, "rating": 5.0, "text": "Dr. Decker is wonderful. You never feel rushed.  She takes the time to answer all your questions in a way you can understand.  She is very knowledgeable and professional but puts you at ease and makes you feel comfortable. I highly recommend her and her staff.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "102984507305063558970", "name": "Nathan Johnson", "time": 1582891055093, "rating": 5.0, "text": "Staff is very friendly and attentive. Even though the office was busy I didn’t have to wait at all for my appointment. I was very pleased and impressed.  I did t feel rushed at all. Dr. Lowe took his time and explained everything to me so I could understand it.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "109279330428537969204", "name": "James Muldoon", "time": 1600974956696, "rating": 5.0, "text": "i found  dr. cox and the entire staff of wiregrass podiatry to be very professional and couteous.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "117297626999085917034", "name": "Rachel Tehvand", "time": 1581553472705, "rating": 5.0, "text": "I saw Dr. Lowe during my visit.  He was caring and attentive and I felt like I was being heard as I voiced my concerns.  He validated my feelings and eased my fears.  The rest of the office staff are incredibly kind and friendly.  I was seen promptly and had a minimal wait in the front office and in the patient room while waiting for Dr. Lowe.  I would highly recommend Wiregrass Podiatry!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "108423676765180370488", "name": "Eric Beat", "time": 1599587292954, "rating": 5.0, "text": "Doctor Decker cares about her patients needs and strives to provide a catering atmosphere and understanding for them", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "110646048688038653485", "name": "Robert Banuelos", "time": 1581012450526, "rating": 5.0, "text": "Best Doctor that I have ever seen. I hesitated to get my foot worked on for years before I saw Dr. Decker. She explained everything in great detail and made me feel at ease.  Over 2 months post-surgery, she is still the best.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "107110781990836027737", "name": "Elizabeth Commander", "time": 1595441122063, "rating": 5.0, "text": "My wait was very brief. Everyone was very polite and efficient. The dr has an excellent bedside manner and she listened to my concerns and offered me options.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "116315097612230346157", "name": "Kristy McIntosh", "time": 1583379667130, "rating": 5.0, "text": "Dr. Decker and the staff was great. They are friendly and very respectful to all their clients. They explain everything to you at every visit. They never leave you wondering what is going on.  She gives great recommendation and diagnosis on the spot.  Her office has products you can purchase that will help with your treatment. The environment is safe and clean. The location was easy to find.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "116666244163174627564", "name": "Tom B", "time": 1607088358619, "rating": 5.0, "text": "My visit was wonderful and treated me with respect", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "111639846508686254773", "name": "Philip Waters", "time": 1603044633781, "rating": 5.0, "text": "They made me feel like they already one me and treated me like family", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "116822480494176550188", "name": "Beatrix Whitehead", "time": 1598044999784, "rating": 5.0, "text": "Dr.Decker is a very good doctor and I  most defanatly will go with all my foot issues to het.She is very professional and very helpful with explaining, she freed me right away from a discomfort in my toe ,I  so apricated that.The staff is also very friendly and helpful, I will most defanatly recommend Dr.Decker.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "108325541143971407909", "name": "Linda Mott (LMOTT)", "time": 1583286065537, "rating": 5.0, "text": "I had a little bit of a wait when I arrived for my appointment.  All.of the staff was very nice. Dr. Decker explained everything to me in detail and made a suggestion to take care of the problem that I have been having. Will have to decide about when to have surgery soon.  I am looking forward to seeing her again soon.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "118282360074942299329", "name": "Lynn Donaldson", "time": 1599076253763, "rating": 5.0, "text": "They were very friendly and helpful and fully explained what I needed and what to expect with my surgery. I had a very good experience here", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "100539341833611381075", "name": "Missjazz 504", "time": 1578531241023, "rating": 5.0, "text": "I entered Dr. Decker clinic and was greeted by a friendly and professional staff. The clinic was pleasant and very clean. I was seen on time. I have experienced  pain in my feet for 15 years. I have seen 5 different foot doctors with no relief. I recieved a thorough exam and diagnosis. She provided me with a treatment plan that truly addressed my symptoms.\nThe first step in the plan was address during my appointment. I truly felt better shortly after my appointment. I now have a clear understating on what's going on with me. Thank You Dr. Decker and staff!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "102304840322586729185", "name": "Kathie Tallas", "time": 1595734755604, "rating": 5.0, "text": "I thought everyone was very professional.There was a short wait and Dr.Decker was very warm and friendly and is very informative. She helped me with my problem and I was on my way.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "117861594187511713184", "name": "Debbie Kelley", "time": 1594567159455, "rating": 5.0, "text": "It’s always hard to start with a new doctor but Jennifer Decker has proved to me that she is a concerned and caring doctor. My last podiatrist let me down and I lost 2 toes in October. Right now she is trying to save another toe. She is very upfront with you but kind at the same time. All the office staff I have encountered have been really nice.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "101404966916163398011", "name": "Derrick Purvis", "time": 1603062593569, "rating": 5.0, "text": "Podiatry at its finest!!!!! Great do do business with Dr. Decker & staff", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "113683960350841970498", "name": "Quentin", "time": 1580239822889, "rating": 5.0, "text": "Absolutely the best... I’ve seen four different podiatrist and by far this was the best experience! Gets to the root of the problem and makes it really comfortable for those of us embarrassed by the appearance of our feet. Very knowledgeable and extremely customer friendly. 10Stars", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "109762639850212297855", "name": "STACY Cumbee", "time": 1599234272280, "rating": 5.0, "text": "She is so nice and gives you options. Your opinion matters to her. I love Dr. Decker and her staff!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "116958961230679120176", "name": "Katie Nelsen", "time": 1602088734991, "rating": 5.0, "text": "I had a brief wait and everyone was kid, professional and efficient.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "105009132996972800113", "name": "Beth Miller", "time": 1594379640003, "rating": 5.0, "text": "Dr Decker was wonderful !!  Great bedside manner ,who appears to genuinely care for her patients and takes time to listen ! Staff was very helpful. Dr Decker appears very knowledgeable in her profession.  I was pleasantly surprised with my entire office visit beginning to end !  Reasonable wait time.  I'll definitely be back !  Thank you for treating me like I matter.\nI dont know where id be now, had i not found her !", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "101016073774938223749", "name": "Chris Kianka", "time": 1591104109013, "rating": 5.0, "text": "After seeing 2 other podiatrists, with no luck, I went to Dr. Decker.  She listened and immediately knew what my pain was from.  She sent me for therapy and my pain is being resolved through therapy.  I am very happy I went to see her and will go again, if needed.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "108407059151431111923", "name": "Stacy Curry", "time": 1573243567302, "rating": 5.0, "text": "Dr. Decker's office is the BEST podiatrist around.. I was in and out in 30 minutes with an ingrown toenail procedure! Dr. Decker talked me through the procedure and was so kind and patient, so gentle and thorough!! I will continue using Dr. Decker for my podiatry needs as long as she's in service. Her and her team are amazing!!!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "108920314106616541497", "name": "Bette Zilles", "time": 1594233598513, "rating": 4.0, "text": "Dr. Decker  was competent and personable . She was direct and informative,  and easily answered my questions.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "101265687683108619888", "name": "Sandy Parker", "time": 1583513310980, "rating": 5.0, "text": "Very professional and so informative. One of the Best experience I’ve had at a doctors office from check in to check out. Highly recommend Dr. Decker!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "109708625928027648287", "name": "Mike Caveness", "time": 1579881942823, "rating": 5.0, "text": "Dr. Decker is extremely informative. You always know what she is doing and why. And she is outstanding at her job. Her staff and nurses are great too. I would Highly recommend Dr. Decker to anyone.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "113175215229121602618", "name": "Betty Frances Owens", "time": 1573176781438, "rating": 5.0, "text": "We Love Dr Decker and her Staff!  Dr Decker is very knowledgeable and personable.  Her disposition is always warm and caring!  My husband and I travel from Dothan just to see her.  She is very special and we feel blessed to be her patients!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "114899090794308991344", "name": "Skip Chormicle", "time": 1601918206829, "rating": 5.0, "text": "Quick appointment great, thorough care.great and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "110781007514899418488", "name": "Gabrielle Davis", "time": 1567013266584, "rating": 5.0, "text": "Dr. Decker is  Awesome !!! My Mom is  a diabetic and has A-Fib. She is on blood thinner. We have tried several podiatrist in every town around. But they were all the same!!  None of them wanted to help my Mom with her problems or pain!!!  They only butcher her feet that took weeks to heal and never solved any of her problems.  They told her I’m sorry but this is all we can do!!  Dr Decker not only helped her with her problems but also her pain!!! We have a plan and Dr. Decker will continue to make my mom’s feet even better!!!!  My Mom and I both are very happy!!!!  She is the BEST!!!  We feel so BLESSED to have found Dr. Decker!!!!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "114624669481087922854", "name": "Rita Guilmette", "time": 1573835415596, "rating": 4.0, "text": "Dr Decker and staff were polite and proficient.  My mother (83-ish!) left out\nof the office with a good feeling about the foot care she received.  Dr Decker said she loved her job and it was quite evident with the care she provided!  Thank you!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "118120273392526023417", "name": "Mary Ward", "time": 1580498521678, "rating": 5.0, "text": "Excellent care! My 9 year old daughter and I both see Dr. Decker and we love her! The office staff is kind and friendly too.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "114945219592889076666", "name": "Tin Man Studio", "time": 1599759082145, "rating": 5.0, "text": "The nurse and doctor actually listened to what I had to say and agreed that what I was previously continually being diagnosed with was wrong. It was a relief for someone to actually hear what I had to say and move forward with a treatment that may actually help!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "105680469481525594701", "name": "Christina Seidel", "time": 1590164696379, "rating": 5.0, "text": "I'm diabetic and have PAD..When I moved here to Enterpise my left foot was in very bad shape.. I really thought I was going to possibly lose my first 3 toes and or my whole foot.. I Thank God I found Dr. Jennifer Decker.. I moved here in March and Dr. Decker has been working on saving my toes and foot...Giving me one on one quality care which is very rare these days. She's amazing as a Podiatrist and a human being..\n\nI would give her 10 stars if i could..She has recently opened her own practice and if you need a Podiatrist and you live near Enterprise, she and her staff will do everything in their power to make sure you get outstanding care..", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "104737662054147304644", "name": "Anna Collins", "time": 1573577740741, "rating": 5.0, "text": "Dr. Decker and her staff were kind, professional and timely with my visit. Dr. Decker provided me with information that was easy to understand and I trust that if I ever have issues in the future, she and her staff will be sure to take care of them for me!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "109081767769752743773", "name": "Desiree Jones", "time": 1609779825224, "rating": 5.0, "text": "Dr. Decker is gentle and doesn't cause any unnecessary pain!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "105539239318125014132", "name": "Jennifer Luckey", "time": 1594929851403, "rating": 5.0, "text": "The staff is friendly and professional.  My foot is so much better.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "109964667247271954880", "name": "Ashley Sherba", "time": 1573325785642, "rating": 5.0, "text": "Dr. Decker is honestly the best doctor I have ever come across. She is honest, supportive, and very thorough with patient care. I am so happy I found her, she is truly an amazing surgeon!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "102185169186241195215", "name": "Roy Welch", "time": 1598025900793, "rating": 4.0, "text": "Even though she hasn't found out what's causing my problem Dr Decker keeps looking", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "112944050176659209144", "name": "Steve Koach", "time": 1584397198391, "rating": 5.0, "text": "Great people - Dr Decker is an outstanding professional who cares for her patients and takes the time necessary to ensure you understand the issue the necessary steps to provide relief.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "117355937166206188942", "name": "Carolyn S. Lazenby", "time": 1582158049371, "rating": 5.0, "text": "I was at the office today for a nail problem. I saw Dr. Lowe. He is great and my nail problem is almost resolved. I am really glad to have a podiatry clinic in Enterprise that takes pride in what they do and time with their patients.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "104026160240745215815", "name": "Kim Perkins", "time": 1575072413722, "rating": 5.0, "text": "Dr. Decker was wonderful! She spent plenty of time with me listening and helping  me with my foot problems. Would definitely recommend her!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "109839047304603551432", "name": "Bob Phares", "time": 1605555971750, "rating": 5.0, "text": "Had a very pleasant experience.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "100924857701818427165", "name": "Tom Sizemore", "time": 1580229121321, "rating": 5.0, "text": "Great professional\nCommunicates very well.  A real asset to the community", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "115754905499831685321", "name": "John Camm", "time": 1600769249991, "rating": 5.0, "text": "Doc, is very professional but also caring toward your problems. She takes care of\nyour  situation while also listening to you which I find is very helpful in addressing your problems..", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "108224885219121231291", "name": "joe guthrie", "time": 1578509336628, "rating": 1.0, "text": "Very good. Great staff friendly and professional.  Patient oriented.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "114554738547378980265", "name": "Queen Murray", "time": 1603383396826, "rating": 4.0, "text": "Dr. Decker is very knowledgeable and helps you to understand what is actually going on. She makes sure you are getting the right treatment regimen for the right problem.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "107008876883633022313", "name": "Thomas Hodges", "time": 1580854981021, "rating": 5.0, "text": "Very pleased with staff and attention Dr. Decker gave to my foot problem. I recommend her highly.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "116548495837895422215", "name": "Tempie Thackston", "time": 1589493458418, "rating": 5.0, "text": "Dr. Decker was very professional with a great personality and very compassionate!! 😊 I had an infected ingrown toenail and she had to numb it with an injection. She put topical cream to numb it first and I hardly felt her injecting the shot. I can’t say enough good things about her!!! I highly recommended her!! If you have an ingrown toenail, go to a specialist, not a general surgeon. Tempie", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "110237457211494146489", "name": "Susan Clark", "time": 1594943336751, "rating": 5.0, "text": "Dr. Decker and her staff treat you very well. She listens to everything you have to say.  Dr. Decker explains  what can be done to fix the problem at hand.  She never rushes you in and rushes you out.  She takes the time to make sure you are comfortable with the outcome/solution.  If it wasn't her I would be walking on my foot.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "114074356442096061726", "name": "Willie Stallworth", "time": 1569958590904, "rating": 5.0, "text": "Very nice and relax atmosphere. Friendly staff. Dr. Decker is very knowledgeable and professional.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "105674407858007808620", "name": "Beth Hughes", "time": 1568129356934, "rating": 5.0, "text": "Dr. Decker found the source of my foot and ankle discomfort and I finally have received relief from the pain. I would recommend her to anyone that is dealing with issues with their feet. Thank you so much!!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "110463213893689537125", "name": "Johnny Moncayo", "time": 1568771805770, "rating": 5.0, "text": "She was great. To the point fave options and told me how it us. Great job.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "110057944840708335912", "name": "Hilde Hodnefield", "time": 1561999158169, "rating": 5.0, "text": "Dr Decker took my history for my feet and acted upon. She did exactly what I asked for and more. Thank you very much. Hilde", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "114433998136486123858", "name": "Dr Dale", "time": 1574982102727, "rating": 5.0, "text": "Love this office. Dr. Decker and staff are outstanding! I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "103728558859756054401", "name": "Magen Arsenault", "time": 1579528247274, "rating": 5.0, "text": "Dr. Decker was super thorough and informative. I’ve been to another podiatrist and they didn’t do or help me half of what she did.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "110754799943573140309", "name": "Destry Hill", "time": 1562274119996, "rating": 5.0, "text": "Great visit. Dr. Decker has a great bedside manner and is knowledgeable of the processes affecting the local military population.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "100913092564886780402", "name": "Cynthia Stricklin", "time": 1573843080805, "rating": 5.0, "text": "Always takes the time to listen to my concerns and knows exactly what to do to give me the best relief. Best doctor I have, hands down!!!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "103252076393931957933", "name": "Cindy Whittleton", "time": 1571423450430, "rating": 5.0, "text": "Everyone is very professional   and Dr. DECKER  starts off with the conservative   approach   first which is appreciated .", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "102487727861805378543", "name": "Jessica Wilson", "time": 1570646687935, "rating": 5.0, "text": "Best care I have received across the Wiregrass. Dr Decker truly cares about her patients well being!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "103120969419464365916", "name": "Ken Owens", "time": 1593718002448, "rating": 5.0, "text": "I really enjoy coming to you, your staff is great and friendly and I love the work and care you do for your patients!!!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "115554030660515577968", "name": "Ona Garwood", "time": 1582583583507, "rating": 5.0, "text": "She is a delightful doctor, Makes you feel like a Patient instead of just a number.  Love her,  Ona Garwood", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "115311792663584983253", "name": "John and Katie Blaise", "time": 1583368767312, "rating": 5.0, "text": "The whole staff from the receptionist, to the nurse to Dr. Lowe were absolutely fantastic!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "109496798106188797068", "name": "Kim Baker", "time": 1601513164420, "rating": 5.0, "text": "Dr. Decker knows what she is doing!  Thank you Dr. Decker!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "109494934718548573036", "name": "Darla Grubb", "time": 1577332096638, "rating": 5.0, "text": "Dr. Decker is wonderful at resolving the issue.  Very personable and timely.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "112060948848542888913", "name": "Mark Hughes", "time": 1565484813145, "rating": 5.0, "text": "Dr.Decker was knowledge, caring and very efficient. I was really pleased with her kind and caring staff as well.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "115908404258081212662", "name": "Annette Williams", "time": 1568068666127, "rating": 5.0, "text": "Dr Decker is amazing I really enjoy going to her for my problems. Dr Decker really listen to you and I would use and recommend her.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "101021350536008968838", "name": "Ladeatrea Paige", "time": 1600047195441, "rating": 5.0, "text": "It was great very professional", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "105756898400366939860", "name": "Jane Gleason", "time": 1589934347363, "rating": 5.0, "text": "Staff is personable and professional. Dr D is wonderful!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "107628512344099427571", "name": "Tracy Brown", "time": 1599153528078, "rating": 5.0, "text": "Dr Cox is the best 😊", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "105552030998130431439", "name": "Shannon McNabb", "time": 1568922916212, "rating": 5.0, "text": "I really appreciate a doctor who starts with diagnostics and holistic approach.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "107708245571175328556", "name": "Pam Dixon", "time": 1569627415159, "rating": 5.0, "text": "Dr was very pleasant has wonderful personality very professional recommend her highly", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "102819677435755433984", "name": "Barbara G", "time": 1578521394252, "rating": 5.0, "text": "Dr Decker was very friendly, and easy to talk to.  I did not feel rushed, and she listened to my concerns!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "115600923826046192939", "name": "Wylie Mathis", "time": 1584064199579, "rating": 5.0, "text": "Dr Decker is very attentive with her patients, and cares about veterans.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "109638145523941462573", "name": "Mary Burdeshaw", "time": 1562900568295, "rating": 5.0, "text": "Had my first appointment today. She was great.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "115607411933125742140", "name": "Victoria LlanesDiaz", "time": 1562865100125, "rating": 5.0, "text": "Dr. Decker is a miracle worker!! If she could make my “hooves” look like normal girlie toes, she can definitely help you!!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "100733697553306540895", "name": "Wayne Chambers", "time": 1594246080285, "rating": 5.0, "text": "Everyone was very professional and helpful", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "102606971479986430858", "name": "Charles Irving", "time": 1580000146289, "rating": 5.0, "text": "Amazing first visit, even though my problem may be outside her realm she is getting me tooth right people.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "106815421867126079910", "name": "Rachel", "time": 1565220582352, "rating": 5.0, "text": "Fast and friendly. Great....", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "107005323588180158296", "name": "Larry mURPHY", "time": 1605121783202, "rating": 4.0, "text": "Service was great", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "104983074313664437017", "name": "Collis Odom", "time": 1566236507030, "rating": 5.0, "text": "Dr was very friendly and professional,covering all possible causes,took time to explain possibilities and arranged next steps.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "108800504273394818291", "name": "コンコン", "time": 1569582634104, "rating": 5.0, "text": "Dr. Decker was very kind, personable, and receptive to my problems", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "111723567459343629256", "name": "Willy Wilson", "time": 1577801164635, "rating": 5.0, "text": "Excellent patient concern and interaction.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "110036976622349959984", "name": "Eric Beat", "time": 1591109464609, "rating": 5.0, "text": "Great experience with a great doctor", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "108534491940620268353", "name": "Lois Miller", "time": 1564846794590, "rating": 5.0, "text": "Dr Decker answered all my questions before I even asked them!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "102191109197754065488", "name": "Silvia Edgar", "time": 1583797390322, "rating": 5.0, "text": "Absolutely wonderful.", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "111200833160494971114", "name": "Danielle L Williams", "time": 1571937401141, "rating": 5.0, "text": "Always a great visit!!", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "113278548943678220849", "name": "Rhonda Stevens", "time": 1570986523777, "rating": 4.0, "text": "In the hospital", "pics": null, "resp": null, "gmap_id": "0x88926f0933ca5fe9:0xb6abb081d717b92e"}
{"user_id": "106017578777848891415", "name": "John O'Leary", "time": 1613249385096, "rating": 5.0, "text": "Excellent.  My pain was been going on since the 70s, a week after surgery it is much better.\n\nStrongest possible recommendation for his practice.", "pics": null, "resp": {"time": 1613684529333, "text": "Thanks for the review, John! We're thrilled that you had a great experience with us, and thankful that you took the time to share your praise with others."}, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "108765175732959793537", "name": "Marcus Hughes", "time": 1598457261013, "rating": 5.0, "text": "I’ve been treated by Dr Krauss for both an ankle fusion and also a leg shortening procedure. I have been well pleased and highly recommend him. His staff has always been very courteous and accommodating.  A great bunch of folks!", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "108604113580178117649", "name": "Tim Roper", "time": 1612825311276, "rating": 5.0, "text": "I had let my type II diabetes get out of control to the point of unfortunately needing a toe amputation. Dr. Krauss did the procedure after setting up surgery (shunts to improve blood flow through my groin). I was a smoker up until that point. Dr. Krauss was a straight shooter throughout the whole thing. I was fortunate that I didn't loose that foot or even a leg. He emphasized no more smoking.  Sad that it took getting to this point to be ready.  In a nutshell, Dr. Krauss and Dr. Heideprem (vascular surgeon) saved my life and I will be forever grateful to them.", "pics": null, "resp": {"time": 1612821944147, "text": "We appreciate the rating, Mr. Roper. Thank you!"}, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "116607990532333303229", "name": "Hyron Duff", "time": 1613083019891, "rating": 5.0, "text": "Dr.Krauss and his staff were very knowledgeable and pleasant to deal with.", "pics": null, "resp": {"time": 1613684587048, "text": "Thanks for the kinds words, Hyron! It's exciting to hear that you had a quality experience with us."}, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "100913969729613779872", "name": "Christa Cummins", "time": 1605110982536, "rating": 5.0, "text": "Even though I’m going through this crazy ordeal, they are so Thorough and do not skip any steps. Dr Krauss is awesome and is worried about my well-being not about the Workmen’s Comp. people hurrying me back to work. Thank you to his team for everything y’all are doing for me!", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "106644599507001484279", "name": "Kathy Herron", "time": 1607535782621, "rating": 5.0, "text": "Dr Krass staff + Him make my visit very pleasant .", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "107967314555261601934", "name": "Janice Littleton", "time": 1574263310353, "rating": 5.0, "text": "My visit yesterday went very smoothly. I filled out all the paperwork online prior to going for my appointment. When I arrived, I signed in and had a short wait time to be called back to see the Dr. The Dr explained what was going on with my foot and we have a treatment plan.  I am pleased with this facility 100 percent!", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "103438663794607907193", "name": "BILL VERNON", "time": 1596898206929, "rating": 5.0, "text": "Dr. Krauss,& his staff are Truly dedicated Professional medical people,Very Happy with My treatment,& would refer Anyone 2 them 4 Treatment !!!, Bill Vernon", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "107416483362136016511", "name": "Lynn Nixon", "time": 1591114879905, "rating": 5.0, "text": "Dr Krauss and Nurses are always nice and caring. I enjoy my visits, because they are healing me.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "111914609978148175170", "name": "Gregory Cochran", "time": 1574443874985, "rating": 4.0, "text": "Dr.Krauss is a stern but very fair and caring doctor. Did his best, to get me through a very trying time of my life with diabetes. I thank God for doctors like him.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "115125614437746233063", "name": "Matt Collier", "time": 1580483827660, "rating": 5.0, "text": "We had a great experience. The staff were all very friendly. Dr.krauss is so nice and down to earth. We know he cares for each of his patients.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "105027479366343695116", "name": "M Chambers", "time": 1576683179227, "rating": 4.0, "text": "I know it is close to the holidays but I was disappointed I have to make another trip (60miles one way) just to have a CT scan done Then wait again for another trip just to get the results. Doctor was great , personal was very nice but it did seem like a waste of time just to cut one cast off then put another one on , then send me home.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "105828034881929079104", "name": "Carl Oneal", "time": 1561600445071, "rating": 5.0, "text": "Dr. Krauss' staff was wonderful, upon arrival l was greeted as if I'd been a patient of his for years. In the exam room my questions were answered to my satisfaction and my procedure was explained in detail. He and his staff were very professional and l felt at ease even though l had to go to the office alone that day. I'm not at all apprehensive about having my procedure.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "110825311929044187256", "name": "Bunny Lawson", "time": 1571417642853, "rating": 5.0, "text": "The staff was really nice. The doctors were patient, and listened to my concerns. I had an awesome experience.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "112866503273826197309", "name": "Angie L.", "time": 1583508120065, "rating": 5.0, "text": "The people at the front desk were very polite, the nurses and Dr. Krauss were exceptional and caring as always!", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "114790592227198168252", "name": "Rhonda Lyn", "time": 1582864512138, "rating": 5.0, "text": "After several bone breaks and surgeries, Dr. Krauss and his staff always hae treated me in the most professional and personal manner. the accommodations for appointments at Grandview or Valleydale are flexible for my schedule.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "112868346725166718766", "name": "Melinda Lewis", "time": 1562768784315, "rating": 5.0, "text": "Overall experience was excellently! The staff took real good care of my needs and the D r. Krause he made sure that all my questions and concern was answer.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "108150381681216469750", "name": "Melanie Taylor - Coleman", "time": 1546551805068, "rating": 5.0, "text": "After months and 4 other doctors, Dr Krauss was able to nail down a diagnosis and the reason I could not walk in less than 15 minutes. He quickly scheduled a MRI and referred me to a spine specialist. He gave me hope and a path to recovery and living again. Words can’t describe how thankful I am .", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "103228259784727626677", "name": "LP Key", "time": 1574781963897, "rating": 4.0, "text": "Dr. Krauss is an excellent physician/surgeon. He and his staff are very knowledgeable and compassionate to the needs of their patients.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "112427042023403016916", "name": "ONeal Smitherman", "time": 1590798967699, "rating": 5.0, "text": "I was treated very well, with professionalism and respect.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "100776972620442007808", "name": "Sheri McReath", "time": 1567610298798, "rating": 5.0, "text": "All staff, from the receptionist to Dr. Krauss, are always so responsive to my medical needs and always sweet and polite. I recommend Dr. Krauss to everyone.  My only complaint, and it is minor, is the 30 minute wait time in the lobby .", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "113378923091585862732", "name": "James Mcmillian", "time": 1613179711815, "rating": 5.0, "text": "Very little pain so far.", "pics": null, "resp": {"time": 1613684552072, "text": "Thanks for the rating, James! We're happy that you've had a great experience with us."}, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "117207720388399482428", "name": "Lachelsea Hall", "time": 1561595785031, "rating": 5.0, "text": "I really enjoy the staff and the way Dr Krauss gives positive feedback. From my first visit he has been helpful and I really appreciate him for taking the time to help me heal and I pray that he will continue to give the best care that he can to his patients. Thanks Dr Krauss", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "110757939555387360325", "name": "Laura Louise Gentry", "time": 1575473724359, "rating": 5.0, "text": "First time at Grandview & my first time seeing Dr. Krauss. I went in for a painful heal yesterday, I couldn't take the pain any longer. After Dr Krauss made his diagnosis of a heal stress fracture & his recommendation of how to relief the pain by wearing a tall boot for 8 weeks, I'm feeling much better today.\nThank you staff & Dr. Krauss", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "114246167583356723001", "name": "Cathy Skipworth", "time": 1567009006138, "rating": 5.0, "text": "Dr Krause was always so kind and kept me up to date with my progression healing is a process.   He was phenomenal", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "101517287180997388886", "name": "Karen Henderson", "time": 1551654492718, "rating": 5.0, "text": "Dr. Krauss has been my husband's surgeon for several years.  We know we can trust his professional opinion and are very confident in the care he and his staff provide.  We highly recommend him.", "pics": null, "resp": {"time": 1551900760795, "text": "Thank you for the feedback!"}, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "107473508766148544142", "name": "Kay", "time": 1543634877865, "rating": 5.0, "text": "Dr. Krauss is tending to both my and my husband's feet.  He is very thorough, concerned, wants to help you get better and has a wonderful personality.  All is his staff is excellent as well.  They all strive for excellence and make you feel special as a patient.  Dr. Krauss is one of those doctors that you never dread having to see.  We highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "114541029042914439719", "name": "Betty Veitch", "time": 1576099986856, "rating": 5.0, "text": "The entire staff at SouthLake Orthopedics is not only professional, but they appear to enjoy their jobs. Dr. Krauss is not only professional, he is honest with his patients regarding prognoses; something I find refreshing.\nHe includes those family members you wish to have included in your care, to the extent you wish to have them included and he is mindful of family situations outside the office that may have a bearing on your care, but he leaves that final decision about your care up to you once he is sure you can make a truly informed decision.  WONDERFUL!!!", "pics": null, "resp": {"time": 1551220687180, "text": "Thank you for the feedback!"}, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "110400977750589147109", "name": "Bill West", "time": 1570803254920, "rating": 5.0, "text": "Great experience with Dr. Krauss.  Would definitely recommend him.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "115306898205058592227", "name": "Jenny Camp", "time": 1562093337107, "rating": 5.0, "text": "He was fast and very kind.  His office staff were very busy but took time to talk to me and answer questions with a smile.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "113921130810736164987", "name": "Carmen Bates", "time": 1603467225949, "rating": 5.0, "text": "10/2020\nStill absolutely incredible! If you are having problems this is definitely a doctor you can trust to do what will the best for you. We’ve had quite the ongoing journey due to the extensive boo boo from the fall from the heavens. He is incredible! His expertise is incredible!\nUpdated 7/10/20\nReturned again to see Dr. Krauss due to the natural progression of my injury . I’m a year and 3 months post fall from a high ladder. I still feel that with Dr. Krauss I receive the best care I could ever get from a doctor. He was given a mangled mess and today I walk and am living a life I honestly thought I never would. I will be forever grateful to Dr. Krauss and the years he has taken to master his craft.\n\nI feel that with Dr. Krauss I have and will continue to receive the best of care. He is very detailed and thorough whether it’s an office visit or a surgery. No doubt he is the absolute best. He has made a horrible accident somewhat bearable with his knowledge and skill.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "104468925987561278368", "name": "Patsy Turner", "time": 1552527623341, "rating": 4.0, "text": "Very professional and informative. It was a new patient appointment and I’m very pleased!", "pics": null, "resp": {"time": 1553031766828, "text": "Thank you for the feedback."}, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "113893479368236428296", "name": "Matt Kellum", "time": 1547286717952, "rating": 5.0, "text": "Highly recommend Dr. Krauss and his caring team. Had an outpatient foot procedure and my experience was perfect, thank you!", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "102167915396756589488", "name": "dayna hickman", "time": 1554984507848, "rating": 5.0, "text": "Friendly and informed staffing , wonderful doctor (kraus) , he diagnosed quickly after several other exams from other doctors", "pics": null, "resp": {"time": 1556142386488, "text": "Thank you for the feedback!"}, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "110369423977075931494", "name": "Janice Phillips", "time": 1570060455707, "rating": 5.0, "text": "Will take time to talk to you and answer all questions", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "105138692371701624436", "name": "Patricia Byrd", "time": 1542816627567, "rating": 5.0, "text": "I wouldn't go anywhere else. Dr. Krauss and his team are always caring and professional. I've been a client of his for over 5 years and I've had several surgeries. Everything has healed perfectly. I highly recommend Dr. Krauss.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "100675229188923859487", "name": "Wanda Adams", "time": 1557398687300, "rating": 5.0, "text": "Everyone was very professional and really cared about your needs.  I was referred to Dr. Krauss and was very pleased with how I was treated the moment I signed in.  I would recommend Dr. Krauss and this practice to anyone that is in need of an orthopedic doctor.", "pics": null, "resp": {"time": 1558556381815, "text": "Thanks so much for the review!"}, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "101554875434855133039", "name": "Alta Crane", "time": 1541809559727, "rating": 5.0, "text": "DrKrauss shows genuine concern for his patients. Nursing personnel are very courteous. Dr Krause explains in easy language what the problem is and how it can be fixed. Would highly recommend this clinic", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "118341767570868752438", "name": "Kerry Allgood", "time": 1548257550545, "rating": 5.0, "text": "Very good surgeon. Great with diabetics with feet and ankle problems.", "pics": null, "resp": {"time": 1549310208825, "text": "Thank you for the feedback.  Our goal is to provide excellent patient care!"}, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "108296121202725230158", "name": "Cecelia Tropeano", "time": 1551403595757, "rating": 5.0, "text": "Warm and friendly personnel as well as helpful. Overall atmosphere a plus!", "pics": null, "resp": {"time": 1551900787186, "text": "Thanks for the feedback!"}, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "107863049069953637127", "name": "Leigh Anne", "time": 1557373969539, "rating": 5.0, "text": "I have received excellent care from Dr. Krauss and his staff for a fractured calcaneus resulting from a fall from a step ladder.   I have a metal plate and screws in my heel.  Never having broken a bone prior to this, this injury was very traumatic for me and Dr. Krauss always explained what was going on with my foot, how to care for it, and what my long term outcome might be.  The wait time to see Dr. Krauss is reasonable and his staff is always friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "107792710342633584236", "name": "Liz Donnelly", "time": 1543963536574, "rating": 5.0, "text": "Dr. Krause did surgery on my foot- Morton neuroma- I was so pleased with surgery, post recovery, and office visits. I saw doctor on pre visit, nurse practitioner second visit, and doctor on final visit. I feel that all my questions and concerns were answered.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "101207518840054051203", "name": "Larry Reed", "time": 1542252929728, "rating": 5.0, "text": "For years I have experienced trouble with a dia betic foot break. I thought it would be an afiction I would bear the rest of my life.  Then I found Dr. Krauss and Southlake Orthopeadics.  Relying on his expertise, I decided to undergo a procedure that has changed my life. I now have hope of living pain free and freedom of movement that gives me the ability to once again perform daily activities with my wife and grandkids.\nThey are friendly and professional and make me feel like I am their only priority.\nThanks Southlake and a very special thanks to my doctor, William Krauss.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "111485316601673798801", "name": "Gary Garner", "time": 1555768528217, "rating": 4.0, "text": "Staff was very friendly and helpful .", "pics": null, "resp": {"time": 1556142342374, "text": "Thank you for the feedback."}, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "115681140078948493057", "name": "Lashunda Dunn", "time": 1563891686518, "rating": 5.0, "text": "Very caring and hands on Doctor", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "114773578942099414955", "name": "Missy Gilbert", "time": 1543936818087, "rating": 5.0, "text": "Dr. Krauss and staff are caring.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "100283879706519445282", "name": "Michael Letson", "time": 1564065680257, "rating": 5.0, "text": "Good surgeon.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "105209439875682882898", "name": "Melody Jones", "time": 1547859328911, "rating": 5.0, "text": "My dad’s Primary Physician referred to him for diabetic foot issue.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xd342ce7858f3d7ae"}
{"user_id": "104452176598356050647", "name": "Pennie Miller", "time": 1615573798730, "rating": 5.0, "text": "It was my first time going there and it was great..Checking in was fast and efficient..the wait time was minimal and the staff that I came in contact with were all great..", "pics": null, "resp": {"time": 1616095947665, "text": "Thanks for the review, Pennie! Should you and your family ever need our services again, we're prepared to give you the same great experience every time."}, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "107038967153101097651", "name": "Meg Harris", "time": 1615462254597, "rating": 5.0, "text": "On time appointment, very friendly staff, clean environment, excellent doctors. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "111484644289576320269", "name": "Tonya Blevins", "time": 1605801490993, "rating": 5.0, "text": "Had a great experience with Dr. Booker. He is very through explaining procedures, images, and so forth so that it is easily comprehended. He actually takes the time to listen to any issues/concerns you may have and provides viable treatment options to correct injuries.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "102294150637100372858", "name": "George Meighen", "time": 1612484914515, "rating": 5.0, "text": "Amost no wait, and Dr. Booker carefully explained his recommendations. Even helped me on with my shirt.", "pics": null, "resp": {"time": 1612822117205, "text": "Thank you for the review, George! We're thrilled that your experience was great enough to share."}, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "107978761684710685715", "name": "Kenneth Riddle", "time": 1602082525013, "rating": 5.0, "text": "Awesome experience and an overwhelming feeling of comfort by the entire staff. Extremely through and professional.  I am 1000% better today and finally see a end to my pain and suffering. Loved the experience and ABSOLUTELY recommend Southlake Orthopedics and will shard with all my friends.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "112176051953588629841", "name": "Foxz Fan", "time": 1615267167548, "rating": 3.0, "text": "The wait was not long to either get back to see the doctor or for the doctor to come in and see you but I did have to re-enter my cards and info that I just entered 48 hrs. ago into the system. That was totally redundant. Why do both?\nI HATTED the fact I did NOT see the doctor but his assistant and was not made aware of this fact until she came in.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "107656513904757477936", "name": "Janice “3ksmama” Earley", "time": 1604069861936, "rating": 5.0, "text": "I really can see that he is concerned about my care! I recently had a tibia fracture and saw him after an ED visit, from day one I could tell he was a gonna be my doctor. Brooke is just as wonderful!! Thanks so much!", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "109419555090942579846", "name": "Sharon Avinger", "time": 1605111039750, "rating": 5.0, "text": "Dr Booker is an excellent orthopedic surgeon.  My family has been treated by him for the past 10 years.  Check out Southlake Orthopedics website.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "118397841276240298055", "name": "Jennifer Pizzitola", "time": 1593096673492, "rating": 5.0, "text": "Dr. Booker is patient and kind. My mom has dementia, and he took the time to sit and listen to her. He explained her injury in a way she understood, and answered any and all questions that we had. I left his office feeling like my mom is getting the best care possible. I will most definitely refer my friends to him!", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "100564477374382052824", "name": "MW M", "time": 1593026153806, "rating": 5.0, "text": "Dr. Booker is extremely knowledgeable and put my family at ease. He’s very good at what he does!  If we need an orthopedic surgeon again, we will absolutely see him!", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "116522093435319405403", "name": "Michael Alexander Urbanek", "time": 1607703628110, "rating": 5.0, "text": "Dr George Booker is an excellent Orthopaedic Surgeon!!! Dr Booker is personable, honest and open to talk with and to explain your diagnosis or issue in simple, laymen terms!\nIf you need an Orthopaedic Surgeon, such as\nDr Booker, SouthLake Orthopaedics has a good number of highly skilled and trained Orthopaedic Surgeons who can take care of your orthopaedic needs!", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "100879744739172185684", "name": "Alverdean Bonner", "time": 1593623090317, "rating": 5.0, "text": "This was my first visit. I was very impressed with the kindness of the staff. Dr. Booker was very thorough and compassionate. Overall it was an excellent experience.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "105771758623549750231", "name": "Ally Sutton", "time": 1583518225915, "rating": 5.0, "text": "Dr Booker is very thorough and answered every question I had. His bed side manner is very calm and patient and never made me feel rushed. His team of nurses are awesome and I love all the reminders they give you for your appts!  Highly recommend this practice!", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "103308379967323071451", "name": "Amber Henson", "time": 1591198462216, "rating": 5.0, "text": "LOVE THE STAFF!! They were so wonderful, every single person there between checking in, to checking out! I highly recommend anybody to see Southlake Orthopaedics! Dr. Booker and his PA will be the only ortho team I use!", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "102154644758459556090", "name": "Rhonda Syphurs", "time": 1553398731937, "rating": 5.0, "text": "Dr. Booker is great! He has helped me work through a lot of pain with both of my knees, and did a great job with my knee replacement. He is compassionate and straightforward. Southlake Orthopaedics is great facility.  They also have their own MRI and physical  therapy in house, making treatment and communication very cohesive. I wouldn't go anywhere else!", "pics": null, "resp": {"time": 1553631708467, "text": "Thank you for the feedback.  Our goal is to provide excellent patient care!"}, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "111028915060107432406", "name": "Don Collum", "time": 1590690386314, "rating": 5.0, "text": "Always friendly and knowledgeable nurses.  Doctor Booker is always ready to answer questions and take time with us.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "104346965286962657827", "name": "Ken Coker", "time": 1598491460155, "rating": 5.0, "text": "Dr. Booker and his staff are great. I could not have asked for better care!!", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "109856723147380457595", "name": "kaye S", "time": 1578515029467, "rating": 5.0, "text": "At this point all I can do is say very good things about Dr. Booker & the staff. I have not had any procedures thus far. Everyone I have talked with & dealt with have been very courteous & professional. I already have a great feeling about any future dealings with everyone at this office.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "103896768406205885968", "name": "Leslie Meyer", "time": 1567609699520, "rating": 5.0, "text": "Staff is very nice and helpful. Dr. Booker is great at listening and assistance in my healing process.  Highly Recommend him. Never have to wait long either.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "101308981008347490348", "name": "Gay Mize", "time": 1560969322054, "rating": 5.0, "text": "Dr Booker is a wonderful surgeon and Dr. He has operated on me and my husband Ross ,several times. We are satisfied with his performance and his bedside manner. He has a great personality also. Thanks for allowing me to tell you how we feel.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "101162029930051203301", "name": "David Alaniz", "time": 1562948304382, "rating": 5.0, "text": "I have had nothing but excellent care from both the doctors and staff. The doctors have been thorough in their evaluation and treatment. The staff has always been kind and courteous at each visit.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "101444191864515845557", "name": "Frances Cheatham", "time": 1555025357692, "rating": 5.0, "text": "Dr. Booker has been very informative and really takes the time to explain things! The front desk staff are always nice and there to help with any questions! I am very pleased with my visits to this office.", "pics": null, "resp": {"time": 1548781494015, "text": "Thank you for the feedback.  Our goal is to provide excellent patient care!"}, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "118219048947949197907", "name": "Lillian Joan Redwood", "time": 1556170544897, "rating": 5.0, "text": "Staff is always friendly and secretarys are very helpful if needed with survey. Dr Booker explained about my knee in a way that was easy to understand. He never seems to rush and is very thorough with his examination.", "pics": null, "resp": {"time": 1548781396037, "text": "Thank you for the feedback.  Our goal is to provide excellent patient care!"}, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "112883608039396637016", "name": "DAWN THOMAS", "time": 1573226426217, "rating": 5.0, "text": "Everyone is always so nice and warm .Yet professional. Gives me confidence to take it slowly, follow their advice and everything will be ok.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "106361224684958359285", "name": "Howard Brown", "time": 1565460577470, "rating": 5.0, "text": "Staff was very friendly and all had smiles. Dr Booker was great as well. We appreciTed that he spent time to talk with us both in the hospital post surgery and in the office.\n\nThank you", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "109886574603951223824", "name": "rosilyn wilson", "time": 1548524006636, "rating": 5.0, "text": "Everyone is so nice at this office, Never had a long wait to see Dr Booker\nI have had two knee replacements.  I highly recommend Dr. Booker and his staff Great service!", "pics": null, "resp": {"time": 1548781330057, "text": "Thank you for taking the time to provide feedback.  Our goal is to provide excellent patient care!"}, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "101204333156111524228", "name": "Wayne Godbee", "time": 1544055364168, "rating": 5.0, "text": "I have been using Southlake for a few years now. The staff and doctors are always eager to help in any way they can. Always a pleasant experience when I visit. Recently had outpatient shoulder surgery and the care and after care I have recieved has been excellent.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "101224363553314344099", "name": "Hazel Tosti", "time": 1551322882654, "rating": 5.0, "text": "The visit was great. The staff is very professional but also sweet and friendly. The procedure was gentle and comforting. Thank you.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "102424934537268876373", "name": "Rick", "time": 1558140540876, "rating": 5.0, "text": "Dr. Booker was very knowledgeable, helpful and very easy to talk too.  I would recommend him and his staff to anyone.", "pics": null, "resp": {"time": 1559384938824, "text": "Thank you for the review.  Our goal is to provide excellent patient care."}, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "113297856131402884146", "name": "Michael Hebert", "time": 1543418525162, "rating": 5.0, "text": "Southlake Ortho is great.  Dr Booker has been my medical care taker forbmsnynyears. He is thorough in his findings and offering options for you to make a choice!! The front desk staff and behind the scenes staff has been very pleasant! Thank you guys for the work you put into caring for the patients!! 👍🏽", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "109418152193070918159", "name": "J Smith", "time": 1566055909023, "rating": 5.0, "text": "Great and friendly staff. Having surgery done soon. Will update more.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "104034073700358039701", "name": "Second2none", "time": 1531792348338, "rating": 1.0, "text": "Dr  Booker, did not show any concerns did not touch me or ask questions about how I felt or the issues I was dealing with. I personally did not get a bedside manner dr that I am used to. He had know emotions whatsoever. His office was friendly and polite.  I personally would not refer him to anyone and I'm in the medical field.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "104018095169555530601", "name": "yvette moon", "time": 1554992278497, "rating": 5.0, "text": "Dr. Booker is a very caring and compassionate dr. Not like many of those who treat you like a number and not a person ,if I could I would go see dr. Booker for all my medical needs.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "110045790109187909406", "name": "nope", "time": 1547170958322, "rating": 5.0, "text": "Dr.Booker genuinely was concerned about my issue and made sure I understood everything that was about to take place.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "112345106210900290037", "name": "Taylor Grant Brooks", "time": 1541613879374, "rating": 5.0, "text": "Highly highly recommend Dr. Booker. Never dealt with a doctor more informative, understanding, and down to earth.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "118303582179176681090", "name": "Jeff Wheeler", "time": 1544815039979, "rating": 5.0, "text": "Dr. Booker is great! Very caring! I would recommend Dr. Booker to everyone!", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "101423911336297415949", "name": "Mary Belle Van Der Noord", "time": 1554474241961, "rating": 5.0, "text": "Wonderful experience here, such a caring staff, prompt service, timely communication, and Dr. Booker is the best! Thank you all so much!!", "pics": null, "resp": {"time": 1554754734995, "text": "Thank you for the feedback!"}, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "109823138312601826121", "name": "M Lowery", "time": 1594255043275, "rating": 5.0, "text": "Polite and professional!", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "110588703638616900603", "name": "Michelle Gurley", "time": 1566047692278, "rating": 5.0, "text": "Amazing staff and Doctors.", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "101155293730850223631", "name": "John Bearden", "time": 1562891354863, "rating": 5.0, "text": "Great physician!!!", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "112922028208147271788", "name": "nyoka geyser", "time": 1559920046661, "rating": 5.0, "text": "Had good experience", "pics": null, "resp": null, "gmap_id": "0x888922bd85c058bf:0xc6f5afebc439326e"}
{"user_id": "103531905960538569572", "name": "Regina", "time": 1611862196954, "rating": 5.0, "text": "Very pleased with my SNS manicure. I’m from out of town, visiting my mom and she recommended Paradise Nails. I made an appointment and did not have to wait. They had a good selection of colors to choose from and the lady that did my nails was very efficient and did an excellent job! Will definitely come here again next time I’m in town.", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "101043688529365058520", "name": "myriah dishong", "time": 1618039130777, "rating": 1.0, "text": "UPDATE: my nails are already cracking after 12 hrs of having them!!!! 🤬\nI got SNS and a pedicure here today and i am NOT pleased at all. My nails have scruffs all over them. The lady that was doing them was in a rush and you could tell she was rushing. I still have dry skin on my feet. Took my mother in law with me and she still has skin on her feet too!!! Only thing that looks good is the polish on our toes. Don’t go here unless you want to walk out with the same crusty feet you had when you walked in and bumps on your finger nails. DO NOT RECOMMEND AT ALL.", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "109338762932304711684", "name": "L Murr", "time": 1620741334926, "rating": 1.0, "text": "Was very disappointed in my mother/daughter Mother's Day mani/pedi.  My pedicure was fine.  I asked for a manicure with just clear on my natural nails.  Normally you would get your cuticles pushed back, cleaning under the nails, skin trimmed, etc.  The lady doing mine was in such a hurry and the shape of my nails was horrible.  My daughter asked for different color on each toe and was charged xtra.  Won't be back that's for sure.  There is a reason there wasn't a line of people on the Saturday before Mother's Day.", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "105702698951283710977", "name": "Kimberly Brown", "time": 1610232870974, "rating": 5.0, "text": "Very clean salon and nice staff they do great work", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "117900707069964814492", "name": "Mary Knight", "time": 1569792116443, "rating": 5.0, "text": "It was very clean, very neat. It was quiet. Would have liked some music or something, but my main was great, and my boyfriend said it was the best pedicure hes had.", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "101016517001253256942", "name": "Sandi Cushway", "time": 1583698691427, "rating": 5.0, "text": "Great service at a great price. Super nice employees.", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "101057846163205090975", "name": "Brittany Hussey", "time": 1532293610858, "rating": 5.0, "text": "Best Nail Salon I’ve been to so far.\nI moved here 2 years ago and have been to several Nail salons. This is the first one that I actually like. The owner was SO nice! AND she appreciates your business!", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "102497301180580269562", "name": "Tiffany Bentley", "time": 1582575702434, "rating": 1.0, "text": "My nails look horrible. I asked for BLACK and Grey and got dark purple with sparkles... not to mention the quality of the nail work done is seriously lacking...", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "104235261050731830839", "name": "Sharon Weeks", "time": 1540307707273, "rating": 5.0, "text": "Beautiful relaxing and so CLEAN. Best pedicure I've ever had! This is my new favorite nail salon.", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "105138675894355686756", "name": "Angela A", "time": 1580668641104, "rating": 5.0, "text": "Great service. Nice staff.", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "104096097184082974491", "name": "Jennifer Watts", "time": 1562246138027, "rating": 5.0, "text": "My go to place  hardly any wait! Love how thin Sns nails are", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "114568924252201461354", "name": "Whitney Cruthird", "time": 1576519705778, "rating": 1.0, "text": "I went in for sns and sat there with my nails soaking for an hour. The lady who did my nails did a horrible job that the next day they started chipping and cracking. I literally sat there for over 2 hours, which should have been a warning sign. I will not go back and I do not recommend.", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "107420477206083513988", "name": "Geri Genovese", "time": 1605455395081, "rating": 1.0, "text": "Awful. Buyers beware.", "pics": null, "resp": {"time": 1610818742605, "text": "Very vague review. All readers would like to know why you think it is \"awful\". From reading other reviews on this site as well as other media, your review is an outlier, far from the vast majority of reviews. I suggest you return and file a review with details that merit a professional review status. Paradise Nails strives to provide a good experience for our clients; even earning a top 5 finish in the local prestigious Lagniappe Awards."}, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "107061948462776552968", "name": "Sandi Cushway", "time": 1567374233524, "rating": 5.0, "text": "Have had a range of experiences here. Lately great service and excellent pedicure 👍👍👌", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "117237409465669320627", "name": "Myosha Thompson", "time": 1569260190506, "rating": 1.0, "text": "Really disappointed with my experience here. Not confident that their equipment is sanitary either. The place is new, but I didn’t see any cleaning or opening new tools. My feet peeled so bad after going here", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "102176871530880866317", "name": "Susan Berent", "time": 1538844682351, "rating": 5.0, "text": "Love this place. Peaceful, no tv! Soothing music. All the manicurist are friendly. Frenda is my personal choice. Her attention to detail is second to none.", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "116499317143723248433", "name": "Merrell Havens", "time": 1540159904738, "rating": 1.0, "text": "First place I chose because of high rating and reviews but info was deceiving. Hot, hot, hot inside. Staff was very unfriendly and place was old looking and not so clean. Glad I changed my mind and went to Bellagio Nails up the street. Pedi was the bomb!!!", "pics": null, "resp": {"time": 1610818332447, "text": "A very inaccurate review. The Salon was very new at the time of review, exceptionally clean with a 100% health and safety rating from the AL Board of Cosmetology. Obviously the reviewer was not from this area as the temperatures are very hot even in mid-October. Reviewer needs to return for an accurate review."}, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "102545653649398250576", "name": "Wanda Fields-Piepho", "time": 1554640323724, "rating": 4.0, "text": "Clean and quiet.   💅 are great!", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
