{"user_id": "114093766805360466208", "name": "T Perry", "time": 1600559907944, "rating": 1.0, "text": "This was the 4th and last time to visit here .In the past it was a quick okay place for a walk in massage, in the future I'll keep walking past.\nThe back massage was horrible it really hurt and the microwaved cover was way to hot.I told him this and apparently he didn't understand just kept right on pressing his arm/elbow into my back. The foot massage was rough and rushed. Left there mad and hurting and got to pay 50 bucks for it. Sure as heck wasn't relaxing much less magic. 🙄🤬\nFour hours later my back is reddened and sore.\nNEVER AGAIN.", "pics": null, "resp": null, "gmap_id": "0x8888a9e23a258e8d:0xb16103369f9f19ba"}
{"user_id": "112474316455215933749", "name": "Atieh Alipour", "time": 1605026614262, "rating": 1.0, "text": "Definitely I don’t recommend this place. They pretend they don’t understand English and they lie. One day I went there and bought a gift card for my husband. The other day my husband went there and the guy said you bought it from another person and he is not working here. They refused to do the service although I have already paid then $50. Not honest people.", "pics": null, "resp": null, "gmap_id": "0x8888a9e23a258e8d:0xb16103369f9f19ba"}
{"user_id": "103466017571782729087", "name": "Julia Hogan-Jackson", "time": 1552198924216, "rating": 5.0, "text": "I visited Tuscaloosa from Boston Massachusetts. After a long day of traveling. A massage was what I needed. It was wonderful. Truly relaxing. I left feeling better, more relaxed and with a smile on my face. I will defiantly visit again.\nFriendly costumer service. Nice", "pics": null, "resp": null, "gmap_id": "0x8888a9e23a258e8d:0xb16103369f9f19ba"}
{"user_id": "104830983196680111706", "name": "Jeanie Carmichael", "time": 1545254856376, "rating": 5.0, "text": "I come regularly to have either of them massage me. They are very sweet, and do a thorough, deep tissue massage. They use hot packs to help relax muscles also, which is very nice. The location at the mall is very convenient, as is the walk in service with no appointment necessary, however you may want to bring earbuds to block the background noise from the mall. The prices are very reasonable, and the loyalty program is a really nice bonus. I see people stop in for a short chair massage, which is great, but they are really missing out on the benefits and enjoyment of the full treatment .", "pics": null, "resp": {"time": 1546279816783, "text": "Ms. Jeanie, thank you so much for taking the time to leave this excellent review.  We really appreciate your business.  Please let us know what we can do for you in the future."}, "gmap_id": "0x8888a9e23a258e8d:0xb16103369f9f19ba"}
{"user_id": "111297869454385035928", "name": "Arpad Matta", "time": 1566352671783, "rating": 5.0, "text": "Communications not easy, but service is great. Really relaxing! Owen did a great job!\nReasonable prices! Try them, you won’t be sorry!", "pics": null, "resp": null, "gmap_id": "0x8888a9e23a258e8d:0xb16103369f9f19ba"}
{"user_id": "108136318294263069930", "name": "Kenneth McDavid", "time": 1545423356288, "rating": 5.0, "text": "William has magic hands. If you are looking for a great deep tissue massage, he is the right person for the job. I come fairly regular. I came here on there first week open and pointed an issue in my back and he pin pointed it and made it feel much better.", "pics": null, "resp": {"time": 1546279883009, "text": "Kenneth! Thank you so much for this great 5-star review.  We really appreciate you being a loyal customer and helping to share the word about us.  We’re here for you anytime.”"}, "gmap_id": "0x8888a9e23a258e8d:0xb16103369f9f19ba"}
{"user_id": "100688895661062895053", "name": "Wes Taylor", "time": 1570816573531, "rating": 5.0, "text": "Stop paying for a chiropractor to push on you for 20 minutes at $45 co-pay and spend the extra money to go see them. Relief last a lot longer. 🤗\nThey are great!!!!", "pics": null, "resp": null, "gmap_id": "0x8888a9e23a258e8d:0xb16103369f9f19ba"}
{"user_id": "116132897954832423524", "name": "Jeanetta Nixon", "time": 1564013414730, "rating": 5.0, "text": "I had a great experience with them today. I definitely would visit again. Cheers!!!", "pics": null, "resp": null, "gmap_id": "0x8888a9e23a258e8d:0xb16103369f9f19ba"}
{"user_id": "104063679383053078945", "name": "Lexiek98", "time": 1570208978716, "rating": 5.0, "text": "The best neck, shoulder, and back massage I've ever had", "pics": null, "resp": null, "gmap_id": "0x8888a9e23a258e8d:0xb16103369f9f19ba"}
{"user_id": "110833255332469075691", "name": "Chi Chi Clark", "time": 1541036740424, "rating": 5.0, "text": "Wonderful massage with inexpensive price. They may not speak good English, but they have magical fingers.", "pics": null, "resp": null, "gmap_id": "0x8888a9e23a258e8d:0xb16103369f9f19ba"}
{"user_id": "102012536406268066570", "name": "Wesley Taylor", "time": 1542912461533, "rating": 5.0, "text": "Wonderful people!!!! Massage is the best!!! I’m a regular.", "pics": null, "resp": {"time": 1543261722521, "text": "Thank you so much for this great 5-star review.  We really appreciate you being a loyal customer and helping to share the word about us."}, "gmap_id": "0x8888a9e23a258e8d:0xb16103369f9f19ba"}
{"user_id": "117329342664449646430", "name": "Cavad Abdullahi", "time": 1545187126353, "rating": 5.0, "text": "very good massage thanks guys", "pics": null, "resp": {"time": 1546281047056, "text": "Thank you so much for your five stars review, we appreciate your time and the extra effort it takes to provide your feedback."}, "gmap_id": "0x8888a9e23a258e8d:0xb16103369f9f19ba"}
{"user_id": "104388811711750354616", "name": "university wire", "time": 1545187295399, "rating": 5.0, "text": "everything is perfect thanks guys", "pics": null, "resp": {"time": 1546280699179, "text": "Thank you so much for the FIVE stars! We really appreciate you being a loyal customer and helping to share the word about us."}, "gmap_id": "0x8888a9e23a258e8d:0xb16103369f9f19ba"}
{"user_id": "107310478107099759148", "name": "Leah Diehl", "time": 1552247802373, "rating": 5.0, "text": "Great service and pricing!", "pics": null, "resp": null, "gmap_id": "0x8888a9e23a258e8d:0xb16103369f9f19ba"}
{"user_id": "115871048360521636150", "name": "Marcella", "time": 1562977698725, "rating": 5.0, "text": "Awesome !", "pics": null, "resp": null, "gmap_id": "0x8888a9e23a258e8d:0xb16103369f9f19ba"}
{"user_id": "110013757116188822831", "name": "Suleyman Abdullahi", "time": 1545187228760, "rating": 5.0, "text": "thanks guys", "pics": null, "resp": {"time": 1546280890560, "text": "Thank you for taking the time to write about your experience. We look forward to working with you again in the future."}, "gmap_id": "0x8888a9e23a258e8d:0xb16103369f9f19ba"}
{"user_id": "104276272897408955517", "name": "Ilahe Ugurluyeva", "time": 1545187361652, "rating": 5.0, "text": "thanks guys", "pics": null, "resp": {"time": 1546280575877, "text": "IIahe, wow!  Thank you so much for this great 5-star review"}, "gmap_id": "0x8888a9e23a258e8d:0xb16103369f9f19ba"}
{"user_id": "106596664635213711037", "name": "kris boddicker", "time": 1627180423844, "rating": 5.0, "text": "Nice people. Relaxing atmosphere. Will come back.", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "100036053899466521185", "name": "Kathleen Jackson", "time": 1618569414348, "rating": 5.0, "text": "Amazing amazing and AMAZING I can't wait to go back awesome for people who suffer from neck and back pain", "pics": null, "resp": {"time": 1618845199598, "text": "We really appreciate that feedback."}, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "115783828497122527480", "name": "Kenny Duckett", "time": 1605986011614, "rating": 5.0, "text": "Best massage I ever been to and the only one I will ever go", "pics": null, "resp": {"time": 1618845193016, "text": "We really appreciate those kind words! Thank you!"}, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "113665206978458341318", "name": "Ruth Lu", "time": 1573959478933, "rating": 5.0, "text": "I did the massage today for my shoulder pain and lower back pain. They provided a very good service. After an hour massage, I felt sooooo relaxed. My daughter also did the message and she loves the hot stones. HIghly recommend this place.", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "117440519863517943659", "name": "Alley", "time": 1548362602729, "rating": 5.0, "text": "It was great!  The hot stones were awesome.  Nice,  quite and clean place. She gave an excellent massage. Recommended! Thank you!", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "104100124821954683820", "name": "Tami Newcomb", "time": 1567533211170, "rating": 5.0, "text": "I'm thrilled with the massage I NEEDED today for lower back pain. Although they were somewhat busy, they were able to take me as a walk-in right away for an hour massage!  Woo hoo!  The hot stones were an amazing surprise as was the complimentary bottle of water as I was leaving.  I love this place!  They offer soooo many services, too.", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "110718414573292198249", "name": "Elizabeth Bowles", "time": 1571940768477, "rating": 1.0, "text": "Did not get a good massage the other day from the Male that works there so I called today to make an appointment with a female. They said okay, no problem. I get there a few minutes before my appointment time and they confirmed \"you want a female, right?\" I told them yes and then they said they couldnt do my appointment time. Very dissatisfied with this. Will not be going back.", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "106786700266167435693", "name": "Mike Morris", "time": 1561325629970, "rating": 5.0, "text": "Great massage. Was great at working on problem areas. Very warm and friendly.", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "110602284738003656933", "name": "steven chamberlain", "time": 1563135556769, "rating": 5.0, "text": "They do a good job and you actually get a 60 minute massage when you pay for an hour.", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "111621995931802610067", "name": "jess mathis", "time": 1562699816745, "rating": 5.0, "text": "I always received nice customer service and they do a good job.", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "111538996479621250639", "name": "Kim Steakley", "time": 1556379595147, "rating": 5.0, "text": "Clean,quite and get full attention to address your needs!", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "102313763455952326307", "name": "Cin Drake", "time": 1550590484361, "rating": 1.0, "text": "you all need to call me I am in pain due to your male person who gave me a massage", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "101105021500796897381", "name": "Jennifer Hunt", "time": 1545709640615, "rating": 5.0, "text": "Most amazing couple's massage that my husband and I have ever had!!!!! Highly recommend!!!!", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "109999657419468238239", "name": "J C", "time": 1574448946382, "rating": 1.0, "text": "This business has been recently closed.", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "110226696337055268857", "name": "Sabas Ck", "time": 1550671148536, "rating": 5.0, "text": "Clean and nice stuff", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "116285228200825429462", "name": "Sabasi Kimaro", "time": 1550361324615, "rating": 4.0, "text": "Liked it", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "111116938895707818024", "name": "Jarrod Smallwood", "time": 1628089505463, "rating": 4.0, "text": "Very nice massage, scheduling is a problem as I have consistently arrived at scheduled appointment and told they are very busy that it will be a later appointment time.. But, when you get in the massage is great!!", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "113661817999428310214", "name": "Shakeria", "time": 1613362949716, "rating": 4.0, "text": "I'm from Birmingham, al and every time I come to Huntsville I go here to get a massage. They're professional, kind, and I LOVE that they don't beg for a tip which makes customers feel more comfortable to give one.\n\nPro: is that you free hot stone included. Get techniques from the therapist. Will work longer on areas that you specify.\n\nCon: sometimes they get the stones when the session is almost over so you don't really get to enjoy it as much. I would work on that consistency if I had to provide any feedback.", "pics": null, "resp": {"time": 1613689031860, "text": "Dear Shakeria, thank you very much for your comments and suggestions. Next time if you come here, you can ask the masseurs first if you have any requirements, including the hot stones that stay longer. They will do it the way you like.  , Try to achieve your satisfaction and look forward to your next visit!"}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "108838294777568529591", "name": "CJ Donovan", "time": 1623455913887, "rating": 5.0, "text": "This was my first massage and I wish I caught the lady’s name she was wonderful. I will be going again soon.", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "100169918371893816447", "name": "Veronica Villa", "time": 1602125335634, "rating": 5.0, "text": "I have experienced the best message in town. Your knowledge of the oils as well as the ability to respond to my personal tensions and strains is exceptional! Will definitely come back. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "103066076422698975422", "name": "Abigail Morey", "time": 1602127441892, "rating": 5.0, "text": "One of the best massages I have ever had! Remarkable and very enjoyable. Came in feeling stressed and left feeling relaxed and happy! Thank you thank you!", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "117705950553304109049", "name": "Michael Lee", "time": 1602124733679, "rating": 5.0, "text": "I had a wonderful massage here in Rose Massage. It was very relaxing, really helped my back pain. Have booked a full session and looking forward to it. :)", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "110890066684195266828", "name": "Terrell Nixon", "time": 1580482509817, "rating": 4.0, "text": "My neck and back hurt so was looking to get it worked out.  Was a little skeptical after reading some of the reviews but thought would give it a try.\n\nI was pleasantly surprised.  I called.to make a appt for a other day as it was late.  They said they had a table open so I went on in.  The place is in a small strip mall but most of them here in Huntsville are.  Once you get inside looks like most small massage places.  I have included a few pictures from their website as they are accurate of what you actually see.\n\nThe lady was very nice and very professional.  She gave me a very relaxing massage.  I would have like a little more work on my neck but I did say anything as I wanted to just see what was their normal.  Only other improvement I can think of is she did not do the front of my legs at all.  Since I do alot of lifting and crawling around that is always a sore spot.  But over all I left feeling very relaxed.\n\nI did opt for the shower table as some recommended to get the oil off.  Again very professional and make sure \"everything\" that needed to be covered stayed covered.  Thought it might be awkward but the way she did it made it feel very professional so really did not even think about it.\n\nThe only real negative I can say is the same as of other peoples reviews.  They leave the door slightly open so anyone walking by can see in.  I understand from a security view but the walls are paper thin (like most every other place you get a massage) so you can hear everything so I do not really see that the pros outway the cons for doing this.  I could not really relax and although I really like this place it was the reason for 4 stars vs 5 stars.  It also would be the one thing that made me look somewhere else ☹.\n\nAlso one note since it came up in some of the other reviews.  No one pressured or even asked me for a tip.  I did give her one as she did a good job but she never asked.  The only thing they asked was if I would like a 4 hand massage (I only booked a 60 min) and when I said not tonight that was that.\n\nOver all a great place and so far I recommend it for a great relaxing massage if you dont mind everyone that walks by your door seeing in 🧐.\n\nWill update if I go back.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOA1FbHtCamDoFPPdQMGkYztFVFx2ThZNK83lYB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPzJSml9LE8V6WWeNTZyOMMsnBursNL_BGv5fqt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMNHV4HZpfhPDmPBQ9S1sMAcpQGLrFHWfO65-f7=w150-h150-k-no-p"]}], "resp": {"time": 1590289416354, "text": "Hello, Terrell. Thank you for giving us the opportunity and we are glad you like our services. We keep improving our management and services base on our customers' feedbacks. Thank you for your business and hope to see you soon."}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "113848142815553842767", "name": "andrew ausin", "time": 1600109087914, "rating": 5.0, "text": "Always very nice and courteous, I always call ahead and can get in same day. I’ve gotten the standard massage every time and they always help my back feel a lot better!", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "114489989722112835516", "name": "Jack Smith", "time": 1570119675842, "rating": 1.0, "text": "This was not a good experience at all. I thought I would give them a try. Opted for the 4 hand massage as it was supposed to be their best. The whole time door left open so one of the masseuse could go and deal with people coming in dealing with them at my door, and answer the phone. The 2 ladies talked the whole time to each other like gossiping, but couldn't understand them. The lady answering phone and stuff wasn't even in room half of the time. She finally just brought the phone in with us and just started answering it there. As I was leaving the girl giving the massage ask for tip. I thought well she did give pretty good massage herself and tipped her. Then she fussed saying it was 2 of them I needed to tip the other lady to! And kept insisting! I just left, $120 massage and $20 tip. Save your money and go elsewhere.", "pics": null, "resp": {"time": 1590272689788, "text": "Hello, Jack. Thank you for your feedback. We appreciate our customers' feedbacks because that’s how we can improve our management and services. We do have rules like no talking during massage sessions, no asking tip after services etc. We now have highly trained therapists and and we will prevent these happening again. Thank you. We try to create a relaxing and comfortable atmosphere for our customers. That’s how we gain so many loyal customers. Thank you."}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "118105687681576768947", "name": "Prodigal Son", "time": 1596740360131, "rating": 1.0, "text": "Real bad experience I had with these people first I called 20 mins before coming in I was told to do so once I get to both locations they told me they made a mistake and that they were closed. BAD BUSINESS", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "114878690611147766973", "name": "Gary Counts", "time": 1547070213555, "rating": 5.0, "text": "This location bis conveniently located behind Whole Foods off Memorial Parkway.  They have a useful online web page for making appointments.  There wasn't any wait.  The quality of the service was quite high and they very generous with the time.  The price is reasonable and they off a hot towel after the massage.", "pics": null, "resp": {"time": 1556402224709, "text": "Dear customers, thank you very much for your feedback. We hope every customer will be satisfied with the service, hope to see you again"}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "107588215146063683385", "name": "Cole Joe", "time": 1524527623238, "rating": 5.0, "text": "Great location! Love the new system with the iPad. Tranquility room is nice and I had the best massage of my life with Jesse! I needed to focus on my neck and shoulders and that's exactly what we did. Thoroughly enjoyed my visit and can't wait to come back", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "100688449388526103103", "name": "Rell Global", "time": 1598476760598, "rating": 1.0, "text": "I called to schedule an appointment over the phone a couple of times and got hung up on. I just asked if they take walk-ins..", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "117394848795114473365", "name": "Daniel Ramos", "time": 1567111630259, "rating": 5.0, "text": "Anna was amazing! I’ve already let her know I’ll be back shortly! Very professional and made me smile and relax!", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "101280566979106369866", "name": "Michael McCorvey", "time": 1544589469651, "rating": 5.0, "text": "Tonight was my first time going and it was great! My masseuse took care of my problem areas and made sure the experience was enjoyable the entire time. Definitely going back!", "pics": null, "resp": {"time": 1556402238182, "text": "Dear customers, thank you very much for your feedback. We hope every customer will be satisfied with the service, hope to see you again"}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "116045986498584128866", "name": "Jersey Mara", "time": 1524526835635, "rating": 5.0, "text": "Just went today and the massage was great. They ask you if you have any areas that need to be focused on instead of giving you a basic massage. I highly recommend.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM1r1wfYbQgfQ0ogCML9SiNr21laOqiqfcofcrH=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "109460631276443145530", "name": "Een angle", "time": 1525836987111, "rating": 5.0, "text": "This place is a gem! I started going here after my spin instructor told me about this place.  I can get in almost immediately when I call.\n\nThey don't speak english very well but it doesn't matter.  They have a 60 min $60 special and you can't beat that.  The massage therapists always ask how much pressure you want, and if you want deep- some of them go DEEP... so make sure to let them know.\n\nI don't want to tell you who I request because you will steal them from me.... Okay... Hidy and Sheliy are who I really like.  I have used others and they are great too but these two really know how to get into my target areas.\n\nSide note: when they leave you alone for a few min don't get scared (I did the first time) but they are getting hot towel to remove the oil.  Just wait it out...\n\nEnjoy!!", "pics": null, "resp": {"time": 1527364835788, "text": "Thank you for your evaluation of rose massage. We will always provide the best Asian service for every customer."}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "109393312889510791773", "name": "Gene Peppers", "time": 1568629813366, "rating": 5.0, "text": "Very nice people, Great Massage, Reasonable Prices", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "106360557388026069862", "name": "Mongo Slade", "time": 1580434494663, "rating": 4.0, "text": "Would give a 5 but begged for a higher tip", "pics": null, "resp": {"time": 1590291128348, "text": "Hello, Mongo. Thank you for your feedback. I am the manager of Rose Massage. We never allow therapists to ask for more tips and we will dismiss the therapists who get three warnings. We apologize for what happened. Thank you for your business. We now have well trained professional therapists will offer the best customer service!"}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "108100791045573897721", "name": "Bill Collins", "time": 1536199981877, "rating": 1.0, "text": "Don't waste your time.", "pics": null, "resp": {"time": 1590289027977, "text": "Hello,Bill. Thank you for your feedback. We appreciate our customers' feedbacks because that’s how we can improve our management and services. Please let us know specific what was the wrong with your service. Feel Free to contact us anytime. Thank you."}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "118059502858276407216", "name": "Joseph Kalsic", "time": 1565141352118, "rating": 5.0, "text": "Excellent and very professional.", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "113438411969094385186", "name": "T", "time": 1544560123938, "rating": 1.0, "text": "Rushed service....not going back", "pics": null, "resp": {"time": 1590289248106, "text": "Hello, dear customer. Thank you for your feedback. We keep improving our management and services base on the customers' feedback. In order to prevent rushed services, we time every customer's services to make sure there is no short for time. Thank you."}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "104046406647023113419", "name": "Jeremy Alexander", "time": 1538413335790, "rating": 5.0, "text": "It was great!", "pics": null, "resp": {"time": 1556402248760, "text": "Dear customers, thank you very much for your feedback. We hope every customer will be satisfied with the service, hope to see you again"}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "117974620641627773910", "name": "Brian Lucas", "time": 1614194145658, "rating": 5.0, "text": "Best massage in town. The rooms are clean, they pay attention to you and really give a great massage. The girls there are legit and really know their craft. A+ . I would not visit another massage store in Huntsville after going here.", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "115057966642181500019", "name": "Hope G", "time": 1616607233168, "rating": 5.0, "text": "I got a massage today by Michelle I think her name was. She was so polite and friendly. She also made me feel extremely comfortable and the massage was amazing. I will absolutely be going there again.", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "115740771970887874113", "name": "Mr Ken", "time": 1613506595874, "rating": 5.0, "text": "I visited Massage Shang after reading their reviews. I must say i wasn't disappointed. One of the best massage i have ever had. Lily is good and professional. I would recommend her!", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "115809871685816633950", "name": "joel lightner", "time": 1614129530048, "rating": 5.0, "text": "My first ever full body massage did not disappoint! Excellent prices, super friendly staff, and left feeling like a million bucks.", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "113883741307465607053", "name": "Almosta Farm", "time": 1613198894736, "rating": 5.0, "text": "This is our first couples body massage. They made us feel very comfortable, and accommodated us however we needed. Loved it!", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "105247563307918262792", "name": "Adrian Abshire", "time": 1599256619004, "rating": 5.0, "text": "My visit was excellent - the masseuse was very good and friendly. She helped with all the sore spots and did not rush.  I feel great and reinvigorated.  The waiting room is nice and the rooms are clean and very comfortable.  Will recommend to my family and friends.", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "106786700266167435693", "name": "Mike Morris", "time": 1615486443549, "rating": 5.0, "text": "Great massage! Very professional at what they do and an extremely clean environment.", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "113587920983634474612", "name": "Phyllis Gibbs", "time": 1621171149264, "rating": 5.0, "text": "Was not impressed at all !!!! After you pay for your message they try to tell you how much to tip!!! Some of the things they said was very inappropriate!!! I will not go back there!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "117855170616509103953", "name": "Curt Bevington", "time": 1575113096697, "rating": 5.0, "text": "Outstanding!  Service, professionalism, atmosphere and price are great but the staff, Michelle, Heidi and Mia make this my go-to place to fix the knots whether from work, traveling or just sitting on the couch too much. The quality is top notch and compared to most, they rank at the top of a long list of providers. I've walked in without appointment and called ahead and always the same great service. You will not be disappointed with Shàng or the Ladies who will leave you relaxed and revitalized. My thanks Ladies and I'll see you again soon.", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "117575393912148835488", "name": "Tanveer Zia", "time": 1569034099427, "rating": 5.0, "text": "Amazing service every time, very professional staff, clean and tidy spa. Went for a couples massage twice now, once foot massage and once table massage. Heidi is amazing (wife’s favorite) and Mia is awesome too. You cannot go wrong at Massage Shàng!", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "108299688051520384962", "name": "MARGARET PENNY PTERNITIS", "time": 1569097311640, "rating": 5.0, "text": "I went because I had purchased a Groupon for a 60 minute foot massage. Place is nice and clean. Michelle is AMAZING! I have diabetes and she made my feet feel so much better. Cannot say enough good things about them, will be back soon!", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "102915381430925080577", "name": "S A", "time": 1569034282640, "rating": 5.0, "text": "The BEST and only massage spa I will go to in Huntsville Madison area. Nicest sweetest ladies work here, I always have a good time and feel like a new person walking out of Massage Shàng. They take care of you like real friends ❤️", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "104204199297402360674", "name": "Mike Williams", "time": 1567832917495, "rating": 5.0, "text": "Amazing massage therapy by Mia. Nice, friendly and very professional. She has the gentle hands of a delicate woman but the strength of a strong man. Can cater to any level of intensity. Would definitely go back again.", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "118358740373707670474", "name": "Scott G.", "time": 1583202431874, "rating": 5.0, "text": "Tried Massage Shang for the first time and have to say the massage I was received was outstanding.  Very clean and friendly establishment.  Prices are also unbelievably low over commercial massage establishments.  I will definitely be a repeat customer.", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "115402509376350526396", "name": "Aaron Hansen", "time": 1604173458008, "rating": 5.0, "text": "Very good massage, will be back", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "104489429952590012969", "name": "Dewane Mills", "time": 1583362456582, "rating": 4.0, "text": "Michelle is very nice !", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "107860916702283371455", "name": "Primetimesha", "time": 1623261852346, "rating": 1.0, "text": "Made an Appointment For A Combo Massage an Booked way ahead of time which was 6-2-21 for an appointment for 6-9-21 which is today just to give him my name an say I booked Online For Him To Say No You Don't which was Very Rude! I Showed him Where I Booked online an mind you I had been getting confirmation emails saying it was Confirmed ‼️ He Didn't try to reschedule me just said sorry it's best to call an sent me on my way!", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "102440902724397360869", "name": "G’Renee (G'Renee Luxe Beauty)", "time": 1623614851455, "rating": 1.0, "text": "Booked online on their website, received confirmation email the day of booking a week ahead. Received another confirmation email the day of appointment. Drove an hour for them to say they don’t have my scheduled. Showed the emails that I have received the day of and all I received was a sorry. Barely can’t understand the broken English that was spoken. Very poor communication skills and poor receptionist/customer service!", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "111844579957274088446", "name": "Mengshi “Victoria” Pei", "time": 1621958397007, "rating": 3.0, "text": "I made an appointment online. Confirmed the day before the appointment. Then, 10 minutes before my appointment, as I was about to drive to the place, they called, and after a few minutes, I finally understood the girl, saying they don’t have the availability at the time I booked and told me to go an hour later. I never got to get my massage 😟", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "113476985766885355043", "name": "McArthur Ray", "time": 1617500627114, "rating": 5.0, "text": "The masseuse I had was very talented and skilled and her massage techniques! I left feeling refreshed and recharged. Thanks again and I look forward to my next visit.", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "103027278622766354361", "name": "Kimmie Stewart", "time": 1610472670749, "rating": 4.0, "text": "Very quick and professional service. No wait time at all. Only 4/5 stars because I had a really hard time understanding what they were saying to me. Wish the communication skills were a bit better but great service otherwise!!", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "106080292934758404676", "name": "Jacob Stewart", "time": 1610814983674, "rating": 5.0, "text": "Second time going and I have to say the workers are very professional and know exactly where to massage. The prices are also really fair. Availability is great, only had to book one day in advance.", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "104844030788851609622", "name": "Earnest Bolton", "time": 1615894696044, "rating": 4.0, "text": "Great prices and the staff was very good", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "116427260303633216438", "name": "Ethan Rayhorn", "time": 1606160983252, "rating": 5.0, "text": "I made an online appointment for the same day and it was confirmed within 5 minutes. I got a 90 minute deep tissue and hot stone massage and it was wonderful. You get a FULL 90 minutes. There was a variety of techniques that I hadn't experienced before and it worked amazingly well on my sore back and shoulders. I love that they are open late too, so I can come in after work. The prices are very fair, and I will not hesitate to come back! Most importantly, I felt like the facility was clean. They wore masks, cleaned the table and headrest with alcohol, changed the sheets and washed their hands. They ask you to wear a mask when face-up on the table. I would want a massage therapist to be clean any time, but especially with covid, it was nice to see that they were doing things right. They also had their alabama LMT licenses at the front counter which is always nice to see when going to a new place and wanting to make sure it is legitimate.", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "103682946384522194561", "name": "Laurie Waddell", "time": 1608264078798, "rating": 5.0, "text": "They  are Awesome  .Please  try the  Hot  Rock\nI will be back.", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "108175664566368524073", "name": "Huizhen Zhong", "time": 1607207102984, "rating": 5.0, "text": "Good choice. The ladies are very nice and helpful!", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "110774391430616455511", "name": "Deanna Poe", "time": 1577767590255, "rating": 5.0, "text": "Best massage ever! Not fancy, didn't have to book appointment, no paperwork required. Just good deep tissue and hot stone massage experience. Will be back!", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "113736822787196411404", "name": "Rachel Bagley", "time": 1581893390294, "rating": 5.0, "text": "I have had many massages in my life. I used to work for a different massage clinic. This was, by far, the best massage I ever had. The prices are excellent, the people are kind, and the service was exquisite. 10/10 will return.", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "117663902483672250593", "name": "Leonard Phillips", "time": 1614832668689, "rating": 5.0, "text": "Was very relaxing", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "101205521817803483271", "name": "Todd Beckner", "time": 1601670958181, "rating": 5.0, "text": "Excellent deep tissue massage!", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "115619936753389280257", "name": "Lijun liu", "time": 1531431922008, "rating": 4.0, "text": "I enjoyed my massage there. I was very comfortable, relaxed, and it felt good. It was not to soft, but had the right kind of pressure applied for me. This was thanks to my masseuse Sunny .I felt incredibly relaxed after my massage.", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "103142325114498153957", "name": "Eric Takenne", "time": 1534113143124, "rating": 5.0, "text": "I enjoyed my massage there. First time to have massage with hot stone, very comfortable, relaxed, and it felt good.\nI felt incredibly relaxed after my massage.\nI will for sure visit again.", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "116454539570831162546", "name": "Jamie Wiseman", "time": 1533731395643, "rating": 5.0, "text": "Awesome professional massage! The hot stones were amazing. Highly recommend this place.", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "117955437576990137473", "name": "BigPoke Gaming", "time": 1589676953562, "rating": 5.0, "text": "Been having horrible pain in my back but now I feel like a new man", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "109628429482528803176", "name": "junxiu lyu", "time": 1531166201503, "rating": 5.0, "text": "They walked on my back and stretched my entire body, very professional massage, very relaxed, fair price, courteous staff, will soon come back and recommend it to anyone.", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "108068757067044036423", "name": "ramona soper", "time": 1566321717349, "rating": 4.0, "text": "Relaxing", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "103531905960538569572", "name": "Regina", "time": 1611862196954, "rating": 5.0, "text": "Very pleased with my SNS manicure. I’m from out of town, visiting my mom and she recommended Paradise Nails. I made an appointment and did not have to wait. They had a good selection of colors to choose from and the lady that did my nails was very efficient and did an excellent job! Will definitely come here again next time I’m in town.", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "101043688529365058520", "name": "myriah dishong", "time": 1618039130777, "rating": 1.0, "text": "UPDATE: my nails are already cracking after 12 hrs of having them!!!! 🤬\nI got SNS and a pedicure here today and i am NOT pleased at all. My nails have scruffs all over them. The lady that was doing them was in a rush and you could tell she was rushing. I still have dry skin on my feet. Took my mother in law with me and she still has skin on her feet too!!! Only thing that looks good is the polish on our toes. Don’t go here unless you want to walk out with the same crusty feet you had when you walked in and bumps on your finger nails. DO NOT RECOMMEND AT ALL.", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "109338762932304711684", "name": "L Murr", "time": 1620741334926, "rating": 1.0, "text": "Was very disappointed in my mother/daughter Mother's Day mani/pedi.  My pedicure was fine.  I asked for a manicure with just clear on my natural nails.  Normally you would get your cuticles pushed back, cleaning under the nails, skin trimmed, etc.  The lady doing mine was in such a hurry and the shape of my nails was horrible.  My daughter asked for different color on each toe and was charged xtra.  Won't be back that's for sure.  There is a reason there wasn't a line of people on the Saturday before Mother's Day.", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "105702698951283710977", "name": "Kimberly Brown", "time": 1610232870974, "rating": 5.0, "text": "Very clean salon and nice staff they do great work", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "117900707069964814492", "name": "Mary Knight", "time": 1569792116443, "rating": 5.0, "text": "It was very clean, very neat. It was quiet. Would have liked some music or something, but my main was great, and my boyfriend said it was the best pedicure hes had.", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "101016517001253256942", "name": "Sandi Cushway", "time": 1583698691427, "rating": 5.0, "text": "Great service at a great price. Super nice employees.", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "101057846163205090975", "name": "Brittany Hussey", "time": 1532293610858, "rating": 5.0, "text": "Best Nail Salon I’ve been to so far.\nI moved here 2 years ago and have been to several Nail salons. This is the first one that I actually like. The owner was SO nice! AND she appreciates your business!", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "102497301180580269562", "name": "Tiffany Bentley", "time": 1582575702434, "rating": 1.0, "text": "My nails look horrible. I asked for BLACK and Grey and got dark purple with sparkles... not to mention the quality of the nail work done is seriously lacking...", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "104235261050731830839", "name": "Sharon Weeks", "time": 1540307707273, "rating": 5.0, "text": "Beautiful relaxing and so CLEAN. Best pedicure I've ever had! This is my new favorite nail salon.", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "105138675894355686756", "name": "Angela A", "time": 1580668641104, "rating": 5.0, "text": "Great service. Nice staff.", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "104096097184082974491", "name": "Jennifer Watts", "time": 1562246138027, "rating": 5.0, "text": "My go to place  hardly any wait! Love how thin Sns nails are", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "114568924252201461354", "name": "Whitney Cruthird", "time": 1576519705778, "rating": 1.0, "text": "I went in for sns and sat there with my nails soaking for an hour. The lady who did my nails did a horrible job that the next day they started chipping and cracking. I literally sat there for over 2 hours, which should have been a warning sign. I will not go back and I do not recommend.", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "107420477206083513988", "name": "Geri Genovese", "time": 1605455395081, "rating": 1.0, "text": "Awful. Buyers beware.", "pics": null, "resp": {"time": 1610818742605, "text": "Very vague review. All readers would like to know why you think it is \"awful\". From reading other reviews on this site as well as other media, your review is an outlier, far from the vast majority of reviews. I suggest you return and file a review with details that merit a professional review status. Paradise Nails strives to provide a good experience for our clients; even earning a top 5 finish in the local prestigious Lagniappe Awards."}, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "107061948462776552968", "name": "Sandi Cushway", "time": 1567374233524, "rating": 5.0, "text": "Have had a range of experiences here. Lately great service and excellent pedicure 👍👍👌", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "117237409465669320627", "name": "Myosha Thompson", "time": 1569260190506, "rating": 1.0, "text": "Really disappointed with my experience here. Not confident that their equipment is sanitary either. The place is new, but I didn’t see any cleaning or opening new tools. My feet peeled so bad after going here", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "102176871530880866317", "name": "Susan Berent", "time": 1538844682351, "rating": 5.0, "text": "Love this place. Peaceful, no tv! Soothing music. All the manicurist are friendly. Frenda is my personal choice. Her attention to detail is second to none.", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "116499317143723248433", "name": "Merrell Havens", "time": 1540159904738, "rating": 1.0, "text": "First place I chose because of high rating and reviews but info was deceiving. Hot, hot, hot inside. Staff was very unfriendly and place was old looking and not so clean. Glad I changed my mind and went to Bellagio Nails up the street. Pedi was the bomb!!!", "pics": null, "resp": {"time": 1610818332447, "text": "A very inaccurate review. The Salon was very new at the time of review, exceptionally clean with a 100% health and safety rating from the AL Board of Cosmetology. Obviously the reviewer was not from this area as the temperatures are very hot even in mid-October. Reviewer needs to return for an accurate review."}, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
{"user_id": "102545653649398250576", "name": "Wanda Fields-Piepho", "time": 1554640323724, "rating": 4.0, "text": "Clean and quiet.   💅 are great!", "pics": null, "resp": null, "gmap_id": "0x889a431ca7235c05:0xafc3860b17c4fa6b"}
