{"user_id": "109589930585654867371", "name": "Jessie Kendrick", "time": 1577885631027, "rating": 5.0, "text": "These folks provide outstanding customer service. If you are in need of a company that offers this type of service, you cannot go wrong in choosing Crawl Space Solutions!", "pics": null, "resp": {"time": 1577892597381, "text": "Thank you.."}, "gmap_id": "0x8862c649bb9c6a11:0x447a5407be57183b"}
{"user_id": "110792127100349878618", "name": "Tammy Clark", "time": 1578002889576, "rating": 5.0, "text": "We bought a house in November 2018 and shortly after we had an large amount of rain in a short period of time. This resulted in standing water in our crawl space. My husband called Chris and he installed a sump pump and a new vapor barrier for us. Chris and the guys were punctual, respectful of our home and cleaned up everything after they were finished. We couldn’t have asked for better service. We highly recommend them.", "pics": null, "resp": {"time": 1578009797774, "text": "Thank you"}, "gmap_id": "0x8862c649bb9c6a11:0x447a5407be57183b"}
{"user_id": "111786603703411347157", "name": "John Adair", "time": 1572880067435, "rating": 5.0, "text": "Fantastic!  A job well done, professional and with before and after pictures.  Great company.  Will be recommending to others and using again.  Thank you Chris and crew!", "pics": null, "resp": {"time": 1572883773498, "text": "Thank you for your business."}, "gmap_id": "0x8862c649bb9c6a11:0x447a5407be57183b"}
{"user_id": "108859647785200805632", "name": "thomas dunnavant", "time": 1543419756486, "rating": 5.0, "text": "I have dealt with this company on many foundation issues over the last 15 years and Chris Simmons is always on my go to list when I find issues to address.  Hes is a breath of fresh air. Honest and a man of his word, hard to find in this world today.  And, I used his services at my home to treat wood rot fungi and prevention.", "pics": null, "resp": {"time": 1543420703143, "text": "Thank you Tom."}, "gmap_id": "0x8862c649bb9c6a11:0x447a5407be57183b"}
{"user_id": "107248634595751361475", "name": "david hagan", "time": 1586109963810, "rating": 5.0, "text": "The foundation staff is wonderfully efficient. I will give them five stars every time", "pics": null, "resp": null, "gmap_id": "0x888c92cdc134e39d:0x2d319699caa0c598"}
{"user_id": "103435815896487198804", "name": "Mandi Cooper", "time": 1571017887670, "rating": 5.0, "text": "EAMC IS AMAZING", "pics": null, "resp": null, "gmap_id": "0x888c92cdc134e39d:0x2d319699caa0c598"}
{"user_id": "112865023635602131724", "name": "Kisha Davis", "time": 1582661142491, "rating": 5.0, "text": "They need a bigger clinic but we love it there. They have helped my family so many times over the years and I'm very appreciative!", "pics": null, "resp": null, "gmap_id": "0x8888e2074540b813:0x761fccaddad46483"}
{"user_id": "107328581301122699318", "name": "Gloria Elcock", "time": 1600038552843, "rating": 5.0, "text": "Participated in the virtual sickle cell walk drive..", "pics": null, "resp": null, "gmap_id": "0x8888e2074540b813:0x761fccaddad46483"}
{"user_id": "110714079518362256312", "name": "Atlantis Gilmore", "time": 1505892307704, "rating": 5.0, "text": "This place is awesome, my son is a patient and loves the different types of things and events they do for sickle cell patients.", "pics": null, "resp": null, "gmap_id": "0x8888e2074540b813:0x761fccaddad46483"}
{"user_id": "115247270413182000901", "name": "La'Toya Fletcher", "time": 1458600353147, "rating": 5.0, "text": "Awesome Nonprofit Foundation that's educating the community and world abroad 👍👍", "pics": null, "resp": null, "gmap_id": "0x8888e2074540b813:0x761fccaddad46483"}
{"user_id": "117994093040083684403", "name": "Vinetta Yow", "time": 1498066948996, "rating": 5.0, "text": "These ladies are passionate & very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x8888e2074540b813:0x761fccaddad46483"}
{"user_id": "105754761845716321734", "name": "Cecilia Curry", "time": 1518478461855, "rating": 5.0, "text": "Wonderful organization", "pics": null, "resp": null, "gmap_id": "0x8888e2074540b813:0x761fccaddad46483"}
{"user_id": "106441203358732352541", "name": "Carter Thomas", "time": 1625025421206, "rating": 5.0, "text": "MDH and their team encapsulated my crawl space and installed dehumidifiers.  I can’t imagine a more quality or more professional construction crew.  They did a perfect job at what they do, but they were also so professional and polite around my wife and children.  They dress in logo branded MDH collared shirts, they show up early, and the have a can do spirit.\n\nI honestly wish they did more than just crawl spaces.  This company and their team is what construction companies should strive to be like …top notch work, first class customer service, organizational excellence!", "pics": null, "resp": {"time": 1625064212094, "text": "Thank you so much for your kind words, Dr. Thomas.  We truly appreciate it and strive for service excellence at all times!"}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "102477244426453332660", "name": "J Hall", "time": 1623884045984, "rating": 5.0, "text": "I used MDH Foundation to repair and level a guest house in my backyard. Mike and his crew did an outstanding job that went well beyond my expectations. Absolutely amazing craftsmanship. They are very professional, honest and finished up right on budget. I would highly recommend MDH.", "pics": null, "resp": {"time": 1624459299145, "text": "Thank you so much, Mr. Hall.  We appreicated the opportunity to take on and complete your project!"}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "105274521366090380671", "name": "Thomas Carlisle", "time": 1610929059965, "rating": 5.0, "text": "My house was sagging in the middle. MDH came out when they said they would and corrected the problem with in a day. The material was top notch and the price was very fair. Chris and his team were professionals. Highly recommended.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPVxWyh2mGP2sdfG9FdKqJMm29_M6LfRGvAR1ms=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM91Y1EWW9BBtUMQumBmFPXp0GlX1IMDKuiMy6f=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOMI62WheRasLroz6GmXHX91wQJxavKkQghUwXY=w150-h150-k-no-p"]}], "resp": {"time": 1622065436467, "text": "Thank you for putting your trust in MDH!"}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "113329179254825622213", "name": "Cheryl Hunteman", "time": 1619807159419, "rating": 5.0, "text": "I contacted this company to determine if my foundation had any problems. They responded quickly and were able to make an appointment for me in a timely manner. The technician was prompt, courteous, and professional. He explained how the foundation was checked, and I was able to observe. Fortunately there was no evidence to indicate a failing foundation just a need for repointing in a small area. I would recommend using this company.", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "112229369043384280513", "name": "Kari Bush", "time": 1622041534669, "rating": 5.0, "text": "MDH got our poor buckling/sagging floors fixed in a day while we were at work. They were so quick and left no traces of being there, we almost weren't sure the work had been done, except that our floors were suddenly solid and flat again. everyone we worked with was super professional and kind, and they were upfront and transparent with the work we needed from the start.", "pics": null, "resp": {"time": 1624459382088, "text": "Thank you very much, Ms. Bush.  We appreicate the kind words and enjoyed taking on your project!"}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "101559560459372006350", "name": "Christy Kisner", "time": 1608153799861, "rating": 5.0, "text": "MDH construction is fantastic!  I highly recommend. They were fair in their pricing and did quality work. I had a slab of concrete lifted and crack repair done around my pool. They also sealed my joints to protect them against water intrusion. I am so far very happy. They were professional and responsive. The product they use is quality and they offered competitive pricing.  I will use them again if needed.", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "101947316419677547478", "name": "Jon Jeffress", "time": 1581052603440, "rating": 5.0, "text": "If you have an upcoming home renovation project, look no further than Mike Hayes with MDH Foundation Repair. He was the general contractor on our renovation project and we couldn't be happier. When our project spiralled out of control due to unforeseen termite issues, he did everything in his control to look out for ways to try and keep the repairs as economical as possible, while still maintaining the look and feel of what we envisioned at the beginning of the project.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMHufTZ50aym2Dq8Q6sEy_fVLIJSRyqNiepBD8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMdqqIPQx0hln7ip0LN_lmCPPDgD0VvOxV3Zes=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOd9lDA84PeNMs321TDI3wIe7EREPxKnM-9O48=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPkt4QhTSS5P5ybFMZwR4FuiR7BlOBnhAzCNUw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOBnsxcF1bOPIaFHd0IK8al6JQYevSUp8vjtYU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNmW4dC3JytQ-XZdQvQtYEYL-S6t4oCycnZbpw=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "109377954785200083257", "name": "Patricia D'Agosta", "time": 1612564708144, "rating": 5.0, "text": "Mike Hayes and crew did a great job replacing the lentil around my garage opening.  He explained everything and took pictures that he shared with me.  I am certain that I will not ever have another related repair need.  Thanks to you, Mike, and your entire team!", "pics": null, "resp": {"time": 1612976997641, "text": "Thank you, Ms. D'Agosta!  We so appreciated doing the project for you, and glad we were able to provide a solution that will last for years to come!"}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "115056251179655976538", "name": "Jim Hudson", "time": 1602722692281, "rating": 5.0, "text": "This company is very courteous, prompt, and professional. They did excellent work, which was a difficult foundation repair and leveling of my floor. They also leveled my pool deck like magic! They also leveled my pool deck like magic! They cleaned up well. Mr. Mike Haynes has established his business as the premier Company to call for a myriad of services, many not provided by any other company. I would highly recommend MDH foundation repair.", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "104887198478191860327", "name": "Cathy Bair", "time": 1603906424034, "rating": 5.0, "text": "MDH encapsulated the crawl space under my house. They were very professional and informative. Work was performed exactly as described in a timely manner. I definitely recommend them!", "pics": null, "resp": {"time": 1604438917408, "text": "Thank you, Cathy! We appreciate the kind feedback!"}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "102694340067907527844", "name": "Nita Reed", "time": 1599850022309, "rating": 5.0, "text": "I called MDH Construction to get an estimate on encapsulation and having my floors jacked.  The turnaround response was great. Once I sent in half of the estimated payment for the job, I was contacted within a week and work began. Everyone involved in the work was professional and hard workers.  I am thoroughly pleased with the job and would highly recommend MDH for any job.", "pics": null, "resp": {"time": 1601045245080, "text": "Thank you, Nita!"}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "104161030480108736426", "name": "Robert Lanuza", "time": 1606334878832, "rating": 5.0, "text": "MDH was a dream to work with. They’re organized, extremely considerate, and do what they say when they say. Appreciate the foundation work and the professionalism.", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "104356857673489922407", "name": "Cynthia Corrigan", "time": 1596218810149, "rating": 5.0, "text": "What a great company to work with. Did their best to work around my crazy schedule and the wet weather we were having. Very happy with the job they did.", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "118229620491417983298", "name": "James Garcia", "time": 1596816777069, "rating": 5.0, "text": "Mike and his crew did an excellent job on leveling my concrete around the pool area. Quality, professional work done on time. Would give 10 stars if I could.", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "104847700891772833375", "name": "Vicki Leach", "time": 1598048245309, "rating": 5.0, "text": "MDH repaired our foundation. It was a big job. I was amazed that they started when they said they would and came every day until the job was done. They were very professional and friendly. Chris answered any questions I had. I would recommend them to anyone that needs foundation repairs.", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "115124665683462314790", "name": "potpie67", "time": 1596810802929, "rating": 5.0, "text": "These guys were very professional and went above and beyond.  I was kept in the loop throughout the whole process.  The crew that provided our service could not have been more professional and hard working.  I would give the business 6 out of 5 ⭐️‘S", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "100303071556210560180", "name": "Sarah Marzella", "time": 1591377126545, "rating": 5.0, "text": "I am very impressed with how my front walkway was repaired. I had 7 slabs that were raised due to evasive roots from a birch tree which I removed earlier this year. The MDH crew leveled these slabs with the rest of my walkway. I know this project was tedious, since I wanted to maintain the color consistency by using the original concrete. I am extremely pleased with the outcome. I highly recommend this company to anyone looking for the professional services they have to offer.", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "108933645980929726309", "name": "charles wimberly", "time": 1602871463977, "rating": 4.0, "text": "MDH removed some old under floor insulation and installed some floor Jack's under my house. Workers were very professional and did a good job.", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "108785533181172483951", "name": "Jamie Murray", "time": 1604349409130, "rating": 1.0, "text": "Never return my phone calls or emails, and I've called and sent plenty.", "pics": null, "resp": {"time": 1604438785551, "text": "Hi Jamie,\n\nWe are sorry to hear that you didn’t have a great experience, we did leave a message so we just want to make sure we have the right phone number for you! Can you call us at 251-206-5801 and ask for Shannon or Hannah? We’ll make sure to take care of you and answer any questions!"}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "116839434790127797931", "name": "Stephen Ryer", "time": 1608752106942, "rating": 5.0, "text": "MDH repaired/leaved sagging areas in floor, much better. The doors close and latch now.", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "112027880106346135136", "name": "Stephanie Tootle", "time": 1595974817082, "rating": 5.0, "text": "MDH was prompt, professional, courteous, and did why they said they would do when they said they would do it. No surprises. Would recommend.", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "106657338052390426884", "name": "Jaime Cooper", "time": 1579696290167, "rating": 5.0, "text": "MDH is an honest company who wants to do things the correct way. If you need foundation work or crawl space moisture control, definitely call this group. You won’t be disappointed!", "pics": null, "resp": {"time": 1579702942878, "text": "Thank you so much Jamie. Really appreciate it."}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "104720718424670061142", "name": "Jennifer Andrews", "time": 1579703310955, "rating": 5.0, "text": "Mike was excellent from start to finish on my project. He scheduled, completed and kept me in the loop through the process. Very knowledgeable and personable. I would recommend he and his company again.", "pics": null, "resp": {"time": 1579776200609, "text": "Thank you for the awesome review!"}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "113351781907860849449", "name": "Bob", "time": 1582167788280, "rating": 5.0, "text": "We have hired Mike and his crew for 3 seperate projects.  All work completed was excellent quality. Everyone at MDH has been great to work with.  Highly recommended.", "pics": null, "resp": {"time": 1582279005531, "text": "Thanks Bob. We really appreciate the review."}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "117657361190308753422", "name": "Carol Williams", "time": 1568690215560, "rating": 5.0, "text": "MDH Construction responded quickly, professionally measured and estimated the needs to repair my carport, and gave me an estimate with several solutions and prices so I could choose the repairs that I could afford.  Their crew arrived just as planned and quickly and very efficiently made the repairs.  When minor adjustments needed to be made later, they came as soon as I contacted them.  I have rarely seen a contractor and crew that was as honest and hard-working as MDH.  I would recommend them for any construction need or foundation repair.  By the way, their widely-advertised competition offered a \"one-time-only\" estimate that was nearly three times MDH's estimate, and they didn't even measure the carport or offer alternatives!", "pics": null, "resp": {"time": 1569058606864, "text": "Thank you so much Carol. We enjoyed working with you!"}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "117755259799466609043", "name": "Emory Jones", "time": 1581091431964, "rating": 5.0, "text": "Great Experience with Mike and his crew. Very reliable and trustworthy. Enjoy doing business together", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "109978842582472510886", "name": "Walter McPhaul", "time": 1594396417168, "rating": 5.0, "text": "The owner, Mike  personally works onsite to ensure work is performed correctly", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "102675385351202361475", "name": "Elena Johnson", "time": 1587268636520, "rating": 5.0, "text": "March of this year we hired MDH Construction to do a foundation repair job of one of our homes. With genuine sincerity we would rate this company,  under the leadership of its owner, Mike Hayes, as \"Best in Class\". The group is made up of dedicated professionals and highly skilled individual driven by high quality service comittment.\nThe repair MDH was hired to do was one that had been previously attempted by another foundation repair company. This was our second time addressing the same problem. While the first company ensured us the fix we paid for was permanent. It was short number of years later that we began seeing signs indicating the repair was failing . We found ourselves back at square one.\nAt the time we did not know MDH Foundation. We did reach out to the only other company we knew of thru advertisement only, and while we had someone come out assess and quote us a price, we chose to hold off. Very impressive sales presentation they did but we were just not convinced on their proposed corrective plan.  Some time later we hear of MDH, and a lot of good things being said of the owner, Mike Hayes. Not only on their foundation repair work, but as a very highly respectable contractor too.  Earlier this year we met with a member of the MDH team, and an assessment was made. Then before the job plan was finalized, the owner, Mike, came out to thoroughly go over the plan. It was the first time we felt really comfortable about the corrective plan.  Mike has a great group of professionals and skill guys that communicate well together. They were very attentive to our concerns, explained and answered every question.  They were punctual and respective of time. Always leaving area neat after each day.  We only wish we would have found MDH Foundation Repair the first time around.", "pics": null, "resp": {"time": 1594741068433, "text": "Thank you for your review. It was a pleasure working for you! :-)"}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "105164359403315035632", "name": "Chris Little", "time": 1581081651791, "rating": 5.0, "text": "Very honest, clean and professional.\nThey go above and beyond to properly make the necessary repairs and finish in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "101474872581627717203", "name": "Julia Norris", "time": 1580862476284, "rating": 5.0, "text": "They did a great job putting  foundation Jack's around our garage walls and filling the voids under garage floor with injected foam. The work was professionally done at a  competitive  price by a great team of workers.", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "109261527532728386805", "name": "Mike Lawler", "time": 1572010382276, "rating": 5.0, "text": "They made a clear assessment of the problem, explained what they recommended for a solution,  and made a note to take special care not to damage the trench drain adjacent to the repair area.\n\nProfessional service that I am happy to recommend.", "pics": null, "resp": {"time": 1572085447880, "text": "Thank you so much."}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "112913200939948923656", "name": "Richard Brown", "time": 1581609243103, "rating": 5.0, "text": "Excellent work and highly professional. Would recommend to all", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "116407891447041909367", "name": "Dennis Lott", "time": 1536679953761, "rating": 5.0, "text": "\"What makes a great contractor\"  I hired MDH Construction, Mike Hayes, contractor to lift a sunken garage floor that was nearly 8 inches below level.  Due to the severity of the defective slab, it broke during the lifting process.  Honesty and integrity is what separates greatness from average.  Mike realized the lifting wasn't going as planned due to unforeseen circumstances.  Instead of walking away, which most contractors would do, he  instead wasn't willing to leave my  situation in a worse condition than when he started the job.   He repaired the slab above and beyond expectations at a MORE  than fair price.  I have finally found a real contractor that puts his reputation first.  First Class in all categories.  Thank you Mike! Excellent Work!\nSincerely - Teamlott", "pics": null, "resp": {"time": 1536707742452, "text": "Thanks you so much for your kind words!"}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "107496143622753028039", "name": "RICK bierworth", "time": 1576547829695, "rating": 5.0, "text": "Open Crawlspace Encapsulation.\nThey have a technique to enclose an open crawlspace (i.e. pier and beam foundation) and install a dehumidifier. The underside of my house is drying out, and the moisture issues are fixed. I shopped around, and this procedure is expensive, but they seemed to be reasonably priced. They also quoted the best solution. Others wanted to install a dehumidifier under the house, but without encapsulating the underside. The dehumidifier would have been running constantly, trying to dehumidify all of Pascagoula. I have our termite people and our HVAC people come look at it, and both said that MDH did an excellent job.", "pics": null, "resp": {"time": 1576577950402, "text": "Thank you! Our team worked hard on your project."}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "112970745359026127570", "name": "George Searcy", "time": 1599668517496, "rating": 5.0, "text": "MBH did a very professional job and stabilized the foundation of my home. I would recommend them for foundation repair.", "pics": null, "resp": {"time": 1601045277546, "text": "Thank you, George!"}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "114318979841773094908", "name": "Jeffrey Smoot", "time": 1581084002400, "rating": 5.0, "text": "Mike and team always take the extra time to get the details right. Great work from a great group!", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "106825754156464540886", "name": "Vicki Hearn", "time": 1564017119421, "rating": 5.0, "text": "Great, honest people. Very professional. They shoot straight. It's not good to hear you have a problem, but it's good to have a company you can trust.", "pics": null, "resp": {"time": 1569058647243, "text": "Thank you for the opportunity to help you Vicki. We will be here if you need us in the future!"}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "116104567590061022669", "name": "Parag Mahatekar", "time": 1569635708264, "rating": 5.0, "text": "Mike and his assistant were very professional.  They raised up the end of my driveway which was sinking and the concrete was broken.  Great end result.", "pics": null, "resp": {"time": 1572085485536, "text": "Thank you for letting us know!"}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "110790324268212820525", "name": "Jacob Windham", "time": 1594997174960, "rating": 5.0, "text": "A professional company that came in right away to fix our foundation issues.", "pics": null, "resp": null, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "105402361823625779128", "name": "Lynn Mccready", "time": 1556646920254, "rating": 5.0, "text": "Mike did a great job making it possible to do a complete termite inspection under my 1940's house and also get to plumbing and ac areas that were impossible to get to.  Lynn McCready", "pics": null, "resp": {"time": 1556673522441, "text": "Thanks Lynn. We appreciate your using us for the job."}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "118023447202815274739", "name": "Austin Edge", "time": 1569326409328, "rating": 5.0, "text": "Wonderful company to do business with.", "pics": null, "resp": {"time": 1572085496679, "text": "Thanks."}, "gmap_id": "0x889a43a6a538a849:0x15432234f06d547d"}
{"user_id": "113516747705022907483", "name": "Ramya V", "time": 1615772177605, "rating": 5.0, "text": "Beautiful tulips 🌷to watch. Nice place to spend quality time and watch lovely tulips. 🌷💐", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNQWWNNrcA6LZP6YoqNyQrO7K3vOpb8KOirB4_6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMCCdretWIgkcnU1GlWJm-ekvwaG5ITc3QXmOj4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNHIOj1jIwzKFH7XYtrvmJtG0Q8nSZJ2InLMKTE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPx_qoG8FJ4qvqnLqme2D5YFxqXLEdTwb1BZB7z=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO9sQXMks8oVRI4temwY9s7clEpJMHLP-1wGt_5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPKqn9i_Qmd1676uV7iXr1ZT-LuAKoehhMgrZMD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMH1CRREHdNp2ogA98QcQTMRI45LGfIUpQk662L=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPlAVRvbSoghsUeBJna7EEt-UnZNiD63bSz7paB=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "104718868834246805893", "name": "Lois Miller", "time": 1616528508427, "rating": 5.0, "text": "We thoroughly enjoyed our time in the tulip fields! Well worth our 2.5 hours drive. Friendly and informative staff.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "108493517256312225588", "name": "Gini Woods", "time": 1622391814555, "rating": 5.0, "text": "This is a very organized, clean venue. We took a group of homeschooled children. The tour guide interacted well with the children and even involved them in the historical information he was sharing by assigning them ri", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "115298311690388307054", "name": "Ni N.", "time": 1556135895840, "rating": 5.0, "text": "It's nice to see the different types of tulips (during tulips festival Feb - Mar) and the American Village itself. $10 per person.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPYYmUerJIsv0KohAqFROGKsPlb3zAYnWkBTXKF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNYh-2h41oJPQrmg4QzJ7Iy-tnxWP16linJy1BV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPN2rjW2EndVeuay7GlnBGif1WzcsaT2YNz7QMQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMyMrlC2X76QA2LEDnFGkdtTBuIsAybIChSoHdw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMtucREVuYRLfUUwbvV6wVAaOYOl6DWYCi11Pjv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNTHLjg6bXQsfBmHm0DVEL8UJmFGm8b3WiqMYYc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMpn3P9YjbP4MzZMSAXigsG5zQf_0JIHjeQvE3k=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipORR3Y22Hul7MAUSDgxBsEDAYN5-lDlb7KPLC6k=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMP4MOxC_Wz-U7ZY9XuvFhXZNGsUVQveVOY20x5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPxfdb9aDeqBbcmMaGb1lHICF-BhEevpR7x2DsC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNxaHVPMzanopJLbS5Dhw8WmBRcLHY2L76HPR1U=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMQlx44JHeE3uA-phHQNZL7aWYjwSG5mMy8EwiJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP8p1plaGkXz2DSlMMUYQcy68nUCx8wDilFkBTD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPgB0raufAUQ0RE60m82bpLatmnlZRaM3mL1lsu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOh2ZX2pMExD3XAHc4IAR6K6SR8haVqRsm2p13u=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMYok2IE4UqrpjZpBsuGugU8prVYelO5WfPqZIW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMigRpmVFz4PTSdWx5G8qbFBob4C7q_qgtEam7A=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNwJQKQs1X6pr97m4zHXl1jhd6trW3KLmn_mB3l=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPWb-PhjTfjJPxsbC6ldquNwIEeT7GAnS_ea0Uq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOvCGKR0FOMcTm-hDC4aBiLUyytvytway-zj63O=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOidN7B4leOzRdrb8oDGpak5Wg23_CFwvFmgVtv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO9sEGZTXLvzjujF5uii6dUNQ9qNIKtVEvlX-C0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPLQvtOtm6oBI45B-0Wkc4HK-zhPdupSqSLLOTu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO4pdEBH2KQoXxkhuwlNB-oDwh7wYl1AWIedRNU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOU3MoeFSgFjOMbkJvJJjUGUwXyraIIt4ABHiTj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNFqVXHdle9XR-IW9-48R9bf5MdOM1v9LNq-LMD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO9QqQiWaB0IBofi0Gc0SfmhzyCyKY0FK5j_Vgi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMz4Syp3X51Myl2JL7UEYy8U2suPQnXosvs3red=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO6oEZTHZ8UiahoYr5Z1pNmCQaGZLK9b8QjG927=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNaPVH_l8W_HcmvvsUTJ43671qvXai_1NYNQ_rl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPOEqpFB5m7cBfxpYvpyBz6w1f3D91T6ZdZ2sQB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNam2FQY-KCdYNM6pYOJvd1tzzyKhJfDurhgH1W=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMmbQiUqVJFBrU_n0IOdqy6zc4iQfeqJ3YQww23=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipObatYcrvwm1TFDuEjYooBd9cc0YHcAmOLg4eZ9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO7U3AC-7YuxGWH4f_h8TCzpXBrW3AMgHExKojb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPKjioqQ8Afijj2x9lVFBAl2ImTFFMXbkgYpN0I=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipON2hK9aRe0kTTWAX-kOMU9NI6PU13UWUVFLO1H=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPxf9tXuT5DsrhmP5QfxAvWN3y2gkZWvGs1S3fb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN4Bbfrz7ZqtJR3ci5VEzekB05WAtjm_MLjAFUa=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNSluDBQEHtkUYJHKONDOhMl-PEobxblaJg1mrT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMFCMC97BXhV4Owxw6sIGsHwycOch1q6wQ6w_CV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP3QvGT8a5fi6TbYYv-psGz10I0LQNsDTsRZVVI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP8tz7G5GhHZdHnv7aWKKFDiuTHyyAuwPjWavv-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMQbwdwZNhnKMsLlpgFF1mssF8YIaUI9ZJAPqqo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNN2y2GYEA-YdzDOnLnmYYpr2KNukUezqET3lxj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN6Fms3OBR8OqWREVE7M4Fp4uyzy_kgdkkUkekd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPmfYNDJW1hNvzXWwXPcGMr96NgoPaTtldeCmjv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipONZ1Z9sf7bzPgX3RhDgbwwFZMBKuilTW3y2pHz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNtUNCKSeNifEMdgsGG_i9dCvPdmUhN5nflmqkh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOYjGCpDnt-GzY6Tc7g55NSD4nCXFioEtfSsg7J=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "117400150836996397426", "name": "Char B", "time": 1558405945817, "rating": 5.0, "text": "Ask first if a school group is going through then tag along with them to get the most out of your visit. We wondered around in the beginning then hooked up with school group. You can picnic on the grounds or you can leave and come back. $10 per person discounts for seniors and children. Don't miss out on this much history.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOGJxoYRWYnjTUglbUfeR-swL6r00o8JiX_L9_F=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPnW-bT5k6UW7mf6rzjPHTfHp1qTPidzAFfKQ9-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN8TmNpkN1wyY1IHaLN_MWKqpQ_7W9lrCCK5Yha=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO5UwOTWKTqCWXrwDP-7xFJIMNYXWMCZ08MfMFP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM8vq1E7tN-lMYtgecpbZpYo2lww23UPxSS05Ly=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPpysJYksTcN-HLH7x7xXaILzQnBgZnFEMm08Tm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPsvcZKVq_RnoqobGZW0ZN-UM72jIIz7lnRiMTD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNV6xzPFPPweCUXx_CFj_YOWUIEZa0EONb07Y4_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMaX573eVeV0D2Sew8pmh9ERpClkp5qvOVHrhS9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPXy5MekA6G-7AcSRZCWNrr1H2M2KZGqxQvWszW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOeF8DB3-3XlNl8FBT8yi3oMeqWF2XQaNnTz3aL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPGwNcjyzWMdTbEgca8cfgw9TCdhBcq7SYPe-xm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMJ-dQqPcFEwKQ1KQwE6Twl5XDg-P50NQ4dHPHN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMrOlF1OGpRTw_Bj1OyEHCrsJMh3PKthS6K4EYz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNbQCDKHis_lc4VC0n3JcRy-qDu1SpX7NeD7jCY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPU5Af6izqJtFbOcJc0L18guRkSiNQ8dNSu7fAj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOrXzxNbdjDkx7K7G2qP_PL5EF0Z0puo_iS6rPZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPOk3O8curAVyYRd9owc6uaGcdwuNlO92IMxJMh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOygs8DKh_fWN_pTmap9Z2-U2wq4WCounwAh8G9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPlc-3iSQT2lJMBUYGWt02pYWqGaESN43L-zAfx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOhS3Iy9znLrOIQgWq4N2n5G9K5s1I5t8oBFCJL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPezW0dSU-FVrWXnEoDI175TJULlRnPjHwXDbyb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNVpgsGjKtsSnrWjNSiP9FtSULLfSRWKCKJADf8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOlsjqK7SWTGGiVPH3-8KYDilvZQI0WTvZampju=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM8-200UajLtCfLSa7xKD7kruqBgpo7eU1FrLvd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipONw3K39ROx2sWiIiHlWnEqZ1Jh_LCIE5qUKPjv=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "110066589077742326221", "name": "Ismael Torres", "time": 1583716385223, "rating": 5.0, "text": "A must see. Beautiful place. Awesome staff", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPD7MQs_ODIf1gp8SnmggrpF3yeIy98IksdyFit=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPunuonCFJMXpNiDZ97uJNFAsV9ZSUUr9gdu1b9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOifd77weIJERs1xz0aKn8pDGWJneTBYHBtQDFR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMGc6v3lVfr8nva_QpnoYp-rdhjHNKrm76g166h=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNRnOnr5w3J302HWnTMup5SDAtwyiJrszQGSkwW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNmoDTgssKkK1eQcp_K-fb4YXfzqTCMZAFkawcu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN1OrMWFFKCkuEb7H3kAbIRKBPrdl0f7puJRi_j=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMra6_qMW3RPmDbuK5UUEn63TFd7L5ttqLDVEiI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOZlQB0-h2yRxLHkDcHRewvk-wP3EDrFoO6jFLC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPKSgvtIkj-xLXhsPVFu6S2LLdvPTxmEjg_5qPE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOPj-L3UUwxAGB9MPKP-i-QW3sfY2zxH9pzEVGC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMczY5VBxqe3c3iQwkGp7hMyWYT6wjQvZMLUa4f=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOcQr1j7emJZNUncchLQf1WHTY6xj4qVc1ZOlau=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM-6SQWcXvwLnGGv14bG6txeeKmNMACsLFCeyZN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN86IbZtx4t_WEAJ-Rnir68YSoOQQLVQ8JllTWy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOo1hWAhZc-hRGK_KjTcTsJpicA7su7ud0az3iL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM1NyBA1FOBlJ43raXajimOXT3drNHGJqbIdRcA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNU0iRz9gqSwnXSGOQvGXSXhVPgcBXut2EBLCYt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNoNnJavNDGV6cdBXMqkSctRIGDwNcoIxcH9NUx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOwxy1ennnJ7I1dlg-ZBSn1NHH7cJiiOdKzvtQZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOW0oWH4c21bFV2DX-D-d6Cb8JVbIzNmUqd2Qzr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN1LhzaHhhpap397aSJPnfaX054bkslrobwqwb8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOpilCPNyX15mjJg9BRlxNPDbouAISv-6fWcvP7=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM6ptlyl8ZC48UC3pIJAbAEzbRXXIV3DL_-62_j=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOaLnnn5cK10QnPb-BYlQkULodjOpPZ1hkMALx4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNr9O95kMCCbEhEQq0Jr32eG8c7IF_OwoWyOJk-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOwgpusHe3Fli0bvPKv4p4iAMM0gWap8Qnn_WKP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM1DMXuUvqKoSGNxvGmBmLWg0hOk5up8GSt4DjE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPdL7ddTA05V812X5gI7okPp8-tWtlVR_8F8CpF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOp4LqExGjl32Ba_5249nOoKyLoXSYVYPlquJsC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPcgBvhDp2-oK1DfpMYX7DzNrS_LANHSrC1TNjA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNQhNoyze0TYJRf5iZH4lBbHkbi7v2arexk5kUa=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOEEpaUP5h1ZKjgPfm6Zp_Njnl7WztHajp95xbq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP2vVzCuuSGoXKodUxXD2oIsl8u1gmlObG4iK2s=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMm26P0UB6pNNXg3NkH5DOV6S3v0kJOinJin7sB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMYhMvXSLhthZelDpdkXaWr0Yexj6fyurazqYCu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMawtCaIbzJz5l0nXHh1M-N5gOKF_sqZ7L5gZ2i=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOEtcscS40ljp4jwyQAnxVeKodZ-EByxtMTJXu5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOkPUi6SvlS1ZWO8DUAbm5qE4FzAuB5Tk5LL32d=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPNKc81WX9zcmeC0fEwXUbskcnq_-J95tb2Oyy_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN-8rL2QjOk5VEpafQWThxCaYTsojyICSOSK1XT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOGYiuN773jKVS_bQP8IRIfBZNkLTw6ThqQwoyt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOyopMYQo4OY0Ao2Dk0uckjHyHF7H06kjPYs1is=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO22Bdac_am4eCoJ5lL6dSM6EaFOMyCay4XXQ19=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNMMQITnVzYg6NsJp3HWeidkqXGbWrv_esjvxbF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNMZPlLxBTjL3daidVaN67WqYGLeULX3c2Yt9AI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMVUn5PY2RX2wofPe1ByomY5vVdlXKYLQHabqZJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM65riWF1uLor_B_TLulBg54Y9v39Mq-rr2PFag=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNhWxwfW4RS5Z2imwc_c6zckrCEUK3xoJrQPQuU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOIb8R7LGJut869oY_8t27RZ474hlSV6nj-BT1m=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "104466812793751764417", "name": "Terri Lane Robertson", "time": 1573953250435, "rating": 5.0, "text": "The kids always have a great time on their field trips here.  The characters are great at taking you back in time and letting you feel like you're \"there.\"", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMx_-wBLHURyM9bQbTs7Wt-ug--msHZAPstvbPe=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMFzV2TqHd9lZ3WOzBbRGIGg0aQzNSrpQbHEt6H=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM5MMa9cvYSY54wgpDWTNRa4b5fmNDb99wyvggr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM9J-AjsRN_EaOdtdAKGxYfUlDuHJWSKyTf_ACj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNx1y4eBP-yCWXvjqMRTyqkVyuXrJ6We5_nEw_C=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNbbeLJCr3hDTJ8RpSJEqoASeZscaaUHf5YkVLF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOc4o9GaGBMViKjxPsP63zQIdDBSYvXhLbXaxut=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPpPengGe-PVgQ6Y7uMBshtYeA0KfOIMevtz0eR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOwfzD_CFSi7D5zH0CnNPdcVX0digRGujXOooZj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMAG66TNNWQStjY_vVHSxfJls-KVupQTpFMCJLq=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "105874796861891966953", "name": "Jessica McMillian", "time": 1552106693981, "rating": 4.0, "text": "Would be awesome if there were more staff walking the area.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNyysUoK7rhnpI1U0gu96w3D89lp-HgcMKXh12O=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOpQcoWUCmdjiES0Qj7jjwyEmWZ5LZGpOmTDw3k=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPe7X3x7jWyckaHJ9xe8GqUXfZTGTDew5lnTmD6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMgGpI-RIyytce98RTdIIwqsWP3g8trjq0TQKWW=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "108363821032319171330", "name": "Courtney Ray", "time": 1527387564136, "rating": 5.0, "text": "The tulip festival was amazing! We went towards the end, but thankfully their were plenty still left! It is wonderful and you will be sad if you miss it!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOXip_FDqsiMLr7Z_b57h0BO6xEBiDyyU7JFpVp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNie3AyBjRnSYYNBYtWSJTwPsxajimMUyG4c_ud=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "105173047983860486920", "name": "Nura Nura", "time": 1602174892576, "rating": 1.0, "text": "Because love the village", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNxMHXWl4_mqxooHYdHyhK9NEH0fv4OT2Nq3imm=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "105740283759985151351", "name": "Denise Payne", "time": 1562346478293, "rating": 5.0, "text": "If you’ve never been here you simply have to go!  We live in Ohio and are back in Sweet Home Alabama visiting family. We searched online for a fireworks display and our search led us to The American Village. We went a little early and enjoyed seeing the campus and tasting the delights of the food trucks:). Our family of 6 thought it awesome that there were seats if you didn’t bring one or a blanket, picnics are allowed, and staff and volunteers were not only friendly but smiling and seemingly loving their roles!  This isn’t your ordinary history museum and the fireworks display was definitely not typical. My husband is a retired Army Captain with 22 years in service. We have visited many places and viewed many fireworks displays including ones on military posts. None have even come close to what we experienced last night!  My favorite parts, the parts that gave me chills and made tears flow, was seeing the colors presented correctly, the heartfelt gratitude of The American Village staff towards Those who serve, and the accurate depiction of our historical relevance. Thank you American Village for making our Independence Day Celebration not only the best yet, but also helping us to reflect on just how wonderful it is to be an American!  🇺🇸❤️", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "113590043741796185163", "name": "Mark Wayne Alexander", "time": 1564103411766, "rating": 5.0, "text": "Went for 4th of July festivities. Was entertained by volunteers portraying men and women from America's early history. Many different character portrayals to select from going on throughout the village. Very impressed by the replicas of buildings from early Americana such as Mt. Vernon(George Washington's home), the Old North Church(from which Paul Revere was signalled)one if by land two if by sea. And the fireworks were absolutely amazing and spectacular. Will definitely be going back. Only $5.00 to get in and enjoy all the sights and sounds of what a 4th of July celebration should be.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "100646506012247491799", "name": "Kara Hodges Cox", "time": 1509850994613, "rating": 4.0, "text": "Great history field trip for the family.  The kids really enjoyed joining the Continental Army and the Oval Office replica was cool to see.  As a family not in a tour group it would have been nice if there were more informational signage.  I would really suggest this for anyone interested in history!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "113185748019636152607", "name": "JJ Polri", "time": 1497889427035, "rating": 5.0, "text": "THE BEST KEPT SECRET IN AMERICA!!! This place is a must see, it is absolutely amazing, the role players are amazing, you truly feel like you have stepped back in time, it is a full immersive experience! Such an amazingly fun way to learn and experience history! The tulip festival time is beautiful and anytime is beautiful to go! So glad they are open Saturdays in the summer! If you live nearby or are driving through AL for any reason this is a MUST DO! Pack lunch or eat on the way because they don't serve food here but you can bring picnic lunch, and be sure to check the hours as well because they are not always open on every Saturday, but it is great when they are. Going on Presidents Day was a fantastic experience as well, nothing like getting to eat cupcakes with George Washington!!! The replica architecture is amazing it is really an incredible place to visit! You will want to spend the whole time there if you can and go to as many demonstrations as you can! Our kids LOVED the colonial soldier training! Just so fantastic in every way!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "118247168341650415382", "name": "Cheryl King", "time": 1519751276303, "rating": 5.0, "text": "HOLLAND called they are jealous! I can not keep from showing everyone I know the pictures of our trip the The Festival of Tulips.  5 acres of absolute beauty. 100,000 blooming tulips just waiting to lift your spirit and welcome Spring.  And we got to bring some home and plant them in our yard. It was an utter delight. If you live in this state....you are missing a true jewel if you miss this experience.  We will return every year for this soul lifting wonderful time.  Thank you.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "103706880733220981329", "name": "Daniel Bryson", "time": 1453769674628, "rating": 5.0, "text": "Recently attended a small conference held at American Village, and it was a terrific experience. While the weather wasn't suited to a thorough exploration of the grounds, everywhere I went and all that I saw was positive. Clean, solid, well-maintained facilities indoors as a venue, and wonderful reproductions of the various historic buildings. Montevallo, Alabama is a long way from metro Detroit, Michigan, but I would be happy to find another excuse to make the trip and see more of American Village!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "118378557251599978617", "name": "Marie Harbison", "time": 1464649402070, "rating": 5.0, "text": "My first visit in several years. So impressed with all the additional buildings and exhibits. Great display of American history. Kudos to Exec Dir Tom Walker for having the vision, pursuing his vision and implementing his vision for preserving our heritage for us and our children and grandchildren!!!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "116071568553561070356", "name": "Dommie P", "time": 1582488192871, "rating": 5.0, "text": "Came for Tulip Festival! Beautiful place!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "105654504869960827926", "name": "Dewayne Bowie", "time": 1581115369550, "rating": 5.0, "text": "Great place to learn about America history", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "112086908858663074523", "name": "Houston Mullins", "time": 1562776307046, "rating": 5.0, "text": "I went to The American Village on July 4th, and I loved it!  Awesome day there.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "118155906655792547219", "name": "Carroll Price", "time": 1460764654942, "rating": 5.0, "text": "Outstanding situation even when compared with touring of Washington or Williamsburg excellent staff.   Nice to see people with purpose in their employment posts.  Thank you for displaying  why America is desirable. A beautiful concept.  Cp", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "111026421862608160664", "name": "Luisa Reyes", "time": 1519077744766, "rating": 1.0, "text": "Given that this colonial era reproduction is out in the middle of nowhere, the main thing they have to offer people is a pleasant experience.  Something which they progressively seem opposed to doing.  Their Patrick Henry impersonator is incredible, congenial, and flat out stellar.  The rest of the staff is rude, mean, and hostile.  The noncostumed staff seem to have power trips and take pleasure in insulting people.  Mamy folks have had to complain at their ill treatment.  I've been going to their Fourth of July celebration almost since it began.  But, there seems to be a negative corrolation with the more elegant a locale it becomes, the more hostile they turn on the people.  Ironically, the village celebrates American Independence, but the staff acts like Tories.  I've been to the actual Liberty Bell, to see Mount Vernon, and visited Colonial Williamsburg.  In all of those places my experiences were far pleasanter than at the American Village.", "pics": null, "resp": {"time": 1519167167139, "text": "We at American Village regret that you had an unpleasant experience visiting yesterday and we hope that you will call us so we can learn more about the experience. We highly value our visitors and strive to provide an enjoyable venue for everyone. Please feel free to call Jeremy Ward at 205-665-3535 (x 1072) and thank you for reaching out."}, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "113958667329379467599", "name": "Benjamin L", "time": 1585881475613, "rating": 5.0, "text": "Beautiful property.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "106390132567227724263", "name": "Bill Searcy", "time": 1462315961609, "rating": 5.0, "text": "You should go and tour this placeI. It is something to see.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "115013309240790010137", "name": "Lindsey Collier", "time": 1578598873015, "rating": 5.0, "text": "Cute place!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "113257970646297135048", "name": "Scott Wade", "time": 1524073087602, "rating": 5.0, "text": "Great learning experience for kids.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "107901642284701835668", "name": "Akinajin", "time": 1502493463052, "rating": 4.0, "text": "Great history fun for the whole family!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "107124790789826844840", "name": "JK Manning", "time": 1499212428132, "rating": 5.0, "text": "The fireworks on 4th of July are great.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "108200441271329902336", "name": "J. Patrick Smith", "time": 1502086008026, "rating": 5.0, "text": "Wonderful living history programs.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "103964203229356887995", "name": "Terilyn Stewart", "time": 1528735154698, "rating": 5.0, "text": "Nice place to visit", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "115304108683892706665", "name": "Callie Broussard-Wheeler", "time": 1465424633050, "rating": 5.0, "text": "Brilliant, moving museum that is a MUST SEE!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "105222864594594227194", "name": "George Cobb", "time": 1583618887404, "rating": 5.0, "text": "Wonderful!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "116629514560677356539", "name": "MaryBrett Robinson", "time": 1551742545551, "rating": 1.0, "text": "No.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "107607414371094147710", "name": "Diane Payne", "time": 1498143806004, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "109237391688385164068", "name": "Patricia Buckey", "time": 1486666830186, "rating": 5.0, "text": "Great visit!!!!!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "116794582413402904809", "name": "Ramkesh Meena", "time": 1482500215239, "rating": 5.0, "text": "Lic village", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "118286742393074422075", "name": "Pamela Hunter", "time": 1467510763548, "rating": 5.0, "text": "Great experience, family fun !!!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "118124919875336976201", "name": "Fernando Fiallos", "time": 1499343224944, "rating": 5.0, "text": "(Translated by Google) In a pretty place of large-scale representations of relevant places in American history.\n\n(Original)\nEn bonito lugar de representaciónes a gran escala de los lugares relevantes de la historia norteamericana.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "103271747520425209068", "name": "jacqueline jackson", "time": 1622568469187, "rating": 4.0, "text": "called them about water in basement/garage and a trench drain in front of garage door. H20 had Larry come out in a timely manner. He was personable, informative and quick to answer any questions. The workers came on the scheduled day and were done with the project on the scheduled day. No complaints from me", "pics": null, "resp": {"time": 1622569358689, "text": "Thank you for the great review. We appreciate your trust in our company."}, "gmap_id": "0x88890c5fa358f5eb:0x97d3d0132ccd91a4"}
{"user_id": "111232836114781026216", "name": "Howard Green", "time": 1612469211065, "rating": 5.0, "text": "Fantastic work from H2O today!  Waterproofing/sealing off two unfinished, unused areas in the basement of my mother's home.  Also, installed a de-humidifier that will greatly help my mother's breathing issues.  Crew was prompt, extremely courteous, professional, of course very knowledgeable, cleaned up afterwards.  Highly pleased and would highly recommend H2O!!", "pics": null, "resp": {"time": 1612470280740, "text": "It was our pleasure to serve you. Thank you for the kind words and opportunity to provide a healthy basement for your family."}, "gmap_id": "0x88890c5fa358f5eb:0x97d3d0132ccd91a4"}
{"user_id": "106162825048725529451", "name": "Bruce Olinger", "time": 1602796128679, "rating": 5.0, "text": "\"The crew at H2O were professional and took quick care of our foundation repair. We met with their technician Mike, who was very knowledgeable and answered all our questions. He made our stressful situation go away and I would recommend H2O if you need their services.\"", "pics": null, "resp": {"time": 1605316620734, "text": "It was our pleasure to serve you. We really appreciate your 5 star review and kind words."}, "gmap_id": "0x88890c5fa358f5eb:0x97d3d0132ccd91a4"}
{"user_id": "115651796605167831774", "name": "Chris Bartlett", "time": 1602109338615, "rating": 5.0, "text": "I would highly recommend H2O waterproofing I called with an issue at the recycling plant they came out the next day, the repair was done within 36 hours at a very reasonable price!!! I would highly recommend for all of your waterproofing needs!", "pics": null, "resp": {"time": 1605316510322, "text": "Thank you for the kind words and 5 star review. It was our pleasure to serve you."}, "gmap_id": "0x88890c5fa358f5eb:0x97d3d0132ccd91a4"}
{"user_id": "113468102519179783337", "name": "Terry Cooper", "time": 1603156646817, "rating": 5.0, "text": "H2O did a great job, Water was coming into my basement I called on Tuesday they had somebody come out by Wednesday and within a week the job was totally completed- drywall put back up -I could not be happier thank you H2O for all your help", "pics": null, "resp": {"time": 1605316712192, "text": "Thank you for trusting in us. We really appreciate your 5 star review and kind words."}, "gmap_id": "0x88890c5fa358f5eb:0x97d3d0132ccd91a4"}
{"user_id": "103103121038520175310", "name": "Michelle Walker", "time": 1551808833323, "rating": 5.0, "text": "Absolutely wonderful experience.  The people were amazingly friendly and positive.  My daughter and I both felt at home.\nRecommend highly for graduating seniors to make the time and effort to apply.", "pics": null, "resp": null, "gmap_id": "0x88893d4c253fea53:0xe48b6ccf3e49c77f"}
{"user_id": "103098221970769234434", "name": "Rodney Davis", "time": 1576946889340, "rating": 4.0, "text": "It is well kept. Always clean. It is fenced in so you can allow your kids to play without worrying that they might waunder off", "pics": null, "resp": null, "gmap_id": "0x88928d965e82ebcb:0xe3dde945470955f1"}
{"user_id": "108936200960806831751", "name": "Drew Morton", "time": 1598646204911, "rating": 5.0, "text": "Very job well done. Outstanding crew and staff. Will 100% recommend.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNjoG7AWzOUkvL5zo-BKD_2LQ0GAjWhbzztvIoC=w150-h150-k-no-p"]}], "resp": {"time": 1599766491843, "text": "Thanks Drew!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "104016287839955463837", "name": "Jeff Rose", "time": 1620343634650, "rating": 5.0, "text": "I could not have had a better experience. James, the project manager, was very thorough when communicating details of the project to me. He answered all of my questions and was very courteous and friendly. Charlie, the foreman, and his crew were very professional. The installation process with them went extremely well and looks professionally finished. They also were polite, courteous and very friendly. It was evident to me that they enjoy their work. I would highly recommend them.", "pics": null, "resp": {"time": 1620395534776, "text": "Jeff - It was a pleasure servicing your home to our highest standards and providing you quality work. Thanks for the great review!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "110271457342591111499", "name": "Sean Shabani", "time": 1623252811842, "rating": 5.0, "text": "David and his staff are the best. Clear communication, professional workers, and the best prices. You won’t find a better waterproofing company!", "pics": null, "resp": {"time": 1623340147011, "text": "Sean - BDry operates with a high level of communication between our customers and crews so we can provide the best customer experience. Thanks for the review!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "113246041472663774121", "name": "Joseph Horton", "time": 1623356150492, "rating": 5.0, "text": "Sammy was able to get here a day eaerlier than planned--a good thing.  We looked at the problem and he told me what would be involved if BDry solved it.  But he suggested other means first before running up that tab and demolishing what would have to be demolished in order for the BDry system to be used.\n\nBottom line was that he clearly put customer before money.  My kinda business.", "pics": null, "resp": {"time": 1623360537362, "text": "Joseph - At BDry, the customer is always first. No hassling customers for sales. We hope you are able to solve your issue. Thanks for the great review!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "108945532883774435203", "name": "Angela Armstrong", "time": 1620135718297, "rating": 5.0, "text": "We had a very positive experience with BDry. Everyone was kind and courteous. They respected our property very well. They were in time and took the time to explain other potential hazards. Very good work!", "pics": null, "resp": {"time": 1620141054293, "text": "Angela - At BDry, we treat our customer's property as if it were our own. Thank you for being a BDry customer and we appreciate the great review!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "114954866613149634095", "name": "Evan Pantazis", "time": 1619707149307, "rating": 5.0, "text": "Charlie and his crew from BDry were fantastic. They were prompt and communicated the specifics of the job the entire time. The work was excellent and was done ahead of schedule. Highly recommend.", "pics": null, "resp": {"time": 1619720641843, "text": "Our goal is to go above and beyond for our customers. Thank you for the review Evan!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "105986341948310151814", "name": "James Bevil", "time": 1620083440414, "rating": 5.0, "text": "Great job. From the time they arrived on site until they left. They clean up after the work was completed. I recommend BDry for your waterproofing needs.", "pics": null, "resp": {"time": 1620135468548, "text": "James - Our goal at BDry is to leave the customer's home cleaner than when we arrived. \"Broom clean\" is how we train. Thanks for the great review!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "109549087606286906174", "name": "Patrick Bell", "time": 1615788238617, "rating": 5.0, "text": "BDry did an excellent job from start to finish.  From the initial estimate to the work and final payment everything was done professionally and everyone was very courteous.  The day the work was scheduled the crew contacted me with an accurate time update of their arrival.  The work was quickly done and they cleaned up after themselves and didn't leave any mess.  I was very impressed with the job they did.", "pics": null, "resp": {"time": 1616704548495, "text": "Thanks for the great review Patrick!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "115451215179293531010", "name": "Beasley Cullen", "time": 1618241592909, "rating": 5.0, "text": "On 4/12/21, BDry came to install their waterproofing system along one wall of our basement that floods during heavy rain. After walking down the job and inspecting the crawl space, Chris spoke with his boss and determined that the issue we had was not a water problem but a leaking sewer pipe. He brought this to our attention and recommended for us to seek a plumber before going any further with the waterproofing.\n\nThe installer could have very easily said nothing and went on with the job. This speaks very highly of the character and integrity this company has. I would highly recommend this company to anyone needing this type of work.", "pics": null, "resp": {"time": 1618325329058, "text": "Cullen - BDry operates with high integrity as we rely on the trust of our customers that we will be providing the service they expect and need. We will not install a system that is not needed. Thank you for the review!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "103795157881648639228", "name": "Fergus Tuohy", "time": 1621284169553, "rating": 5.0, "text": "We called Lee to come out to check on our sump pump, which was running nonstop. He arrived quickly after our call and fixed the problem within a few minutes. Very positive experience. Thanks!", "pics": null, "resp": {"time": 1621288345207, "text": "Fergus - BDry has a full-time service division to service our existing customer's BDry system. Thank you for your continued trust in BDry!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "110850959283172303339", "name": "Rick Sprague", "time": 1619452910962, "rating": 5.0, "text": "B-Dry installed a sump pump and a foundation drain system in a portion of my basement which was having water problems. The crew was very professional, protected the other parts of the basement from construction dust, and completed the work when I needed it done. I recommend them highly.", "pics": null, "resp": {"time": 1619458387892, "text": "Thanks for the review Rick! It was a pleasure helping to resolve your water problems."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "102561667966433491269", "name": "Cereus Music", "time": 1619718143682, "rating": 1.0, "text": "Workers say one thing and do another. Extremely misleading and treat their customers like they do not matter after they already have your money. DO NOT RECOMMEND! There’s more I could say but I’d rather not waste my time on this trash company!", "pics": null, "resp": {"time": 1619721439931, "text": "Cereus - We do not have any records under your name at BDry. If we are mistaken, please email bdryalabama@gmail.com so an individual from our management team can reach you."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "108605525984798513120", "name": "robert bashinsky", "time": 1618436803665, "rating": 5.0, "text": "Charlie, James, and their assistant were friendly and professional. They kept us updated during the progress of the work and finished in a timely manner. We were well pleased.", "pics": null, "resp": {"time": 1618585068625, "text": "Thanks for the great review Robert!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "100595266291574964062", "name": "Roman Duren", "time": 1619129394963, "rating": 5.0, "text": "Mr. David Fievet and Bdry are wonderful to  C work with. 100% professional and honest. Would only recommend them for any foundation work.", "pics": null, "resp": {"time": 1619187515602, "text": "Thank you so much for the review Roman!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "104336586366234775499", "name": "Heath Reid", "time": 1617889840275, "rating": 5.0, "text": "Excellent service and very professional! You can trust these techs to respect your home and property, and get the job done! Couldn't have gone better.", "pics": null, "resp": {"time": 1617899433936, "text": "Thanks for the great review Heath!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "101670323930461767803", "name": "Michael Jones", "time": 1623181470311, "rating": 5.0, "text": "Sammy from BDry was very professional, took the time to explain the issues surrounding my problem, and gave me some good advice for moving forward. Highly recommended.", "pics": null, "resp": {"time": 1623189514668, "text": "Michael - Thank you for the great review!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "116450948053342872132", "name": "Megan Logan", "time": 1619798503730, "rating": 5.0, "text": "Sammy was very knowledgeable and friendly. Great advice and options!", "pics": null, "resp": {"time": 1619806501491, "text": "Thanks for the review Megan!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "100443014940668774660", "name": "Don Wilson", "time": 1614712999371, "rating": 5.0, "text": "I had a problem with my home settling on the back. I called  BDRY and David came out and did a THOROUGH INSPECTION and assessment of my situation. He explained exactly what was needed. He gave me a bid on repairs and I agreed with his price.  He sent his Three Best service Technicians out, JEFF. CAMERON. and DARRYLL. to make the required repairs. Despite the weather they completed the work in a timely manner. All of these men are professionals. They made sure I was aware of all the work in a step by step manner. They answered all my questions without hesitation.  They left my yard in excellent shape.  If I ever need any other foundation repairs or have water problems they will receive a call.  The price and the quality of work performed is excellent.", "pics": null, "resp": {"time": 1614719454368, "text": "Don - It was a pleasure helping resolve your foundation issues. BDry employs individuals who care for our customer's homes as if it were their own. When you add the highest quality materials in the industry, we provide the best customer experience around. Thank you for the great review!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "117337235331136883095", "name": "Tommy Owens", "time": 1614806639780, "rating": 5.0, "text": "Jeff McKendree and the other two people that came with him to do the work were amazing. They followed up and kept me in the loop on the process. This is my 3rd time using BDry and my 2nd house to use them to repair items. I have felt confident each time in their ability to fix my home and take care of my home repair needs. Even after the first set of work when they came this last time they saw something wrong with the dehumidifier they put in last time. Brought it to my attention and it was under warranty so they are taking care of replacing it. High recommend using them.", "pics": null, "resp": {"time": 1614879372587, "text": "Thank you, Tommy, for your review! We appreciate your business."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "110719984815404982137", "name": "Tanya Elder", "time": 1614190901282, "rating": 5.0, "text": "They were trustworthy ,dependable and professional. They went above and beyond what they said they would do. Their  lifetime transferable warranty helped us sell our house. Would recommend to family and friends.", "pics": null, "resp": {"time": 1614612797929, "text": "Tanya - Thank you for the review! BDry has been upholding our lifetime transferrable warranty now for 63 years to thousands of customers. Imagine this, if we put a system inside your home in 1958, we would still service warranty work at no cost! A customer's peace of mind is our number one goal."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "100904025795389080610", "name": "William Cole", "time": 1602250472221, "rating": 5.0, "text": "We would highly recommend this company. We have used them for water proofing and for foundation repairs in our basement. David promptly came over when we called and answered all of our questions and concerns. The crew was prompt, professional and cleaned up daily before leaving. Lee did an excellent job paying attention to detail smoothing out our concrete. We would highly recommend them, and appreciate the fact that they will stand behind their work!", "pics": null, "resp": {"time": 1602509545358, "text": "Thanks for the kind remarks William! We appreciate your continued trust in BDry."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "115332963751131314367", "name": "michelle Cranford", "time": 1605304711481, "rating": 5.0, "text": "We have had different companies work on our foundation, but  the crew , Jeff, Cameron and Darryl , from BDry has  exceeded my expectations.  They worked hard long hours and did a terrific job  and solved some problems that other companies told us  that could not be fixed.  They were polite and extremely professional.\nThey answered every question we asked and had a wonderful sense of humor.\nI would recommend BDry  to anyone.", "pics": null, "resp": {"time": 1605555078422, "text": "Michelle - No one should have to worry about the integrity of their home's foundation. We thank you for putting your trust in BDry to correct these issues. Thanks for the review!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "107116552548564879743", "name": "Dale Johnson", "time": 1618007807763, "rating": 5.0, "text": "On time! Represented his company and himself very well! Knowledgeable and straightforward! I would highly recommend them!", "pics": null, "resp": {"time": 1618237012708, "text": "Thanks for the review Dale!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "102315264532060852482", "name": "Joshua Childers", "time": 1610388839656, "rating": 5.0, "text": "This company is the best! They worked with me through this entire process and even worked with me on payment. I cannot recommend them enough. This should be your first stop for foundation issues hands down.", "pics": null, "resp": {"time": 1610658879490, "text": "Joshua - Thank you for being a fantastic BDry customer and for sharing your great experience with us! We work hard to create a seamless customer experience and pride ourselves on providing you with a worry free solution from beginning to end."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "112616192305831184213", "name": "THE GREEN'S", "time": 1604970907698, "rating": 5.0, "text": "David, Todd, and Drew thank you all so much for the high-quality and professional work that took place at our home this past week.  I really cannot thank you all enough for the extraordinary level of care and commitment that you each gave towards this project.  While our foundation problem was a major repair, the solution that your team came up with was brilliant.  My husband and I are truly in awe of the intricate detail that went into remediating our foundation problem.\n\nBDry truly has struck gold in their management team’s ability to problem solve and their exceptional technicians who are ready, willing, and able to work.  Lee, Cameron, and Jeff are an exceptional crew to whom we are also thankful for.  Each day they arrived promptly and worked diligently.  Lee, Cameron, and Jeff presented themselves as professional, polite, knowledgeable, and honest.  They cleaned up their workspace each day before leaving and they even swept out my basement without being asked to.  They educated us along the way about the steps being taken to fix our foundation problem and even showed us the progress of the remediation as it was underway.\n\nAgain, BDry, thank you! We truly are appreciative of your involvement and help in repairing our foundation wall. I will definitely contact BDry for any further foundation and/or water issues in the future. Further, with complete confidence, I would recommend BDry to my friends and family members for their foundation and water issues.", "pics": null, "resp": {"time": 1605279802064, "text": "Mr. and Mrs. Green - It was our pleasure working with you and repairing the integrity of your home's foundation. BDry has been upholding our Lifetime Warranty now for over 60 years and will continue standing behind it for many years to come. We are very pleased to hear that you had a great experience working with our BDry team!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "112707453137113187219", "name": "Neil LaCanne", "time": 1617897513765, "rating": 5.0, "text": "They were honest and tried to help at the minimal cost to customer. Highly recommend, top notch company.", "pics": null, "resp": {"time": 1617899483868, "text": "Thanks Neil! BDry operates with the highest integrity in mind."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "107351416883760200911", "name": "Eric Hudson", "time": 1611863199201, "rating": 5.0, "text": "Sammy with Bdry checked all the boxes for customer service.  He was on time (actually early) and called ahead to make sure we were ready for him.  He was friendly and helped us determine some steps we could take on our own to fix our problem.  I really appreciated his integrity.", "pics": null, "resp": {"time": 1611877181395, "text": "Eric - At BDry, we train our evaluators to provide a fair and honest evaluation of your home. A customer should NEVER be pressured by a company trying to make a sale. We hope you are able to fix your issue!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "114126526241558246170", "name": "Tommy Heath", "time": 1602803403906, "rating": 5.0, "text": "The quote was very thorough and the work was scheduled quickly. The crews were friendly and considerate. Both the foundation work and the waterproofing work were done simultaneously in our crawl space. All of the work was completed in one day. The shoring jack system fixed a door that wouldn’t close and the waterproofing & dehumidifier fixed our wood floor cupping. Would recommend them in the future.", "pics": null, "resp": {"time": 1603121346181, "text": "Tommy - we greatly appreciate the kind remarks! Our waterproofing and foundation crews work in unison to provide a seamless customer experience. Great to hear that your home issues have been resolved!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "113430970783655821319", "name": "Drew Pearl", "time": 1602530966535, "rating": 5.0, "text": "Sammy came by to do an assessment on a couple issues with a house we just bought. Walked me through exactly what he thought might be going on, and recommended a number of fixes to try before we go down the road of anything major. Sammy was much more concerned about helping us find a solution rather than selling us something we didn't need.", "pics": null, "resp": {"time": 1602712783815, "text": "Drew - We at BDry pride ourselves on training for integrity by providing customers with an honest evaluation of the home, without the pressure you may find in a \"salesman.\" We are always happy to help!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "111689324861890990768", "name": "Stephen Royal", "time": 1602872104272, "rating": 5.0, "text": "We had the pleasure of meeting and talking with Sammy today.  He provided timely advice and counsel which was graciously received. Scheduling an appointment was extraordinarily easy. While our issue cannot be corrected by BDry, we would certainly, without hesitation, call on them again.", "pics": null, "resp": {"time": 1603121062839, "text": "Thanks for the review Stephen! We are always happy to provide our customers with expert service and advice."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "113641845176305871109", "name": "Edward Kissel", "time": 1602516630841, "rating": 5.0, "text": "Easy quoting process...helped me choose the best option at the least cost. The installers were friendly and got the job done quick and left the place cleaner than it was when they started. The work/product looks great.", "pics": null, "resp": {"time": 1602526261580, "text": "Thanks for the review Edward! Because we rely heavily on customer referrals, we will send you a $100 check for any job we do that you send our way! We thank you for your business."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "106952577135213080593", "name": "John Gaskins", "time": 1614374421444, "rating": 5.0, "text": "Quick turn on helping us out with a crack in foundation wall,  Cameron came out and with a good attitude did a good job.", "pics": null, "resp": {"time": 1614377496335, "text": "Thank you, John, for your review! We appreciate your business."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "108973774970625856906", "name": "Wendy Garmon", "time": 1599830524311, "rating": 5.0, "text": "My experience with B-Dry has been fantastic.  I have dealt with them on 2 separate occasion, once with a house I was getting ready to sell and more recently at a family member’s home.  On both occasions, Todd came to do the initial evaluation and the proposal for work to be done.  I found him to be polite, thorough and knowledgeable. The work performed was great.  I would definitely recommend them!", "pics": null, "resp": {"time": 1601495739039, "text": "Thanks Wendy! It is great to see returning customers. Don't forget, we offer $100 on all referrals that lead to a job!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "103061843172004383241", "name": "marianne wofford", "time": 1601579529351, "rating": 5.0, "text": "Sammy and the crew worked from beginning to end to get us a quote, explain exactly what would take place and to schedule a time.  They actually came earlier than scheduled which helped us a lot.  We could tell a difference immediately in our indoor air quality.  I wish we had done this years earlier.  Amari and his guys left the place clean and they were professional and polite the whole time.  I highly recommend giving Sammy a call . He can talk to you about all the benefits with absolutely no pressure.  Thanks guys.", "pics": null, "resp": {"time": 1601662539744, "text": "We greatly appreciate the review Marianne and welcome to the BDry community! We put extra confidence in our crew to leave homes in pristine condition before leaving a job site. Additionally, we train our consultants to present a solution for your home's issue without the pressure and hassle of a salesmen."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "105715025506747269201", "name": "Shep Lowery", "time": 1617835334646, "rating": 5.0, "text": "Super professional, friendly, and fast. Highly recommend.", "pics": null, "resp": {"time": 1617889784861, "text": "Shep - Thanks for posting a review! It was a pleasure serving your needs to BDry's highest standard."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "103220970556374411251", "name": "Susanne Myers", "time": 1603325114747, "rating": 5.0, "text": "BDRY is awesome! They are always responsive and quick to resolve any issues! Lee came out to my house this week to address a battery back up problem and I had excellent service. I recommend them to anyone in need of water proofing services!", "pics": null, "resp": {"time": 1603374601302, "text": "Susanne - BDry loves a happy customer! We appreciate the great review!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "110469694728613598219", "name": "LA Head", "time": 1623430161803, "rating": 5.0, "text": "Well done!  Thank you!", "pics": null, "resp": {"time": 1623433370104, "text": "Thank you for the review!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "107192838244186715146", "name": "Taliyah Marie", "time": 1619718430851, "rating": 1.0, "text": "Horrible company! What a rip off! Please look else where", "pics": null, "resp": {"time": 1619721470219, "text": "Taliyah - We do not have any records under your name at BDry. If we are mistaken, please email bdryalabama@gmail.com so an individual from our management team can reach you."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "112018426373321353240", "name": "caron russo", "time": 1599938079876, "rating": 5.0, "text": "I was extremely happy with the services of BDry Waterproofing.  Sammy did everything he said he would do in an efficient and professional manner.  I was very please with their services and will recommend to my friends.", "pics": null, "resp": {"time": 1601495566364, "text": "Thanks Caron! We appreciate the great feedback."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "105709618870935873864", "name": "Leisa Miller", "time": 1593543620835, "rating": 5.0, "text": "They were backed up with jobs, but came on a Sunday to make sure my waterproofing got done. Imari was so professional and proficient! He was at my home all day and even one of my neighbors commented about his work ethic. Absolutely great service and would highly recommend this company!", "pics": null, "resp": {"time": 1593619232820, "text": "Glad we were able to solve your issue in a quick and timely manner! We thank you for the review."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "116543249261158029300", "name": "Drew Lolley", "time": 1602714920815, "rating": 5.0, "text": "Great customer service every step of the way.  From Todd who consulted me to Amari and the crew who did the install all the way to Lee who finished the final inspection.  5 stars all the around.  Thank you!!", "pics": null, "resp": {"time": 1602781550122, "text": "Thanks for the review Drew! Great to hear our seamless process from the evaluation to final inspection left you with peace of mind."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "110803112931687553069", "name": "John Goodwin", "time": 1599740895997, "rating": 5.0, "text": "Very professional and value added service to my home.  I chose Bdry to stabilize a corner foundation issue, remedy a water in crawl space problem and then decided to also do an encapsulation.  The encapsulation turned a damp and ugly crawl space into a nice dry dry storage space.  I was selling my home and new these issues would come up in the inspection.  The buyer and inspection report did ask about these issues but all I had to say was that the home has a Bdry life of structure warranty! Problem solved, I should have done the work years ago.  I strongly recommend Bdry, add value and enjoyment to your home.", "pics": null, "resp": {"time": 1599766386568, "text": "John - we are excited to hear about your great experience with BDry! We love helping our customers in the home buying/selling process by transforming water intruding areas into safe and livable conditions."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "110803914868896071267", "name": "Jennie Cochren", "time": 1601090822663, "rating": 1.0, "text": "BDry has terrible communication problems scheduling between their construction contractor and them. We had a lot of problems with our house we had no choice but pull out of the contract. They swear that they will give your money back when thing doesn’t go right but that’s a lie. Their contractor came out and didn’t finish the demolition in our basement due to finding out more issues with our wall. When we finally had to make a decision not go forward with them and  we asked for our deposit back. It took them more a month to even get the refund processed. Every time I call the salesman, all I hear is excuses and blaming on their office. I was very frustrated for run around. Finally someone from their office calls back to me and to tell my they are only refunding very small portions of my deposit back. Their excuse was their construction people finished the demolition so they’re charging the full price. Like I said in the beginning, Demo was not finished. I try to tell them that this is wrong that they cannot charge me for something they didn’t finish. Construction people came out to do the demo for max 4-5 hours. I mean the was maximum hours. But yet they charged me thousands of dollars. I’m so upset and disgusted by their customer care. I would never ever recommend this company to anyone. Worst experience ever!!!!", "pics": null, "resp": {"time": 1601495529746, "text": "Jennie,\nI am very sorry to hear you had a poor experience with us at BDry. Please email us at bdryalabama@gmail.com so we can get you directly in touch with a manager and help make right any issues you have had during your experience. This is not up to our normal customer care standards."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "103987079551948457047", "name": "tye-emily warren", "time": 1599333181755, "rating": 1.0, "text": "Not able to own their mistakes or own up to their mistakes ... even when we have video cameras!\n\nJames (electrician), Charlie (project manager) and Sammy (salesman/Liason) from B-Dry performed a $9,000 project on our basement. After asking them specifically to be careful so they do not affect the electrical of our dog fence, they damaged it the day they performed electrical work. Instead of owning up to their mistake, they denied it. Actually, they went beyond denying it and alleged WE must have done something.\n\nHonesty and integrity are needed. Again, I absolutely do not recommend this company.", "pics": null, "resp": {"time": 1599583709686, "text": "Hi Mr. and Mrs. Warren - we sincerely apologize that you had a poor experience with BDry. While we stand behind our employee's honesty and integrity, it was our understanding that the situation had been resolved when we agreed to pay for half the dog fence service fee of $95 for the repair. We were happy to hear that our waterproofing system has fixed your water issue after our monthly customer follow up. We greatly appreciate your business and stand behind our lifetime warranty in any future events of system failure. Please do not hesitate to call our office any time if there is anything else we can help with."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "115168123552857878769", "name": "Amanda Flournoy", "time": 1587062300016, "rating": 5.0, "text": "Our experience with BDry has been a great one! From the time Todd came and evaluated to the end when Ken and Matt completed the work has been very pleasant! Ken and Matt were friendly and a pleasure to have working in our home! They completed the work in a timely manner and treated our home as if it was theirs as in caring for furnishings and flooring! Thank you to all involved in getting this job completed!", "pics": null, "resp": {"time": 1593102645552, "text": "Thanks for the review Amanda! Our employees at BDry are driven to give our customers the best customer experience possible."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "111990388710068450197", "name": "Ethan Howard", "time": 1601423980836, "rating": 5.0, "text": "Wonderful experience with the folks at BDRY. From beginning to end they met/exceeded our expectations.", "pics": null, "resp": {"time": 1601495114580, "text": "Glad we could be of service to you Ethan!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "104415036917821906703", "name": "Shelby Valentine", "time": 1594412289083, "rating": 5.0, "text": "David and the BDry team were amazing! They were extremely polite and professional when they visited my home. I couldn't recommend them more!", "pics": null, "resp": {"time": 1599766617924, "text": "Thanks for the review Shelby! We at BDry are here to give homeowners a fair and honest evaluation of their home."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "118164763821881035655", "name": "Cindy Brothers", "time": 1591238003049, "rating": 5.0, "text": "Todd came out and inspected our basement and told me he didn’t think I needed to waterproof our basement.  I was impressed that he was honest and didn’t try to sell me something I didn’t need.  I would definitely recommend him since I feel he can be trusted.", "pics": null, "resp": {"time": 1593102418219, "text": "BDry operates with the highest integrity in the industry as we train to \"consult\" with customers not \"sell\". We greatly appreciate you giving us an opportunity to inspect your home."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "108263336513793179247", "name": "Kyle Feagin", "time": 1583199106019, "rating": 5.0, "text": "My experience with BDry was excellent. They went out of their way to respond quickly to my request for an estimate and even managed to get someone out to the property on the same day. The construction team was very punctual and professional, and completed the job quickly and neatly. I would definitely recommend them!", "pics": null, "resp": {"time": 1593103101603, "text": "We greatly appreciate the review Kyle! BDry is here to serve our community and to provide our customers with the best experience possible from beginning to end."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "112014473009595246459", "name": "Victor Childers", "time": 1582747627959, "rating": 5.0, "text": "Sammy showed up on time, gave us excellent advice and counsel.  Would definitely call on them again!  It restores my faith that folks like BDry exist and are there when you need them the most.  Honest, faith based, and very upfront.", "pics": null, "resp": {"time": 1583186088486, "text": "Victor, we appreciate the kind words. We at BDry do our very best to give an honest and fair opinion on your home."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "102979406211856005264", "name": "Keri Ray", "time": 1599611258139, "rating": 5.0, "text": "Great company! Very polite and professional every step of the way!", "pics": null, "resp": {"time": 1599766418226, "text": "Thanks for the review Keri!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "110786030227628816154", "name": "Jennifer Quick", "time": 1570202330615, "rating": 5.0, "text": "Awesome customer service.   Had Todd come out and look at some issues going on in our basement.   He was extremely knowledgeable, informative, and most importantly honest.   He gave us his opinion on what solutions were available to us rather than trying to over sell us.   I highly recommend this company from our experience.", "pics": null, "resp": {"time": 1579733221163, "text": "Jennifer, we at BDry pride ourselves on being upfront and honest with our customers. We are happy to hear we made an impact on you. Thanks for the review!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "113719441170249403153", "name": "BK Allen", "time": 1609956145125, "rating": 1.0, "text": "I have dialed the number to this location 3 times consecutively and each time I was hung up on. Are they in service?", "pics": null, "resp": {"time": 1609957823092, "text": "Hi BK - I apologize you are running into issues getting in touch with our office. Can you please confirm you are trying to get in touch with BDry Alabama? Our office number is 205-942-1976."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "110228961970183904234", "name": "Andrea Greene", "time": 1581434609193, "rating": 5.0, "text": "I cannot possibly express how thankful I am to have a BDry system in my home. A previous owner installed the system. I knew nothing about it or how it worked, much less which company installed it. BDry identified it as their system and quickly fixed the problem with an unmatched level of expertise, integrity and professionalism that went beyond the call of duty. Despite record levels of rainfall, they promptly returned my calls and prioritized my repairs because the house had just hit the real estate market with more than seven showings lined up the next day. I never paid a penny for this system or for the repairs but I was treated like their best client. I can’t imagine hiring anyone else for waterproofing needs.", "pics": null, "resp": {"time": 1581631810643, "text": "Andrea, thank you for the great review! We at BDry work hard to provide the best customer service experience in the industry. Heavy rains require quick responses. We are happy to serve customers as you!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "114764706134000408492", "name": "Michael Arnold", "time": 1603288974499, "rating": 5.0, "text": "Lee came to my house for sump pump constantly running. Turns out I had broken water line in front yard. Lee helped me discover it!!", "pics": null, "resp": {"time": 1603292438837, "text": "Michael - BDry has stood by our Lifetime Warranty for over 60 years by sending the industry's top professionals to evaluate customer's issues. Great to hear we were able to once again solve your home's issues and always happy to have you as a customer. Thanks for the review!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "102425187546447111936", "name": "Bruce B", "time": 1579056852374, "rating": 5.0, "text": "Very attentive to installation and on service. Immediate responses when they were contacted .  I give my highest recommendation to this company.... the very best in my opinion!!", "pics": null, "resp": {"time": 1579732423216, "text": "Thank you Bruce! We appreciate your trust in BDry."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "105887389605911471952", "name": "Robert Irwin", "time": 1567710894234, "rating": 5.0, "text": "Very pleased with the results from team BDry.  From the proposal to the completion of the project was very good.  I had received several bids on how to repair/ prevent water coming in basement.  BDry never tried the \"hard sale\" technique and never bashed their competitors as the other companies did.  They were more focused on just fixing my basement, meeting my needs, and making sure job was done right.  I would use them again and I have already recommended them to other people with same water issues.\nMuch tks BDry...Rob", "pics": null, "resp": {"time": 1579733692033, "text": "Robert, BDry thrives while operating under the highest integrity. We greatly appreciate your business and happy we were able to fix your water issues!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "101262870122560435899", "name": "Margaret Parrish", "time": 1568651318592, "rating": 5.0, "text": "I had an issue with the original install. They were prompt in accessing the issue and prompt in fixing it. When they say lifetime guarantee, they mean it. The crew (James, Jason and Charle) were very professional and did not mess around. I was very pleased with how they communicated with me and got the job done right.", "pics": null, "resp": {"time": 1579733363365, "text": "Margaret, we uphold our warranty to the highest standards in the industry. Thank you for your support in BDry!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "114358191959615630743", "name": "Joan Garrison", "time": 1599851040177, "rating": 5.0, "text": "Very professional from the time the representative came out to look at the\nproperty and evaluate the problem until the project was complete everything went as planned and was right on schedule\nI highly recommend this company", "pics": null, "resp": {"time": 1601495642208, "text": "Thanks for the review Joan! We at BDry work hard to give our customers a seamless customer experience."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "114195818206719455786", "name": "Pamela Eskridge", "time": 1567651645528, "rating": 5.0, "text": "Lee Smith and his team( Whisper, Imari, Dee, and Jeff) did a great job. The whole crew was kind, respectful, and a pleasure to work with. I had a few different jobs that had to be done and Lee and Jeff made sure everything was working and cleaned up before they left. I plan on having some additional work done by Lee and and his team. Thanks again!", "pics": null, "resp": {"time": 1579734667978, "text": "Pamela, we are happy at BDry to have fixed your Foundation and Water issues. We continue training our employees to be the best in the industry. Thank you for your trust in BDry!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "115793553375484016742", "name": "Patrick Bailey", "time": 1585604051466, "rating": 3.0, "text": "The owner and workers were very nice. Was DEFINITELY the best of 3 quotes and was glad to hear about the \"Gravity System\" so no need for a pump install. I did alot of work myself to prepare for the job. Took down walls, studs, and anything in the way on the entire perimeter of my basement (1800 sq ft home). I also dug out a trench from my house to the edge of the yard (3ft deep by 1ft wide by 15ft long) for the drainage pipe. Had a grate installed on the front of my garage doors so no more water comes in garage. I had definitely been getting water coming in through the ground and was evident by the mold on the blocks in the garage before the system was in place. I have to say now almost a year later I haven't had a single drop come inside when it used to come in any time it would rain. However, I have periodically checked and have never seen the water come out of the drain pipe outside no matter how much or how hard it rains. I honestly don't know where the water is going but it's not coming inside. The reason BDry gets 3 stars is that the overall job works but is not 100%-I don't know where the water goes, the perimeter jackhammer/ concrete fill job isn't smooth and has cracks. The water drain panels put inside are wavy and needed to be more secure. The trim pieces weren't put in but left for me to do so it doesn't look like it should. Was about a 10k investment, I just hope that water isn't eroding my foundation underneath. I still smell wetness at times of rain aswell. I love the product and idea just not 100% at ease with install.", "pics": null, "resp": {"time": 1579733112486, "text": "Hi Patrick, BDry has been providing customers a lifetime warranty for the life of the structure on waterproofing systems for over 60 years. If you have any concern with the integrity of your system, we would love to schedule our experienced service tech to test your system. Any necessary repairs due to the failure of our system will be at no charge to you. You can reach our office today at 205-942-1976. We look forward to hearing from you!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "115074904023408449992", "name": "Stephen (Trent) Wright", "time": 1567596873633, "rating": 5.0, "text": "Service was prompt and extremely helpful. David arrived timely to our appointment and was very knowledgeable as well. I will be using them again in the future.", "pics": null, "resp": {"time": 1579735063293, "text": "Stephen, BDry maintains the quickest response system when it comes to scheduling and service related calls. We look forward to hearing from you in the future!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "102200589927473871256", "name": "Binish Abdullah", "time": 1568041365461, "rating": 5.0, "text": "Lee and Jeff did a great job.  We had a small issue that Lee promptly came and fixed and everything has been great since then.", "pics": null, "resp": {"time": 1579733469734, "text": "Binish, our experienced service technicians are only one quick call away during unexpected emergencies. We appreciate your trust in BDry!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "109322556194093692325", "name": "Mike Rovnak", "time": 1567009876549, "rating": 5.0, "text": "Just like BDRY came highly recommended to me, I highly recommend BDry to anyone else that needs water remediation and structural support services. Todd and Drew provided excellent customer service throughout the project always keeping me up to date on the timeline. Todd made sure to educate me on the water issues my house was having and helped me understand exactly how they would remedy the problem. The workers that did the construction and installation were some of the hardest working people I’ve ever seen and they were super friendly, especially Jason and Cristy. I’m very happy with the finished product and we are excited to have a basement that we can be proud of now. Thank you BDRY team.", "pics": null, "resp": {"time": 1579735564113, "text": "Hi Mike, BDry is excited to hear we provided a quality service to put you at peace of mind. Construction work can be difficult to manage, therefore our customer service must feel seamless. We are always happy to help!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "112514000362625277809", "name": "Ian Rucker", "time": 1555934742585, "rating": 1.0, "text": "I had two guys come out very nice to give me a quote. I continued to shop around to make sure I was getting the best deal for my money. I was pleased with bdry’s price and the guys characters. I called back maybe a month later  spoke with the receptionist, he transferred me to David. Never answered, never responded, never heard anything back about why they didn’t want my business. It was so disappointing and unprofessional. I’ve never left a bad review in my life but I absolutely had too.", "pics": null, "resp": {"time": 1568408317992, "text": "Hi Ian – we apologize that you had an unsatisfactory experience with BDry. This is definitely not up to our usual customer service standards, and we want to make it right. Could you please email your contact information to bdryalabama@gmail.com so that we can put you in touch with a manager directly? Thank you."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "106928294220052243501", "name": "monty ballard", "time": 1557869405796, "rating": 5.0, "text": "BDry did an excellent job....basement still dry, even after all the rain.", "pics": null, "resp": {"time": 1611877686777, "text": "Monty - We really appreciate the great review! Now let your basement BE DRY."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "107148795056738304572", "name": "carlos brewer", "time": 1563105017447, "rating": 1.0, "text": "I have been trying to get a pump installed for over 3 months. Countless emails and  calls about setting up dates to come out. They never showed up. Worst company ever. Please beware people.", "pics": null, "resp": {"time": 1563212589345, "text": "Hi Carlos – we apologize that we were unable to connect on a timely basis to install your pump. This is definitely not up to our usual customer service standards, and we want to make it right. Could you please email your contact information to bdryalabama@gmail.com so that we can put you in touch with a manager directly? Thank you."}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "115855257361555246785", "name": "C C", "time": 1609191854195, "rating": 5.0, "text": "David and his team at BDry did a excellent job. They showed up when they were supposed to. The workers were  courteous and the most important thing is they solved my problem.", "pics": null, "resp": {"time": 1579732680288, "text": "BDry is happy to have fixed your issue and we strive towards excellence!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "105303676754152723574", "name": "Mike Hagood", "time": 1484695658325, "rating": 5.0, "text": "B-Dry waterproofing job has been good so far (4 months).  Recommended.", "pics": null, "resp": {"time": 1611877579817, "text": "Mike - We really appreciate the review!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "117384400131117495049", "name": "Sam Woodward", "time": 1484790709486, "rating": 5.0, "text": "Great to work with...Installation crew was great and drain system in crawlspace works like a charm.", "pics": null, "resp": {"time": 1611877515013, "text": "Thanks for the review Sam!"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
{"user_id": "115940678141069818345", "name": "Nikkie Love", "time": 1493690560364, "rating": 1.0, "text": "Someone came out in shorts, didn't go into the craw space to see what was going on and recommend for another person to come look so they would know what to fix..... Sounds like they looking to make money with friends.", "pics": null, "resp": {"time": 1493843130331, "text": "We are sorry to hear of your experience with BDry.  If you would please contact me directly so I can get some information from you to correct the issue.  You can email me at lsmith@bdry.com.  -- Lee Smith - Operations Manager"}, "gmap_id": "0x88891ee19433252f:0xb35c5268335e74ee"}
