{"user_id": "115972723526430339585", "name": "keith bell", "time": 1616615968666, "rating": 1.0, "text": "I contacted M.O.M on December 18th, 2020 asking for help with my situation.\nA nice person named Harrison explained the process to me which included picking up an application and getting it filled out. It took me about 2 weeks to get that filled out and to round up the additional paperwork associated with my situation.\nOnce I delivered the application I was told that a \"Doctor\" would contact me. At a later date I received a text saying a \"Doctor\" would be calling me on March 1st, 2021.\nNow I'll explain...I have been in what's called Pain Management for YEARS due to 2 different issues that cause me severe pain. I was VERY UPFRONT about my situation to MOM. Both of my conditions require narcotics for the pain.\nOkay, so my March 1st phone comes and I get a very condescending man that won't let me speak without cutting me off at every word. He explained \"I'm a retired heart surgeon\". \"I wouldn't feel comfortable prescribing those medications\". Did he say those things kindly and in a professional manner??? No !!! He had a harsh tone and was indignant.\nIf I tried to speak, he would talk over me...It got to the point where I just clammed up and let him ramble.\nNeedless to say, I couldn't believe what my ears were hearing after waiting for so long for that phone call.\nHe went on to tell me that he had \"friends\" that could help me if I would go out and get copies of my MRI's x-rays, tests, etc (basically go get the proof). Once I do that, drop them off at the office and someone would get back to me very quickly. I went out and rounded up EVERYTHING and then some as asked the very same day. FYI, it's not easy for me to do all that due to my condition. But I kept my word. (that means doing what you say you're gonna do)\nToday is March 24th, 2021...I'm the one that REACHED OUT to M.O.M asking where I was in the process? I was quickly told that they don't help people in my situation.\nWhat??? Huh???!!!\nI'm just NOW being informed of this?\nMy question is; \"Am I the very first one that they've ever dealt with in my situation?\"\nFrom December 18th 2020, until March 24, 2021 nobody had the courtesy of saying to me \"You're outta luck\".\nI suggested that they have weekly meetings and discuss their shortcomings namely that \"doctor\" and also informing PEOPLE LIKE ME that we're not suitable for help early on in their process.\nOkay, so who do I blame???\nI blame myself!\nI'm the one that put my trust into this organization.\nI'm the one that believed they would be my saving grace.\nI'm the one that trusted what people were telling me.\nI'm the one that didn't have a Plan B in place.\nI'm the one that's screwed.\nAnd no, it's not the narcotics talking here...Remember? I don't have any.\nWhat I do have is excruciating pain that only allows me to sleep for two hours at a time. It's really exhausting living like this.\nThanks ya'll !\nAnd a very special thanks goes out to the \"doctor\" (?).\nFYI, it forced me to give at least one star before it would allow me to post.", "pics": null, "resp": null, "gmap_id": "0x888e8042e78f63c5:0xb1ce305bf8e25f61"}
{"user_id": "104629921333113068955", "name": "Annie Thomas", "time": 1612449014470, "rating": 5.0, "text": "They are very caring and concerned for their patients and amazing group of people", "pics": null, "resp": null, "gmap_id": "0x888e8042e78f63c5:0xb1ce305bf8e25f61"}
{"user_id": "111569205298206806266", "name": "gigi boyd", "time": 1622161902511, "rating": 5.0, "text": "Saved my life!", "pics": null, "resp": null, "gmap_id": "0x888e8042e78f63c5:0xb1ce305bf8e25f61"}
{"user_id": "116695107958908591619", "name": "Diane Jackson", "time": 1583337985461, "rating": 5.0, "text": "Loving and caring people. The best thing ever if you have no insurance. Excellent professionals and excellent service.", "pics": null, "resp": null, "gmap_id": "0x888e8042e78f63c5:0xb1ce305bf8e25f61"}
{"user_id": "117520594855545071351", "name": "Dorresa Jackson", "time": 1475701660036, "rating": 5.0, "text": "Nancy Hogan was excellent help she explained to me quite a lot about how MOM works I'd like to apologize and set the record straight I was misinformed by someone else thus making me panic & feel like my trust was  violated but I now know that it wasn't due to receiving incorrect information I was lead to believe that these people didn't have my best interest at heart which I should have known better since they've helped me for almost 2 years & have never once lead me to believe otherwise about them so I should have trusted them and not the other people! I have to say MOM has helped me tremendously with the medications that I cannot afford & I appreciate them for still trying to help me get the appropriate medications my doctor goes out of his way to help find ways for me to be able to get medications I cannot afford without MOM I am not sure where I'd be! I am giving you all 5 stars for your excellent customer services as well as your patient, kindness and understanding thank you Nancy for being patient with me and explaining everything thoroughly with me to make sure I understood and for telling me if I need any help or have any questions in regards to anything to call you, thanks a bunch for helping a confused patient!", "pics": null, "resp": null, "gmap_id": "0x888e8042e78f63c5:0xb1ce305bf8e25f61"}
{"user_id": "102927029356092205957", "name": "Sherree Burkett", "time": 1584536331827, "rating": 5.0, "text": "Very nice professional staff who goes over and beyond to meet your needs", "pics": null, "resp": null, "gmap_id": "0x888e8042e78f63c5:0xb1ce305bf8e25f61"}
{"user_id": "103070059516237704033", "name": "Millie Wright", "time": 1549467330140, "rating": 5.0, "text": "This Outreach Ministries is a Blessing and a wonderful addition to our family. The medical attention us second to none .All the other services provide go over and beyond", "pics": null, "resp": null, "gmap_id": "0x888e8042e78f63c5:0xb1ce305bf8e25f61"}
{"user_id": "109932884298087556570", "name": "trestea smiley", "time": 1553638828822, "rating": 1.0, "text": "This place is using the name Ministries Outreach when they're not out reaching to nobody what they're doing is a organization designed up to whoop Medicaid God doesn't turn no one down from his house these people want you to stand in line 5 in the morning they don't open the doors until 7 and then is still a possibility that you don't be seen", "pics": null, "resp": null, "gmap_id": "0x888e8042e78f63c5:0xb1ce305bf8e25f61"}
{"user_id": "117542108768939322457", "name": "Conita Henderson", "time": 1535498117188, "rating": 5.0, "text": "They are great and work well with you.", "pics": null, "resp": null, "gmap_id": "0x888e8042e78f63c5:0xb1ce305bf8e25f61"}
