{"user_id": "101741119532894049792", "name": "Danny Milligan", "time": 1626832364205, "rating": 4.0, "text": "No issues here other than they did not have the type of trees we were looking for. They were very busy and it took a few minutes to get help but when we did they were very friendly and helpful. I may be checking back with him on some trees and will update accordingly.", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "106367547065135486293", "name": "Rachel Finner", "time": 1620504617470, "rating": 4.0, "text": "It was a great day for a bike ride.  Beautiful flowers,  friendly people and service at trade days.  We will definitely be back soon.", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "100981765284599850142", "name": "Trae Otwell", "time": 1625845064653, "rating": 5.0, "text": "Great local business with very friendly  staff.", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "100482401272500010586", "name": "Jami Powers", "time": 1616272896061, "rating": 5.0, "text": "Great selection of local items.", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "112759328471125639874", "name": "Brittany Windham", "time": 1590265794333, "rating": 5.0, "text": "The staff here is very friendly, love having a local shop that supports other local sellers and craftsman. Such a pleasure and always nice varieties of items for gifts also. Fresh produce and plants galore. 😍", "pics": null, "resp": {"time": 1590272928390, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "111665168328261853034", "name": "Derek Ried", "time": 1601580426531, "rating": 5.0, "text": "Great place! I love to buy plants and soil there.", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "103373153066407071813", "name": "Lori Covington-Strouss", "time": 1608408592532, "rating": 5.0, "text": "I always enjoy the garden market. !", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "113272776509253741993", "name": "Neisha Dorantes", "time": 1587592050241, "rating": 1.0, "text": "We have been so happy to support this shop since they opened. The guy owner is very nice, the lady however is very rude and has a temper. She came up behind me yelling at my daughter and I, made me jump off the ground startling me. We were doing nothing deserving of this behavior. Did it make you feel good yelling at my autistic daughter?", "pics": null, "resp": {"time": 1587599645447, "text": "Ma'am, no one yelled at your daughter. We only requested that you and your daughter leave the bird's nest undisturbed (I even said \"please\"), because often a mother bird will not return to a nest which has been disturbed. We respect that we share our outdoor space with the local wildlife, and we just don't want the baby birds to die. We want everyone who visits our store to feel welcome, people and wildlife."}, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "117512965993065586282", "name": "Mike Weathers", "time": 1592096001613, "rating": 5.0, "text": "This is a cool place.what a variety of goods.everyone needs to stop n check it out", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "101322525306646343161", "name": "jason cobb", "time": 1613864486937, "rating": 5.0, "text": "Great people to  shop with", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "112376839297593451644", "name": "Rebecca Macks", "time": 1573678922276, "rating": 5.0, "text": "awesome place, very clean and an amazing collection of interesting food items", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "100062114960308825772", "name": "Angela Boackle", "time": 1591462840725, "rating": 5.0, "text": "My favorite place to shop", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "112368767078718935065", "name": "justin martnez", "time": 1590446779957, "rating": 5.0, "text": "(Translated by Google) Many pretty plants\n\n(Original)\nMuchas plantas bonitas", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "104285027359998150050", "name": "Ashley Crim- Smith", "time": 1600553377537, "rating": 5.0, "text": "Best place in downtown Prattville!!! They've got AMAZING pre-cooked dinners/casseroles that are so easy for quick dinners. And the BEST chicken salad ever!!! ... The boutique and antique shop inside have cute and unique items, highly recommend this place to anyone!!", "pics": null, "resp": null, "gmap_id": "0x888e8e4154b41bd5:0xefecaa2039e1f984"}
{"user_id": "101369889282048456920", "name": "Shelley Kim", "time": 1582063085757, "rating": 5.0, "text": "I don’t get a chance to get to Prattville that often, but when I do, I make sure to stop by here to purchase some casseroles and soups.\n\nConnie, the owner, is a real sweetheart and very much involved in her business, always there to greet with you with a smile and help you out.  I think it’s so important to support your local mom and pop stores, while benefiting from food that is lovingly home made.  You can’t go wrong!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPkFacMTNGyyahUE8h8Y_NLQSNyq9czoETWz8Pz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOD2gS1wdEKxz1Sqvn7otwow3l4HMTYnCbQ4VC0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMIzGicBV4TDl0XBADRXrsr4_Xr9d1bq8NmDjr1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNJuwJl7mXuV2EFguYI8H_jP1Hrfil6z7-H57un=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e8e4154b41bd5:0xefecaa2039e1f984"}
{"user_id": "113165073129800029496", "name": "Joe Garrick", "time": 1609026965126, "rating": 4.0, "text": "Good place to go in and get what you need prices are high but a in and out is good", "pics": null, "resp": null, "gmap_id": "0x888e8e4154b41bd5:0xefecaa2039e1f984"}
{"user_id": "109102800925236420668", "name": "MBB", "time": 1609295907779, "rating": 5.0, "text": "Their casseroles are great and they offer so much more.", "pics": null, "resp": null, "gmap_id": "0x888e8e4154b41bd5:0xefecaa2039e1f984"}
{"user_id": "110847434013009084456", "name": "Chuck", "time": 1599161289280, "rating": 5.0, "text": "These casseroles are excellent. The chicken salad and pimiento cheese are delicious.", "pics": null, "resp": null, "gmap_id": "0x888e8e4154b41bd5:0xefecaa2039e1f984"}
{"user_id": "105856467183347130779", "name": "David Pressley", "time": 1611442830728, "rating": 5.0, "text": "Great homemade food!!", "pics": null, "resp": null, "gmap_id": "0x888e8e4154b41bd5:0xefecaa2039e1f984"}
{"user_id": "118168713651052634920", "name": "Hannah Barnes", "time": 1561656094520, "rating": 5.0, "text": "I bought a squash casserole, a container of chicken salad and a container of pimento cheese. I went home and made lunch out of the pimento cheese and the chicken salad and it was wonderful, wow it was so delicious. I will be having the squash casserole for dinner tonight. 😀", "pics": null, "resp": null, "gmap_id": "0x888e8e4154b41bd5:0xefecaa2039e1f984"}
{"user_id": "104725816697057002619", "name": "JJ JJ", "time": 1570062075639, "rating": 5.0, "text": "Highly recommend! My son loved the beef stroganoff and Hashbrown Casserole. We will definitely be back!!!", "pics": null, "resp": null, "gmap_id": "0x888e8e4154b41bd5:0xefecaa2039e1f984"}
{"user_id": "107271079074585401009", "name": "Carol Meeks", "time": 1508446162894, "rating": 5.0, "text": "This place is so very pleasant & helpful. From shopping or to have a great meal.", "pics": null, "resp": null, "gmap_id": "0x888e8e4154b41bd5:0xefecaa2039e1f984"}
{"user_id": "108101620383308023474", "name": "Abigail Corbett", "time": 1490034897074, "rating": 5.0, "text": "I love ordering their casseroles to go. Such a great quick meal or meal to take to a friend.", "pics": null, "resp": null, "gmap_id": "0x888e8e4154b41bd5:0xefecaa2039e1f984"}
{"user_id": "117723870996046694328", "name": "kayla dismukes", "time": 1387426999354, "rating": 5.0, "text": "loved the whole place food was wonderful yummy chicken. salad lots to see will. go back", "pics": null, "resp": null, "gmap_id": "0x888e8e4154b41bd5:0xefecaa2039e1f984"}
{"user_id": "107132282539422431356", "name": "Marissa Wiles", "time": 1368136230999, "rating": 3.0, "text": "Very disappointed in this store. Went in with my husband today to look around. Was trying to just find some cute jewelry. Unfortunately, we were subjected to a soap opera from the \"manager\" behind the counter and her friend in the store. We got to hear all about how the gentleman in her life was still talking to his ex and she would beat his a**. This is not professional for a work environment. The conversation was loud enough to be heard across the entire store. We left without purchasing anything due to the atmosphere there. I'll be highly surprised if I visit again.", "pics": null, "resp": {"time": 1373405910053, "text": "Hi Marissa,\n\nMy name is Connie - I am the owner and manager of Fanci Free. Thank you for taking time to leave a review and bringing this incident to my attention.  I was not in the store on the day of your visit, but as soon as I heard what happened I made several unsuccessful attempts to contact you. I discovered this written review about your experience only last week.\n\nI wish to extend my sincere apologies to you and your husband. I want you to know I have personally addressed the situation.\n\nAt Fanci Free, we value each and every one of our customers. We have a long-standing reputation of making our boutique and café a place where everyone feels happy and leaves happy. I am so glad that you enjoyed the quality and appeal of Fanci Free (as reflected in your ratings) - but on the day of your visit, we fell short of our overall mission.\n\nAs a token of our appreciation for your patronage, and to make amends, I invite you to return and enjoy a free meal with us. Then I will be happy to help you find that cute jewelry you were looking for - we have plenty to choose from!\n\nPlease call and ask for me (Connie Dismukes).\n\nI look forward to meeting you and your husband. Thank you again for your comments and helping us to continue providing the best service and customer experience in the downtown Prattville area.\n\nConnie Dismukes, Owner & Manager - Fanci Free Café & Boutique"}, "gmap_id": "0x888e8e4154b41bd5:0xefecaa2039e1f984"}
{"user_id": "111891707475499803083", "name": "Jennifer Lane", "time": 1566076778038, "rating": 3.0, "text": "Okay if you're in a jam, but takes twice as long to cook as they say.", "pics": null, "resp": null, "gmap_id": "0x888e8e4154b41bd5:0xefecaa2039e1f984"}
{"user_id": "112169728238964183216", "name": "Teresa Ingram", "time": 1570843146740, "rating": 5.0, "text": "Try the chicken spaghetti. Just WOW!", "pics": null, "resp": null, "gmap_id": "0x888e8e4154b41bd5:0xefecaa2039e1f984"}
{"user_id": "112215423010598463529", "name": "Anthony A. II (HanLikeAMF)", "time": 1502599206790, "rating": 5.0, "text": "The Poppyseed Chicken Casserole is the absolute bestest.", "pics": null, "resp": null, "gmap_id": "0x888e8e4154b41bd5:0xefecaa2039e1f984"}
{"user_id": "111354904512217455502", "name": "nay redd", "time": 1583791920165, "rating": 3.0, "text": "Wish the portions were bigger for the prices", "pics": null, "resp": null, "gmap_id": "0x888e8e4154b41bd5:0xefecaa2039e1f984"}
{"user_id": "101414262903550934145", "name": "Kathy Bentley", "time": 1605568262566, "rating": 5.0, "text": "I shop here weekly and iv never had any problems that other groceries stores don't give people but check out here is usually faster. I buy meats here weekly and never have had a problem. Their 5 for $20 is unbeatable.", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "107754323762699050407", "name": "NOT ME!!", "time": 1545182407516, "rating": 5.0, "text": "Well..  i do know they are selling Aged Cheese... i seen this today... 4-15-2018...\n\nTo the store owner... Rodger...\nMy husband was in the store a while back and he told me you approached him ....and told him to tell me ... you want to see me....\nI havnt had time to specifically stop in and see you...\nI assume you want to speak to me about this particular review....\n\nIf my review is pressing you for any reason and you truly want to speak to me  feel free to send me a email message...\n\nThis is the very first  time i have ever heard of a business owner confronting a customer over a freedom of speech review....providing this review is the issue...thank you for taking the time to read your stores reviews..", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPqbZtB_-Wv3uixcIs4I7X7tPdvitrzxiLFPnFi=w150-h150-k-no-p"]}], "resp": {"time": 1523829298906, "text": "Thank you for your good review. We are glad that we have met your expectation. Please  let others know through word of the mouth which goes a long way than regular advertisement.\nWe are here to serve you & your needs.\nThank you\nBig B Grocery\nRoger Bhatt"}, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "104674782787422072897", "name": "Craig Winn", "time": 1519576249967, "rating": 5.0, "text": "My dad lives about 3 miles away and shops here often. He often talks of the friendliness of the owner and his wife who seems to be there all the time. I stopped by there myself this weekend to grab a couple things on the way to my dad’s house and was really pleased with how clean and well stocked the store was. Way to go Mr. Owner with your one man show. Kudos to you.", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "116545270457954675118", "name": "John Smith", "time": 1547237645078, "rating": 5.0, "text": "Nice and friendly staff! The two people I talked with where very knowledgeable especially the meat guy! He gave me some great recipes and cooking ideas.", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "107345275641156914927", "name": "Larissa&Griffin Beckwith", "time": 1569966552504, "rating": 1.0, "text": "I am only leaving this one star for the simple fact that is the least you can leave for the review. I went in there 5min minutes ago and was wearing gym shorts and a t-shirt and the had nothing but a 5dollar bill and car keys . Andtthe hav the owner Roger felt me up", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "101860974434612145796", "name": "Oliver Watson", "time": 1515647198176, "rating": 5.0, "text": "This Whole Foods makes me happy. I can walk in there and get exactly what I need every time, no problem. It's always stocked, fresh produce and clean. Plus, you can't beat the validated parking.", "pics": null, "resp": {"time": 1520516328030, "text": "Thank you for good review we are glad that we met your expectation. please let others know about us and we are here to serve you & your needs. good to see you Oliver & thank you again\nthank you\nBig B Grocery\nRoger Bhatt"}, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "117962572185444496130", "name": "Joy Cato", "time": 1546518881279, "rating": 5.0, "text": "Great place to shop! It’s really close to my parents house. Since I come home often from Georgia, this is really convenient.", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "105113740764504954211", "name": "S", "time": 1539021748001, "rating": 1.0, "text": "I used to go to Big B a lot, we lived close and it was easier than going to Walmart, plus their prices were wonderful.\nThen things got worse, our selections became spoiled meat that was repackaged and called \"fresh\" you could smell it was not, several times we bought packaged veggies at a deal and found mold. Most of their dairy is past it's date but they wash them off so there are no dates and then tell you, \"you can either buy it or go somewhere else\".\nSo now we drive to town to buy our stuff or go next door to Dollar General, because we know their stuff isn't rotten or expired. Also when looking up the health score online it doesn't show that Big B has a current health department rating, this is alarming on so many levels.", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "102693091585590660590", "name": "JERRY JAMES", "time": 1364591559249, "rating": 3.0, "text": "Need a good view of meat case w/prices. I live about 20 miles from you and would like to check out your meats, especially. I am sick of walmart's ripping me off. I would love to get a weekly ad.", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "107404595314316563374", "name": "Sully Sammy", "time": 1469130004514, "rating": 1.0, "text": "Every time I go to Big B, which isn't very often, there is someone smoking right next to the door. My 3 year old daughter and I have asthma really bad and are highly allergic to cigarette smoke. That is the reason why I don't go there very often. I only go when I need to pick up something quick.", "pics": null, "resp": {"time": 1469148010387, "text": "HI Randi\ni am sorry that happen to you but please let me know next time when you here because our employee  is not allowed to smoke by the door  but designated smoking area and we have only two employee who smokes  but i have not catch them smoking by the door but please let me know while you are here\n\nsorry for your suffering\nand always thank you for kind remarks"}, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "116713103032642317570", "name": "Landon Bragg", "time": 1539222397012, "rating": 1.0, "text": "This used to be a great place to shop. They had decent prices on good quality meats, fresh produce, and friendly staff. I took my last trip out to Big B's today (10/10/18) only to find they'd closed an hour and a half early. They cover expiration dates with \"sale\" stickers, chop expired produce in \"stir fry\" mixes, and leave a ton of fat face down on meats seemingly to increase weight. I can't count the number of times I've seen expired dairy or milk here. Pic'N Sav in Oxford or Anniston both sells the same generic products, but at much lower prices. It just doesn't make sense why the owner would be okay with running a store this way.  Save yourself the hastle and shop somewhere else.", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "100141393239486406261", "name": "Joann Mayne", "time": 1507174854615, "rating": 3.0, "text": "Only been there once but seems to be a pretty good place with decent prices +10%", "pics": null, "resp": {"time": 1510535036405, "text": "Thank you we do our best to keep our prices below of competitors and we do not charge 10% surcharge  and you only pay a 7% sales tax.  Please come back and shop often!"}, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "107982324487956270688", "name": "Cade Somers", "time": 1501539552891, "rating": 5.0, "text": "Wide selection of products for a small grocery store. Cashiers are friendly. The store and parking lot are always clean. No line: in, out, & back home cooking in no time.", "pics": null, "resp": {"time": 1501548686681, "text": "Thank you for good review we are glad that we met your expectation. please  let others know about us and we are here to serve you & your needs.\nThank you\nBig B Grocery\nRoger Bhatt"}, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "113199332412150943350", "name": "Cindy Lynn Smith", "time": 1502995090721, "rating": 3.0, "text": "Good grocery store to run into to get that last minute item you may have forgotten. Good location.", "pics": null, "resp": {"time": 1510535294601, "text": "sorry for didn't get back in time to appreciate your review but it is always pleasure serving you"}, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "101200002995259132581", "name": "Sharon Hyde", "time": 1499274151884, "rating": 4.0, "text": "Very nice employees and clean. They have a deal of pick 5 marked packs of items for 19.99 so I load up", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "110732724511213295003", "name": "Jason Hubbard", "time": 1495389778421, "rating": 5.0, "text": "A small community full service grocery store with a meat department that is fabulous. Roger Bhatt is the owner and he takes the time to get to know his patrons.", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "105621082116095361876", "name": "Tyler Johnson", "time": 1505848805709, "rating": 5.0, "text": "Great deals, locally owned, and wonderfully service. Definitely would recommend to any and everyone.", "pics": null, "resp": {"time": 1510535057117, "text": "Thank you!"}, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "106342329243401536525", "name": "Pam Love", "time": 1497925963576, "rating": 2.0, "text": "Produce not as fresh as I like or selection as good. Cant find what I am looking for.", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "106192780229423452650", "name": "Jamie Robinson", "time": 1466686435040, "rating": 3.0, "text": "Good price on meat but don't look like a Thug you WILL get looked at and followed", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "113162194976302875596", "name": "Matt “DeCepTiCoN4lyfe86” Morrison", "time": 1510174557496, "rating": 3.0, "text": "The only time i really ever go here is if i 4got 2 pik up sumthin earlier that day or REALLY need sumthin NOW. I only live bowt  1 1/2 miles from it & if not 4 that i wud never go there. Only have a selective selection of groceries & they usually cost 1/2 × more than ne where else. Other than that, the service is pretty good.", "pics": null, "resp": {"time": 1510534690607, "text": "Thank you for your comments about our service.  As far as prices, we are cheaper than many of competitors."}, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "101508956489589716298", "name": "Catherine Davila", "time": 1510319335976, "rating": 4.0, "text": "Like shopping here because the meat packaging is great", "pics": null, "resp": {"time": 1510534747158, "text": "Thank you and we look forward to serving you again soon!"}, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "108398310946985365075", "name": "Overdone Canolli", "time": 1529823118978, "rating": 5.0, "text": "I always notice how clean the store is. I always know someone is always around to help me find things I'm looking for.", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "108553970539999255710", "name": "Antonio Long", "time": 1494080315411, "rating": 5.0, "text": "Great store the people are great I ride from Anniston just to go", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "113062219847061457039", "name": "Cathy Skinner", "time": 1483385902789, "rating": 5.0, "text": "Good selection.  Usually not a wait in line. Friendly", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "116025294223116526955", "name": "Tammy Estes", "time": 1502554510600, "rating": 2.0, "text": "Thought they had better prices on their meats", "pics": null, "resp": {"time": 1502564551638, "text": "Hi Tammy,\nI am glad you like our meat prices  but I would like to know that what you didn't like , So we can improve .\nthank you for shopping at Big B Grocery\n\nManager\nRoger Bhatt"}, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "107848506886495097141", "name": "Katie Collins", "time": 1510587536620, "rating": 1.0, "text": "I went in the there to get a pack of ciggerets and the lady saw me standing there and didnt help me so i walked out", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "115510945340724858317", "name": "Кошик Ариан", "time": 1408200817458, "rating": 5.0, "text": "The best store in calhoun county and best meat in calhoun county\nThis store is lot better than food outlet and it is no more food outlet they do not charge 10% and prices are low and very friendly people now store  stays open till 900 pm  please visit and find it for yourself.", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "112287755456497747951", "name": "Tracy Garner", "time": 1519257995107, "rating": 5.0, "text": "Love this store there meats are awesome to!!", "pics": null, "resp": {"time": 1519267014842, "text": "Thank you for good review we are glad that we met your expectation. please  let others know about us and we are here to serve you & your needs.\nthank you\nBig B Grocery\nRoger Bhatt"}, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "115871207503163822949", "name": "Joseph Hankes", "time": 1496172236059, "rating": 3.0, "text": "Reasonable prices and nice management", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "117128899718317350823", "name": "Ruby Miles", "time": 1547856700068, "rating": 5.0, "text": "Great price and food", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "115725774509662064494", "name": "Brenna Smith", "time": 1535191075727, "rating": 1.0, "text": "They suck their meat should be put up for dog food you bring a bag to your home you bring more bugs then you do food the store is nasty and stinks thank god there's a win Dixie close by.", "pics": null, "resp": {"time": 1523829514491, "text": "Thank you for  your 5 star review & like if you are happy with our service please let other know we are eager to serve you,\nThank you again\nBig B Grocery"}, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "108314780571968964354", "name": "Debra Spurlin", "time": 1518382075452, "rating": 5.0, "text": "I always shop here..it is cheaper than most places and I usually can find anything I need!", "pics": null, "resp": {"time": 1520516274910, "text": "Thank you Debra Spurlin for good review we are glad that we met your expectation. please let others know about us and we are here to serve you & your needs.\nthank you\nBig B Grocery\nRoger Bhatt"}, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "104166031729958490663", "name": "FrostSoCold NHCG", "time": 1502823382917, "rating": 5.0, "text": "Great home town place to shop", "pics": null, "resp": {"time": 1510535069264, "text": "Thank YOU!"}, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "105223581355136047484", "name": "Beverley Graham", "time": 1532549120228, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "106658624675166211359", "name": "Angel Coates", "time": 1502132198934, "rating": 2.0, "text": "too expensive", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "116928203836847902527", "name": "Anthony Jernigan", "time": 1499346953300, "rating": 4.0, "text": "Great meats", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "114208028848802814184", "name": "Jay Gardner", "time": 1493993161122, "rating": 5.0, "text": "Its local an clean", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "109217170705216966682", "name": "Shurwood Hurst", "time": 1497604973573, "rating": 5.0, "text": "Great place to shop", "pics": null, "resp": {"time": 1497611269878, "text": "Thank you for review\nwe are eager to serve you\nThank you again\nBig B Grocery"}, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "114858393327148340884", "name": "Crystal Lowrey", "time": 1472038635582, "rating": 3.0, "text": "Good for food", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "102951396253082843604", "name": "Chad Vice", "time": 1499776395019, "rating": 5.0, "text": "Best Meat prices around", "pics": null, "resp": {"time": 1499781646057, "text": "Thank you for good review we are glad that we met your expectation. please  let others know about us and we are here to serve you & your needs.\nthank you\nBig B Grocery"}, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "114852155299200347398", "name": "Janet Warren", "time": 1463068214834, "rating": 5.0, "text": "Great place to shop", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
{"user_id": "117846814800216761912", "name": "Shannon Bates", "time": 1453785303382, "rating": 1.0, "text": "Owners were openly disrespecting employees", "pics": null, "resp": null, "gmap_id": "0x888badcc76d264b9:0x5ca9fdd68562fc4b"}
