{"user_id": "105521440646183351107", "name": "Tim Harris", "time": 1614971923139, "rating": 3.0, "text": "WOAH! What a disappointment... if you have no appetite or you eat like fashion model. This might be good. Portions are small *like half of a sandwich... and there \"large\" is like a medium anywhere else I have been.  Their fruit bowls look large but, I didn't get that.  I got a piddly bit for quite a lot.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNJgPuCy5lSHj6xubWuYRwe5tUm3RWyDfYYN8G7=w150-h150-k-no-p"]}], "resp": {"time": 1615059997562, "text": "Hey Tim, very sorry you had a bad experience. As you can imagine sourcing all organic premium ingredients can be expensive. Hopefully you’ll give us another shot to make it right. Thanks for the feedback."}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "103990461370590982565", "name": "Lee Reese", "time": 1623258912647, "rating": 5.0, "text": "Lovely little juice bar with a great menu of healthy, organic foods, smoothies and juices. The staff is super friendly and helped my make a good choice since it was my first time. Indoor and outdoor seating available and they have an app so you can order on the go.", "pics": null, "resp": null, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "117224301711028642891", "name": "Christine Golab", "time": 1624129336532, "rating": 5.0, "text": "Protein toast was ON POINT! Also love the salads and all the juices and milks! I would love to add a photo, but I ate it too fast 😁", "pics": null, "resp": {"time": 1624195667520, "text": "Hey Christine, glad you liked it!"}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "115380390164702670722", "name": "Nicole Havel", "time": 1615677714856, "rating": 2.0, "text": "I will say the food is delicious and clean and the juices are great. The building is spotless, and the workers are nice.\nHowever, I asked for both my juices to be light ice or no ice (I don’t like ice). I proceeded to be charged $5.50 more for each juice, totaling $14.25 per juice. I had ordered two juices and a toast, and, with a 25% tip, my total came out to $50. I was like excuse me? I asked for a receipt and was like there’s no way I’m paying $5.50 extra each drink for asking for light ice/no ice. Just give me less juice. So ultimately I had to ask for a refund. $8.75 is a lot for a juice to begin with so to put it bluntly don’t come here on a budget.\nI cook solely organic / grass fed / free range food. I know the costs are higher, but not that high. This place is a racket.", "pics": null, "resp": {"time": 1615758823205, "text": "Hey Nicole, we’re glad you like the food and the shop. As you know, premium organic food is expensive to source but it is the best for your health. Thanks for the feedback about extra juice pricing. Unfortunately that is what it costs us. I’ll be sure to reiterate with our team to make sure guests know there’s an added cost for that."}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "100507041558355994864", "name": "William Brend", "time": 1601406766599, "rating": 5.0, "text": "Absolutely fresh and delicious!!  Definitely recommend the Hardcore One if you love your veggies in a juice.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPhMsRYr2rLxFpV_96aBGjmcKZFyHyJuVtJCVFO=w150-h150-k-no-p"]}], "resp": {"time": 1601414082951, "text": "Thanks! Glad you liked it!!"}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "106481654350254045079", "name": "b H", "time": 1623686791660, "rating": 5.0, "text": "I’ve had a pleasant experience each time I’ve visited the Greystone location. The interaction was very minimal but nice enough. I’m definitely hooked and have decided to make Clean Juice a part of my daily routine.", "pics": null, "resp": null, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "113012862277914562442", "name": "Lorenzo Carter", "time": 1623807372668, "rating": 1.0, "text": "Im sad to complain that today was the first bad experience I've had at Clean Juice. I reported the incident to the manager Savanah, to no avail. Usually when entering the store its very pleasant and warm. Today when I came in it was very different. The lady at the register appeared to be annoyed and upset. She never asked if she could help me, she didn't speak, no smile or anything. She didn't say anything to me until I asked her a question about the menu. I don't know her name but she stood out to me because she was the only tall black young lady working. I told the manager it was frustrating to me because being a black man myself, i didn't expect to be treated that way by her. I have always been treated so nice and warm any other time I come in the store. I have written the corporate office and will follow up with them as soon as possible because after talking to the manager Savanah she let me know that her friendship with her employee was very strong...which let me know that I should not hold my breath for an apology.", "pics": null, "resp": null, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "118150165161769884814", "name": "Jennifer Pidgeon", "time": 1615929291897, "rating": 5.0, "text": "Today was my first visit to Clean Juice off 280.  I had the Longevity One smoothie, and it was really good and filling.  I bought some cold-pressed juices that I can't wait to try.  The staff was friendly and knowledge about the ingredients and health benefits.  I'm looking forward to trying the Greenoa Bowls, wraps, and toasts.  I will definitely go back and do recommend it.", "pics": null, "resp": {"time": 1615930200525, "text": "Hey thanks for coming in! Glad you liked it. We hope to see you again soon."}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "100835830868472758230", "name": "Amy Farren", "time": 1619018981338, "rating": 4.0, "text": "I got \"The Spring One\" smoothie, and it tasted like frozen water essentially. I thought I was getting Covid or something when I tried it, because there was no taste. Then I tried my son's Berry Bowl, and it was delicious. I have no problem paying high prices for organic food, but I would for it to at least taste good. I guess I just won't ever order their smoothies and stick to the acai bowls.", "pics": null, "resp": null, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "102017094557173481165", "name": "Ann Elizabeth Moore", "time": 1618106575387, "rating": 5.0, "text": "I loved Clean Juice from the moment we stepped inside! The atmosphere is great. The juices and smoothies are stellar. Highly recommend!!!", "pics": null, "resp": {"time": 1618107248091, "text": "Hey Ann, thanks for the kind words."}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "113127374870134095030", "name": "Melyssa Boggan", "time": 1612553210627, "rating": 5.0, "text": "Great atmosphere 😄 everyone is kind and seemed very friendly. Love the music playing. Everything looked so fresh (fruits and veggies). Juice and smoothie were delicious!!!", "pics": null, "resp": {"time": 1612709594060, "text": "Thanks Melyssa! Glad you liked it."}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "111028393082232650783", "name": "Jessica Hose", "time": 1612484118293, "rating": 5.0, "text": "The store was immaculate and love the worship music playing. The girls were so sweet and made our product perfect! Thank God for a truly healthy food in Greystone. I will be back for sure!", "pics": null, "resp": {"time": 1612534057419, "text": "Thanks Jessica!!"}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "106282476044616422920", "name": "David Aaron Sheetz", "time": 1615051086097, "rating": 1.0, "text": "DO NOT GO HERE IF YOU VALUE COVID-19 PRECAUTIONS. First I'll start with saying they have a sign that specifically asks for Yelp and Google reviews so here you go! The two employees working were both maskless this specific time I visited Clean Juice. I have been here on and off throughout the pandemic and have seen masks being worn sometimes and not others...Why can't this place enforce the ONE THING that scientists have PROVEN is effective? Why can't they stay consistent with their policies? This is grade A poor business management. Also there is a statewide mandate still active. USE LOGIC AND REASON OR LOSE MY BUSINESS. Food is great, don't kill your business by failing your employees and customers.", "pics": null, "resp": {"time": 1615059745378, "text": "Hey David,\nOur policy is for employees to wear masks. We will continue to have this policy until the governor drops the mandate. Thanks for feedback."}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "117487288471740409699", "name": "Dawn Willett", "time": 1623089484842, "rating": 5.0, "text": "The coffee smoothie was delicious. The staff is very friendly.", "pics": null, "resp": {"time": 1623090210132, "text": "Thanks Dawn!"}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "106584935652986104379", "name": "Michael Johnson", "time": 1619727454696, "rating": 5.0, "text": "Amazing atmosphere every time I come in. The staff is always friendly and professional! I have told all of my friends and coworker about Clean Juice!!!", "pics": null, "resp": {"time": 1619788379788, "text": "Thank you! We’re happy to serve."}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "113269003739488530867", "name": "Steven Mooney", "time": 1612380201101, "rating": 5.0, "text": "Friendly staff and delicious smoothies and juices.  I didn't try the food, but The Coffee One and The Intense One were both great.", "pics": null, "resp": {"time": 1612381029647, "text": "Thanks! Glad you enjoyed it!!"}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "111211229130598124985", "name": "Satin Touch Experience", "time": 1611637864497, "rating": 5.0, "text": "You better be ready for those shots oh my they help clean you out", "pics": null, "resp": null, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "115716292976033965637", "name": "Vinny", "time": 1597869548626, "rating": 4.0, "text": "Their product is excellent, but pricey.  They are limiting their potential with a lot of the “in your face” religious stuff scattered throughout the store.  This is off-putting to a lot of people and getting even more so.   The employees are very nice and friendly, the store is immaculate and the product is great.  If they make it more middle of the road, (No “hey, look at me I’m a Christian” and some $5 or less options, customers would be lined up out the door.", "pics": null, "resp": null, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "113831336570472774404", "name": "Max Messer", "time": 1590531581681, "rating": 5.0, "text": "I have had nothing but fantastic experiences at this location! The management is wonderful and always so friendly and welcoming. They remember my order and always suggest the best things on the menu with a great knowledge of all of the ingredients. I will definitely be coming back here as a regular!", "pics": null, "resp": null, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "113209894672078813811", "name": "Dr. Rebecca Warren", "time": 1595015734167, "rating": 5.0, "text": "Just drove by here on a trip back home and we had such a great experience! The team of women working were so nice and very attentive. We appreciated their patience as I asked for multiple things out of the ordinary. Will be back!", "pics": null, "resp": null, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "115154084561378653457", "name": "Melissa McCollum", "time": 1620079077691, "rating": 5.0, "text": "Love the smoothies and the customer service is excellent!", "pics": null, "resp": {"time": 1622157944416, "text": "Thanks Melissa!"}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "114090281214104787865", "name": "Savannah Irwin", "time": 1593474868101, "rating": 5.0, "text": "I love the atmosphere at Clean Juice. The staff and team at this location know how to make their guests feel welcome. The quality of the products is set apart, as well as the quality of the service provided. Love this store!!", "pics": null, "resp": null, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "112727715029031760476", "name": "Natalya Drake", "time": 1604180328766, "rating": 5.0, "text": "Great customer service, amazing drinks, I’m so thankful I live close to them.", "pics": null, "resp": {"time": 1604180913666, "text": "Thank you so much!! Glad you enjoyed it."}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "111205372981276608976", "name": "Shaundra Hudson", "time": 1581976261263, "rating": 5.0, "text": "Love this place.  I literally used to drive to Huntsville, Al to get my juice cleanses.  So excited they are down the street. Juices are fresh and staff is amazing.  You cannot go wrong here, everything is healthy and organic.", "pics": null, "resp": {"time": 1582065759409, "text": "Hello Sha, we used to drive to Huntsville and Atlanta weekly too!! Now we have great juice right in our back yard. Thanks for the kind words and valuable feedback."}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "117665314251772566299", "name": "Richard Baxter", "time": 1581448327071, "rating": 5.0, "text": "Our new favorite place! Organic and healthy juices and meals, a great atmosphere and friendly people, and a strong mission to bring health and wellness to their customers. Our whole family including the kids love their juices and smoothies and bowls. We will make this a regular stop during our week!", "pics": null, "resp": {"time": 1581458206237, "text": "Hello Richard, Thanks so much for your kind words! We're so glad to be part of the community and provide a healthy option to our area. Look forward to seeing you and your family!"}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "116686335933897416806", "name": "Megan Hudson", "time": 1591649288033, "rating": 5.0, "text": "hands down the best place to work💛 (and eat! can’t go wrong with anything!)", "pics": null, "resp": null, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "107326683007375797125", "name": "Troy Gigis", "time": 1581012770291, "rating": 5.0, "text": "My family and I are so happy that you all are open. Your staff made a big difference in my experience. Everyone was so eager to help and kind. We love the cold press juices and your smoothies are excellent. We will keep coming back.", "pics": null, "resp": {"time": 1581458072262, "text": "Hey Troy, Thanks so much for coming in! So glad our team made you feel welcome, they are awesome. Hope to see you again soon."}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "107487898259513091983", "name": "Alisa Poole", "time": 1622925609696, "rating": 5.0, "text": "Love love love your food and juices!!!", "pics": null, "resp": {"time": 1613587869363, "text": "Thanks Alisa! Glad you like it."}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "118077609034305487400", "name": "Nicholas Gregory", "time": 1591132260059, "rating": 5.0, "text": "Wow what a staff! First time here, walked me through everything and gave recommendations. The owner of this location is very lucky to have this level of employees.", "pics": null, "resp": null, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "115133192485965103414", "name": "Marissa Miller", "time": 1590526105072, "rating": 1.0, "text": "Had been a few times before the pandemic and the manager always was able to help me and describe why certain things are good for me and helped me greatly with learning what to put into my body. He always made good conversation and made me feel important and like they cared about my health. I came back the other day after learning they reopened and had a horrible experience. I asked about nutritional benefits and differences in proteins and they just tried to hand me a nutritional pamphlet and could not answer any specific questions about their products . I asked to speak to the man I normally spoke to and that he was the manager and I couldn’t remember his name.I was informed he was fired and I was talking to one of the managers who took his place. She was maybe 15-17 which makes no sense to me. She had no clue what she was talking about with regards to their menu and did not really help me at all and seemed angry that I was asking so many questions. After I finally ordered she left for another employee to make my smoothie and even the employee joked and  said don’t worry we miss our manager too! I laughed but was also semi shocked by that. I Was a regular now I will not be back.", "pics": null, "resp": {"time": 1590531158583, "text": "Hey Marissa, we are so sorry you didn't have a good experience. While we strive to always be able to answer the questions our guests need, many times our team may have to reference a guide book to give the proper answer. I believe we are all a little rusty as we navigate opening back up after all the craziness hit. Our goal is to always be learning. Again, we are sorry you had a negative experience and we do hope to see you back in in the future. If you do decide to come back in (which we hope you do), your next one will be on us."}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "101302456176917470120", "name": "Brad Louis", "time": 1592280538083, "rating": 1.0, "text": "This place has gone way downhill since they reopened. It was great when they first opened always had good service, so I don’t know what happened maybe they changed management.", "pics": null, "resp": null, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "115389579124709070946", "name": "Alda Her", "time": 1614892391153, "rating": 5.0, "text": "I love this place ❤️🥰 they have wonderful juices, smoothies and salads!! Always the friendliest service and delicious, healthy food choices. My goal is to try EVERYTHING on the menu 😂", "pics": null, "resp": {"time": 1582300887569, "text": "Hello Alda, Thanks so much for the kind words and feedback. If you need some help choosing what to try next, let us know. We're happy to help."}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "118016374855692633826", "name": "Erika VM", "time": 1593356044327, "rating": 1.0, "text": "Im very disappointed. I’m in 50s and trying so hard to stay healthy and keep my mask on in public. Where I live in AL, today we had the highest COVID spike on record. None of your three servers had masks and looked oblivious to my question (polite) why they didn’t. We are in the middle of a pandemic. I stated this concern on their ig and they blocked me. As they say below, posting on their ig concerns is not in their opinion acceptable. As any business knows,  social media is where people can comment positive or negative concerns. If companies delete anything that is not glowing it shows a refusal to truly address customer concerns. Why not publicly state your official policies. Any successful co will allow feedback —good or bad— so long as it’s not vulgar.  This refusal to care about customers health,  and then to not reply reasonably to feedback is not acceptable. There is no admission in your reply to me that there is any policy re this public health matter. Im appalled as a franchise that you allow this and I’m quite upset. I was a regular but no more. It appears that teenagers unmasked are calling the shots. If you are in the food industry in AL and watching the news you need to realize that this is unsafe.These unmasked kids have parents and grandparents and can be asymptomatic and pass it on to them, others and your customers. The employee stated “we don’t have to wear them.”  You are now saying they do?? It’s not clear. Did you change your policies yesterday? Was the employee making that up? For a store that prides itself on health, this is the biggest health crisis we have faced as a country in many many years.\nThis was the Greystone store in AL .", "pics": null, "resp": {"time": 1593302575253, "text": "Hello Erika, Thank you so much for your feedback. I'm sure you're aware that an Instagram post about our new app isn't the best place to give feedback about masks. Thats why the comments were deleted. Thank you for bringing your feedback here. Our staff has been wearing masks for most of the time since we've reopened and we will continue to wear masks as long as people are concerned over this matter."}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "111564352634329685295", "name": "Leslie Dollar", "time": 1580839752763, "rating": 5.0, "text": "LOVE LOVE LOVE THIS PLACE! Everything is fresh and delicious, very high quality ingredients.  Staff is super helpful and nice.  Fabulous addition to Greystone area.", "pics": null, "resp": {"time": 1581457982734, "text": "Hey Leslie, Thanks so much for your awesome feedback! We're super happy you came in and hope to see you again real soon."}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "118234171203143903109", "name": "Leah Velasco", "time": 1591726441603, "rating": 5.0, "text": "AHHH there was a problem with my money and basically they were so nice and reassuring 😭😭😭😭😭 sweetest thing ever omg", "pics": null, "resp": null, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "108285630732884939233", "name": "Brian Smith", "time": 1583626086542, "rating": 5.0, "text": "Jeremiah, Monique, and the team at Clean Juice are committed to building long term relationships with their customers by exceeding expectations and getting to know people. If you are looking to transform your health I recommend that you visit Clean Juice today!", "pics": null, "resp": null, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "112747219507664309284", "name": "William Atchley", "time": 1587654067792, "rating": 5.0, "text": "Everything I've gotten has been great and taste so fresh!", "pics": null, "resp": null, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "104664622814531153915", "name": "Richard Bowman", "time": 1581519680663, "rating": 5.0, "text": "Awesome fresh made juices and salads. Wonderful staff, knowledgeable and friendly.", "pics": null, "resp": {"time": 1581722649664, "text": "Hey Richard, Thanks so much for coming and providing such great feedback! We can't wait to see you again soon."}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "100204834085409313903", "name": "Dr. Jessica All Natural Family Doc", "time": 1591490133460, "rating": 5.0, "text": "Great food, great juices!", "pics": null, "resp": null, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
{"user_id": "111612893179731253086", "name": "Gilberto Bravo Amaya", "time": 1619384567224, "rating": 5.0, "text": "(Translated by Google) Excellent alternative\n\n(Original)\nExcelente alteenativa", "pics": null, "resp": {"time": 1619788316280, "text": "(Translated by Google) Thank you. We appreciate your business.\n\n(Original)\nGracias.  Apreciamos tu negocio."}, "gmap_id": "0x888917cc98825eb3:0x293fc85300493b7d"}
