{"user_id": "103434412057399664610", "name": "Dean Watts", "time": 1520225574124, "rating": 5.0, "text": "Last year we took our 40 year old Oak pedestal table to Fish River Furnishings to upgrade for our Son's new house. Lindsey and Greg stripped the table, dark stained and varnished the top and painted the base and chairs white ...... magnificent restoration job for a new generation.\nRecently, we took in a 50 year old dresser that needed \"modernizing\" and you can see  by the picture they did a great job of upgrading for a Farm style decorating theme.\nWe had a Mahogany top Farm Table built by a local craftsman but Lindsey and Greg were the only ones we would let refinish it. Greg is a master at staining and finishing and Lindsey is an artist at creating that \"distressed\" look that is so popular now. We recommend Fish River Furnishings, without  reservation, for any furniture project where you want a perfect outcome at an affordable price. They are great people to work with!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMCEf6NBA7dLYgta1KJ3Kj12msmaVv4lU2kxIA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNGUhQLZXcqxi2a8dthkuZEA_AUv4gN6mu10GI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN3wzQafGVRBK2rrd6CWMbgiNqVhYqzKhScJoM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPio_aPV017sLXyY2GR6V29w_o-gslYHimrTjo=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a0e0e5a30b529:0xe855a27fcc22c68e"}
{"user_id": "116692455288006902675", "name": "Crystal Rogers", "time": 1577054816209, "rating": 5.0, "text": "They did a great job updating my old table. It was less expensive than buying a new table and just as cute and the tables in the furniture stores.", "pics": null, "resp": null, "gmap_id": "0x889a0e0e5a30b529:0xe855a27fcc22c68e"}
{"user_id": "112409753095213166966", "name": "Sandra Ryll", "time": 1496063328337, "rating": 5.0, "text": "I purchased an old buffet, that had been painted white and distressed. I love it and have it in my living room with a large, flat screen TV, sitting on top of it. I also purchased a headboard, two side tables, and another table for my guest bedroom.  They have a rustic look, with tile inserts, and fit perfectly in the room. Lindsay is so nice to work with and very artistic. I have an oak table and chairs that I would like her to refinish for me. I am a very happy customer.", "pics": null, "resp": null, "gmap_id": "0x889a0e0e5a30b529:0xe855a27fcc22c68e"}
{"user_id": "107317983663779951558", "name": "robert darnell", "time": 1527729993349, "rating": 5.0, "text": "We have bought 2 pieces from here and they painted another for us. They all go perfectly with our house and we really like the quality of their work. They can do some great things with paint too.", "pics": null, "resp": null, "gmap_id": "0x889a0e0e5a30b529:0xe855a27fcc22c68e"}
{"user_id": "102432909784081278587", "name": "Sheila Partin", "time": 1607892745608, "rating": 5.0, "text": "BEAUTIFUL maple table", "pics": null, "resp": null, "gmap_id": "0x889a0e0e5a30b529:0xe855a27fcc22c68e"}
{"user_id": "103167003157943131334", "name": "Lindsey Milam", "time": 1546118114602, "rating": 5.0, "text": "Love this place!!", "pics": null, "resp": null, "gmap_id": "0x889a0e0e5a30b529:0xe855a27fcc22c68e"}
{"user_id": "105984107954854688035", "name": "Scott Mains", "time": 1620079956632, "rating": 5.0, "text": "Wonderful selection of rough cut and live edge wood. Definitely worth your time to wander through. Super friendly staff!", "pics": null, "resp": null, "gmap_id": "0x88891a510d5afed5:0xb77ff9874b705f13"}
{"user_id": "105523044524638294643", "name": "Pinson Patriot", "time": 1600112513798, "rating": 5.0, "text": "Supper nice and very unique furniture.", "pics": null, "resp": null, "gmap_id": "0x88891a510d5afed5:0xb77ff9874b705f13"}
{"user_id": "114442061198995321253", "name": "David McMahon", "time": 1532965158385, "rating": 5.0, "text": "I purchased a beautiful desk from Alabama Sawyer and I love it. It's extraordinarily well-designed and constructed, and I will have it for years. Excellent communication with the company as well. Thanks!", "pics": null, "resp": null, "gmap_id": "0x88891a510d5afed5:0xb77ff9874b705f13"}
{"user_id": "102363230634334681981", "name": "Stephen Hicks", "time": 1549829220953, "rating": 5.0, "text": "Innovative design sold me on the Sputnik side table.", "pics": null, "resp": null, "gmap_id": "0x88891a510d5afed5:0xb77ff9874b705f13"}
{"user_id": "107973066021504228821", "name": "Joanna Jones", "time": 1505936146200, "rating": 3.0, "text": "I would give it 5 stars but it was still closed from the fire they had in March so I couldn't shop. There was lots of stuff I would like to purchase if they reopen. It would be nice if owner would post that they were closed from fire as we came from Florida.", "pics": null, "resp": null, "gmap_id": "0x8888de28403f2045:0xada7b71477cb7e8c"}
{"user_id": "109191003379761859793", "name": "Justin Rodgers", "time": 1470876129167, "rating": 1.0, "text": "Despite having good stuff; my mother, brother and I were chased out by one of the managers with a really foul attitude.  (full story and quotes on facebook)\n\nMy mother got us excited to drive TWO HOURS to see this place but when we got there, one of the managers singled me and my brother out separately asking \"Are you going to buy anything?\" as well as some other angry, uncalled for aggression.  When we said \"No sir\" he told us \"you need to leave, right now!\"  We were escorting our mother because it's in a bad part of town!  When my mother came to inquire about something she wanted to purchase this man told her he was with someone (another employee) and couldn't \"deal with her\" and she would just have to wait.  He was very rude and angry with her too.\n\nWe drove two hours so my mother could spend a LOT OF MONEY on things there but we were chased out within 5 minutes!!   We were treated like bums begging for money!  We would not have driven halfway across the state to kick your tires!  The things you said to my family will NOT FLY with me!  Uncalled for and unprofessional!\n\nThere are lots of antique stores closer to our small town, all which treat us like customers not garbage.  We try to buy at least 2 or 3 things whenever we visit.  We will not be coming back here though.", "pics": null, "resp": null, "gmap_id": "0x8888de28403f2045:0xada7b71477cb7e8c"}
{"user_id": "105066214342607505842", "name": "Christine Cole", "time": 1453135179046, "rating": 5.0, "text": "Vintage Station is my new favorite place to find unique, salvaged, re-purposed home decor. It's also overflowing with unique, one-of-a-kind antiques & beautiful custom order furniture. If you can dream it, they can build it! And if you want to build it yourself they have barnwood, salvaged windows & doors, & plenty of odds & ends to help you create your own masterpiece!", "pics": null, "resp": null, "gmap_id": "0x8888de28403f2045:0xada7b71477cb7e8c"}
{"user_id": "117310882189058696825", "name": "Brian Svencer", "time": 1481306690017, "rating": 1.0, "text": "We were very excited about visiting after seeing all the advertising and neat pictures posted. When arriving the owner approached us and apologized for it being disorderly. Another nice gentleman approached us and informed us of all the areas available to be seen. While speaking to both men we informed him of the interest we had in the reclaimed lumber and that we custom make them ourselves back home. He gave us pricing on what he had and told us to check out the shop area and to let him know if we needed help with any lumber. We also refinish furniture for a living and are on the look out for good fixer uppers to refinish and resell. So we walked around the top and bottom floor. They had nothing of good quality to choose from. We then made our way out to the \"OPEN TO THE PUBLIC COME ON IN\" shop area. The craftsmanship done by his employees was great and we were simply admiring the work done. NO PHONE, NO CAMERA simply looking and out of no where the owner comes up to my husband and tells him \"IF YOU ARENT HERE TO BUY YOU NEED TO LEAVE\" \"WE BUILD CUSTOM TABLES FOR CLIENTS\" \"WE ARE A CHRISTIAN BASED COMPANY AND WE DONT NEED ANYONE STEALING OUR DESIGNS\" Now if I was taking pictures of this mans work I could understand his hostility but we weren't we were simply browsing his shop, custom tables, painted furniture and doors as we were told to do. Then he approaches me and tells me if I'm not here to buy anything from him to leave right now and never come back. He turns back around to my husband who was holding our 1 year old in his arms and leans in like he is about to grab him and yells to my husband to walk faster and to get out. While this place looks great in pictures it is not what they display online. How this man stays in business talking to customers the way he does is unreal to me. Christian business?!? You are a hotheaded joke. I have browsed the other reviews and this is not the first time or the last that this man has ran out good paying customers.", "pics": null, "resp": null, "gmap_id": "0x8888de28403f2045:0xada7b71477cb7e8c"}
{"user_id": "104440869189676926780", "name": "Campbell Dunbar", "time": 1469918016889, "rating": 1.0, "text": "Their work is beautiful, but when we have spent hours going through hundreds of doors during an Alabama summer heat wave to find a few matching pairs and the owner couldn't even spend 3 minutes with us discussing what might be a fair price for all of it I knew we wouldn't be back. We were told to let them know when we were ready and the owner would come out and talk to us about prices. When he did he was very rude, inconsiderate, and his pricing system made no sense. He wanted $75 per door on every door we had, even though some were in much worse shape than others. We came prepared to spend a pretty penny and ended up spending a fraction of that because of his attitude. We won't be back. The drive out there is not worth the hassle and we do not recommend that anyone else waste their time either.", "pics": null, "resp": null, "gmap_id": "0x8888de28403f2045:0xada7b71477cb7e8c"}
{"user_id": "115042198788597891512", "name": "Diane Cann Pigott", "time": 1502347443780, "rating": 5.0, "text": "I was out there on Sunday and they were closed, but from what I could see it was amazing", "pics": null, "resp": null, "gmap_id": "0x8888de28403f2045:0xada7b71477cb7e8c"}
{"user_id": "106383260270345132395", "name": "Billy", "time": 1461626409712, "rating": 5.0, "text": "Great place to fine old stuff.", "pics": null, "resp": null, "gmap_id": "0x8888de28403f2045:0xada7b71477cb7e8c"}
