{"user_id": "117931878238326833770", "name": "Garrett Pearson", "time": 1594859673100, "rating": 5.0, "text": "Timely and professional. All issues faced were resolved. Would recommend to anyone needing a quality air conditioner and wanting to conduct business with honest, diligent people.", "pics": null, "resp": null, "gmap_id": "0x888602e36b1dbe2d:0x44ff8ba0f66be266"}
{"user_id": "109796914793756814413", "name": "Chuck Brand", "time": 1578774140270, "rating": 5.0, "text": "We have used them for years to work with a large house on campus and found Hughes & Mullenix to be a great partner. The few times we have had someone try and call a competitor, we have found the quotes/costs to be considerably more, work less professional, and even had another company say a unit needed replaced and would take a week to get the new air conditioning unit. When I found out they had called another company, I had the person call Hughes & Mullenix who was able to fix the issue in one visit for the cost of parts and a service call. I would not use anyone else in Tuscaloosa!", "pics": null, "resp": null, "gmap_id": "0x888602e36b1dbe2d:0x44ff8ba0f66be266"}
{"user_id": "103433969427842530486", "name": "Walt Park", "time": 1586178425229, "rating": 5.0, "text": "Great job ,very helpful staff, professional service and highly recommend", "pics": null, "resp": null, "gmap_id": "0x888602e36b1dbe2d:0x44ff8ba0f66be266"}
{"user_id": "109441664349491693331", "name": "Tammy Watkins", "time": 1477498396197, "rating": 5.0, "text": "Awesome service always!", "pics": null, "resp": null, "gmap_id": "0x888602e36b1dbe2d:0x44ff8ba0f66be266"}
{"user_id": "111830335915210966094", "name": "Mary McKinnon", "time": 1615413665430, "rating": 5.0, "text": "The entire staff has been helpful and professional! Thank you Gary, Carla and Katie for your information and guidance. Gary went out of his way to accommodate our crazy schedule. He is so knowledgeable.\nMason, Jaq and Clay arrived on time, they were professional and informative. The work was done in a timely manner, very neat and clean with attention to detail. When they were done, there was not a spec of anything left. Thank you for a job so well done!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "105230352555970076559", "name": "Katie Willis", "time": 1615214598055, "rating": 5.0, "text": "I have been using Total Comfort for about 3 years. They have always exceeded my expectations. I highly recommend this company for your heating and air needs.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "101848659199817744753", "name": "M Tyree Wilson", "time": 1615245718678, "rating": 5.0, "text": "From the initial PHONE CALL TO THE FINAL \"FIST BUMP\" AFTER THE INSTALL....We knew we made the right decision going with this company...The rep we set up the appointment with....EXCELLENT...The guy(Gary) that came out to do the estimate....EXCELLENT and HONEST ....The guys who performed the Install....you guessed it EXCELLENT !!!!!!  My family and I are very pleased with everything that was presented and performed....couldn't  ask for better service...Total Comfort Heating and Air is the TOTAL PACKAGE of Honesty, Service, and Professionalism ....", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "115900475656183536320", "name": "C Mallory", "time": 1613170718093, "rating": 5.0, "text": "This was my first time using this company, but it definitely will not be my last. I called on a Saturday when my furnace went out, which was actually beyond repair and had to be replaced. They were very polite and courteous and I am well pleased with my new furnace.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "113602914220390636913", "name": "kristy templeton", "time": 1619822066833, "rating": 5.0, "text": "Great place. Harry is the best", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "116000666929995139166", "name": "Sylvia N.", "time": 1594749016827, "rating": 5.0, "text": "Total Comfort Heating and Air is an excellent company, fully committed in delivering the absolute best service to its customer base.  The HVAC technicians are highly knowledgeable and very professional.  They  efficiently get your home back to the right temperature at a reasonable cost.  Chelsea, in the office, schedules appointments with the lowest wait time.  Harry, the service manager, is responsive to individual customer's needs and intends to exceed their expectations.  Big hearts all around with these people!  I wish other companies were this sincere in pleasing the public.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "104536524850114481739", "name": "Ambera Law", "time": 1597178162181, "rating": 5.0, "text": "Total Comfort Heating & Air, they came out Saturday my system had frozen-up, water was leaking into the room below. .I was told me what to do over the week-end, they said they would return on Monday.\nThey came that Monday morning and did everything they said I needed and extra work to get my system up and working in a timely manner.  Total Comfort Heatimg & Air is a great company.  They stand on you word Thank God for a company like theirs.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "102979794026874090819", "name": "Mrs Johnson", "time": 1585792019656, "rating": 5.0, "text": "I have to say that the one person I spoke with was very polite and professional. I called their office and Mrs. Danielle pick up with a very polite and professional voice. I have several questions and she didn’t hesitate to answer any of them. I could tell she was very busy as she did have to ask me to be put on hold a few times,( which wasn’t a problem)  but each time she came back she would always apologize and make sure she helped me in any way she could. With everything going on in our world this is someone you would enjoy talking too. This to me is how you would want your fore front of your business to be. I will have no problem recommending this company or recommending Danielle to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "107878549000939758028", "name": "Taylor Stinson", "time": 1584115066649, "rating": 5.0, "text": "Landon and Justin who did our install were awesome. Really professional and knowledgeable about what they were doing. Cleaned up their area after finishing.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "102574868619350222877", "name": "Kekke Young", "time": 1591137434330, "rating": 5.0, "text": "Brett was our technician. He was very knowledgeable and efficient. He answered all of our questions.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "103872905813969068339", "name": "Kamren P", "time": 1557589403567, "rating": 5.0, "text": "I would definitely recommend this company . I called on Sat morning around 5am & someone was able to come out around 9am I only had to pay $50 for them to come out , which was awesome considering that it's the weekend . Some other companies charge a much higher fee to come out on a Sat . My technician was Tyler . He was excellent! As a woman , he made me feel very comfortable. He explained the situation clearly and informed me of my options . I didn't feel pressured , swindled , or hustled like I have by a technician from another company . He was very honest . I will definitely call them in the future .", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "106727059176347965656", "name": "Alphonso Hicks", "time": 1551189322864, "rating": 5.0, "text": "My system was installed in 2014 by TC. I wasn’t impressed with the old owners, and the way they did business. The new owners are great and the Technicians are so much better than what we’ve seen in the past. Eddie did the maintenance recently and did a great job. Found some issues from the initial install and took care of them at no cost to us. Really appreciate the new owners and staff.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "116485098488885127631", "name": "Helen Nuelle", "time": 1587057457544, "rating": 5.0, "text": "My air conditioning was not functioning and the company came in checked it out  and made recommendations to correct the problem. Our new system is efficient and it was installed quickly.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "104628025315581346224", "name": "Earl Cambron", "time": 1587401676049, "rating": 5.0, "text": "Great experience working with Fisher. Would highly recommend Fisher and Total Comfort!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "109325264806551925344", "name": "Jackie Jones", "time": 1529522455313, "rating": 5.0, "text": "Thank heavens Total Comfort Hearing & Air is under new ownership! In June 2017 we replaced our old units with two American Standard ac & heating units under the previous owner and the installers were awful.  We had small gas leaks on both units, insulation around the refrigerant lines was half ass done on the downstairs unit and not even replaced on the upstairs which was dried & cracking, etc.  When I called to have the has gas smell checked out the new owners were eager to get someone sent out immediately. The smell was intermittent so I wasn't sure if there was an issue. The first time Sonny came out & took care of the downstairs gas smell.  A few hours after he left the air purifier wasn't working.  Eddie came to our house and fixed and also noticed the \"dryer\" was installed backwards on the both units. He corrected both problems in addition to gas smell upstairs, & addressed the insulation on the refrigerant lines.  Eddie was wonderful! We so appreciate the time he has spent to address the install issues. My husband owns a construction company and we've dealt with several HVAC companies for our home & business....hands down we are so impressed with the service Total Comfort provides.  The ladies in the office are the first impression of the company and they are awesome! Total Comfort will continue to receive our business due to the great service & and friendly demeanor of their employees!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "118001758079029050263", "name": "Ethan Jones", "time": 1553607042226, "rating": 5.0, "text": "Eddie came out to my parents place yesterday. I really appreciate the time he took taking care of their needs and he was very polite and professional. We had some less than happy experiences with this company before the new owners took over, but it looks like they have really turned things around for the better.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "101400546013438362341", "name": "Scott Williams", "time": 1534629838385, "rating": 5.0, "text": "Total Comfort came out this afternoon.  The technician was Harry. He was very polite and informative. We are getting a new furnace installed on Monday. I would highly recommend Total Comfort to anyone. Thank you so much!! Scott Williams", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "118330282769401667746", "name": "Anne Vicknair", "time": 1555466308463, "rating": 5.0, "text": "After the last service my AC unit wasn’t cooling properly. Called TotalComfort and Eddie came out on a weekend and found the problem and easily corrected it at no charge. Not many companies will stand behind their work like that anymore. Really appreciate the kind and prompt service.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "105028752500394995333", "name": "Sandra Reaves", "time": 1532233096995, "rating": 5.0, "text": "Gary was very prompt, professional, and efficient.  We really appreciated his courtesy. He quickly got our air conditioner up and running.  In this hot weather, that makes him a super hero to us!!  Thank you so very much!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "101710032665019373847", "name": "Jason Lane Garrison", "time": 1510971242917, "rating": 5.0, "text": "If you’re looking for a company that’s reliable, professional and do honest work look no more.  I heard Total Comfort Heating was under new management so I was reluctant to call them but did they change my mind when I used them.  Quick to respond, professional and spent the time explaining what was going on with my unit. I’ll definitely use them again.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "114206161975537438313", "name": "Danny Brown", "time": 1519237999196, "rating": 5.0, "text": "My a/c was not operating correctly so I placed a call to One Source Heating and Cooling and asked for a service man to visit and find the problem.The ladies in the office were very nice and professional and arranged for him to come and access the situation. Sonny   ( the serviceman) arrived right on time and quickly found the problem and had me going in about 10 minutes. He was very professional as well and I certainly will be calling them again for all of my heating and cooling needs. They are the best company for their honesty, punctuality, dependability, professionalism and affordability. I'm so grateful to have them.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "101362591013178345061", "name": "John Casada", "time": 1556802931639, "rating": 5.0, "text": "We have two HVAC systems. Total Comfort replaced our first system two years ago. Our second started acting up and we called Total Comfort again.\nHarry was quick to come out, located the problems with our system and patiently explained what was wrong. He then discussed all of our options for repairing vs replacing. Unfortunately, we had to replace our 26 year old Trane system. Harry really helped us with this bad news and discussed financing options.  I hate that we have to go through this, but I am so glad that Harry was by our side. Top notch customer service with highly skilled, clean, courteous, can-do technicians. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "105835728998287136613", "name": "Carolyn Nelson", "time": 1551885111533, "rating": 5.0, "text": "I’ve dealt with Total Comfort many times from maintenance to repairs and I’ve always been satisfied by their service. Eddy has been out to help us before and always seems to go that extra length to take care of our needs. We really appreciate everyone.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "118194960290129854652", "name": "FLYBY", "time": 1562763726122, "rating": 1.0, "text": "Had tech arrive, a young and inexperienced boy, explained the issues with the units, the tech did visual inspection only, never hooked up gauges, stated system is working fine. I realized the system was not working, I called 4 times, no one returned my calls, was not allowed to speak to the Manager, Jody, and was told it would be additional charge to come back. Be careful.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "111687842287640898590", "name": "Cheryl Whitley", "time": 1532395636917, "rating": 5.0, "text": "Sonny, the worker that came to help me on my AC today was a very polite, kind, and thoughtful person who took his time to explain everything that he did and why. There aren’t a lot of people who do that and I appreciate that! Thanks Sonny! Thanks Total Comfort for having a worker like Sonny!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "105889394043193967911", "name": "Sonya Smith", "time": 1550582580758, "rating": 5.0, "text": "Great experience from start to finish. I talked to Chelsea in the office and she sent Eddie out to service my Furnace the same day. Very friendly and knowledgeable company.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "115687673064575666981", "name": "Robert Blackwell", "time": 1557190486154, "rating": 5.0, "text": "Love the new owners and their Service Technicians! Eddie took care of everything we needed and got our AC running the same night. Vast improvements in service since the new owners took over.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "118159392435891181927", "name": "Jason Lassiter", "time": 1529373559663, "rating": 4.0, "text": "Amending my original review: after an initial failure to properly schedule my appointment (see original review below) Total Comfort called the next business day to apologize and to make things right. They offered to send a technician right away and offered to waive the service call fee to make up for the inconvenience. I really appreciated this. Anyone who accepts responsibility for a mistake and makes a good faith effort to fix things gets a second chance with me. The technician, who was nice and professional, quickly found and fixed the issue (a simple clog). Before he left we got a call from the owner who explained that there would be no charge for the service. All in all Total Comfort really turned things around and they will get my future business.\n\nOriginal Review: I made an appointment. They did not call and did not show. Can't recommend.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "111758707200190541917", "name": "Rick Whited II", "time": 1580313114927, "rating": 5.0, "text": "Everyone I got to work with was extremely polite, knowledgeable and very professional.", "pics": null, "resp": {"time": 1580329942203, "text": "Thanks for the kind words.  We look forward to working with you in the future.\n\nThanks,\n\nKeith"}, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "110398914181633228044", "name": "Alantha Russ", "time": 1549492111308, "rating": 5.0, "text": "Nothing but good things to say about this company. Eddie came out today for the normal maintenance and did a great job as usual. We really appreciate the time Total Comfort puts in to making sure a job is done right.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "113603250434133094661", "name": "Sam Henderson", "time": 1513193940984, "rating": 5.0, "text": "Total Comfort came to our rescue!  This winter Charter/ Spectrum caused an electricity surge at my house starting and electrical fire, frying my HVAC system and frying the motor on a refrigerator and freezer. Total Comfort saved us before it got to cold by coming out and quoting us a fair cost and then doing the repairs quickly and with quality work. I know I will continue to use them!  Great people. Great Service. As for Charter, not so much.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "113077802862354290261", "name": "Kaz McFly", "time": 1507757543506, "rating": 5.0, "text": "I thought I needed to replace my AC but Harry with Total Comfort came out and spotted the problem and fixed it. He could have gotten me to buy a new unit but didn't. Instead he allowed me to take my time and not make a rush decision by fixing the problem. I highly recommend Total Comfort. Honest, nice and fast service", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "112054683527952441907", "name": "Frankie Roe", "time": 1537298221732, "rating": 5.0, "text": "We had a great experience with Total Comfort Heating and Air. Our heat had stopped working suddenly.  When I called the office to make the appt., the lady I spoke with was helpful and courteous. Gary came out, was very nice, and within a few minutes, our heat was up and running again.  Would highly recommend these folks!!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "115796135556230078853", "name": "Dennis Bryant", "time": 1514481432964, "rating": 5.0, "text": "I bought a unit from this Company 10 years ago and it was an awful experience. To much to list. The unit went down this winter and i called to check on warranty information on the unit. Now this unit was purchased for my parents house and both are disabled. With that said my guard was up. As i placed the call i found that Total Comfort is under new management. Expecting the worst. Boy was i wrong. The new management and ownership at Total Comfort was a huge breathe of fresh air. The team at Total Comfort was honest and up front with me from the start. They offered about as much help to me as they could. The Technician named Soni that worked on my parents unit went above and beyond to take care of my parents. If you had a bad experience in the past then believe me its a new day with this Company. I personally want to say thank you to the team at Total Comfort for bending over backwards to give me any and every option they could. From an angry customer years ago to a customer that will only call the new team at Total for anything me or my family members need. Thank you Total for all your help.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "108884958831092340560", "name": "Belinda Allen", "time": 1552480240874, "rating": 5.0, "text": "Great company. Eddie came and installed a part I needed yesterday. Very polite and friendly.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "106462243790824611238", "name": "J Davis", "time": 1538263104192, "rating": 5.0, "text": "Can’t say enough good things about this company! Gary came out on a Saturday after 6 to fix our air out at Logan Martin. When I say that we were suffering, we were absolutely miserable in this house! It took him less than 10 minutes to fix the issue and cooled down a house full of women who came home after a Pell City mud run to an 87 degree house. Highly recommend Gary and Total Comfort heat and air!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "104227104911921229158", "name": "Keely O'Really", "time": 1507751195336, "rating": 5.0, "text": "Very honest and quick to diagnose our problems. We had 2 other companies come out and tell us 2 different things are wrong with our A/C unit only to find out by the Total Comfort tech that that was not the problem and even got our AC running for the time being until we could get it fix. Great service, came on time, and very polite and knowledgable. I recommend them to anyone who is in need of AC repair.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "107249620089509103405", "name": "Margret Battle", "time": 1549895264326, "rating": 5.0, "text": "Eddie came out last week to clean our package unit and thankfully caught some small issues before they caused major problems. He gave us a good price for repairs and helped us get financed quickly. Thanks TC", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "114823251808715907424", "name": "Diane Cook", "time": 1509717313129, "rating": 5.0, "text": "Absolutely wonderful experience. I had a total HVAC replacement plus blown in insulation. All technicians were on time, clean, courteous and completely professional. I will give them an A+ for a great job done.\nDiane Cook", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "110252571747897345439", "name": "Kendall Jackson", "time": 1508345789095, "rating": 5.0, "text": "Great experience.  Excellent new management and fair pricing!  Prompt service response.  Would recommend", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "118343884316507232162", "name": "Jason Smith", "time": 1528981857280, "rating": 5.0, "text": "Just had our whole system replaced, and the guys at Total Comfort did a great job. Gary kept in touch with his whereabouts and time frame for the initial service call, and got the broken down system patched up long enough to get the new system in the following morning . The guys showed up with all the equipment before 8am and went straight to work after a friendly meet and greet with our dogs, who love company . They were both friendly and efficient, cleaned up after themselves, finished well before the estimated time frame, and did it all for a price that was on the low side of what we expected to pay . I would recommend these guys for any heating and cooling needs.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "112638120573018748044", "name": "Carrie Cotney", "time": 1508346185774, "rating": 5.0, "text": "Great experience! The service technician was polite and worked efficiently to solve our issue.  The new owners have done a great job!  I highly recommend Total Comfort Heating and Air.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "109162170761426275872", "name": "Paige Cooper", "time": 1550624401049, "rating": 5.0, "text": "I would recommend DJ for any services needed. He is friendly, courteous, and he cares about his customers.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "102310971247175371358", "name": "Dustin Wilkerson", "time": 1506025147764, "rating": 5.0, "text": "Excellent company to do business with. I highly recommend giving these guys a chance if you are in need of any HVAC work. It is my understanding they are under new ownership and are eager to ensure all of their customers are happy. They have definitely earned future business and recommendations from me.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "103497448177506047009", "name": "Cal Markert", "time": 1538674854411, "rating": 5.0, "text": "Saved me money with honest access net and only charged 50 for service call.  They knew what they were doing too.  Very pleased", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "107910909164138694394", "name": "Byron Williams", "time": 1506026540983, "rating": 5.0, "text": "Thanks to Total Comfort for getting use up and running again. We appreciate the quick service and professional staff that came out to service our HVAC. After the tech explained everything I could readily see the problem and felt very comfortable going ahead with the repair. They where very professional.  We are very impressed.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "102483469473439742896", "name": "Nathan Whitaker", "time": 1532552171251, "rating": 5.0, "text": "We are attempting to sell our house and had an issue arise during inspection. Eddie had serviced the unit 2 weeks earlier and everything was in working order. We explained the issue about how we were held up with being able to close because of the inspection. Total Comfort went above and beyond and immediately came to ensure things were ok. Turns out that the inspector was wrong. The unit was working correctly. I video taped it to show the buyers the problem was not Total Comfort. It was their inspector. We have used Totsl Comfort for years and plan to have them install and new unit at our new home later. Eddie is the man!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "102833975545215774331", "name": "debby cochran", "time": 1553105007759, "rating": 5.0, "text": "Brett Shelton,  my service professional, was very nice and knowledgeable.I find they seem to care a lot about the customers.I would totally recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "113669696991990263790", "name": "Holly Chapman", "time": 1508343894168, "rating": 5.0, "text": "Thankful for the New Management for quickly repairing my unit. Professional, on time, and trust worthy. I would choose Total Comfort again and again and you should too!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "105687209365744763140", "name": "Joe Randall", "time": 1556223222904, "rating": 5.0, "text": "Cody was honest and efficient and took care of my problem. Will definitely call again.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "106416963101575470417", "name": "Terry Payton", "time": 1508431827168, "rating": 5.0, "text": "Glad they have new owners.  The new ones are terrific!   Took great care of us fast and very fair price.  Thanks again!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "116135530854596815490", "name": "Stan Paschenko", "time": 1522974279970, "rating": 5.0, "text": "Total Comfort has serviced my Hvac units for the past 3 years. I recommend this company because of their honesty and integrity. No pushy sales pitch.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "114502952986045655299", "name": "Kelsey", "time": 1533700039707, "rating": 2.0, "text": "I had an emergency call after coming home to an 86 degree house. There's technician was extremely friendly but no resolution was provided. Ther problem he said I had wasn't the problem at all. I missed an entire day of work to be told mid morning the next day noon one could come until afternoon. I could've gone to work in AC for the morning! Very disappointed in the level of service provided.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "103574179415098269771", "name": "Valerie Chavez", "time": 1561393530904, "rating": 5.0, "text": "Just  had total comfort heating and air come to my home and they just installed this new thermostat I could not be more pleased with their work friendly service and the price was just right.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "100014806508020778347", "name": "JP Jones", "time": 1548457707626, "rating": 5.0, "text": "David was very good at  doing his job and knowledgeable. Great personality", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "104193186063811139641", "name": "Christy Thomas", "time": 1508334800286, "rating": 5.0, "text": "New owners and management are fantastic!  Good quality customer service!  Very pleased with the work and it was completed in a timely manner.  Would definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "103154610428773387605", "name": "Mike Gillespie", "time": 1521748306276, "rating": 5.0, "text": "Very nice on the phone. Called to let us know the technician was on the way. Technician could not have been more helpful or professional with his explanations and wanting things to be done correctly! Would recommend them to anyone!!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "112066480998554444700", "name": "Tracie Lewis", "time": 1532988245046, "rating": 5.0, "text": "The tech was very courteous and professional. He and the company went above and beyond. Would highly recommend Total Comfort!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "111504365738794162592", "name": "Jimmy Owen", "time": 1533911415015, "rating": 5.0, "text": "Setting the appointment was easy and the agent worked very well to set the appointment which was convenient for me.\nThe technician was great and explained everything very well.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "100014806508020778347", "name": "JP Jones", "time": 1548457707626, "rating": 5.0, "text": "David was very good at  doing his job and knowledgeable. Great personality", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "113929257680473715714", "name": "Blakely Segroves", "time": 1508335157948, "rating": 5.0, "text": "We were so impressed with the new owners!  Prompt and reliable service to repair my unit.  Would highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "104838347680161208878", "name": "Kandy Kane", "time": 1517325623821, "rating": 5.0, "text": "Eddie was fantastic!!! Very professional and quick at fixing our problem.\nWe will only be using this company from now on! If you have any problems with your heating or air, definitely give Total Comfort a call!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "104485638669930952455", "name": "Julian Kit", "time": 1452403280399, "rating": 2.0, "text": "Called them out after our unit stopped working. The guy who came out only saw $$$, down played our system every chance he could. Said its to small for the house (our house is fairly small and it's always keep us plenty warm). Told us our system had rust which was causing the problem but got it working by taking a piece of wire and cleaning out the sensor. Took less than 2 min to get the system working but cost almost 100$ for next to no work. 18 point inspection is also a lie.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "116069628066331434626", "name": "Linda Fomby", "time": 1561432782056, "rating": 5.0, "text": "Tyler arrived in a timely manner and solved my problem. Very efficient.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "108609118647522269436", "name": "Betty Gunter", "time": 1554209183188, "rating": 5.0, "text": "Eddie was at our home yesterday and he’s such a sweetheart. We felt a little silly when he told us why our furnace wasn’t working but we’ll know what to look for next time. Thanks!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "109250979916779043766", "name": "Rod Bunn Florida", "time": 1551237401995, "rating": 5.0, "text": "Dj was courteous and knowledgeable and did a great job, I would recommend him to everyone I know", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "117897145988813417931", "name": "Joanne Walker", "time": 1518805959381, "rating": 5.0, "text": "Great Service starting with the operator who took my request for a service call, to the technician who came. Thank you Sonny for being on time, courteous, polite and your very thorough checkup of our heat and air system.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "117234910230057958256", "name": "Curtis Nargo", "time": 1471549923324, "rating": 1.0, "text": "Total comfort heating and air LLC today August 18, 2016 as I am traveling down for 59 in Hoover I started hearing cracking sounds on my windshield as I got closer to the source while other cars were swerving to get away from this truck that was carrying loose rocks in the back of a small flatbed trailer uncovered and rocks falling all over the highway.  I saw two cars get struck with windshield broken my car was struck twice\nwith star break cracks in windshield, and as ice sped up to get around this total comfort heating and air truck IT LOOK LIKE HE WAS JUST LAUGHING AT ME!  I dialed there number tried to call but they kept hanging up on me stay away from this company if they don't have enough sense to haul gravel in the proper way.Bad reviews on these guys. !!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "109250979916779043766", "name": "Rod Bunn Florida", "time": 1551237401995, "rating": 5.0, "text": "Dj was courteous and knowledgeable and did a great job, I would recommend him to everyone I know", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "117234910230057958256", "name": "Curtis Nargo", "time": 1471549923324, "rating": 1.0, "text": "Total comfort heating and air LLC today August 18, 2016 as I am traveling down for 59 in Hoover I started hearing cracking sounds on my windshield as I got closer to the source while other cars were swerving to get away from this truck that was carrying loose rocks in the back of a small flatbed trailer uncovered and rocks falling all over the highway.  I saw two cars get struck with windshield broken my car was struck twice\nwith star break cracks in windshield, and as ice sped up to get around this total comfort heating and air truck IT LOOK LIKE HE WAS JUST LAUGHING AT ME!  I dialed there number tried to call but they kept hanging up on me stay away from this company if they don't have enough sense to haul gravel in the proper way.Bad reviews on these guys. !!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "100491457408749197288", "name": "James Howlett", "time": 1548079637813, "rating": 5.0, "text": "Eddie came out and took care of our Furnace quickly and gave us a great price for the repair. Will be using this company in the future.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "116877214747386098871", "name": "Vista Brooks", "time": 1511888452106, "rating": 5.0, "text": "Awesome Company!!! New management that still believes in making sure that mistakes that were made before are fixed. Quick service and a great staff!!!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "115805444616248996214", "name": "Lillian Wilson", "time": 1518110606791, "rating": 5.0, "text": "They have always been on time and very polite people.I am so glad we used them for our heating and air :)", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "101664908758993034918", "name": "lori krauss", "time": 1538437990502, "rating": 5.0, "text": "Can not say enough about this company and Gary Dailey.  We noticed our air was not working around 3 pm on a Saturday. We were at our lake house in Talladega. I called four other companies, that said they were 24/7. None would return a call. No one even answered. I called Total Comfort and spoke to Gary. We were almost near heat stroke at this point. He could sense the desperation in my voice. He said let me make a few calls, and if I'm able I'll be on my way. Ten minutes later he called back and said he was on his way. Drove from Gardendale to Talladega to look at our unit and see what could be done. He was a lifesaver. It was the capacitor. He had a new one on his truck, and fixed it within 30 minutes. What normally would have cost a lot, on a Saturday evening was a few hundred bucks or so. I would have given them 10 stars if I could have. WE WILL NEVER USE ANYONE BUT TOTAL COMFORT AGAIN!!! IM not a person that leaves reviews, but I have never seen such amazing customer service EVER.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "115761879127646288402", "name": "Zach Batizy", "time": 1532482949214, "rating": 5.0, "text": "Was quick and efficient. Helped solve the problem really well\n\n-Sheila Batizy", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "104343834658584824161", "name": "Jay Cardwell", "time": 1561571865050, "rating": 5.0, "text": "Harry did an outstanding job and he was very professional", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "113761514497167857297", "name": "Mora Taylor", "time": 1532634527220, "rating": 5.0, "text": "Sonny was very professional and explained the process very well. I would highly recommend Sonny and Total Comfort Heating and Air.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "107714613861743316478", "name": "Terrance Darling", "time": 1535042841384, "rating": 5.0, "text": "Great job!! Knowledgeable technicians!!! Thanks Harry and Sam.\n\nMr. Darling", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "112571339437103197529", "name": "B K Gray", "time": 1479396327597, "rating": 1.0, "text": "Worst experience I ever had. Do not, and I repeat do not use this company. Misleading techs, customer service is terrible. Been trying to get a refund, will not return phone calls. I have a service level agreement, and had to buy a new unit from them(which now I don't believe I needed), and they treat you like crap. Everything is about $$$ to them. I agree with Julian", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "110694646758577205270", "name": "Madison Garner", "time": 1476112690703, "rating": 1.0, "text": "They are very unloyal and misleading to their employees! The owner has very bad anger issues and treats people with the upmost disrespect! I wouldn't dare recommend their services not only because of how he does his employees, but by his general characteristic traits. Also the fact that he only hires \" attractive young women\" ( for office work), is also very disturbing and discriminating. He also doesn't seem to concerned with his customers either. Unless your buying a new unit or signing a service agreement you mean nothing to him.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "103420134858817003549", "name": "Bryan Blackmon", "time": 1419466177952, "rating": 1.0, "text": "Right Now, Christmas Eve 2014 marks less than 6 months with my new system (old one was 20+ years old and died) from this company. The installation re-used some of the parts from the old system. I have had to call them back out now for the third time in less than 6 months to check on the system and while the people are very friendly, I am highly unsatisfied. A unit of this age (when properly installed) should have zero issues cooling a townhome of my size and should (in general) have no problems. It is now Christmas Eve 2014 and all creatures are stirring because the damned-new HVAC Heat Pump will not cool off my home. Thanks.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "115575444048383948735", "name": "Lonnie Moore", "time": 1531766568428, "rating": 5.0, "text": "Technician showed up on time, assessed the problem and quickly fixed it. You can’t ask for more than that.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "108675675785003002378", "name": "Barbie Moore", "time": 1531521363757, "rating": 5.0, "text": "Extremely friendly and fast service 🙂🙂🙂", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "105021074932365765154", "name": "Calvin D Tucker II", "time": 1534471494742, "rating": 5.0, "text": "Service above excellent!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "107203651313049263635", "name": "Jessica Ray", "time": 1517327150208, "rating": 5.0, "text": "Very professional, excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "104649681239390663386", "name": "Soleado C", "time": 1542318335478, "rating": 5.0, "text": "Awesome!!!!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "107730982926432524954", "name": "Joseph Jackson", "time": 1524310797884, "rating": 5.0, "text": "Honest, Experienced, Trustworthy, Timely, and Fair.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "116222252261829068368", "name": "Joycelyn Oden", "time": 1383671868915, "rating": 5.0, "text": "I had a very good experience with this company! I will be using them again!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
