{"user_id": "103621447681056910459", "name": "Joe Harless", "time": 1535460332216, "rating": 5.0, "text": "Great service. Great people. Will use again. Thanks guys for all you did for us. - Joe H.", "pics": null, "resp": null, "gmap_id": "0x88621708d8b5d481:0x26d7168be4302dd0"}
{"user_id": "107888561838757889896", "name": "Heath Ferry", "time": 1527944347344, "rating": 5.0, "text": "Nick did an awesome job of refinishing all of the bathroom vanities in my house. His work is superior, professional, and fast.", "pics": null, "resp": null, "gmap_id": "0x88621708d8b5d481:0x26d7168be4302dd0"}
{"user_id": "113680233572297634341", "name": "Josh Novak", "time": 1538420930985, "rating": 5.0, "text": "Amazing job from start to finish! Highly recommend this company!", "pics": null, "resp": null, "gmap_id": "0x88621708d8b5d481:0x26d7168be4302dd0"}
{"user_id": "106709489047840774248", "name": "Austin Wallace", "time": 1626830170913, "rating": 5.0, "text": "100% recommend! Our dining room table turned out better than we could have imagined! Great quality, reasonable, responsive and kind! All around great work and great to work with! Posted before and after photos!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN6q63_lqKt6PxDXMYhd7tjnkQiQQeesoz37Nc_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPyyfQVP-k1fYoEK0KKGf2Gs6aujthuRHTZGAjA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMgfjMVq4GA8zk6sYt4Uu2sp965R3vGE2Rnja5E=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO2WtqiU1PL-srD1fF6GKr8s9_ahOLNupU8a2_B=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMtThqTTmQhDVXUVY218ydsH6Q0Dm2n87vamL9F=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "110502607011042886276", "name": "Susan Green", "time": 1623871700746, "rating": 5.0, "text": "I had my very loved, very scarred kitchen table, bar stools and kitchen chairs redone by Mr. Moates.  The work he did is incredible.  They are absolutely beautiful and now have a new life for many more family dinners and gatherings.  If this review had 6 stars I would give it to him for the quality of work that he does.", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "117660774345622025765", "name": "Jennifer and Christopher Marquis", "time": 1622496017142, "rating": 5.0, "text": "I had a favorite solid wood buffet and set of chairs that I wanted to co-ordinate with our large round dining table as we are down-sizing our living space. The tops of the chairs and buffet were originally dark brown, almost black lacquer finish that I found very difficult to keep clean most of the time. So I asked Mr. Moates if he could help me out. And boy did he exceed my expectations tenfold! The buffet turned out beautiful, he was able to lighten it to the exact shade of brown that brings out all of the lovely wood grain I had hoped for. Now I have beautiful butcher block style buffet and matching dinette set that my family can enjoy for years to come. Thank you, Mr. Moates!!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "115281326980054339170", "name": "Bethany Rose", "time": 1619719949969, "rating": 5.0, "text": "My table was completely restored to it’s original state thanks to the expertise and handiwork by Mr. Allen. Not only did he restore my coffee table – matching the wood stain and finish with precision – but it the job was completed in less than 24 hours. I could not be more pleased with the outcome!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "110867024114951760739", "name": "walter kelley", "time": 1622385268835, "rating": 5.0, "text": "Mr. Moates repaired a drawer whose wood had been chipped, scuffed, and badly damaged by movers.  He completely restored the drawer's appearance.  He does beautiful work, and we are delighted with the result!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "104765469410353818812", "name": "B 320", "time": 1616608589928, "rating": 5.0, "text": "I called this place as I thought I had distroyed the finish on my Piano. Allen was more helpful than I ever expected, and made several calls to assist. Allen,  Thank You so much for all your help!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "105366284528501236258", "name": "Michael H", "time": 1609343035732, "rating": 5.0, "text": "Found Alan through several others that recommended him to me.  Of all things, I had a brand new bookshelf speaker that fell to the ground after my dog knocked it over.  Had damage on several corners and cracks in the finish.  I had little hope of being repaired to nearly new finish but Alan made several attempts to find the right repair before he did anything to the speaker.  I was amazed at the outcome!!  You now have to really look hard and to know the speaker was damaged.  Alan was very professional, timely, and fair about the price. I highly recommend Alan as he took something he had never repaired and make it look great. You will not be disappointed!!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "103115263807120122417", "name": "Nancy Waggoner", "time": 1602607750808, "rating": 5.0, "text": "Mr. Moates has refinished a number of pieces of furniture for me over the years.  The quality of his work is superior; his finished pieces are flawless and beautiful.  Recently, he refinished a cabinet drawer and matched the color to the rest of the cabinets perfectly.  He is extremely conscientious and the nicest person I have ever known.", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "110274397800284873328", "name": "Debbie Seamans", "time": 1596303773795, "rating": 5.0, "text": "Had antique sideboard refinished.  Needed to match color of my antique table!  Match was perfect - looks beautiful!!  Very satisfied with quality of Allen's workmanship!  Highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "102994415320689600785", "name": "charles mitchell", "time": 1599836214769, "rating": 5.0, "text": "Mr. Allen Moates performs miracles....!!...He is meticulous and detailed in restoring and bringing your furniture back to life....I would give him 6☆☆☆☆☆☆ if I could.", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "110889902521139170915", "name": "Kenalyn Cromwell", "time": 1558834868610, "rating": 5.0, "text": "Mr. Moates is so awesome!  We brought three truckloads of antique and very high end furniture that was damaged in Hurricane Michael.  He did excellent work to restore and repair all that he could, and meet us on the weekend to drop off or pickup repairs.  His cost is very reasonable and the quality is the very best!  He was a blessing to help us save what we could.  You cannot find a better furniture repairman!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "102987746696101252262", "name": "Joe Condoluci", "time": 1601426209247, "rating": 5.0, "text": "Mr. Moates is a true professional refinisher of wood.\nVery customer focused with suggestions and recommendations\n5 stars...definitely!!!!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "104461141229184010729", "name": "Jennie Gillihan", "time": 1614699020938, "rating": 5.0, "text": "We have an antique cradle in our family that is being passed to my niece in NC. It had two broken leg tips and the top was broken off. He came to our home to pick it up, and when it was repaired, he delivered it back to our home!  He did an amazing job, having to hand craft both of the leg tips, and it still looks \"old\". I would recommend Allen with NO reservations for ANY furniture job you may have.  You will not be disappointed!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "106898630351613110976", "name": "Linda Christy", "time": 1562205580292, "rating": 5.0, "text": "I highly recommend Mr. Moates if you are looking to refurbish or restore furniture.  His work is impeccable, and he is prompt.  He will come to your home and give you a price and a plan for what he will do.  He also picks up and delivers.  I can’t say enough good things about Mr. Moates.  I called him recently about some pieces that I thought needed to be repaired.  He is such an honest man that he actually told me he could not take my money and that my furniture was fine just as it was.  You won’t go wrong by using Mr. Moates!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "110718214863067626844", "name": "Shannon Wiebe", "time": 1569251273352, "rating": 5.0, "text": "He refinished an antique for me and it looks incredible! I can't believe the quality and craftsmanship! The finish is flawless!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "106051035319159650907", "name": "Trek Potter", "time": 1551574043408, "rating": 5.0, "text": "Mr. Moates did an incredible job for us. We had 2 antiques chairs and a writing desk that we’ve had laying around for years. Finally around to to refinishing it, but had no idea how good it could look under Mr. Moates care. They came out beautiful. He took the pieces carefully to ensure all cracks and crevices were cleaned of old material before putting back together and staining it. The chairs were very rickety (almost falling apart) and he was able to reinforce it in all the right, unnoticeable places to make them solid again. They literally looked like new pieces of furniture when we got them back. Perfectly sanded and stained. Would definitely recommend to anyone who needs furniture fixed and/or refinished.", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "100038169199947815588", "name": "Deborah Wood", "time": 1564966246955, "rating": 5.0, "text": "I had a small  antique chest of drawers- rather unique in style - and handmade by a great great uncle 120 years ago in New England. I took it from Richmond VA to Prattville to Mr. Moates because I had seen his work on some furniture belonging to my mother -in-law and decided that no one in Richmond would take that kind of time and do that kind of work on a piece valuable only to me.  It had an awful lot of damage - finish was horrible looking with water rings, cigarette burns, cracked wood with nails visible and missing trim to name a few.  I seriously doubted that it could be restored but Mr. Moates took the time to hand make some replacement trim pieces - no easy feat to match hand made carving from a century ago - , repair the damage, strip and restain just the color I requested, and did the most amazing job overall while leaving the character of the piece intact.  It is absolutely beautiful and I am so pleased that I now have a list of pieces to take one by one to Prattville for him to restore. He is a lovely man to work with and a true artisan. You will not go wrong if you chose him to do your refinishing.", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "110752306622719504596", "name": "Tami Meeks", "time": 1564338596388, "rating": 5.0, "text": "He is a master of the trade.  Mr. Moates does beautiful work.  Tami", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "115207611336155878602", "name": "forrest huddleston", "time": 1539380087086, "rating": 5.0, "text": "Did a fantastic job! A real artist! And finished earlier than expected. Very very happy with the results.", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "102828625458877541319", "name": "Carrie Klar", "time": 1500290411571, "rating": 5.0, "text": "Best refinisher in the area. He can really give fresh life to furniture. I like that he always removes the old finish before putting on a new one .", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "103558699229754538168", "name": "Wanderer", "time": 1562771460289, "rating": 5.0, "text": "Excellent service and quality work !", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "106381971056547538850", "name": "Stacey Chrysostom", "time": 1570823898671, "rating": 5.0, "text": "Thank you Moates for your help with Granny’s loveseat.", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "106437904522680558305", "name": "Leona Wilson", "time": 1553193529856, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "110238988314148221135", "name": "James Jeter", "time": 1624626316418, "rating": 5.0, "text": "Repaired a broken dining room chair to almost new condition.  Recommend highly without reservation", "pics": null, "resp": null, "gmap_id": "0x88626becf82eecab:0x7c03a714a3d2b7d5"}
{"user_id": "104304870426856545230", "name": "Thomas Kelley", "time": 1626815424611, "rating": 5.0, "text": "Excellent crafting and repair of family heirloom piano. Honest and personable service. Communicated well throughout the process.", "pics": null, "resp": null, "gmap_id": "0x88626becf82eecab:0x7c03a714a3d2b7d5"}
{"user_id": "110183739041141242471", "name": "GLORIA BISHOP", "time": 1620908855396, "rating": 5.0, "text": "The owner came in to check concerns and completed repairs on spot.", "pics": null, "resp": null, "gmap_id": "0x88626becf82eecab:0x7c03a714a3d2b7d5"}
{"user_id": "107053795339071979332", "name": "Jan H.", "time": 1619303463030, "rating": 4.0, "text": "Lindsay was easy to work with, picked up and delivered my small table on time, and did a flawless repair job on my item. I recommend her for any furniture repair.", "pics": null, "resp": null, "gmap_id": "0x88626becf82eecab:0x7c03a714a3d2b7d5"}
{"user_id": "112929970749388886525", "name": "Bob Reynolds", "time": 1619446496694, "rating": 5.0, "text": "Lindsay showed up at the appointed time and did an excellent job fixing gouges in achest of drawers. Her repair expertly matched the existing wood including the wood grain. I will definitely use Healy's Furniture Repair in the future.", "pics": null, "resp": null, "gmap_id": "0x88626becf82eecab:0x7c03a714a3d2b7d5"}
{"user_id": "106636622510866735434", "name": "Denice Stisher-Howell", "time": 1596163516653, "rating": 5.0, "text": "I have a nightstand which was missing drawer rails and front separator between two drawers.  Lindsay was able to complete a seamless repair and the nightstand looks brand new!  She gave me a fair estimate, picked it up on time and notified me of delivery date and time.  Very punctual both times.  I highly recommend her work.", "pics": null, "resp": null, "gmap_id": "0x88626becf82eecab:0x7c03a714a3d2b7d5"}
{"user_id": "115584974062272416886", "name": "Kevin Wilson", "time": 1596229164630, "rating": 5.0, "text": "Excellent work, reasonable price and prompt service. Lindsay picked up our Windsor back dining room chair and repaired it as promised and quicker than expected. I highly recommend Healy’s and will definitely use them for future repair needs.", "pics": null, "resp": null, "gmap_id": "0x88626becf82eecab:0x7c03a714a3d2b7d5"}
{"user_id": "110747850453881394161", "name": "Ann Romsky", "time": 1614890227068, "rating": 5.0, "text": "Every time I’ve called, Healy’s has come at the appointed time, carefully looked over my antique furniture, provided an estimate, took my furniture and returned it beautifully repaired and at the estimated price. I highly recommend Healy’s!", "pics": null, "resp": null, "gmap_id": "0x88626becf82eecab:0x7c03a714a3d2b7d5"}
{"user_id": "105434051657075101355", "name": "Joye Kralovec", "time": 1592843940507, "rating": 5.0, "text": "I had two pieces of furniture repaired.  They are beautiful!!  I highly recommend Healey's- very professional, careful and skilled!", "pics": null, "resp": null, "gmap_id": "0x88626becf82eecab:0x7c03a714a3d2b7d5"}
{"user_id": "115254832818743415419", "name": "Morgan Sample", "time": 1604684247313, "rating": 1.0, "text": "No stars. Had to touch one for post to be available. I never received a call to schedule for the estimate", "pics": null, "resp": null, "gmap_id": "0x88626becf82eecab:0x7c03a714a3d2b7d5"}
{"user_id": "101325080442096807621", "name": "Sheila Turney", "time": 1592962899389, "rating": 5.0, "text": "I needed a spindle and other parts replaced in my oak chairs.  She did a great job with the replacement and staining the new piece to match the rest of my table and chairs.", "pics": null, "resp": null, "gmap_id": "0x88626becf82eecab:0x7c03a714a3d2b7d5"}
{"user_id": "113531793699653906477", "name": "Derek Rushing", "time": 1579392089770, "rating": 5.0, "text": "Lindsay fixed our bed after our movers took a chunk of wood in the headboard.  Given the extent of the damage, she did an excellent job getting it repaired.  Very professional and arrived at the agreed upon time.", "pics": null, "resp": null, "gmap_id": "0x88626becf82eecab:0x7c03a714a3d2b7d5"}
{"user_id": "109671780258856185954", "name": "Victoria Davis", "time": 1581644139875, "rating": 5.0, "text": "New Life Refinishing renovated two bathroom vanities for me. They arrived when they said they would and kept us informed of when they would be returning. They spent hours sanding the vanities down to the wood, inside and out, then applied the base coat and paint in the color I selected. Even though the refinishing of the bases was done on-site, they did not make a mess or create a lot of dust. Doors and drawers were refinished at their shop. The finished vanities are even nicer than I expected. The pictures below show the cabinets before (white) and after (grey) refinishing. I recommend this company to anyone needing cabinets refinished.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO6vUKshSZ9Xf_5T2SGAvWS3QDe4GB5rOa2oILW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN8PVjBIyMlBgArzCGnKgZtiFgmCTt7j0UP8tZP=w150-h150-k-no-p"]}], "resp": {"time": 1581647854133, "text": "Thanks so much for sharing your experience!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "103775575517672302851", "name": "Amanda Arthur", "time": 1622815682414, "rating": 5.0, "text": "Had our front door refinished and it looks great! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "111930188390055700367", "name": "Sonja Mathis", "time": 1607392507883, "rating": 5.0, "text": "New Life did an excellent job repairing an antique dresser for me. Thankful to Nick for the great work! So glad to have my Grandmother’s dresser back with me in much better condition. I can’t even tell where the repair was! Highly recommend.", "pics": null, "resp": {"time": 1607970528947, "text": "Thanks for the kind words!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "116721569895622904759", "name": "Beth Marshall", "time": 1514069600080, "rating": 5.0, "text": "Rather than purchasing new cabinets for our home, we decided to contact New Life Refinishing to have them painted. They came recommended from a friend. I was worried that the cabinets would look \"painted\" since we were going from a light wood color to grays and blues. I cannot begin to describe how amazing the final product is. Not only is the workmanship exemplary, but the staff is also. They were punctual, easy to work with, an even entertained our high maintenance cat who wanted to be in the center of the work. I would HIGHLY recommend New Life Refinishing!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNCvmg81-YQBg-QB9V2A0YQiux9dG2ZVQ5Bjueu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMy7iAqf3-5k7gHGN5Emxdj68cV4r5KcwMt8ljQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPZlqufm7GrIVlX1hBh7SQ__tkII2QiI6EHFdKL=w150-h150-k-no-p"]}], "resp": {"time": 1514070293863, "text": "Thanks so much for the kind review!! We really enjoyed you guys!!!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "115899078601987623827", "name": "Adam & Avery Tuley", "time": 1595280495521, "rating": 5.0, "text": "We are very impressed with the service provided by New Life Refinishing. They were professional and extremely humble about their expertise. The turn around time was quick and they provide delivery services. Super reasonable price! The quality of the finished table exceeded our expectations. We will forever be grateful to New Life Refinishing for giving our family dining room table a new life!", "pics": null, "resp": {"time": 1595284178857, "text": "Thanks so much for taking the time to share that!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "103541659806857197607", "name": "Jody Charland", "time": 1515341727444, "rating": 5.0, "text": "All I can say is \"WOW\" my wife loves this piece now!  She says it looks exactly like she remembered when she went to her grandmas house when she was a little girl.  I only wish I had some before photos to show you.  Nick took it from a failed restoration(heavy varnish), separated joints, broken drawer floor and so many Knicks , dents and scratches to a beautiful desk again.  My wife thanks you Nick and the rest of your crew.  Not gonna lie, I got some KUDOS for finding a great place to do the work!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO958BoUnw4pbbYZFrWQ5b7BtilzkFBIu7JT85Z=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNRyUpLE_i3G0m_IdGFHyCW4ToHqA_d1F2fQJnq=w150-h150-k-no-p"]}], "resp": {"time": 1515345797621, "text": "Thanks so much for the great feedback!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "114441307446717495370", "name": "Dianne Debter", "time": 1588964679057, "rating": 5.0, "text": "My door is beautiful!!! A contractor, who had previously been to my house came by. He smiled really big and said, “Your door is brand new! Looks great!” He is right my door looks new! What a fantastic job! I am SO pleased! It all went so well!Nick follows through as planned and does quality work!  👏🏻👏🏻👏🏻😄Thank you Nick!😄", "pics": null, "resp": {"time": 1590934432729, "text": "Thanks so much for the kind words!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "112029330417372948398", "name": "Sonya Brasher", "time": 1600886471738, "rating": 5.0, "text": "Our door looks absolutely beautiful!  Nick was very professional and polite. I would highly recommend New Life Refinishing for your next project !!", "pics": null, "resp": {"time": 1600889876885, "text": "Thanks for the kind review!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "102923550155269925354", "name": "Pete Hudson", "time": 1557171128758, "rating": 5.0, "text": "I am thrilled with my \"new\" kitchen table!  I had the table top of my grandmother's dining table refinished, and it is better than I ever remember it being!  I can't remember what type of finish Nick said he used, but he said it is very durable.  And it is SO SMOOTH!  I just want to pet it every time I walk by.  It is beautiful!  I'm looking forward to making new memories with it now!  Also, I had previously re-caned a few of the chairs and needed them to be stained to match the others, and they look perfectly matched!  Very happy customer here!", "pics": null, "resp": {"time": 1557171812085, "text": "Thanks for the great review!  The finish is a 2k Polyurethane"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "113473926746042093007", "name": "Ray Toth", "time": 1594327072212, "rating": 5.0, "text": "Great experience with NLR! From my first contact through completion of the refinishing of our front doors, they were outstanding.  Very professional, friendly, and responsive.  I would absolutely recommend them for your refinishing needs.", "pics": null, "resp": {"time": 1594331287050, "text": "Thanks for your business and the awesome review!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "104859565724622917402", "name": "Kevin Call", "time": 1485268045751, "rating": 5.0, "text": "Our live edge table turned out beautifully. They did an amazing job!! Highly recommend!! You wont be disappointed!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNc7g8RXO8ZEsdHbmZdEiyUe9PPDEMXLC0BfF1e=w150-h150-k-no-p"]}], "resp": {"time": 1485268492641, "text": "Thank you so much for the kind words and for the opportunity to work on your beautiful table. It is one of our favorite pieces we've worked on!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "117276214266290474894", "name": "Jake Glombowski", "time": 1584558730177, "rating": 5.0, "text": "Nick refinished an old dining room table for my wife and I. We inherited table from my wife's grandmother, so it had a lot of sentimental value. The table was made with white pine and has a lot of character and curves. However, it is old and had a lot of wear and tear, so it needed a lot of work. We wanted a somewhat dark gray table to go in our new home, but we were nervous that the white pine dining table couldn't be refinished to match what we wanted and we would have to pay for a brand new table. Nick blew us away with what he was able to do to stain and darken the white pine table. It took him a couple weeks to work on it and us viewing the table's progress. It was well worth the wait, and we love our newly refinished dining room table!", "pics": null, "resp": {"time": 1584563198376, "text": "Thanks so much for the kind words!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "105812188048576300678", "name": "Terry Patterson", "time": 1565093175523, "rating": 5.0, "text": "Nick and the rest of the guys did a fantastic job on refinishing our kitchen cabinets.  They were focused on delivering a perfect job and when the initial sanding did not meet their expectations, they re-sanded every cabinet to make it right.  They communicated well during the entire process.  They also  did a great job cleaning up after the job was completed.  I would highly recommend them for any refinishing job.", "pics": null, "resp": {"time": 1565094501171, "text": "Thanks for the kind review and for your business, we really appreciate it!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "104421237398295525406", "name": "Robert Guzowski", "time": 1565214313129, "rating": 5.0, "text": "Great quality work and craftsmanship.  I would trust them again with a family heirloom.  Great communication during the process, we couldn't have asked for more.  And they pick up and drop off to boot!  You just can't beat that.", "pics": null, "resp": {"time": 1565216058249, "text": "Thanks so much for the kind words!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "116113987368245790305", "name": "Grace Johnson", "time": 1558279668770, "rating": 5.0, "text": "Nick and his team are very professional and great to work with and I would highly recommend them. We recently bought our first home and wanted to change the cabinet color.  The kitchen cabinets were stained a cherry-redish color, and we wanted them to be a darker espresso color. New Life Refinishing took our existing cabinets and re-stained them for a fraction of the price you might pay to reface cabinets. Nick and his team did an excellent job, and our 20 year old cabinets look almost brand new. Nick took one of our doors to try sample colors, and when we didn't like the first color, he started over and tried a different color that we liked. They really want to make sure that you are happy with the product. They taped our entire kitchen off and did a great job ensuring there was no mess. I will be using them again when I want to re-stain my bathroom cabinets.", "pics": null, "resp": {"time": 1558282483343, "text": "Thanks so much for the awesome review, we really appreciate it and your business.  Thanks!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "103582571375410060754", "name": "Philip Panagos", "time": 1583282001094, "rating": 5.0, "text": "NLR did a perfect job removing the finish on a nearly 80 year old mahogany end table, so it's ready for an oil finish.  Will definitely go back to them in the future.", "pics": null, "resp": {"time": 1583285698618, "text": "Thanks so much for the nicer review and your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "107587039039447608905", "name": "Wendy Smythe", "time": 1576517216165, "rating": 5.0, "text": "Great experience. They showed up when expected and did an excellent job.  We are very happy with the work.", "pics": null, "resp": {"time": 1576521304603, "text": "Great to hear, thanks so much for the review!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "110114285322720566742", "name": "WordWashed Wife", "time": 1535751632642, "rating": 5.0, "text": "New Life Refinishing is a first class refinishing company!  They are all artists and the finished work in my house is simply beautiful!  They repainted my cabinets, mantle, front door and refinished a Hutch I'd had for 20 years.  I love it all.  Great group of guys - Drew, NIck, Robert, Will and Luke were all extremely professional.  They showed up when they said they would and delivered the product on the day promised!  Highly recommend this company!  It was a pleasure working with them.", "pics": null, "resp": {"time": 1535752491948, "text": "Thanks so much for the great review and your business, we really appreciate it!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "109162376325544338030", "name": "Cassy Reeves", "time": 1465767767467, "rating": 5.0, "text": "Nick did an excellent job painting our built in bookcase in our living room.  Bookcase was wood colored and he sanded and applied a white lacquer paint.  Great guy to work with and he did a wonderful job.  Job was finished quickly and around our busy schedules.  😊  I had also just painted our walls in that room and I didn't even have to do touch up paint after the project was done.  Awesome job!  Highly recommend!", "pics": null, "resp": {"time": 1465767949974, "text": "Thanks for the kind words Cassy and thank you for your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "106587274757069288614", "name": "Lois Jones", "time": 1505324073894, "rating": 5.0, "text": "I can't remember the last time something/anything exceeded my expectations- this kitchen cabinet makeover has! It is above and beyond what I have always wanted/dreamed of. So thankful that my daughter found Drew and his amazing team (especially Rob- he is just awesome!). They are the most incredibly talented craftsmen. Their attention to even the most minute detail is beyond comprehension. They even take their clean up process to the next level. Absolutely no aspect of this process was neglected. You would expect to pay a premium price for work of this caliber, but the best part, you don't! The price for all of this perfection is extremely fair and beyond reasonable. They are an absolute pleasure to work with. Oh, and did I mention that my 15 year old cabinets feel like silk...because they do! 😊", "pics": null, "resp": {"time": 1505331489473, "text": "Thank you so much! We really appreciate the opportunity that you gave us and the kind words! Your hospitality was amazing. Thanks again!!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "118138386467492989882", "name": "Kerri Call", "time": 1539034077126, "rating": 5.0, "text": "Overwhelmingly  pleased with the service as well as the quality of the end product. I had kitchen cabinets painted from boring brown wood finish to beautifully painted cabinets that brighten the extremely dark kitchen.  New Life updated worn drawer slides and installed new hardware that I ordered. From quote, time estimated to complete the job, to final invoice the service was outstanding.", "pics": null, "resp": {"time": 1539034825422, "text": "Thanks so much for the great review and your business Kerri!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "116107664884278385519", "name": "Blake Williams", "time": 1520804195061, "rating": 5.0, "text": "New Life Refinishing recently refinished our oak kitchen cabinets and they turned out great. They did a fantastic job and we couldn’t be happier with the finished product. They finished the job in about 5 days and left our kitchen spotless. Very good company and I highly recommend!", "pics": null, "resp": {"time": 1520804865824, "text": "Thanks so much Mr. Williams for the kind review!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "103813444991604961257", "name": "Gx Mx", "time": 1484687719971, "rating": 5.0, "text": "This company is unbelievably professional!  I was very impressed with their quick response to my initial contact.  I was equally impressed with the solutions Nick recommended for my furniture and the reasonable estimate costs.  Nick kept me informed every step of the process.  I am very pleased with the quality craftsmanship given to my china cabinet and table.  I highly recommend New Life Refinishing.", "pics": null, "resp": {"time": 1484688632807, "text": "Thanks so much for the great review and your business, we really appreciate it!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "110262216756714271104", "name": "Kathy Stampley", "time": 1477936295011, "rating": 5.0, "text": "New Life Refinishing provided us a reasonable price, delivered on time as scheduled, and the workmanship was exceptional.  We could not be more pleased with the work that was done.  I would highly recommend this company and we will use them again in the near future. Very professional and does excellent work!", "pics": null, "resp": {"time": 1477936669268, "text": "Thanks so much for taking the time to share your experience Mrs. Stampley!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "103876485111064667915", "name": "T. V.", "time": 1476394628934, "rating": 5.0, "text": "I had a wonderful experience with New Life Refinishing! I wanted to change my kitchen from oak to white which can be very tricky to do without looking tacky.  I found his website by doing a google search for refinishing kitchen cabinets.  Nick came over and gave me an estimate right away.  He has a very warm personality and is immediately likeable.  I knew after talking to him about his process and reviewing his photos on his website that I had found the right person to do the job.  He kept me in the loop through the whole thing.  He comes over when he says he will and calls beforehand, he finishes the job when he says he will.  He took my cabinet doors and drawer faces back to his shop and sprayed them there.  He came into my house and sprayed the actual cabinets and surrounds.  The whole process took under a week and I was amazed at how stunning the kitchen cabinets came out.  I can't stop looking at the kitchen without saying WOW!  His attention to detail and the quality and craftsmanship is beyond compare.  I would highly recommend New Life Refinishing to anyone and would ask him to do any future work!!!", "pics": null, "resp": {"time": 1476389719678, "text": "Thanks so much for taking the time to write this review Theresa.  It was a pleasure working with you!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "118084215953918499392", "name": "Christina Sirten", "time": 1551592156496, "rating": 5.0, "text": "Drew, Nick and Will were all great. Nick was very patient and helpful in helping me choose a color. They are very professional and finished my cabinets in the time quoted. I highly recommend New Life refinishing.", "pics": null, "resp": {"time": 1551636070809, "text": "Thanks so much for taking the time to review our company, and thanks for your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "114925401934815477341", "name": "Debbie Schumann", "time": 1549056200519, "rating": 5.0, "text": "Very pleased with the repainting of our bathroom cabinet drawers and doors.  They did an excellent job matching the original paint.  Very professional and responsive.  I would definitely use them again!", "pics": null, "resp": {"time": 1549077671853, "text": "Thanks for the review and your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "103621447681056910459", "name": "Joe Harless", "time": 1535460239374, "rating": 5.0, "text": "Nick and Will gave us great service in our recent need for staining and finishing the furniture we are using in our church auditorium renovation. They worked to match the stain on our pews and even repaired a badly damaged arm on one of our pews detailing the grain for a perfect match to the original grain and color. The service was fast and we highly recommend New Life Refinishing and will be using them again for any future needs. Thanks guys for all you did for us - Joe H.", "pics": null, "resp": {"time": 1535460963447, "text": "Thanks so much for the kind words Mr. Harless, it was a pleasure working with you!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "102811337031236434258", "name": "Erin Atkins", "time": 1519100513877, "rating": 5.0, "text": "I couldn’t be happier with the way my table turned out! I told Nick what I had envisioned, and he and his team made it a reality. New Life was easy to communicate with and worked quickly to complete the refinishing job. Will definitely hire them again!", "pics": null, "resp": {"time": 1519101193484, "text": "Thanks so much for the great review!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "114167392722554373955", "name": "Angela Arguello", "time": 1480088801717, "rating": 5.0, "text": "Nick at New Life repaired and refinished several handmade pieces of furniture for us that were damaged in our last move. We had six dining room chairs, an expandable table, a pub table and a twin bed headboard that needed to be completely rebuilt. Nick did a wonderful job on everything for us and he had it all completed quickly. He looked at other furniture that was damaged and made on the spot repairs for us. We still have a few pieces that we are considering getting refinished and we'll only have Nick at New Life Refinishing complete it for us.", "pics": null, "resp": {"time": 1480090628320, "text": "Thanks so much for the kind words Angela, and thanks for your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "113902525398329389446", "name": "Janice Kelly", "time": 1492200273436, "rating": 5.0, "text": "Outstanding service. Repaired my damaged (corner) of my dining room table to PERFECTION! Matched the finish FLAWLESSLY. Professional service. Will definitely use again. Highly recommend!", "pics": null, "resp": {"time": 1492200887337, "text": "Thank you so much for the kind words!! We enjoyed working on your table."}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "108794637136396486027", "name": "Carmen Wright", "time": 1578672430681, "rating": 5.0, "text": "I really appreciated the quick responses to any questions i had. All the team members were very professional and the finished product looks fantastic!", "pics": null, "resp": {"time": 1578676978164, "text": "Thanks so much for the kind review!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "115067354445879527241", "name": "Jonathan Powell (JP)", "time": 1479918204983, "rating": 5.0, "text": "These guys do amazing work! Nobody works harder than these guys! They charge a fair price for the top notch quality they provide. Money well spent on preserving things you want to keep and pass down to your kids. Highly recommended!!!", "pics": null, "resp": {"time": 1479920693499, "text": "Thanks for the review Jonathan!  We really appreciate it!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "110496631122750078030", "name": "Edwin Rodriguez", "time": 1494019196311, "rating": 5.0, "text": "Great job.  The renters I had tried to fix the cabinets on their own and made a mess. New life refinishing did a great job matching stain color to the rest of the cabinets.  The level of service is great and very timely.", "pics": null, "resp": {"time": 1494019852939, "text": "Thanks so much for the kind words and your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "107966693564412003096", "name": "Kevin Zurmuehlen", "time": 1464231198855, "rating": 5.0, "text": "New Life Refinishing is our new go-to for all of our wood refinishing needs in our house! Nick is an honest and hard-worker who completes his tasks on time and at a great price. He refinished our 30 year old kitchen cabinets and made them look completely new. We are very happy and will recommend New Life Refinishing to all of our friends and associates.", "pics": null, "resp": {"time": 1464231797749, "text": "Thank you so much for the review Kevin.  It was a pleasure working for you and your family!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "113680233572297634341", "name": "Josh Novak", "time": 1538420838717, "rating": 5.0, "text": "New Life Refinishing did an outstanding job in refinishing my old oak table. They made it look absolutely brand new! I highly recommend them!", "pics": null, "resp": {"time": 1538421518918, "text": "Thanks so much for the great review and your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "107417447851415797467", "name": "Michele Banish", "time": 1483208018973, "rating": 5.0, "text": "We left town for a Christmas Holiday and returned to a new kitchen.  We left Nick and Drew to do their best with 20 year old cabinets.  What we received was truely New Life.  Rather than paint, we had the guys strip,sand,and stain.  Lovely! I'd say it looks like a brand new kitchen adding tenfold the value of the modest investment in the work.  On time. Trustworthy. Quality craftsmanship. They will be back to address our master bath!", "pics": null, "resp": {"time": 1483210208073, "text": "We absolutely had a blast working on your kitchen. Thanks so much for the kind review!! We hope you guys have a Happy New Year!!!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "117062794742274394791", "name": "Dale Cox", "time": 1478782896315, "rating": 5.0, "text": "Nick refinished all of our white kitchen cabinets as well as a new built in cabinet that we built.  The work was excellent and the price very reasonable.  Nick is a hard worker and makes sure that the job is done to the customer's satisfaction.  Highly recommended!", "pics": null, "resp": {"time": 1464701270180, "text": "Thanks for the review Dale! We really appreciate it!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "102458974941301616004", "name": "Louise Holland", "time": 1492443326453, "rating": 5.0, "text": "These guys did a fantastic job on my cabinets! They were prompt & called to let me know what the plan for the day would be. They finished in timely manner. I highly recommend them.", "pics": null, "resp": {"time": 1492443971152, "text": "Thank you so much Mrs. Holland. You were such a pleasure to work for!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "107072722378519979948", "name": "Deanna Loden", "time": 1495220707472, "rating": 5.0, "text": "This company is so reliable, with prompt service and polite employees. They do beautiful work. They repaired and refinished our front door and we're very pleased with it. I highly recommend New Life Refinishing!", "pics": null, "resp": {"time": 1495220889515, "text": "Thanks so much for the kind words and your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "105607321109591029055", "name": "Laurel Moulden", "time": 1472280530726, "rating": 5.0, "text": "Amazing work!!!  I had an old sideboard that belonged to my grandmother that sat in my basement for years. It was in desperate need of refinishing and repair. Thanks to the talented craftsmanship and TLC of New Life Refinishing, it is now my favorite piece in my house and sits proudly in my dining room, with a whole new generation to make memories with.", "pics": null, "resp": {"time": 1472297881405, "text": "Thanks for sharing Laurel, I had a blast working on your wonderful buffet!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "113637561457659385522", "name": "andrea foust", "time": 1479907301753, "rating": 5.0, "text": "I would highly recommend New Life Refinishing.  Nick has great attention to detail. He keeps you informed on his timeline as things go along.  Awesome .", "pics": null, "resp": {"time": 1479907887762, "text": "Thanks so much for the kind review, and thanks for your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "118206974036300183251", "name": "Jason Potts", "time": 1511193300673, "rating": 5.0, "text": "Great experience. The quality of work was great. You can tell costumer satisfaction is important to these guys. The level of communication and flexability during the restoration process was perfect.", "pics": null, "resp": {"time": 1511194299210, "text": "Thanks so much for your business and the kind words!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "111943573004912819064", "name": "David Dye", "time": 1518495810395, "rating": 5.0, "text": "New Life is what our furniture got. We are so pleased. Our furniture that is over 50 years old looks better than brand new.", "pics": null, "resp": {"time": 1518496601598, "text": "Thanks for the kind words!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "102237074338227794823", "name": "Valarae Pfister", "time": 1478549473915, "rating": 5.0, "text": "New Life Refinishing did a superior job of fixing my dearly beloved solid walnut hope chest (made by my father).  He does excellent work and has great service.  Highly recommend!", "pics": null, "resp": {"time": 1478550084067, "text": "Thanks for the great review Val!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "110463609900806540822", "name": "Lindsay Caro", "time": 1468422882344, "rating": 5.0, "text": "We had several pieces of furniture painted and stained by New Life Refinishing. We had a dresser stained and a bookcase, bed and dresser all painted. He did an amazing, flawless job. We will definitely use New Life again for any of our furniture restoration needs.", "pics": null, "resp": {"time": 1468423333701, "text": "Thanks for your business and thank you for your kind words Lindsay!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "110226835775547051526", "name": "Guisseli Reyes Turnell", "time": 1478736065577, "rating": 5.0, "text": "Nick repaired a table that was damaged by our cleaning company. He was professional, on time, and the repairs turned out beautifully and better than expected. I highly recommend this business.", "pics": null, "resp": {"time": 1478736460234, "text": "Thanks so much for taking the time to share your experience!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "103606412349484149993", "name": "e swinney", "time": 1472306786670, "rating": 5.0, "text": "We had our front door and side panels stained by New Life Refinishing. He did an amazing job. We will definitely use New Life again for any of our refinishing needs.", "pics": null, "resp": {"time": 1472307892890, "text": "Thanks so much for taking the time to share your experience!  I really appreciate it!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "108610824819769381382", "name": "Charles Phillips", "time": 1480385863340, "rating": 5.0, "text": "His work was very good.  We got a quick turn around and he explained what a was done.  We will definitely use again.", "pics": null, "resp": {"time": 1480386168548, "text": "Thanks so much for your business and the kind review Mr. Phillips!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "107669371398687021222", "name": "Linda McGuire", "time": 1522115311826, "rating": 5.0, "text": "New Life Refinishing did a spectacular job on refinishing a heirloom  dining room set given to me by my mother. I appreciated not only the high quality of work they performed but the kindness and care expressed by the team.", "pics": null, "resp": {"time": 1522115982754, "text": "Thanks so much for the kind words, it was an absolute pleasure working on your table and chairs!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "113244301681752246348", "name": "Benjamin Cain", "time": 1484073184498, "rating": 5.0, "text": "Professional and great at their craft. They can do it all, furniture repair, refinishing to name a few. Competitive price for the quality work they do.", "pics": null, "resp": {"time": 1484073770175, "text": "Thanks for the kind words Ben, we really appreciate it!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "116427123684068478143", "name": "Richard Ehrenreich", "time": 1530886609743, "rating": 5.0, "text": "I don't recall just how we were introduced to Nick, maybe from a newspaper insert. We called him and received an estimate to refinish an oak table with four chairs and a captain's chair, probably in excess of 25 years old with all the mars and scratches a table of that age would show, not to mention several moves while on active duty in the military.. His estimate was very reasonable, so we asked him to perform the work. To say that we were thrilled with the finished product is an extreme understatement. The set looked better than brand new. We then asked him to do a much harder job, refinishing a hard maple dining room pedestal table and four unmatching chairs (in finish and type of wood) in a stain to match a dining room china cabinet. To make matters even worse, one of the leg bases had been chewed on quite vigorously by a new puppy. Once again, Nick's work was unsurpassed and his estimate was right on. Before and after pictures can be seen on his web page. We are very pleased with his work and wouldn't ever consider anyone else for future work.", "pics": null, "resp": {"time": 1488724252521, "text": "Thanks so much for the kind words and for your business, we really appreciate it!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "115040791932261917767", "name": "Cathie Jones", "time": 1471723438098, "rating": 5.0, "text": "New life Refinishing did an amazing job on our kitchen table top. I am so very pleased with not only his work, but also his estimate was the most reasonable.", "pics": null, "resp": {"time": 1471723821666, "text": "Thanks for the review Cathie!  Really appreciate your time and your business....thanks!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "117406631571244247039", "name": "Carmen Valeria", "time": 1485641226667, "rating": 5.0, "text": "We have had them refinish a coffee table, end table and a desk . Perfect every time! Very nice and professional!", "pics": null, "resp": {"time": 1485642372822, "text": "Thanks for your business and the kind words Carmen!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "104331672588526576687", "name": "Kimberly (Crystin) Hunter", "time": 1535772284065, "rating": 5.0, "text": "Great customer service!! Good work!", "pics": null, "resp": {"time": 1535772963873, "text": "Thanks for the kind words Crystin!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "114693715229913444665", "name": "Scott Dewald", "time": 1465265833713, "rating": 5.0, "text": "They refinished all of our cabinets and we couldn't be happier with the way they turned out. Would highly recommend this company for any cabinet work.", "pics": null, "resp": {"time": 1465266101694, "text": "Thanks Scott!  It was a pleasure working with you!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "116173489455111598255", "name": "MJ Game", "time": 1570708510929, "rating": 5.0, "text": "Really nice work!", "pics": null, "resp": {"time": 1570722909265, "text": "Thanks!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "109156394377129238249", "name": "Janie Davis", "time": 1468188523480, "rating": 5.0, "text": "AWESOME JOB on the Dining room table refinishing.", "pics": null, "resp": {"time": 1468192296048, "text": "Thank you Janie, we appreciate your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "104209721970812139079", "name": "White Feather", "time": 1612999228622, "rating": 5.0, "text": "Great down home people..not actors..he can work wood .. building some very fine handcrafted wood.furniture.and knows some of the oldest tales of the area locally.. class A outfit . truly.", "pics": null, "resp": null, "gmap_id": "0x888a63d9911a8df5:0x258d15e2b84258e4"}
{"user_id": "109926222212159067778", "name": "Laurie Thompson", "time": 1593465189052, "rating": 5.0, "text": "For about 16 years, I’ve worked with Roger Keel in repairing and upholstering antique pieces.  His company is the best I’ve ever experienced ie had some cane back breakfast room chairs that he outsourced and they are beautiful. Further, he is nice, easy to work with and with honest and fair business practices. Highly recommend this company!!", "pics": null, "resp": null, "gmap_id": "0x88891bb923c37761:0xd6cb5fc020ccdd9e"}
{"user_id": "102697048345064932604", "name": "Stephen Hunt", "time": 1576190446333, "rating": 5.0, "text": "Excellent furniture refinishing and upholstery at Keel.  I have had work done here for more than 20 years and I wouldn't think of going anywhere else!", "pics": null, "resp": null, "gmap_id": "0x88891bb923c37761:0xd6cb5fc020ccdd9e"}
{"user_id": "116932230839172833498", "name": "Chris Mahan", "time": 1596645103751, "rating": 4.0, "text": "It is a very professional business.", "pics": null, "resp": null, "gmap_id": "0x88891bb923c37761:0xd6cb5fc020ccdd9e"}
{"user_id": "104569003706291998079", "name": "Marty McArthur", "time": 1322111716602, "rating": 5.0, "text": "After a 2 year search found a TV cabinet at Birmingham Wholesale. Unusual size was perfect, finally. But dark finish, I needed blonde.  Roger Keel is across the street.  He antiqued it and it looks like it came form the showroom floor that way.  Excellent work, completed in specified time", "pics": null, "resp": null, "gmap_id": "0x88891bb923c37761:0xd6cb5fc020ccdd9e"}
{"user_id": "108620341369931401763", "name": "Danny Boone", "time": 1459116023323, "rating": 5.0, "text": "I inherited my grandfather's antique leather sofa, something he loved and I remember sitting on as a kid. It had been stored in really bad conditions and in an awful state. Took it to Keel's Upholstery to see if it could be resurrected and those guys did an excellent job! Grandad would be so proud.", "pics": null, "resp": null, "gmap_id": "0x88891bb923c37761:0xd6cb5fc020ccdd9e"}
{"user_id": "108516493485235143647", "name": "Katie Mitchell Bell", "time": 1348688745736, "rating": 5.0, "text": "Great service; great work. Highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88891bb923c37761:0xd6cb5fc020ccdd9e"}
{"user_id": "116134381024893998522", "name": "Lorenza Davis", "time": 1340528892921, "rating": 5.0, "text": "I had a wonderful experience with Keel Refinishing and Upholstery.  I found Mr. Keel to be very knowledgeable about upholstery and furniture refinishing.  He has many years of experience and is very eager to satisfy his customers to the fullest extent.  For any one who is in the Birmingham area, including Southside, UAB, Homewood, Mountain Brook, Vestavia Hills, Hoover, Pelham, Bessemer, Midfield, Fairfield and McCalla, please know that this is a great place to get quality craftsmanship and superior customer service.  The quality of the materials used by Keel is excellent and you can tell that the upholsterer is fully dedicated to his craft.  If you are looking for furniture reupholsters and furniture refinishing  Keel is the place to go.", "pics": null, "resp": null, "gmap_id": "0x88891bb923c37761:0xd6cb5fc020ccdd9e"}
{"user_id": "116544005785463666645", "name": "Betty Bowen", "time": 1493829247081, "rating": 1.0, "text": "rude very rude if i had  choice it would be o stars", "pics": null, "resp": null, "gmap_id": "0x88891bb923c37761:0xd6cb5fc020ccdd9e"}
