{"user_id": "114059828277434285739", "name": "Paula Sauer", "time": 1564231615320, "rating": 5.0, "text": "They have custom made two doors for my new house and I couldn’t be happier with the finished product. Solid construction and beautifully finished!!! When we finish our basement, I will be ordering more doors from them. PS: they did an excellent job of boxing them up for shipment to Michigan so there was no damage during transit.", "pics": null, "resp": null, "gmap_id": "0x889a6b808f1c1b1f:0x9c92f479c6ade1f1"}
{"user_id": "101503143202252741938", "name": "Albert Epshteyn", "time": 1575431403133, "rating": 5.0, "text": "We got barn doors from Luke on Etsy, and he made us matching shelves that we used around or fireplace. They came out great. Thanks for the great work!", "pics": null, "resp": null, "gmap_id": "0x889a6b808f1c1b1f:0x9c92f479c6ade1f1"}
{"user_id": "112608559042903315781", "name": "Annie Johnson", "time": 1556319536948, "rating": 5.0, "text": "Very friendly family business that carries unique furniture pieces and offers customization. They are busy (for good reason) so make an appointment beforehand if you are looking for something specific.", "pics": null, "resp": null, "gmap_id": "0x889a6b808f1c1b1f:0x9c92f479c6ade1f1"}
{"user_id": "109444346696656351974", "name": "Leigh Peters", "time": 1627307463142, "rating": 5.0, "text": "Linda,  who creates the wreaths and monogram has an amazing insight into what is wanted in the design you have in mind.  She takes her time and walks you through every step of the way.  I am so excited and pleased with the items she has created for me.", "pics": null, "resp": {"time": 1627334474039, "text": "Thank you so much for your review. yes, Linda is amazing! We are so thankful to have her! Hope to see you soon."}, "gmap_id": "0x889a157e7f42ebbd:0x507deba26dcc4b60"}
{"user_id": "101213068872109701955", "name": "Janice Gladney", "time": 1626987171956, "rating": 5.0, "text": "Had a good shopping experience. Bought a little something, something for myself. Got a very nice gift for my sister's birthday. The sales ladies were very nice and helpful. Going back again.", "pics": null, "resp": {"time": 1627042177290, "text": "Thank you for stopping in.  We hope to see you again real soon.  We wish you and your sister a very HAPPY BIRTHDAY !!!"}, "gmap_id": "0x889a157e7f42ebbd:0x507deba26dcc4b60"}
{"user_id": "111427173661958541153", "name": "Jeanell Perkins", "time": 1618885038724, "rating": 5.0, "text": "Such a neat shop! The ladies are great, helpful, and knowledgeable about the store. So many awesome things for everyone!", "pics": null, "resp": {"time": 1619182749198, "text": "Thank you so much for your comments.  We hope to see you again real soon :)"}, "gmap_id": "0x889a157e7f42ebbd:0x507deba26dcc4b60"}
{"user_id": "102250737615437478912", "name": "Amy Damm", "time": 1611509258317, "rating": 5.0, "text": "Great place. If you are looking for something unusual, vintage, monogramming, etc this is the place to go.", "pics": null, "resp": {"time": 1613762249992, "text": "Thank you so much!  Hope to see you soon!"}, "gmap_id": "0x889a157e7f42ebbd:0x507deba26dcc4b60"}
{"user_id": "106752700031460662122", "name": "Laura Owens", "time": 1561688442437, "rating": 1.0, "text": "I have been here twice in the last year and both times the owner refused to sell me something she had out in the store!  I really wanted to love this place, but the owner makes it impossible.  Why have things out you refuse to sell.  I tried to see what she would take for a skillet that was displayed with others and she wouldn’t work with me at all.  What a pathetic excuse for an antique store.  I will NEVER be back.", "pics": null, "resp": {"time": 1561726434568, "text": "Laura, I apologize that I did not have the skillet priced.  I never refused to sell item to you.  I simply had not had time to clean and research before pricing, as I explained.  I would have been happy to take the skillet down from display and researched, after I finished up with the customer I was assisting.  I apologize for the misunderstanding.  ~ Melissa"}, "gmap_id": "0x889a157e7f42ebbd:0x507deba26dcc4b60"}
{"user_id": "107627878756140138694", "name": "Pamela H", "time": 1530554921573, "rating": 5.0, "text": "Love, Love, Love this place! Loads of new finds. The owner is amazing and super helpful. Super cute shop. A must visit!!", "pics": null, "resp": {"time": 1555692617753, "text": "Pamela, we love love love your enthusiasm for our shop! We hope you took home a special item from your visit with us. Looking forward to seeing you soon! -Melissa Smith, Owner"}, "gmap_id": "0x889a157e7f42ebbd:0x507deba26dcc4b60"}
{"user_id": "110230531498374612311", "name": "Don Julio", "time": 1527621768290, "rating": 5.0, "text": "Great place with a little of everything...Owner is very kind and knowledgeable...makes some art herself...Ill be back", "pics": null, "resp": {"time": 1528068044554, "text": "Thank you so much for your kind comments! hope to see you again real soon 😊"}, "gmap_id": "0x889a157e7f42ebbd:0x507deba26dcc4b60"}
{"user_id": "105984107954854688035", "name": "Scott Mains", "time": 1620079956632, "rating": 5.0, "text": "Wonderful selection of rough cut and live edge wood. Definitely worth your time to wander through. Super friendly staff!", "pics": null, "resp": null, "gmap_id": "0x88891a510d5afed5:0xb77ff9874b705f13"}
{"user_id": "105523044524638294643", "name": "Pinson Patriot", "time": 1600112513798, "rating": 5.0, "text": "Supper nice and very unique furniture.", "pics": null, "resp": null, "gmap_id": "0x88891a510d5afed5:0xb77ff9874b705f13"}
{"user_id": "114442061198995321253", "name": "David McMahon", "time": 1532965158385, "rating": 5.0, "text": "I purchased a beautiful desk from Alabama Sawyer and I love it. It's extraordinarily well-designed and constructed, and I will have it for years. Excellent communication with the company as well. Thanks!", "pics": null, "resp": null, "gmap_id": "0x88891a510d5afed5:0xb77ff9874b705f13"}
{"user_id": "102363230634334681981", "name": "Stephen Hicks", "time": 1549829220953, "rating": 5.0, "text": "Innovative design sold me on the Sputnik side table.", "pics": null, "resp": null, "gmap_id": "0x88891a510d5afed5:0xb77ff9874b705f13"}
{"user_id": "112970522726811636072", "name": "Anthony Cook", "time": 1616604949908, "rating": 5.0, "text": "Your sales consultant Veronica Turner is amazing! So patient while I was trying to find the perfect sectional for my home. Delivery was top notch. They even put felt pads on the footings of they sectional that they brought in themselves. Makes me wish I had bought from Havertys years ago. Will definitely return when I need to upgrade.", "pics": null, "resp": {"time": 1616652859515, "text": "Hi Anthony, thank you for your kind review; we are happy to pass along your comments to Veronica here at Havertys Furniture! We always strive to provide top quality service to every guest, and are pleased to hear that you enjoyed your experience here at Havertys Furniture!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "111815684208581492028", "name": "Ronald Edmond", "time": 1624238778421, "rating": 5.0, "text": "Janey Jemison was awesome I want to thank her for the time she gave my Wife. Here honesty and cincerity she gave us. What a warm and beautiful person. We are happy to have a new friend.", "pics": null, "resp": {"time": 1624264001463, "text": "Hi Ronald, we're happy to hear you had such a positive experience with our team! If you have any further questions, please don't hesitate to reach out!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "112949457300933592984", "name": "Terry Anderson", "time": 1624070798063, "rating": 5.0, "text": "Salesperson was fantastic and patient with us. Finance Office very knowledgeable on how the company financing works", "pics": null, "resp": {"time": 1624086995958, "text": "Terry, we're happy to hear you had such a positive experience with our team! We do hope we can be of assistance in the future. Take care!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "107726961477855729679", "name": "Lalita Holder", "time": 1622930280008, "rating": 5.0, "text": "Customer service from the moment of arrival. I liked the fact that the representative showed us items we requested but also allowed a bit of freedom for us to browse a bit on our own & was available & nearby.", "pics": null, "resp": {"time": 1622958808686, "text": "Hi Lalita, we are very happy to have provided you with such a positive experience! Thank you so much again for your feedback! We hope you have a great day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "101615140145143002333", "name": "Jerry Bousard", "time": 1620153905422, "rating": 5.0, "text": "Services was excellent!  Follow up was excellent with Darwin Davis!  Looking forward to receiving our purchase.", "pics": null, "resp": {"time": 1620178502599, "text": "Hi Jerry, thank you so much for your positive comments about Havertys Furniture! If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "100993235015163703944", "name": "John Murphy", "time": 1624052723083, "rating": 5.0, "text": "Darwin was fantastic!  Very knowledgeable and great to work with - definitely an asset to Haverty’s!", "pics": null, "resp": {"time": 1624059674773, "text": "John, thank you for your kind review; we are happy to pass along your comments to Darwin here at Havertys Furniture! If you have any further questions, please give us a call. We're always happy to help!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "113841544402470978672", "name": "Allison Harbin", "time": 1612288183603, "rating": 5.0, "text": "Our sales person Sheila was extremely helpful and knowledgeable. Gave us time to look and didn't feel pressured to buy anything. We will definitely use her and Havertys again!!", "pics": null, "resp": {"time": 1612366382040, "text": "Hi Allison, thank you so much for your positive comments about Havertys Furniture! If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "102090613257848955589", "name": "Patricia Blackwell", "time": 1606316966393, "rating": 5.0, "text": "The two delivery guys were wonderful. They took care of my home like it was theirs. They also realized that with the buckboard my bed was way to tall for me. It was as high as my shoulders. So they took care of taking it back and making sure it came off my billing. They were very nice.", "pics": null, "resp": {"time": 1606376956745, "text": "Hi Patricia, thank you for your kind words and this wonderful review! If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "107847390139521983492", "name": "Tricia Marshall", "time": 1614706101357, "rating": 5.0, "text": "We had a very helpful sales person.  My father is 77 years old.  The salesman was patient and provided all of the information we needed to make the right choice on a lift recliner.", "pics": null, "resp": {"time": 1614771672476, "text": "Hi Tricia, we are very happy to have provided you with such a positive experience! Please don't hesitate to reach out if there's anything additional we can do for you. Take care!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "109198197682627338436", "name": "Fatimus Patimus", "time": 1616257157447, "rating": 5.0, "text": "Knew what I wanted and went in for a painless shopping experience.  Very friendly staff and beautiful products.", "pics": null, "resp": {"time": 1616262709604, "text": "Hi Fatimus, we are very happy to have provided you with such a positive experience! If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "116876965460708621909", "name": "Chelsea Miller", "time": 1619132386853, "rating": 5.0, "text": "I was checked on multiple times and felt that my needs were catered to!", "pics": null, "resp": {"time": 1619136092790, "text": "Hi Chelsea, we are very happy to have provided you with such a positive experience! We hope to see you soon!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "104005811120303941449", "name": "Rhonda Allen", "time": 1603661076653, "rating": 5.0, "text": "I asked for Denise as I entered the door. She, as with my last purchase, provided EXCELLENT assistance throughout my shopping experience. I tried out quality furniture to my liking. She was beyond patient while I finally made my selection, providing samples, pricing, computer images, and visual pillow displays with furniture. Great job!!", "pics": null, "resp": {"time": 1603716000405, "text": "Rhonda, we're happy you found Denise to be so supportive during your experience here at Havertys Furniture. We are always more than happy to assist you if anything else comes up. Take care!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "107708602639034121485", "name": "Natalyn Howard", "time": 1610999264224, "rating": 5.0, "text": "Veronica was very thorough and patient. She was able to handle all of my needs and answer all of my questions. She was a pleasure to work with.", "pics": null, "resp": {"time": 1611076116918, "text": "Hi, thank you for your kind review; we are happy to pass along your comments to Veronica here at Havertys Furniture! We always strive to provide top quality service to every guest, and are pleased to hear that you enjoyed your experience here at Havertys Furniture!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "113559373531649419072", "name": "Kim DeVilbiss", "time": 1601782556380, "rating": 5.0, "text": "Veronica Turner was very attentive. She listened to what we were wanting and showed us all of the options. She was extremely helpful in the checkout process and ensured that we received the discounts that we were entitled! Won’t shop for furniture anywhere else. Haverty’s has a tremendous selection to choose from for every room in the house.", "pics": null, "resp": {"time": 1601798575618, "text": "Kim, your wonderful feedback and rating mean a lot to us. Until the next time we meet, take care!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "103503724162384680211", "name": "Anne Powers", "time": 1616269471248, "rating": 4.0, "text": "After we were greeted,  we were left alone which made the experience better!", "pics": null, "resp": {"time": 1616412551931, "text": "Hi Anne, thank you so much for your positive comments about Havertys Furniture! If you have any further questions, please give us a call. We're always happy to help!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "107372539114875148033", "name": "Debbie Bradshaw", "time": 1605581022891, "rating": 5.0, "text": "I had a fun buying experience!! Dorrie was great helping me make fabric decisions, and the other design specialists were great as well.  It was an overall good experience!", "pics": null, "resp": {"time": 1605596860862, "text": "Hi Debbie, we are very happy to have provided you with such a positive buying experience! We do hope we can be of assistance in the future. Take care!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "109325005479188725583", "name": "Nicholas Desmond", "time": 1610652909299, "rating": 5.0, "text": "Veronica was most helpful and knowledgeable - may God bless you and thank you so much!", "pics": null, "resp": {"time": 1610662107533, "text": "Hello, thanks for your praise and kind comments about our team. Until the next time we meet, take care!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "111434357357846081409", "name": "Carla Coleman", "time": 1619150610839, "rating": 5.0, "text": "Friendly and professional.  Very helpful.", "pics": null, "resp": {"time": 1619154209279, "text": "Hi Carla, we are very happy to have provided you with such a positive experience! If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "102056319124792553737", "name": "Mary Bracy", "time": 1609534904245, "rating": 5.0, "text": "Mrs. Veronica was very sweet and informative.  My overall experience was great!", "pics": null, "resp": {"time": 1609560149380, "text": "Hi Mary, we are very happy to have provided you with such a positive experience! Feel free to reach out to us if you need anything. Have a wonderful day."}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "104574908896334671932", "name": "Don Hembree", "time": 1607386111924, "rating": 5.0, "text": "Darwin did a great job assisting me with the purchase. He’s great at what he does genuinely cares about his customers.", "pics": null, "resp": {"time": 1607419311371, "text": "Hello Don, thank you for your kind review; we are happy to pass along your comments to the team here at Havertys Furniture! We look forward to your next visit! Take care!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "103728149081424148888", "name": "Omar Ruiz Jr.", "time": 1620926774966, "rating": 5.0, "text": "Great product and delivery service!", "pics": null, "resp": {"time": 1620985231497, "text": "Hi Omar., thank you for sharing your positive experience! Please let us know if there is anything else we can do for you; we are more than happy to help! Take care!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "105293586761240337947", "name": "June Martin", "time": 1608138392608, "rating": 5.0, "text": "Sales associate, Shelia Griffin (Mobile AL) is excellent.  She is knowledgeable and very professional.", "pics": null, "resp": {"time": 1608553657762, "text": "Hi, thank you for your kind review; we are happy to pass along your comments to Shelia here at Havertys Furniture! We look forward to your next visit! Take care!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "103886482519923381487", "name": "Wayne Harrison", "time": 1588882978354, "rating": 5.0, "text": "Found what I wanted online and went by the store to check it out. Very fine piece of furniture at a great price. I spent a couple of weeks looking for an entertainment console buy couldn't find what I wanted. Thought of Havertys and found exactly what I wanted there..solid wood construction with no particle board. It's much easier picking out a TV over what to set it on.", "pics": null, "resp": {"time": 1588920473221, "text": "Wayne, we are glad we could help! We appreciate your positive review about your recent experience with us! We look forward to your next visit! Take care!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "106751620872572673974", "name": "Glenda Cooke", "time": 1606775112526, "rating": 5.0, "text": "We have dealt with Sheila Griffin for many years and find her to be very helpful and professional.", "pics": null, "resp": {"time": 1606802167368, "text": "Hey Glenda, we're happy you found our staff to be so supportive during your experience here at Havertys Furniture. We hope to see you soon!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "115195542275485910551", "name": "Stacey Hinton", "time": 1619223239213, "rating": 5.0, "text": "Superior service and flexible to work with!", "pics": null, "resp": {"time": 1619231541738, "text": "Hi Stacey, thanks for your praise and kind comments about our team. We hope to see you soon!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "106800807161209102207", "name": "Stephanie May", "time": 1595714659257, "rating": 5.0, "text": "Mr Fernandez and Ms Shelia did an outstanding job in assisting my family and I with furnishing our new home. Ms Shelia was patient and assisted with ensuring everything flowed, colors and style. Mr Fernandez provided us with great customer  service. Thank you all❤", "pics": null, "resp": {"time": 1595787490389, "text": "Hi Stephanie, thank you for taking the time to leave a review for us at Havertys Furniture. We're happy we could meet your expectations! If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "112414138286394254275", "name": "Pamela Keith", "time": 1611540637431, "rating": 5.0, "text": "Our salesperson was outstanding and extremely knowledgeable.", "pics": null, "resp": {"time": 1611617192886, "text": "Pamela, we're happy you found our staff to be so supportive during your experience here at Havertys Furniture. We hope to see you soon!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "106265927005233290104", "name": "Brent Chapuis", "time": 1616873780211, "rating": 5.0, "text": "Denise is the BOMB!!! Very helpful, not pushy, wonderful experience!", "pics": null, "resp": {"time": 1616901789326, "text": "Brent, thank you for your kind review; we are happy to pass along your comments to Denise here at Havertys Furniture! If you have any further questions, please give us a call. We're always happy to help!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "117950520783027689374", "name": "Gene Everette", "time": 1588536506541, "rating": 5.0, "text": "The right product at the right price. We worked with the store manager and asked for custom fabric and he was able to add it to the order and show us the products on the computer before finalizing the purchase. Very happy with the way we were given the freedom to shop on our own and when we made our decision the purchase was easy.", "pics": null, "resp": {"time": 1588873647993, "text": "Gene, we're glad to hear we delivered such a great experience. If there's anything further we can do for you, we are happy to help!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "115617256926303681842", "name": "Leroy Curry", "time": 1599098113540, "rating": 5.0, "text": "We appreciated the friendly, courteous, and professional service of all the sales associates. Also, we like the furniture and it’s quality.", "pics": null, "resp": {"time": 1599148522931, "text": "Hi Leroy, thank you so much for your positive comments about Havertys Furniture! We are always more than happy to assist you if anything else comes up. Take care!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "115112865200898337165", "name": "Lafitte Ladies Ministrt", "time": 1619271075280, "rating": 5.0, "text": "Friendly, helpful salesperson and manager", "pics": null, "resp": {"time": 1619276525570, "text": "Hi Lafitte, we're happy to hear you had such a positive experience with our team! We hope to see you soon!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "100535556553610495514", "name": "Geoffrey Smith", "time": 1605479298769, "rating": 5.0, "text": "Veronixa did a wonderful job and was very friendly.", "pics": null, "resp": {"time": 1605549694643, "text": "Hi Geoffrey, thank you for taking the time to leave a review for us at Havertys Furniture. We're happy we could meet your expectations! If you have any further questions, please give us a call. We're always happy to help!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "113382029303909838213", "name": "Karen Jones", "time": 1591466098896, "rating": 5.0, "text": "Megan was FANTASTIC on Chat. She was super helpful, fast, knowledgeable and I ended up purchasing exactly what I needed. I really appreciate such great customer service! Thank you, Megan!", "pics": null, "resp": {"time": 1591568684549, "text": "Karen, we are so happy to read such a great review about Havertys Furniture! Please let us know if there is anything else we can do for you; we are more than happy to help!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "104263011870871682302", "name": "Marie Ehlert", "time": 1591714971563, "rating": 5.0, "text": "Darwin was attentive and well informed. He gave us space when we needed it but was there to answer all our questions. Check out process was efficient.", "pics": null, "resp": {"time": 1591739220350, "text": "Hi Marie, thanks for highlighting some of our staff who helped make this such a great furniture shopping experience! We'll be sure to pass along your kind comments to the Darwin and the team here at Havertys Furniture in Mobile. Have a fantastic day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "113880047858556375340", "name": "Eaph Woodson", "time": 1595120540150, "rating": 5.0, "text": "Darwin has been phenomenal since I met him back in 2007 or so! We are long time customers and will ALWAYS do business with Darwin! 👍", "pics": null, "resp": {"time": 1595181880472, "text": "Hi Eaph, thank you for taking the time to leave a review for us at Havertys Furniture. We're happy we could meet your expectations! If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "111333435629809706322", "name": "Doris Wine", "time": 1595552813904, "rating": 5.0, "text": "The sales person Veronica was very helpful in helping me make my decision on the bedroom furniture. I really appreciate her honesty and integrity.", "pics": null, "resp": {"time": 1595634907776, "text": "Doris, we strive for 100% satisfaction, and it is great to see you had such a positive experience at Havertys Furniture. Thank you so much again for your feedback! We hope you have a great day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "116337382893356269077", "name": "Sonja Edwards", "time": 1613177100747, "rating": 5.0, "text": "Everyone was very helpful and pleasant", "pics": null, "resp": {"time": 1613224677781, "text": "Hi, thank you so much for the positive review! Feel free to reach out to us if you need anything. Have a wonderful day."}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "112492237675568087935", "name": "Rheannon Ellison", "time": 1580171478001, "rating": 5.0, "text": "Our Sales consultant, Alana Wiley-Walker was awesome! She helped us pick out 2 couches; she was very helpful, but not pushy. My husband and I both really enjoyed working with her!", "pics": null, "resp": {"time": 1580236240657, "text": "Rheannon, we're happy to hear you had such a positive furniture shopping experience with Alana! If you're ever in need of more help, please let us know!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "101796966211930098200", "name": "Darryl Morin", "time": 1562433799790, "rating": 5.0, "text": "Excellent customer service!  Both Darwin and Lexi were great with suggestions, listening to what I had in mind and wanted, and were a tremendous help!!  Havertys has an excellent selection of furniture for every room.  I went in looking for dining room, living room, and home office furniture and they hit a grand slam with everything I was looking for and needed!  I highly recommend taking a look!  Everyone there is kind, friendly, and extremely helpful!", "pics": null, "resp": {"time": 1562951766172, "text": "Darryl, your recommendation means so much to us and we're so happy to have earned it. Thank you again for taking the time to let the world know about your positive furniture shopping experience. Have a great day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "106924383392593557779", "name": "Cynthia Coleman", "time": 1591928136665, "rating": 5.0, "text": "The customer service was exceptional. My sales person was attentive and knowledgeable. This is my go to place for furnishings.", "pics": null, "resp": {"time": 1591966425477, "text": "Cynthia, thank you for your kind review; we are happy to pass along your comments to the team here at Havertys Furniture! We're glad to hear we delivered such a great experience. If there's anything further we can do for you, we are happy to help!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "111130791758475054009", "name": "Hampton Inn Saraland", "time": 1584392321381, "rating": 4.0, "text": "I love Haverty furniture but the customer service in the past has been horrible. I came in Sunday just to look at the furniture i was gonna order online because service  I had gotten in the past was  just that bad. but to my surprise i was greeted by a real nice lady who helped me with my order.\nI decided to place my order with her instead of online.I can only imagine the business you all lose because of poor service. I was very happy with my salesperson today.", "pics": null, "resp": {"time": 1584441826944, "text": "Hello Hampton, thank you; we appreciate your feedback! We are always more than happy to assist you if anything else comes up. Take care!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "106453361522413750365", "name": "Nana Bea", "time": 1604548293285, "rating": 5.0, "text": "Friendly, not pushy but helpful.", "pics": null, "resp": {"time": 1604581219694, "text": "Hi Nana Bea, we are very happy to have provided you with such a positive experience! We hope to be of service to you again in the future. \rBest wishes, \rHavertys Furniture"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "111911368108139151114", "name": "Edna Ramer", "time": 1597959488843, "rating": 5.0, "text": "Everyone helpful  . Best made furniture, long-lasting.", "pics": null, "resp": {"time": 1598029677761, "text": "Hi Edna, we really appreciate your positive feedback! Please don't hesitate to reach out to us if you ever need any more help. Have a wonderful day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "116098673762311600315", "name": "C.C. Taul", "time": 1605747773320, "rating": 5.0, "text": "Sheila was very nice and informative.", "pics": null, "resp": {"time": 1605775182260, "text": "Hello, we are very happy to have provided you with such a positive experience! We hope you have a great day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "107414923443864291265", "name": "Nicole Michaels", "time": 1580775677144, "rating": 5.0, "text": "The furniture is extremely high quality and the service is impeccable. Fast and efficient! They are a pleasure to do business with.", "pics": null, "resp": {"time": 1580783664466, "text": "We appreciate your positive review about your recent experience with us, Nicole! If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "112114376281125963970", "name": "Constance Dial", "time": 1594502196371, "rating": 5.0, "text": "The sales person Sharon was awesome she captured my vision", "pics": null, "resp": {"time": 1594514254597, "text": "Constance, thank you for your kind review; we are happy to pass along your comments to the team here at Havertys Furniture! Feel free to reach out to us if you need anything. Have a wonderful day."}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "108830449426227253051", "name": "Michael Plattenburg", "time": 1590289037935, "rating": 5.0, "text": "Veronica Turner was very accommodating and knowledgeable. Customer service was great.", "pics": null, "resp": {"time": 1590334873984, "text": "Michael, thank you for your kind words and this wonderful review! Thank you, and have a fantastic day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "117114392315566483886", "name": "Jan Justis", "time": 1581599945610, "rating": 5.0, "text": "Peggy Floyd was kind and knowledgeable. She made sure I had the piece I wanted. I would definitely return.", "pics": null, "resp": {"time": 1581620748009, "text": "Jan, thank you for your kind review; we are happy to pass along your comments to the team here at Havertys Furniture! We hope to be of service to you again in the future.  Best wishes,  Havertys Furniture"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "105728535493234788822", "name": "Mamie Finkley", "time": 1589594895584, "rating": 5.0, "text": "The sales rep was ver y knowledgeable on styles and prices. She was patient and ecplained all options.", "pics": null, "resp": {"time": 1589652849179, "text": "Mamie, your wonderful feedback and rating mean a lot to us. Thank you, and have a fantastic day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "114968832272544508520", "name": "ohmgirl Angela", "time": 1551659582605, "rating": 4.0, "text": "Scott was awesome and very helpful. He went above and beyond in customer service. It was pouring rain and he brought my husband an umbrella to use so that he could pull the car around so me and my 6 yr old son didn't have to get wet and even walk us out. He answered all out questions, he was helpful and friendly without any pressure to buy. We decided on a lovely sofa set and Scott went over all the available options to help us pick the right on for our space. Over all I give Scott 5 stars and the over all store a 4.5. As of now I would more than likely do business with them again in the future.", "pics": null, "resp": null, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "111238352476242008445", "name": "Deborah Turberville", "time": 1572374806813, "rating": 5.0, "text": "Alana was extreme helpful and cheerful. We found just he perfect sleeper sofa and with such great service, we will have it in ample time for Thanksgiving guests!", "pics": null, "resp": {"time": 1572379380945, "text": "Hi Deborah! We're so happy we were able to help you out! Thank you, and have a fantastic day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "114961363594855308467", "name": "Kristina Rayner", "time": 1592772212098, "rating": 5.0, "text": "Sharon provided excellent customer service and was very personable and knowledgeable.", "pics": null, "resp": {"time": 1592851664731, "text": "Hi Kristina, thank you so much for your positive comments about Havertys Furniture! If you have any further questions, please give us a call. We're always happy to help!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "114420563327447266871", "name": "Darlene Broadus", "time": 1567619470301, "rating": 5.0, "text": "Excellent experience! I will have lots of great things to tell friends about my shopping at Haverty's. I so excited about the new pieces we're adding to our home. Thank you, Scott!", "pics": null, "resp": {"time": 1567628600535, "text": "Thank you, Darlene! We are delighted to hear that you had an excellent shopping experience with us! Please don't hesitate to reach out if there's anything additional we can do for you."}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "106207759912446037627", "name": "Vinnie Valentine", "time": 1594481028494, "rating": 5.0, "text": "Veronica was very helpful and not pushy and I liked that.", "pics": null, "resp": {"time": 1594489516532, "text": "Hello Vinnie, we appreciate you taking the time to leave us this feedback. If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "118410742051954299817", "name": "Richard Griswold", "time": 1574815327856, "rating": 4.0, "text": "The store location was convenient, clean, and in good repair . The Staff greeted me as I walked in and Ms Peggy questioned me about my intended purchase and helped me decide on the right size, color, and distribution of my new Living Room group . I enjoyed the ability to see the contrast of colors on Ms Peggy's computer, that was so enlightening . I will return to Haverty's and I will look for Ms Peggy !!  Thank you for your kind help !", "pics": null, "resp": {"time": 1574867153769, "text": "Richard, we are very happy we could provide you with a positive experience! We can't wait to see you again, have a great day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "107373809720040287041", "name": "Holly Coleman", "time": 1558412456516, "rating": 5.0, "text": "My husband wants input on the furniture we select but is out of town right now. Sheila Griffin went out of her way to provide me with photos and prices of each of the furniture pieces I like that I want my husband to see. She gave me printed information about all of it and also emailed it to me so that I could email it to my husband to consider. Of course, she told me about the sales prices and delivery. Sheila took excellent care of me, and I would recommend her to any potential customer.", "pics": null, "resp": null, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "109699761962291374262", "name": "T C", "time": 1623786575987, "rating": 5.0, "text": "Very Professional and Kind", "pics": null, "resp": {"time": 1623819396158, "text": "Hi T C, thanks for your praise and kind comments about our team. We hope to see you soon!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "103154892062841803588", "name": "Teresa Eiland", "time": 1593561271500, "rating": 4.0, "text": "Sheila Griffin was most helpful in our decision making for new furniture.  Thank you, Sheila", "pics": null, "resp": {"time": 1593623784949, "text": "Teresa, thank you for your kind review; we are happy to pass along your comments to the team here at Havertys Furniture! We're glad to hear we delivered such a great experience. If there's anything further we can do for you, we are happy to help!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "111928680520082010420", "name": "Kim Young", "time": 1614200341431, "rating": 5.0, "text": "Customer service was the BOMB!!!", "pics": null, "resp": {"time": 1614233544481, "text": "Hi Kim, we are very happy to have provided you with such a positive experience! If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "118369400124752256075", "name": "Noor Boo Bear", "time": 1584547984493, "rating": 5.0, "text": "Very polite and answered all my questions and concerns I had\nGreat prices", "pics": null, "resp": {"time": 1584560638967, "text": "Hi Noor, we are very happy to have provided you with such a positive experience! If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "111858781458742379509", "name": "Shelly Bosarge", "time": 1561860002516, "rating": 5.0, "text": "We had the most helpful and knowledgeable ladies help us today.  They offered sound advice and helped us choose furniture for our home that would fit in the space and look beautifully.", "pics": null, "resp": {"time": 1562001924869, "text": "Hello Shelly, thank you for sharing your positive feedback!  We're so pleased to hear you have had such a wonderful experience with our team.  If there is anything further that we may do to assist you, please do not hesitate to reach out!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "113732237285007645087", "name": "Carl Groth", "time": 1556031837772, "rating": 5.0, "text": "Scott, our salesperson,  did a fantastic job working with us on several items we were looking at to purchase either right before we move or once our new home is built.  He stayed with us throughout our hour long visit and provided excellent customer service, explanations and patience.", "pics": null, "resp": null, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "109966400545225640983", "name": "Pamela Walcutt", "time": 1575079914870, "rating": 5.0, "text": "Wonderful, helpful sales consultant, Denise and Lexi, the design consultant were awesome to work with! They both went above what I have ever experienced in a furniture buying situation!", "pics": null, "resp": {"time": 1575134999543, "text": "Pamela, thank you for your kind review; we are happy to pass along your comments to Denise and Lexi! We hope you continue to choose us for your furniture needs!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "117217861879507512111", "name": "Chris Garmon", "time": 1581846963638, "rating": 5.0, "text": "Thank you so much for the business and the great sales person and management of Haverty..", "pics": null, "resp": {"time": 1581909867167, "text": "Chris, thank you for your kind words and this wonderful review! We always strive to provide top quality service to every guest, and are pleased to hear that you enjoyed your experience here at Havertys Furniture!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "113216640405135097324", "name": "Victor Crawford", "time": 1580922835624, "rating": 5.0, "text": "Veronica Bryant is wonderful.  Extremely helpful with keen insight as how to properly furnish a home.", "pics": null, "resp": {"time": 1581029102267, "text": "Hi Victor, we are very happy to have provided you with such a positive experience! Please don't hesitate to reach out if there's anything additional we can do for you. Have a wonderful day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "110460883227920609136", "name": "Helen H. Gonzalez", "time": 1570043228374, "rating": 5.0, "text": "Both Darwin and Lexi were great with suggestions, listening to what I had in mind and wanted, and were a tremendous help!!  Havertys has an excellent selection of furniture for every room.", "pics": null, "resp": {"time": 1570122884322, "text": "Helen, we're happy you found our staff to be so helpful during your shopping experience here at Havertys Furniture! Feel free to reach out to us if you need anything else!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "106387489768895215558", "name": "Erica Elia", "time": 1590501375453, "rating": 5.0, "text": "Very happy with my experience and love my new sofa.", "pics": null, "resp": {"time": 1590522046155, "text": "Erica, we are very happy we could provide you with a positive experience! We're glad to hear we delivered such a great experience. If there's anything further we can do for you, we are happy to help!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "109859757216391062624", "name": "Logan Brown", "time": 1529457236982, "rating": 5.0, "text": "I don't usually write reviews, but I had too for this one! I had dealt with Veronica Turner, and she was nothing short of exceptional! From the minute I walked in she was very helpful. She showed all my options (it was all neatly arranged and the store had a easier layout then the other furniture store I went too first). I had plans to go to a few more stores after this to look around, but I didn't! She was great to deal with and very helpful. I was in and out in around 20 minutes! Picked out my bedroom set, got approved for the great financing offer they had going on, and set up my delivery. I highly recommend asking for Veronica!", "pics": null, "resp": {"time": 1530643922861, "text": "We’re thrilled to receive such positive feedback regarding your Havertys purchase! Thank you for sharing your experience with Veronica and we hope you enjoy your new bedroom set."}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "112463621044795680947", "name": "Alexandria Wallace", "time": 1591501012217, "rating": 5.0, "text": "The saleswoman was very attentive to our needs", "pics": null, "resp": {"time": 1591569060779, "text": "Hello Alexandria, we appreciate you taking the time to leave us this feedback. Thank you, and have a fantastic day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "115193620877449153368", "name": "Bob Janes", "time": 1575485116939, "rating": 5.0, "text": "Personal service that exceeded our expectations.  Great selection.", "pics": null, "resp": {"time": 1575552060654, "text": "Bob, we're so glad that we were able to go above and beyond your expectations. Please don't hesitate to reach out if there's anything we can do for you. Take care."}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "111086570608036403494", "name": "Robert Ramige", "time": 1580766392341, "rating": 5.0, "text": "Great experience!  Sales guy (Scott, I think) was super.", "pics": null, "resp": {"time": 1580784782237, "text": "Robert, thank you for your kind review; we are happy to pass along your comments to the team here at Havertys Furniture! We look forward to your next visit! Take care!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "110953529227558424205", "name": "HARRIETT MORTON", "time": 1600555911494, "rating": 5.0, "text": "We had an awesome, amazing, salesperson", "pics": null, "resp": {"time": 1600614394317, "text": "Harriett, thank you for your kind review; we are happy to pass along your comments to the team here at Havertys Furniture! We're glad to hear we delivered such a great experience. If there's anything further we can do for you, we are happy to help!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "110550612515267310444", "name": "Anna Mills", "time": 1569857998246, "rating": 5.0, "text": "It was a great experience!\nEveryone in the store was more than helpful to answer my questions.", "pics": null, "resp": {"time": 1569870739839, "text": "Anna, we are so happy to read such a great review about Havertys Furniture! Please don't hesitate to reach out to us if there's anything more we can do!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "116204387051264662632", "name": "roy king", "time": 1602383363611, "rating": 5.0, "text": "salesperson was patient and remembered us from a couple weeks earlier", "pics": null, "resp": {"time": 1602396565781, "text": "Hi Roy, we are very happy to have provided you with such a positive experience! If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "101617221452865549374", "name": "Frank Fletcher", "time": 1592964772348, "rating": 5.0, "text": "Our salesman Darwin was a pleasure to do business with. We look forward to owning a quality Haverty’s bedroom set!!", "pics": null, "resp": {"time": 1592995222752, "text": "Frank, we're happy you found our staff to be so supportive during your experience here at Havertys Furniture. We're glad to hear we delivered such a great experience. If there's anything further we can do for you, we are happy to help!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "103793212367374939170", "name": "william rickert", "time": 1561947231626, "rating": 5.0, "text": "Sales lady very helpful and friendly and showed us exactly what we were looking for.", "pics": null, "resp": {"time": 1562101183184, "text": "Hello William, thank you for the positive feedback! Your satisfaction is our top priority so we are pleased to hear that you enjoyed your experience with us. We hope that you have a wonderful day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "116290730046841370291", "name": "LaRue Myatt", "time": 1563992225997, "rating": 5.0, "text": "They always have what I am looking for~ excellent service!!", "pics": null, "resp": {"time": 1563999015117, "text": "LaRue, we are glad we could help you out! If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "102094737451867678294", "name": "Teresa Smith", "time": 1606924269194, "rating": 5.0, "text": "Very impressed", "pics": null, "resp": {"time": 1606992755961, "text": "Hello Teresa, thank you for sharing your positive experience! We can't wait to see you again, have a great day. Take care!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "116919221774831807979", "name": "Brenda Chisholm", "time": 1551715737566, "rating": 5.0, "text": "Went in looking for a specfic cabinet but didn't find it however we did find a beautiful dining room set.  Tashayla was a big help in our decision to buy she was very helpful and informative.  We had to go home and measure our room to make sure we had enough room for dining set comfortably.  Upon reentering the store to make the purchase final Tashyla saw my husband an I and meet us and ask \"is it going to work for you?\"  We purchased and are excitedly awaiting our delivery on Wednesday.  It was a pleasure to do business with Havertys.", "pics": null, "resp": null, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "103956366064220538822", "name": "J Schleigh", "time": 1536065194125, "rating": 4.0, "text": "Nice people. Good service. Need better pricing for a Labor Day sale.", "pics": null, "resp": null, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "116761236899748739321", "name": "Angela Weaver", "time": 1552111782275, "rating": 1.0, "text": "After being charged $300 for delivery I was told that it wouldn't  be a problem to receive deliver of my furniture after 4:00 pm on Monday, after I got home from work, then found out that, that was not true when an automated system called to confirm the deliver between 9:00 am and 2:00 pm. After speaking with Darwin the salesman we had initial dealt with I was told it was because they only deliver to baldwin county on Mondays and that there was no way to say what exact time they would show up. So if you live anywhere in baldwin county or further I would definitely not suggest doing business with them. Also it seems like they will say whatever to make the sale and get you on the hook. $300 for delivery???? That's insane especially for the terrible service I have gotten with trying to nail down a time for delivery. For the price it is not worth the headache", "pics": null, "resp": {"time": 1552330556226, "text": "We are disappointed to hear that you did not have a more positive experience with us at Azalea Center. Our manager would really like to speak with you more regarding this matter. Please reach out to us at (251) 341-3349. We look forward to hearing from you."}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "110554426394073874115", "name": "Leo’s Tarot", "time": 1617144648267, "rating": 5.0, "text": "Your welcome", "pics": null, "resp": {"time": 1617161825388, "text": "Hi Taraneshia, we are glad we could help! We hope to see you soon!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "117642871058089655376", "name": "Denise Walker", "time": 1537815265762, "rating": 5.0, "text": "Veronica is a wonderful salesperson . They had a good variety of the furniture we were looking for, and the pricing was very competitive.", "pics": null, "resp": {"time": 1539717270949, "text": "Thank you again for taking the time to let us know how we did. We hope you have a great day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "106335089690957244093", "name": "Edward McMillian", "time": 1594742082123, "rating": 5.0, "text": "experienced, professional, sales person", "pics": null, "resp": {"time": 1594763094471, "text": "Edward, we're happy to hear you had such a positive experience with our team! We hope to be of service to you again in the future. \rBest wishes, \rHavertys Furniture"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "115153776962861425974", "name": "Stephanie Durkac", "time": 1531061817528, "rating": 5.0, "text": "Always a great experience when purchasing furniture from Havertys.  Great customer service and quality furniture.", "pics": null, "resp": {"time": 1531416404732, "text": "Thank you for your feedback regarding your visit to Havertys! We strive to give every customer a pleasant experience with excellent customer service and high-quality home furnishings."}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "104122438149852456773", "name": "Traclyn Dukes", "time": 1544836752827, "rating": 5.0, "text": "I received  the greatest  service ever  I will be shop there from now on", "pics": null, "resp": null, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "101333230237312343520", "name": "Machelle Odom", "time": 1534792198484, "rating": 5.0, "text": "Real elegant and nice comfortable furniture and it good quality for the money", "pics": null, "resp": {"time": 1534945468866, "text": "Hi Machelle, thank you so much for your positive comments about Havertys Furniture! We hope to see you soon!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "112025092747593403383", "name": "Clarice Hall-Black", "time": 1539037183098, "rating": 5.0, "text": "Not a review writer but Darwin is an excellent salesman.  Thanks so much for your help!", "pics": null, "resp": {"time": 1539715674040, "text": "We appreciate your positive review about your recent experience with us! We look forward to your next visit! Take care!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "105413691173078100571", "name": "Laura Stevens", "time": 1468029231356, "rating": 1.0, "text": "When spending thousands of dollars on furniture you would expect professional, reliable service. I was very disappointed with our store visit over the weekend dealing with a manager on duty who quoted us Havertys policies and procedures.\nNow our delivery is 4 hours late ( past the 3 hour window) I only found this out because I called to check the status of the delivery. I will be having my furniture delivered after 9pm (3:45- 5:45  was orginal time window) which is unexceptable! While on the phone with customer service I was quoted Havertys policies around delivery and promised a delivery time of 7:40 pm.  It is now 9pm and they still have not showed up and customer service is closed. If I could do over I would have spent our money elsewhere. What should have been a fun buying experience has been a stressful one.  I do not recommend Haverty's and will not be buying from this company again.", "pics": null, "resp": null, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "108443582797709190459", "name": "Sandra James", "time": 1570710394726, "rating": 5.0, "text": "Great customer experience!!!", "pics": null, "resp": {"time": 1570725758871, "text": "Sandra, we are delighted to hear that you had a great shopping experience with our team! Please don't hesitate to reach out if there's anything additional we can do for you."}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "109941125381961969330", "name": "John Steiner", "time": 1577453404686, "rating": 5.0, "text": "Great help", "pics": null, "resp": {"time": 1577459833029, "text": "Hi John, we're so happy we were able to help you out! We do hope we can be of assistance in the future. Take care!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "110443577205464968395", "name": "Porsche Wilson", "time": 1577899855711, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1577911939884, "text": "Thank you for taking the time to let us know how we did. Your wonderful feedback and rating mean a lot to us. We hope you have a great day!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "109013672470375818322", "name": "Joe Biancardi", "time": 1545714898242, "rating": 1.0, "text": "Wow. Really expensive.", "pics": null, "resp": null, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "109094879330312934780", "name": "Linda McDougald", "time": 1565722686352, "rating": 5.0, "text": "quick and easy", "pics": null, "resp": {"time": 1565725010663, "text": "Hello Linda, we're glad you enjoyed your visit with us! Please don't hesitate to reach out if there's anything more we can do. Take care!"}, "gmap_id": "0x889a4d4081fb112f:0xb2b909e96563da52"}
{"user_id": "107316714015095261686", "name": "John Drown", "time": 1624907638968, "rating": 5.0, "text": "Barry just delivered our new pool lounges in his 92\" truck.\n\nThat man looks like Kurt Russel, drives like Nic Cage and was as polite as I imagine Morgan Freeman to be.\n\nHe was the best part of this whole process.\n\nThank you Barry!", "pics": null, "resp": null, "gmap_id": "0x887d584139bee513:0x1fe7dbe570de3789"}
{"user_id": "111758642192475804925", "name": "Kaite Mccoy", "time": 1622646867703, "rating": 5.0, "text": "Great company with great customer service! They go above and beyond :)\nDaniel D. was  most helpful!", "pics": null, "resp": null, "gmap_id": "0x887d584139bee513:0x1fe7dbe570de3789"}
{"user_id": "100896267316732144863", "name": "Matthew Kleinman", "time": 1600452082238, "rating": 5.0, "text": "Nothing but great things to say! Purchased $16k worth of furniture this year. Everyone at Leisure Creations was outstanding from start to finish! Quality was great, shipping was fast! The Next time I buy exterior furniture Leisure Creations will be my first choice!", "pics": null, "resp": null, "gmap_id": "0x887d584139bee513:0x1fe7dbe570de3789"}
{"user_id": "118124641651323018131", "name": "The world Of Chelsea Ridge neighborhood friends", "time": 1600459513005, "rating": 5.0, "text": "Amazing, beautiful furniture. VERY happy. Our outdoor space looks amazing.", "pics": null, "resp": null, "gmap_id": "0x887d584139bee513:0x1fe7dbe570de3789"}
{"user_id": "109508951986140312719", "name": "Catherine Bauer", "time": 1602088081255, "rating": 5.0, "text": "I have placed multiple orders with Leisure Creations for various projects I'm working on and I have had great service each and every time!", "pics": null, "resp": null, "gmap_id": "0x887d584139bee513:0x1fe7dbe570de3789"}
{"user_id": "116787170073269126172", "name": "C. G. M (ThaTruthSeka)", "time": 1570064467954, "rating": 3.0, "text": "\"For Such Creative & Engineering Minds Of The Artist's Community, I'm Anxious To Unwrap The Truth...About The Uninviting Location 🤔.\"  The Resemblance Isn't Too Far From A Correctional Facility; Look-A-Like.  But, Hey They're Raking In That Dough.  Very Simple + Fashionable Designers.  Thanks Kindly For Contributing To Our Cool & Vibrant New Upgrades✌🏿.", "pics": null, "resp": null, "gmap_id": "0x887d584139bee513:0x1fe7dbe570de3789"}
{"user_id": "104379191276621234313", "name": "Courtneay Freeman", "time": 1600055743154, "rating": 5.0, "text": "Great to the trade manufacture of outdoor furniture!", "pics": null, "resp": null, "gmap_id": "0x887d584139bee513:0x1fe7dbe570de3789"}
{"user_id": "117789601665541928697", "name": "Daniel Dempsey", "time": 1599583959994, "rating": 5.0, "text": "Beautiful, durable products and great customer service!", "pics": null, "resp": null, "gmap_id": "0x887d584139bee513:0x1fe7dbe570de3789"}
