{"user_id": "117141040208212907602", "name": "Joseph Hay", "time": 1609217886969, "rating": 5.0, "text": "I'm biased because I know the manager. He's one of the most professional people I know  in this industry. Mingledorff's only hire Top notch people! That's what I see.", "pics": null, "resp": null, "gmap_id": "0x889a526e744915bf:0xbcdd3722d68a0e1f"}
{"user_id": "105041390646450834644", "name": "Joseph Miller", "time": 1623766483021, "rating": 4.0, "text": "Great staff.", "pics": null, "resp": null, "gmap_id": "0x889a526e744915bf:0xbcdd3722d68a0e1f"}
{"user_id": "108734878137702356534", "name": "Melissa Morrow", "time": 1616097414820, "rating": 1.0, "text": "The man unloading me was very rude I was the only truck there and it took over 4 hours to unload my truck", "pics": null, "resp": null, "gmap_id": "0x889a526e744915bf:0xbcdd3722d68a0e1f"}
{"user_id": "114428896252264206768", "name": "Wilson Lenidrik", "time": 1595362680430, "rating": 5.0, "text": "Nice place friendly service and clean and they unld", "pics": null, "resp": null, "gmap_id": "0x889a526e744915bf:0xbcdd3722d68a0e1f"}
{"user_id": "103398351011825865846", "name": "DEE AIR", "time": 1571848769035, "rating": 5.0, "text": "Great place for all ur ac needs", "pics": null, "resp": null, "gmap_id": "0x889a526e744915bf:0xbcdd3722d68a0e1f"}
{"user_id": "109231009761692786632", "name": "Phillip Clemens", "time": 1452031471579, "rating": 4.0, "text": "MoSt of the time excellent service", "pics": null, "resp": null, "gmap_id": "0x889a526e744915bf:0xbcdd3722d68a0e1f"}
{"user_id": "102491236042961764843", "name": "Gary Evans", "time": 1622667149493, "rating": 4.0, "text": "I don’t get the  bad reviews about this company in the past because my experience was nothing but positive. I needed some parts for repairing my dryer and those men at Washer and Refrigeration Supply at the Pelham location couldn’t be more helpful, friendly and courteous. Their price for the part was in line with what I found on-line and so I didn’t have to wait for days for the part.\nI didn’t give them 5 stars only because they didn’t have in stock another part I wanted. But as it turned out I was able to use that old part because they tested it out as still good.", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "108760089511502541841", "name": "Doug Cannon", "time": 1601331057258, "rating": 5.0, "text": "My son's washing machine stopped working.  Google told me it was most likely the drain pump, or possibly the lid switch so I called WRS and was going to buy both. Ray talked through the issue with me and advised to not buy the pump.  So I bought the lid switch and repaired the washer in about 10 minutes.  Very helpful and great service.\n\nRegarding the negative reviews - this is a parts supply company. There is zero chance that the people working there know everything about every appliance ever manufactured.  If they are having to look up your part number for you, you should probably call a repairman.", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "110852571980153445951", "name": "Gary Rush", "time": 1609282331358, "rating": 5.0, "text": "Visited twice, once for a washing machine actuator and second time for a dryer timer switch, both times were spot on. Older gentleman at the counter was very helpful, talked diagnostics and had a pleasant attitude.", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "106549904660832758593", "name": "Jessica Arevalo", "time": 1594663575597, "rating": 5.0, "text": "I had a washing machine emergency and called the location in Pelham. The older gentlemen had the part I needed in stock for my locking mechanism and explained it might not be that hard to fix it myself but said I could call if I had any problems bc they used to provide service themselves  and could refer to others who wouldn’t take advantage of a girl who doesn’t know any better. He was right, I fixed it myself! They were so kind in the store, had what I needed, and I will definitely go back. The older gentleman was extremely helpful and knowledgeable!", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "103121002003538669036", "name": "Mike Richardson", "time": 1586563242174, "rating": 5.0, "text": "The older gentleman running the place was professional and very helpful. Got exactly what I needed and at a good price. Great service, highly experienced appliance tech.", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "110146252500565999381", "name": "Tracey Evanko", "time": 1579663731102, "rating": 5.0, "text": "Very good helpful service.  The person at the counter explained how I should replace my stove element and I also purchased a case of ac filters.  Good service.", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "106059544895261414356", "name": "Byrdman Byrdman", "time": 1594606932388, "rating": 5.0, "text": "I went in told the salesman That I needed an igniter for my stove the day after Thanksgiving , he knew Exactly what I needed ,that was in 2017, the oven hasn't missed a beat yet. Thanks for all your help.", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "114336257337271706986", "name": "jtsewell", "time": 1562087553489, "rating": 1.0, "text": "I will NEVER spend a dime in this store. I don't know the older guy's name, but he definitely needs to adjust his attitude. Why would find my part, sit and stare at me, then finally say you didn't ring me up because I was on the phone? What kind of self righteous BS is that?! Or maybe it's because my skin is too dark.", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "100501707910883439866", "name": "Vern Skinner", "time": 1506114822918, "rating": 5.0, "text": "The manager will help you in any way that he possibly can. He goes above and beyond what his job requires him to do. Awesome customer service.", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "103975951450473080635", "name": "Rob Ramsay", "time": 1473194796546, "rating": 1.0, "text": "Asked them for filter springs, a common part for most range hoods.  Said he didn't have a clue what I was talking about and I had to have the model number.  Found the part on the web in 30 seconds and I don't do this for a living.  If you don't know your products, how can you service them.  I tried to stay local but who needs this kind of service.", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "107253215794354219666", "name": "Rod Peeks", "time": 1543614013500, "rating": 5.0, "text": "I almost always get the part I need; and always get helpful advice from Jim. Great place to shop for appliance issues.", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "117137681780192110269", "name": "Geoff Morgan", "time": 1479850783889, "rating": 1.0, "text": "I have read the negative reviews of this company and I feel I must comment on the troubles people have had.  I have been doing retail business with Washer and Refrigeration Supply for at least 40 years. Firstly, Washer and Refrigeration Supply is basically a wholesale only company.  They do not have any patience with DYI customers.  Since they are about the only game in town, they can treat folks about anyway they care to.  They treat their trade customers entirely differently.  I don't know why they even bother with the retail side of the business; I can only guess since they charge the absolute maximum for retail parts, profit must be the reason.  Here is the best way to approach this vendor (provide you need the part immediately and cannot get it on line) - 1.)Make sure you can handle the repair you are trying to accomplish.  2.)Always, repeat, always, take your old part with you and have them check it with the new part, let them open the package.  If they become surly or refuse to compare parts, just leave with your old part and go on line or call an appliance service and buy the part from them.  A lot of services (not all) will do this.  It will cost you more, but the part will be correct and you will not have to deal with the ugly side of WRS. 3.)Always pay with a credit card so if you truly feel (after following the advice hereon) that they have screwed you, file a complaint with the credit card company.  Lastly, buy on line when possible; this company is a survivor because they are ruthless and they are not going to change.", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "108248841782038364095", "name": "Matthew Morris", "time": 1368828342337, "rating": 5.0, "text": "BEST COMPANY TO USE EVER,  I have used these guys for over 20 years, always get the right parts and advice....no better place for the professional to get his parts....\n\nMorris Estates Mobile Home Park", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "110840549735665653548", "name": "Mike Zamani", "time": 1530236712640, "rating": 5.0, "text": "Very helpful folks. Always nice.", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "111257060364506042868", "name": "Paul Rogers", "time": 1499291368601, "rating": 4.0, "text": "Very convenient and the guys who work here are very experienced and willing to offer helpful suggestions.", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "101315393837054701444", "name": "Chris Franck", "time": 1479751989657, "rating": 5.0, "text": "Had just the part I needed to get my oven running.\nHelpful and friendly staff.\nThese are the days of our lives...", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "107127628401416446728", "name": "Larry Toups", "time": 1483734816670, "rating": 5.0, "text": "Needed parts and some advise on fixing a refrigerator and the gentlemen was extremely helpful and both visits.", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "114855227864447308424", "name": "MIKE R", "time": 1448658724766, "rating": 1.0, "text": "PURCHASED HEATING ELEMENT FOR $68 FROM WASHER & REFRIGERATION ONLY TO FIND AFTER CHECKING EXACT ELEMENT WAS SOLD ON SEVERAL WEB SITES AT $18 WITH FREE SHIPPING. MAJOR LEAGUE RIP OFF !!!", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "109850869075785759894", "name": "KiKi Williams", "time": 1523288416423, "rating": 1.0, "text": "I called in for pricing on a part, the MANAGER was very rude! His demeanor over the phone expressed as if I was wasting his time. He was very unprofessional and not setting a great example for his employees. Taking my green money else where", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "112178774441918129635", "name": "Jeannette Claborn", "time": 1448920288016, "rating": 1.0, "text": "DO NOT USE THIS COMPANY!!!! They sold us a bad part only to find out that it was not a working part.  When we asked for our money back they said that they would not refund us.  $75 down the drain because these jokers have no idea how to run a business.  If you sell parts at least stand behind them and do the right thing.  PLEASE TELL ALL YOUR FRIENDS NOT TO SHOP HERE!  Not deserving of business.  and judging by the other reviews I'm not alone!", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "107981341697804340078", "name": "jbark227", "time": 1570884636346, "rating": 5.0, "text": "They have always helped me out! I’ve been back 4 or 5 times so far.", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "111466616486777923420", "name": "Katy Freeman", "time": 1517869342294, "rating": 5.0, "text": "Jimmy is the nicest, most helpful person ever.\nWe will never go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "116469702116464188233", "name": "james claborn", "time": 1448921604204, "rating": 1.0, "text": "these guys are thieves!  they apparently rely on misleading and swindling people in order to survive!  if you're a licensed repair person and you buy from this company, shame on you!  dishonest, lowdown, cheap, sleazy and worthless.  unfortunately i cannot leave a zero star review.", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "105547071241703647051", "name": "Drew Cottrell", "time": 1490545391142, "rating": 4.0, "text": "Good washers, good refridgeration, thanks papa!", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "111348841431703861345", "name": "Irish Allred", "time": 1519268374725, "rating": 5.0, "text": "Best family owned business in Birmingham", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "117717679048063845741", "name": "Ryan Smith", "time": 1402497444494, "rating": 1.0, "text": "Bought an electronic part for my dryer that they looked up for me. Turned out to be the wrong part. They refused to take it back saying that I shouldn't have tried to install it. I found a new source for parts.", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "116475963081865219229", "name": "andrew white", "time": 1522797868787, "rating": 5.0, "text": "Great place for parts", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "109607487141074901369", "name": "Kirk Walker", "time": 1488066988422, "rating": 5.0, "text": "They have the parts you need in stock!", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "112640917545549843650", "name": "Mark Andrews", "time": 1487629657995, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x88893d4e282eb02b:0xc0f254926f26d6d9"}
{"user_id": "105205185906170463518", "name": "Ben Myers", "time": 1621695532357, "rating": 5.0, "text": "I built a small garage and needed a Heat and Air unit for it.  I decided on a Mitsubishi mini split system and called about 5 dealers in my area.  Not only was Shane the most knowledgeable about them he by far had the best price.  He was very professional along with his staff.  Lyn was always pleasant to speak to when calling the office.  His crew was very fast and did a great job installing my unit.  I thought I needed a 18,000 BTU unit and Shane assured me that a 12,000 BTU unit would be sufficient. He was correct, this thing cools my garage in no time and is very quiet.  Knowing that I had a Mitsubishi Diamond dealer install my unit and getting a 12 year warranty gives me a great peace of mind.  My hat is off to Southeastern Mechanical Service.  I highly recommend them.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOm-Hl4uZkzWRGbT4eQqA5tUag_sdT-GrRywzfS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNlQ9299c92bfFhUS7g36FlFXXC9HGNi4_qNZI1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMgr12K4lcmoLqr0Nb8xnhjKjrHwGcMXoQW_M2z=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "102004751108700040817", "name": "Isaiah Folds", "time": 1623970679224, "rating": 5.0, "text": "he fixed my air conditioning for great price and good attitude. 👍👍👍👍👍 highly recommended using sms.", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "107115242706815514544", "name": "Lyn Nelson", "time": 1621696357137, "rating": 5.0, "text": "I would highly recommend SMS..Knowledgable & Friendly😊", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "107481565948627552362", "name": "David Champlin", "time": 1616083853627, "rating": 5.0, "text": "Shane and his crew do a great job keeping all my equipment running.", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "109523490759576701203", "name": "Darrin Jones", "time": 1595625376780, "rating": 5.0, "text": "Lyn and Shane andtechnician Joe have all been awesome to work with. I have rental properties in North Alabama and would never use ANYONE ELSE. They are quick, professional and fair. They are the Mitsubishi mini split pros of the Tennessee Valley. You will be treated like the best customer and in service related work, that is hard to find. Real ¨Golden Rule¨ work ethics and genuinely nice people.", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "114375324532971089643", "name": "Jeremy Cannon", "time": 1572743920732, "rating": 5.0, "text": "Great Service!!! Would give more than 5-stars if I could. Our technician, Joe, was very knowledgeable about both units that we have for our two story home in Decatur. He was very thorough in his diagnosis and changed the flame sensor that was in need of replacing. He checked every piece in our furnace, including the heat exchange pipes, to make sure everything else was in good working order. No other technician that we have had before has checked this (there was a 4x4 mounted in the way of the blower coming out). Came back when another problem arose the next day and fixed that as well.", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "102129691097345111744", "name": "Pro Home Inspection Services", "time": 1583357951915, "rating": 5.0, "text": "Great company with friendly service. Thank you guyss. Keep up the good work.", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "116455873606863464174", "name": "David Hood", "time": 1562761182419, "rating": 5.0, "text": "Great professional job. Explain the workings of the thermostat so even I could understand. Best price around. Will be glad to do business with again if I need it. Would recommend them to everyone.", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "117956274497415662161", "name": "Susan Mayes", "time": 1556748887704, "rating": 5.0, "text": "Helpful staff, friendly professional service. Joe was very nice and professional and got my air conditioning fixed thoroughly and quickly. Price was very reasonable and more than competitive with other companies. Highly Recommend!", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "103945647035488721853", "name": "Mike Giles", "time": 1557527395073, "rating": 5.0, "text": "Our AC was not keeping up with the rising temps this summer.  We were afraid we might need to replace the units outside our house.  On a neighbors recommendation we called SMS out to look at our equipment.  They were able to find that the condenser was just dirty and that it was a couple pounds low on freon.  They had us up and running and cooled off in a couple hours.  Great, friendly techs.  Would happily recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "112705558053922094798", "name": "Frank S.", "time": 1562691263381, "rating": 5.0, "text": "Shane and SMS are the best! So friendly and knowledgeable. I highly recommend them to anyone in Decatur Al or beyond.", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "112214656013239296047", "name": "Carrie Eddy", "time": 1529087805447, "rating": 5.0, "text": "Shane was a pleasure to work with. He worked very hard to meet our needs and get us the best possible unit for our budget. He worked us into his packed schedule and got our new air conditioner unit installed right before one of the hottest weeks of the season. We have never experienced such a comfortable climate in our house! We are actually looking forward to our upstairs unit replacement so we can use them again.", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "105666832456153426902", "name": "Renee Runge", "time": 1544875015909, "rating": 5.0, "text": "Got someone out to me in a timely manner, that was able to diagnose and fix my problem quickly. Everyone I interacted with was friendly and willing to work with my unusual schedule. Would definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "114598986637830648595", "name": "Elizabeth Powell", "time": 1431109297709, "rating": 5.0, "text": "These guys were great! I called Monday morning around 9 and they were there by 11:30. They called me to let me know they were on their way. They were very professional and very nice. The technicians got the air conditioner serviced and cleaned for a very reasonable price. I will use them from now on for all my Air conditioning, heating problems. Thanks for being so prompt and efficient!", "pics": null, "resp": {"time": 1433263688951, "text": "We are glad we could be of service to you. Please let us know if you have any questions."}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "114617694912363566830", "name": "Hollie Blackwood", "time": 1562713935980, "rating": 5.0, "text": "Shane & the guys at SMS are who we call anytime we have a heating/cooling issue. They are our hvac company! Fair and consistent", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "109749150738824252751", "name": "Deena Youngblood", "time": 1471277591070, "rating": 5.0, "text": "I found this company via Goggle.  I called them at 7:30 am and by 8:03 am the service tech was at my house.  Justin and Matt were so very respectful of me and my home.  These two men were determined to find the root cause of my AC problem.  They were proud to tell me it was a simple fix and i was back up and cool within an hour or so.  To the owner Jason......you should be very proud to have these two guys representing your company.  I will recommend you to everyone I know.", "pics": null, "resp": {"time": 1507909898010, "text": "Thanks for giving us a chance! Let us know if you have any questions!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "113003527863865876233", "name": "Jeannie Li", "time": 1499703197991, "rating": 5.0, "text": "Shane gave me the best price out of all of the local companies that I called.  Their service was great. I am very happy with my AC.  I would use this company again.", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "100966418368636274480", "name": "Teresa J.", "time": 1529026204701, "rating": 5.0, "text": "Great service! Called them for my mom's home. Had problem with unit not cutting off. They came out and fixed it quickly. She is enjoying the cool now! Thank you", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "111172499732323185017", "name": "Carol Foster", "time": 1526559024604, "rating": 4.0, "text": "My A/C went out on Mother's Day. Called Monday morning and a repair tech was at my house before lunch time. The only reason I'm not giving 5 stars is because it took two trips to get the problem fixed. I know this is a very busy time of year so I was just glad to get same day service. The techs who came to my house seemed to be knowledgeable, got right to work, were very nice and were people I felt comfortable having in my house. The lady (sorry I'm terrible with names) in the office scheduling appointments was very helpful and friendly. I will use Southeastern Mechanical in the future.", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "100677089436490491884", "name": "Abe Meysenburg", "time": 1561498920610, "rating": 5.0, "text": "We moved to Madison 10 months ago from Washington State, so dealing with HVAC is very new to us.  Our AC unit was making a strange noise, and our real estate agent recommended SMS to us.  We had a great experience. I spoke with Lynn in the office, and she did an outstanding job of working with our schedule to find a time that worked well.  Our technician, Joe, was very informative and helpful.  He instructed me on how to maintain our unit, and provided the most affordable solution possible for our problem.  I can't recommend SMS highly enough!", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "112483569988809482496", "name": "OneAndOnly Bama", "time": 1473738696992, "rating": 5.0, "text": "I am a disabled veteran who had an accident and broke my left femur and left wrist in February, so I was out of work in July my Central unit went out I was frantic on what to do to keep my 3 young kids cool, cause I didn't have the money to fix, next thing I know Shane and his wife contact me and send an employee out to fix it free of charge, unfortunately the old unit wasn't fixable, then Shane tried to help me locate a used unit or funds for a new unit, unfortunately we couldn't do either. But he spent his money on the parts that they tried to fix the old one with, he paid his employee to try and fix it, then spent his time trying to help me get a new one. I am very grateful for all he did for me and would recommend this company to anyone. Thank you again Shane and God Bless You", "pics": null, "resp": {"time": 1507909954439, "text": "Hope your doing well. We just wanted to thank you for using our services!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "104832445777980722390", "name": "Joe Steelman", "time": 1534575850963, "rating": 5.0, "text": "Professional service and friendly attitude. SMS has always taken care of my air conditioning and always will. Thanks to everyone there!", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "100481810202028099448", "name": "Jamie Andrews", "time": 1536110943538, "rating": 5.0, "text": "This is a top notch company with awesome employees. Very trustworthy and knowledgeable. Shane, Justin and the guys are super!", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "106698762619100442657", "name": "Americ Rentals", "time": 1410882254170, "rating": 5.0, "text": "Shane and his team did a fabulous job for us, and we will be using him again as the need arises. Shane's crew is very knowledgeable as well as thorough.  We recommend SMS to all of our business associates as well as our friends and family.", "pics": null, "resp": {"time": 1416594724082, "text": "We appreciate all your feedback. Thanks for your business!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "115983683019052853428", "name": "Erin Plummer", "time": 1543509919424, "rating": 5.0, "text": "Great service! The service man, Joe, came out within 3 hours of calling for HVAC repair. Great price! Would definitely use them again. Erin Plummer", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "106954894525812065977", "name": "Vicki Walters", "time": 1527785543445, "rating": 5.0, "text": "Joe arrived early, was very informative, very polite and friendly.  He did a great job cleaning and checking the temperatures of our AC units.  Thank you, Joe.", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "110250200342462486106", "name": "Christopher Martin", "time": 1409247556410, "rating": 5.0, "text": "My brother needed some a/c repair work done in Decatur Al and I volunteered to find someone. I called SMS and they were great and very helpful. Free estimate was a great idea. We hired them a week ago and the air conditioning unit was repaired in a couple of days.", "pics": null, "resp": {"time": 1409253852907, "text": "Thanks for using our services Chris!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "116274610720975466823", "name": "James Kennedy", "time": 1596056741004, "rating": 5.0, "text": "Always a great experience with all of the crew members at SMS when you make that call for any kind of services they offer. Today it was A/C repair and a service on our units with Joe being our professional technician who did an awesome job on the work at hand and the explanation as to what was happening with the unit. Keep up the great work SMS you guys have our referral no doubt!", "pics": null, "resp": {"time": 1607019514286, "text": "Thank you James!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "108128186432060272925", "name": "Jason Lack", "time": 1521143402062, "rating": 5.0, "text": "Fast, prompt, professional service! Fair prices and quality work! Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "116132317813196572139", "name": "Shelia Power", "time": 1473816515924, "rating": 5.0, "text": "Shane is a very good person to work with. I highly recommend him and Southeastern Mechanical Services. He is very knowledgeable and knows how to get the job done. Definitely service with a smile!", "pics": null, "resp": {"time": 1495559932741, "text": "Thanks for doing business with us. Let us know if you have any other questions!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "102297281857901801288", "name": "Kimberly Campbell", "time": 1504370022222, "rating": 5.0, "text": "Awesome job!  I refer them to everyone.  Every time I have needed work done they are quick to arrive and very efficient!  I wouldn't do business with anyone else.", "pics": null, "resp": {"time": 1505407033927, "text": "I am glad we did a good job. Let us know if you have any questions!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "117487903650720791563", "name": "Amanda Jones", "time": 1529456476666, "rating": 5.0, "text": "After calling around to several different places, and getting no where, we decided to call Southeastern Machanical, and they were just awesome. Lynn, in the office had answers and rates for me by the end of the day, and we had an appointment on the books. Joe, the guy that came out to look at it, did an amazing job and was very helpful with tips on how to upkeep our system, to avoid this situation again. We will definitely be using them in the future, for all of our HVAC needs!", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "117466996670989312959", "name": "Alan Sims", "time": 1539873709144, "rating": 5.0, "text": "Highly recommend SMS. They have a friendly staff. The service technician Joe was helpful and very knowledgeable. He explained what he was going to do and gave me an estimate that was affordable for the work he did. The next time I need HVAC work done I’ll be calling SMS.", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "102948201565206804427", "name": "Shelia Hood", "time": 1562702682851, "rating": 5.0, "text": "Friendly, quick with repairs. Very courteous workers.", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "115796792581902413156", "name": "Sara Shell", "time": 1543336526883, "rating": 5.0, "text": "Big shout out to SMS and Joe! We we're freezing here at Rent A Center in Decatur and they fixed us right up.  Will definitely recommend SMS to all of our North Alabama locations. Thanks 😁", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "113173425174772705449", "name": "Misty Lemmond", "time": 1409327685249, "rating": 5.0, "text": "My Mom called me last Sunday sounding rather stressed. It had been an extremely hot day, with heat indexes up to 107 degrees. Her A/C unit had stopped working! She asked if the good folks at SMS would be able to help on a Sunday evening. I told her to hold on while I contacted them. Bless their hearts, without any complaint, they said they could get someone out there ASAP. And sure enough, they did! The work was very inexpensive and the kindness was just overwhelming. These guys will work with you! Give them a call! :-)", "pics": null, "resp": {"time": 1410454409124, "text": "We are glad we could assist you with your air conditioning repair needs!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "108299334770103614293", "name": "mickey nelson", "time": 1508786854238, "rating": 5.0, "text": "Great service, great company!!! Very knowledgeable and respectful service technicians. Highly recommend using these guys, will definitely use them again.", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "109617925760603435828", "name": "Charles Cramer", "time": 1453630429791, "rating": 5.0, "text": "So far so good. These guys have given me great customer service from the moment I contacted them with questions about my old system through a couple of hiccups I have had with my new system. For a guy that has trust issues with contractors, these guys have made me feel comfortable that they can be trusted to do the job right.", "pics": null, "resp": {"time": 1453913693506, "text": "We are glad we could take care of your concerns. If anything every comes up, do not hesitate to call!\n-SMS team"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "111182373315993221521", "name": "Jane", "time": 1502406637004, "rating": 5.0, "text": "Called on August 9, 2017 with an AC problem. They were very prompt to take care of my problem.  The service man, Joe was very courteous and helpful.  Turns out I only needed a new fuse. Even so, he checked out everything for me (inside, outside unit, and upstairs unit) and only charged me a service call. I would highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "107878752856087800208", "name": "Ben Eubanks", "time": 1483708864897, "rating": 5.0, "text": "We've used SMS since we got a free tuneup at a charity auction a few years ago. The team has done great work on our home and I wouldn't consider going anywhere else for routine maintenance. We had an AC unit quit last summer and someone was working on it within just a few hours.\n\nIn addition, last summer I needed a ductless system put in for a remodel and got three quotes. The SMS crew was the least expensive and the most responsive. As soon as I had the budget ready they were out working within a day or two. Shane and his crew are phenomenal.", "pics": null, "resp": {"time": 1495559816832, "text": "Thanks for taking your business to us. We hope the system is running great!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "104968034084567392934", "name": "Dustin Griffin", "time": 1454967947608, "rating": 5.0, "text": "These guys are friendly and did a quality job. Very pleased with there work. Would recommend them to anyone in need of A/C repair or A/C replacement!  Thank you so much SMS!", "pics": null, "resp": {"time": 1455728642330, "text": "Thanks Dustin! We are glad we were there for you. Let us know if you have any questions."}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "100539966907664305688", "name": "Ginger Stephenson", "time": 1409325036764, "rating": 5.0, "text": "I work in the service industry and know what it means to have good, knowledgeable, honest and prompt employees.  SMS has this in their techs.  They serviced the A/C at my mother's home as well as at my office.  I will use them again and will continue to recommend them to my friends and family.", "pics": null, "resp": {"time": 1410454446933, "text": "Thanks for the feedback.. we are glad you had a positive experience with us!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "112755220094516038006", "name": "Bo Ozbolt", "time": 1473080517098, "rating": 5.0, "text": "Great experience with Shane and Justin. Could not ask for better service through the process of our unit going out until it was replaced. I highly recommend SMS!!", "pics": null, "resp": {"time": 1507909941798, "text": "Hope your doing well. We just wanted to thank you for using our services!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "107275536650190030237", "name": "Mary Phillips", "time": 1508185041305, "rating": 5.0, "text": "SMS  you are the best I have ever seen.Joe and Mike was perfect Gentleman. I give them A Plus Grade.I definitely will recommend them to my friends and family!!", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "100065725890806489561", "name": "Brian Dutton", "time": 1534468315110, "rating": 5.0, "text": "Air conditioner has been acting up for a few weeks. Did a preventive maintenance on Sunday.. cleaning coils, filters, etc.. . Woke up Monday and had worse issues, Outside unit was froze! Called SMS Monday and they had a technician (Joe) at my house at 11am. I was with Joe thru the whole process. He explained in detail my problems and answered all my questions. This review is 3 days after they came out and the air conditioner is performing better than ever.  Joe gave me a refrigerator magnet and I put it on my refrigerator. I will definitely call SMS in the future and will definitely refer them to anyone I know that's having hvac problems. 5 stars +.. if you're having problems and see this review, I'm 100% honest! This company will not let you down! I dont write reviews typically but I'm overly satisfied with the service and cost of SMS!", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "110127279248082384878", "name": "Ashley Richardson", "time": 1514467893329, "rating": 5.0, "text": "I couldn't be happier with the service. The Tech (Joe) arrived at the stated time and was very knowledgeable. Diagnosed my problem and had me fixed up in short time. Thank you SMS!", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "104327915576030696005", "name": "Jennifer Burrell", "time": 1497459009198, "rating": 5.0, "text": "Fast and great service! Shane is knowledgeable at what he does! SMS is highly recommended and 10 stars in my book!", "pics": null, "resp": {"time": 1498232850723, "text": "Let us know if you have any other questions or needs! Thanks for your business!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "100871900382415954045", "name": "Brenda Greer", "time": 1500950855537, "rating": 5.0, "text": "Wonderful customer service.  Quick response. Definitely recommend!!", "pics": null, "resp": {"time": 1505407095095, "text": "Thank you!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "105702319323188829417", "name": "Chiquitta McBrayer", "time": 1509040095032, "rating": 5.0, "text": "This company is absolutely incredible. Shane, Joe, Justin and Lynn have been such a huge help to me at my house and my grandmothers. We tried Valley Heating and Cooling and they were HORRID....i recommend SMS anyday.", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "103764548354029680718", "name": "Kathy McWhirter", "time": 1497976026854, "rating": 5.0, "text": "After being devastated by Valley Heating & Cooling not honoring \"their warranty\" on a 99 year compressor warranty... SMS came to our rescue!\nThe guys came early the very next morning and we were up and running within hours!\nI almost forgot... they did all this for $ MUCH LESS $ than I was quoted by Valley!\n\nThank you Shane for your care, concern and quick response to our problem. Your guys were here before the anticipated time and were very professional and courteous - I couldn't have felt more comfortable with them here!\nSMS will forever be our first call!", "pics": null, "resp": {"time": 1498232887897, "text": "We will be there for you! Thanks for your business!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "100078374297663743459", "name": "Debbie Killen", "time": 1440103668301, "rating": 5.0, "text": "They were very helpful and polite. They came out very soon after being called and fixed our a/c unit. I would recommend them to anyone.", "pics": null, "resp": {"time": 1441043475485, "text": "We are glad we could help! Thanks for the review!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "115981313106955572678", "name": "Andrew Chancellor", "time": 1440438070943, "rating": 5.0, "text": "Great service, quick and very reasonably priced.  The only call you'll need for all your HVAC needs!\n\nI called these guys up a few weeks ago late in the afternoon because my Air Conditioner wasn't cooling very efficiently and sometimes not at all.  I figured the worst because my A/C unit was about 20 years old and that I was going to have to drop $8,000 into a new unit.  I called them up and they said they'd have a guy out there first thing the next morning!\n\nTheir technician showed up before 9:00AM and began diagnosing my HVAC system.  In a couple hours he had gone through the cooling system from top to bottom and performed their Preventative Maintenance service on my A/C unit and it was cooling as if it were brand new.  The tech was very polite and thorough in diagnosing the issue and did an excellent job answering all my questions.  We talked a little bit about the cost of replacing the unit and what he would recommend but in no way was trying to push a sale on me.\n\nThe price for the service he performed was well below what I was expecting to pay.  These guys have certainly outdone themselves in this industry and they will be my sole source for all my HVAC needs.  I highly recommend them!", "pics": null, "resp": {"time": 1441043584557, "text": "Thank you Andrew. It makes us feel good to know people trust and respect our work. Let us know if you have any other questions or concerns."}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "107688599018787621823", "name": "David Bernstein", "time": 1412894332479, "rating": 5.0, "text": "My uncle used these guys and they came out the next day and took care of his air conditioning unit issue the same day! Great HVAC service!", "pics": null, "resp": {"time": 1416594762001, "text": "We are so glad it all worked out for your uncle. Let us know if you have any questions."}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "112548274553407820529", "name": "David Morgan", "time": 1501871966627, "rating": 5.0, "text": "After losing air conditioning Thursday afternoon I called Southeastern Mechanical Services and the technicians were on site at the scheduled time on Friday morning and in about a hour my system was up and running. The technicians were courteous and very knowledgeable of my system so I would  highly recommend this company .", "pics": null, "resp": {"time": 1505407080527, "text": "We are glad we got you back up and running! It's not fun to be without AC!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "105084361094192124314", "name": "Mikey Tanner", "time": 1498177896213, "rating": 5.0, "text": "Awesome business owner with great ethical morals! Recommend this company to anyone!", "pics": null, "resp": {"time": 1498232920651, "text": "We pride ourselves on our honest business practices! We're glad we could be there for you! Thanks for your business!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "117834373916716645666", "name": "Alan Henderson", "time": 1607037236985, "rating": 5.0, "text": "Complete system installation", "pics": null, "resp": {"time": 1615327050664, "text": "Thanks for trusting us with your system!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "106496974621594631862", "name": "Eric Reid", "time": 1493629687170, "rating": 5.0, "text": "Expert technical staff and customer support. Quickly diagnosed and resolved the problems. Very pleased customer here!", "pics": null, "resp": {"time": 1495559728966, "text": "Thanks for taking the time to review us. please let us know if you need anything else!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "114866070781153392356", "name": "Carla Johnson", "time": 1477853169868, "rating": 5.0, "text": "SMS provided prompt and expert service.  I had called another company for a second opinion and they diagnosed a different and very expensive problem.  When I told their tech what the SMS tech had diagnosed, he suddenly changed his diagnosis without doing any additional tests.  The SMS technician explained why that couldn't be the problem, explained what the gauges were showing him and fixed the correct problem with the unit.  And it did cost less. Thanks for being honest and professional.", "pics": null, "resp": {"time": 1495559856919, "text": "We pride ourselves on being honest.. we are glad everything worked out for you!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "103631249654839164205", "name": "Cari King", "time": 1416595085937, "rating": 5.0, "text": "Great Service - Friendly, professional and personable staff.", "pics": null, "resp": {"time": 1424102921583, "text": "Thanks Carl, glad we could be of service to you!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "106407257270833375783", "name": "billy campbell", "time": 1504371192356, "rating": 5.0, "text": "We had a service on our unit yesterday our unit was blowing hot air and when they got here had our air fixed in no time would recommend them to anyone and great on prices as well thanks sms for all u do", "pics": null, "resp": {"time": 1505406999186, "text": "Thanks for choosing us! It means a lot to us."}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "116181134418623481261", "name": "Justin Cobb", "time": 1497019814855, "rating": 5.0, "text": "Great company, great service and will use them again.Service tech was awesome!", "pics": null, "resp": {"time": 1498232806155, "text": "We're glad we could be there for you! Thanks for your business!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "116348885113617456012", "name": "larissa melcher", "time": 1474906509186, "rating": 5.0, "text": "Thank you! Fast service, excellent communication, professional agent, reasonable pricing.Great Job SMS.. Thanks again", "pics": null, "resp": {"time": 1495559885722, "text": "No, thank you for your business :)"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "109220279307142399933", "name": "BlacKnight 1", "time": 1461855832247, "rating": 5.0, "text": "Great HVAC company! The owner, Shane, is very personable and the kind of guy you can trust with your door unlocked. Opie (dead ringer for a younger Ron Howard), his technician, is a relatively young guy (23), but mature beyond his years and a very good HVAC tech. He's also trustworthy and the kind of guy you would want to represent your company. Most importantly, he was able to diagnose my heat pump problem quickly and efficiently...10 to 15 minutes. The HVAC was over amped.\n\nThe company that installed my TRANE XL14 heat pump in 2007, Alabama Climate Control (ACC) of Huntsville, apparently did not notice that the heat pump was rated for max amperage of 40 amps because they did not bother to change the 50 amp circuit breaker in the panel in the garage. One would expect a professional HVAC company to do a basic electrical circuit check/test to ensure the electrical circuit is compatible with your NEW heat pump...right!?!?\n\nAnyway, this oversight by ACC resulted in a fried circuit breaker in the junction box at the heat pump. Opie said we were lucky this situation did not result in a burned up motor or worse a burned down house. After all that, Opie tried to give me a $25 discount because I'm a veteran.\n\nThank you for the sentiment Opie, but also thank you for identifying a problem that has caused me great anguish over the years. I had to replace 3 or 4 compressors on the original heat pump (a Rheem) about 15 years ago when we first started renting out the house.\n\nThe HVAC company (same ACC) kept replacing all those compressors under warranty at $250 to $300 a pop for labor, but just couldn't figure out what was causing all those compressors to burn up (the same 50 amp circuit breaker in the breaker box). Then, I was dumb enough to hire them again to install a new TRANE in 2007. Remeber, the TRANE is rated for a maximum of 40 amps, but ACC left the same old 50 amp circuit breaker in the breaker panel. Voila...we get a fried junction box this time.\n\nIncredible...that it took a young 23 year old tech with a lot less experience (but more common sense and intelligence) to recognize that a 50 amp circuit breaker is going to eventually cause some problems if it is not compatible with the rest of the circuit.\n\nThe cautionary tale here is...be extremely vigilant and careful about who you let work on your electrical systems and watch them like a hawk when they do...until you find a company like SMS that has techs like Opie.. Thank you SMS and Opie for saving my house from a potential fire.", "pics": null, "resp": {"time": 1462206716420, "text": "Thanks Dwight! We are very happy we could take care of your heat pump needs! Thanks for the great review! Please call us anytime if you have questions."}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "111348303193217699483", "name": "Joelubisco@gmail.com Lubisco", "time": 1445415731692, "rating": 5.0, "text": "Shane and team that you so much for fixing our air conditioning.  Great Job.", "pics": null, "resp": {"time": 1446747368924, "text": "We are glad we had the opportunity to take care of your AC issue."}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "112288867397054591227", "name": "Davina Hood", "time": 1427935480775, "rating": 5.0, "text": "Super fast on getting my rental home a/c repaired! Thanks SMS!!!", "pics": null, "resp": {"time": 1433263757122, "text": "Taken care of our customers in a timely manner is a huge deal for us. We are glad we could be there for you."}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "115566181599357499038", "name": "Steve Phillips", "time": 1499312991458, "rating": 5.0, "text": "Great service simply the best in North Alabama.", "pics": null, "resp": {"time": 1433263646983, "text": "Thanks Steve. We appreciate your business and trust!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "102370754618967215470", "name": "Santosh Dhakal", "time": 1499352620054, "rating": 5.0, "text": "It's great work", "pics": null, "resp": null, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
{"user_id": "115344855696527799862", "name": "Shirley Moore", "time": 1473755480717, "rating": 5.0, "text": "Just the best", "pics": null, "resp": {"time": 1507909964379, "text": "Hope your doing well. We just wanted to thank you for using our services!"}, "gmap_id": "0x88627f1418aecb37:0x7f8ad798412106f7"}
