{"user_id": "106115586934622903096", "name": "Mary Joyce", "time": 1386436213012, "rating": 1.0, "text": "Extreme vulgarity - authorities were notified.", "pics": null, "resp": null, "gmap_id": "0x88892e23239cb527:0xef96333277ac9a4f"}
{"user_id": "101185654149701281555", "name": "Heather B", "time": 1566914666087, "rating": 5.0, "text": "Bought a full size set for a good price", "pics": null, "resp": null, "gmap_id": "0x88860205a30f479f:0xa9468bcca2abef97"}
{"user_id": "105439697613718313343", "name": "Shawn Williams", "time": 1579225605421, "rating": 5.0, "text": "Great deals & friendly owner", "pics": null, "resp": null, "gmap_id": "0x88860205a30f479f:0xa9468bcca2abef97"}
{"user_id": "105930105211749865910", "name": "V Moore", "time": 1552076860975, "rating": 5.0, "text": "If you are in the market for a new mattress go see Chris Hinson.", "pics": null, "resp": null, "gmap_id": "0x88860205a30f479f:0xa9468bcca2abef97"}
{"user_id": "112692213239054162019", "name": "Adam Westbrook", "time": 1558495037142, "rating": 5.0, "text": "Great prices Chris is awesome", "pics": null, "resp": null, "gmap_id": "0x88860205a30f479f:0xa9468bcca2abef97"}
{"user_id": "109404117049577750060", "name": "Libby Hosmer", "time": 1566411043955, "rating": 1.0, "text": "MAN IS CON ARTIST!!!", "pics": null, "resp": null, "gmap_id": "0x88860205a30f479f:0xa9468bcca2abef97"}
{"user_id": "115728473583363046008", "name": "Michael Logsdon", "time": 1624899753059, "rating": 5.0, "text": "Quality products and great service!", "pics": null, "resp": null, "gmap_id": "0x88892d4bd8dd08fb:0xd4b8da634c7cea21"}
{"user_id": "105210576245069250035", "name": "Stephanie TheAnimeLover", "time": 1609232135676, "rating": 4.0, "text": "Excellent Outdoor furniture store", "pics": null, "resp": null, "gmap_id": "0x88892d4bd8dd08fb:0xd4b8da634c7cea21"}
{"user_id": "104657315330213178045", "name": "Eleanor Collins", "time": 1484249976442, "rating": 1.0, "text": "Took my money.  Have not had the Christmas present delivered yet.  Plenty of excuses and no refund yet.  The present was for a handicap mother.  Do not shop here.  Phone call to handicap mom stated you would refund credit card and you want to add it to the list of lies? First week, chair was not in the warehouse in Atlanta.  Second week it was raining.  Third week excuse was death in the family.  Fourth week no delivery no phone call.  You never contacted the buyer which was me.  Just made stress on the handicapped mom.  You can call me names.  I in turn will not call you names.  I will wait for the refund on the card and you have my phone number since you will not answer my call.  I will pray for you also.", "pics": null, "resp": null, "gmap_id": "0x88f333433646516b:0x4d6a49b20bf770f4"}
{"user_id": "106599796570026497181", "name": "evan stevens", "time": 1467059523468, "rating": 5.0, "text": "They made my wife happy and that makes me happy! Thank you furniture and mattress outlet! We love our new bedroom set! You guys rock!", "pics": null, "resp": null, "gmap_id": "0x88f333433646516b:0x4d6a49b20bf770f4"}
{"user_id": "103559526549904758781", "name": "Lisa Garrett", "time": 1472767399797, "rating": 5.0, "text": "We have bought two mattress sets from Furniture and Mattress Warehouse, and we LOVE both!!! We will definitely be shopping for living room furniture soon from them!", "pics": null, "resp": null, "gmap_id": "0x88f333433646516b:0x4d6a49b20bf770f4"}
{"user_id": "105772463158192205034", "name": "Cheryl Smith", "time": 1486664519147, "rating": 1.0, "text": "My husband and I went by Furniture and Mattress warehouse at the suggestion of my parents. They had a good experience with the owner/manager Josh Johnson so we decided to check the store out. Our visit went great, we ordered a Stearns and Foster mattress, a couch, and a chair. $1500 including delivery. Josh told us he would be going out to Atlanta the following Thursday, February 2nd, to pick up our couch and chair and have it delivered Friday or Saturday. He'd call to set up the final details. The mattress, however, he could get to us by Monday the 30th. We set up a delivery time for 3:00. Josh stated he would call me the morning of the 30th as a reminder. Up to this point, everything was great. Until Monday the 30th rolls around, it's 3:00 and there's no reminder phone call or delivery person. I call Josh and he asks if the delivery could be changed to 5:00. OK. Fine. No problem. Five o'clock rolls around. Nothing. Six o'clock. Seven o'clock. Finally, after being stood up repeatedly, my husband (the second of the two men delivery...That we paid for) helped Josh load the California-king mattress into the house. My husband is a disabled veteran and large part off his disability is his back. It is now the 9th of February and we have not received a single phone call from Josh about our couch and chair. I've called him nine times. Once while standing in front of him yesterday. He informs me that their number has changed as of that morning. Mine hadn't. He never called me. Though it expressly states, via their own contract, that if there are any shipping or delivery set backs they will contact me immediately to let me know. So, on Monday, February 6th my husband goes to the store to inquire as to what is going on. Josh tells my husband that they're having some delivery issues but we'll definitely have our furniture by Friday. He'd be giving us a call to set up a time. However, by Wednesday afternoon still no call. So, I went to the store Wednesday afternoon and Mr. Johnson tells me that we 'should' have our furniture by Tuesday. When I asked him why he hadn't kept me informed he said he was busy keeping up with his other customers and if he neglected to call he was sorry. I asked him why he hadn't returned my calls when the number has only recently changed. Surely he got them. No. He says he never got a single one of the many phone calls I made. Then I ask him if he has my number. He says he wrote it down wrong. That's funny, because he knew it when he was talking to my husband, and it's clearly written in our contract/receipt. Oh. And he tells me they're getting out of the furniture business. Be WARY, folks. Be VERY wary. All I'm asking for is common courtesy. Keep me in the loop. I'm not unreasonable. At this point, however, if I do not receive my furniture by this Tuesday I will proceed to take civil action through litigation if I am not given a full refund of the cost of the delivery fees, couch, and chair that I have paid.", "pics": null, "resp": null, "gmap_id": "0x88f333433646516b:0x4d6a49b20bf770f4"}
{"user_id": "112816720007746911355", "name": "Amanda Johnson", "time": 1477601205883, "rating": 5.0, "text": "Awesome people and great service ... great quality furniture and mattresses", "pics": null, "resp": null, "gmap_id": "0x88f333433646516b:0x4d6a49b20bf770f4"}
{"user_id": "109191018947570519076", "name": "Jennifer Martin", "time": 1456193980441, "rating": 1.0, "text": "Best staff in town wonderful customer service", "pics": null, "resp": null, "gmap_id": "0x88f333433646516b:0x4d6a49b20bf770f4"}
{"user_id": "104372683538962936559", "name": "Artful Dobson Photography", "time": 1399321301211, "rating": 5.0, "text": "Friendly knowledgeable people and lots of stock to look at at.", "pics": null, "resp": null, "gmap_id": "0x88f333433646516b:0x4d6a49b20bf770f4"}
