{"user_id": "118286461838078850814", "name": "Mia Thompson", "time": 1629379269688, "rating": 1.0, "text": "next time, hire a delivery guy that won't go through peoples medicine cabinets. Disgusting. They took blood pressure pills that were for my grandfather! idiots probably thought they were going to get high but all they got was better health.", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "116216188302301905155", "name": "Heather Bouse", "time": 1621951879247, "rating": 5.0, "text": "Large variety of quality mattresses and great customer service! Michael answered all my questions, and I never felt rushed to make a decision. They delivered and set up my mattress the following day. Good prices when compared to other stores in Mobile, and the staff is extremely helpful.", "pics": null, "resp": {"time": 1621954465621, "text": "Heather, We are glad that you had an awesome experience shopping with us. We appreciate you trusting us with your sleep. Thank you for the review."}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "102034904735915488282", "name": "Heavy Metal Vaper", "time": 1611790383181, "rating": 5.0, "text": "Best mattress center in Mobile for sure. Sealy, Tempur-Pedic, and Sterns & Foster.... what else do you need. Well lit and laid out with adequate space between beds. Cloee is Rey helpful and very friendly. I can’t recommend this place enough.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOZZGiWvQUHGmM_fwZ7KaqmnjutjapD1isZ2UsI=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "111847529336221885572", "name": "Catherine David", "time": 1621191832577, "rating": 5.0, "text": "Would like to thank Michael Gabriel for his professionalism on helping me pick mattresses & his honesty choosing exactly what we needed.  He  accommodated us in every way possible !  Thank you Michael - we will recommend Sleep Center because of you !  What an outstanding employee !", "pics": null, "resp": {"time": 1621356164723, "text": "Thank you Mrs. David for the recommendation. It was a pleasure helping you with your selection."}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "104064301232119745612", "name": "Keisha Rainey", "time": 1609108001978, "rating": 5.0, "text": "I came in looking at mattresses. Michael  gave a brief overview of them. He checked on me to see how I was doing and explain the differences in the mattresses. He showed excellent customer service to me and others that came in the store as well. I would definitely recommend anyone to come here. You will not be disappointed.", "pics": null, "resp": {"time": 1609264545364, "text": "Thank you Keisha! We appreciate awesome customers like you!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "107018074982763165965", "name": "Dayana Boza Molina", "time": 1619221681824, "rating": 5.0, "text": "Very good attention, when I bought the bed they gave me a great discount and the shipping was free, I am very happy with my new bed", "pics": null, "resp": {"time": 1619286924878, "text": "We always enjoy taking care of people ! We are glad that we were able to take of your needs and that you are happy with your mattress!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "113192163320321437275", "name": "Felipe Soto", "time": 1619221335299, "rating": 5.0, "text": "excellent service, very good attention, the sellers are very friendly and attentive, the shipping services are very fast, only 1 day after the purchase, my new bed arrived", "pics": null, "resp": {"time": 1619286262203, "text": "Thanks so much Mr. Soto for your kind words !! We strive to give every customer the best service possible !!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "107917732312214155378", "name": "B Patrick", "time": 1611952236234, "rating": 5.0, "text": "Chloee is awesome!  She’s very helpful and helped us with the best price for mattresses for my children.  100% would recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "103093865650167045675", "name": "George Malatinszky", "time": 1623792798252, "rating": 5.0, "text": "Really professional and cordial sales and delivery team.", "pics": null, "resp": {"time": 1624285655667, "text": "George, we are glad that you are satisfied with our service. Thank you for the review."}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "114216763489399041842", "name": "Mullet Point", "time": 1608840687738, "rating": 5.0, "text": "Michael was very helpful, friendly and knowledgeable. We appreciate him helping us to decide on a mattress and setup. Thank you.", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "101607938585166205857", "name": "Claire MacDonald", "time": 1591191339984, "rating": 5.0, "text": "This is my third purchase from the Sleep Center. Nathan and Michael know their stuff and give great guidance while not being overbearing. The only things they sell are mattresses, unlike furniture stores,  so they are highly knowledgeable about their products.  The owner is active in the store and available to customers. Delivery is quick and professional. Outstanding customer support start to finish.", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "114583075229523517768", "name": "Alissa Sellers", "time": 1592597732164, "rating": 5.0, "text": "My fiance, Peyton, and I recently purchased a California king mattress from The Sleep Center. We had looked several other places prior to going here, but we consistently had the same experience of feeling like they were just trying to make a sale and sell us the most expensive mattress they could. However, at The Sleep Center, it was completely different. I think Michael was the guy that helped us; he was incredibly helpful and patient with us. He showed us our lower priced options, even if they were way below our budget, which I appreciated. We ended up finding one that we both loved but was above our budget, so he was able to lower the price to stay below our budget. Excellent customer service and interpersonal skills!", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "101391040938492915687", "name": "Ben Beard", "time": 1580182582331, "rating": 5.0, "text": "Due to unfortunate life circumstances, I’ve found myself in need of a new bed a few times in the last few years.\n\nMichael has taken fantastic care of me every time I’ve been to The Sleep Center. The customer service here is phenomenal, the rest of the reviews can attest to that. He is knowledgeable and will go out of his way to ensure you have what you need.\n\nThe second time I needed a bed I was in a difficult situation during the holidays and their truck drivers were on vacation. Michael personally helped load the bed on the back of my truck after hours in order to get me what I needed as soon as possible. I am a fan of this company and these guys.\n\nI have recommended them to a few people and even took my girlfriend to get a new bed recently. After feeling how comfortable mine is and what a great nights sleep it offers, she had to have her own. I wouldn’t let her go anywhere else.\n\nThank you Michael for your great customer service and your knowledge, and thank you Nathan for your great establishment! You have a customer for as long as I am in the Mobile area.", "pics": null, "resp": {"time": 1581439436129, "text": "Thank you for the kind words Ben!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "108421400252707945451", "name": "Pauline Mckean", "time": 1608683202648, "rating": 5.0, "text": "Michael was extremely helpful and very knowledgeable...we appreciate his honesty and direction on purchasing our sons mattress for his new home! Highly recommend Michael!", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "105323361939982495837", "name": "Shantae Fox", "time": 1601244971957, "rating": 5.0, "text": "If your looking for a great FAMILY run business to make you feel like a valued customer, you cannot go wrong here!!! I loved every moment of the experience here. The minute I stepped in the door Michael greeted us and asked us if we needed anything he wasn’t pushy or (salesperson-ish) lol he was full of useful information when asked. We got the best deal between numerous stores an countless website searches. If your looking for great service and an awesome deal here is the place!!!! Thank y’all so much!!", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "115804678581158758141", "name": "Jeffrey Melson", "time": 1590799185746, "rating": 5.0, "text": "The salesman, Michael, was extremely helpful and informative. My wife and I looked around and then left to talk it over. We called after we decided to buy from Sleep Center and they delivered the mattress and set it up 3 hours later. The delivery men were careful, polite, and set the mattress up quickly. Couldn’t ask for better service.", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "101744093032863031639", "name": "Peyton Lott", "time": 1592597074510, "rating": 5.0, "text": "The Sleep Center had exactly what my fiancée and I were looking for. Great service, affordable prices, and people who care more about helping you in the best way than just making another sale. I’d recommend this place to anyone!", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "111967770615364146931", "name": "Walt McKean", "time": 1608841026493, "rating": 5.0, "text": "Excellent service with honest sales team. Lead me to the right bed at the right price.", "pics": null, "resp": {"time": 1609264583753, "text": "We are so happy that you are happy with your purchase!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "105295628162268816002", "name": "Shannon Williams", "time": 1607636782586, "rating": 5.0, "text": "Great customer service Cloee was very helpful in finding the perfect mattress! Thanks!", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "104736682188585036450", "name": "Shakiera Brown", "time": 1571643520693, "rating": 5.0, "text": "More than just a typical mattress store, The Sleep Center really cares about your well-being!! I have back problems, in which I required a quality mattress that fitted my needs. April was very knowledgeable of the type of mattress I required, but what really impressed me was her patience and southern hospitality. When you come to The Sleep Center, they make you feel as if you are family!! I highly recommend this store.", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "103705821034353795983", "name": "Jalal Amle", "time": 1607449254283, "rating": 5.0, "text": "It’s very good service In the shop", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "113575240603528701652", "name": "Kim Borthen", "time": 1574612852628, "rating": 5.0, "text": "I normally don't take time out to write a review, even for great service. Michael and the owner Nathan were accommodating and very professional. I visited other mattress stores in the surrounding area and found them to be too aggressive. Sad to say, but I felt as if the other store PRIOR to my purchase with The Sleep Center had forced me on a bed, ready to swipe my card and ship me to my home. Excellent service, Kim", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "108310982536260028411", "name": "Alphonso Gilmore", "time": 1571642189186, "rating": 5.0, "text": "Top notch customer service!!! I just moved to Mobile, Al and needed a quality mattress. Not only did I receive a quality mattress with a affordable price, Michael (the owner)provided me Southern hospitality in which I now have a extended family. If you desire a patient, caring, and knowledgeable sales team when shopping for a bedroom mattress, I highly recommend The Sleep Center.", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "106904944081395979030", "name": "Murphy Bishop, II", "time": 1573581253397, "rating": 5.0, "text": "Michael was excellent at helping me pick out a mattress.  I actually bought two since I was comfortable, not rushed and not pressured.  I shared my budget and was directed to options in my range.  I appreciate the ease of this transaction. I will be back.", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "115809151773167195685", "name": "MikeandTonya Harold", "time": 1577996283954, "rating": 5.0, "text": "We had a great experience. The customer service was phenomenal. Chloe was courteous and knowledgeable. We purchased a twin bed for our son and I’d be happy to shop here again.", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "109004826148220299405", "name": "Jessica Driskell", "time": 1577648498691, "rating": 5.0, "text": "So glad we stopped in!!!  April was so helpful!!!  She really took our needs and was able to find the perfect fit. Amazing experience!", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "105074819735054334690", "name": "Richard Nameniuk", "time": 1566259183167, "rating": 5.0, "text": "Best place to buy a mattress hands down!  Mike (the manager) provided the best customer service and no-pressure atmosphere.  Delivery team was on time, careful and polite.  We tried a couple other mattress stores and were not impressed.  Will only buy from here in the future.", "pics": null, "resp": {"time": 1566490063565, "text": "Thank you for the kind words Richard!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "103156545113201880763", "name": "Bryan Newburn", "time": 1573344454876, "rating": 5.0, "text": "Michael was great help in finding the best fit for what we wanted in a mattress. We never felt pressured to buy anything. I highly recommend him if your looking for bedding needs.", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "115072128322917906585", "name": "Marco A Miranda", "time": 1573581576916, "rating": 5.0, "text": "Walked into this store and was very happy I did. All my questions were answered straightforwardly. Michael is not only helpful, but also, honest and transparent. This place is legit.", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "103266574492379611418", "name": "Wanda Prewitt", "time": 1580507878847, "rating": 5.0, "text": "I shopped all over Mobile for a mattress and went to several furniture shops with pushy salespeople and unclean mattresses but that was not my experience at Sleep Center. The place and mattresses were clean and April was helpful/knowledgeable but not pushy. Thanks for a great experience.", "pics": null, "resp": {"time": 1581439368521, "text": "Thank you Wanda! We take great pride in providing a clean and comfortable atmosphere for our customers.Thank you for noticing!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "102320509312652816678", "name": "Christian Leman", "time": 1552513110897, "rating": 1.0, "text": "A few weeks ago I went to Sleep Center to purchase a king bed frame to fix a customers bed. While checking out the cashier could not get my receipt to print out. He was able to get my credit card receipt to print. I asked if this would work if I needed to return the bed frame. He said and I left. The bed frame ended up not working. I went to return the bed frame today and I was told they only return mattresses. This would have been great to know when I checked out as I only purchased something the cashier knew was non returnable. I understand stores must have policies for liability reasons etc, they must be up front with these. I purchased this not knowing if I needed to save time and serve my customer I. The best way possible. Now I am eating $75. I would not have purchased this if I knew it was non returnable.", "pics": null, "resp": {"time": 1552949560568, "text": "Mr. Leman, please contact the store at your earliest convenience to resolve this matter. You are entitled to a refund and I apologize you were told other wise. Thank you and I am very sorry for your inconvenience."}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "113587102013561480432", "name": "Brittany Dueitt", "time": 1459428617586, "rating": 5.0, "text": "Let me start with the fact that I had my 4 year old son with me! The moment we walked in the door the staffed made us very welcomed.  They have an amazing little play center where I could watch him play and still focus on why I was there in the first place.\nI was torn between two types of mattresses both of which were in the store.    The salesman who helped me was very knowledgeable about both.  He wasn't pushy and didn't linger around while I was trying to make my decision, but was close enough to answer any questions I had.  The staff even moved around several mattresses to different bases so that I would know exactly what I was getting.\nDelivery was very smooth! Although the poor guys delivering got soaked.  They delivered the same day in the middle of a storm, the were very polite.  They even took my old mattress set away!\nOverall I am very pleased and would recommend anyone who is in the market for a new bed/mattress visit the Sleep Center! They have amazing staff and GREAT prices!", "pics": null, "resp": {"time": 1516760484176, "text": "We are so happy to help. Thanks for your 5-star review, Brittany!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "117178532102599503057", "name": "brett garrick", "time": 1570763321395, "rating": 5.0, "text": "Great folks and great prices. I bought my second bed from them a few days ago and it was delivered and set up promptly. The service on the sales floor by Michael was above and beyond. Very quick, positive experience and i'm sleeping better because of it.", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "100557230449793877773", "name": "Beth Lyons", "time": 1564693015670, "rating": 5.0, "text": "We were very happy with the Sleep Center!!  We picked them because of their positive reviews!! Our visit was just how the reviews stated. We were welcomed, asked how they could help, and immediately taken to the exact area of the store we needed. We were given the exact information we needed to make our decision and then left alone, (with no pressure) to try out all the mattresses we wanted.  We made our decision, paid and we’re out the door in under 30 mins!!!  Better yet!, the store had our mattress in the store and it was delivered the next day exactly when they said they would be here.  The delivery crew were nice, courteous  and set the mattress and box spring up on our bed frame in minutes!! We will go back to Sleep Center again for sure!!!", "pics": null, "resp": {"time": 1565808209035, "text": "Thank you Beth!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "105089075703220575824", "name": "Ericka Blevins", "time": 1575584435823, "rating": 5.0, "text": "The staff was patient and very knowledgeable.  They were genuinely interested in our needs and went out of their way to make sure we were comfortable with our decisions.   They stand by their product and there was no hassle trading out or getting a different product.  Luving these guy and gals.", "pics": null, "resp": {"time": 1577395677842, "text": "We luv serving our customers! Thank you Ericka!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "108155135764880711752", "name": "gary merritt", "time": 1560216855845, "rating": 5.0, "text": "Great prices, great customer service and I will do business here again in the future. I appreciate the warranty is handled at the store of the purchase. My wife is happy so I am happy.", "pics": null, "resp": {"time": 1570553906750, "text": "Thank you Gary!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "118248236848439239819", "name": "Nick Ousley", "time": 1554775092624, "rating": 5.0, "text": "Michael helped my wife and I select a great bed when we were looking for a new one. We had a basic knowledge of what we were looking for, and upon entering the store, he offered a couple of minutes of direction and information before stepping away to let us browse for ourselves without pressure. He was always near at hand for questions, however there was no pressure to buy.  Any concerns or questions were answered in a very professional, understanding manner.  We received an awesome price on a movable king sized bed along with accessories, delivery was a breeze (the delivery team arrived on time and were done in 30 minutes), and we couldn't be happier with our experience.", "pics": null, "resp": {"time": 1555084432937, "text": "Thank you for sharing!!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "103442492752030874751", "name": "Chris Wright", "time": 1551148566206, "rating": 5.0, "text": "Came in just to look and compare prices, ended up leaving with a great mattress that my wife and I both agreed on, along with a new friend. Michael is a great salesman, doesn't hover over you like a vulture waiting on you to die like most other salesmen. Enjoyed the service and the conversation we came back and have already picked out a new mattress for our son as well! Enjoyed our experience so much, we even came back and brought thank you gifts!", "pics": null, "resp": {"time": 1551281865638, "text": "Thank you for your business, the laugh and the king cake! Great review!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "107332250865296617688", "name": "Lisa Molyneux", "time": 1554245951395, "rating": 5.0, "text": "My husband and I have bought three mattresses in the last three years and two of those in the last 4  months from the Sleep Center. The staff has been so helpful each visit. When I visited last, they new who I was and that I was a regular customer, and still fantastic service and attention. The staff is helpful, but not pushy nor do they hover. Great experience and will continue to shop with The Sleep Center.", "pics": null, "resp": {"time": 1558646313269, "text": "Thank you Lisa! Always a pleasure to serve you and your family!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "102705435783031555591", "name": "Melissa Wright", "time": 1551149291553, "rating": 5.0, "text": "Michael Gabriel is amazing. I absolutely HATE salesmen, but he isn't pushy or obnoxious. We had intended to buy from another very popular Mattress store which I won't name, and changed our mind after dealing with Michael. He's very knowledgeable, helpful and friendly. We are very pleased with our mattress that we purchased plus the extras, and will be customers for life. Thank you for everything Michael.", "pics": null, "resp": {"time": 1551282173980, "text": "Thank you Melissa!!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "104290105786118600678", "name": "Krystal Smith", "time": 1561930803658, "rating": 5.0, "text": "This place is great!!! Cloee was so kind and professional. The prices were amazing. Michael was fabulous too. The mattress is incredible and they even threw in some fantastic “freebies”, as well!!!!", "pics": null, "resp": {"time": 1562179999025, "text": "Thanks Krystal!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "106030051651464224944", "name": "Rachel Hartley Hester", "time": 1572350359913, "rating": 5.0, "text": "Michael has helped my family with all our mattress and bedding needs. He and the staff there are so helpful and eager to accommodate. He makes the buying process so easy. Thank you!", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "113177126561409401155", "name": "Stefanie Davis", "time": 1560216968642, "rating": 5.0, "text": "I will tell people about this place. Michael was our salesman and I was very happy walking out of this business. He didn't try and sell me the most expensive mattress and answered all my questions. This was my second place I looked. I walked out the 1st mattress place sick to my stomach from the over the top prices. The sleep center is very affordable, and the customer service is top notch. I bought an adjustable split king base with mattress and I can't wait to sleep like an angel. Check them out.....", "pics": null, "resp": {"time": 1566490173077, "text": "Thank you so much Stefanie!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "116722042664882898070", "name": "Susan Havard", "time": 1525783754712, "rating": 5.0, "text": "I cannot say enough good things about the Sleep Center and especially Nathan. My mother purchased a mattress from them a few years ago.  Recently, the mattress became soft and not as supportive as she needed. Nathan helped us with the warranty process and went the extra mile to help determine what mattress to swap out for, even though there was absolutely nothing in it for him, as it was all done through the mattress company.  You will not be disappointed if you buy from them. Very knowledgeable about mattresses and stand behind their products.", "pics": null, "resp": {"time": 1525821479058, "text": "We are happy to help, Susan. Thanks for the 5-star review and for allowing our families to serve yours!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "115088274367667497980", "name": "Bee A", "time": 1550264466394, "rating": 5.0, "text": "Visited your store just to look on February 8, 2019. Michael was so helpful that we bought a mattress that day. Extremely helpful. He made sure to explain all the differences in what I was looking for. He made sure I was happy with what I was purchasing and it will be delivered this afternoon. I will be going back to this store.", "pics": null, "resp": {"time": 1553535629748, "text": "Thank you for the great review!!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "116822594438307064401", "name": "Julia Myers", "time": 1553642110744, "rating": 5.0, "text": "My husband and I purchased a new bed frame, mattress and box springs from Sleep Center last week and had a great experience! The sales associates were very nice, gave us honest opinions about different mattresses, and were very informative. The guys that delivered our bed were very polite and fast.", "pics": null, "resp": {"time": 1581439507143, "text": "Thank you Julia!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "105955046306598375970", "name": "Hugo Seda", "time": 1573326304033, "rating": 5.0, "text": "Could not recommend this place highly enough. Truly exceptional sales staff. Mike was a joy to chat with. Don’t look anywhere else in Mobile for your mattress needs.", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "111484328327682859808", "name": "Rick Clayton", "time": 1580585905258, "rating": 5.0, "text": "Wonderful staff super helpful second time I've done business with them and would recommend them to everyone", "pics": null, "resp": {"time": 1581439303503, "text": "It is always pleasure to take care of our repeat customers! Thank you for coming back to see us!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "111628280291810896376", "name": "Larry Gill", "time": 1548855410406, "rating": 5.0, "text": "Recently visited the Sleep Center on Airport Blvd., Mobile , Alabama, to inquire on an adjustable bed for our dad, an 86 year-old, Korean War Veteran.  \"Mike\" was the ultimate sales representative: Welcoming; Courteous; Knowledgeable.  The deal was sealed and purchases made.  Thank you!  We will be repeat customers!", "pics": null, "resp": {"time": 1549483938747, "text": "Thank you Larry!! It is ALWAYS our honor to serve those that have served us in the military! Your whole family was a pleasure!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "116923717284884957916", "name": "Mary McGuire", "time": 1534781693016, "rating": 5.0, "text": "I bought a mattress several months ago and have been very happy with the purchase.  Michael Gabriel was wonderful.  I brought my daughter in this pass weekend and  Michael was very patient and informative helping my daughter pick out a mattress.    Wonderful people to work with.  Definitely deserve the 5 star rating.", "pics": null, "resp": {"time": 1534873534835, "text": "Thank you so much for the wonderful review!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "114779571099585558158", "name": "Shelli Parker", "time": 1465082150651, "rating": 5.0, "text": "I purchased an adjustable base for my bed a year or so ago from The Sleep Center. The employees were so helpful and informative.  I had to purchase another base and mattress for my mother this time. I drove from Mississippi (for the second time) to purchase my item from The Sleep Center.  Once again, the employee that helped me (Michael) was knowledgeable and eager to make me happy!  I told him my budget and he worked hard to accommodate that amount! The delivery and setup was amazing as well!   Best place to buy a mattress or base!!!", "pics": null, "resp": {"time": 1516760415734, "text": "Thank you, Shelli!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "105084169248833163428", "name": "Dakota Crawford", "time": 1551549786219, "rating": 5.0, "text": "Came in looking for a simple mattress in a box that would work for my pockets and as soon as I walked in I felt welcomed. The lady helped find a bed that worked for my body and did it all by how my body reacts when I sleep. Bout time I left I had a honestly get a quality mattress for a great price and with their layaway plans and free delivery I walked out so happy. Hella recommend!!!!!!!! 😍😍😍😍💖💖💖", "pics": null, "resp": {"time": 1551813191543, "text": "Thanks Dakota! So happy you enjoyed your experience!!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "115248901951931379087", "name": "Vicki Atchison", "time": 1550454406826, "rating": 5.0, "text": "We spent half a day going around  town trying to find this awesome pillow called \"The BedBoss\".  We were happy to find it at the Sleep Center at a great price. Super helpful and friendly staff made the shopping experience great.  Highly recommend.", "pics": null, "resp": {"time": 1550603054872, "text": "Thank you for shopping with us Vicki!! We appreciate your business!!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "115974981311857614604", "name": "Abigail Schjott", "time": 1485384627423, "rating": 5.0, "text": "These guys are amazing! This was my first mattress hunting experience and the store manager Michael was more than knowledgeable in his answers to my questions and made the process very easy! I purchased two mattresses, one for myself and one for my mother and the two men who delivered them were very helpful, professional, and quick! They also worked with our schedule very well on a day and time for delivery! The free local delivery was amazing being as we are two females with no truck. Thank you again guys!", "pics": null, "resp": {"time": 1492128353115, "text": "Thank you, Abigail. We appreciate you shopping with us!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "110022632265297110512", "name": "Tayler Hughes", "time": 1588895572444, "rating": 5.0, "text": "Took no time at all and went home with a wonderful matress!", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "114558790045011404847", "name": "Michelle Lartigue", "time": 1436661415543, "rating": 5.0, "text": "Wonderful experience from start to finish. Michael our sales associate was extremely knowledgeable, professional and friendly. The owner made us feel welcome and truly appreciated our business. Our mattress was delivered the same day we bought it.  The delivery men were very polite, friendly and did a great job setting up our new mattress. Will highly recommend Sleep Center to friends and family.", "pics": null, "resp": {"time": 1516760615913, "text": "Thank you, Michelle!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "115552662470306080225", "name": "ALAN LAPENNA", "time": 1562083536167, "rating": 5.0, "text": "Walked in Monday evening after spending the entire day moving into our new house, needed to purchase a full for a crib conversion.  Nathan was supper helpful and very knowledgeable.  He did not try to up sale me, and I was out the door with the new mattress in less than 15 minutes.  This is the second time I have purchased from this store and location and will do so for future purchases.", "pics": null, "resp": {"time": 1562179890546, "text": "Thanks for sharing and being a great customer!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "101740238816924892123", "name": "P Bassett", "time": 1492630775004, "rating": 5.0, "text": "This is the place, if you are looking for a new mattress set!  We went to many stores before finding this jewel.  The Sleep Center has quite the selection and very knowledgeable staff.  We found the mattresses that we needed/wanted at a wonderful price (compared to the other places we had visited).  P.S. Our salesman Michael was went the extra mile explaining everything to us.", "pics": null, "resp": {"time": 1492923081774, "text": "We are so happy to assist and appreciate your business very much!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "108683636744993672362", "name": "Bryan J.", "time": 1482532250492, "rating": 5.0, "text": "I just want to give a personal shout out to Micheal Gabriel. Thanks for all the help and recommendations. I have honestly had the best sleep in forever. When you're military and need a great deal I recommend Sleep Center.", "pics": null, "resp": {"time": 1492128456997, "text": "Thank you, Bryan. We really do appreciate you shopping with us!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "107109034835754306235", "name": "Mark Manning", "time": 1560008031707, "rating": 5.0, "text": "I purchased a Sealy queen mattress and box spring from The Sleep Center and had the absolute best buying experience. Cloee knew anything and everything about each bed in the showroom, and answered all of my questions with a smile. As soon as she greeted me, I knew I had chosen the right store. Michael, the manager, was also extremely professional, and stood by his sales associates. Even the delivery guys were pleasant and very courteous. I will definitely be doing business with them again.", "pics": null, "resp": {"time": 1565808261102, "text": "Thank you for taking the time to leave a great review Mark!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "102577334582970186310", "name": "David Bailey", "time": 1470068348649, "rating": 5.0, "text": "Shane waited on us and was very knowledgeable of the different profucts they carry. We made our first purchase and went back last week and purchased another mattress set. Michael was also very helpful when Shane was at a different store. Shane had talked with Michael to fill him in on what we were looking for. They worked as a team which I thought was great! The delivery went very smoothly as well. Great place! I've already suggested to others about our great experience! 👍🏻😉", "pics": null, "resp": {"time": 1516760354824, "text": "Thanks so much, David!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "106465810557493430882", "name": "Juan hernandez", "time": 1582592600853, "rating": 5.0, "text": "Michael was once again great and helped get us a good deal!!", "pics": null, "resp": {"time": 1601917961913, "text": "Thank you Juan!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "101115362957542098699", "name": "Jesse W", "time": 1481258391154, "rating": 5.0, "text": "The Sleep Center is amazing to shop at. Michael was fantastic and did not pressure us to buy anything and in fact tried to help us save money. He understood that buying a mattress is a long term investment and didn't pressure us to buy \"right now\".  In fact it took us several months of looking and researching to finally buy. And after 6 months of sleeping on the mattress, it was the best decision we made. They also price match and when my sister bought a mattress in TN she used this stores pricing to be matched since the sleep center did not have a store in her area. Overall it was the best store we went to with amazing customer service from start to delivery.", "pics": null, "resp": {"time": 1492128539484, "text": "Thank you, Jesse! We are thankful for your business and kind words."}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "116817957766048568978", "name": "Tracy Bumpus", "time": 1421257868007, "rating": 5.0, "text": "The customer service was fantastic.  I was a difficult customer and they never lost their patience with me and showed great compassion when trying to find a bed that would be best for sleeping on my stomach.  They gave me credit for a previously purchased bed and made sure I was comfortable with my purchase before I left the store.  Upon delivery, the staff was quick, friendly, and efficient.", "pics": null, "resp": {"time": 1516760642025, "text": "Thanks for allowing us to care for your sleep needs, Tracy!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "118120703136032956692", "name": "Collin Smith", "time": 1499025289831, "rating": 5.0, "text": "With this being our first ever endeavor to go out and find 'The mattress' for me and the wife. We didn't really know what to expect from a mattress store nor from a mattress salesman, but fortunately we stumbled into the right place. We were immediately greeted by David W. Who knew when to give us our space and when to point us to the right mattress from the description we gave concerning how we slept and what we were expecting from a mattress. Not only did this store provide excellent customer service but they provided the best prices compared to some of the other local mattress centers.\nI give sleep center 👍👍...", "pics": null, "resp": {"time": 1499055560432, "text": "We greatly appreciate your business and kind words, Collin. It's our pleasure to assist. Thank you!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "111289093461054751813", "name": "Katie O'Neill", "time": 1472146019176, "rating": 5.0, "text": "I flew in late one afternoon and was desperate to find a bed to be delivered the next morning. I went straight to The Sleep Center and the guys there were incredibly helpful and kind and were able to deliver me the perfect bed the next morning. I have now had this bed for a couple of weeks and I couldn't be happier with my choice. I  would recommend this business to everyone.", "pics": null, "resp": {"time": 1492128593405, "text": "So very kind, Katie! Thank you!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "106016367669572821016", "name": "Mitteer 2005", "time": 1531253957935, "rating": 5.0, "text": "I highly recommend this Sleep Center on Airport. Micheal Gabriel, and Nathan were fantastic. These two went out of their way to help us with a mattress, and we even learned a bit about a Dyson vacuum! If I could give them more than 5 stars I would. This is our second mattress from here, and we couldn't be happier.", "pics": null, "resp": {"time": 1531364253432, "text": "We love hearing of happy sleepers. And we greatly appreciate your business and 5-star review!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "111402832797136801629", "name": "Ronnie Tindle", "time": 1527371414256, "rating": 5.0, "text": "Stopped by with my 82 year old mom to get a new mattress with power frame. Michael was very patient with us as we tried what seemed  every mattress in the store. He stayed right with us a explained that the most expensive is not always the best fit. We left and went to eat lunch and he was not pressuring us. Went back after discussing it and made the purchase. He reduced the price and also gave us some free items. We had already checked around and their quality and helpfulness is what brought us back. Also while checking out we were talking with Michael and Cloee and she made sure that all the information about delivery was on mom’s paperwork so she could understand it. Overall this was an excellent shopping experience for me and my mom. Thank you.", "pics": null, "resp": {"time": 1527393222537, "text": "It is always our pleasure to assist and we greatly appreciate your business, Ronnie. Thank you for taking the time to leave us such a thoughtful 5-star review!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "112126537649210098122", "name": "Stacey Dotson", "time": 1545093766980, "rating": 5.0, "text": "Sleep Center was awesome! Before them we went to different company’s store to buy a tempur-pedic. Told them I would pay cash but they did not have an interest in keeping our business so we left and went to sleep center. Upon arrival we were able to get helped with what we wanted and got freebies on top of it! I truly appreciate the effort given by Mike to help us get the most out of our purchase. I highly recommend visiting the sleep center on airport blvd!", "pics": null, "resp": {"time": 1545234982231, "text": "Thank you Stacey!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "113653731399056815064", "name": "Wayne Boyd", "time": 1510252231799, "rating": 5.0, "text": "This is mattress number 3 I have purchased there.  TMC is a great locally owned business.  They have treated me right over 8 years.  Go there first because they will have the best price and actually sell you what you need at a great price.", "pics": null, "resp": {"time": 1510294882882, "text": "Thank you, Wayne!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "114671987527162165952", "name": "Garland Ritchie", "time": 1467899310597, "rating": 5.0, "text": "We stopped by the Airport Blvd store. Johnny greeted us and introduced himself. We told him what type of bed we were looking for and our budget. Johnny took us right to two beds. He did not have to look around to figure out where the beds were located. Johnny answered our questions about the bed and even excused himself while we laid on the bed for a few minutes. He did not stand there and keep talking to us. That allowed us to discuss bed with each other. He showed us a couple of other beds and treated us the same when we tried them out. We purchased a mattress set within our budget. Johnny was great to work with and I recommend asking for him if you visit the Airport Blvd store.", "pics": null, "resp": {"time": 1516760367756, "text": "Thank you, Garland!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "112630421717411575331", "name": "Charles Hines", "time": 1551143288481, "rating": 5.0, "text": "I usually don’t leave reviews, even for exceptional service. I felt that this was something I wanted to share with everyone who is looking to buy a mattress.\nWhen I buy a mattress it’s like buying a car, my wife and I went to 4 stores, one of them had aggressive sales pitch tactics, this may be why they have the word “FIRM” in their name.\nAnyways, I was talking with the guys at the fire station and they started to rave about the mattresses they had slept on at another fire station. They said they would do business with The sleep center when it came time to buy for there home. So since this owner took care of my friends I decided I would check them out. When we walked in the door the manager met us with a hello from the back of the store, he saw that we had two kids and asked if we cared if they played in a children’s area (Automatically we were less stressed) so while the kids played he asked the standard questions and then directed us to three types to choose from but then something amazing happened.... he left us alone! Lol, me an my wife were able to lay on each bed and were able to be honest with ourselves  about the comfort and the cost. At one point we were worried because we didn’t hear our kids yelling like usually, well that’s because the manager was keeping them entertained. The whole process took about 1 hour which is mainly because we couldn’t decide which bed to buy. They were able to give us the best offer we have found out of all four stores and then even added some incentives! Do yourself a favor!! GO HERE FIRST, I promise you, you are wasting your time if you go anywhere else.\nP.S. Thank you for taking care of first responders, that goes a long way, now I just have to talk my Chief in replacing my mattress at the fire station! Lol\nThanks again- Forever Customer", "pics": null, "resp": {"time": 1553535514802, "text": "Thank you Charles for the kind review!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "113966503493240020185", "name": "Austin Johnson", "time": 1525930408365, "rating": 5.0, "text": "Wonderful people! Worked with me and my wife to find the perfect bed for my bad back. Couldn’t be happier with the bed and the price I paid for it. Highly recommend them to anyone shopping for a new bed.", "pics": null, "resp": {"time": 1525974914365, "text": "It was our pleasure to assist you, Austin!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "107450300243457850876", "name": "Genevieve Cotton", "time": 1580947227440, "rating": 5.0, "text": "Amazing quality mattresses and Cloee is so sweet and helpful.", "pics": null, "resp": {"time": 1581439053210, "text": "Thank you so Genevieve! We think you are awesome too!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "105801142878334302472", "name": "CHARLOTTE WATTS", "time": 1614715397120, "rating": 5.0, "text": "Awesome service", "pics": null, "resp": {"time": 1614957171716, "text": "Thanks so much for the compliments about our service . We strive to make sure that every customer has a great experience . Thank you for allowing us to serve you."}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "110407806915591990614", "name": "ALEXIS DAVIS", "time": 1494873335142, "rating": 5.0, "text": "Me and my mother went into this store today and immediately was helped by the manager Michael who was amazing and answered every question we had to ask and my mom is really picky lol we originally only went in to get a new queen mattress for my room but my mom fell in love with a king mattress and claimed she needed a new one also! Hands down one of the best costumer service experience we've had", "pics": null, "resp": {"time": 1494874632673, "text": "We are happy to help and appreciate your visit, and the kind words, too, Alexis!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "112922654188131294648", "name": "amber roberson", "time": 1471030739284, "rating": 5.0, "text": "This was one of the best shopping experiences I have ever had. I went in completely ignorant when it came to mattress shopping. The store was very clean and orderly. The staff was very nice amd helpful. They took their time in helping me pick the best mattress for me. Gave me plenty of information on each piece. They delivered the same day and with my schedule in mind. Very professional environment and sales team. Highly recommend this store. They have earned a life long customer.", "pics": null, "resp": {"time": 1516760316835, "text": "Thank you, Amber!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "116840659505425295401", "name": "Bruno Rivasplata", "time": 1494001281732, "rating": 5.0, "text": "Mike and Shane worked out the perfect deal for me. I was in and out The Sleep Center for 2 months while I made my decision, and they gave me excellent customer service each and every time. I highly recommend this location to everyone.", "pics": null, "resp": {"time": 1494013829799, "text": "It is our pleasure to serve your mattress needs, Bruno. Thanks for your business and kind words!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "108130955650900203241", "name": "Kokeshia Foster", "time": 1556986597534, "rating": 5.0, "text": "Cloee was so helpful. She was super friendly and helpful. I got exactly what I was looking for within my budget!", "pics": null, "resp": {"time": 1558108926213, "text": "We are so happy you enjoyed your experience!!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "102277181708278794930", "name": "Mayra Ordoñez", "time": 1492473805409, "rating": 5.0, "text": "I went today based on a friend recommendation of good service.  I get there, heard options of by Michael, and finally after I tried some of the matters and heard his explanations, I decided to by my matters there. I appreciate the good service and options they offer.", "pics": null, "resp": {"time": 1492541660619, "text": "You are very welcome, Mayra! We appreciate your business and kind words, too."}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "117308190433930737222", "name": "r81starski", "time": 1459769104059, "rating": 5.0, "text": "My first stop was to a competing mattress store. After I found the Sleep Center, I knew this was the place to go. Everybody there is very knowledgable and friendly and ready to help you.\n\nThe showroom inventory is full of great choices to test out and everything from financing to delivery was smooth fast and easy.\n\nI couldn't be more pleased with the overall experience at the Sleep Center Mobile Alabama!", "pics": null, "resp": {"time": 1516760445186, "text": "Thank you!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "114656018270483264095", "name": "April Durden", "time": 1462985038163, "rating": 5.0, "text": "I went to the new store in the McGowan Center. Michael was my sales rep and he was absolutely awesome. He was extremely helpful and he listened to my needs. I've already recommended him to my coworker!", "pics": null, "resp": {"time": 1516760433322, "text": "We appreciate you, April!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "101324818699859215061", "name": "Alexander Richard", "time": 1583952337914, "rating": 5.0, "text": "awesome service, great price! 😊", "pics": null, "resp": {"time": 1601917995443, "text": "Thank you so much for your business!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "117440835697956233928", "name": "Bademba Diallo", "time": 1554177942691, "rating": 5.0, "text": "Very happy with the customer service. I was pleased with the price and the warranty.", "pics": null, "resp": {"time": 1558647087945, "text": "Thank you so much!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "105245384897566128827", "name": "Diane Maisel", "time": 1494354043542, "rating": 5.0, "text": "Customer service at The Sleep Center is excellent!  The staff is knowledgable and knew the right questions to ask in order to help me find the right mattress.  I was so pleased with the product that I bought two more mattresses.", "pics": null, "resp": {"time": 1494442235471, "text": "This makes us so happy to hear, Diane, and we appreciate your business!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "113005592058377707617", "name": "Nancy Webster", "time": 1569255544594, "rating": 5.0, "text": "I had awful issues with delivery through the tempur pedic website. They lost my order and it was going to take OVER 3 weeks for my mattress to arrive. I ended up canceling my order and going to the sleep center. I knew exactly what I was getting and was in and out in 15 minutes and received my tempur pedic mattress the same day. Awesome customer service!", "pics": null, "resp": {"time": 1570117526205, "text": "It is always a pleasure to serve our amazing customers!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "105931802898876541398", "name": "Marcus Baygents (Nightsquall)", "time": 1517856475710, "rating": 5.0, "text": "This is the best mattress store in Mobile! Excellent, courteous, respectful and eager to satisfy customers. I purchased a tempurpedic cloud Supreme and later exchanged for a tempur contour elite. No hassles and great prices!", "pics": null, "resp": {"time": 1519278240892, "text": "Thank you for your 5-star review, Marcus!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "107934832138677157061", "name": "Tyler Gantt", "time": 1456010434403, "rating": 5.0, "text": "My salesman was Michael and he was fantastic. I went in with a budget and he ended up cutting $100 off of the mattress I was looking at so I could stay in my budget. They didn't have the box spring in stock that went with the mattress so they just gave me an even better one at no additional cost (A $70 value). Michael worked quickly to get me set up with delivery and everything despite being hit with 6 or 7 phone calls. (He was the only salesman there when I went in.) My mattress was delivered the very next day right on time. Couldn't have asked for a better experience, highly recommend.", "pics": null, "resp": {"time": 1516760501767, "text": "Thank you, Tyler!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "106175570576430644907", "name": "Tiffany Moore", "time": 1567513773616, "rating": 5.0, "text": "EXCELLENT CUSTOMER SERVICE! Great staff!", "pics": null, "resp": {"time": 1567527512446, "text": "Thanks Tiffany! We think you are awesome too!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "116349601204367485347", "name": "Sarah Williamson", "time": 1492107791717, "rating": 5.0, "text": "We recently purchased a new mattress from them and loved our experience! We had been to a couple of other stores and the customer service didn't even compare. There was no pushy salesmen, they were there to genuinely assist you with whatever you needed. There wasn't any pressure to buy. When I said I would have to come back with my boyfriend they didn't write me off or try to offer a last minute deal to get me to buy right then and their. When you are looking at the same matress brands for basically the same prices as other stores customer service is what makes or breaks the experience and they went above and beyond for us! Definitely would recommend!!", "pics": null, "resp": {"time": 1492128304090, "text": "Thank you, Sarah!\n\nWe appreciate you allowing us to serve you... and for the kinds words, too."}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "101542372322886397170", "name": "M Foster", "time": 1481735777966, "rating": 5.0, "text": "I went looking for a bed for my teenage son. He is autistic and has a very hard time going into stores.  The Sleep Center worked so patiently with my son's limitations.  They never made us feel like we were an inconvenience or that they were not interested in what was important to us.  It took 2 different trips to confirm what was the right fit for my son.\nEveryone on staff at The Sleep Center went above and beyond to accommodate us. From start to finish, they made us feel like we were family.  The Sleep Center is the only mattress store my family.", "pics": null, "resp": {"time": 1492128495088, "text": "Thank you for allowing us to serve your mattress needs. We appreciate it!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "106313989146867551759", "name": "MsYolanda Renee", "time": 1534618752629, "rating": 5.0, "text": "Courteous staff and excellent service. Always have the customer's best at heart.", "pics": null, "resp": {"time": 1535384575168, "text": "Yolanda, thank you for allowing us to serve you. It was a pleasure."}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "109218804703885207004", "name": "lisa schreiner", "time": 1550805478845, "rating": 5.0, "text": "Very helpful and very friendly! Highly recommend", "pics": null, "resp": {"time": 1550854679153, "text": "Thank you Lisa!!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "115951253805500393883", "name": "ZHIBIN YU", "time": 1565197374542, "rating": 5.0, "text": "perfect shopping experience，Cloee good service. This shop can find what I need.", "pics": null, "resp": {"time": 1565808184469, "text": "Thank you so much! Cloee is awesome!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "109513560887569258172", "name": "Lori Dubose", "time": 1465501663812, "rating": 5.0, "text": "I am very happy with my experience at the sleep center. I have back problems and had been hard pressed for a good night's sleep. Thanks for your professionalism and knowledge of your product", "pics": null, "resp": {"time": 1516760395753, "text": "Thanks for allowing our families to care for yours!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "104267230940694870563", "name": "Mary Bender", "time": 1592607196010, "rating": 5.0, "text": "Great experience with April!", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "118368089135121459496", "name": "Sheri Helton", "time": 1549407387033, "rating": 5.0, "text": "Micheal was great.He made sure we were happy with our purchase and helped us pick out what worked best for us.\nThanks for everything", "pics": null, "resp": {"time": 1549643234049, "text": "Thank You Sheri! I am very happy you enjoyed your experience!!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "106809341235254389781", "name": "Leslie Fisher", "time": 1551975571792, "rating": 5.0, "text": "Michael was an awesome salesperson they have earned a customer for Life the service is awesome the delivery and the delivery people are awesome they bent over backwards to see to it that we were happy.Thank yall for great service. We will refer everyone we know.", "pics": null, "resp": {"time": 1552489357075, "text": "Thank you for allowing us to earn your business Leslie!!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "112531862872017132930", "name": "Magali Barreto", "time": 1535252644022, "rating": 5.0, "text": "It's a place to go! Great service, outstanding customer service, they deserve your business. :)", "pics": null, "resp": {"time": 1535384405029, "text": "It was a pleasure serving you and your family Magali!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "108273193682305204817", "name": "Torie Martin", "time": 1455847004838, "rating": 5.0, "text": "I have made 3 seperate purchases from The Sleep Center. Everytime I have gone in I was immediately greeted. I have been very happy with all 3 of my purchases and will be sure to return for any other bedding needs.", "pics": null, "resp": {"time": 1516760547428, "text": "Thank you, Torie!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "111594450498040541288", "name": "Brittany Brannon", "time": 1535140453086, "rating": 5.0, "text": "Friendly and knowledgable sales reps, great sales, and no hassle delivery!", "pics": null, "resp": {"time": 1535384535236, "text": "Brittany, thank you for trusting us with your sleep!!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "107243792552847839783", "name": "Terri Shelton", "time": 1401208039549, "rating": 5.0, "text": "I had been all over Mobile to look for tmattress. I went in to sleep center and not only did I like their selection and prices but the customer service was outstanding!! To me, customer sevice is important, Nathan is very knowledgeable about mattresses and told me some extra things which helped in my decision making  I that the other salespeople at the other stores did not tell me. I never felt rushed to make a decision. Nathan knows how to treat customers!!!! For anyone looking for a mattress, The sleep center is the place to go!! I will definitely shop there again!!!", "pics": null, "resp": {"time": 1516760685236, "text": "We appreciate your 5-star review, Terri!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "114190342609947949847", "name": "alice frost", "time": 1441511388413, "rating": 5.0, "text": "Their customer service is excellent. I am excited to find the perfect mattress for our Luke Phillips Swing Bed!", "pics": null, "resp": {"time": 1516760558625, "text": "Thank you, Alice!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "113450321148678487611", "name": "Ashley Woodruff", "time": 1438531182963, "rating": 5.0, "text": "My husband & I have experienced three different Sleep center locations: Dothan, Al, Enterprise, Al, & Mobile, Al. All three of these stores have had exceptional customer service and an amazing inventory. Every staff member has been able to answer all of our questions or knows who to ask to get them.\n\nWe made our mattress purchase at the Mobile, Al location on Airport Blvd. Our sales reps were Michael & Nathan. Both of these gentlemen were extremely knowledgeable and helpful. We already knew which mattress we wanted from our previous trips to Enterprise/Dothan but they helped us pick out the perfect mattress cover/protector & sheets that would help alleviate my husbands severe allergies. Nathan also went to great lengths to get us the best discounts and price for our purchases.\n\nThe delivery of our new king mattress went smoothly. Our apartments are in Saraland, which is free, and our unit is on the 3rd floor. The delivery guys carried it up with no issues and were very friendly and helpful.\n\nOverall I would say that our experience has been amazing with every Sleep Center we have worked with. This is a great place to make a mattress purchase. They have a wide range of brands/prices & several special mattresses for allergy prone clients.", "pics": null, "resp": {"time": 1516760602996, "text": "Thanks for shopping with us and taking the time to leave us such kind words!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "105694419308112948099", "name": "Jay Schwartz", "time": 1515013497369, "rating": 5.0, "text": "This place made my shopping fun and educational.  Everything they carry is nothing but highly quality name brand product.  The store manager, Michael, is one of the friendliest, and probably one of the most honest persons, you will ever meet.\n\nAfter losing all my belongings in a fire, I decided to replace my Sofa Bed with a Futon, but knew nothing about them except for what I could find on the Internet, and had lots of questions.  I searched the Internet for places to buy, and right away noticed the Sleep Center with 30 Five-Star reviews, so off I went with over a dozen question in my head.\n\nWhen I entered the store, Michael was speaking with a customer on his cell, and upon seeing me asked the customer if he could greet me.  After we shook hands I told him to go back to his earlier customer, as I often deal with customers.  Once he was finished with his earlier customer I explained my predicament — he even remembered hearing about the fire.\n\nI told him what I had read online about Futons, and told every question I had, one at a time, which he answered, explained, showed and demonstrated one by one.  He never mentioned the word \"sell\", \"buy\" or \"purchase\" once.  The more questions I asked, the more he answered, explained, showed and demonstrated, as cheerful as when we fist said hello.  When I asked about the \"anti-slip pad\" that all internet articles said was a must for the mattress, he told me that it's true, but that they are nothing more than urethane foam anti-slip drawer liners available anywhere.  When I asked if he was serious, he lifted every Futon mattress they have on display to show me that that is all they use themselves.\n\nBeing an avid Geocacher, I asked Michael if he was.  He said he never heard of it, but could I explain it.  I always do one better by showing how the app works (and even the quickie online YouTube video), and point out nearby Geocaches on the app's map.  Mobile may now have new \"Cacher\" in the game.\n\nBack on track.  I bought my Futon right there on the spot.  When it was the day of delivery, their truck driver called me up exactly when they said he would, told me he was nearly loaded, and would be over in 20 minutes.  18 minutes later they were knocking on my door, two minutes ahead of the promised time from earlier in the week. 15 minutes minutes later, maybe less, I had a fully assembled Futon in my living room., without a scrap of paper or cardboard anywhere.  A perfectly professional and quality operation, from start to finish.\n\nI now need to replace my master bedroom bed, and I will be going straight back here.   I have no need to even visit anyplace else.\n\nThe bottom of all this:  if you need to buy a Bed, Futon, Mattress, or the like, or simply have questions about such, this is the place to go first.  You will be patronizing local, and patronizing family owned, and you'll never have to give it a second thought.  (If you're also a Geocacher, ask Michael if he has a game name yet.)", "pics": null, "resp": {"time": 1516760301546, "text": "We very much appreciate you allowing us to care for you, Jay!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "117051314503872550986", "name": "Randy Emrick", "time": 1520796229573, "rating": 5.0, "text": "Excellent service, very nice showroom,  excellent selection.  Quality choices at all price points.", "pics": null, "resp": {"time": 1520802611432, "text": "Thank you for your business and your 5-star review, Randy!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "113021067566236355451", "name": "Armando Cruz", "time": 1597608288674, "rating": 5.0, "text": "Excellent service", "pics": null, "resp": null, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "114887734540251503966", "name": "liz garza", "time": 1470423764997, "rating": 5.0, "text": "Just had the best experience at the new mcgowen park location... walked out literally 15 minutes later with a great deal on some quality mattresses!", "pics": null, "resp": {"time": 1516760336900, "text": "Thanks for your 5-star review, Liz!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "101814161338492476475", "name": "pretty Cherokee", "time": 1578605352086, "rating": 5.0, "text": "April you rock", "pics": null, "resp": {"time": 1581439457740, "text": "You rock too!! Thank you!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "107389660440733516465", "name": "David Stein", "time": 1541381456985, "rating": 5.0, "text": "Great product and professional staff", "pics": null, "resp": {"time": 1541441348071, "text": "Thank you for the 5 star review!!"}, "gmap_id": "0x889a4d7350d88ab9:0x2ca38cf06b581b9e"}
{"user_id": "108871584047021955500", "name": "Mouse House", "time": 1600224222914, "rating": 1.0, "text": "I do not recommend Mr. Sandman. Instead of the Jameson box springs I paid for (and which was displayed with the Jameson mattress as a matched set in the showroom) they delivered a cheap, unbranded box springs in a different color. I was promised $100 credit because they delivered the wrong box springs, one month later Mr. Sandman has still not issued the credit. I had also paid an additional $75 for mattress to be safely delivered in a van or enclosed box truck; instead, mattress and mismatched box springs were delivered squashed inside the open back of an unmarked regular size pickup truck... and delivered five hours late. A bad experience for me with Mr. Sandman.", "pics": null, "resp": null, "gmap_id": "0x888c2be769bf21ef:0x4ef1ad73e38f4b28"}
{"user_id": "107465312447395640100", "name": "Vivian Simmons", "time": 1611418541966, "rating": 2.0, "text": "They announced going out of business sale but never seen to be  open. Was looking for a recliner went to biglot", "pics": null, "resp": null, "gmap_id": "0x888c2be769bf21ef:0x4ef1ad73e38f4b28"}
{"user_id": "108610465414230170882", "name": "Regina E. Coley (MotivatHER)", "time": 1587493718432, "rating": 5.0, "text": "Got a nice king size mattress and had it delivered. They even dumped my old mattress to help out. Excellent customer service. Will be visiting again soon.", "pics": null, "resp": null, "gmap_id": "0x888c2be769bf21ef:0x4ef1ad73e38f4b28"}
{"user_id": "102555391452701893843", "name": "chris fraley", "time": 1590789435325, "rating": 5.0, "text": "Great experience.  They were very friendly and  nice. Worked with  me on my budget. Thank you", "pics": null, "resp": null, "gmap_id": "0x888c2be769bf21ef:0x4ef1ad73e38f4b28"}
{"user_id": "117711024215352653005", "name": "Alexander Gearhart", "time": 1550585672574, "rating": 5.0, "text": "Great customer service and amazing prices! They will load your mattress onto your vehicle or offer a reasonably priced delivery service to your home. Don't judge the book by it's cover; this is a great place to buy a mattress.", "pics": null, "resp": null, "gmap_id": "0x888c2be769bf21ef:0x4ef1ad73e38f4b28"}
{"user_id": "106200507644610512422", "name": "Cynthia Schaefer", "time": 1559242673815, "rating": 5.0, "text": "Very punctual for delivery. Said they would deliver between 1 and 3 today and they were here at 1:00. Greatly appreciated that.  Also have stage 4 breast cancer and because of neurauphathy from chemo had fallen and had to have spinal fusion last Friday so was not able to go to show room.Spoke to Willie explaining situation and needs and he was able to hook me up withmattress and box springs at a great price and good support for my back. AWESOME CUSTOMER SERVICE and greatly appreciated.", "pics": null, "resp": null, "gmap_id": "0x888c2be769bf21ef:0x4ef1ad73e38f4b28"}
{"user_id": "100604356595517614634", "name": "Kenny Howard", "time": 1591914887080, "rating": 5.0, "text": "knowledgeable and friendly staff, and great selection!", "pics": null, "resp": null, "gmap_id": "0x888c2be769bf21ef:0x4ef1ad73e38f4b28"}
{"user_id": "114489379556064601480", "name": "Judi Kemp", "time": 1521639248540, "rating": 5.0, "text": "Salesman was great. It took us less than twenty minutes to purchase. Showed us just what we asked for. Love my new bed... Millbrook has great salesman.", "pics": null, "resp": null, "gmap_id": "0x888c2be769bf21ef:0x4ef1ad73e38f4b28"}
{"user_id": "108811439979450084512", "name": "Scott S", "time": 1563597393454, "rating": 5.0, "text": "Good experience here. The salesman was friendly and very helpful!", "pics": null, "resp": null, "gmap_id": "0x888c2be769bf21ef:0x4ef1ad73e38f4b28"}
{"user_id": "114156579740539812500", "name": "Bea Kniseley", "time": 1531133510468, "rating": 5.0, "text": "Always love Mr Sandman. Been buying mattresses there for 20 years.", "pics": null, "resp": null, "gmap_id": "0x888c2be769bf21ef:0x4ef1ad73e38f4b28"}
{"user_id": "114974939110807835232", "name": "Sheila Parsons", "time": 1554349089432, "rating": 5.0, "text": "Great prices & service!!!", "pics": null, "resp": null, "gmap_id": "0x888c2be769bf21ef:0x4ef1ad73e38f4b28"}
{"user_id": "106394158086099492267", "name": "Daniel Sordo", "time": 1531268410410, "rating": 1.0, "text": "Cheapest mattresse their is 250", "pics": null, "resp": null, "gmap_id": "0x888c2be769bf21ef:0x4ef1ad73e38f4b28"}
{"user_id": "105060588449626308117", "name": "David York", "time": 1550964449912, "rating": 5.0, "text": "Very friendly", "pics": null, "resp": null, "gmap_id": "0x888c2be769bf21ef:0x4ef1ad73e38f4b28"}
