{"user_id": "105886515355244731840", "name": "Bonnie Shoultz", "time": 1612157550724, "rating": 5.0, "text": "I have not had the pleasure to shop at Lush personally. However, after watching Tim’s videos and his heartfelt love and concern for not only his business, but, other small businesses during this time of uncertainty, I would just love to hug him and pledge my business to Lush!\nTim, your heart is absolutely precious and your Mother would be so proud ❣️", "pics": null, "resp": {"time": 1612198773735, "text": "OMG... you brought tears to my eyes...  it's been such a hard 12 months for so many...  your kindness to take the time to send this is very much appreciated.   Tim"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "113677509565686769062", "name": "Caryn Janecky", "time": 1627006267980, "rating": 5.0, "text": "Highly recommend their class! So fun!", "pics": null, "resp": null, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "114783796166118473344", "name": "Kathleen Kerns", "time": 1611245388210, "rating": 5.0, "text": "I am not local and needed two plant arrangements delivered to two different locations after the loss of a loved one.  I called, and Susan was so helpful - she shared with me in clear detail what my available options were.  Ultimately, I entrusted her with the selection and design.  The recipients sent pictures of the delivered arrangements, and they were exactly what I had in mind!", "pics": null, "resp": {"time": 1611246887211, "text": "Thank you so much for taking the time to tell us about your positive experience.  We are a small local business and are very grateful for you and so happy you are pleased."}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "100609825799829134686", "name": "cross nic", "time": 1558063501532, "rating": 5.0, "text": "The Lilys bloomed today!!!!!!   I live 1,300 miles away and they helped get an arrangement to my mom. It was beautiful and spectacular and made her smile like she deserves, especially on Mother's Day. THANK YOU", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPYVy-N6HpXR8lRIZY6nlcDBANb-E02FgLxKmpU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO5xyNpxhycTNbDgerOLxJAAk_iHdFtb2U_fYa1=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "111128080097405065198", "name": "Carolyn Davis", "time": 1606237058142, "rating": 5.0, "text": "Gorgeous flower arrangements and the best place to stop for one of a kind gifts.  The candles smell delicious.", "pics": null, "resp": null, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "109628111469305384054", "name": "Sonya Bumpers", "time": 1585673283884, "rating": 5.0, "text": "All of my floral designs, aromatic candles and delivery experiences with Lush Home and Garden Event Center have been nothing but exceptional.\nI live in Birmingham and have placed orders over the phone including my payments and the experience was without fault.\nTim Burt, and his amazing staff have gone above and beyond in surprising my Aunts,  Uncles, Girlfriends and Father.\nThanks, for phenomenal customer service and all the love that is put into each order and delivery.\nMy Aunt still smiles about the day of her delivery arrived, the  arrangements was beautiful of course, however she seemed more delighted in the handsome youngman in his apron bring the delivery, this made her day.\nWhen your business is so designed to bring joy and delight to others, it is indeed a pleasure when that if filled to the utmost and the purchaser feels good also.\nTo the Lush Management and Staff.\nI Wish You Enough!\n\nSonya Bumpers", "pics": null, "resp": {"time": 1594999858079, "text": "Wow!   Thank you Sonya... your support over the years means more than you will ever know and taking the time to review us means a lot.."}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "114920233885710075351", "name": "Brock Killingsworth", "time": 1602100025592, "rating": 5.0, "text": "Lush is the best. Always friendly, always great flowers, always fantastic gift ideas.", "pics": null, "resp": null, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "103257903978429048330", "name": "Alexandrea West", "time": 1585670892070, "rating": 5.0, "text": "Lush is my favorite place to shop for everything from candles, to home lighting, to thoughtful and unique gifts. The service is always above and beyond the norm. I appreciate their creative input and always trust that anything I go to them for will be above and beyond my expectations.", "pics": null, "resp": {"time": 1595000033603, "text": "Thank you for taking the time to review us!!  So pleased that you are happy with your experience and we look forward to working with you in the future... we also admire your fabulous work...  Thanks again..."}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "107485734790553593362", "name": "Bobbi Sue Thomas", "time": 1540225821221, "rating": 5.0, "text": "Lush is such a breathe of fresh air in Midtown Mobile. The owner, Tim, is so personable and always so kind. I can always find the perfect gift for any occasion and they always go the extra mile to wrap it beautifully. Cannot say enough good things about this store. It is wonderful!!", "pics": null, "resp": {"time": 1550763347661, "text": "Thank you so much for saying these wonderful things...    As a locally owned business we couldn't make it without the support of our regular customers.  We try hard to go the extra mile with fresh flowers on our gift wrap and walking folks to their car... because we actually love what we do!  So grateful you took the time to rate us!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "115437252287988354194", "name": "Henry Hudson", "time": 1575879804961, "rating": 5.0, "text": "Thank you so much for arranging a last minute beautiful bouquet and delivering it so quickly with just a phone call!! My best friend loves it and it made her smile when her birthday wasn’t going so great.", "pics": null, "resp": null, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "108270428953572181928", "name": "Sarah Baxter", "time": 1585671505899, "rating": 5.0, "text": "Thank you LUSH!! I had a horrible experience from ordering flowers from FTD.com. I purchased $100 bouquet for my cousin, and they sent a dreadful arrangement (that looked like it came from Walmart). I immediately called LUSH to see if they could send the flowers my cousin deserved. I am still in awe of the arrangement Tim and his team created. I will never make the mistake of using anyone other than LUSH again.", "pics": null, "resp": {"time": 1594999933237, "text": "Sarah... Thank you so much for taking the time to review us.  We are so grateful we were able to please you and look forward to working with you again..."}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "114145603636042178482", "name": "Susan Cook", "time": 1575144797933, "rating": 5.0, "text": "Incredible work with an amazing staff!! Perfectly located in downtown Mobile but flexible with punctual deliveries. 10/10 would recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "110080096337279853167", "name": "Luke Boothe", "time": 1531001757279, "rating": 5.0, "text": "I’ve been to Lush numerous times for flowers and gifts and have never had anything that wasn't\nnothing but beautiful. Their arrangements are the best in Mobile. The staff is super friendly.\nKEEP UP THE GOOD WORK LUSH!!!", "pics": null, "resp": {"time": 1550763376773, "text": "Thank you Luke for such a great review!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "105420793776116459034", "name": "Ashley Gunter", "time": 1594990909013, "rating": 5.0, "text": "Absolutely one of the most elegant and beautiful shops in Mobile,Al.", "pics": null, "resp": {"time": 1594999729360, "text": "What a wonderful thing to say.  We will continue to try and live up to your praise!!   Thank you for taking the time to review us!!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "109470761590681385269", "name": "Jillian Rosandich", "time": 1550761442435, "rating": 5.0, "text": "LUSH is a beautifully curated space and such a joy to browse (I could spend hours!), especially thanks to the luxe scented candles and floral arrangements. Tim, the owner, is so kind and really knows his stuff. This is a true midtown destination and a must-stop shop for anyone that loves home decor.", "pics": null, "resp": {"time": 1550763121305, "text": "Oh My Goodness!  Thank you so much for taking the time to express this .  It means so much to me and my team.  As a local business we work hard to be a place everyone enjoys shopping. We want to be known as the \"where did you get that?\" store.   Again your kind words are much appreciated... Tim"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "101660943912617752219", "name": "Courtney Mcdonald", "time": 1514415567807, "rating": 5.0, "text": "I love this place sooo much!! It’s the perfect place for gifts, or home decor! And the customer service is over the top!! I came in the Friday before Christmas for a last minute gift, and everyone so nice, especially for it to have been as busy as it was! I felt like just hanging out for a while and chatting because everyone was just so friendly!! The gift set I purchased was already wrapped really cute but they took the extra time to “spruce” up the bag even more! It’s the little things like that, that make shopping experiences so much better than other places. This is now my go-to spot for gifts and such!! Thanks Lush!! I have been sure to tell everyone about this little hidden gem!", "pics": null, "resp": {"time": 1514421962289, "text": "Wow!! Thank you so much for taking the time to write such a lovely review.  I have a great staff and we love what we do.  This review will make everyone’s day!!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "117229372277656497696", "name": "Jennifer Pool", "time": 1495131428876, "rating": 5.0, "text": "What a wonderful experience! Excellent customer service, amazing flower arrangements and a beautiful store full of wonderful gifts!! I cannot say enough about Lush - Tim and Jonathan were just the best! Lush is a jewel - you must visit!!", "pics": null, "resp": {"time": 1495142695031, "text": "Thank you so much for taking the time to review us and we are so grateful for your kind words...  Next time you are in we want to treat you to one of our Coastal Candles   on us!!!  Thanks again.... Tim"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "115434050811133004986", "name": "Boyd McGehee", "time": 1581870842386, "rating": 5.0, "text": "This store is a gem for the state of Alabama! One of a kind.", "pics": null, "resp": {"time": 1595000150334, "text": "Thank you so much for taking the time to review .  And such an amazing compliment...because i know you are well traveled and to give us such high praise we are very grateful.."}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "117884500759454526803", "name": "sara lee", "time": 1568308095847, "rating": 5.0, "text": "Amazing and different looking arrangements.  Beautiful selection of houseware lighting and furniture too.  I sent their Mardi Gras candle off to my adult kids to remind them of home.", "pics": null, "resp": {"time": 1595000169339, "text": "Thank you so much!!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "114389021212444708620", "name": "Hiram Young", "time": 1533596159537, "rating": 4.0, "text": "I went to a boarding school in the area and Lush is my go to place for corsages for school dances. The ones I got always looked MILES better than those of the same price from other local florists, and the people working the desk and making the corsages will talk to you and look at pictures of your dates dress and your tux and discuss your color and design options.", "pics": null, "resp": {"time": 1533614532564, "text": "Thank you. So happy you were pleased!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "101735178950596529735", "name": "Laila Boucher", "time": 1566591253209, "rating": 5.0, "text": "The BEST service and store in Mobile! I just love my treasures from this store!", "pics": null, "resp": {"time": 1595000201174, "text": "THANK YOU SO MUCH!!  So nice of you to take the time to review us!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "115757145031445845993", "name": "Geaux LSU", "time": 1479316036427, "rating": 2.0, "text": "Gorgeous place with very nice pretty things! But the customer service was not great! Walked in was in awe of how nice the store was...A guy was on the phone he didn't try to acknowledge  my sister-in-law and I ...We stood there for 3 Min and still no \"Give me a sec\", \"It'll be one min\"! I would've understood if he would've just at least \"Hi, how are you\" but nothing was said! So we politely walked out! When we really wanted to purchase things!", "pics": null, "resp": {"time": 1479320781519, "text": "I saw you look through the windows... I checked our cameras and never saw you enter the store... Would love to speak with ... Thanks  Tim"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "116983222159874728447", "name": "Stephen Page", "time": 1530981993369, "rating": 1.0, "text": "I will try post the picture I just took of the wilted sunflowers delivered by \"Lush\". Unfortunate that someone within this company decided to deliver wilted flowers to a funeral. They conveniently left the shops name and address for me to find quickly on Google.", "pics": null, "resp": {"time": 1530999531203, "text": "When the arrangement was delivered yesterday it was fresh and gorgeous. We received a call today from the funeral home that the heat had wilted them. We sent one of our designers out immediately at no cost and completely redid the arrangementNot sure what else we could have done.   Please show that pic."}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "116872832156258744765", "name": "Emma Peace", "time": 1530025596943, "rating": 4.0, "text": "Owner Tim is delightful. He has beautiful items that everyone would love.", "pics": null, "resp": {"time": 1550763414384, "text": "Thank you!   We try so hard and we appreciate your continued support!\n\nTim"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "103873214686493339052", "name": "Rebecca Kramer", "time": 1537118398639, "rating": 5.0, "text": "I received a beautiful arrangement on my birthday this year from my daughter. I can't wait to go purchase something from Lush for her birthday.", "pics": null, "resp": {"time": 1537146785031, "text": "Thank you so much. We really appreciate your business and we  are glad u loved ur arrangement!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "112520132744457246675", "name": "Rob Bright", "time": 1586037247780, "rating": 5.0, "text": "Best store in Mobile & Tim is fantastic!!!", "pics": null, "resp": {"time": 1594999764626, "text": "Thank you Rob..  I appreciate you taking the time to review us!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "113699469425066465803", "name": "BrotherTy Page", "time": 1541555781483, "rating": 5.0, "text": "The best florist in MOBILE!", "pics": null, "resp": {"time": 1550763203804, "text": "Thank you so much for saying that.  We really make it our goal on EVERY arrangement to please the customer and put a smile on their face.  I am grateful for your taking the time to give us such a positive review..  Tim"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "117619087356898424876", "name": "Jack Pierre", "time": 1464123944414, "rating": 5.0, "text": "Fantastic candles and extraordinary floral work", "pics": null, "resp": {"time": 1479320824995, "text": "Thank you so much!!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "114672271926039501087", "name": "RegularGamer PlayZ", "time": 1528492131982, "rating": 1.0, "text": "Very rude costumer service! Was told my son could not have a seat in there store! I felt it was a racist comment for sure!!!!", "pics": null, "resp": {"time": 1550763567632, "text": "So sorry you felt that way.  We have signs posted on most every chair to not sit...mostly meant for children...because we sell upholstery off the floor and must keep it \"unused\"   Please don't feel that you were singled out... trust me you were not...  we regular ask folk to please not sit unless they are actually interested in purchasing the chair they wish to sit in."}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "108399484139241757534", "name": "Joe Watts", "time": 1581373167430, "rating": 5.0, "text": "My favorite part of the Birmingham Botanical Gardens--and the best place I've found to birdwatch in the gardens. Love all the wildflowers!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMAUvrwJfMbSMqWq7oKTS2qsPoqESo9kozEtpfB=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891a2e91624bd7:0x22c934134b4ea14c"}
{"user_id": "112510564504541128175", "name": "Alice Thompson Moore", "time": 1569339601813, "rating": 5.0, "text": "Awesome volunteers and staff make this Jewel of a garden one of the highlights of the Birmingham Botanical gardens", "pics": null, "resp": null, "gmap_id": "0x88891a2e91624bd7:0x22c934134b4ea14c"}
{"user_id": "109665500613578408768", "name": "andrew reynolds", "time": 1559433041820, "rating": 5.0, "text": "Beautiful collection of wildflowers!", "pics": null, "resp": null, "gmap_id": "0x88891a2e91624bd7:0x22c934134b4ea14c"}
{"user_id": "101176860894649663514", "name": "Yaser A", "time": 1622416822907, "rating": 5.0, "text": "Wonderful area", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMg-KJ_qTh0xXFYkKwm555xrQrodJTRrSAopMvQ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891b812f8d7421:0xd57c42f3b2e72712"}
{"user_id": "106083729043154296274", "name": "Stephen Higginbotham", "time": 1521399684779, "rating": 5.0, "text": "Awesome little hosta farm.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO-Q11XdHN_ST_W_07CQkgcg-vdU_LF3ejK5UQ_=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88896caf6eb333d9:0x4e6b2d179041f96b"}
{"user_id": "111022823856562138716", "name": "Keith Krininger", "time": 1500837713933, "rating": 5.0, "text": "We would like to acknowledge what a wonderful experience we had working with Alabama Landscape Creations.  Their management is knowledgeable, friendly, and prompt.  We had a large project with a large seawall, double waterfall, and 2 flagstone decks, not to mention the beautiful  landscaping job they did.  We get compliments every time someone visits, even from boaters passing by.    Most importantly, they stand behind their work and if you have a problem, they will fix it.  We highly recommend them!!  Keith and Kay K.", "pics": null, "resp": null, "gmap_id": "0x888ecde8558086ab:0x4b420a673611a607"}
{"user_id": "116138046102982294502", "name": "David Wilson", "time": 1423276199903, "rating": 5.0, "text": "ALC came up with a plan that solved a very challenging erosion problem on my steeply sloped lot that fit my budget, looks fantastic and was completed ahead of schedule.  Jake and everyone I met was very professional and I recommend them highly.", "pics": null, "resp": null, "gmap_id": "0x888ecde8558086ab:0x4b420a673611a607"}
{"user_id": "107555288422752965429", "name": "Denise M", "time": 1619444271929, "rating": 5.0, "text": "We were staying at the Monte Sano State Park Campground and the beautiful Japanese Garden is right next to it. The grounds are well groomed and taken care of. It is so peaceful walking through the trails. We sat down for a few minutes to just take in all the calming sounds of the birds, trickling water, the bees buzzing. Total serenity!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPjr1AErc8TM_R5t64ERzwapKcC4hyypiF-sMpD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMnxM298GQfH02tEhtrQH8qIUa_1-oj-6ZWijzB=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886214166f78334f:0xdafd57eff660a4bd"}
{"user_id": "116257981050618771582", "name": "Janelle Cluff", "time": 1622581237111, "rating": 4.0, "text": "Nice little trail, but not stroller or ADA friendly.  We still enjoyed it.", "pics": null, "resp": null, "gmap_id": "0x886214166f78334f:0xdafd57eff660a4bd"}
{"user_id": "100832620484410693878", "name": "Nancy Testa-Meyer", "time": 1623543398708, "rating": 4.0, "text": "Very picturesque... other future projects are being worked on", "pics": null, "resp": null, "gmap_id": "0x886214166f78334f:0xdafd57eff660a4bd"}
{"user_id": "116881341890830285671", "name": "mai", "time": 1581978687891, "rating": 5.0, "text": "This was so cute. It’s on the Fire Trail so make sure you take a map with you. Sadly, some visitors have carved their names into the wood but overall, it’s so beautiful with its own rake garden. The Monte Sano State Park does cost $5 per person but once you go in, you’ll see why. It’s kept very well.", "pics": null, "resp": null, "gmap_id": "0x886214166f78334f:0xdafd57eff660a4bd"}
{"user_id": "115129749753101993678", "name": "John Muhlhauser", "time": 1514204781986, "rating": 5.0, "text": "Very well kept and beautiful", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP5I0eF6moyYXDjqm0EJkW8EjlwgoV7OwovdrGd=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886214166f78334f:0xdafd57eff660a4bd"}
{"user_id": "100190675819914972854", "name": "Bri Chivatero", "time": 1553462378759, "rating": 5.0, "text": "This is a true hidden gem of Huntsville -- it's small, but it's beautiful, and they sometimes do Japanese Festivals, which are fun opportunities to experience small parts of another culture. Regardless of whether there is a festival going on, I encourage everyone to come enjoy this garden. It's a good place for non-hikers to enjoy the fresh air, and it's visually appealing for hikers as well, so it has potential as a bonding experience, too.", "pics": null, "resp": null, "gmap_id": "0x886214166f78334f:0xdafd57eff660a4bd"}
{"user_id": "113211357750397439598", "name": "AJ Taylor", "time": 1526393375693, "rating": 5.0, "text": "Wonderful place to sit and relax, take in nature and enjoy for all it's worth. A very short walking distance from at least 3 trail entrances, once you find the garden it is like entering a secret world. It's a magical place early in the morning, evokes a feeling of divine solitude, yet so very close to civilization. Could do with some maintenance, but the slight wear and wildness to the area adds to the splendor.", "pics": null, "resp": null, "gmap_id": "0x886214166f78334f:0xdafd57eff660a4bd"}
{"user_id": "109937174259211254747", "name": "Chris Hardy", "time": 1556741547550, "rating": 5.0, "text": "They've done a great job of taking care of this place lately.  They've added some new greenery and dusted off all of the spider webs.  All around peaceful area.", "pics": null, "resp": null, "gmap_id": "0x886214166f78334f:0xdafd57eff660a4bd"}
{"user_id": "104140906636911258577", "name": "Monster Babe", "time": 1538900248888, "rating": 2.0, "text": "Its really a nice concept and lovely that someone started it. But very misleading. If I drove more than 20 minutes to visit,  I would be extremely disappointed.", "pics": null, "resp": null, "gmap_id": "0x886214166f78334f:0xdafd57eff660a4bd"}
{"user_id": "105628614983362200226", "name": "Stacy McCurry", "time": 1571285047997, "rating": 3.0, "text": "Rather small only a few Japanese features, like red bridges and an open pagoda.", "pics": null, "resp": null, "gmap_id": "0x886214166f78334f:0xdafd57eff660a4bd"}
{"user_id": "102458774662056004660", "name": "Abriza Love", "time": 1597095185603, "rating": 5.0, "text": "BEAUTIFUL!", "pics": null, "resp": null, "gmap_id": "0x886214166f78334f:0xdafd57eff660a4bd"}
{"user_id": "109988953529100485894", "name": "Melissa Gray", "time": 1546453607221, "rating": 5.0, "text": "Beautiful beautiful beautiful! ❤", "pics": null, "resp": null, "gmap_id": "0x886214166f78334f:0xdafd57eff660a4bd"}
{"user_id": "116480561621302410035", "name": "Pamela Hideko", "time": 1528922365419, "rating": 5.0, "text": "Beautiful little area, I love it", "pics": null, "resp": null, "gmap_id": "0x886214166f78334f:0xdafd57eff660a4bd"}
{"user_id": "110154943154713041748", "name": "Olivia Buchanan", "time": 1562096509525, "rating": 3.0, "text": "Underwhelming, and trail doesn't go very far", "pics": null, "resp": null, "gmap_id": "0x886214166f78334f:0xdafd57eff660a4bd"}
{"user_id": "116986132333261484221", "name": "Lee Griggs", "time": 1508095697526, "rating": 5.0, "text": "Beautiful Japanese Garden!", "pics": null, "resp": null, "gmap_id": "0x886214166f78334f:0xdafd57eff660a4bd"}
{"user_id": "109291812664393294752", "name": "Andou N. Jennifer", "time": 1618247638684, "rating": 5.0, "text": "A place to grow fresh goods. You can eat healthier if you decide to plant some vegetables!", "pics": null, "resp": null, "gmap_id": "0x888cf3722c918c7b:0xca56aab61f122357"}
{"user_id": "112619719615826372100", "name": "Rashmi Karki", "time": 1576133724491, "rating": 5.0, "text": "Best vegetable, friuts and flower garden. Clean and peaceful environment", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPLQ03IFfeyHyUN16xyQllGAwtLBsDy-72o7oB4=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cf3722c918c7b:0xca56aab61f122357"}
{"user_id": "104078205706963524250", "name": "Travis Engram", "time": 1595111905830, "rating": 5.0, "text": "Great local spot where you can rent a garden plot and grow your own food. We had a lot for 2 years before going raised beds in the yard. Awesome people and easy to deal with", "pics": null, "resp": null, "gmap_id": "0x888cf3722c918c7b:0xca56aab61f122357"}
{"user_id": "116756850596158806680", "name": "D BS", "time": 1526348305906, "rating": 5.0, "text": "Give your love/ dream of gardening a real touch...let's play again in soil..get nostalgic", "pics": null, "resp": null, "gmap_id": "0x888cf3722c918c7b:0xca56aab61f122357"}
{"user_id": "113070910232365622376", "name": "Nic Tnt", "time": 1554576698300, "rating": 5.0, "text": "Great place!!!!", "pics": null, "resp": null, "gmap_id": "0x888cf3722c918c7b:0xca56aab61f122357"}
{"user_id": "108080649761243367663", "name": "Elizabeth Cameron", "time": 1525212830528, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x888cf3722c918c7b:0xca56aab61f122357"}
{"user_id": "103374242086324184034", "name": "Samuel Tullis", "time": 1608064225192, "rating": 5.0, "text": "Top Notch Company!", "pics": null, "resp": null, "gmap_id": "0x888e817bb6d0ac95:0xa97419063f3db98c"}
{"user_id": "105632281110573076453", "name": "Jim Woods", "time": 1523366848620, "rating": 4.0, "text": "Tight covered dock but a worker helped me back in.", "pics": null, "resp": null, "gmap_id": "0x888e817bb6d0ac95:0xa97419063f3db98c"}
{"user_id": "100489949331553297808", "name": "CASA DE VIDA IGLESIA PENTECOSTES INC", "time": 1580585145546, "rating": 2.0, "text": "(Translated by Google) More or less\n\n(Original)\nMás omenos", "pics": null, "resp": {"time": 1580618084892, "text": "(Translated by Google) Yes\n\n(Original)\nSi"}, "gmap_id": "0x888d39b7a5582fc9:0x836cd75b5931cbe8"}
