{"user_id": "113949290174597058316", "name": "Jeff Roquet", "time": 1627921831641, "rating": 5.0, "text": "Jen and the team at The Plumbers LLC are fast, friendly, and won’t break the bank. I would recommend them to family, friends and anyone in need of anything plumbing related. 5 Stars isn’t high enough for this company!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "113672523187704516534", "name": "Angela Cummings", "time": 1629419698668, "rating": 5.0, "text": "Did a really good job! The issue was not apparant at first, but technician kept looking for the problem using a process of elimination. We would call again if needed.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "108895037627206225709", "name": "Frank Mullinax", "time": 1623684715972, "rating": 1.0, "text": "Do not use this plumber.  The owner does not stand behind his work.  I had him come out for a Master bath remodel to replace a tub valve and re-route/rough in plumbing to a walk in shower.  His plumber that came out to do the initial work did not turn the new valve to the bath tubs water on, and after tiling up the shower and trying to turn the bath water on, there was no water.  Had to go back in through the tile and found out the valve was never turned on/tested to the tub.  The rough-in work to the shower ended up being so poorly done, we are having to hire another plumber to come out and go in through the wall to fix the shoddy work that was done.  The plumber that came out to do this initial work was too concerned with having to leave early to officiate a soft ball game.  The worst thing about it is the owner is not standing behind his work and fixing himself. He has repeatedly blown me off and will not come back out.  I could also go in to how he threatened legal action if I didn't pay him for partial work before the job was completed, but that is another story.  If he is that concerned about needing money before a total job is completed, not a reputable plumber.  Beware", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "100471872745315618700", "name": "Katherine Surrett", "time": 1611781364536, "rating": 5.0, "text": "Highly recommend The Plumbers! They have done two jobs for me in the last two months- fixed a leak with our toilet and installed a new water heater. They did a great job with both! Their customer service has been wonderful, everyone I’ve spoken with has been very helpful and respectful, and they came out quickly and did a quality job. I will definitely continue to use them!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "105228963036381545759", "name": "Meredith Peters", "time": 1596225150764, "rating": 5.0, "text": "Wow, best experience with a plumber in a long time! They were here the next day as a second opinion to fix a flange on a toilet seat. We had previously been quoted almost $1000 to fix this issue, but these guys did it for $225! They were professional, courteous, and fixed it well. Definitely would use again and will recommend to anyone from now on!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "100536477405397121802", "name": "Heather Lofthus", "time": 1596136262815, "rating": 5.0, "text": "Fast, affordable service! Jen got us on the schedule as soon as I called and the next day Ransom and Jared were out to fix our issue. Very knowledgeable and polite! Will be calling these guys for all future plumbing needs!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "118423908659117090464", "name": "Family Savvy", "time": 1522691914899, "rating": 5.0, "text": "I've used Mike Myers and his team~The Plumbers~for more than 5 years. They did all plumbing on a recent home renovation, and Mike did an excellent job installing a pedestal sink atop an antique piece with marble (photo below). Whenever I text Mike, he responds quickly (often same day) and has always been more than fair in his pricing. My #1 choice for all of my plumbing needs.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO4DKqf-8TvNH6JrGg12peCn5-mymKHghDWQk-4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipORWkhgUXt4ArGk9GcwA0uGAD7qlpEUVL4-5KF2=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "102858978908850956142", "name": "Tyler Disharoon", "time": 1596559411916, "rating": 1.0, "text": "By the far the worst experience with a plumber. Came out and gave a quote and said he would return 2 days later and begin the work. Never showed. Called to follow up and he committed to coming that afternoon. Never showed.  Called again to get him to come out. Said he’d be there the next day. Now he won’t answer or return calls. If you would like someone to start a job and never finish and leave you with water running everywhere...call these folks and they will leave you ya hangin.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "108558886778844128581", "name": "Kim Akridge", "time": 1573776593263, "rating": 5.0, "text": "Came out on short notice. Fair price to replace hot water heater. Very professional. Definitely would recommend.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "116368463106041625479", "name": "Daniel Dyson", "time": 1602393310020, "rating": 5.0, "text": "Hands down the best experience I have ever had with a plumbing company or service company in general. Call these guys!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "112779160186450525351", "name": "Major Tom", "time": 1556809740120, "rating": 5.0, "text": "Great service at a fair price. Called Mike with a water leak in the wall at 7:00am. He had at truck at my house by 9:00. The tech was very knowledgeable and did a fantastic job. Will definitely use The Plumbers again if the need should arise", "pics": null, "resp": {"time": 1573670177953, "text": "Thank you for the wonderful review. Call us anytime with any problems and will be there as quick as possible. We look forward to serving you again."}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "110763218095878900735", "name": "Cindy Partlow", "time": 1567535102571, "rating": 5.0, "text": "This is the second time that I have used The Plumbers LLC - great service both times. Mike is easy to work with. Very knowledgeable and professional. Good clean up after the work. Will use again.", "pics": null, "resp": {"time": 1573669181890, "text": "Thank you so much for your feedback Cindy. We appreciate your business and kind words and hope you are doing well."}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "108481586427300588137", "name": "Rachel Beasley", "time": 1581622924799, "rating": 1.0, "text": "After $350 and several visits over the course of a week including removal of fixture and scoping the lines, our toilet issue was still not resolved and began leaking blue liquid from the tank onto the floor, causing a mess for us to clean up. Hate to muddy the 5 star reviews, but $350 for multiple interruptions (and messes) and zero fix to a seemingly straight forward issue isn’t ideal for our schedule nor budget.", "pics": null, "resp": {"time": 1581641080032, "text": "Im sorry to hear this mrs beasley, i am looking into the matter , since we ran the camera down the drain i will have video evidence of that, also of the final product when we finished the job. I have the file from jan 23 ."}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "109678879373314166686", "name": "Lauriann Loveless", "time": 1559320555633, "rating": 5.0, "text": "So we had 5 leaks we patched, kept leaking. Had enough, called the pros.  They were here less than 2 hours, all fixed and to be honest less expensive than our patch jobs .  Trever was awesome.  They were respectful and neat. We live on a farm and they were good around the horses and dogs.  Will never do another patch job. Highly recommend. Thanks guys.", "pics": null, "resp": {"time": 1573670106977, "text": "Thank you Lauriann. Your business is very important to us. We look forward to serving you again."}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "109882145467130419807", "name": "Erik Brown", "time": 1536962177224, "rating": 5.0, "text": "Trevor and Brian came over and did a excellent job! Very friendly and hard working. Great job! I highly recommend them! Thanks!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "104625050976105400827", "name": "Marie Adams", "time": 1596126856865, "rating": 5.0, "text": "They were on time and did a great job.  I would use them again.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "113243534937632806676", "name": "Daryl Russo", "time": 1585149808736, "rating": 1.0, "text": "My office hired The Plumbers, LLC., to replace a gas water heater yesterday.  Today we all walked into the office and there was an obvious gas leak.  We called them back and opened all our doors to air out the fumes. When they arrived, they could smell it as well and found the leak.  A leak they told me was caused by their installers who did NOT check their work after moving the water heater into place.  With something as dangerous as natural gas, this level of incompetency is unacceptable.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "101199769171875663660", "name": "Robin H", "time": 1525993962665, "rating": 5.0, "text": "Prompt, VERY CLEAN, honest and conservative, priced very well, answers urgent issues day or night. I HIGHLY RECOMMEND them and have used them for more than 5 years for a wide variety of Services at my home and other properties. Mike is worth the wait even if he’s booked!  I trust him and his team. Very personable!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "102213513662387927131", "name": "Dionne Lovett", "time": 1525441756949, "rating": 5.0, "text": "Mike Myers first fixed my washing machine that was backing up when no one else could about 10 years ago.  I have used him since over the years for everything from toilets that wouldn't flush to leaky kitchen faucet to most recently a dangerous gas leak in my fireplace!  He is the best!  Prompt, courteous and reasonable.  I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "105645433058465548988", "name": "Tam Kay", "time": 1536458857454, "rating": 5.0, "text": "Very satisfied! Team of 2, came out today to install our hot water tank. They got the job done very quickly, no mess left behind, Affordable, no complications! I will definitely recommend them to everyone I know and contact them in the future!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "105053267060628910747", "name": "Susie Shaffer", "time": 1521576489617, "rating": 5.0, "text": "Great response time from Michael Myers’ team of 2 men. Same day service for kitchen and laundry room pipes backing up.  Pipes were unclogged in less than an hour, and as a bonus got some tips on how specific cleaners and chemicals  can actually add to the problem rather than eliminate and on how to do some easy preventive maintenance to keep the drains/pipes clear and cleaner in the future. Thanks for a job well done.  I’ll be calling on you all again as needed!!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "106231527431488551016", "name": "Steven Scrimpshire", "time": 1549480044012, "rating": 5.0, "text": "I don't give 5 star reviews. Nobody's perfect. However, we had a serious grease clog in our drains from years of neglect from previous tenants of our house. These guys came and did an excellent, efficient and thorough job of making sure our problem was fixed completely. The price was very reasonable and Robert and Brian were very courteous and professional, keeping us informed as they worked.\nI highly recommend.", "pics": null, "resp": {"time": 1573670413725, "text": "Thank you for the wonderful review!"}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "101215877036600941425", "name": "R Boyd", "time": 1524090064634, "rating": 5.0, "text": "Have used this company several times. Always on time, courteous and gets the job done. My husband was here the last time they came and they explained everything they were doing or had done to correct our problem. I would recommend these guys for any of your plumbing work.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "103137542480133646258", "name": "Matt Hadaway", "time": 1565575997707, "rating": 5.0, "text": "Had a leak on Saturday. Came out within the hour and had it fixed in two. Very prompt, efficient, clean, and friendly! Will use again!", "pics": null, "resp": {"time": 1573670048119, "text": "Thank you Matt. We look forward to serving you again!"}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "101707355518720941376", "name": "Suzanne Blocker", "time": 1522722401324, "rating": 5.0, "text": "Mike was responsive to my call. I had gotten his name from my son who had used him for a new hot water heater installation. He was pleased and I have been as well. I had a noisy pipe problem.  Mike did not stop until he resolved it   He also replaced a small behind the sink pump downstairs.  Trustworthy and dependable", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "110361892019956140590", "name": "Leigh Ann Gilbert", "time": 1548970043602, "rating": 5.0, "text": "Excellent service! Very timely and professional and fair . I would recommend to everyone.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "105064315486062318872", "name": "Holly Webb", "time": 1529448509969, "rating": 5.0, "text": "WONDERFUL experience with The Plumbers LLC! Kevin King came out to fix our sink and he was FUNNY and VERY professional at the same time!!! Definetely will be calling back when needed!!!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "103112639651111571987", "name": "Liliya Sims", "time": 1520813658374, "rating": 5.0, "text": "Mike is a phenomenal, professional, and efficient plumber. He went above and beyond to ensure our new water heater is installed and working properly.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "118259698484888469178", "name": "Robert Duff", "time": 1520191818632, "rating": 5.0, "text": "I have been using \"The Plumbers\" for over 10 years. Mike and his team are always quick to respond to whatever plumbing needs I may have.\nTry them once and I guarantee you'll hold on to their number!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "115337633936261530722", "name": "Indian Springs First Baptist Church", "time": 1549047022814, "rating": 5.0, "text": "We had a great experience with The Plumbers LLC and would highly recommend them to any company or residence.\nJoAnne Marsch - ISFBC Building and Grounds Chairperson", "pics": null, "resp": {"time": 1573670523135, "text": "Thank you for your wonderful review!!"}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "101321443884089083116", "name": "Deana Wells", "time": 1526947458643, "rating": 5.0, "text": "Mike and his crew did a great job with the plumbing on our new bathroom renovation!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "106625310940364449927", "name": "Eboni Austin", "time": 1533408262881, "rating": 5.0, "text": "Great plumbers with excellent customer service!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "112877850151143160261", "name": "Amber Lee", "time": 1525995100856, "rating": 5.0, "text": "Excellent service and very friendly! They went above and beyond at my house!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "112913865248646511015", "name": "Amberly Mitchell", "time": 1532129099544, "rating": 5.0, "text": "Very prompt and professional! I highly recommending them and will be using them again!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "114969904498665139861", "name": "Auron181", "time": 1594069536353, "rating": 1.0, "text": "Charged us 127.45$ to simply change the name on the utilities bill. They stated its due to opening it as a new account under a different name. Also incredibly unprofessional when it comes to actually getting trash. Stating when the trash can is on the sidewalk it is 15ft from the road. That is a bold faced lie. Im taking time stamped pictures. Seriously this service is beginning to eat at my patience. Hope you see this when considering their services.", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "116784522105283203746", "name": "Michael Pitts", "time": 1598241927752, "rating": 4.0, "text": "They returned my deposit by crediting it to my current bills. July was the first month this year I had to pay due to that. Just nice to have my money returned.", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "115069706516929019228", "name": "Al Gossan", "time": 1592670156837, "rating": 1.0, "text": "We have waited around 4 months to get our cable buried after installation and it is STILL not done. This is after calling repeatedly and getting promises it would be done by secretary, managers, etc.\n\nThey also buried our neighbors (who moved in several months after we did and STILL didn’t do ours...even though the technician mentioned to our neighbor he saw the “mess” of our cable laying there!!\n\nThey OBVIOUSLY need to hire more people to keep up with their booming business OR they will experience a mass exodus as soon as another cable company comes to compete. Shortsighted business practices that will backfire in a big way! WAKE up company leaders before it is too late.", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "103761399629881991198", "name": "John Smith Sr", "time": 1597231769831, "rating": 5.0, "text": "Quick to response and bring the darkness into the light.", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "111414924460733750213", "name": "Rachel Engle", "time": 1594351511624, "rating": 5.0, "text": "They have always been so understanding and I am impressed at how willing they were to help and how understanding they were when things got tough with this covid19 stuff. I'm so appreciative and so glad we chose them.", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "107238972653597520709", "name": "Bernard Cook", "time": 1594074636233, "rating": 5.0, "text": "Very easy to find, fast efficient & very cordial service, quite impressed!", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "103241183087709209435", "name": "Susan Wangner", "time": 1581510865723, "rating": 5.0, "text": "Hubby and I are so happy that Riviera can repair appliances. We only have our water with them, no other utilities. A friend suggested we call Riviera to repair the clothes dryer several years ago so they came and fixed the problem right away. The dishwasher had an issue later so once again, we called Riviera to get ‘er done. Yesss!\n\nNow more recently, we decided to FINALLY  get our ice maker repaired. It had been on the blink for several years and we were tired of messing with it, so we got the repair guys out. We knew it would be costly since the ice maker needed replacing (we figured that) but the estimate they gave us and the estimate we had guessed was the same! No worries about being overcharged, ever. These guys are prompt and so courteous.\n\nWe will always call Riviera for our appliance repair needs. Thanks guys!", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "114231056293485631854", "name": "Nikia Robinson", "time": 1589832416408, "rating": 2.0, "text": "Very unprofessional,  we asked to get cable installed and had to wait a whole week , also the cable guy FINALLY came and he acted like he didn't have a clue what he was doing . he told me the maintenance people had to do something in order to get the cable,  ok . I got maintenance here they said he was suppose to do everything because they have cable n internet with rivera . Called them to tell them about the issue . They called back saying that the cable guy told them I said I didn't want the cable anymore. Which was a complete LIE because if I didn't want it I wouldn't have paid .. We asked for a refund n we couldn't get it . And they never told us no refunds ..", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "117171357159522040124", "name": "James Childers", "time": 1582248008154, "rating": 1.0, "text": "Internet service is terrible. I'm only getting about 20% of the speed I'm paying for. Have called several times but nothing has gotten better.", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "112113772840862722182", "name": "Richard Haygood", "time": 1581737819026, "rating": 1.0, "text": "Only owed a small amount and they were ready to take our meter. Always paid our bill every month. Tried to get a one week extension, not a chance. Why are there other customers with $500+ bills still with their meters? Disgusted by this company.", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "102889674496151897604", "name": "Juli “Crappie Queen” Chandler", "time": 1598887495845, "rating": 4.0, "text": "Decent service\nExpensive start Up fee", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "105865070152423255318", "name": "Colton Stevens", "time": 1601299164662, "rating": 1.0, "text": "You'll get the other 3 back when we get internet back.....", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "111055388381939918656", "name": "Beach Rat", "time": 1578687019350, "rating": 1.0, "text": "WORSE CUSTOMER SERVICE EVER!!!  Been paying for their premium internet service which  is supposed to be 40.  Since the date it was connected, November 14th,  I have been lucky to get around 14-20 mbs and not the 40 I'm paying for.  I have tried numerous times to get this problem corrected.  Technical support advised me that there were \"upgrades being made\" which I was later informed that was a lie and evidently used just to appease me.  I've since called back numerous times and left messages which are rarely returned.\nI actually had one lady transfer me around and when I kept getting transferred back to her she sent me right back to their internet help department which I had already spoken to thanks to numerous times for several hours total.  Their internet help department apologized and transferred me back to her and the phones had been switched off saying that they were closed.  After successfully giving me the runaround for nearly 30 minutes she was able to just switch the phone off and be on her merry way.   I left Century Link due to poor internet speed and piss poor customer service.  It appears Riviera isn't much better.  I understand things happen with technological items and speeds vary.  But to never get the speed I'm paying for and to constantly get the run around when trying to get the problem fixed is unacceptable.  If only Mediacom serviced my area.  I've been with Riviera for years and this is by FAR the worst experience I've ever had with them.", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "117188249371483335801", "name": "elayna vail", "time": 1550590815918, "rating": 5.0, "text": "They responded immediately and Nick and Russell, the 2 fellows that came out ,, were very courteous and kind and polite and fixed my meter right away and answered all my questions and never complained even though it was a very cold day. It’s hard to meet people with good attitudes in any service nowadays but these men had good friendly attitudes.  Thank you guys.", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "115520341515718935052", "name": "Matt White", "time": 1527192136158, "rating": 5.0, "text": "Ask for Anthony for your appliance repair needs. He was by far the best and most helpful person in repairing my hot water heater after lightning strike! I called a lot of places before Riviera Utilities and they were the only ones that were helpful in my case! Thanks!", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "115561105632163249182", "name": "Walter Rosene", "time": 1548432003080, "rating": 5.0, "text": "First technician could not help us, when we talked to more Senior personnel they were able to quickly come out and do our installation.  Very nice people to work with.", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "115797240812356516376", "name": "Howard L.", "time": 1597724536379, "rating": 5.0, "text": "Great facilities.", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "114290901450190777732", "name": "Inc 0000", "time": 1569425391522, "rating": 1.0, "text": "ITs bad when u have to go beyond a Supervisior!!! will update very soon!!", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "112230340367710433914", "name": "Candice Perry", "time": 1561774209060, "rating": 1.0, "text": "Horrible prices. A 1000 square foot apartment costs over $275 a month for water and electric ONLY. When I was on Baldwin EMC I had a 1200 Sq ft condo and it was never over $150. Extremely rude customer service and they are never on time when they need to come by. HORRIBLE", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "114402286601671133889", "name": "Liz Pierce", "time": 1587135375333, "rating": 4.0, "text": "Friendly and helpful staff", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "117352807249681764049", "name": "Anthony Chaney", "time": 1522368269937, "rating": 5.0, "text": "If they don't have the part in stock they can get it in the next day or two. Always willing to help diagnose the problem. And they also Repair Appliances & Air Conditioners.", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "107589171719698393470", "name": "TONYA Medina", "time": 1597753051606, "rating": 5.0, "text": "Quick and easy", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "118124772368958429455", "name": "Rebel L.", "time": 1516401950027, "rating": 5.0, "text": "Wes was so helpful with our hot water heater problem.Super fast service curtious,and professional.", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "102646117223425944282", "name": "Pat Clay", "time": 1459393937505, "rating": 1.0, "text": "Not much to review as far as cable internet.  They just don't offer it and it's 2016.  This leaves the only internet service provider in much of the service area as CenturyLink.  CenturyLink offers substandard internet service at substandard speeds at an inflated price because they can;  they're the only game in town.   I spoke with a Riviera Utilities rep about why they don't offer cable internet and she said that they did not want to compete with private business.  I don't really understand this response as subscription television is offered by Dish and DirecTV and if I'm not mistaken, they compete against cable television services.   So, with the help of Riviera choosing to not have cable internet and competing with CenturyLink, if you're in Foley Alabama, welcome to 1995.", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "110699672722625420488", "name": "Lindsey Chaney", "time": 1523716286290, "rating": 5.0, "text": "Great staff that are always willing to help!", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
{"user_id": "115953199413974710674", "name": "Mike Williams", "time": 1582157100400, "rating": 4.0, "text": "Fast and friendly", "pics": null, "resp": null, "gmap_id": "0x889a0e0d2a3444cb:0x8ecddf4ec0b22777"}
