{"user_id": "113949290174597058316", "name": "Jeff Roquet", "time": 1627921831641, "rating": 5.0, "text": "Jen and the team at The Plumbers LLC are fast, friendly, and won’t break the bank. I would recommend them to family, friends and anyone in need of anything plumbing related. 5 Stars isn’t high enough for this company!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "113672523187704516534", "name": "Angela Cummings", "time": 1629419698668, "rating": 5.0, "text": "Did a really good job! The issue was not apparant at first, but technician kept looking for the problem using a process of elimination. We would call again if needed.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "108895037627206225709", "name": "Frank Mullinax", "time": 1623684715972, "rating": 1.0, "text": "Do not use this plumber.  The owner does not stand behind his work.  I had him come out for a Master bath remodel to replace a tub valve and re-route/rough in plumbing to a walk in shower.  His plumber that came out to do the initial work did not turn the new valve to the bath tubs water on, and after tiling up the shower and trying to turn the bath water on, there was no water.  Had to go back in through the tile and found out the valve was never turned on/tested to the tub.  The rough-in work to the shower ended up being so poorly done, we are having to hire another plumber to come out and go in through the wall to fix the shoddy work that was done.  The plumber that came out to do this initial work was too concerned with having to leave early to officiate a soft ball game.  The worst thing about it is the owner is not standing behind his work and fixing himself. He has repeatedly blown me off and will not come back out.  I could also go in to how he threatened legal action if I didn't pay him for partial work before the job was completed, but that is another story.  If he is that concerned about needing money before a total job is completed, not a reputable plumber.  Beware", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "100471872745315618700", "name": "Katherine Surrett", "time": 1611781364536, "rating": 5.0, "text": "Highly recommend The Plumbers! They have done two jobs for me in the last two months- fixed a leak with our toilet and installed a new water heater. They did a great job with both! Their customer service has been wonderful, everyone I’ve spoken with has been very helpful and respectful, and they came out quickly and did a quality job. I will definitely continue to use them!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "105228963036381545759", "name": "Meredith Peters", "time": 1596225150764, "rating": 5.0, "text": "Wow, best experience with a plumber in a long time! They were here the next day as a second opinion to fix a flange on a toilet seat. We had previously been quoted almost $1000 to fix this issue, but these guys did it for $225! They were professional, courteous, and fixed it well. Definitely would use again and will recommend to anyone from now on!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "100536477405397121802", "name": "Heather Lofthus", "time": 1596136262815, "rating": 5.0, "text": "Fast, affordable service! Jen got us on the schedule as soon as I called and the next day Ransom and Jared were out to fix our issue. Very knowledgeable and polite! Will be calling these guys for all future plumbing needs!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "118423908659117090464", "name": "Family Savvy", "time": 1522691914899, "rating": 5.0, "text": "I've used Mike Myers and his team~The Plumbers~for more than 5 years. They did all plumbing on a recent home renovation, and Mike did an excellent job installing a pedestal sink atop an antique piece with marble (photo below). Whenever I text Mike, he responds quickly (often same day) and has always been more than fair in his pricing. My #1 choice for all of my plumbing needs.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO4DKqf-8TvNH6JrGg12peCn5-mymKHghDWQk-4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipORWkhgUXt4ArGk9GcwA0uGAD7qlpEUVL4-5KF2=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "102858978908850956142", "name": "Tyler Disharoon", "time": 1596559411916, "rating": 1.0, "text": "By the far the worst experience with a plumber. Came out and gave a quote and said he would return 2 days later and begin the work. Never showed. Called to follow up and he committed to coming that afternoon. Never showed.  Called again to get him to come out. Said he’d be there the next day. Now he won’t answer or return calls. If you would like someone to start a job and never finish and leave you with water running everywhere...call these folks and they will leave you ya hangin.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "108558886778844128581", "name": "Kim Akridge", "time": 1573776593263, "rating": 5.0, "text": "Came out on short notice. Fair price to replace hot water heater. Very professional. Definitely would recommend.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "116368463106041625479", "name": "Daniel Dyson", "time": 1602393310020, "rating": 5.0, "text": "Hands down the best experience I have ever had with a plumbing company or service company in general. Call these guys!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "112779160186450525351", "name": "Major Tom", "time": 1556809740120, "rating": 5.0, "text": "Great service at a fair price. Called Mike with a water leak in the wall at 7:00am. He had at truck at my house by 9:00. The tech was very knowledgeable and did a fantastic job. Will definitely use The Plumbers again if the need should arise", "pics": null, "resp": {"time": 1573670177953, "text": "Thank you for the wonderful review. Call us anytime with any problems and will be there as quick as possible. We look forward to serving you again."}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "110763218095878900735", "name": "Cindy Partlow", "time": 1567535102571, "rating": 5.0, "text": "This is the second time that I have used The Plumbers LLC - great service both times. Mike is easy to work with. Very knowledgeable and professional. Good clean up after the work. Will use again.", "pics": null, "resp": {"time": 1573669181890, "text": "Thank you so much for your feedback Cindy. We appreciate your business and kind words and hope you are doing well."}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "108481586427300588137", "name": "Rachel Beasley", "time": 1581622924799, "rating": 1.0, "text": "After $350 and several visits over the course of a week including removal of fixture and scoping the lines, our toilet issue was still not resolved and began leaking blue liquid from the tank onto the floor, causing a mess for us to clean up. Hate to muddy the 5 star reviews, but $350 for multiple interruptions (and messes) and zero fix to a seemingly straight forward issue isn’t ideal for our schedule nor budget.", "pics": null, "resp": {"time": 1581641080032, "text": "Im sorry to hear this mrs beasley, i am looking into the matter , since we ran the camera down the drain i will have video evidence of that, also of the final product when we finished the job. I have the file from jan 23 ."}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "109678879373314166686", "name": "Lauriann Loveless", "time": 1559320555633, "rating": 5.0, "text": "So we had 5 leaks we patched, kept leaking. Had enough, called the pros.  They were here less than 2 hours, all fixed and to be honest less expensive than our patch jobs .  Trever was awesome.  They were respectful and neat. We live on a farm and they were good around the horses and dogs.  Will never do another patch job. Highly recommend. Thanks guys.", "pics": null, "resp": {"time": 1573670106977, "text": "Thank you Lauriann. Your business is very important to us. We look forward to serving you again."}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "109882145467130419807", "name": "Erik Brown", "time": 1536962177224, "rating": 5.0, "text": "Trevor and Brian came over and did a excellent job! Very friendly and hard working. Great job! I highly recommend them! Thanks!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "104625050976105400827", "name": "Marie Adams", "time": 1596126856865, "rating": 5.0, "text": "They were on time and did a great job.  I would use them again.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "113243534937632806676", "name": "Daryl Russo", "time": 1585149808736, "rating": 1.0, "text": "My office hired The Plumbers, LLC., to replace a gas water heater yesterday.  Today we all walked into the office and there was an obvious gas leak.  We called them back and opened all our doors to air out the fumes. When they arrived, they could smell it as well and found the leak.  A leak they told me was caused by their installers who did NOT check their work after moving the water heater into place.  With something as dangerous as natural gas, this level of incompetency is unacceptable.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "101199769171875663660", "name": "Robin H", "time": 1525993962665, "rating": 5.0, "text": "Prompt, VERY CLEAN, honest and conservative, priced very well, answers urgent issues day or night. I HIGHLY RECOMMEND them and have used them for more than 5 years for a wide variety of Services at my home and other properties. Mike is worth the wait even if he’s booked!  I trust him and his team. Very personable!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "102213513662387927131", "name": "Dionne Lovett", "time": 1525441756949, "rating": 5.0, "text": "Mike Myers first fixed my washing machine that was backing up when no one else could about 10 years ago.  I have used him since over the years for everything from toilets that wouldn't flush to leaky kitchen faucet to most recently a dangerous gas leak in my fireplace!  He is the best!  Prompt, courteous and reasonable.  I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "105645433058465548988", "name": "Tam Kay", "time": 1536458857454, "rating": 5.0, "text": "Very satisfied! Team of 2, came out today to install our hot water tank. They got the job done very quickly, no mess left behind, Affordable, no complications! I will definitely recommend them to everyone I know and contact them in the future!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "105053267060628910747", "name": "Susie Shaffer", "time": 1521576489617, "rating": 5.0, "text": "Great response time from Michael Myers’ team of 2 men. Same day service for kitchen and laundry room pipes backing up.  Pipes were unclogged in less than an hour, and as a bonus got some tips on how specific cleaners and chemicals  can actually add to the problem rather than eliminate and on how to do some easy preventive maintenance to keep the drains/pipes clear and cleaner in the future. Thanks for a job well done.  I’ll be calling on you all again as needed!!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "106231527431488551016", "name": "Steven Scrimpshire", "time": 1549480044012, "rating": 5.0, "text": "I don't give 5 star reviews. Nobody's perfect. However, we had a serious grease clog in our drains from years of neglect from previous tenants of our house. These guys came and did an excellent, efficient and thorough job of making sure our problem was fixed completely. The price was very reasonable and Robert and Brian were very courteous and professional, keeping us informed as they worked.\nI highly recommend.", "pics": null, "resp": {"time": 1573670413725, "text": "Thank you for the wonderful review!"}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "101215877036600941425", "name": "R Boyd", "time": 1524090064634, "rating": 5.0, "text": "Have used this company several times. Always on time, courteous and gets the job done. My husband was here the last time they came and they explained everything they were doing or had done to correct our problem. I would recommend these guys for any of your plumbing work.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "103137542480133646258", "name": "Matt Hadaway", "time": 1565575997707, "rating": 5.0, "text": "Had a leak on Saturday. Came out within the hour and had it fixed in two. Very prompt, efficient, clean, and friendly! Will use again!", "pics": null, "resp": {"time": 1573670048119, "text": "Thank you Matt. We look forward to serving you again!"}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "101707355518720941376", "name": "Suzanne Blocker", "time": 1522722401324, "rating": 5.0, "text": "Mike was responsive to my call. I had gotten his name from my son who had used him for a new hot water heater installation. He was pleased and I have been as well. I had a noisy pipe problem.  Mike did not stop until he resolved it   He also replaced a small behind the sink pump downstairs.  Trustworthy and dependable", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "110361892019956140590", "name": "Leigh Ann Gilbert", "time": 1548970043602, "rating": 5.0, "text": "Excellent service! Very timely and professional and fair . I would recommend to everyone.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "105064315486062318872", "name": "Holly Webb", "time": 1529448509969, "rating": 5.0, "text": "WONDERFUL experience with The Plumbers LLC! Kevin King came out to fix our sink and he was FUNNY and VERY professional at the same time!!! Definetely will be calling back when needed!!!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "103112639651111571987", "name": "Liliya Sims", "time": 1520813658374, "rating": 5.0, "text": "Mike is a phenomenal, professional, and efficient plumber. He went above and beyond to ensure our new water heater is installed and working properly.", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "118259698484888469178", "name": "Robert Duff", "time": 1520191818632, "rating": 5.0, "text": "I have been using \"The Plumbers\" for over 10 years. Mike and his team are always quick to respond to whatever plumbing needs I may have.\nTry them once and I guarantee you'll hold on to their number!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "115337633936261530722", "name": "Indian Springs First Baptist Church", "time": 1549047022814, "rating": 5.0, "text": "We had a great experience with The Plumbers LLC and would highly recommend them to any company or residence.\nJoAnne Marsch - ISFBC Building and Grounds Chairperson", "pics": null, "resp": {"time": 1573670523135, "text": "Thank you for your wonderful review!!"}, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "101321443884089083116", "name": "Deana Wells", "time": 1526947458643, "rating": 5.0, "text": "Mike and his crew did a great job with the plumbing on our new bathroom renovation!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "106625310940364449927", "name": "Eboni Austin", "time": 1533408262881, "rating": 5.0, "text": "Great plumbers with excellent customer service!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "112877850151143160261", "name": "Amber Lee", "time": 1525995100856, "rating": 5.0, "text": "Excellent service and very friendly! They went above and beyond at my house!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "112913865248646511015", "name": "Amberly Mitchell", "time": 1532129099544, "rating": 5.0, "text": "Very prompt and professional! I highly recommending them and will be using them again!", "pics": null, "resp": null, "gmap_id": "0x8889338819de61b7:0xea3f1db7e03a5777"}
{"user_id": "103114778297493989019", "name": "Rebecca Ehrle", "time": 1614115622630, "rating": 5.0, "text": "These guys are knowledgeable, professional and do good work. They came in an emergency situation during this cold snap and took care of me.  I ended up having to replace the unit, I called around and did some research this company was right on the money with cost.  They gave me excellent options and provided great service.  Extremely professional, clean and arrived early every time.  They cleaned up their work area and explained every process to me.  I will be using them to service and if I have future needs.", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "101822717496967369751", "name": "Kim Mckee", "time": 1615604659393, "rating": 5.0, "text": "Conditioned Air Solutions is hands down the BEST! Lee Hatchett was our service technician today for our yearly maintenance, he is great! Very knowledgeable, friendly and helpful. He did an exceptional job! Very happy with our service!", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "100968494623647530445", "name": "Charity Stratton", "time": 1608574095319, "rating": 5.0, "text": "Robert and his crew replaced our heat pump, improved our ductwork and circulation, added more insulation in the attic  and added a thermostat downstairs a few years ago. The house was always drafty downstairs in the winter and hot downstairs in the summer. We had three companies come out and assess what was going on and although his quote was not the cheapest, he was the only one that told us exactly what needed to be done. We ultimately decided that it was worth the expense to have our home be comfortable. That was at least five years ago, and I keep saying “it’s the little things that cost thousands of dollars that really make the difference!” We haven’t regretted spending one penny!", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "112608048469873571019", "name": "Andrea Brown", "time": 1531224758411, "rating": 5.0, "text": "So this man, Robert Atkins and His staff at his company goes so way beyond and it just amazing! You see,  we had a severe issue last week which caused an emergency situation. I called Mr. Atkins in the middle of the night and he actually picked up the phone!! We discussed the situation and he came out that day! He ordered the equipment and as soon as it arrived, which was the following business day, our new unit was installed! We can't thank him and his crew enough! Great Job ACS!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipME1ZmyNJbALHCdaiz6S1jcz8Y9u_RAPQq8OdIC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN7NEsBWUZGp7am2t25JLB1M8-hLcppqROxfcck=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOo8gUuBWNxmeXdNjqeR6zRsY-1HGaG20xIkMTE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO4B2I7R4oaLWIO0_RQ5NrhOOGizlaFDO-ieqoN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNNXXxm7cFG02fwrsgB_CmEhnJXNExZAmJzRFam=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMnaqgmkzest41yByjLwmnvjAq15--GUYhrs-ID=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMRO4jaiMDQzNR1FAnYj8M5amhElQjEb9WSMsxx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN1_sih2U1zm_xXBb_Vb6ojhzoqKvLPo4zAbprb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMoRXT4xiFvrnGBUvHqCVvCZUurcM39m0ST3rvo=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "117576647325055707835", "name": "Seth Nugent", "time": 1599752508712, "rating": 5.0, "text": "These guys are my go when I have any issues with my HVAC system. They offer maintenance contracts that are affordable. I've also had them fix my unit on a few occasions and they were professional, responsive, on time, and they don't try to upsell you at all. I definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "115391173337884795862", "name": "jsf5758", "time": 1607536852209, "rating": 5.0, "text": "ACS installed a new heating and cooling system in my home.  They arrived on time, worked until the installation was complete and left with everything neat, clean and assembled well.  The cost for equipment and installation was very reasonable.", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "116805135807474623057", "name": "Kevin Fairclough", "time": 1605316816635, "rating": 5.0, "text": "ACS, INC replaced a gas pack for me. The installation was on time and the installation crew was efficient, competent and careful. In contrast to some other HVAC companies, the owner is very easy to contact.", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "103213922701618221230", "name": "Joe", "time": 1610064263343, "rating": 5.0, "text": "Over the last eleven years, Robert Akins and ACS has provided nothing but high-quality, professional, and responsive service.  When one of my two HVACs went out in my new home, I called the company that installed it and they said the earliest they could come was three days.  When I called ACS, they were there the next morning.  I have been calling on ACS ever since.  During a heat wave, after Robert explained he would have to charge overtime, ACS fixed my HVAC on a Sunday morning.  Whenever ACS was at my house to fix my HVAC, after analyzing the problem, they were clear on what needed to be done,  how long it would take to fix it, how much it would cost, and why.  If necessary, they also provided a variety of payment options so I could choose what best met my situation.  So when one of my two HVACs needed to be replaced, ACS was one of two companies I called for an estimate.  While the other estimate was flowered with discounts for various reasons, the ACS estimate was clear, concise, and competetive.  Robert Akins spent a lot of time explaining options and whether they were worth the expense.  The unit ACS proposed has a lifetime condenser replacement warranty if the compressor ever fails.  An option ACS had that the other did not was a ten year warranty on the labor for warrantied repairs.  Finally, when the competitor said it would take at least a week for the replacement HVAC to come in, ACS had my new unit installed the next day on December 22, the week of Christmas!  So whether you are looking to replace your current HVAC unit or just repair the one you have, I highly recommend Robert Akins and ACS.  They have always been there when I needed them and taken care of the problem efficiently and professionally.", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "100449348270382582672", "name": "FRED RICHARDSON", "time": 1571958543972, "rating": 5.0, "text": "Great customer service. Robert and his technical employees are top notch. He is fair and honest and always does what is best for the customer.", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "109096958036482019530", "name": "Jeremy Fleming", "time": 1577558983189, "rating": 5.0, "text": "ACS recently replaced 2 units for my home.  They arrived on time, completed the work quickly and followed up after the installation.  We will be using them for service in the future.", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "109367353296006001546", "name": "Raychel Zygula", "time": 1544105250470, "rating": 5.0, "text": "Owner is an excellent business man and keeps track of how my systems are running. I've had to replace two compressors as well as some duct work for my home this year, and each time ACS came by to service my home, they have gotten the job done efficiently. I would highly recommend using this company! The prices are fair and the job is top quality.", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "116904725452727783569", "name": "Emily of Earth", "time": 1561416441520, "rating": 5.0, "text": "They were able to come to my house the same day that I called! My technician was very knowledgeable and friendly.", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "101480563986741173054", "name": "William Hastie", "time": 1562343724376, "rating": 2.0, "text": "ACS responded in a reasonable time.  A capacitor was replaced.  The wholesale cost of the capacitor is under $30.  I was charge $130 for the capacitor plus labor to replace it.  Total charge $245.  So, if you do not mind a 300+% markup on material, then you can select ACS.  I will go elsewhere.", "pics": null, "resp": {"time": 1562595694874, "text": "It is always a travesty for ACS, Inc. to have an unsatisfied customer and we do all that we can to help our customers have a good experience with us and continue a long term service relationship.  Unfortunately, occasionally, due to whatever reasons whether by our fault or other circumstances, a customer is dissatisfied.  In this case we did not learn of Mr. Hastie's dissatisfaction until he posted a negative review.  There was no phone call, no inquiry, no attempt to communicate or seek a resolution to his complaint, just a negative review.\nAfter speaking to the technician and reviewing the statements associated with this service I found the following facts to be true:\n\nMr Hastie called to report his house was hot and his air conditioning was not working late in the afternoon.  I diverted a technician to his house after 4:30 pm to help him so that hopefully he would not have to go through another hot night in his house.  (We go on overtime at 5:00 pm).  The technician found the primary problem and responded by installing a part from his truck which was close to what was required but not the correct spec.  The temporary fix allowed the unit to run and cool the house overnight providing immediate relief for Mr. Hastie.  The technician did not charge for the overtime.\n\nThe part required was an odd spec which the technicians and many of our professional vendors do not carry locally (often an order Item).  The next day our technician searched among our vendors until he found a part locally.  He returned to the Hastie residence and exchanged the temporary part for the correct one.  Our technician also inspected the refrigerant charge and found a need to add some refrigerant to achieve the correct cooling specs per his instruments upon this return visit.\n\nMoreover, our technician did not charge Mr. Hastie for the procurement or travel time required to serve his needs.  For the more than 3 hours time involved working exclusively on Mr. Hastie's behalf our technician charge him only for a service call and 1 hour labor.  As far as the cost of the part:  yes we, like most service operations who provide a responsive service, charge a markup on parts.  We do not attempt to compete with internet pricing.  Our pricing structure reflects the convenience of having the part, our vendors supporting us to have a part available, and the network which guarantees and supports the quick response business.\n\nOtherwise, a client is free to diagnose his own problem, order his parts online and wait in the heat until the part arrives (hoping he did not make a mistake or that a wrong part was shipped.)\n\nIn conclusion:  Our technician followed pricing guidelines which have been satisfactory for our extensive client base for more than 40 years.  He waived labor costs in the hopes of establishing Mr. Hastie as a long term satisfied customer.  Mr. Hastie indicated to the technician that he was satisfied and grateful for the prompt service and relief from the heat.\n\nHad Mr. Hastie called to inquire about the charges, we could have explained to him and even offered him a coupon if he was still not happy.  Personally, I see this negative review as simply malicious with the intent of harming our otherwise excellent review status and without any interest in understanding or seeking a resolution with ACS, Inc."}, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "108225767895135710063", "name": "Betsy Drab", "time": 1509376814858, "rating": 5.0, "text": "Mr Josh Nelson was excellent!  I don’t ever leave reviews but this gentleman was knowledgeable, courteous, and was concerned with walking on my rugs etc. etc.  He also explained my thermostat to me and all the settings again and never made me feel like a question that I was asking was silly.\nI will continue calling AC whenever I have a problem and hopefully Josh Nelson will be the man that comes out.   Thank you!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "105377407489383172019", "name": "Gary Eberhart", "time": 1505432237009, "rating": 5.0, "text": "I have used Robert Akins and his company for my heating and air conditioning requirements for many years, including maintenance, repair, and replacement of units at my previous and current homes. I have always been happy with the quality of their work, their responsiveness, and their professionalism. I'm happy to recommend them to everyone.", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "116720790354955404717", "name": "Amata Hinkle", "time": 1446743995984, "rating": 5.0, "text": "We needed our units looked at as they were installed many years ago and they have not been maintained. I called ACS to come look at them as we were having some issues. Prices were very reasonable and they even cleaned the units and explained to me how to keep them cleaner and which filters to use so my air quality is better! I have had fewer allergies issues since their visit. Very happy with their knowledge and service. Their techs were polite and kept my house clean and made sure to leave everything perfect.", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "115234763098458341873", "name": "Philip H Ryan", "time": 1502032909890, "rating": 5.0, "text": "I can't stress the phrase \"Busted Ass\" enough.  These guys are the real deal.  Thank you Robert for your hard work over the weekend.", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "110399223018102270346", "name": "Kathy Anderson", "time": 1548094810205, "rating": 5.0, "text": "Robert successfully diagnosed my issue and took the extra effort to get my new thermostat covered by the unit's warranty.", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "107729143767566960557", "name": "Susan Taylor", "time": 1532489662641, "rating": 5.0, "text": "ACS has always done excellent work for us and our home. I really appreciate their prompt service. They are always very helpful and polite and do a great job. I highly recommend Robert and his technicians if you ever need HVAC service. 😊", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "101471585304504788357", "name": "semaj simon", "time": 1514830632793, "rating": 5.0, "text": "I called Robert on New Year's Day when I had a problem with my HVAC unit and he was not only prompt and expedient but very efficiently solved our problem. It is the second time we've had to call and ACS has always provided exceptional care and responded quickly to our calls. Excellent service and customer care!", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "103256387997432412589", "name": "Bob Lucas", "time": 1508525114910, "rating": 5.0, "text": "I have been a LOYAL customer of ACS for well over 20 years.  I tagged them with LOYAL, because they have earned it through the outstanding CUSTOMER SERVICE they have ALWAYS provided.  Every technician, whether it be for annual maintenance, troubleshooting, repairs and replacement has done a professional job.  It starts with being on time and continues through the work being performed and doesn't end until the clean-up and answering any questions you may have.  Thanks ACS for being there night and day.", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "106720674891528630581", "name": "Lance Magnant", "time": 1547775377150, "rating": 5.0, "text": "Robert Akins and his crew pay attention to the details. I had been limping my heat pump along for almost a year. When the compressor finally died, there were 5 days before the temp. in Huntsville was projected to be 19*F. ACS got the job done in time to protect my house and family from the extreme cold. I got 3 estimates and chose ACS. Robert was the only one to send a person into my crawl space and take pictures. Based on this information, we were able to redress some issues, and that made this install seamless at a great price! This company is squared away! Lance Magnant, S.E. Huntsville, Al.", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "105404382978112516900", "name": "Jacob Rosenblum", "time": 1506536510493, "rating": 5.0, "text": "Thank you Robert for your wonderful work.", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "116466958763043937382", "name": "Bobby Miller", "time": 1514823721472, "rating": 5.0, "text": "Woke up on New Years Day To 55 degrees in the house.  Robert was here and had the system going before 830 AM.   All systems have issues.  But I have bought from and used ACS for many years because of this kind of service.   If you need an HVAC contractor, I reccommend ACS highly!  Thank you!!", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "115078430152216296350", "name": "Nathan", "time": 1543332512308, "rating": 1.0, "text": "Called to get information on a repair. Instead all I received was a smart aleck and demeaning response followed with profanity. Extremely unprofessional. If someone speaks this way towards potential business, I highly question their ethical standards in performing a repair. AVOID.", "pics": null, "resp": {"time": 1543417470154, "text": "I remember this caller.  Nathan called and began asking me vague questions about what was wrong with his heating system.  I told him that it sounded like we needed to send a tech out for diagnostics.  He asked me what the charge would be and I told him the minimum cost of a service call and labor for a call out.  He then asked me an unusual question for our industry.  He asked me why we charged for diagnostics.  From having dealt with the public for 40 years I understood that he was not familiar with how service companies operate.  I proceeded to explain to him why a company had to charge to send a tech to a remote location, time, equipment cost, travel, insurance, education and training, overhead and all of the costs associated with a working company.  I explained that the tech, for instance, had to be paid from the moment he clocked in which included the driving time to a residence and back, hence the service call.  Nathan took offense at the explanation and told me that he did not need a \"lecture\".  I asked him then why he asked such a question if he did not expect or want a comprehensive answer, to which he abruptly hung up the phone. There was no profanity.  Moments later this negative review arrived in my email.\n\nPart of the service we provide is educational.  We are a very empirical and logic based company.  We deal with applied science.  When a question is asked we do our best to answer it thoroughly.  I often help clients solve heating and air conditioning issues over the phone at no charge when able.  I have recently successfully instructed non technical house wives in restoring their heat over the phone. My communication skills are very good.  In this circumstance it was very important that the potential client understood the charges and per his questions why there were charges.  If the customer does not understand that he will be charged for a visit and that he has an obligation to pay, or if he protests the value of the service prior to a visit by a tech, then we cannot send a tech to his residence.\n\nUnfortunately, part of the job of dealing with the general public is to screen the potential client to make sure that the interaction with the company and the technician is successful and satisfactory for both parties.  We will not send a technician into a contentious situation.  We would have liked to have helped Nathan but the initial phone interaction and the \"hang up\" indicated that the interaction would not be successful."}, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "109928376666083504621", "name": "George Kozub", "time": 1510611259557, "rating": 5.0, "text": "My wife, Kay, and I have been with Robert and ACS,INC for over 30 years, 20 years in Meridianville and now 10 here in Huntsville.  In Meridianville,  he serviced an existing unit for @ 10 years and finally replaced it with a new unit that is still being maintained by his Service Dept. ( upon my recommendation to the new owner.)   In Huntsville, Robert and his Service Dept. have replaced two older units within the last two years at our present address.  Robert and his team do outstanding work in a very timely and professional manner.  When we moved to Huntsville we could have chosen from a number of HVAC companies but chose to stay with Robert Akins and ACS.\nSincerely,\nGeorge & Kay Kozub", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "107398839556391312860", "name": "RocketReef", "time": 1544467221953, "rating": 5.0, "text": "A+. Everything went great.", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "109170253727893532050", "name": "John Hacker", "time": 1502753531368, "rating": 5.0, "text": "I have been using ACS for years to service and replace my heating and cooling units. They have been prompt, courteous, and efficient when performing the work. They recently covered a repair outside of warranty because as Mr. Akins said, \"It is the right thing to do.\" I would highly recommend ACS to anyone looking for HVAC service, repair or replacement.", "pics": null, "resp": null, "gmap_id": "0x8862657b007200dd:0x7c27a392b36f81dc"}
{"user_id": "115205856759347307674", "name": "Brent Howell", "time": 1628178133442, "rating": 5.0, "text": "I received excellent service from Capstone. I called first thing one morning about a non-emergency, and they were able to come out within an hour. They diagnosed and replaced my pressure reducing valve in less than two hours. The plumber and apprentice were informative and knowledgeable. I'd recommend Capstone to anyone.", "pics": null, "resp": {"time": 1628184595762, "text": "Thank you Brent!  We appreciate the kind review!"}, "gmap_id": "0x888927185ffcdae3:0xc0ca486c86cbed0c"}
{"user_id": "116227765887325327569", "name": "David Kennedy", "time": 1628616622963, "rating": 5.0, "text": "Capstone Plumbing was very professional throughout their entire visit. They came first thing in the morning, and upon learning that both of our young children were asleep still they were especially quiet and considerate. They got all of our clogged drains fixed quickly and in full. The billing invoice text/email system that they use is also extremely convenient.", "pics": null, "resp": {"time": 1628617294306, "text": "Thank you David!  Appreciate the review!"}, "gmap_id": "0x888927185ffcdae3:0xc0ca486c86cbed0c"}
{"user_id": "102066502488954966970", "name": "betsy fleet", "time": 1623889803086, "rating": 5.0, "text": "So thrilled with the company and the plumbers that came out. Called left a message after hours stated not an emergency but received a call back later that night. Very professional and caring. Plumbers came out checked figure out solution and fixed it. Again very professional, polite and explained and made me feel very comfortable. Can’t say enough about this company. Great prices and a excellent work. Highly recommended!!!", "pics": null, "resp": null, "gmap_id": "0x888927185ffcdae3:0xc0ca486c86cbed0c"}
{"user_id": "106516886678315836311", "name": "Taneshia Pendleton", "time": 1628356515420, "rating": 5.0, "text": "Great customer service and knowledge. We Have contacted Capstone on two occasions and both times we received timely response and service. I would highly recommend.", "pics": null, "resp": {"time": 1628370188835, "text": "Thank you Taneshia! We appreciate the kind review!"}, "gmap_id": "0x888927185ffcdae3:0xc0ca486c86cbed0c"}
{"user_id": "111951761978891976355", "name": "J HAL", "time": 1621040776253, "rating": 5.0, "text": "I have no complaints.  I called when my hot water stopped coming out of the faucet and they were there in hours.  They were not pushy about selling a new one but just laid out the facts.  I decided to go ahead and replace and they were able to have it installed that night.  The men were friendly and professional.  I highly recommend this company.", "pics": null, "resp": null, "gmap_id": "0x888927185ffcdae3:0xc0ca486c86cbed0c"}
{"user_id": "107587951243340695623", "name": "Angela Tropin", "time": 1628098197081, "rating": 5.0, "text": "Very nice people. They addressed the issues and made it right. Very happy.", "pics": null, "resp": {"time": 1628184603340, "text": "Thank you Angela!"}, "gmap_id": "0x888927185ffcdae3:0xc0ca486c86cbed0c"}
{"user_id": "113591512940938954971", "name": "Brett Minter", "time": 1622146610178, "rating": 5.0, "text": "Capstone Plumbing is outstanding. We tried a little DIY and ended up with a twisted off copper pipe 3 inches inside the wall. They were prompt with their response, super helpful, and got us fixed up for a very reasonable price. Look no further for your plumbing needs.", "pics": null, "resp": {"time": 1620525233014, "text": "Thank you Brett!"}, "gmap_id": "0x888927185ffcdae3:0xc0ca486c86cbed0c"}
{"user_id": "103193364392365973888", "name": "Beth Menke", "time": 1616972297383, "rating": 5.0, "text": "This was our first time to call Capstone and they were extremely responsive and reasonable.  Excellent work, will most definitely use them again.  Josh and his apprentice were respectful and friendly.", "pics": null, "resp": {"time": 1617030859884, "text": "Thank you Beth!  We appreciate your business!"}, "gmap_id": "0x888927185ffcdae3:0xc0ca486c86cbed0c"}
{"user_id": "114798925543517953572", "name": "Bud Crockett", "time": 1618505511083, "rating": 5.0, "text": "They were quick to respond and did a wonderful job.  The employees were very kind and helpful.  Overall, a very pleasant experience.", "pics": null, "resp": {"time": 1618506189687, "text": "Thank you so much Bud! We appreciate the kind words!"}, "gmap_id": "0x888927185ffcdae3:0xc0ca486c86cbed0c"}
{"user_id": "118389956209177982273", "name": "Deidre Justice", "time": 1623692848189, "rating": 5.0, "text": "Josh went above and beyond to make sure everything was taken care of with our dishwasher install and shower repair. Thanks so much!", "pics": null, "resp": {"time": 1623695830773, "text": "Thank you Deidre!  We appreciate the review and appreciate you using Capstone!"}, "gmap_id": "0x888927185ffcdae3:0xc0ca486c86cbed0c"}
{"user_id": "110883635024543618232", "name": "Gayla Rathbun", "time": 1618257081328, "rating": 5.0, "text": "Loved what they did...their employees were more than professional! Will continue to use their services next time we need a plumber!", "pics": null, "resp": {"time": 1618315491710, "text": "Thank you Gayla for the kind words!  We are happy you are happy!"}, "gmap_id": "0x888927185ffcdae3:0xc0ca486c86cbed0c"}
{"user_id": "116360085423761784030", "name": "TheKnowitall", "time": 1620519375755, "rating": 5.0, "text": "Absolutely fantastic service and price. Everyone went  above and beyond.", "pics": null, "resp": {"time": 1620525210047, "text": "Thank you!!"}, "gmap_id": "0x888927185ffcdae3:0xc0ca486c86cbed0c"}
{"user_id": "108203849481637882590", "name": "J&M Creations", "time": 1626183112001, "rating": 5.0, "text": "Great experience with quick service and response!!", "pics": null, "resp": null, "gmap_id": "0x888927185ffcdae3:0xc0ca486c86cbed0c"}
{"user_id": "117793726106340987948", "name": "the Nana and paw paw show", "time": 1612627996550, "rating": 5.0, "text": "Best plumbing company professional and experienced plumbers if you need plumbing work call them you will be glad you did", "pics": null, "resp": null, "gmap_id": "0x888927185ffcdae3:0xc0ca486c86cbed0c"}
{"user_id": "113198659131018369102", "name": "Cindy Stedman", "time": 1621270663574, "rating": 5.0, "text": "They were professional and efficient.", "pics": null, "resp": null, "gmap_id": "0x888927185ffcdae3:0xc0ca486c86cbed0c"}
{"user_id": "100541999245497554857", "name": "Ross Silas", "time": 1624891350912, "rating": 5.0, "text": "Clean, professional work.", "pics": null, "resp": null, "gmap_id": "0x888927185ffcdae3:0xc0ca486c86cbed0c"}
{"user_id": "101203966288688411426", "name": "Jim Bradford", "time": 1614351474922, "rating": 5.0, "text": "very professional and fixed the problem fast and effectively", "pics": null, "resp": {"time": 1613161606912, "text": "Thank you Jim!"}, "gmap_id": "0x888927185ffcdae3:0xc0ca486c86cbed0c"}
{"user_id": "108597036462596859890", "name": "Rauth House", "time": 1592772032094, "rating": 5.0, "text": "I had APP come out to replace the main service line into a home. The the only company that actually came out to give me a quote without a bunch of run around. They were able to schedule quickly and got right to work on the day of the job. They did good quality work and were prompt and thorough. Thanks y’all!", "pics": null, "resp": {"time": 1592776673889, "text": "To any potential customers, we at Alabama Plumbing Pros (APP) pride ourselves on honesty and integrity; to that end we have reported this review as fake to Google. We do not know why so many people have recently started leaving unsolicited 5-star reviews, but we cannot in good conscience allow our customer base to be mislead."}, "gmap_id": "0x8889013000000001:0x1cd18b6bac770bbd"}
{"user_id": "107433414366266964789", "name": "Paul", "time": 1508358291703, "rating": 5.0, "text": "Maybe the nicest contractor type people I've ever encountered.  They took the time to understand my basement water problem. They recommended that I use another solution, even though it was not one they install.", "pics": null, "resp": {"time": 1508365425483, "text": "Thank you for the review, it was great meeting you! If we can be of service in the future, let us know. -Amy"}, "gmap_id": "0x8889013000000001:0x1cd18b6bac770bbd"}
{"user_id": "112726406290551955413", "name": "Terri Croxton", "time": 1442935092765, "rating": 5.0, "text": "Alabama Plumbing Pros. installed our dishwasher.  They cleaned where the old dishwasher stood for 18 years before installing the new one.  The installment was done in an hour or less and everything was cleaned up beautifully.  We could not have been more pleased.\n.", "pics": null, "resp": null, "gmap_id": "0x8889013000000001:0x1cd18b6bac770bbd"}
{"user_id": "112634362501799467978", "name": "DANIELLE WILLIAMS", "time": 1497543351161, "rating": 1.0, "text": "APP came out to service my septic tank.  After spending several hours taking the tank apart; they came to the conclusion that the tank malfunctions due to some debris in the tank.  I got a $465 bill to clean debris from the tank.  I assumed this fixed the problem until the next day when I realized my pump wasn't clicking on.  We contacting APP to let them know it wasn't fixed.  Amy then sent us a quote for $1200 to fix the pump.  There is no doubt in my mind we were completely taken advantage of from this company.  I wouldn't recommend or suggest anyone use them for any form of plumbing work.  And I plan to report them to the BBB and anyone else. It's sad when people feel like they can take advantage of you when they know a little bit more about something than you do.  If I could have given them zero stars; I would have.", "pics": null, "resp": {"time": 1497544146234, "text": "We are terribly sorry you feel this way. We explained to you that even after we pulled the pump, cleaned out the filter, the check valve, and reconnected the float switch and the alarm to their original location in the tank (the pvc had snapped off at some point and this very likely may have caused the pump to run constantly, wearing out the motor). We spent several hours working in and around your septic tank. Plumbing is often a process of elimination, and you understood that there was a good chance the pump may still need to be replaced, however since it was fully functional when we finished you wanted to hold off on the more costly replacement. We stand behind our work, and offered you a credit for half the original invoice to go towards a new pump installation. This offer still stands. We wish you the best going forward. God bless."}, "gmap_id": "0x8889013000000001:0x1cd18b6bac770bbd"}
{"user_id": "114578960964205397626", "name": "John Ford", "time": 1562165715725, "rating": 5.0, "text": "Reasonably priced, professional service, and they came the next morning.", "pics": null, "resp": null, "gmap_id": "0x8889013000000001:0x1cd18b6bac770bbd"}
{"user_id": "102225470760879201454", "name": "Doug McLeod", "time": 1481728905087, "rating": 5.0, "text": "Installed a hot water tank for me. Arrived on time, did a great job, and reasonably priced. Finally, a plumber you can count on! Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889013000000001:0x1cd18b6bac770bbd"}
{"user_id": "108602699594528307173", "name": "Melissa croxton", "time": 1529206213855, "rating": 5.0, "text": "APP was amazing!! I arrived at the stables where I ride and board my horse to find a huge mud puddle in the middle of the hallway. It was a busted pipe. The barn owner said she had been waiting 4 days for her plumber to come and fix it. We were having to turn the water on and off all day to water the horses and flush the toilets and the puddle only grew larger. APP has been doing work for me for a while so I called them. They were on a call, but said they would get there as soon as they could. It had to have been a very long day for them because they got there at 4 and in 95 degree heat dug down, finding and replacing the busted pipe. Thank you for saving the day! I will never use any other plumbing company!", "pics": null, "resp": null, "gmap_id": "0x8889013000000001:0x1cd18b6bac770bbd"}
{"user_id": "107350564436003065800", "name": "Henry Strong", "time": 1508348130210, "rating": 5.0, "text": "Replaced the old water service line and installed a backflow preventer for the upcoming sprinkler system. On budget and very nice people.", "pics": null, "resp": null, "gmap_id": "0x8889013000000001:0x1cd18b6bac770bbd"}
{"user_id": "113783782381522352755", "name": "Debbie Mcneal", "time": 1614396122274, "rating": 5.0, "text": "Great people great service", "pics": null, "resp": null, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "103646473251862452127", "name": "Scott Sams", "time": 1621366568374, "rating": 5.0, "text": "I called several plumbing repair companies to get that I can't tell you when I can be out were so busy blah blah blah when I was an emergency situation needing my drains unclogged. This man here is professional and understood my urgency. Had me unclogged in three hours or less. Don't waste your time on the other places give him a call!", "pics": null, "resp": null, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "108852118052585915468", "name": "Jeff Nash", "time": 1612539424293, "rating": 5.0, "text": "Had a water heater to start leaking called mr. plumber up they came out in 15 min put new water heater in very happy how fast they got it done will let them do my work from now on price was fair.cheaper than any other company out there.", "pics": null, "resp": null, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "104640388205910290879", "name": "Dusty Alexander", "time": 1573678642580, "rating": 5.0, "text": "Very professional. Owner is honest and transparent. Will likely need more work later and was educated on what the issue was and the proper solution with a ballpark quote.\n\nThey even offered to clean up as they were getting ready to leave. Would definitely recommend.", "pics": null, "resp": {"time": 1576157242498, "text": "Pleasure doing business with you"}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "111730388847689036162", "name": "Amy Fortson", "time": 1572021000581, "rating": 5.0, "text": "I recently used Mr. Plumber for the second time, and i would HIGHLY recommend their service.  They are dependable, affordable, friendly and honest. First rate, on time service with a smile.   I will always use Mr. Plumber !", "pics": null, "resp": {"time": 1576157260264, "text": "It was great working with you."}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "112482516080031298167", "name": "Endora XD", "time": 1587858255489, "rating": 5.0, "text": "Theu were fantastic!!! They responded to my call quickly and with in 30 mins someone was out there to fix our issues !! Thank yall so much", "pics": null, "resp": {"time": 1597094333568, "text": "Thank you for your business"}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "112601610971609567130", "name": "Amber Owens", "time": 1536602322638, "rating": 5.0, "text": "We really enjoyed using them. They were polite, professional and came out within an hour of calling them and got the job done quickly so that we would have hot water. I highly recommend them!", "pics": null, "resp": {"time": 1576157491394, "text": "Always striving to be timely and professional. Pleasure working with you"}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "105682144723291523094", "name": "Joshua Heron", "time": 1567044886834, "rating": 5.0, "text": "I have had a few things done by Mr. Plumber and they time and time again provide top notch service! Quality work every time it is done right so you don't end up calling them back, unless you have something else you need done. Not only are they plumbers but they can set up your gas lines also! I recommend this company to my own family who also has had work done by Adam and his team. You should call them too if you are looking for a company that provides quality work at a good price!", "pics": null, "resp": {"time": 1576157296324, "text": "Good working with you"}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "103473754274613447115", "name": "M Wyker", "time": 1567039000146, "rating": 5.0, "text": "These young men know plumbing. they know Hot is on the left ,cold is on the right and waste flows downhill.\nBut even deeper than that. They can not only read a blueprint they can design one for any plumbing need or idea you have..", "pics": null, "resp": {"time": 1567044629073, "text": "Thank You! We appreciate your business and review!"}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "103531023553348243874", "name": "Kayla Walker", "time": 1515802992147, "rating": 5.0, "text": "Very pleased with their service.  They had to come out twice and were very nice and informative. I would definitely recommend them.", "pics": null, "resp": {"time": 1576157536618, "text": "Thank you for your business"}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "103609128347712926993", "name": "Robert Weaver", "time": 1497118817541, "rating": 5.0, "text": "They responded as soon as possible. They determined the source of the leak and and had it fixed quickly. Each of the men who came were friendly, informative and worked quickly to resolve the problem. I would recommend them for any plumbing needs.", "pics": null, "resp": {"time": 1576157599557, "text": "Thank you for your business"}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "115118015122568402163", "name": "Maegan Wells", "time": 1481128237086, "rating": 5.0, "text": "Excellent company. Answered right away after hours. Came out first thing next morning and fixed our problem right away. Daniel was excellent and left everything neat and tidy when he was done. We will definitely use Mr. Plumber Cullman again for any plumbing needs!", "pics": null, "resp": {"time": 1576157632510, "text": "Thank you for your business"}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "111308278962041928405", "name": "Julie Hicks", "time": 1536355522054, "rating": 5.0, "text": "Came out same day fixed problem in no time. Very polite. Will use them again.", "pics": null, "resp": {"time": 1576157508435, "text": "Thank you for your business"}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "106513304133843377262", "name": "Alice England", "time": 1539906769584, "rating": 1.0, "text": "This man told us he was coming and just never showed up. No phone call, nothing.  Very, very unprofessional!", "pics": null, "resp": {"time": 1576157438277, "text": "Sorry that we never made it out. Not sure what happened. Call us and we will give you a discount on your next service"}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "101993448334658990976", "name": "Teresa", "time": 1508532046269, "rating": 5.0, "text": "This is second time I have used Mr Plumber. Answers their phone, and   If I had to leave message he would return call quickly. Came out same day or the next day if wasn't an emergency. They do  great work, very professional,  courteous, cleans up after job like they hadn't even been there and really reasonable rates. Hard to find a company and employees like that now a days.\nI would highly recommend Mr Plumber. They have my business from now on.", "pics": null, "resp": {"time": 1576157576074, "text": "Thank you for your business"}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "111619921242546537348", "name": "Shawn Jones", "time": 1541908805958, "rating": 5.0, "text": "Great customer service and great owners.", "pics": null, "resp": {"time": 1576157381912, "text": "Great doing business with you"}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "109653811697836152119", "name": "Seth Bavar", "time": 1535634659640, "rating": 5.0, "text": "Great people very intelligent and passionate about what they do", "pics": null, "resp": {"time": 1576157518587, "text": "Thank you"}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "108100778542682893272", "name": "Brandy Chambers", "time": 1552867785059, "rating": 5.0, "text": "Outstanding service! I will continue to do business with them!", "pics": null, "resp": {"time": 1576157360869, "text": "Always a pleasure working with you"}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "106537518503395125246", "name": "bjt 2077", "time": 1539833432125, "rating": 5.0, "text": "Honest and very professional.", "pics": null, "resp": {"time": 1576157454185, "text": "Pleasure working for you"}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "111335336228314988425", "name": "matthew suggs", "time": 1557168819883, "rating": 1.0, "text": "I've called for the last 3 days and never getting a response back to fix my problem with a leaky outside faucet", "pics": null, "resp": {"time": 1576157344834, "text": "Was having problems with at&t. I wasnt getting all of my calls"}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "111083950357111647567", "name": "Jennifer Adcock", "time": 1489542533624, "rating": 5.0, "text": "We had a great experience with Mr. Plumber. We had an leak in our water pipes which was in the foundation. The only complaint I have was they arrived a little late to the appointment.  They called and explained that they was running behind. Once they got here they apologized for the inconvenience. They got started and was finished in a timely manner. I would recommend them to my friends and family. If I have another problem I will definitely be calling them to come fix it.", "pics": null, "resp": {"time": 1576157616463, "text": "Pleasure working with you"}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "109935676240233217021", "name": "david cason", "time": 1561489364042, "rating": 1.0, "text": "he charge me 200 dollar for small leak\nowner is the one who came and fix he don't want to communicate he is rude guy never deserve to be in this business he robbed people in Cullman and Hanceville", "pics": null, "resp": {"time": 1576157115015, "text": "What was the guys name that came out? I do not have you in my system and previous owner is still doing work as mr plumber. We would like to do what we can to make you a happy customer."}, "gmap_id": "0x8889cffd06ca8211:0xfb6e6c3ec9bf3da5"}
{"user_id": "113819973866771758664", "name": "Karra Daniels", "time": 1616162568337, "rating": 5.0, "text": "Joey was absolutely wonderful! I called due to a water leak, they came out within a few hours. Service was fast and efficient with a thorough explanation of the problem! Very affordable as well. Will definitely be using them again in the future!", "pics": null, "resp": {"time": 1620462493633, "text": "Thanks so much for the kind words Kara!"}, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "106921182995379350024", "name": "Sandra Sams", "time": 1616431947078, "rating": 5.0, "text": "Very polite and knowledgeable about the situation. I will never use no one else.", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "115775915468932120774", "name": "Ken Barrett", "time": 1618510123757, "rating": 5.0, "text": "Prompt , professional service. I", "pics": null, "resp": {"time": 1620462441169, "text": "Thanks so much for the kind words Ken!"}, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "108938433569090277338", "name": "Darcy Davis", "time": 1601160715306, "rating": 5.0, "text": "I have used John Hearn Plumbing several times over the years and they have prompt and efficient service. The people are very polite and do what they say they will do!", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "109296647449030937801", "name": "Debra Abernathy", "time": 1615432237257, "rating": 5.0, "text": "The best in Calhoun county", "pics": null, "resp": {"time": 1615523994657, "text": "Thanks for the review Debra! You’re the best!"}, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "117424504415008173100", "name": "Jacob Buckheister", "time": 1565644091233, "rating": 5.0, "text": "Always very prompt and courteous staff when called upon. All my questions were answered efficiently and I felt they knew what they were doing. Above standard professional experience with these guys. Would recommend them to anyone! Thank you John Hearn Plumbing for such a great team.", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "117954278785834011863", "name": "Lori Deerman", "time": 1565617260906, "rating": 5.0, "text": "John Hearn Plumbing goes above and beyond to make sure his customers are happy. He is fair, dependable, and trustworthy. They are always professional and the office staff helps every way they can. I recommend them to anyone who needs a plumber.", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "117558025556326196241", "name": "Barry Underwood", "time": 1566347451982, "rating": 5.0, "text": "Hands down the best and most professional plumbing company I have ever dealt with. Service is fast and the work is top notch. Will only use them from now on.  Thanks guys.", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "116808671812460919297", "name": "Chad Taylor", "time": 1565644528591, "rating": 5.0, "text": "John Hearn Plumbing went above and beyond to satisfy my plumbing needs. Not only did he install new water lines and fixtures throughout my home, he also went out of his way to dig an entire new septic system in the outskirts of Heflin. Thank you for a job well done.", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "107106939102069516038", "name": "Vaughn Williams", "time": 1574817353421, "rating": 5.0, "text": "John Hearn Plumbing was on time,  great communication as to what was needed. Final charges were about $75. less than expected. Great company!", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "112025581593965589729", "name": "Marirae Smith", "time": 1557011344934, "rating": 4.0, "text": "I recommend Hearn Plumbing for your plumbing needs. Becky, who answers the phone, is one of the nicest people to talk to. She makes sure you have a plumber when you need one and we did. We had a complete new service put in from the water main to the house  and all of the sewage. The plumber (Joey) was very conscienceous and worked his but off. He got everything done. I was thrilled.", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "107556750592329312273", "name": "Jill Wade", "time": 1566301332892, "rating": 5.0, "text": "John hearn plumbing! Great service. Good Christian man! Honest man with great prices. Him and his staff are very friendly and professional!", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "116947990945611411916", "name": "William Spann", "time": 1544461455260, "rating": 5.0, "text": "Forget the two bad reviews. These guys are top notch pros. They worked us in to a busy winter season to get an emergency job completed on short notice. John Hearn called when his office said he would, and his crew called and showed up when they said they would and got the equipment ordered and his crew was here next day - got the plumbing and heat going in 24 hours, and now have a happy & warm customer.", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "112960636523732141322", "name": "Gulshan Sanghani", "time": 1543680791559, "rating": 1.0, "text": "do not get anything done without an estimate or they will rip you when the first time we took an estimate he charged only a $100.00 to fix a pipe to and from the water heater and was very good and the second time we just called without an estimate to fix a leak he used my 6ft ladder instead of having his own 8 foot which would be more sturdy he mistakenly steped a foot on the urinal attachment and now its leaking and also did a replacement of an 8\"to 10\" 3/4 copper tubing piece in place of a shut off valve and charged $303.00 for doing this smaller job than the one he did last time .", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "114681735177071607814", "name": "Teresa “Terri” Baker", "time": 1565559709657, "rating": 5.0, "text": "Have used this company several times. They have always responded in a timely manner, performed quality work, and charged reasonable rates. Thanks John Hearn Plumbing!", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "102712966588204956893", "name": "Andrea Decarlo", "time": 1565628563152, "rating": 5.0, "text": "Very professional and effective. I will be using them for all my plumbing needs.", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "117629299940504784885", "name": "Kara Griffin", "time": 1565536910612, "rating": 5.0, "text": "Friendly staff, great service, do recommend & will use again!", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "105517630092724996575", "name": "Randal Brown", "time": 1560992364929, "rating": 1.0, "text": "On Easter Sunday April 21st  woke up to my water heater leaking. Sostarted looking for a plumber. I found John Hearn Plumbing. They are open seven days a week and do not charge more for holidays. I gave them a call. They sent so meone out. The man looked at my water heater and gave me a price of $1100. I accepted it and told him to get started. He had a hard time getting someone to open up the place to get the heater. While he was waiting on them he left to go do work at Western Sizzlin. About two hours later he came back and left the heater on my carpool and went back to Western Sizzlin. Even though I was first I got pushed back for a higher paying job. He showed back up just before dark to put n this heater. He had to put it in by flashlight because at that time the light in the utility room was blown. When he took it out of the box it was broken. He fixed it an made a notation on my invoice. So I just paid $1100 fo a brand new broken heater. When he got done that night there was still water on the floor. Could not tell at that time for there was a leak or not.  A couple of days later called them back out because there was a puddle on my carport. The same guy came out in the dark again to find a leak. He looked at the heater and sad it was not it. He looked around and decided that it was my washing machine leaking and charged me another $125. I bought a new washer and hoses and had it installed. There has been water on the floor of the utility room ever since. Monday June 17 the leak that the sad I did not have finally got bg enough that I could see it. So around 3pm I called them. They said that they would send someone out the next day and would call me before hand to let me know. At five thirty Tuesday June18th I called them back to see why I had not heard anything. They acted like I hadn't called. Someone showed up at 8:30pm and sad that the leak is on the copper pipe and s not part of the water heater and would cost me $95. I sad let me get this straight I paid $1100 for a broken heater the a couple of days later paid $125 to have him come out to fix a leak that he could not find and now you want me to pay another $95 to fix the that should have been fixed the day the heater was put in? I will never use these people again. I wouldn't use them to sweep a floor. Use them are your own peril.", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "116138299688064702074", "name": "M. Connell", "time": 1519314517837, "rating": 5.0, "text": "I love this plumber! We've used them 3 times so far.  If you're in a a tight spot, He and/or his guys will get to your house as soon as they can.  They have a \"we'll make it happen\"  attitude, which is so lost in most buisnesses these days.  They are clean, get right to work, and always fix our problems.  We had my mom's bathroom renovated and two of the guys had to get through our TINY crawl space to get under the house for the new plumbing.  They were under there for what seemed to me like a couple of hours. Another time John stayed at our house late to fix a problem.  Amazing. I think we can't go wrong with John Hearn Plumbing.", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "116687709501963144438", "name": "Jane Hutchins", "time": 1565632603602, "rating": 5.0, "text": "Very professional and reasonable.  Found and solved our problem and made sure it was 100%.", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "118057000762452586142", "name": "Bonnie Mcleod", "time": 1519269413671, "rating": 5.0, "text": "Professional, Honest, and knows every aspect of plumbing, gets the job done right the first time! Highly recommend these guys!", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "117003231345703539835", "name": "J Whitehead", "time": 1537404359386, "rating": 1.0, "text": "Terrible customer service.  Could never get an estimate out of these people. I talk to John Hearn myself gave my number and email and could not get a response. I recommend mr. Dan plumbing. I called them and had a gas hot water heater installed the same day.", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "109569235014467526238", "name": "Gary Chumbler", "time": 1466721677730, "rating": 5.0, "text": "I called John and explained to him my problem, he gave me some professional advice. I appreciate him and his advice. I highly recommend him for all your plumbing needs.Thanks John.", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "105541779698959827913", "name": "Kelly Whitlock", "time": 1428536777744, "rating": 5.0, "text": "Awesome experience. Timely, clean work, dependable, honest & will do the job right the first time! Thanks John!", "pics": null, "resp": null, "gmap_id": "0x888bae6de0694e87:0x2763d85545ff1034"}
{"user_id": "112086788820260679085", "name": "Markeisa Silmon", "time": 1578229816532, "rating": 5.0, "text": "Very knowledgeable, affordable, and professional. Gave me and ETA and arrived at that exact time and he came in and got the job done. Will definitely be using again!!!", "pics": null, "resp": null, "gmap_id": "0x8889734de652787f:0x226310a4cf543531"}
{"user_id": "102913071733146327687", "name": "Sy Belyeu Lankford", "time": 1564943189739, "rating": 5.0, "text": "Wes and Ross were really nice!! Quickly assessed my plumbing issues and made the appropriate repairs! I would certainly use again with any of my or my client's plumbing needs.", "pics": null, "resp": null, "gmap_id": "0x8889734de652787f:0x226310a4cf543531"}
{"user_id": "116614172548961516937", "name": "Larkin Ison", "time": 1565280864798, "rating": 5.0, "text": "Around the Clock Plumbing is the only plumbing company we use.  The owner, Arthur, is an experienced professional who is very reliable in any scenario or situation.  Keep up the good work!", "pics": null, "resp": null, "gmap_id": "0x8889734de652787f:0x226310a4cf543531"}
{"user_id": "102242746111059037071", "name": "Sharon Smith", "time": 1561860919916, "rating": 5.0, "text": "Around the clock plumbing in Huntsville, these guys ROCK. I call for an appointment on a Saturday morning, and they had a tech out to my home within a couple of hours, and I may add this because this is my opinion he was very handsome and professional. I was very satisfied with the service and the rate. Thank you Around the clock plumbing for you service. My toliet is working very well this evening.\nThank you,\nSharon", "pics": null, "resp": null, "gmap_id": "0x8889734de652787f:0x226310a4cf543531"}
{"user_id": "104821387239817218663", "name": "Shiney Elephant", "time": 1528484838398, "rating": 5.0, "text": "Great service!  James was very thorough about answering my questions and making sure I understood what he was doing and why.  He showed up on time and was very nice and friendly.", "pics": null, "resp": null, "gmap_id": "0x8889734de652787f:0x226310a4cf543531"}
{"user_id": "114047021646552133714", "name": "Madison Lowry", "time": 1559574888617, "rating": 5.0, "text": "reliable and knowledgeable, Arthur will make sure you are taken care of AND if they don’t fix the problem, they won’t charge you.", "pics": null, "resp": null, "gmap_id": "0x8889734de652787f:0x226310a4cf543531"}
{"user_id": "104676535967740214410", "name": "Ann Russell", "time": 1565479171582, "rating": 5.0, "text": "Always dependable and helpful. Reasonable prices", "pics": null, "resp": null, "gmap_id": "0x8889734de652787f:0x226310a4cf543531"}
{"user_id": "117424292895987302563", "name": "Angela Mcclintock", "time": 1546317188727, "rating": 1.0, "text": "They came to fix my sink and did not even bring a flashlight with them. I lent them a 40.00 powerful flashlight, i had purchased recently.  They commented on what a nice flashlight it was and they proceeded to take it with them.  I even called to ask for them to bring it back and they never did.  I called the HQ and told the same thing. He promised to find the flashlight and call me back. He never did.", "pics": null, "resp": null, "gmap_id": "0x8889734de652787f:0x226310a4cf543531"}
{"user_id": "110593532366276801183", "name": "michael allison", "time": 1574287082680, "rating": 4.0, "text": "Had  Brian and his  partner out to replace the kitchen disposal, knocked it out quick and were on time. Will use them again.", "pics": null, "resp": null, "gmap_id": "0x8889734de652787f:0x226310a4cf543531"}
{"user_id": "104442691798694448213", "name": "Mindz Majorz", "time": 1523288139048, "rating": 5.0, "text": "Honest and affordable plumbing! Highly recommend! Excellent service! Very professional!", "pics": null, "resp": null, "gmap_id": "0x8889734de652787f:0x226310a4cf543531"}
{"user_id": "115402384702455701270", "name": "Jan Teachey", "time": 1564613772871, "rating": 5.0, "text": "I have used them numerous times on numerous houses!  Great results and service!!!", "pics": null, "resp": null, "gmap_id": "0x8889734de652787f:0x226310a4cf543531"}
{"user_id": "102146081209965360533", "name": "Drake Riley", "time": 1477020393235, "rating": 5.0, "text": "Very affordable, quick response, great work! I would recommend them.", "pics": null, "resp": null, "gmap_id": "0x8889734de652787f:0x226310a4cf543531"}
{"user_id": "114616922718612146648", "name": "anthony bogan", "time": 1575174864777, "rating": 5.0, "text": "They are the best", "pics": null, "resp": null, "gmap_id": "0x8889734de652787f:0x226310a4cf543531"}
{"user_id": "116831691107506082780", "name": "John Santoro", "time": 1508166183772, "rating": 5.0, "text": "A+++++  Professional !!!!!   Super Service!!!!!      Courteous, Polite ,Respectful, Fast and Reasonably priced............", "pics": null, "resp": null, "gmap_id": "0x8889734de652787f:0x226310a4cf543531"}
