{"user_id": "108679212906558368647", "name": "C Baker", "time": 1537988448451, "rating": 5.0, "text": "Patient, kind, wonderful. This place is really nice, has a nice vibe, the the staff is friendly, which makes these kinds of visits easier.", "pics": null, "resp": null, "gmap_id": "0x888a3ed780dc4555:0x270310a49904568f"}
{"user_id": "108988298805545414787", "name": "Mark Postell", "time": 1503953846956, "rating": 5.0, "text": "I have always felt comfortable with, Dr. Haritha. He is very professional and congenial. He is able to calm the anxiety, of necessary concerns.\nThank you, Dr.Hari", "pics": null, "resp": null, "gmap_id": "0x888ec88059c70f3b:0x7122ca18326bee7"}
{"user_id": "107824135829194189914", "name": "Diane Stiffler", "time": 1498095747609, "rating": 5.0, "text": "Upper GI - Staff and Dr. Hari were professional and thorough in their testing and treatment of my problems.  Dr. Hari speaks directly to you and provides a complete picture with diagrams so that the patient can understand what was found and what treatment will be moving forward.", "pics": null, "resp": null, "gmap_id": "0x888ec88059c70f3b:0x7122ca18326bee7"}
{"user_id": "117347802860511995019", "name": "William Peacock", "time": 1483645293160, "rating": 1.0, "text": "Unable to contact him for appointments or to change appointments. Been trying to call him for over a week.", "pics": null, "resp": null, "gmap_id": "0x888ec88059c70f3b:0x7122ca18326bee7"}
{"user_id": "102404992422371732257", "name": "DaniW", "time": 1612552254864, "rating": 1.0, "text": "I have waited for months to have procedures to find out what is going on with my health. Dr Harry cancelled my procedure 3 times. Now I have to start over and see another Gastroenterologist. A half of a year later.", "pics": null, "resp": null, "gmap_id": "0x888ec88059c5b4cb:0xe853f156cd6d68ec"}
{"user_id": "114637732058709266471", "name": "Stacey Rice", "time": 1582138282467, "rating": 1.0, "text": "I love Dr Hari dont get me wrong but seriously he needs someone that can better schedule his patients!!  The past 2 visits the wait has been over an hour!!  My previous visit I had to reschedule due to he was about 3 hours behind!  Why make people wait that long, just call us and reschedule without us having to miss work!!  Now today my appointment was at 12 and I've been here over an hour and they still say it will be another 20 to 30 minutes", "pics": null, "resp": null, "gmap_id": "0x888ec88059c5b4cb:0xe853f156cd6d68ec"}
{"user_id": "107824135829194189914", "name": "Diane Stiffler", "time": 1560885543229, "rating": 5.0, "text": "I totally trust Dr. Hari.  He is thorough and informative.   He tells you direct and does not sugar coat the situation if there is a problem.  My family uses Dr. Hari exclusively.", "pics": null, "resp": null, "gmap_id": "0x888ec88059c5b4cb:0xe853f156cd6d68ec"}
{"user_id": "100012447969599081713", "name": "Dana Cease", "time": 1497913024850, "rating": 4.0, "text": "Love Dr. Hari, but he really needs to get someone to answer the phone.  Regardless of what time during the day you call, no one never answers the phone.  Can't leave a message because its never cleared out and and its full.. Hell other Dr. Offices can't even get in touch with them. Dr. Hari will say call my office and make a appointment,  but with noone answering the phone,  how can you. Even went out to his office and still don't get a call back or anything else.", "pics": null, "resp": null, "gmap_id": "0x888ec88059c5b4cb:0xe853f156cd6d68ec"}
{"user_id": "106046909783002548252", "name": "Dana Cease", "time": 1499733611094, "rating": 1.0, "text": "If I could give a rating lower than one, I would do so. I have dealt with a lot of doctor's in my lifetime,  but never in my life have I dealt with a doctor's office that never has anyone answer the phones,  return phone calls or call and give the patient the results of test that he/ she may have had. I am not the only one that has the issue of getting someone to answer the phone or return your call as Heather claims they will do when you leave a message , and even then leaving a message you are lucky if they have it where you can. 99.9% of the time, the voice mail box is slam full and you can't leave a message.  Heather claims that calls will be returned but that is a flat out lie. Btw I am not the only patient with this issue. I have spoken with about 20 if not more patients who have the same issue. Same goes with other Dr. Offices, they can't even get anyone to call them back, nor are they able to even make a appointment with Dr. Hari's office cause there again no one ever answers the phone .. Pharmacy's are the same way, they are unable to get anyone to call them back when they call to get refills for a patients meds that they have no refills on. This is very unacceptable and as a doctor's office , his patients is not his first priority, or should I say it isn't his office people's priority.  I really did like Dr Hari but to be treated as I have been by his so called office staff is unacceptable.  He really needs to get someone in there that can do their job.  I am still waiting on test results from a ultrasound I had done of my stomach and liver , trying to figure out of I have cancer. I have several factors that could cause it. My mother died from it Jan 3, 2016. I did find out today through no help of his office that I could come to the hospital and go to medical records and get the info I need there.  I have two of my other doctor's who have been trying to get the results from him, and you guessed it, Heather nor anyone else will answer the phone and I am assuming she throws all medical requests from other docore in the trash. One of my doctors has faxed my medical release form 4 times and still nothing.  But gave up on calling.  Bottom line, this is NOT HOW YOU RUN A DOCTOR'S OFFICE AND IT'S VERY UNACCEPTABLE.", "pics": null, "resp": null, "gmap_id": "0x888ec88059c5b4cb:0xe853f156cd6d68ec"}
{"user_id": "116287715421869112092", "name": "Brian T. Swords", "time": 1628566694606, "rating": 3.0, "text": "8/9/21\nHandicap parking is downhill & in the rear of the building. It's then appx 150 yards back uphill & to the front entrance.\n\nWent in for a consultation, after failing a Cologuard test but not with the doc. Staff only (pleasant). Was told I would meet him \"just before the procedure\". I really would have preferred to meet during the consult.\n\n2.5 stars rounded up to 3. Will update, if needed, after the proc, several months from now. If guarding against colon cancer is important, then it shouldn't take 6 months or more to get checked. This is not a negative comment against the doc. Just a matter of frustration with the system.", "pics": null, "resp": null, "gmap_id": "0x888a3f2f54c51dcf:0x102833fc97b793c7"}
{"user_id": "104903868229753825527", "name": "kimberlina68", "time": 1619540178123, "rating": 5.0, "text": "He is truly a “thinker.”   He is simple brilliant.  I have never felt so comfortable, being in someone’s care.  I am still very sick, but I know he is not giving up on finding out why I am so sick and maybe find some effective treatment for me, so I won’t give up either.", "pics": null, "resp": null, "gmap_id": "0x888a3f2f54c51dcf:0x102833fc97b793c7"}
{"user_id": "107087564865486021500", "name": "Tabitha Tant", "time": 1622727058113, "rating": 5.0, "text": "One of the best offices i've ever been to !\nThe staff was friendly and accommodating and Dr. Amin took time to explain everything and answer all of my questions .\nI would highly recommend", "pics": null, "resp": null, "gmap_id": "0x888a3f2f54c51dcf:0x102833fc97b793c7"}
{"user_id": "105767320978026078724", "name": "Angela Parker", "time": 1615408947953, "rating": 5.0, "text": "Dr. Amin is one of the best if not the best most comprehensive doctors I have had the pleasure to meet. He doesn't just look at gastro issues but will refer if he believes that the issue involves something else. I have used him for six years and would not change for anything.", "pics": null, "resp": null, "gmap_id": "0x888a3f2f54c51dcf:0x102833fc97b793c7"}
{"user_id": "111216998578020161004", "name": "Connie Rigsby", "time": 1614626529486, "rating": 5.0, "text": "He was wonderful with my elderly mom.", "pics": null, "resp": null, "gmap_id": "0x888a3f2f54c51dcf:0x102833fc97b793c7"}
{"user_id": "112408529955548509155", "name": "Kelly Murillo", "time": 1599161537758, "rating": 5.0, "text": "Couldn't of had a better visit with Dr Amin he was very nice and so was his staff.. id recommend  him for sure.", "pics": null, "resp": null, "gmap_id": "0x888a3f2f54c51dcf:0x102833fc97b793c7"}
{"user_id": "115914698249399902616", "name": "Kim Lillard", "time": 1581764269361, "rating": 5.0, "text": "I have the worst stomach problems and Dr.Amin is the only one that was able to figure out what it was and helped and ilove him he is a very friendly person and I am grateful for for such amazing doctor thank you see u soon if u got any  gastrointestinal problems  he ur man will dr.man lol AMIN THE BEST", "pics": null, "resp": null, "gmap_id": "0x888a3f2f54c51dcf:0x102833fc97b793c7"}
{"user_id": "104920823977579800712", "name": "Lucretia Green", "time": 1573092483556, "rating": 5.0, "text": "I have been his patient since 2017. I love him. He is very patient, caring, and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x888a3f2f54c51dcf:0x102833fc97b793c7"}
{"user_id": "105817582471249656520", "name": "Kim Foster", "time": 1504017946527, "rating": 5.0, "text": "I absolutely love Dr. Amin. I would recommend him to all my family and friends. He takes his time with you and you never feel like your rushed. His office staff is very nice and friendly. Wait time in office was to be expected because like I said, he never makes you feel rushed and takes time with each patient. I  don't mind waiting for good doctors.", "pics": null, "resp": null, "gmap_id": "0x888a3f2f54c51dcf:0x102833fc97b793c7"}
{"user_id": "113377174297416434384", "name": "Diane Williams", "time": 1488292506460, "rating": 4.0, "text": "I like Dr Amin and staff very much. He took the time to discuss everything thoroughly. Would have given 5 stars except I felt wait after arrival for appointment was excessive.", "pics": null, "resp": null, "gmap_id": "0x888a3f2f54c51dcf:0x102833fc97b793c7"}
{"user_id": "107429085154530082398", "name": "Rita Maltbie", "time": 1488582355099, "rating": 5.0, "text": "Very thorough, quick appointment time , must have doctor referral.", "pics": null, "resp": null, "gmap_id": "0x888a3f2f54c51dcf:0x102833fc97b793c7"}
{"user_id": "102435606580255875708", "name": "maggie jane thacker", "time": 1563891232349, "rating": 5.0, "text": "Best doctor in Gadsden", "pics": null, "resp": null, "gmap_id": "0x888a3f2f54c51dcf:0x102833fc97b793c7"}
{"user_id": "103499436250673470189", "name": "Carol Payne", "time": 1521821441600, "rating": 5.0, "text": "Awesome  Dr and Staff", "pics": null, "resp": null, "gmap_id": "0x888a3f2f54c51dcf:0x102833fc97b793c7"}
{"user_id": "109825158923629385291", "name": "Brandy M", "time": 1599234635034, "rating": 2.0, "text": "Felt rushed. We had to check in at 3 different desk (could have been because of Covid-19). We had to wait nearly 10 mins for the girl at the 3rd desk to return, so we could get our paperwork to fill out as new patients. The nurse that called us to the back wasn't very friendly. She was too chatty with other staff members. The nurse that came in for vitals came in pretty quickly. The doc came in shortly after that. I tried to turn the paperwork in to him. He said give it to the nurse. I tried to give it to the nurse. She said give it to check out. Tried to give it to check out, they said give it to the desk that had given it to us.\nAgain we waited so long for the girl at that 3rd desk to return that we nearly walked out of the place with the paperwork.\nLast but not least the womans restroom wasn't very clean. Not like too scared to sit but more like paper products and water on the floor.\nGave 2 stars because of the waiting. They said should take 2 days for the test results. Which of course fell on a Friday. By 2pm on Monday still no call. It's not right to make a sick and disabled patient wait like that. Especially when they had the results on Friday (I asked).", "pics": null, "resp": null, "gmap_id": "0x889a4d763ceb9059:0xde07914d42929f06"}
{"user_id": "100465127164115649778", "name": "Debra Murphy", "time": 1589982657065, "rating": 5.0, "text": "Dr. G is very thorough and knowledgeable in his field. Spends a lot of time explaining and doesn’t rush in and out. My mentally challenged brother sees Dr G as well. He is wonderful with him and talks directly to him in a way he can understand. So impressed by him in started using Dr. G.", "pics": null, "resp": {"time": 1597685116401, "text": "Hi Debra, thank you for the 5-star review. We truly appreciate you taking the time to rate Dr. Grevenitis and for recommending our medical practice!"}, "gmap_id": "0x889a4d763ceb9059:0xde07914d42929f06"}
{"user_id": "112150779069207444644", "name": "Tammy B. Farver", "time": 1607374908238, "rating": 5.0, "text": "Very kind, listend to my concerns, made me feel like he REALLY cared. His nurse is also very kind and helpful.", "pics": null, "resp": null, "gmap_id": "0x889a4d763ceb9059:0xde07914d42929f06"}
{"user_id": "117128745054179852254", "name": "Jennifer Harmon", "time": 1549323896254, "rating": 5.0, "text": "Great Doctor!! Very professional and courteous. I did not have to wait long at for my visit there and very pleased .", "pics": null, "resp": {"time": 1551288341039, "text": "Thank you for the 5-star review, Ms. Harmon. Dr. Grevenitis takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. We appreciate your feedback and are so glad you had such a positive experience."}, "gmap_id": "0x889a4d763ceb9059:0xde07914d42929f06"}
{"user_id": "109191607236326035269", "name": "Renee Haynes", "time": 1595623797859, "rating": 5.0, "text": "Dr Orleans is awesome and so is his staff. Go see for yourself and make your own opinion about him instead of listening to the bad reviews. I realize people sometimes have bad experiences but all mine have always been wonderful. Thank you Dr Orleans and staff!", "pics": null, "resp": null, "gmap_id": "0x889a4e1c8e41591d:0x6f02eb8ac25ade58"}
{"user_id": "107061948462776552968", "name": "Sandi Cushway", "time": 1582832495024, "rating": 4.0, "text": "Dr. Orleans has been my Gastro for quite a few years.  I never have a problem scheduling an appointment or having to wait for an appointment (considering I schedule my appointments at the end of the day).  The staff is always friendly and helpful.  (Pref Eastern Shore location)", "pics": null, "resp": null, "gmap_id": "0x889a4e1c8e41591d:0x6f02eb8ac25ade58"}
{"user_id": "111090314818402720864", "name": "BOBBY LEIBFREID", "time": 1521234360851, "rating": 1.0, "text": "Just awful...they triple book patients and they let big pharma in to see the doctors. My appointment was,at 2:30...Its,after 4 pm.Im still here being tortured. Sucks.", "pics": null, "resp": null, "gmap_id": "0x889a4e1c8e41591d:0x6f02eb8ac25ade58"}
{"user_id": "117144415953474086767", "name": "Christie Ramsey", "time": 1494617487119, "rating": 5.0, "text": "Dr.Rice is the best and really takes care of his patients! He treats you with respect and talks to you so you can understand. He is really passionate about taking care of his patients and cares about their concerns. If you want a good gastro doctor he is the one to see!", "pics": null, "resp": null, "gmap_id": "0x886213532b8306f1:0x495ee0809b7672b4"}
{"user_id": "115454494478660159202", "name": "Brooklyn Green", "time": 1494617522710, "rating": 5.0, "text": "Dr. Bradley Rice is a great physician! He answers all your questions in depth, and he does not mind taking a little extra time to make sure all your questions are answered. Overall, I had an amazing experience at Alabama Colon and Gastro and would recommend Dr. Rice to anyone.", "pics": null, "resp": null, "gmap_id": "0x886213532b8306f1:0x495ee0809b7672b4"}
{"user_id": "107458937588021202481", "name": "Miranda Hadden", "time": 1504642547979, "rating": 2.0, "text": "If I were able to give Dr. Rice a review simply for himself, he would be 5 stars.  He is willing to think outside of the box and takes other factors and conditions into account when trying to find a solution for your problem.  Unfortunately, my experience with his PA,  CRNP, and nurse were less than 1 star and those are the ones you typically have to see before you can see Dr. Rice.  They only want to hand you a prescription and schedule a follow up without really listening to what is going on.   On two occasions I specifically requested that my appointment be with Dr. Rice ONLY and still had to see the new CRNP.  This is when things went to a new level of unprofessional.  He wasn't even at the office on the day of my last appointment, which was surgical follow-up.  In my opinion, that is not OK.   I asked if there were a way for me to leave a message only for Dr. Rice about what had taken place, and was told that I couldn't.  There should be a way for patients to leave a message or contact the doctor directly so that they can hear first hand the patient experience when there is a problem with a member of his staff.", "pics": null, "resp": null, "gmap_id": "0x886213532b8306f1:0x495ee0809b7672b4"}
{"user_id": "109999657419468238239", "name": "J C", "time": 1575254122244, "rating": 1.0, "text": "Top notch doctor but the staff said they don’t accept Cigna Medicare Supplement but by law they must  So I found another doctor.", "pics": null, "resp": null, "gmap_id": "0x886213532b8306f1:0x495ee0809b7672b4"}
{"user_id": "105878824883588988881", "name": "Dianna Tucker", "time": 1501169411380, "rating": 5.0, "text": "Drove five hours yo see him prior yo moving yo the area.  I would recommend this  doctor and his staff.", "pics": null, "resp": null, "gmap_id": "0x886213532b8306f1:0x495ee0809b7672b4"}
{"user_id": "104710107091342645257", "name": "Stacy Bell", "time": 1413831826475, "rating": 1.0, "text": "Dr. Bradley Rice assured me I would be asleep during an endoscopy and Colonoscopy procedure. I was wide awake and explained to him that he had promised me I would be asleep. He proceeded to preform the procedures without my consent and while I was awake  After going through preparation for the colonoscopy for 4 days prior which was miserable enough he tried to preform the colonoscopy, after I began screaming and he stopped, claiming it was my fault because I took a certain medication which he said was not on my initial paperwork.  It was on there as clear as this review!", "pics": null, "resp": null, "gmap_id": "0x886213532b8306f1:0x495ee0809b7672b4"}
{"user_id": "107024807055349997095", "name": "Alan Raetz", "time": 1491838419871, "rating": 5.0, "text": "Very nice and competent doctor.  Takes time to talk and listen to his patients.", "pics": null, "resp": null, "gmap_id": "0x886213532b8306f1:0x495ee0809b7672b4"}
{"user_id": "114900473370465384349", "name": "Kim Patterson", "time": 1541527239937, "rating": 5.0, "text": "Very nice and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x886213532b8306f1:0x495ee0809b7672b4"}
{"user_id": "104266517306296591593", "name": "K L McIntyre", "time": 1627574039744, "rating": 5.0, "text": "Great staff. Feel safety protocols are followed.", "pics": null, "resp": {"time": 1627668566120, "text": "Thank you for your kind review!  We are happy you felt safe and we will pass along your comments to the team here at Gastro Health - Grandview. Have a great day!"}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "114409573014118385066", "name": "Tracy Moore-Streeter", "time": 1628875590663, "rating": 5.0, "text": "Attentive, scheduling of appointments, cleanliness of facility, patient care, comfortable atmosphere, and positive patient/nurse relationship.", "pics": null, "resp": null, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "105025429096360075167", "name": "Andy Patchel", "time": 1628701623713, "rating": 5.0, "text": "I have received many infusions from this place and evertime the staff/nurses are professional, friendly and kind. I truly appreciate all they do for me!!", "pics": null, "resp": null, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "115065681296067950306", "name": "Fairfax Nabers", "time": 1627667807044, "rating": 5.0, "text": "I like the new location for the ease of parking and space.   Nice too to not have to deal\nwith a parking lot.......", "pics": null, "resp": {"time": 1627669589172, "text": "Hi Fairfax, we really appreciate your feedback and the 5 star review. \rHave a great day!"}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "107160687523138387399", "name": "Latrice Jones", "time": 1619798310487, "rating": 5.0, "text": "I had a great experience here! Very busy office but I did not wait long. The ladies at check-in were friendly,  the nurse who assisted with vitals was nice, as well as the nurse practitioner, who came in first to gather details. Dr. McVey was also great. Listened to my issues and responded. Great experience", "pics": null, "resp": {"time": 1619800752038, "text": "Thank you so much for taking the time to tell us about your positive experience. We have already shared your kind words with our staff. Please contact us if we can do anything else for you. Have a great day!"}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "105605448559684949886", "name": "Janet Rose", "time": 1626812518008, "rating": 5.0, "text": "I got appointment quickly to see Dr. I got appointment for procedure quickly. Doctor and staff are good listeners and very thorough.", "pics": null, "resp": {"time": 1627669302452, "text": "Dear Janet, thank you so much for taking the time to share your experience. We really appreciate the great review! Have a wonderful day!"}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "117898232474000565546", "name": "Olen Hutchins", "time": 1627492117526, "rating": 5.0, "text": "I receive excellent care and very professional care. I would and do recommend you to people I know.", "pics": null, "resp": {"time": 1627669992680, "text": "Olen Hutchins, thank you for taking the time to leave us such a great review and for recommending Gastro Health - Grandview. Have a great day!"}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "114031727105017158752", "name": "Karen Sayre", "time": 1615402201312, "rating": 5.0, "text": "The front desk receptionist was so friendly! Very efficient! The assistant was thorough and friendly! The NP was awesome! I loved everyone. The checkout girl was very friendly and thorough. I was very impressed with this office staff and their process!", "pics": null, "resp": {"time": 1615472167837, "text": "Thank you for your kind words and this wonderful review! Please let us know if there is anything else we can do for you. We are always happy to help."}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "109860758169493464364", "name": "Jennifer Hamilton", "time": 1626212257782, "rating": 5.0, "text": "Holly an amanda are awesome...i appreciate all they do...there very caring....", "pics": null, "resp": {"time": 1626271045818, "text": "Hi Jennifer! Thanks for the kind words about our team at Gastro Health - Grandview...we will definitely let them know.  Have a great day!"}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "110427090455406824904", "name": "audrey ray", "time": 1627604426629, "rating": 5.0, "text": "Very nice staff. Great experience", "pics": null, "resp": {"time": 1627669559964, "text": "Audrey, thank you for your kind review. We are happy to pass along your comments to the team here at Gastro Health - Grandview. Have a great day!"}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "117925725236765457698", "name": "Kimberlyn Lang", "time": 1623506321933, "rating": 5.0, "text": "From beginning to end all staff is wonderful and kind. They're caring and very knowledgeable.", "pics": null, "resp": {"time": 1624296634827, "text": "Hi Kimberlyn, thank you for your kind words and this wonderful review!"}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "106979126235862118550", "name": "Greg Wooten", "time": 1623261092122, "rating": 5.0, "text": "Caring and friendly. The staff is amazing. They are a pleasure to talk with.", "pics": null, "resp": {"time": 1624404584970, "text": "Hi Greg, thank you for your kind words and this wonderful review!  We are here for you if you happen to need our services in the future. - Your Gastro Health Grandview Care Team"}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "110281599761884669893", "name": "Nancy Kerklin", "time": 1622586144885, "rating": 5.0, "text": "Very professional and caring!   Prior gastro was rude and condescending.   Did not listen nor explain well.   It is so refreshing to have found Gastro Health and Dr. McVey and her staff!", "pics": null, "resp": {"time": 1622728919966, "text": "Hi Nancy, we're glad you had such a wonderful experience with us! Thank you for taking the time to share your kind words about Dr. McVey and the team here at Gastro Health. Have a great day!"}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "104775105893514174883", "name": "Kelsey Towns", "time": 1627074761543, "rating": 5.0, "text": "Everything! I love the environment and professionalism.", "pics": null, "resp": {"time": 1627670942376, "text": "Hi Kelsey, we are very happy to have provided you with such a positive experience!  Have a great day!"}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "102202893780270586002", "name": "Lauren Cook", "time": 1615286157244, "rating": 5.0, "text": "Gastro Health staff were wonderful and very attentive to my needs. Making an appointment was easy and the location was clean and safe. Would highly recommend them to my family and friends.", "pics": null, "resp": {"time": 1615300970321, "text": "We appreciate your positive review about your recent experience with us! We hope to be of service to you again in the future. \rBest wishes, \rGastro Health"}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "117364403980502089257", "name": "Karmisha Weaver", "time": 1626975945471, "rating": 1.0, "text": "Nothing they I saw was good about this place very sorry dr office won’t go back", "pics": null, "resp": null, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "113102592466023124923", "name": "Shelby Kizziah", "time": 1628000110379, "rating": 5.0, "text": "Always helpful, always friendly, always efficient!", "pics": null, "resp": null, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "117349190600565470780", "name": "Peggy Henderson", "time": 1628627221795, "rating": 5.0, "text": "Made prompt appointments & trying to get to the root of my problem.", "pics": null, "resp": {"time": 1628804512066, "text": "Thank you so much for taking the time to share your positive experience with our team at Gastro Health - Grandview.  Have a wonderful day!"}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "105122675598193104555", "name": "Hal Webster", "time": 1613076115432, "rating": 1.0, "text": "I called the Grandview location on Feb 10th, 2021 to make arrangements for a colonscopy procedure.  The first time I called I was on hold for 30 minutes before a rep answered. We made arrangements for procedures but I was to call back and tell her what prep kit I have.  The second time I called I was on hold for an hour and finally hung up.  Called back and chose the doctors option and got in touch with someone that connected me to office rep. How frustrating and what a waste of time! I noticed that Luna Health is now in charge and has centralized call answering for all  Gastro Health locations.  Look up Luna on line and they cater and sell their services to Doctors. BUT LUNA HEALTH FORGOT TO TAKE CARE OF THE CUSTOMERS! GASTRO HEALTH CUSTOMERS BEWARE! SHAME ON LUNA HEALTH!", "pics": null, "resp": null, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "106263409483843589979", "name": "mary cole", "time": 1626217847743, "rating": 5.0, "text": "I like that you are very professional and the place is clean.", "pics": null, "resp": {"time": 1626271070034, "text": "Hi Mary! We are so happy we met your expectations. Thanks for sharing. Have a great day!"}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "101038683260925151943", "name": "Brick Mason", "time": 1601071308977, "rating": 1.0, "text": "The staff does not communicate with you. I received the insurance statement for the biopsy and still have not got the results in the mail. I know this is just a job to them but being a cancer survivor, it is torture waiting on test results. My wife had to call them after 9  days to get them to call me. A little common courtesy would be nice.", "pics": null, "resp": {"time": 1601479126272, "text": "Thanks for bringing this matter to our attention. We would like to get more details about this; please reach out to us at your earliest convenience at (205) 663-1023."}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "117702815222979182196", "name": "Patricia Golden", "time": 1627042573172, "rating": 4.0, "text": "Everything else was excellent!!", "pics": null, "resp": {"time": 1627671192660, "text": "We appreciate your positive review about your recent experience with us!"}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "100452063499881264245", "name": "Lee n Orean Edwards", "time": 1628011204040, "rating": 5.0, "text": "Friendliness of staff.", "pics": null, "resp": null, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "106753273004653860046", "name": "Joe McKinley", "time": 1627832654483, "rating": 5.0, "text": "Good communication.", "pics": null, "resp": {"time": 1628804990832, "text": "Thank you for taking the time to share your positive experience. Have a great day!"}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "114273493877024697713", "name": "Angie Osborne", "time": 1620421126884, "rating": 5.0, "text": "Calling with results as promised.", "pics": null, "resp": {"time": 1620658307383, "text": "We appreciate your positive review about your recent experience with us!"}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "106260467079461224098", "name": "Alma Guizar", "time": 1628915433888, "rating": 5.0, "text": "Everything", "pics": null, "resp": {"time": 1628962592296, "text": "Thank you for taking the time to give us such a great rating!"}, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "103673073624891836889", "name": "Linda Golden", "time": 1574461893216, "rating": 5.0, "text": "Love Dr Brunson.", "pics": null, "resp": null, "gmap_id": "0x888917a0bf950e41:0x37f3d9e2ccb2b4f1"}
{"user_id": "107263161964874413206", "name": "Michael Alexander", "time": 1622036432082, "rating": 1.0, "text": "Let me make this very clear, i never write reviews but today my first one will go to Dr.Kashyap. I am a 25 year old male who went in to this office to get help with my problems. And after agreeing to operation not surgery related. I was put on a good bit of medication, barley knowing what's wrong with me. Let me tell you after that operation. i haven't seen Dr.Kashyap since, even though i used up a lot of my insurance to get me help. The man makes a trip to California, doesn't even tell me knowing this a current thing that i just got. I call the office and the nurses (Great people) try to help me and get him on the phone. Next it turns out i have a gallbladder check up that i didn't even know about. And i had to find that out the hard way by calling the office to get help because my medicine was rejecting my body. Then not only could the nurse not get ahold of him the man never called me or spoke to me about whats wrong with me. I know how doctor life works. And i am not on here to exploit or ruin anyone. But those who have concern for your health dont go to him. He doesnt really talk to you about anything, hell send you to do test and you wont hear one word from him. Im a patient of his and ive only seen him once. I found out by my fiance and a piece of paper of what is wrong with me. And if hes reading this let him. Because he needs to know some people pay good money for a good doctor and he is not one of them.", "pics": null, "resp": null, "gmap_id": "0x888bb3bc5315384f:0x82de0aff81550117"}
{"user_id": "112131452026059712665", "name": "Paula Gibson", "time": 1611934381384, "rating": 5.0, "text": "After hospital er and staff doctor mental health center were told by both many times take over counter medicine after year dr kashyap diagnosed colon cancer tumor that had grown from dime to basketball size  visible to just looking at me  he not only diagnosed with test but by his keen sense of listening and validating pts concern versus stereotyping and generalizing  he saved my life .", "pics": null, "resp": null, "gmap_id": "0x888bb3bc5315384f:0x82de0aff81550117"}
{"user_id": "106890390879591004809", "name": "Fred Luhn", "time": 1540925523040, "rating": 5.0, "text": "Excellent gastroenterologist. Pleasant staff. Would highly recommend. A+++", "pics": null, "resp": null, "gmap_id": "0x888bb3bc5315384f:0x82de0aff81550117"}
{"user_id": "101267828552523914613", "name": "Caffey Radney", "time": 1556964061639, "rating": 5.0, "text": "Love his personality and care. Would recommend.", "pics": null, "resp": null, "gmap_id": "0x888bb3bc5315384f:0x82de0aff81550117"}
{"user_id": "111367756427160063535", "name": "Jerry Kemp", "time": 1539898863537, "rating": 1.0, "text": "Newer saw doctor, because they wanted to charge 5% extra for copay on CC and I was not going to give it to them because they never mentioned this on scheduling call.. Principle of the thing.. They lost a patient over $2 they would not waive.  Not smart in my opinion, must be money hungry.", "pics": null, "resp": null, "gmap_id": "0x888bb3bc5315384f:0x82de0aff81550117"}
{"user_id": "109991116243964395486", "name": "Loisann Fordham", "time": 1550097713800, "rating": 5.0, "text": "The best doctor in town love him and all his staff", "pics": null, "resp": null, "gmap_id": "0x888bb3bc5315384f:0x82de0aff81550117"}
{"user_id": "106426617878352567132", "name": "Debbie Ball", "time": 1494611233162, "rating": 5.0, "text": "This doctor and staff members are AWESOME THEY TOTALLY GRAND TREAT U LIKE REAL FOLK NOT JuST A PATIENT", "pics": null, "resp": null, "gmap_id": "0x888bb3bc5315384f:0x82de0aff81550117"}
{"user_id": "113124523375196438138", "name": "Pam Roberts", "time": 1485901398567, "rating": 4.0, "text": "Treated symptoms successfully, but didn't look or underlying cause. Nursing staff is outstanding.", "pics": null, "resp": null, "gmap_id": "0x888bb3bc5315384f:0x82de0aff81550117"}
{"user_id": "113294356383455630709", "name": "Heidi Woehler", "time": 1518552237236, "rating": 5.0, "text": "In my opinion the best Dr. in his speciality.", "pics": null, "resp": null, "gmap_id": "0x888bb3bc5315384f:0x82de0aff81550117"}
{"user_id": "111261699045293521293", "name": "Juliana Gaines", "time": 1477941661800, "rating": 5.0, "text": "Took very good care of me!!!", "pics": null, "resp": null, "gmap_id": "0x888bb3bc5315384f:0x82de0aff81550117"}
{"user_id": "109587927115245414117", "name": "Puckett Cruiz", "time": 1500408278878, "rating": 2.0, "text": "Super nerve wrecking area and doc office", "pics": null, "resp": null, "gmap_id": "0x888bb3bc5315384f:0x82de0aff81550117"}
{"user_id": "113226326847954764343", "name": "Karrie Carroll", "time": 1541103427210, "rating": 5.0, "text": "Great doctor !!", "pics": null, "resp": null, "gmap_id": "0x888bb3bc5315384f:0x82de0aff81550117"}
{"user_id": "104350176920811709967", "name": "Jane Ivy", "time": 1627654803224, "rating": 5.0, "text": "Dr Marks was so caring and took time to truly listen to me.  He ended up sending me to the ER for a CT because the OP radiology center was already closed.  This was 100000% the right call because I had a perforated appendix! Im so grateful to Dr Marks!", "pics": null, "resp": {"time": 1627668335467, "text": "Hi Jane! We appreciate your positive review about your recent experience with us! We will share your kind words with Dr. Marks and the team at Gastro Health - Alabaster. Thanks again and have a great day!"}, "gmap_id": "0x888925d05b7c0ba3:0xed51b6c8510b9051"}
{"user_id": "117227093640992741084", "name": "Diane Garrett", "time": 1621043430331, "rating": 5.0, "text": "From check-in all the way through check-out the staff were caring, thoughtful, helpful, and professional.", "pics": null, "resp": {"time": 1622211194588, "text": "Diane, thank you for your kind review. We are happy to pass along your comments to Dr. Marks and the team at Gastro Health - Alabaster."}, "gmap_id": "0x888925d05b7c0ba3:0xed51b6c8510b9051"}
{"user_id": "105414187192853321807", "name": "Hernandez Luisa", "time": 1601392565205, "rating": 5.0, "text": "One of the best doctors I have ever met. He will always be there for you, listen and offer you his full attention. You can be sure, that he will go the extra mile to met your health care needs. I have been with him for many years now! He is what every doctor should be. A great person, too! The staff is wery attentive!", "pics": null, "resp": {"time": 1601471511572, "text": "Hernandez Luisa, we are glad we could help! Thank you for the great review!"}, "gmap_id": "0x888925d05b7c0ba3:0xed51b6c8510b9051"}
{"user_id": "104979538878966824236", "name": "Joseph LaFontaine", "time": 1627682535410, "rating": 5.0, "text": "Excellent office atmosphere and staff!", "pics": null, "resp": null, "gmap_id": "0x888925d05b7c0ba3:0xed51b6c8510b9051"}
{"user_id": "116536074987623388099", "name": "tracyj911", "time": 1611332112538, "rating": 5.0, "text": "Very patient and caring, also very detailed.", "pics": null, "resp": {"time": 1611862745314, "text": "Thank you for your kind review! We are happy to pass along your comments to Dr. Marks and his staff.  We hope you have a wonderful day!"}, "gmap_id": "0x888925d05b7c0ba3:0xed51b6c8510b9051"}
{"user_id": "107963138125716292261", "name": "James Morris", "time": 1519175733267, "rating": 5.0, "text": "I can’t enough great things about Dr. Marks and his staff. Dr. Marks took time to listen and was very helpful. I had a MRI done and when his nurse called me back with the results, she answered any questions I had that she was able to answer. His staff is so helpful, polite, and professional. His Nurse Practictioner is just as awesome. I called my mom, as soon as I was finished with my appointment letting her know how comfortable I was. I highly recommend this office.", "pics": null, "resp": null, "gmap_id": "0x888925d05b7c0ba3:0xed51b6c8510b9051"}
{"user_id": "115290241982764985096", "name": "Erin Russell", "time": 1574017237899, "rating": 5.0, "text": "Best doctor I have Ever had! Love love love Dr Marks!", "pics": null, "resp": null, "gmap_id": "0x888925d05b7c0ba3:0xed51b6c8510b9051"}
{"user_id": "110372064873762463882", "name": "Darrin Jarvis", "time": 1554763318873, "rating": 5.0, "text": "Awesome Doctor and professional service. Great bedside manner and talks on the “average” persons’ level to help you understand the situation.", "pics": null, "resp": null, "gmap_id": "0x888925d05b7c0ba3:0xed51b6c8510b9051"}
{"user_id": "112420523855730156086", "name": "John Pegram", "time": 1628517189442, "rating": 5.0, "text": "N/a", "pics": null, "resp": null, "gmap_id": "0x888925d05b7c0ba3:0xed51b6c8510b9051"}
{"user_id": "101667752661401957350", "name": "Renee Franklin", "time": 1427570802979, "rating": 5.0, "text": "My experience was better than I expected. The staff was great, the wait time was less than 15 minutes, the phlebotomist didn't hurt while doing my blood work and the most important, Dr. Robert D.Marks was great. He listened to my concerns without talking over me and brushing my concerns away. He evaluated me and told me the next steps to take. He and his staff gave me great samples for my issues and it was a wonderful experience. I was very please and would refer anyone to Dr. Robert D. Marks. Choose him if you're wanting a doctor to listen to you without interruptions, that say's alot about his character. I give him and his staff five stars.", "pics": null, "resp": null, "gmap_id": "0x888925d05b7c0ba3:0xed51b6c8510b9051"}
{"user_id": "105640083630806518719", "name": "Tessa Pless", "time": 1473216851624, "rating": 4.0, "text": "In to see him in fifteen minutes.    Staff friendly and thorough.", "pics": null, "resp": null, "gmap_id": "0x888925d05b7c0ba3:0xed51b6c8510b9051"}
{"user_id": "106360169411978802429", "name": "Denise Varnado", "time": 1540197685247, "rating": 5.0, "text": "Great doctor and awesome staff", "pics": null, "resp": null, "gmap_id": "0x888925d05b7c0ba3:0xed51b6c8510b9051"}
{"user_id": "100877137729030182449", "name": "Donna Shanks", "time": 1626395668398, "rating": 5.0, "text": "I love Dr Marks. He is so sweet and caring! Bedside manners like crazy’ He cares very much about his patients. Sometimes it’s hard to get through but I’m patient and wait or keep calling.", "pics": null, "resp": {"time": 1627671166820, "text": "Hi Donna, thank you for taking the time to leave such a kind review.  We are happy to pass along your comments to Dr. Marks and the team at Gastro Health - Grandview. Have a great day!"}, "gmap_id": "0x888917a0bf950e41:0xa236070a1b9b5298"}
{"user_id": "111738235995854795943", "name": "Jane Gray", "time": 1609287547670, "rating": 1.0, "text": "I tried to reach Dr Marks today, his staff hung up on me not one time, but three times! I am a patient from the past, it has been couple years from last time saw him.\nTried to reach him as I am having problems again and need to have endo gasro done again. Though I dread it, wanted him to schedule and do procedure.\nWith being hung up on 3 times, I feel no option but to go elsewhere.\nDr Marks, if you see this, if you care as I think you do about your patients, current and past, please call me!\nJane Gray", "pics": null, "resp": null, "gmap_id": "0x888917a0bf950e41:0xa236070a1b9b5298"}
{"user_id": "106946581304131345783", "name": "Carla Davis", "time": 1589907357266, "rating": 5.0, "text": "I HIGHLY recommended Dr. Marks. He's very knowledgeable. He actually listens and address every issue you are having..I wish he could be my Primary Doctor.. When I had my procedures,  everyone on his staff was the BEST! I love and appreciate you ALL.", "pics": null, "resp": null, "gmap_id": "0x888917a0bf950e41:0xa236070a1b9b5298"}
{"user_id": "102045828472527702080", "name": "Stacey McEwen", "time": 1608158938495, "rating": 1.0, "text": "Spent two hours waiting and still didn’t see the doctor. No explanation. Nothing.", "pics": null, "resp": null, "gmap_id": "0x888917a0bf950e41:0xa236070a1b9b5298"}
{"user_id": "106360169411978802429", "name": "Denise Varnado", "time": 1547485274628, "rating": 5.0, "text": "Awesome doctor", "pics": null, "resp": null, "gmap_id": "0x888917a0bf950e41:0xa236070a1b9b5298"}
{"user_id": "109950423440363772978", "name": "Tyler Hughes", "time": 1595859776213, "rating": 5.0, "text": "I had an endoscopy at Brookwood Medical Center. Dr. Champion treated me like family and made me feel very comfortable. He explained everything very well. I was nervous but he put me at ease and I will go back to him for everything  I need. His staff is wonderful as well. I will recommend him to everyone!", "pics": null, "resp": null, "gmap_id": "0x8889199a08ccf17f:0x93aebeb1388f5840"}
{"user_id": "105594306513070787984", "name": "Joan McCloskey", "time": 1621447571360, "rating": 5.0, "text": "Everything, doing great in all areas.", "pics": null, "resp": {"time": 1622209147418, "text": "Thanks for the 5 stars! We are more than happy to assist you if anything else comes up. Take care!"}, "gmap_id": "0x8889199a08ccf17f:0x93aebeb1388f5840"}
{"user_id": "116401516662615409053", "name": "MV SS", "time": 1572298673903, "rating": 5.0, "text": "Although I have not seen him in some time, I, as well as other members of my family, have been patients of Dr. Champion for many years and he has performed endoscopes and other involved tests and procedures. Dr. Champion has always been a very caring, thorough and knowledgeable physician, and I don't have many doctors that I can speak that well of, and he has rendered excellent care. I have had incidences of very rude and uncaring staff in other medical offices - although NOT with Dr. Champion's staff - and I understand how those circumstances make you feel - but I hate to see someone lose the services of a very excellent physician because of the staff. Maybe bringing the issues to his attention would help.", "pics": null, "resp": null, "gmap_id": "0x8889199a08ccf17f:0x93aebeb1388f5840"}
{"user_id": "115677303266496207303", "name": "StyledBy AMichelle", "time": 1578751503148, "rating": 5.0, "text": "Dr Champion is very knowledgeable and he’s very compassionate!  Thank you for taking great care of me during my procedure.", "pics": null, "resp": null, "gmap_id": "0x8889199a08ccf17f:0x93aebeb1388f5840"}
{"user_id": "111395065684103527223", "name": "Christine Hodges", "time": 1577068040401, "rating": 5.0, "text": "I use to go to this doctor when I was livin in Birmingham Alabama and he was best doctor ever. He was very nice too! I wish I could still have him as a doctor. But I live outta state now with family who actually take a better care of me than family in Birmingham did. But I do miss havin him as doctor.", "pics": null, "resp": null, "gmap_id": "0x8889199a08ccf17f:0x93aebeb1388f5840"}
{"user_id": "118328594665126369681", "name": "Rebecca Ann Jacobs", "time": 1604345936696, "rating": 5.0, "text": "Greg Champion is the best GI Doctor ! Thank you Doctor Champion for the great job you have done! Thank you, Rebecca Ann Jacobs", "pics": null, "resp": {"time": 1605555251772, "text": "Rebecca Ann, thank you for your kind review! We are happy to pass along your comments to Dr. Champion and your care team. Thanks again!"}, "gmap_id": "0x8889199a08ccf17f:0x93aebeb1388f5840"}
{"user_id": "101587488860126378084", "name": "Wendy T", "time": 1570220590595, "rating": 5.0, "text": "Excellent doctor with excellent care and bedside manner. I can not recommend him enough.", "pics": null, "resp": null, "gmap_id": "0x8889199a08ccf17f:0x93aebeb1388f5840"}
{"user_id": "106142190341693711439", "name": "Amanda J", "time": 1516912217525, "rating": 5.0, "text": "I have heard only wonderful things about this physician but today I found out for myself. He is personable, kind, compassionate and highly skilled. These types of physicians are true jewels and Godsends.", "pics": null, "resp": null, "gmap_id": "0x8889199a08ccf17f:0x93aebeb1388f5840"}
{"user_id": "102860773354019270307", "name": "JMacRoe", "time": 1504116846017, "rating": 5.0, "text": "Excellent doctor and very thorough! Wouldn't use anyone else.", "pics": null, "resp": null, "gmap_id": "0x8889199a08ccf17f:0x93aebeb1388f5840"}
{"user_id": "104235940608431383245", "name": "Bear Bizz", "time": 1539877724065, "rating": 1.0, "text": "I will never return after my experience at Dr. Champion's office & especially with his staff.", "pics": null, "resp": null, "gmap_id": "0x8889199a08ccf17f:0x93aebeb1388f5840"}
{"user_id": "107646967417371149580", "name": "Beth Bryant", "time": 1626900715973, "rating": 5.0, "text": "The  Nurses You're awesome And my Dr Sarrels is awesome", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "107054130095029002913", "name": "Mia Meezy", "time": 1625589392159, "rating": 1.0, "text": "Payed 125 cash to see a doctor (only had 1 day to wait before my insurance kicked in. Which was fine that's how much pain I'm in)\nStaff straight lied to me to get me in the door!\nAnyway the doctor was rude, I mean rude as they come. No labs. No nothing. Still waiting for a hidascan, NOTHING! Feel like I need to go to the ER!\nStill vomiting every time I try to eat!\nThese people absolutely do not care! Im shocked with Dothan's health care\nDr. Jeffrey J. Crittenden, MD was uncaring, unprofessional and I quote \"so if your gallbladder is sick, you want it out?!\" Well it probably won't help\"!\nAlso calling during non busy times according to the live feeds that shows how busy the office is and have been calling for over an hour!!!\n6×7=42 (kicks you to VM after 7 mins)", "pics": null, "resp": {"time": 1625590296586, "text": "We are extremely sorry to hear about this and sorry to disappoint a customer/client. Please reach out to us at (334) 836-1052 as I want to hear your concerns and address them in the most suitable way. We look forward to hearing from you."}, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "106276702774166680149", "name": "Abby McNeil", "time": 1624898351965, "rating": 1.0, "text": "Edit - The staff is incredibly hateful and rude other than the ladies in the lab and the nurses (whenever you can get up with them . ) I had labs done 3 weeks ago and I know it takes time to get those back , I get that . But I called today and explained I needed a print out of at least what labs were back to take with me to my endocrinologist at UAB tomorrow - and I know some are back because I got the notification they were back on my MyChart portal I just can’t see the results .  I was talked to like dirt by whoever I was transferred to and told ‘ I’m not releasing those to you until we send you a letter, and I don’t know what print out you’re talking about’ So basically I’ve called and asked for calls back with NO REPLY multiple times ; and they won’t just let me go get a letter from them in person that I really need by tomorrow for my endo that I’ve asked for for 3 weeks ?? Then I sit on the phone for 30 minutes literally each time only to get no answers. I’m most likely going to transfer my business to the gastro doctors in Montgomery , although legally , this place still has to give me my lab results upon request .I have been having sharp stomach pain for the last month and even called and told them I was still having this pain last Friday even on the med they prescribed . Once again , zero response . They truly don’t care about their patients apparently", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "103793164186560954746", "name": "Stephanie Lane", "time": 1620024607838, "rating": 5.0, "text": "I have had stomach complications for over 8 years now. I have been to multiple doctor offices that deal with stomach issues over the years. I've always been told that I'm too young to have problems and I've been overlooked or mistreated by MD's or PA's. I was even told one time in a nice/nasty way that I was making problems up in my head and that nothing was wrong. After I threw a fit because I was in so much pain, she (the PA) decided to do one last test and it concluded that I had SIBO(small intestinal bacteria overgrowth). I was sick with this for 2 years before any doctor even tried doing this test on me. Unfortunately, the only way to find this out is by a breath test. It doesn't show up in blood work, urine, or any other exams or scans. I have since then had other issues and now i am trying this facility out. So far, this place is the best one yet! You dont have a long wait time, the staff are amazing, they get you in and out, they really seem to care about people, and my doctor (Dr. Nelson) is the best! I recommend this place to anyone! Thank You All so much for the amazing work you do. I haven't been coming here long but I'm so glad that I decided to give this place a try!", "pics": null, "resp": {"time": 1620409749788, "text": "Ms. Lane, Thank you so much for your sweet review! We also think Dr. Nelson is one of the best. We will share you sweet words with him and his team."}, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "101378077795312364587", "name": "Lawanda Green", "time": 1620745949559, "rating": 1.0, "text": "MY doctor scheduled me an appointment to see Dr Sorrells.  I've been calling since last week to inquire about my appointment. No one answers the phone on any promp you select. I can only imagine what the service is like.", "pics": null, "resp": {"time": 1620747408116, "text": "I apologize for the delay in scheduling. Will you call my direct line so I can help?\n334-836-1052. Andy"}, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "110213267823709428606", "name": "Bobby McCain", "time": 1615389677603, "rating": 4.0, "text": "They have an excellent, knowledgeable, friendly staff and doctors. Office is easy to find, ample parking, handicapped accessible, rest rooms, the wait is normally short.", "pics": null, "resp": {"time": 1615388346898, "text": "Thank you so much for your review! We are always looking for ways to improve, so if there is anything we could do better, please let us know."}, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "115136933592561235025", "name": "Rickey Hayes", "time": 1624998117113, "rating": 1.0, "text": "My prescription for the prep is not covered by my insurance. The pharmacy has called twice for a substitute with no response. I have been on hold for over 2 hours today with no answer or an option for voice mail. So disappointed with the practice", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "109218504960703382330", "name": "s w", "time": 1621447653145, "rating": 1.0, "text": "Waited for an hour to be called back to examination room, then had to see nurse, then nurse practitioner before seeing the doctor. Total visit lasted two hours.\nNever saw one hand sanitizer station throughout the facility. Front staff exhibited no care to make a visit to this business a positive experience.", "pics": null, "resp": {"time": 1621519168592, "text": "Hi S W, thank you for your review. We are so sorry to hear that you have not had a great experience with us. We would like the opportunity to further discuss your visit with us. We do take all of our reviews seriously and use them to look for ways to improve. If you would like to further discuss your experience, please call our office at 334-836-1212."}, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "102877252224379500530", "name": "Britton Hughes", "time": 1581481534905, "rating": 5.0, "text": "Fantastic group of doctors and nurse practitioners! The front office staff has always been helpful, and the wait times are by far the shortest I’ve ever had to deal with in a doctor’s office. Dr. Lamb in particular has always been helpful, knowledgeable and professional. Highly, highly recommend.", "pics": null, "resp": {"time": 1581514806810, "text": "Thank you for such a wonderful review and such sweet words!"}, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "116451945384474808078", "name": "James Hodges", "time": 1592934346587, "rating": 2.0, "text": "Untruthful billing practice. Customer service is wait and hold. They claim nothing to do with surgery centers but rent facilities.  Did not get this cost until day before procedure. Reviewed billing 2 month before, after doctor appointment. Staff is says the have nothing to do with surgery centers they just rent you a spot. Surgery center then bills you.", "pics": null, "resp": {"time": 1593553358647, "text": "Hi James-- thank you for your review. We are so sorry to hear that you have not had a great experience with us. The hospitals and surgery centers are all separate entities from our practice, and charge their own facility fees.  We do take all of our comments seriously and use them to look for ways to improve. We have shared your concerns with our administration, however if you would like to further discuss your experience, please call our office at 334-836-1212. Thank you!"}, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "116639978811670619741", "name": "Jon Caldwell", "time": 1594239153223, "rating": 5.0, "text": "I go to the Dr. a lot and really honestly don't mind going here.lol.  Everyone has always been so nice to me and treated me well.  I have seen Dr. McLaughlin and Dr. Crittenden in the past with my hospital stays..they were Awesome.  I currently see Dr. Rutland and he has been awesome as well..   The nurse practitioners have also been the best...I've seen 3 Nurse practitioners there and have always had good treatment....i'll update with their names if they would like.  :)", "pics": null, "resp": {"time": 1594302348468, "text": "Thank you for such a wonderful review and such sweet words! We appreciate you!"}, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "105102759268142760967", "name": "Gina Burdeshaw", "time": 1524843061722, "rating": 5.0, "text": "Wonderful wonderful experience with this group of caring doctors and their great staff. From Alicia at the front desk helping us with getting medical records to Dr. Black and his nursing staff, you can't ask for more genuine people who truly care for you and your health. Highly recommend! Thanks for everything.", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "114480307150494595420", "name": "Travis C", "time": 1574332336788, "rating": 2.0, "text": "My nurse Susie is great, always calls back and really tries to help. I think the doctor could care less.  Waited a month to get in, waited about 2 hours then spent 4 hours to different stations and the doctor spoke with me about 5 minutes. Conducted one procedure and waited 3 weeks which i had to call to get the results. Doctor completely gave up after no results on 1 procedure! Iv spent 4 months vomiting everything I eat with an express weight loss of about 40 lbs and he just gives up, I'd say that's pretty f**ked up. A bunch of money for nothing.  Thanks susie for taking care of me.", "pics": null, "resp": {"time": 1574346188333, "text": "Hi Travis, thank you for your review. We are so sorry to hear that you have not had a great experience with us. We take all of our comments seriously and use them to look for ways to improve. We have shared your concerns with our clinical staff. If you would like to further discuss your experience, please call our office at 334-836-1212."}, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "113792068397400276965", "name": "Melanie Hartzog", "time": 1548461128296, "rating": 5.0, "text": "My mom had a precedure done at Dale medical surgery center on January 25,2019  Dr lamb did it.  When he talked to me about what he had done his demeanor was so caring!  I really liked him!  He made me feel at ease and my mama too!  :)", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "104815544588545420245", "name": "Google User", "time": 1451333607690, "rating": 1.0, "text": "I worked for them through a temp company and did my job. It was very simple work. There was much talk about hiring me on to their company from my supervisor from the time I started working. That completely stopped when I told them I was pregnant. I only worked for two or three weeks after that before they contacted my temp agency and stated that the position \"just wasn't working out.\" I could actually schedule all of my OB appointments on Friday afternoons, because we only worked half a day that day. Therefore, my appointments would never be an issue and interfere with work. I had a feeling that my supervisor  would have an issue with my pregnancy. When I told her, she seemed slightly appalled. Usually, a person would have been happy for the person expecting and congratulated her. My supervisor stood clear of me for the next two or three weeks and had my temp agency call to let me go after work one day. My temp agency was quite confused, considering they(my temp agency) awarded me Employee of the Month this time last year and I've always received great reviews from each any every one of employers through my temp agency.", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "114410518737422474804", "name": "Hiram Taylor", "time": 1579665330981, "rating": 5.0, "text": "This clinic and Dr. Tarwater literally saved my wife's life. When I was 31 and living in New Orleans I lost a wife to colon cancer. One of the factors was that the doctors treating her blew off her symptoms, because of her age,  until it was too late. With similar symptoms my current wife Libi visited Dr. Tarwater at Digestive Health. Dr. Tarwater said that even though the probability was extremely small for someone her age (she was 44 at the time) he did not want to take any chances and scheduled her for a colonoscopy. Based on my previous experience, I was all for it, though I thought the chances were probably pretty slim as well that it would be anything serious. To our horror and disbelief. Dr. Tarwater found colon cancer. He was really great about how he broke the news to us, praying with us and giving us a lot of hope. Because of Dr. Tarwater's insistence on doing a through job, we caught it early and it was cured with surgery. She didn't even have to do chemo. I thank God everyday for Dr. Tarwater and the team at Digestive Health and especially God's mercy in guiding us to where we needed to be for her treatment. In another situation,  my mother-in-law had to go to the hospital because of intestinal distress that turned out to be a life-threatening condition. Cody, the nurse practitioner,  who was working at Flowers Hospital at the time, intervened in her care and immediately recognized the seriousness of her condition making sure her treatment was swift, which probably saved her life. So I feel like I owe the lives two people whom I care about very much to the expertise and care at Digestive Health. One other thing. IF YOU ARE 50 OR OVER GET YOUR COLONOSCOPY IT CAN SAVE YOUR LIFE! IF YOU HAVE RECTAL BLEEDING OR OTHER SYMPTOMS, INSIST ON SEEING THE SPECIALIST AT DIGESTIVE HEALTH. For us it made all the difference in the world.", "pics": null, "resp": {"time": 1579701110498, "text": "Thank you for such a wonderful review and such sweet words!"}, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "115159576922526349428", "name": "Evie Granberry", "time": 1584288589640, "rating": 5.0, "text": "The Staff are all so nice and informative! I have always been taken in on time too.", "pics": null, "resp": {"time": 1584362438165, "text": "Thank you for such a wonderful review and such sweet words!"}, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "105862111424601196524", "name": "Christopher Senn", "time": 1522943987963, "rating": 1.0, "text": "I arrived on time and was seen in short order. Had orders for a cat scan with contrast. First I warn the woman who does the iv contrast that my veins are hard and showed her where to start the iv. She ignores my advice, sticks me for 10 minutes. Finally, she moves me out and continues with the rest of her patients. Just because you don't want to deal with my problems, doesn't mean you can ignore my appointment.", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "111724011344102114799", "name": "John Mursch", "time": 1499864368589, "rating": 5.0, "text": "Appointment was scheduled for 1010. Got here 20 minutes early and filled out some paperwork as a first time patient. Waited 30 minutes to be called back, waited 20 more minutes for a nurse practitioner, still waiting a full 1 hour 10 minutes past my appointment time for a consult! I wouldn't voluntarily make an appointment here again and I will be complaining with my insurance provider.\n\nDr. Lamb was in and out in 5 minutes. The doctor was professional and courteous. Ordered  a follow-on procedure and now I am waiting again to schedule it. It's been 1 hour 25 minutes since my scheduled appointment time.\n\nUpgrading to 5 stars. Although the wait time seems ridiculous to me I am used to being seen by military health care providers. I upgraded to 5 stars from 3 because the staff seems to really make an effort to accommodate individual patient circumstances.", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "115871419408619996392", "name": "Amanda Schreffler", "time": 1546692853935, "rating": 5.0, "text": "I cannot express how thankful I am to of found this office. Dr. Lamb took the time and listened closely to everything I said, didn’t just blow me off. They looked into every possible thing they could in helping my diagnosis. The nurse, Judy,  is amazing! Any time I called, my phone call was returned within a couple hours and with answers/something new I could try. If I needed a prescription, it was sent almost immediately after the phone call. The wait time is so minimal and all staff are so sweet. I wish all my drs showed the care they do! When you are in pain and it’s affecting your life majorly, you need someone to want to find your answer and they do everything they can to do so.", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "111941996110804082283", "name": "Cacey Christiansen", "time": 1454607197354, "rating": 5.0, "text": "New patient here.  The nurse that checked me in was EXTREMELY pleasant, very kind and thoughtful.  My CNA was cheerful, very calming... Have you ever gotten a vibe that says \"this is just a good person\"?  That was my CNA.  My other nurse was remarkably gentle and attentive.  Dr Clark finally got around to seeing me after a very short wait and was the picture of professionalism.  He was genuinely interested in my case and didn't push anything and truly had my health and care in mind.  My only complaint is that it took the VA so bloody long to get me to be seen by such an amazing group of medical specialist!", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "115999814543568020963", "name": "Lisa Pierson", "time": 1521130348081, "rating": 2.0, "text": "I have serious digestive issues and I have had no choice but to go to this group for about the  7-8 years since they are the only gastro Drs in the area. I have only seen the doctor maybe 1-2 times. I am always scheduled to see a nurse practitioner. They don't seem to care about you at all. It's clear they are only there to write prescriptions and collect your money. Unless of course they can schedule countless expensive test that they can charge you an arm and a leg for.", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "108700012321345769029", "name": "Lyndal Hicks", "time": 1564959748197, "rating": 5.0, "text": "He's a wonderful Doctor and stays on top of the latest research", "pics": null, "resp": {"time": 1567515327446, "text": "Thank you for a wonderful review!"}, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "110569481156790278198", "name": "Joe Evans", "time": 1530318068133, "rating": 5.0, "text": "For over a year I dealt  with Colitis seeing nurse practitioners, Doctors, I feel like they always always provided me with excellent care, at the office, hospital, ER Doctor on call, great job, Thank You!", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "104604899926185702445", "name": "Laurie Crozier", "time": 1461335741517, "rating": 5.0, "text": "quick and easy!  wait time was minimal!  procedure was done quickly with ease.  Great Staff.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "100476169631257362779", "name": "Michael Garner", "time": 1516914288954, "rating": 1.0, "text": "Went to see Dr.William McLaughlin at Digestive Health Specialist, Got called back to see the Doctor, I Spend 15min.   In the Waiting room and got called back.Then I sat in the Room for 1hr and 15 min. I stepped out and told his assistant I was about to leave if I could not see the Doctor. I was his next patient in line. Dr.McLaughlin came in ask me what the problem was, I had been sitting in here now for 1hr 20 min.is this how you treat your patients, he told me to leave. Very poor Service....", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "103392146882353562603", "name": "Richard Reinhardt", "time": 1524846268065, "rating": 5.0, "text": "Great experience! I was nervous about the procedure I was set to have, but the staff and doctors set my mind at ease and everything went as to plan.", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "115427521648214556597", "name": "PHANTOM RENOVATIONS LLC", "time": 1515127114210, "rating": 1.0, "text": "Always rude they know they are the only GI specialist in Dothan. So being great is not of their concern. Wife moved an apt. Due to our newborn being admitted for Rsv and she asked for her regular medicine to be refilled...NO they said multiple times...she was having a flare up and they couldn't get her in for over a month. No refill unless she has an apt first. That's horrible to make somone sit in pain who just gave birth and now is sitting with their sick child.", "pics": null, "resp": {"time": 1515168419154, "text": "Can you call 334 836-1212 and ask for Kay. Let’s see if w can help."}, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "114717823751326639498", "name": "Mark Porter", "time": 1560302159271, "rating": 4.0, "text": "Friendly, helpful staff, and Dr. Lamb took time to listen to my concerns.He also agreed to try something else to see if it would help my situation.", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "105054979609095092517", "name": "Jana Sledge", "time": 1379083753055, "rating": 5.0, "text": "The nusing staff here is top notch! Very helpful. Great doctors as well.", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "108798947568363959650", "name": "Keith Taylor", "time": 1466015123848, "rating": 5.0, "text": "My wife had some symptoms that are usually associated with minor digestive conditions, but Dr. Tarwater wanted to be through and make sure she was okay. The colonoscopy revealed colon cancer. Because Dr. Tarwater insisted on looking closer, it was caught at stage one. She didn't even have to have chemotherapy. I had already lost a wife to colon cancer when I was thirty-one because her doctors dismissed the exact same symptoms as trivial. If you come to Digestive Health expect to receive the best possible care with doctors who care about their patients and won't stop looking till they find out what is wrong.", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "110109907793899481955", "name": "Joanna Wu", "time": 1546523611869, "rating": 1.0, "text": "Poor service all team ! Terrible experience!!! Take care their customers just like play the game !!!", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "109585023841182872468", "name": "medical professional", "time": 1493242287982, "rating": 1.0, "text": "the insurance department at this office is the worst , they seem to do the very least just to make sure they keep a job. they do not care about the patients or if they get the services they need . I would not recommend them to anyone !", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "110942868057956353066", "name": "Jo Anne Krausz", "time": 1372279299436, "rating": 2.0, "text": "I had a colonoscopy done by Dr. Kapoor. The after care was terrible. I could not get any help with the issue of extreme nausea when called the Dr on call. Also both times I had appts I had to wait over 45 mins. Today I refused to wait and walked out. My procedure was done at the surgery clinic. I was put under at 8:15 and release by 10:15 still feeling very sick. Nurses seemed not to care how I felt.Pretty much told me to get dressed I was released. I was referred by my primary Dr. who I love dearly. I will be discussing this with her. No one should be treated this way. I am sure they are billing my insurance companies for full payment. Would not send my dog there at this point.", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "116321410176662916902", "name": "krystal mcdonald", "time": 1475179399702, "rating": 5.0, "text": "Everyone is so nice. They take their time and really want to help you.", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "102059382774789659317", "name": "Victoria Olsen", "time": 1529350339986, "rating": 1.0, "text": "Was on 6 weeks of antibiotics because of a life threatening infection. Never got rechecked to see if i was over it. Nurses will never call you back even if left a urgent message. Gave me a prescription for a Diabetic medication (not diabetic) and knowing i didnt have insurance expected me to pay that was over $400.", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "105147993013660166333", "name": "Brook Smith", "time": 1510336254341, "rating": 5.0, "text": "Very professional staff and Doctors !!!\nLove this place 😊", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "109512703907740512091", "name": "Susie Mo", "time": 1514570480354, "rating": 1.0, "text": "This office over books so much!\nGot here 30 minutes early for paperwork.\nWaited over two hours!\nChose this place because it has several doctors. But I will be finding a new doctor.", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "107638606625840083480", "name": "Jennifer Henderson", "time": 1532007777464, "rating": 5.0, "text": "Great doctors!", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "111002096892259300192", "name": "Brandi Givens", "time": 1474950719236, "rating": 2.0, "text": "N,o0 go a ..", "pics": null, "resp": null, "gmap_id": "0x8892928199908111:0x275fa30c9779cd8"}
{"user_id": "106506008189482969051", "name": "Samuel Steele", "time": 1627353711923, "rating": 1.0, "text": "I had the worst experience with Dr. Habermacher, I had went to ER with a kidney stone and was told it measured 7mm, was told to follow up with Urologist from your clinic,I saw NP on day of appointment which was very nice,I ask for a scan to be done before so we would know if stone was still there. The morning of surgery, Dr. Habermacher came into room I ask if he was going to do scan to make sure stone was gone, he replied no, it will be gone today one way or another. I had passed very small pieces of stone but definitely not a 7mm in prior week.When I awoke from procedure I was told there was no stone, after getting home I was very sick from procedure and very sore. I went for my follow-up, I told the girl that checked me in that I was upset that he did not do KUB to make sure the stone was gone also, that I am a nurse and have had enough of kidney stone patients to know how to check for kidney stones and I definitely had not passed a 7mm. She said I will tell him, she immediately came back in room and said this is a nurse visit, he wants you to do 24 hr urine and come back in 2 months. I have no intentions of ever using him again, why would you not do a KUB or scan to make sure it's gone before putting someone through this, it sounds like it's all about money to me. WILL NEVER use this Dr again.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "107560826844517747305", "name": "Nathan Herrick", "time": 1611344210315, "rating": 1.0, "text": "Received a referral from my insurance company to this clinic to see a Gastroenterologist and I cannot even schedule an appointment. For the last two months, I have called the only available phone number to make an appointment only to be transferred to the gastroenterology clinic appointment line where I have left several messages with the scheduler because that person was not there. No return calls and the office is closed on Friday.", "pics": null, "resp": {"time": 1614290855284, "text": "Nathan, we would value the opportunity to connect with you further. Our patient care team can be reached at (334) 613-7070 at your convenience. If you would prefer to speak with our Patient Advocate, please call (334) 568-4866."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "118035772244836917308", "name": "Renae Pemberton", "time": 1604533118108, "rating": 1.0, "text": "I would not recommend anyone to Dr. Habermacher. My husband and I received some news that was scary and the doctor was not empathetic towards us. He does not like for his patients to do any scholarly research to help the patient or families to be knowledgeable on their diagnosis. He will get offended if you ask questions in which he feels a patient is second guessing his medical knowledge. He talked down to us and no doctor should ever talk to people in that way. Listen to your gut or in my case the Holy Spirit if something does not sit right with you about someone taking care of your loved one. I pray Dr. Habermacher is a Christian and if not that he will come to know the love of Jesus.", "pics": null, "resp": {"time": 1606179290463, "text": "Renae, we would value the opportunity to connect with you further. Our patient care team can be reached at (334) 613-7070 at your convenience."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "106276702774166680149", "name": "Abby McNeil", "time": 1601472617242, "rating": 5.0, "text": "I’ve been a patient of dr garg for a little over a year and she’s great . Yesterday I came in and I just wanted to call out one of the endocrinology nurses , Jennifer , and tell her how kind and wonderful I thought she was at her job. Jennifer went out of her way to make sure I was comfortable during a really long glucose test I had . Dr garg also takes a whole body approach to your treatment , and it is truly worth my drive from Dothan where all our endos are retiring/booked to come to this clinic .", "pics": null, "resp": {"time": 1601482922083, "text": "Abby, thank you for the kind review. It is our honor to provide excellence in care to the people of Alabama!"}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "111188159416355907851", "name": "Jaime Denise", "time": 1608335886715, "rating": 3.0, "text": "They schedule way too many people at the same time, so the waiting time is HOURS.", "pics": null, "resp": {"time": 1614290484766, "text": "We understand your concerns and know that your time is valuable. Your feedback has been shared with our team and we thank you for your patience in this intricate season of care."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "113464080315346843401", "name": "Tony Boyer", "time": 1545582087126, "rating": 5.0, "text": "At times finding proper care that gives you the feeling your best interest has been top priority can be a challenge in the Montgomery area.  We typically go to Birmingham for peace of mind.  My first visit to UAB Urology clinic was one of the best experiences I've had anywhere.  Professional, engaging, reflective, and not reluctant to challenge the knowledge and awareness of their patients.  Dr. Habermacher understood my level of comprehension to quickly lend understanding to my concerns & how to handle my own personal health going forward.  Without being too long winded, I have to express gratitude for the opening and benefits of this clinic for Montgomery residents & anyone within reasonable distance.  Checks all the boxes both physically and psychologically to assure patients care is their top priority.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "109149654432663969534", "name": "Jeff chappell", "time": 1580739399408, "rating": 1.0, "text": "Apparently negative reviews get taken down quickly?  Dr. Thudi, an endo, has the worst communication skills.  Does not listen, assumes, and is too proud to admit mistakes.  They return calls, but only if you're waiting by the phone.  No voicemails except \"please call us back\" and you never get a live person, so it's voicemail tag over and over and over.  Add that to their \"never on Friday\" rules and you've got a setup for making money with zero customer service, much less patient service.\nAnd DON'T even think of adding a response to this about \"We'd like to talk with you about your experience\".  We spoke, we emailed, and THIS IS my response to your customer care.  Don't act like this is the first you have heard of the problem.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "110810778778295902588", "name": "Evelyn Young", "time": 1529426965919, "rating": 2.0, "text": "I have had zero problems until today. You have one number for the entire clinic. They have several specialists. So it is hard to reach the person you need. I called asking for a specific person and extension. I was asked the person last name .They did not leave a last name. I gave the extension#. I was asked what is the nature of the call. I still did not get the person that left the message. Guess if it's important they will call me back..", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "111193115751902347353", "name": "Tamra Oswalt", "time": 1570210263130, "rating": 1.0, "text": "I'm very disappointed I have been to four doctors in the past month about my foot and my toe I am in excruciating pain mobic is helping and your office closed at noon today because it's Friday well I don't consider an emergency other than I'm excruciating pain and can't walk. So what am I supposed to do?\n\nVery disappointed how the doctor he's never seen me going to know what to do for me", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "114165500896750655586", "name": "Scott Thompson", "time": 1538578909414, "rating": 2.0, "text": "Originally given 1-star: Waited for 6 weeks for an appointment just to have a consult. The Friday before the Monday afternoon appointment I get a call saying Doctor Hablemacker would be out of the office and they had rescheduled me for two weeks later in the morning instead of the original afternoon. They required me to call and confirm to keep the new appointment. No further explanation. No options given for the inconvenience. Attempted to call at 2:30 pm when I got the message, but the office was already closed. Apparently they also don’t work on Friday afternoons...\n\nUPDATE TO POST (10/18): Upgraded to 2-star.The office was able to accomidate a different appointment time since I was going to be out of the country during their first rescheduled time. Initially, they didn't have availability, but were willing to squeeze me in for the short consult given the previous circumstances. I will reconsider again after the appointment/service.", "pics": null, "resp": {"time": 1536593512763, "text": "Mr. Thompson,\nWe are very sorry we did not meet your expectations.  Please do call our office today between 8 AM and 5 PM to find a more convenient time for your appointment."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "105513552415487179721", "name": "Grover Wedgeworth", "time": 1555512481353, "rating": 1.0, "text": "Service sucks, no follow up on lab between visits, .Failed to provide consultation notes and labwork to my wife's primary doc.  Dtaff are curt cna rude", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "100199861040353856532", "name": "DeAndre Scott", "time": 1542033819723, "rating": 5.0, "text": "I have been coming to the UAB Specialty clinic to see Rheumatology. Dr. Gadea and his staff are some of the best medical professionals I have ever come across. Having worked in the medical field for 16 years (21year USAF Vet), I have worked with countless professionals. I can only highly recommend Dr Gadea and his team as their patient care exceeds the standard every visit!", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "109337083997686348338", "name": "Wendy Adams", "time": 1545164083529, "rating": 1.0, "text": "This is a poor excuse for a gastroenterology center. My husband is having issues with abdominal pain and other stomach issues and we were told by Dr. Kahn that if my husband continued to have issues that he should go back to the ER and let them call him and see if he could get in for an emergency colonoscopy. Well he went back to the ER and they ran all kinds of test and just because his blood work came back fine, the ER staff and Dr. Kahn refused to admit him and said that he would have to wait until Feb to have a colonoscopy scheduled.  So the doctor lied to both of us. Needless to say my husband is still in very bad pain. So nothing bad better happen to my husband because of their negligence.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "109629967256740502457", "name": "Andrea Curtis", "time": 1536710565402, "rating": 5.0, "text": "The doctors here are excellent.  I especially like Dr. Nina Jo Hibbard, Endocrinologist,  and Dr. Carlos Gadea, Rheumatologist.  They are knowledgable, patient, and very concerned about the pateient's well-being.    I wouldn't trust my healthcare needs to be handleded anywhere else.   😀", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "105124454187813409107", "name": "Jennifer van Arcken", "time": 1504830525964, "rating": 5.0, "text": "My husband had surgery by Dr. Habermacher and we are very pleased that UAB opened this state of the art clinic in Montgomery and brought such great healthcare professionals to our area. The surgery was a success and the follow up visits at the clinic were accomplished very professionally.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "114492014717223503219", "name": "Bill Flick", "time": 1514917554556, "rating": 5.0, "text": "I have seen Dr. Pazona in Urology and found him to be very competent, professional and pleasant.  The staff were also very efficient and pleasant.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "115584060232493438080", "name": "Tamara Dozier", "time": 1568788922908, "rating": 2.0, "text": "Dr. Mullins was wonderI!!\nI need a new Rheumatologist ...", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "118096554832493583892", "name": "EDDIE SMITH", "time": 1536835072856, "rating": 5.0, "text": "Great doctor took good care of my mother", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "100099316883060209688", "name": "Courtney Wood", "time": 1566641013990, "rating": 5.0, "text": "Visited Dr. Mauldin to have a colonoscopy performed. Excellent bedside manner - discussed results and explained concerns in detail. Would definitely see him again and highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891a71337034f1:0x829e3883dd6b46f9"}
{"user_id": "105120504952298710589", "name": "John Higginbotham", "time": 1539006067970, "rating": 1.0, "text": "My wife went to Dr. Mauldin looking for an answer to her constant pain related to her GI system. We honestly are not looking for any pain medication, rather, we were looking for a long term solution. This doctor profiled my wife and was extremely condescending towards her. Told her that all that pain was “in her head.” Consider yourself warned about this one. This isn’t over for me and him, but please don’t trust this doctor.", "pics": null, "resp": null, "gmap_id": "0x88891a71337034f1:0x829e3883dd6b46f9"}
{"user_id": "110337155551114348056", "name": "Rhiannon Jent", "time": 1493045381618, "rating": 1.0, "text": "In my opinion this doctor is not thorough and has an awfully rude and condescending bedside manner. I would NEVER go back to him.", "pics": null, "resp": null, "gmap_id": "0x88891a71337034f1:0x829e3883dd6b46f9"}
{"user_id": "104918386818312614350", "name": "David Bush", "time": 1620167127460, "rating": 5.0, "text": "This is the most comfortable I have ever felt in a doctor's office. NP Ashley is amazing at truly listening to her patients. She has that gift of being sincere  about your concerns. The rest of the staff are also equally amazing. I highly recommend  this office", "pics": null, "resp": {"time": 1621285733122, "text": "Hi David,\n\nThank you for the feedback. I will be sure to share with Ashley and staff!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108574896933598567814", "name": "Lesli Riley", "time": 1624792500074, "rating": 1.0, "text": "My father had a colonoscopy with Dr. Garrett and developed enterococcus faecium. An infection from unsterilized colonoscopy equipment. He died from this", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "102290688366500562960", "name": "Wendy Coleman", "time": 1612579512321, "rating": 5.0, "text": "I can't say that I have a single complaint.  Maybe,  the colonoscopy prep but that is nothing they can help.  Dr. Anderson is top of the line, hands down.  Jackie Shumate, the nurse practitioner, provides a comprehensive review and you are never rushed through an appointment.  She covers all issues with ideas, suggestions and solutions.  You definitely feel important and as if your health matters to them personally.  I highly recommend this office to anyone looking for a great practice.   They also practice social distancing.", "pics": null, "resp": {"time": 1614876817434, "text": "Ms. Coleman,\nThank you for taking the time to leave a review. Your feedback is important to us. I will be sure to share your comments with the team!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "115385931187461596563", "name": "Shalaya89", "time": 1621278293469, "rating": 4.0, "text": "Hello!\nI can not get anyone to answer the phone or return my call from the voice message I have left several times. It always says you are assisting other patients l, but no one answers at all. Please help.", "pics": null, "resp": {"time": 1621285695689, "text": "Shalaya,\n\nI apologize that we were unable to answer your call today. Our office will return all messages with contact information provided by end of day. If you have not received a call back at this point please give me a call for assistance, I can help. Our office is open from 8am-4pm. 495.2600 ext 1000"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108110824024872007234", "name": "Yulya Plaia", "time": 1600184208605, "rating": 1.0, "text": "Really dissapointed. I have made an appointments with them 2 times and both had to be canceled the last min on their end. I had to have a breath test done and I drove 40 min only to get there and have them tell me that they can't do the test there. I called and confirmed that I still had the appointment with them a week prior to that. The nurse could have called me or emailed me and tell that. But unfortunately I drove all they way to Montgomery and didnt get anything out of it. I understand that its hard with this corona and stuff but they could have thought about their patients.", "pics": null, "resp": {"time": 1600188783052, "text": "Yulya,\n\nThanks for taking the time to express your experience with our office. While we strive to meet the needs of every patient it’s clear we missed the mark here. I would like to discuss this with you in detail if time allows. 334.239.9257\n\nThanks ,\nC. Butler, Practice Administrator"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "107155080747085253882", "name": "Ove", "time": 1598472233899, "rating": 2.0, "text": "Terrible service. I understand the pandemic, but sitting in your car is ridiculous!! It took forever to get an appointment, only to be called and told the nurse was no longer seeing patients in the afternoon!! I was told to go to the East Trailer, yes a trailer, for a  colonoscopy and an egd! I've yet to see a physician to discuss my problem. Now I'm sitting in the car, had an 8:30 appointment, it is now 8:45. If I could get a referral for another Gastroenterologist, I'd be gone. Only problem, I'd have to start all over. Unless you can deal with pain, go somewhere else because I have been dealing with this issue for three months only to be told everything looks good, then why are my labs abnormal?", "pics": null, "resp": {"time": 1598534297822, "text": "Thank you for your feedback.\n\nThe hospital has purchased trailers to help with UABs social distancing policy’s. These are uncharted waters and while we strive to make everyone comfortable during the pandemic, we understand improvements may be necessary. I would like to discuss your concerns further, when time permits.\n\nPlease give me a call 334.495.2600\nThanks,\nMrs. C. Butler"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "104415627891390382991", "name": "Jon Pridgen", "time": 1578785192218, "rating": 5.0, "text": "I've been a patient of Dr. White's for over 15 years and have always been pleased with his care. I recently had a procedure with Dr. Garrett and she is equally compassionate and thorough as Dr. White. Both Jackie and Ashley have been exemplary as well. My parents also use Capital City Gastroenterology and have always received excellent care.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "103177074996337408796", "name": "Rebecca Thomas", "time": 1572991417105, "rating": 5.0, "text": "Great experience. The nurse practitioner was thorough and listened carefully. She did not waste time, but was professional and friendly. She set up good diagnostic tests and offered a variety of samples of medications to try for my health issues.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "111581267487057767417", "name": "Sandra Gibson", "time": 1564600328887, "rating": 5.0, "text": "Dr. White is awesome.  He is so considerate of my feelings.\nNurse Practitioner Ashley does a great job and is so thorough and personable.\n\nCaitlin is the greatest.  She needs extra pay for being my Psychiatrist\n\nOffice staff is very friendly", "pics": null, "resp": {"time": 1564660629111, "text": "Ms. Gibson,\n\nThank you for taking the time to leave a review. Your feedback is important to us. I will be sure to share your comments with the team!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "110791280145560601434", "name": "Jeremy Alphord", "time": 1594670866245, "rating": 1.0, "text": "In November of 2019 I was overcharged $300 but have been unable to get my refund. If this were a past due bill I would have been sent to collections but they can just say it was a billing error and not return the money. Very disappointed with the service at this practice.", "pics": null, "resp": {"time": 1594675120746, "text": "Jeremy,\n\nI’m sorry to hear that you’ve had an issue with our billing dept. However Im available to discuss your concerns. If there is an overpayment a refund will be processed. Please contact me when time allows 334.495.2600 ext 1000.\n\nThanks,\nPractice Admin"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "111230769608364079505", "name": "Alex Trott", "time": 1597249786284, "rating": 5.0, "text": "Phenomenal, caring employees. Went above and beyond to make me comfortable, educate me, and make everything as easy as possible.", "pics": null, "resp": {"time": 1598534388416, "text": "Thank you for your feedback! I will be sure share."}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "107344764878884930291", "name": "sandra joiner", "time": 1568938403712, "rating": 5.0, "text": "I highly recommend Jackie the nurse practitioner. She was so thorough, kind and helpful. She took so much time to help my husband with his health problems. I am very thankful for all that she did for us. All the staff was very courteous and helpful.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "116256042973858312509", "name": "Ann Herman", "time": 1613572971716, "rating": 5.0, "text": "Have always had a pleasant visit", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114073686865546915057", "name": "Kimberly Starke", "time": 1581687400925, "rating": 5.0, "text": "The staff is friendly and comforting.  I usually see Dr. Morrow and she's very easy to talk to for any questions.  I love seeing scripture in the rooms.  I've been using this office since 2017, when I switched from a Jackson Hospital gastroenterologist.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114129096895040573756", "name": "Judy Mills", "time": 1583986166681, "rating": 5.0, "text": "I have been using Dr Penn White for a very long time. He has taken care of my medical needs and he explains what has to be done if anything is wrong. His staff is always nice. Theyi schedule appointments for other Dr's that he recommends that I go. I have seen Ashley several times and she has always been concerned with whatever is bothering me at the time. She wants to resolve the problem. I have always been pleased with Dr White and his staff.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "107529693555877396905", "name": "Janice Jackson", "time": 1576185311738, "rating": 5.0, "text": "Jackie Shumate is the greatest Nurse Practitioner! She's smart and she listens, then she prescribes what you need. I enjoy my visits with her. I'm glad she's Dr. Garrett's assistant.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108341931428737357333", "name": "Frank Rivers", "time": 1592427139223, "rating": 5.0, "text": "Ashley Marrow,NP. is seeing Dr. Penn  White patients apparently, but the procedures are at Babtist East Hospital, by Dr.White......\nVery professional and very busy...\nThey work as a team, that's why I give them the 5 stars.\nThe office staff are top notch......", "pics": null, "resp": {"time": 1598534424007, "text": "Thank you for your feedback! I will share with the group."}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "118402246185868902970", "name": "Brenda Pennington", "time": 1578441439142, "rating": 5.0, "text": "NP Ashley Morrow was very thorough with me.  She was very polite and took the time to list to me.  I was very happy with my visit.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114738683547289436087", "name": "vanessa jones", "time": 1582143223845, "rating": 5.0, "text": "Ashley Morris was wonderful. She took her time explaining things to me. She was very concerned and patient. The staff was very friendly.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "106982969032394223749", "name": "L T", "time": 1553548386190, "rating": 1.0, "text": "I thought I was finally in good hands here. Until I had a test done and I’ve tried calling the office for almost TWO weeks. Not one person has called back with my results or to let me know if my results are in. I even left a message with the office manager and they didn’t call me back. This is the most unprofessional doctors office I’ve ever been to & I finally thought I would get some answers as to what’s going on with my health. The nurse practitioner Amy (forgot her last name) was super sweet and spent time with me listening to me, but whoever answers the phone needs a one on one. Don’t go here if you’re looking for answers. Now I’m going to have to start all over.", "pics": null, "resp": {"time": 1554138485209, "text": "LT,\nMy Name is Mrs. Butler and I am the Practice Administrator. I'm sorry to hear about your experience with our office. We're normally more timely, and I regret that we missed the mark. I would like to discuss this further, please contact me at 334.239.9257."}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "115415076961446903169", "name": "Debra Ashlock", "time": 1582750174486, "rating": 4.0, "text": "I think the service is great, but the office rescheduled my appointment without calling me . As a heathcare worker, (I am a nurse) I understand the need to reschedule, but I have a job also, and would have appreciated a call to make the appointment when I could be off.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "113294538339189464133", "name": "The Gary’s", "time": 1566615453090, "rating": 5.0, "text": "I had a great visit. It was my first time and Jackie made me feel at ease. She was knowledgeable and friendly.", "pics": null, "resp": {"time": 1568060483014, "text": "Thank you for your feedback!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "102916796466317486453", "name": "Beautiful Stranger 125", "time": 1576647731747, "rating": 5.0, "text": "I had the pleasure of being treated by CRNP Jackie Shumate. She was very kind and informative. She answered all my questions and explained everything very thoroughly. The ladies up front and at checkout are so friendly and efficient.\nI am so glad I was referred here.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "106462105444941085073", "name": "Anita Rice", "time": 1570825426073, "rating": 5.0, "text": "Dr Garrett has been with me through all my issues. In my opinion she's the best and I plan on her being my Gastrointestinal Doctor for as long as she will put up with me. She's traveled rough roads, ups and downs, she's a blessing", "pics": null, "resp": {"time": 1571931124838, "text": "Ms. Rice,\n\nThank you for your feedback. I will be sure to share your review with Dr. Garrett.\n\nYour feedback is appreciated!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114053300033888412576", "name": "Harold Schley", "time": 1581469976048, "rating": 5.0, "text": "The Nurse Practitioner Ashley Morrow did a great job explaining my medical situation in a term that I could understand , thanks", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108395517191854857714", "name": "Lula Clemons", "time": 1582665373825, "rating": 5.0, "text": "Dr. Ashley is awesome she really listens an share her concerns is very professional. You are in an out in no time BLESSINGS TO DR. ASHLEY", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108146944456628612282", "name": "Heather Terrell", "time": 1564081577605, "rating": 5.0, "text": "NP Ashley Morrow is amazing. She didn't stop until she figured out what was going on with me. Everyone in the office is pleasant to speak with as well.", "pics": null, "resp": {"time": 1564523262868, "text": "Ms. Terrell,\n\nThank you for taking the time to leave a review. Your feedback is important to us."}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114425878654800969871", "name": "Alice Grayson", "time": 1573087291274, "rating": 5.0, "text": "The staff is phenomenal! I had a 3:00 appointment and was with the doctor on time. I have never been in a more organized and time conscous office. Thank y'all!", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "102984542641239390585", "name": "Donna Prashad", "time": 1582747976496, "rating": 5.0, "text": "Nurse practitioner Ashley is great. Makes you feel like you matter and she cares.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "109307148333935075612", "name": "Michael Hardy", "time": 1568211743237, "rating": 5.0, "text": "Dr Garrett was professional and thorough. I had seen her in the past and had the opportunity to see another gastroenterologist. I chose to wait longer to see Dr Garrett.  Capital City Gastroenterology is the best. 5 🌟.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "104564425414345076456", "name": "Tammy Storms", "time": 1582230204575, "rating": 5.0, "text": "Dr. Echols is a God sent. In November of 2017 she discovered two tumors and that I had colorectal cancer. She then sent me to an amazing surgeon in Birmingham named Dr. Blaine Bishop & he robotically removed them and I've done chemo and I was healed of that but then something else came about and I'm doing chemo again and I know again that I will be healed because my God is awesome!!! Back to the question... Dr. Echols staff and nurses are amazing and I don't know how they do it but they make you feel comfortable and believe me in the area of the body that they desl with that's pretty hard to do.😳", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "102968498440226732513", "name": "Norma Edwards", "time": 1583439656413, "rating": 5.0, "text": "They are awesome and very caring I love ❤️ them all NP Ashley especially", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108045809738138832918", "name": "Shirley Jones", "time": 1578673444514, "rating": 5.0, "text": "Very personable but professional. Always seen in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "105761224844700742889", "name": "Suzy Alabama", "time": 1582838717182, "rating": 5.0, "text": "I saw the Physicians Assistant who was knowledgeable, patient, and kind.  5 stars", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "111242231592357551588", "name": "Vickie Yates Britt", "time": 1579816815382, "rating": 5.0, "text": "All Staff very knowledgeable and helpful. PA listens and discusses situation.  Thankful to be referred to this group.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108470089900554390574", "name": "fran mathis", "time": 1571789953299, "rating": 5.0, "text": "I have used Capitol city Gastrointestinal for years and love them they are so professional and kind", "pics": null, "resp": {"time": 1571931067148, "text": "Ms. Mathis,\n\nThank you for your kind words and feedback regarding your ongoing experience.\n\nIt's appreciated!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "105848234957017260690", "name": "Ron Stanton", "time": 1578600768743, "rating": 5.0, "text": "My second visit to the office was just as impressive as the first visit. The staff was very professional and treated me like a relative, not a faceless customer.", "pics": null, "resp": {"time": 1571931157382, "text": "Mr. Stanton,\n\nThank you for your feedback. Its appreciated!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "111813518574737538701", "name": "Brenda Key", "time": 1576874140192, "rating": 5.0, "text": "The staff at CCG is very professional, friendly, knowledgeable and helpful.  Jackie was my nurse yesterday and she enlightened me on the name of what my condition was actually called.  If I had heard Esophagitis before yesterday, I didn’t recall it.  I was also concerned about the possibility of having a hiatal hernia and she relieved my worries about that as well by telling me that they saw no signs of that when they did the EGD.  So, I left feeling much better about my condition yesterday and have hopes of getting it “fixed” eventually through medication and their care.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "113025795955300296968", "name": "Janyth Grimes", "time": 1574194384548, "rating": 5.0, "text": "I have always been shown grace and dignity in what some including myself would consider a very uncomfortable office! I am very grateful for CRNP Ashley and Dr. Nelson-Garett! Even the front office staff is amazing! Thank you Capital City Gastro!", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114802709301595037497", "name": "A P", "time": 1598432706144, "rating": 1.0, "text": "Who cares what the practitioners are like if the front office staff lacks compassion, is blatantly rude, and unwilling to help with scheduling?", "pics": null, "resp": {"time": 1598453852936, "text": "Amanda,\nThank you for sharing your experience. I would like to discuss your feedback when time permits. It is my hope that we will be able to  learn from this experience and address your concerns. Phone: 334.495.2600 ext 1000\n\nMrs. Butler"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "112560590275116012294", "name": "John Midkiff", "time": 1572612373435, "rating": 5.0, "text": "Dr. Echols and her staff are the absolute best !! I was having some medical issues and needed help ASAP, Dr Echols went above and beyond to get me in for a appointment and had me at the Endoscopy Center within a 24 hour period. Dr. Echols immediately diagnosed my situation and began treatment which lead to almost instant relief. She is very thorough and explains your situation where you can understand what is going on and how it will be treated. Highly Recommend Dr. Heather Echols for your Gastro problems !!!", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108062279936508508623", "name": "Sandra Sevcech", "time": 1582058186260, "rating": 5.0, "text": "Great physician's, Great staff. Highly recommend this place!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "103319104548775669780", "name": "Susan “SuSu” Driver", "time": 1565799744915, "rating": 5.0, "text": "Dr. Penn White and Practitioner, Ashley are knowledgable, caring and address all concerns-\nexcellent experience and group . Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114843277134914602449", "name": "Philip Howland", "time": 1619356117263, "rating": 5.0, "text": "they are the best  dr garrett and ashley are are very professonal and caring", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "117322722997817707010", "name": "Lamar M", "time": 1537979202430, "rating": 5.0, "text": "I had a great experience with this practice! Staff was friendly and helpful. My mom was treated with care and dignity from beginning to end.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "100842011352448030788", "name": "Hubert Staley", "time": 1564618378858, "rating": 5.0, "text": "Every staff member at CCG has been nothing but the best each time I have contacted the facility (either by telephone or office visit).  My latest appointment with Nurse Practitioner Ashley Morrow verifies my wholehearted satisfaction with CCG.  She was very patient, pleasant, and caring in responding to every question and/or concern I expressed.  I would not hesitate to recommend CCG to anyone, because the medical staff (Dr. Anderson and Ms. Morrow) have my complete confidence and respect, and all members of the office staff have always proven most helpful and friendly.", "pics": null, "resp": {"time": 1564660698169, "text": "Mr. Staley\n\nThank you for taking the time to leave a review. Your feedback is important to us. I will share your comments with the team!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "104829701258674252955", "name": "Bo Jinright", "time": 1518096106455, "rating": 2.0, "text": "They never answer the phone. They seem more interested in claims than care. It's taken months to get test results. Weeks to get callbacks. I'm still waiting 3 more months 6 total for an initial visit.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "101959987507111431669", "name": "Joyce Wiles", "time": 1568142905813, "rating": 5.0, "text": "I recently had to have an EGD because of a persistent cough and some difficulty swallowing pills. I had a consultation with CRNP, Jackie Shumate before the test and a couple of follow up visits with her to make sure the meds she prescribed were working for me. She is very knowledgeable and knew just what questions to ask me about my symptoms, but she is also very kind and concerned about my health issue. All the staff have been kind and friendly, as well. I would recommend CCG to anyone and would not hesitate to use them again.", "pics": null, "resp": {"time": 1569361415642, "text": "Ms. Wiles,\n\nThank you for your open and honest feedback. I will be sure to share with the team here at CCG!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "100939570607285973924", "name": "ed mcadory", "time": 1573763617373, "rating": 5.0, "text": "Staff, very good. N.p. Ashley is excellent", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "109369965041051820261", "name": "Jesse Baldwin", "time": 1564773626056, "rating": 5.0, "text": "Everybody was nice and friendly , I was treated well and was concerned about my health.", "pics": null, "resp": {"time": 1565212244509, "text": "Mr. Baldwin,\n\nThank you for taking the time to review your experience. Your feedback is important to us!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "109079628025399990084", "name": "Carleen Viers", "time": 1566759766599, "rating": 5.0, "text": "The staff and doctors are all very professional and caring.", "pics": null, "resp": {"time": 1568060436449, "text": "Ms. Viers,\n\nThank you for your feedback!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "110354973951408520287", "name": "HemiLifee Pnfdee", "time": 1589828418092, "rating": 1.0, "text": "I’ve Been Calling For A Month Now Trying To Get In Contact With Someone To Set An Appointment Ive Been In Pain And Need Some Assist And No One Answers But Y’all Are Opened !!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "103816963460366198650", "name": "Reggie Quimby", "time": 1565209519380, "rating": 5.0, "text": "Staff was very considerate and efficient with my needs and time.", "pics": null, "resp": {"time": 1565211854366, "text": "Mr. Quimby,\n\nThank you for your feedback, its appreciated. I will be sure to share with the team!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "116193245801191227884", "name": "Johnice Danner", "time": 1568753697197, "rating": 5.0, "text": "Great all around! Staff and Especially greatful for Dr. Nelson Garret.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "117119394513229437378", "name": "Richard Pitts", "time": 1566417841382, "rating": 5.0, "text": "Dr Anderson is excellent.  He takes time to talk to me about my health.", "pics": null, "resp": {"time": 1568060508975, "text": "Mr. Pitts,\n\nThank you for your feedback!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114676373312966884585", "name": "Jill Philips", "time": 1572466890529, "rating": 5.0, "text": "Interested, concerned, always learning as well as caring.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114358184294405944148", "name": "Felicia N.", "time": 1445715518800, "rating": 1.0, "text": "Dr. Anderson,\nTreated my grandmother. She had surgery and died.\nHe told me I had a hernia. Went in to surgery for repair and he cut through my bladder. He had to call in a specialist to take care of it. I had permanent staples in my bladder.\n\nHe is not a good doctor when it comes to diagnosis and surgeries.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "111732975694894911889", "name": "Sherilyn Morgan", "time": 1582143193202, "rating": 5.0, "text": "Ashley, CNP, was very thorough, knowledgeable, actually listened, and was understanding", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "109642266753940860318", "name": "Robin Cutter", "time": 1579032975358, "rating": 3.0, "text": "The staff and doctors are very professional and concern about their patients health", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "113680241266183023471", "name": "leona parker", "time": 1466615517494, "rating": 3.0, "text": "Patient reviews kept me safe. I will not make an appointment.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "100974332690757699402", "name": "Jenny Clark", "time": 1477297695292, "rating": 2.0, "text": "Oh boy!  I had a very awful experience with one of the female doctors at this practice.  Personally, if you are considering this place, I would just run like H3LL.  I had symptoms of acid reflux and had an ENT confirm what I thought it was.  I asked to get an endo done just to ensure my throat did not have Barrett's.  They referred me for the procedure and one of the female doctor's performed the endo.  Prior to this I had never met this doctor.  I explained my acid reflux and she said it could be my gallbladder since I had a child 1.5 years prior.  She recommended an ultrasound and hyda scan.  I went in for both and it was found that I did have a gallstone.  The hyda scan was normal.  The gastro doc immediately referred me to a surgeon to have my gallbladder removed.  I was blown away!  I had never had any typical gallbladder attacks or pain.  After doing more research I found out that having your gallbladder removed can actually cause bile reflux due to the constant free flow of bile into your system once the gallbladder is removed and the bile has no where else to go.  This doctor could not even read details of my ultra sound so I had to rely on some random doctor (over the phone) to tell me that yes, I have a rather large stone.  This female gastro doc never made any follow up appointment with me.  I immediately canceled the surgery.  I have since discussed this decision with other doctors (ENT and family doctor) and they agree with my decision.  My one gallstone while big is not currently causing typical symptoms.  There is absolutely no guarantee that removal of my gallbladder will fix the acid reflux.  And, recently, my acid reflux has been manageable with a proper clean (and green) diet. Folks, after doing much research, I am convinced that probably millions of Americans have gallstones.  Why?  Diet, it's that simple.  Our diet is just too high in fat, salt, and sugar amongst other things.  A lot of people have gallstones without even knowing UNLESS they have a gallbladder attack that lands them in the ER (or in my case was found just by chance).  In my opinion, gallbladder pain and recurrent attacks are reasons to remove the gallbladder.  Yes, you can live without your gallbladder but you can also live without your arm.  Your body functions better with both so unless you are having issues, think really hard about whether it's worth losing an organ.  In very rare cases, gallbladder disease in the form of stones can lead to major illnesses like cancer.  However, IF you drastically improve your diet, I do believe you can control your destiny.  Remember, everything begins in the gut!  Obviously, I am not a medical doctor, so these opinions are my own.  My last words of advice: get 2 or 3 opinions and remember that doctors are in the business to make money.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "105540362225171929045", "name": "tfrank thetank", "time": 1423292132305, "rating": 1.0, "text": "Will NEVER go back to \"Dr.\" Anderson. I hardly had an entire 2 minutes to explain to him what was going on before I was all of a sudden waking up in the recovery room. No courtesy to say \"hey, were starting the anesthesia.\" He was interested in the colonoscopy and getting it over and never asked me the first important question. And the symptoms I tried to tell him with details, kept getting muffled out by him talking to other medical personnel in the room. No chance to let him know that I was interested in having an endoscopy as well because my symptoms don't even pertain to my large intestine and possibly not even the end of my small intestine. So now my symptoms are still present and have no follow up appointment with him. Instead, they tell my wife to make me an appointment with a refered family doctor an entire month away. Not to mention my colonoscopy appointment took almost 2 months until they could do it.  Wouldn't have wasted my 500.00 that my insurance wouldn't cover, if I would have known that it wouldn't help me get my foot in the door to the gastro office. So here I am at square one.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "104214811621985404472", "name": "Pamela Morris", "time": 1576026221692, "rating": 5.0, "text": "Everyone was polite.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "112196467884702042438", "name": "Larry Martin", "time": 1582142862671, "rating": 5.0, "text": "Very efficient and cordial.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "104946275623227909296", "name": "James Rogers", "time": 1466170145724, "rating": 1.0, "text": "How does one get these people on the phone to make an appointment? If there are no services up front, what kind of services can I expect the services to be upon arrival?", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108986565010601327447", "name": "Zenobia Blackmon", "time": 1581711916385, "rating": 5.0, "text": "Routine follow up visit that went well.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "112444249737054399194", "name": "Barbara Bryant", "time": 1580505630820, "rating": 5.0, "text": "Ashley was awesome!", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "113782529243657491170", "name": "Suzanne Burns", "time": 1551137804886, "rating": 5.0, "text": "Jackie  has the patients  of an angel.", "pics": null, "resp": {"time": 1554138655647, "text": "Ms. Burns,\n\nThank you for taking the time to leave a review, and mentioning Jackie. You're right, she's always willing to listen and help!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114390054358064623798", "name": "Frank Rivers", "time": 1569357236647, "rating": 3.0, "text": "Have a appointment, and still wait.....\n......\n.....\n.....\n\n.....", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108352678289093854114", "name": "Stephen Churchill", "time": 1623791407655, "rating": 1.0, "text": "Waited 45 minutes to get into an exam room after my appointment time. Then waited for another 30 minutes and counting for the doctor to see me. Do they care about this ? Are they overbooking ? As a patient, if I can call myself one, I feel like they must not care about me. Whenever I get finished here, I now have to deal with rush hour traffic. Going to this office is an all day commitment. This simply makes me sick that I chose this doctor. I could go on. I have plenty of time while I wait for the doctor to see me. My goal for tomorrow is to recover from this stress and try to find a new gastroenterologist.", "pics": null, "resp": null, "gmap_id": "0x88626f7f172518b1:0xd58371f7a7b0356f"}
{"user_id": "102915167157033739694", "name": "Steve", "time": 1603745241871, "rating": 1.0, "text": "I just got a letter saying they would no longer serve as my \"provider\". What a joke. I called last week and voluntarily canceled any and all appointments with this rude organization and the fact that they haven't terminated the receptionist for Dr. MOGLOWSKY named COURTNEY. She is so RUDE and Unprofessional and needs to be doing factory work something that doesn't require interacting with the public. I wouldn't go back to this unprofessional so called Digestive center for all the tea in China. Just read all the reviews on Google, Yahoo, Yelp and Facebook. MOST ARE Negative.  There are other gastrointestinal doctors in the area that know how to treat people. Avoid this one like the PLAGUE.\n0 stars of it were an option.", "pics": null, "resp": null, "gmap_id": "0x88626f7f172518b1:0xd58371f7a7b0356f"}
{"user_id": "102257696490620020019", "name": "Terry Reidselth", "time": 1580507119120, "rating": 3.0, "text": "The staff was nice, but the doctor didn't seem to care, like we were taking up his time.he didn't even want to hear what we had to say...", "pics": null, "resp": null, "gmap_id": "0x88626f7f172518b1:0xd58371f7a7b0356f"}
{"user_id": "102632789693818589057", "name": "Rebecca Mitchell", "time": 1579443057637, "rating": 5.0, "text": "Previously to coming to the Center for Colon & Digestive Disease I had been to 3 different GI's.  The first one did not diagnose my Colitis, which was present, the other two put me on a medication that did not work for me and would not listen when I told them it was not helping.  I made an appointment and saw Dr. Moglowsky.  All he had was information that I gave him and he said he wanted to start over brand new.  I was perfectly happy with that.  He was kind, listened, and explained things in a way that I could understand.  He worked with me to find the best medication and one that my insurance would cover.  I have only been on my medication less than a week, but my symptoms are already subsiding.  To say that I am happy with this clinic would be an understatement!  I believe Dr. Moglowsky may just give me my life back.", "pics": null, "resp": null, "gmap_id": "0x88626f7f172518b1:0xd58371f7a7b0356f"}
{"user_id": "101091079626742073030", "name": "Glolady", "time": 1536153894868, "rating": 5.0, "text": "Saw Dr. Mark and one of the best experiences I've ever had! His talent was beyond all others and gave me the procedure I needed. No problems since.", "pics": null, "resp": null, "gmap_id": "0x88626f7f172518b1:0xd58371f7a7b0356f"}
{"user_id": "114215951520384901862", "name": "Tammy Coonfield", "time": 1561169718434, "rating": 1.0, "text": "WORSE EXPERIENCE! BY FAR! .\nWas referred here by a  very good Dr.\nDr. MAGLOWSKY he was abrupt rude explained NOTHING SPENT 5 minutes SAYING  my General Practitioner  and a very highky reputable Henomoltogist/ Oncologist were wrong! Did not not what they were talking about!! WOW..LEFT SHOCKED and hurt. He was NO to help me. He got up walked out of room and gave a sheet to receptionist do these labs. .why? What for?\nNot good visit HORRIBLE! . NOT will follow up  let you know results NOTHING NOTHING..GONE. DR MARK MOGLOWSKY .YOU HAVE NO I DEA! HOW TO TREAT patients or HUMANS..", "pics": null, "resp": null, "gmap_id": "0x88626f7f172518b1:0xd58371f7a7b0356f"}
{"user_id": "104325024928758926783", "name": "Sam Calhoun", "time": 1487182538180, "rating": 5.0, "text": "I've been a patient of Dr. Pendley's for years.  The staff are always helpful, and get back to me pretty quickly when I'm calling and needing something.  I recommend Dr. Pendley to pretty much everyone who has issues like I do.  So long as they're there, I'll never go elsewhere.", "pics": null, "resp": null, "gmap_id": "0x88626f7f172518b1:0xd58371f7a7b0356f"}
{"user_id": "118047322274847251976", "name": "donda steen", "time": 1502823279239, "rating": 1.0, "text": "They will never call back for any concern you have. Or shall I say, you will wait those 48 hours.  If your pharmacy have a concern for them, it will never get handled.  If they do return the call,  you better sit by the phone because their nurses are REALLY  BUSY and you won't reach them!!!!  I have never seen an unorganized phone system or office as this one.  Dr. Haweri and Dr. Brasco are wonderful doctors,  but their staff is awful.... If you are sick, just go to the hospital because you will get sicker waiting on them.", "pics": null, "resp": null, "gmap_id": "0x88626f7f172518b1:0xd58371f7a7b0356f"}
{"user_id": "104657930681833741721", "name": "DangerousEducation", "time": 1591039024168, "rating": 1.0, "text": "After repeated phone consults it was agreed that after REDOING scans I had already had done, if they were negative, he would perform a procedure called an ERCP. After weeks of preparation, doing everything he wanted me to do so I could get the ERCP my local GI in Gulf Breeze had ordered INITIALLY, the day of the procedure they explain if they both come up negative they aren't going to do the ERCP (I was already in the OR, I don't know why he wouldnt have forged ahead if everything else is negative, a I've been complaining about pain in my abdomen for a year and a half now. His nurse also screwed up and forced me to have to get up at 4:30am to be in Mobile  at 7:00am because she can't handle scheduling. I'm done dealing with him at this point, having all my records transferred to a new, closer GI, because he's clearly not worth driving way out of my way. If he comes up with some sort of game plan that I have some confidence in maybe I'll revise this, but so far all he has done is made me repeat scans I had already had (I guess he had \"better\" versions of each, although if I knew he was going to not perform the 3rd procedure, I never would have wasted my time on him - what they told me on the phone and in person were two different things....he so far has only emptied my pocketbook without actually accomplishing anything in the way of a formal diagnosis. 1/5 stars, unless when I speak to them tomorrow they've come up with a comprehensive plan (but I'm certain they havent done anything, I had to continually nag them to get anything done up to this point.)", "pics": null, "resp": null, "gmap_id": "0x889bb2b277890e1b:0x1131d8b1f1aafd53"}
{"user_id": "101022040300268064446", "name": "susan haws", "time": 1550941391422, "rating": 5.0, "text": "Excellent and thorough surgeon!  He went out of his way to provide excellent information and care!  Wonderful bedside manner, which is a dying art in the medical industry!!", "pics": null, "resp": null, "gmap_id": "0x889bb2b277890e1b:0x1131d8b1f1aafd53"}
{"user_id": "109743689742860394887", "name": "Cydney Bennett", "time": 1510327139253, "rating": 5.0, "text": "Finally got some good medical advice for my gastroparesis thank you so much", "pics": null, "resp": null, "gmap_id": "0x889bb2b277890e1b:0x1131d8b1f1aafd53"}
{"user_id": "103424217941741053856", "name": "Michael Smith", "time": 1616527130502, "rating": 5.0, "text": "Dr Rosen is an excellent doctor. He is very caring and easy to talk to. He is also quite funny. Love him. Would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888bb3c11ae73b93:0x47443b226d6b51a9"}
{"user_id": "104547269617929172569", "name": "BRANDY mATA", "time": 1604609246842, "rating": 5.0, "text": "After going to 2 other doctors that treated me like I was crazy Dr Rosen listened to  me and found me a medicine that finally stopped my problem I was having. I  love his waiting room is usually empty because that means he is not overbooking and he has time to listen to you. I would give him 10 ⭐⭐⭐🌟🌟🌟stars if it would let me", "pics": null, "resp": null, "gmap_id": "0x888bb3c11ae73b93:0x47443b226d6b51a9"}
{"user_id": "108554070215135609212", "name": "Alton Hunkapiller", "time": 1597074072455, "rating": 5.0, "text": "Great Doctor!  He actually  cares.\nAnswers your questions and will tell you as he sees it.  He even comes in waiting room to take you back to exam room.", "pics": null, "resp": null, "gmap_id": "0x888bb3c11ae73b93:0x47443b226d6b51a9"}
{"user_id": "114748291032091821905", "name": "Victor Vette", "time": 1618924130292, "rating": 1.0, "text": "I have called Dr. Rosen's office every working day for 10 days and NO ANSWER, NO RECORDED MESSAGE, NO INDICATION HE IS STILL IN BUSINESS....   What is up with this?  I have a family history of colon cancer and need to schedule a procedure !!", "pics": null, "resp": null, "gmap_id": "0x888bb3c11ae73b93:0x47443b226d6b51a9"}
{"user_id": "101033480785885934084", "name": "Phyllis Wyatt", "time": 1597861668268, "rating": 5.0, "text": "My family loves Dr. Rosen. His staff is awesome to.", "pics": null, "resp": null, "gmap_id": "0x888bb3c11ae73b93:0x47443b226d6b51a9"}
{"user_id": "108336290141880404420", "name": "karma monroe", "time": 1591118867345, "rating": 5.0, "text": "I absolutely LOVE this DR. He listens and asks questions. He genuinely cares about his patients and what is wrong!! I wish I could go to him for EVERYTHING!", "pics": null, "resp": null, "gmap_id": "0x888bb3c11ae73b93:0x47443b226d6b51a9"}
{"user_id": "111656424495465799478", "name": "John Longshore", "time": 1544044902143, "rating": 5.0, "text": "Dr. Rosen provided excellent care with a caring demeanor and no-nonsense answers to questions. His office is clean and well-managed. I highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x888bb3c11ae73b93:0x47443b226d6b51a9"}
{"user_id": "106279723856990222288", "name": "Michael Richards", "time": 1538686587826, "rating": 3.0, "text": "Waiting room always seems empty. And his bedside manner are not the best.", "pics": null, "resp": null, "gmap_id": "0x888bb3c11ae73b93:0x47443b226d6b51a9"}
{"user_id": "104650009512788278186", "name": "Roy Blankenship", "time": 1624163551536, "rating": 1.0, "text": "Absolutely ridiculous! Besides waiting for hours to see a doctor while waiting my wife and I had to listen to the office staff talking about other patients. Very unprofessional. If they are talking that loud about patients personal information whose to say they didn’t do it about me! He may be a good doctor but theirs more to it than just seeing a patient. Very unprofessional! Waited for 3 hours and never even saw the doctor!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "113653919637603419367", "name": "Kelly Brown", "time": 1624143490275, "rating": 1.0, "text": "If you want to wait 3-4 hours to be seen and not even by the Dr himself then go for it! A persons time should be valued as a patient. No regard or respect for the patients in the office. No one likes to be treated like a number instead of a person!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "118076641648839165684", "name": "Louis Winchester", "time": 1624980524773, "rating": 5.0, "text": "on June 21,2021 I Vanessa D.Winchester was seen by Dr. Eloubeidi because I was having really bad stomach pains,and Da. Eloubeidi with busy day took the his time to me,and by the Grace of God he was able to find the problem and prescribe me some medicine as upon this day has me feeling so much better...now I would highly recommend  Dr. Eloubeidi to everyone,because he was truly kind plus so professional and did what his year's of experience would have him do and that is to take great pride in what he does...now Dr. Eloubeidi I thank you again and if they had100 star's wouldn't be enough to rate your work you do in helping peoples on a daily basis!!!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "101477171422491161503", "name": "Malek Karassi", "time": 1624926039977, "rating": 5.0, "text": "I am a practising physician in Birmingham who has so many colleagues that I trust to take care of my GI problem but I know from previous experience that the care that I received before at Regional Medical Center surpassed all my expectations, so I did not hesitate to call and come in\nDr Eloubeidi was awesome\nThe GI team cares so much about their patients and are so professional in their communication with them\nI have and I will continue to recommend Dr Eloubeidi and the endoscopy team for any GI problem that they may encounter", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "114052411162415379418", "name": "Saja Hammoud", "time": 1612291305621, "rating": 5.0, "text": "Dr. Eloubeidi is the absolute best doctor! He really took the time to understand what I was telling him and was very attentive to everything I told him about my symptoms. I highly recommend him and his practice! If 10 stars were an option, I would give him 11. Go see Dr. Eloubeidi!!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "113187792759659292939", "name": "And One", "time": 1618666786538, "rating": 5.0, "text": "I have battled UC flare ups for about eight years now and really haven't gotten any consistent relief until now. What I really want to share about Dr. Eloubeidi that was very important to me was his concern to see me as a patient very quickly! Both the Mayo Clinic and Krklin Clinic at UAB, knowing my symptoms and the severity of my situation, were going to make me wait THREE FULL MONTHS just to get in and get an appointment!! Dr. Eloubeidi and his staff made it possible for me to have a full colonoscopy in THREE DAYS!! Talk about a big time difference!! I will forever be grateful and I am a new patient of Dr. Eloubeidi at this time. I've heard nothing but good things and I'm looking forward to being under his care. He seems to be very motivated to help out in any way that he can. That says enough for me right there!! Thank you Dr. Eloubeidi and staff!!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "104890334155002836324", "name": "Shannon Noel", "time": 1611796160010, "rating": 5.0, "text": "Dr. Eloubeidi is a great doctor, he is kind and patient. He does not rush out of your room, he makes sure you understand what is going on before he leaves. Thank you sir for being who you are!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "114598278541658724151", "name": "tommy martin", "time": 1616191081583, "rating": 5.0, "text": "With over 20 years experience you  can’t go wrong choosing Dr. Eloubedi for your gastroenterologist. He makes time for his patients and provides clear information and answers questions in a way patients understand.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "103219090061996724445", "name": "Shawna Ray", "time": 1606238018968, "rating": 5.0, "text": "Dr Eloubeidi and is staff are always very nice and helpful. They are very good at explaining thing and answering any questions. Dr Eloubeidi always takes the time needed with us and never makes us feel rushed. We highly recommend him and his staff!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "100614731701343330830", "name": "Cody Batey", "time": 1606513069578, "rating": 5.0, "text": "Dr Eloubeidi was amazing in helping diagnose my Grandmothers liver cancer when no one else could. He has been really helpful in correcting my stomach problems I deal with and I am very thankful for him and his wonderful staff. Thanks Dr Eloubeidi!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "108715333464783690975", "name": "Carrie Robison", "time": 1603112856965, "rating": 5.0, "text": "I began using Dr. Eloubeidi shortly after he arrived in Anniston, and I am so glad I found him.  He is an excellent doctor and has listened as I explained concerning symptoms I was having. I have heard several people complain about waiting in the office for longer than they would like, but I don't think they consider that he does procedures at the hospital, and may have a hospital patient the urgently needs care which disrupts his schedule.  I know if I were needing a procedure, I'm glad to know he would take the time to take care of me or my family. I don't mind waiting because I know he's busy helping someone else.  Great doctor, great staff!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "100559779462285669303", "name": "Ouida Hunt", "time": 1603837340203, "rating": 5.0, "text": "Very pleased with Dr Eloubeidi and all his services. Always follows up after a procedure or treatment and has a nurse practitioner Miss Swafford that I also trust very much. Highly recommend !", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "102826381316495714362", "name": "Cassie Callaway", "time": 1602532224146, "rating": 5.0, "text": "I will say that he is an Awesome Doctor!! He was the only one who could actually find out what was wrong with my Mom and he has taken Great Care of Me and my Family!!! I would highly recommend him to anyone!!! We consider him Family and always will!!!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "101467340042816314493", "name": "Dan Mathis", "time": 1603327105276, "rating": 5.0, "text": "Today, Dr Eloubeidi performed his third EUS on me. Again, another excellent experience. His office staff is kind & patient. Jodie is a gem! I appreciate Dr Eloubeidi's professional expertise & trust him with my life.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "111206161021533569354", "name": "Nadine Saxton", "time": 1603029783605, "rating": 5.0, "text": "My child has eosinophilic esophageal esophagitis. They have been being treated at a hospital in Birmingham for 2 years with minimal results. We called Dr. Eloubeidis Office, they got my child in quickly. Did a routine procedure and put my child on the correct medication and within a week my child is feeling much better.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "105312747045178465542", "name": "Bob", "time": 1603475946414, "rating": 5.0, "text": "Dr. Eloubeidi is very knowledgeable, and very good at what he does. I’m thankful that he has been my Doc during these rough times.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "105705154201773363447", "name": "Sharolyn Bennett", "time": 1595431872408, "rating": 5.0, "text": "Dr. Eloubeidi has been treating my son (who has Down Syndrome) for swallowing problems.  He is a wonderful doctor who is willing to go the extra mile for his patients. My son has unique problems with his esophagus, but Dr. Eloubeidi explained the procedures to treat this.  He is a caring and compassionate doctor, and I would highly recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "106858741746726053838", "name": "Lynn Tedder", "time": 1594153251320, "rating": 5.0, "text": "I had a procedure done today with Dr. Eloubeidi.\nWell worth the 3 hour drive to be under his care.\nSometimes you have to go the extra mile for the “best”, and I do consider Dr. Eloubeidi the best!!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "101552406850830829147", "name": "Pamela Thrower", "time": 1594357263853, "rating": 5.0, "text": "Dr. Elhoubedi is an excellent doctor.  He has always listened to my concerns and questions. He's straight forward and takes his time explaining what's going on. He makes sure I understand.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "110436795868161677085", "name": "Amelia Webber", "time": 1596819598466, "rating": 5.0, "text": "I was referred to Dr. Eloubeidi by RMC Wellness. My experience with both Dr. Eloubeidi and his staff were wonderful. I had to have two procedures and was very nervous as this was my first time going under any type of anesthesia... his staff was wonderful and so accomodating and the procedures went extremely well. I would recommend him to anyone in need of a good gastrointerologist.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "111964116952892845964", "name": "Amanda Beaver", "time": 1598987477351, "rating": 5.0, "text": "Dr. Eloubeidi provided excellent care to my father during his hospitalization.  Not only did he take great care of him, he also communicated his status to our family throughout his stay.  This was especially important and kind since we were unable to be with him during his hospitalization due to the coronovirus.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "102139003420916540363", "name": "X 21", "time": 1589982257638, "rating": 5.0, "text": "I had emergency surgery to remove my gallbladder (different Dr.) but 4 stones were lodged in the duct that goes from it to the stomach and he could not remove them.  So the next morning Dr. Eloubeidi did an upper GI to remove them from the stomach side.  Afterwards, he told me it should've taken 15min to get them, but with great difficulty, he worked for over an hour and finally was able to remove them.  If he had not been able to, I was facing a long, painful recovery from a 6\" incision to remove them!  I think many doctors would have given up and not took the time.. he would've gotten paid for the procedure anyway, right?  But he went above and beyond to get the job done, and I am so thankful to him for that!!  To all you whiners who didn't get your appointment on time and had to wait a little longer, just remember, YOU may be facing a bad situation one day.. THEN you'll be glad you had a Dr. like Eloubeidi who cares enough to go the extra mile for you!  Thank You Dr. E!!!!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "103856613475013389750", "name": "Tammy Harvel", "time": 1597165355596, "rating": 5.0, "text": "Dr. Eloubeidi has been my Dr for over 2 years! He has taken very good care of me!! I can’t say enough good things about him! He is an expert who truly cares about his patients. My husband now uses him and I wouldn’t go to another Dr and I would recommend Dr. Eloubeidi to everyone!!!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "116021453258393150451", "name": "Robyn Hobby", "time": 1583723800080, "rating": 5.0, "text": "Dr. Eloubeidi and his staff were so friendly and knowledgeable.\nThey made having a colonoscopy such a good experience. From the minute i arrived at the hospital, each and every person i came in contact with treated me so kind. My husband and i will definitely be going to Dr. Eloubeidi for all that ails us from here on out! 5 stars", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "106763205360830955343", "name": "Charles Merchant", "time": 1594010930786, "rating": 5.0, "text": "I trust Dr. Eloubeidi with my life. He is a man that investigates your health problems and reports the results to you in a down to earth fashion . He finds out what your issues are and is highly aggressive at ending those issues. On the likability scale he is 10 out of 10. He honestly puts you first, every time. I had undiscovered issues that he found which led me to other problems that were discovered and those were addressed by the specialists he trusted in those fields. His quality of individual service has made a difference in my life. I thought I’d go to Birmingham, Atlanta, Memphis or Nashville but I found his credentials and recommendations were that of a world class Gastroenterologist. It was a game changer. He is the best and he is right here in Anniston.  It’s true!  Investigate his recommendations.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "107266591159153775165", "name": "Stacy Givens", "time": 1592586253004, "rating": 5.0, "text": "Dr Eloubeidi is very compassionate and caring. He personally contacted our family with findings from a procedure he preformed on my dad.  My dad thinks the world of him. We highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "114764334943461050744", "name": "John Tedder", "time": 1594078680595, "rating": 5.0, "text": "Dr.Eloubeidi has treated my wife for many years.\nIt came time for my colonoscopy, & I needed to have an EDG also. My wife encouraged me to go to Dr. Eloubeidi, because as she says, \"he is the best\".\nAfter my experience with Dr. Eloubeidi, I agree with her- He is very knowledgeable, kind, & compassionate. I was very impressed with him, & the staff at RMC.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "103099017211425697330", "name": "lisa shores", "time": 1582211466313, "rating": 5.0, "text": "I have not been to visit his office yet, but Dr. Eloubeidi has been seeing and treating my dad for some issues he has been having.  I live 3 hours away and I am not able to be there for each procedure but Dr. Eloubeidi has called me after each procedure and went over everything with me.  He has been extremely thorough and for this I am very appreciative.  It means a lot that he takes the time to call me and keep me informed about what is going on with my dad.  Being out of town is difficult enough but knowing that my dad is in good hands and has a Dr that will take the time to call and keep me up to date means a lot.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "105050340878718878862", "name": "Angel Touchton", "time": 1597351128433, "rating": 4.0, "text": "I’ve been here twice and I do feel like the nurse practitioner listened to me well and really cared and looked up what I can and can not take . I really like it here so far , it’s far out my way to come here , but I have heard great things and I couldn’t find a good gi doctor in my area . Unfortunately I haven’t meet the doctor yet I was so happy to meet him because of what wonderful things people say about him. I hope to meet him in one of my next visit , but the nurse I saw has been great and I have high hopes . Because I have uc and have been miserable for years with constant flaring and pain and being sick constantly nearly 7 years straight unless I’m on steroids .", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "117141447596870948744", "name": "Antonio Allen", "time": 1597157096177, "rating": 5.0, "text": "Dr. Eloubeidi is a great doctor will great staff, i recommend if you need any type of prectures done, try out the Dr E you will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "104098020032989262325", "name": "Curtis Owen", "time": 1601158335210, "rating": 5.0, "text": "I had been suffering for over 10 years and many doctors until I finally went to see dr eloubeidi in one office visit and one procedure I have never felt better .. highly recommend him if your hurting and need answers!!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "115902947400420701205", "name": "Lynn Tedder", "time": 1571938622250, "rating": 5.0, "text": "Dr. Eloubeidi is the most caring, thoughtful, compassionate doctor that I have ever been associated with. He is so smart, & knowledgeable in his field of medicine. Dr. Eloubeidi will do anything within his power to help his patients. He has been my gastroenterologist for many, many years. He was my doctor when he practiced in Birmingham. He is not only concerned about me, he always wants to know how my family is doing, which means so much to me. I live in north Alabama, & drive 3 hours to see Dr. Eloubeidi. Every mile driven is worth it!!\nThumbs up to Dr. Eloubeidi & his staff!!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "101393344547969027005", "name": "Willie Hunt", "time": 1582133597899, "rating": 5.0, "text": "My experience with Dr Eloubeidi was \"excellent\".  He was very professional and friendly.  Bedside manners awesome.  My main concern was receiving expert healthcare.....which was shown.  The procedure was explained step by step from the beginning until the end.  Patient care \"Top-Notch\". Great experience.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "102876923335857611471", "name": "edwin smalley", "time": 1576107606505, "rating": 5.0, "text": "well a little hard to review.\ni wrote a negative review. but then the Dr called me about my dissatisfaction and listened to my complaint and I am ok with that. So turned my negative review to a positive review.\nI was always happy with the medical treatment...zero complaint there.\n\nI would say this... they should do a better job of setting expectation... as in...they should say\n\n\"you have an appointment to follow up with the physician's assistant. if you would like to talk to the physician, that is a different scheduling.\"\n\nand it would be super nice if they would say\n\n\"we are running behind today your appointment is at 10...but...  if you have something else you would like to go do for a couple hours and come back, that would be great.\"\n\nif they had done one of those things i wouldn't have been as angry in the first place. If they had done both of them i would have been quite happy.\n\nI changed my rating from a ticked off 3 to a happy 5 because Dr. Eloubeidi called and listened to my whining himself.  :)", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "104526524258717945340", "name": "Robert Rothell", "time": 1592858570925, "rating": 5.0, "text": "Dr. Eloubeidi is the best. Very kind and very professional. I would recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "108529292741865548062", "name": "John Gerowski", "time": 1579490947633, "rating": 5.0, "text": "Dr. Eloubidi and his entire staff are caring and professional. A doctor who personally phones you to check your well being is clearly head and shoulders above his peers. Thank you Dr. Eloubidi and your entire staff! People have mentioned long wait times. Long wait times are indicative of a professional who is in high demand. Be grateful you are waiting to be treated by the best!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "116646039418920732581", "name": "Amanda", "time": 1566939520358, "rating": 5.0, "text": "Dr. Eloubeidi treated my mother for GI issure. He is great! He has wonderful bedside manor. He is understanding and kind. He answers all your questions. Additional is office staff are sweet and kind. Great GI doctor!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "114970141795718199839", "name": "NickJBNintendoFan", "time": 1609385305025, "rating": 5.0, "text": "Paula and Dr.Eloubeidi are very kind and professional. Dr.Eloubeidi done my colonoscopy and endoscopy and he said I was cancer free and no polyps. Jodi is very nice and helpful she helped me with my bacteria in my stomach and done a teladoc visit over the phone about my prescriptions and stomach virus I had back in February of 2020. Bailey is very nice as well because she got myself a better coating medicine for my stomach.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "106095004582947348722", "name": "Don Jones", "time": 1568820245510, "rating": 5.0, "text": "My wife and I both use Dr. Eloubeidi. He is an excellent physician and his staff is very professional. Would not hesitate to recommend him to anyone. Have been really pleased with how we were treated at his practice.\nDon Jones.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "112261235392072219483", "name": "Kelley Snider", "time": 1574290311360, "rating": 5.0, "text": "I have used Dr. Eloubeidi for several  years a my gastrointestinal doctor. He is an excellent physician and his staff is wonderful. Dr. Eloubeidi is very compassionate and very caring. I would highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "102474780691553959940", "name": "Linda Fullen", "time": 1572366336078, "rating": 5.0, "text": "I have used Dr. Eloubeidi for now four years for my health needs. If your looking for a good doctor he is the right one. You can trust him to do the best for you.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "116808363072147133209", "name": "Anna King", "time": 1581530555717, "rating": 5.0, "text": "What a wonderful experience with such a kind and caring doctor!  It is very refreshing to find a doctor that actually returns calls and truly listens to his patients!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "105700506570878517288", "name": "Erika Schutz", "time": 1551455381025, "rating": 5.0, "text": "If you are looking for a gastroenterologist Dr. Eloubeidi is the up most professional, best and friendly Dr. my husband and I been to. The same goes for his friendly staff. You have to wait awhile to see him, but it’s well worth the wait. Should tell you something if his waiting room is full of patients!!!!! He is GOOD!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "108168152417562891733", "name": "keith Baxter", "time": 1570205099455, "rating": 1.0, "text": "The GI department had me sitting here for 3 1/2 hours waiting for my appointment... who books patients and then has them sit there for 3 1/2 hrs?? I will tell you who... someone double and triple and quadruple booking appointments.. someone that has no respect for the patients time!! Someone who knows they can without repercussions...   because it’s that or do without!!! It is a disgrace and a disservice to the community, patron and should be shamed from doing this!!!  If no one pushes back it will never change.  The office managers should be named and shamed as well for allowing it!!  I’m not going to name but dang well I’m ashamed of these Drs and office managers in Anniston Alabama!!!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "101641060386703166682", "name": "Ken Beverly", "time": 1567992570129, "rating": 5.0, "text": "Dr. Elobeidi is a gifted caring physician. He is my gastrointestinal doctor and my father’s also and we both have trust and respect in him.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "104138958240294434726", "name": "Jamie Roberts", "time": 1513620180314, "rating": 5.0, "text": "Dr. Eloubeidi and his staff are wonderful! The wait in the office can be long but, be patient, he is very busy. It's worth the wait to be his patient. He is very caring and has gone the extra mile for me.  I am so thankful, grateful and blessed to be in his care.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "112169365909970297754", "name": "Robert Betz", "time": 1499694097750, "rating": 5.0, "text": "He put me at ease and explained the procedure. His office staff is a great asset.  His office nurse answered all of my questions in detail and made sure that I understood everything. I highly recommend Dr. E and his staff.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "118092799638248530710", "name": "M A", "time": 1571577669358, "rating": 5.0, "text": "Very skilled doctors, huge waiting list, but worth it ☺️💚", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "100340042974457136099", "name": "Paula Howard", "time": 1564445815024, "rating": 5.0, "text": "Dr. Eloubeidi aka Dr. LOBD (lol) is a very knowledgable gastroenterologist with an excellent bedside manor and impecable skills. Not that he has long wait times, but if you ever find yourself waiting for him please know, HE IS WORTH THE WAIT! Please be patient. He is treating everyone as he will treat you, which is with dignity, love, respect, and patience. He always goes the extra mile and takes his time to make sure things are done correctly. He has always treated me, my family, and friends as his own family.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "104218223911038075663", "name": "Wendy Jones", "time": 1534258182994, "rating": 5.0, "text": "His NP really helped me today. Refilled my prescriptions exceptionally well because she listened to my problems and went by what i told her. She also went above and beyond her call of duty by helping me with my diet. Shes was great.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "113459672051215565655", "name": "Rebecca Armstrong", "time": 1496460782057, "rating": 5.0, "text": "Today was my first visit so I could be evaluated and schedule my first colonoscopy. The staff was as nice as I've ever experienced.  My Dr. was at the hospital due to an emergency which prolonged my visit but I'm thankful to know that he is a caring doctor.  Waiting is part of the game and sometimes we have to wait longer than expected.  Our needs are different which authors his time with each patient.  I'm happy to have found a physician that is happy to be there, listens to me and attends to me with respect.  I'm more than happy with my experience and my new Dr.  If you are waiting a little longer than expected, just remember that the emergency situation could be yours.  All Dr.'s are humans first!!😉", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "110546879548772274109", "name": "Lulu Star", "time": 1569106530026, "rating": 5.0, "text": "Very good doctor. Highly recommend seeing him.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "114550385815227406258", "name": "Laura Clark", "time": 1507606695025, "rating": 5.0, "text": "I have had the pleasure of working with Dr. Eloubeidi and have seen his compassion for his patients. He provides top quality  customer  service to his patients as well as the patient's family members. He is a man of perfection and integrity. I can always count on him to listen to me and my assessment of a patient and he goes over and beyond to give me orders so I can implement appropriate care..  HE also did a procedure on my daughter and personally got with me on the results and contacted the WONDERFUL and amazing  SURGEON  Dr. Kasper for me..  I didn't have to do anything he took care of everything.  What a wonderful gastroenterologist he is.  I highly recommend him to any one.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "117902495336403862176", "name": "Jennifer Simmons", "time": 1493130677272, "rating": 2.0, "text": "Office staff is knowledgeable and polite, but unfortunately they are always apologizing for the doctor.  People generally book a 7:45 appointment because they're trying to get in and out before they have to go to work.  But then the doctor doesn't show up until after 9:00??  Totally disrespectful of my time.  If you know you're not coming in until 9, please make that your first appointment.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "103413318575504333443", "name": "Paula Angle", "time": 1508957645933, "rating": 5.0, "text": "My son was referred to Dr. Eloubeidi from Dr. Beatrice Smith for chronic nausea and vomiting.  This was becoming an every day occurrence.  It was affecting his work as a coach and teacher and the quality of his life.  Dr. Eloubeidi went above and beyond to find the cause of his symptoms.  He was very conscientious and concerned. His staff was very helpful too.  Since then, I ran into someone from Birmingham that knew him when he was there.  She said she would drive to Anniston from Birmingham to see him if she needed a gastroenterologist.  That really shows what a good doctor he is!  I would highly recommend Dr. Eloubeidi to anyone.  We are very luck to have him in this area!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "101281887349706857360", "name": "jeanie floyd", "time": 1495062540536, "rating": 5.0, "text": "My Mother was referred to Dr. Eloubeidi by her regular doctor to be checked out. I took her for her appointment with him, and also to the hospital for her procedure. I was so impressed with Dr. Eloubeidi that my husband and I both started using him. Also 2 of my brothers and my sister in law now use him as well. I can't say enough about Dr. Eloubeidi and his staff.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "114349426633941213761", "name": "CBowman", "time": 1479330141933, "rating": 5.0, "text": "I always read the reviews when deciding on a new doctor and out of all the ones I have seen for me or my family none have ever left such a impression on me for me to bother with a review until now. He is absolutely amazing and his staff is the best I have ever dealt with. He took my son as a special case because no other receptionist from Anniston, Gadsden or Birmingham would even consider or help because of his age (under 16) they all said go to children's hospital which we had been referred to them and had a appointment 3 months away and my child was suffering so bad, when I called Dr. Eloubedi's office the lady that answered the phone was such a blessing after trying to help me find a doctor with no luck she talked to the Dr. personally about my son and he seen him the very next day. He is very through in everything he does and every single staff member has gone above and beyond to help me and my son through all of this. If you need a GI doctor I highly recommend him to help you and his staff is a extra bonus", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "102898959531767025104", "name": "Virginia Heard Frazier", "time": 1510359476482, "rating": 3.0, "text": "I went to Dr Eloubei after visiting three other Dr. I was so glad a co worker told me about him. Today I'm doing so much better and enjoying my life. Thanks Dr.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "114456576982892324817", "name": "Katie Lambert", "time": 1594861365685, "rating": 5.0, "text": "Excellent care given by Dr. Eloubeidi!!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "116336648547211990366", "name": "James King", "time": 1505513852233, "rating": 5.0, "text": "Dr. Eloubeidi is a excellent Doctor!! He will talk with you and help you understand what is wrong with you!!!!\nThe staff is excellent and friendly!!!!\nI would recommend this Doctor to anyone!!!!", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "109492316020211824224", "name": "Susette McDevitt", "time": 1604434534937, "rating": 5.0, "text": "Last Friday\nDr. Eloubeidi preformed my 4th Colonoscopy in addition too my 2nd EUS.\nI completely trust him.\nI am sure that I could never have any other Dr.\nPreform anything as personal other than Dr.Eloubeidi.\nHis professionalism and kindness is like no other.\nHe has been my Dr.for about 7years.\nMy husband also uses him and cured him from Acid reflux and chronic heartburn.\nWe were spending around 100$$ per month for over the counter drugs.\nI can't Thank him enough.\nDr.Eloubeidi is wonderful and simply the best at what he does.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "108981662587770690888", "name": "MeTube com", "time": 1512000867164, "rating": 5.0, "text": "I have seen several Doctors over the years and left still not knowing what my problem was, I personally prefer UAB but Dr Eloubeidi came to Anniston from UAB and found my problem first time, He is a great Dr and Has a Great Nurse Practitioner and staff, Highly Recommended", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "106593795454987848502", "name": "JOSEPHINE AYERS", "time": 1508800237012, "rating": 5.0, "text": "I think I was among the first patients of Dr. ELOUBEIDI when he came to Anniston. I had checked him out extensively and had received assurances from medical staff (including two University Medical School Deans) at both UAB and Duke were outstanding. Since, he has treated my daughter and my husband with utmost care and concern - his manner with patients is exemplary and it is with the greatest confidence that I have recommended Dr. ELOUBEIDI to many others in the area.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "102076593675626631005", "name": "Rose Muncher", "time": 1508375612664, "rating": 5.0, "text": "I was referred to Dr. Eloubedi by a nurse that had recently been his patient . Both my husband and myself had an appointment with him. I was so impressed with the professional staff and  the throughness of going over each medicine I take plus any preexisting health issues. I highly recommend Dr. Eloubedi . He takes the time to listen and get to the root of your health issues.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "105548938417960250825", "name": "Susan Herrick", "time": 1501187763934, "rating": 5.0, "text": "This is by far one  of the best Dr. in Anniston Al he is a very caring and concerned about your problems . He will treat you until he finds the problem and will fix it\n\nThanks for all you do Dr E.\n\nSusan Herrick", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "116986319708758352509", "name": "Jan Williams", "time": 1507910132980, "rating": 5.0, "text": "Fast and thorough.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "100294203165676239619", "name": "Alicia Watson", "time": 1484949699606, "rating": 1.0, "text": "My daughter had a 11:45 app.,we arrived early 11:30...after sitting for 3 hours and not seeing the doctor..i had no choice but, to leave at 2:30 to get my other daughter off the bus...terrible experience  and a waste of time,the nurses did apologize  but at the same time  informed me that there is no other GI in this area....i don't  care I'll  drive to bham,it was ridiculous", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "107425292714420428798", "name": "Donald Ridley", "time": 1461876346433, "rating": 4.0, "text": "I had written a terrible review but the doctor called me personally, from his cell phone, and apologized for my bad experience there on one occasion.  Very professional in my book.", "pics": null, "resp": null, "gmap_id": "0x888bb3c105491087:0x3378b7a160f53fbb"}
{"user_id": "103946918082859258160", "name": "Stephen Foster", "time": 1572453558817, "rating": 5.0, "text": "Dr. Malik is kind, personable, and very knowledgeable.  Had two procedures and he explained everything to me and then my wife while I was in recovery. Recommend him highly!", "pics": null, "resp": null, "gmap_id": "0x88890e766b81ad4f:0x92acade3eb5fee90"}
{"user_id": "106734444003143615621", "name": "Angela Tate", "time": 1592423761994, "rating": 1.0, "text": "The staff is unorganized. They had my name and address wrong. They called me to come in for labs and I did and upon getting there no one knew why I was having it done.", "pics": null, "resp": null, "gmap_id": "0x88890e766b81ad4f:0x92acade3eb5fee90"}
{"user_id": "113773613913469400950", "name": "misty clements", "time": 1561429228927, "rating": 5.0, "text": "I was very impressed with Dr. Malik.  He was very easy to talk to and he made me feel very confident about being able to diagnose my problem.", "pics": null, "resp": null, "gmap_id": "0x88890e766b81ad4f:0x92acade3eb5fee90"}
{"user_id": "111170970725260890077", "name": "T Holloway", "time": 1542727337671, "rating": 5.0, "text": "Dr. Malik is a excellent and caring Doctor! I recommend him to anyone that is having any GI issues.", "pics": null, "resp": null, "gmap_id": "0x88890e766b81ad4f:0x92acade3eb5fee90"}
{"user_id": "113663113958236469411", "name": "Brenda Pate", "time": 1527274617674, "rating": 5.0, "text": "Dr. Malik is an awesome doctor. He is not only excellent at the procedures he does; he cares about me as a patient. He has always treated me with respect and given me the time needed for questions at in-office appointments. I highly recommend Dr. Malik. I have been using him for eighteen years and hope I die before he retires. I don’t  ever want to change to another doctor.", "pics": null, "resp": null, "gmap_id": "0x88890e766b81ad4f:0x92acade3eb5fee90"}
{"user_id": "107318481066952788343", "name": "Lisa Wingo Tolbert", "time": 1486231380431, "rating": 5.0, "text": "I just love Dr. Malik, he seems to truly care and is very determined to find out  why you're having problems.  His staff is very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x88890e766b81ad4f:0x92acade3eb5fee90"}
{"user_id": "109887248379044659728", "name": "Jocelyn L.", "time": 1518547437416, "rating": 5.0, "text": "Great doctor, very caring and thorough.  Definitely helped me tremendously with my medical condition!", "pics": null, "resp": null, "gmap_id": "0x88890e766b81ad4f:0x92acade3eb5fee90"}
{"user_id": "111721825130105558154", "name": "Carla Cleveland", "time": 1487818889920, "rating": 5.0, "text": "Very knowledgeable and caring. A very good Dr. I would recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x88890e766b81ad4f:0x92acade3eb5fee90"}
{"user_id": "116238820200796561427", "name": "Life in Camo Media, LLC", "time": 1619720614851, "rating": 5.0, "text": "We have used Jackson Surgery Center three times in the last two years and every visit was a positive experience. The staff is friendly, the nurses are kind and knowledgeable about every procedure we were there for. The staff kept the family/driver informed the entire time the patient was there. The billing department was very easy to work with. I was able to get someone on the phone every time I called to get an insurance issue resolved. I would highly recommend Jackson Surgery Center to anyone that needs the type service they offer. I would give them 10 stars if it were possible.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPQmD3NONX5lxnTqqGpPpccmzty7UBXatECy-lz=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "114488075300264503910", "name": "Janice Howell", "time": 1623257740459, "rating": 4.0, "text": "I had a great experience with my kind and caring nurses at my pre-surgery and recovery room time. I'd like to thank Cherri, Philanda and Cheryl personally for their great work. They made sure I was comfortable. As for as the surgery, the anesthesiologist and surgeon made sure I was knocked out for the 7 stitches although I didn't choose to be. Doctor was very late so he didn't want to waste any time. Maybe it was for the best but it was definitely not my choice.", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "117375952924911138946", "name": "Russell Marks", "time": 1614872568983, "rating": 1.0, "text": "I was schedule for a colonoscopy on Mar 4th.  I was notified that I had to report to Surgery Center for Covid 19 test prior to having the procedure.  I called the doctor's office to see if I could have it done in Prattville area as I lived North of Prattville and was told to call Jackson Surgery Center, I did and they said that would be fine.  So I got the test and a letter saying  I had a negative result.  Then next day I get a call from JSC saying what I had was not good enough.  I was asked why I didn't get tested at JSC and explained that it was more convient to have it locally.  She stated that she lived south of Montgomery and came to work every day.  This really upset me!  Long story short I had already spent a whole afternoon getting tested and by the time she called had already begun the prep and had to cancel the procedure.  They need to get better people friendly personal    to contact patients and get there act together as far as what is acceptable covid testing.  I had this procedure at the JSC (prior to Covid) and it was a great experience just glad I didn't have contact with this person back then.", "pics": null, "resp": {"time": 1614949554575, "text": "Mr. Marks, thank you for bringing this issue to our attention. We apologize for any confusion.  We will address this issue with our staff, the response you received certainly isn't our expectation. For future reference we have Important Covid Information on our website. You can find it here to review our policies.\n\nhttps://www.jscal.com/blog/covid-19-information/\nIf you have further issues or questions please contact our director Missy Sallas 334-293-8484"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "100150209495080402340", "name": "Lisa Hudspeth", "time": 1601996170033, "rating": 1.0, "text": "Better check to see what you owe or they will not do the operation.  They never told me the countless times I’ve spoken with them.  They were extremely hateful.  I asked what I needed and they said insurance card and license.  I drove 4.5 hours and they were going to cancel on me!", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "106860308004527833404", "name": "Vernon Hunter", "time": 1550070817024, "rating": 5.0, "text": "We had a wonderful experience here. Very welcoming and professional. The ladies at the front desk were very nice and helpful.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMEA6SuVnqtgNXXnNkzREdg32B0zgufuc5cv_E=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO4uB51fxyaeDpO2yDu2wNTSxPqh2O8yHqB2fs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMKelv6hT0qb05rGgjtyF822D8UYa0I-uSI8Co=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMzww9DxQJkCwnUedUgw9PJeezxKmFfHtLDnDk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipObPWGFUVK4hTVE8lS2E-RgkyerbdsOR4Hh2tw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNXQS8EPgYZFbDmxHO9f_bBDZmc1UFM-44zLdY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMJqrimS9z6XE50WzCh_gGS9Fn5EyK0YrWWMCI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNjU73BEntArb0ed9LGb1NqqNaIqXlaFJzlV5g=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNpw9Gg51OKBGQDnwp4D3vjqdxV92b8CKCXQvY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPZwGldC5pb6lfTxx5riGecXESwGA5LbK89DLY=w150-h150-k-no-p"]}], "resp": {"time": 1550078887420, "text": "Thank you so much for the positive feedback.  Our team will be really happy to hear you noticed.   Thank you!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "113385512553342126004", "name": "Rosilind Maxwell", "time": 1571770585377, "rating": 5.0, "text": "I just wanted to tell everyone how much I appreciated you all for being so gracious and concerned about the experience that I had with you all on October 21st. You made an unnerving and uncomfortable situation pleasant and endearing.  Thank you from the bottom of my heart. God bless each and everyone that works in that entire building.", "pics": null, "resp": {"time": 1571774286418, "text": "We thank you and are very happy to have had a positive impact on your experience.  Thank you for your kind words we will share this with our team.  With sincere appreciation. Take Care!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "103227802844892782214", "name": "Jason York", "time": 1574466873995, "rating": 1.0, "text": "We were surprised by having to pay a second co-pay, one for the facility for the doctor. It was explained that this is because the doctor is not affiliated and it is an out patient surgery. However, the doctor's name is listed as part owner, not to mention the fact that we have had out patient surgeries in the past and not had separate co-pays. We will not be using this facility again, as it appears to be using any way possible to take money. We could have refused, but we already had the time scheduled off work, and it's hard to rearrange a surgery. At the very least, they could have let us know this in advance, instead of at the time of the surgery. We will be using the Baptist hospital system from now on.\n\nUpdate: No, it wasn't really addressed, we were just told that we would have to pay again or reschedule. It's not about the money, it's about letting us know in advance that there are two separate co-pays, which was not done.", "pics": null, "resp": {"time": 1574442580320, "text": "Hi Jason, we apologize for any miscommunication. Our administrative team is aware of the concern and has addressed this with the patient.  If you need future assistance or have further questions about our billing policies, please contact our Administrator Mr. John Gray 334-293-8484"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "103860438254680297210", "name": "Barbara Sowell", "time": 1580652862613, "rating": 5.0, "text": "Great experience! Wonderful staff. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "101193850016028689346", "name": "leo zemke", "time": 1539124545151, "rating": 1.0, "text": "I am glad everyone else had such a fantastic experience at this place but they almost let my step son DIE!  He came in and was scheduled for exploratory surgery to fix SHODDY WORK DONE BY DR CHANDLER during a sinus polyp surgery and my step son began to pour blood from his Sphenopalatine Artery and the office was more worried about getting another three hundred dollar copay out of us than helping my son.  My wife had to scream for help in the office to get nurses and a doctor to get my son and help him.  We were treated shabbily during the whole ordeal.  My step son was bleeding to death and they did not even have the ability to  give him blood at this facility.  They almost killed him!  IT WAS HORRIBLE!  A HORRIBLE ORDEAL!!!!  I should post photos of all the blood.  The clinic manager was not friendly, everyone acted as if they did not know what was going on or what to do.  They had to take my son by ambulance over the the hospital and then the nightmare continued.  The ER doctor threw my son out of the hospital room that he was scheduled to be in.  It was like they tried to kill my son and then they were trying to sweep us under the carpet or out the door.  TO HIDE US AND THE HORRIBLE THINGS THEY DID AND THE WAY THEY ALMOST KILLED MY SON!!!   It was a nightmare!  They were going to give my son a blood transfusion in the ER and sweep us out the door.  MY WIFE HAD TO ENLIST THE HELP OF THE AMBULANCE DRIVERS Who could see that our son was in agony and practically DEAD AT THEIR HANDS!  The ambulance drivers GOD BLESS THEM talked the angry, crazy doctor into keeping our son and putting us in a room for the night.  This was the worst thing that has ever happened to our family.  I would not allow this clinic to operate on a PET COCKROACH if I had one!  PLEASE BEWARE!!!", "pics": null, "resp": {"time": 1539276470948, "text": "Dear Leo, we sincerely apologize for your experience with the Jackson Surgery Center.  We strive to provide the highest level of care equally to all of our patients.  We appreciate your feedback and are addressing the issues mentioned with our administrative team.  We promise to also forward your concerns to the Jackson Hospital Administration.  Our commitment to protecting patient privacy disallows us to discuss this in an open forum.  Please do not hesitate to contact our administrator John Gray at 334-293-8484"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "112297912146866970493", "name": "Whitney Boutwell", "time": 1555592531295, "rating": 4.0, "text": "Very organized...very clean", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOXOLIBacBgsHxJG5iQ1wSlUfQoJG7vzmpR9JTM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOlpBS1BQZG6WSGqYqPA5y9JvzmNyonq_4GAx8J=w150-h150-k-no-p"]}], "resp": {"time": 1555676575347, "text": "Thank you Whitney!  We appreciate your observations and are happy to provide healthcare services to you and your loved ones.  I’ll share your comments with our team. Happy Friday!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "106585088584921164573", "name": "Carol Roberts", "time": 1533780088492, "rating": 5.0, "text": "My husband and I have both been here for minor outpatient procedures. We could not be more impressed with this facility and can enthusiastically recommend it to anyone needing surgery. We both had excellent care while we were there. The nurse even gave me novacaine before placing an IV in my hand (totally unnecessary, but I appreciate the thoughtfulness). I had some questions about anesthesia, and they actually brought the anesthesiologist to me to answer my concerns. After care and instructions were good.", "pics": null, "resp": {"time": 1533781108127, "text": "Carol we so appreciate your observations.   Thank you for noticing the “little” things we do to make your outpatient experience favorable.  Speedy recovery!  We will check on you soon!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "108378131542001498396", "name": "Michelle Swofford", "time": 1515160287657, "rating": 5.0, "text": "They took excellent care of my daughter and staff was super friendly.   She had an excellent nurse in recovery.   Everything is very organized from registration to discharge.", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "116107001445522782197", "name": "Keri Chaney", "time": 1536781345836, "rating": 5.0, "text": "This was my first procedure done here. Wonderful staff, very professional. Pleasant experience.", "pics": null, "resp": {"time": 1536783535671, "text": "Thank you!  We appreciate your kind words and will share with our staff.  Have a super recovery!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "113375147722597424669", "name": "Vincent Seabrook", "time": 1523394870461, "rating": 5.0, "text": "First class service.  5 star rating.", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "118051830061796961119", "name": "William Wheat", "time": 1533699862201, "rating": 5.0, "text": "Very nice service and friendly staff", "pics": null, "resp": {"time": 1533728675636, "text": "Thank you William.  I will share your kind remarks with our team."}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "110323557142167967312", "name": "Terri Key", "time": 1621341593947, "rating": 5.0, "text": "Treating me as if I am the only patient there. I never feel rushed through & everyone is so sweet. It just makes going to the doctor appointment so much easier. You have an amazing group of people working for you.", "pics": null, "resp": {"time": 1622209720298, "text": "Hi Terri! Thank you so much for your praise and kind comments about our team. Please let us know if we may be of further assistance. Have a wonderful day!"}, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
{"user_id": "100911723360810289469", "name": "Bobby Goodwin", "time": 1622655253027, "rating": 5.0, "text": "Gastro healthstaff makes The process simple. I was took back exactly at my appointment time. I was in and out in 40 mins. Doctor did an excellent job.", "pics": null, "resp": {"time": 1622728676664, "text": "Hi Bobby! Thank you for your kind words and this wonderful review!"}, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
{"user_id": "102074898681109229171", "name": "Cindi Johnston", "time": 1621044603151, "rating": 5.0, "text": "The CRNP that I saw was very very informative and listened to everything I said. Was very very pleased with Jonathan. The triage nurse was very friendly. And the check in & check out staff was very nice !!! I’m very very pleased with your office and staff.", "pics": null, "resp": {"time": 1622211661975, "text": "Cindi, we're happy you found our staff to be so supportive during your experience here at Gastro Health. Thanks for sharing this great review. Let us know if we can do anything else for you. Have a great day!"}, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
{"user_id": "101336265446945812605", "name": "Mary Hanby", "time": 1622003656656, "rating": 5.0, "text": "No long waiting to be seen. Good communication with all staff and they are friendly. Good reminders of appointments.", "pics": null, "resp": {"time": 1622208157166, "text": "Hi Mary! Thank you so much for your positive comments about Gastro Health :)"}, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
{"user_id": "110572339819375960101", "name": "Janice Shelton", "time": 1623264773526, "rating": 5.0, "text": "Everything! Everyone is effective, efficient, timely, knowledgeable, and friendly. I love this practice.", "pics": null, "resp": null, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
{"user_id": "101654817101603946054", "name": "Bonnie Marie Hosey", "time": 1620931504497, "rating": 5.0, "text": "Danielle and Dr. Gresham \"listen\" to me and\nthey throughly checked my illness ...\nthey have given me back my hope for a healthy life", "pics": null, "resp": {"time": 1622212770251, "text": "Hi Bonnie Marie, thank you so much for your positive comments about Dr. Gresham and Danielle.  Please don't hesitate to contact us if we can do anything else for you. Have a wonderful day!"}, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
{"user_id": "103656396919140354650", "name": "Ken Chaney", "time": 1615227670907, "rating": 5.0, "text": "Taking care of patients promptly and seeing to it that all needs are addressed.", "pics": null, "resp": {"time": 1615301211320, "text": "Your wonderful feedback and rating mean a lot to us.  Thanks for taking the time to leave a review.  Please let us know if there is anything else we can do for you."}, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
{"user_id": "114130391193539765308", "name": "Cassandra Moore", "time": 1622052534305, "rating": 5.0, "text": "Dr Shaffer nurse Ashley calls you back quick when you hav a problem which is what I really like", "pics": null, "resp": {"time": 1622208390907, "text": "Thank you for taking the time to let us know how we did. We hope you have a great day!"}, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
{"user_id": "105517555059423134735", "name": "Jennifer Mills", "time": 1616447523465, "rating": 1.0, "text": "I have had my appointment changed without acknowledgement of it. I got there way before my appointment & was told they have been trying to reach me to cancel my time.  BS.", "pics": null, "resp": null, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
{"user_id": "107757504241432340460", "name": "Austin Barton", "time": 1610220266814, "rating": 1.0, "text": "Awful quite a few of the staff were disrespectful laughed at me for not going with a more expensive procedure took a week to get results of a ultra sound I was told would only take 24hrs then I find out I was diagnosed with something four months later from a different care facility that request notes from here also took weeks to call in prescriptions", "pics": null, "resp": null, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
{"user_id": "113782920566986337155", "name": "Thelma Kennedy", "time": 1621304269832, "rating": 5.0, "text": "the service within itself", "pics": null, "resp": {"time": 1622210529235, "text": "Thanks for taking the time to give us 5 stars!  Have a great day!"}, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
{"user_id": "104289510515042839622", "name": "Martha Smith", "time": 1584453089162, "rating": 5.0, "text": "Very sweet place Dr mcvay she is a caring doctor she is sweet and she is the best", "pics": null, "resp": null, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
{"user_id": "103977163955525587481", "name": "Teresa Dailey", "time": 1534794358039, "rating": 1.0, "text": "While the Dr is knowledgeable, she is terrible with reporting back on blood work she had me do. I have a call in and they will call me back😡 It has been 2 weeks and I have heard nothing. I am not happy. I found out I had polyps that we're precancerous and never received a call, just a letter in the mail, telling me about it. I am not convinced they have the patients best interest in mind!!! They only want my money!!!", "pics": null, "resp": null, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
{"user_id": "115926041074182068177", "name": "Taylor Oliver", "time": 1501284674408, "rating": 5.0, "text": "These docs are wonderful. They take time and listen. Staff is great and wait times short.", "pics": null, "resp": null, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
{"user_id": "100804407097119882923", "name": "Mike Curtis", "time": 1535425372378, "rating": 5.0, "text": "I use Dr Alison Bridges . She is very good and helpful . I will recommend to people that I know.", "pics": null, "resp": null, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
{"user_id": "117811987557419918467", "name": "Jeff Langner", "time": 1481076741392, "rating": 5.0, "text": "Love Dr. Mohit Mehra", "pics": null, "resp": null, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
{"user_id": "112566534732396798661", "name": "William TheBeardedWhiskeyRomeo", "time": 1622051422135, "rating": 5.0, "text": "Everything !!!", "pics": null, "resp": {"time": 1622726357510, "text": "Thank you for the 5 star review! Please let us know if we can be of further assistance. Have a great day!"}, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
{"user_id": "109872709646112614005", "name": "Taylor Hawk (unablemind)", "time": 1572539147914, "rating": 1.0, "text": "Rude", "pics": null, "resp": null, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
{"user_id": "113185449919500699591", "name": "Coleman Langford", "time": 1503598325974, "rating": 5.0, "text": "Very professional and caring. Top notch.", "pics": null, "resp": null, "gmap_id": "0x88890e766b81ad4f:0x2c932102c84139a6"}
