{"user_id": "118162148206786564250", "name": "Vanessa", "time": 1501853334660, "rating": 5.0, "text": "Hands down best service in town. Angela and Madi were very helpful and the quality and prices were outstanding. Don't buy your jewelry anywhere else!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOkzwY4rVWSm0080g-RkMZZEeYw89W91PTq4ylK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNi-SvAW7gYWzJJ9GLUlDecMCWVpop2TVQ085-M=w150-h150-k-no-p"]}], "resp": {"time": 1502309477459, "text": "We truly appreciate the support Vanessa! Thank you for the wonderful review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "112823087288819051064", "name": "JandA Whitmer", "time": 1618610544918, "rating": 5.0, "text": "Took my great grandmother's ring in because it had a crack in part of the band. I wanted to be able to wear it and they fixed it so beautifully. My wedding ring also received the royal treatment and looks just like the day my husband gave it to me. You won't regret choosing Goldstein's for your jeweler!", "pics": null, "resp": {"time": 1618611340889, "text": "Thank you for the Great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "104027539000052658591", "name": "Jeannie Churchwell", "time": 1619648700168, "rating": 5.0, "text": "Friendly and wonderful service. Andrew was helpful, kind, and knowledgeable. It was a wonderful experience thanks to Andrew's help. I will recommend Andrew and your staff to others. The ring is beautiful and me and my husband love it.", "pics": null, "resp": {"time": 1619704213307, "text": "Thank you for the Great review!!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "104218536238762040810", "name": "Kirk Becker", "time": 1616117814534, "rating": 5.0, "text": "I've only used Goldstein's twice and I must say I'm super impressed! Very professional, courteous, and knowledgeable jewelers. Don was a great help with my recent jewelry purchase, finding exactly what I wanted and needed with my budget in mind and didn't try to oversell or belittle my purchase. This is the exact kind of customer service people long for nowadays but rarely find. Keep up the excellent work Goldstein's, you've got a customer for a long time with me! Thanks.", "pics": null, "resp": {"time": 1616165517988, "text": "Thanks so much, Kirk!  It was our pleasure."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "113908879876843447339", "name": "Robby Smith", "time": 1624412994454, "rating": 5.0, "text": "Helpful, energetic staff. Easy to work with. Large offering with great quality.", "pics": null, "resp": {"time": 1624462260869, "text": "Thank you for the Great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "102926175413285631241", "name": "Mae Naylor", "time": 1614283923791, "rating": 5.0, "text": "See Don and Angela, they are 100% lovely and professional. I have been going to Goldstein's for 18 years. I have bought amazing pieces and have had a number of repairs and re-plating (rhodium on white gold) done as well as one memorable occasion when I had a ring absolutely stuck on my finger. I have ALWAYS HAD a great experience and HIGHLY RECOMMEND Goldstein's for any jewelry questions or needs you may have. Five stars", "pics": null, "resp": {"time": 1614284755083, "text": "Thanks Mae for the great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "103907949260942564206", "name": "Melanie Craft", "time": 1623845771564, "rating": 5.0, "text": "Goldstein’s is the only jeweler I trust! They make me feel so comfortable every time I come in. They can repair your precious items in-house since there is a master craftsman on site, so you never risk losing something by having it sent off. I will never use anyone else.", "pics": null, "resp": {"time": 1623855577271, "text": "Thank you Mrs. Craft for your wonderful review. We hope you are enjoying your beautiful necklace!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "103603006229374719505", "name": "Lisa Beasley", "time": 1622227570553, "rating": 5.0, "text": "I wouldn't shop anywhere else for jewelry, watches, and heartfelt gifts.  Everyone there is knowledgeable, friendly, and very helpful.  Mr. Frank has a wonderful group of people working for Goldstein's Jewelers.", "pics": null, "resp": {"time": 1622228340949, "text": "Thank you so much for the wonderful review Mrs. Beasley. Have a great weekend!!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "107013047497567004556", "name": "David Barquist", "time": 1615588755850, "rating": 5.0, "text": "They were beyond helpful and friendly. Helped me search and find exactly what I was looking for. Great wrapping and beautiful packaging. 10/10 stars, I'll definitely be getting all my future jewelry from here from now on!", "pics": null, "resp": {"time": 1615589426122, "text": "Thank you for the great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "105095092516761811285", "name": "Kendall", "time": 1620953301624, "rating": 5.0, "text": "Excellent experience with everyone! Thank you especially to Andrew for helping me design several beautiful pieces of custom jewelry!", "pics": null, "resp": {"time": 1621003866892, "text": "Thank you for the Great review!!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "116359782622149153839", "name": "Mary Clare Lovorn", "time": 1608761351431, "rating": 5.0, "text": "Outstanding service today. Angela (#2) made an excellent suggestion for a gift I was looking for. She even asked if I would like one for myself and I said YES!  Grateful and appreciative of the time she spent with me. Merry Christmas and 2021 Blessings to the entire Goldstein's staff!", "pics": null, "resp": {"time": 1609105922297, "text": "Thank you, Mary Clare.  I heard Angela talking about how much she enjoyed helping you.  Merry Christmas!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "104302356747685652320", "name": "Jeanette Nowadnick", "time": 1610128927694, "rating": 5.0, "text": "Extremely professional and wonderful customer service.  My jewelry was ready ahead of quoted time frame and the price was reasonable. My ring hasn’t sparkled and shined this bright in years!  I would absolutely recommend this jeweler and will be a customer for life.", "pics": null, "resp": {"time": 1610217025919, "text": "Thank you for the great review!!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "116234194513377324781", "name": "Brandon Bradley", "time": 1616771372812, "rating": 5.0, "text": "Would 100% recommend to anyone in the market. My man Andrew was super helpful. Will be back, I am sure of it.", "pics": null, "resp": {"time": 1616772490607, "text": "Hi Will. Thank you for the great review! Andrew"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "108632282729018928230", "name": "Jennifer Turner", "time": 1613516839635, "rating": 5.0, "text": "Ms. Underdown and the staff were so helpful. Goldstein’s took family rings and made wedding bands for my nephews, beautiful rings. There were some diamonds left from one of the two rings used(one my mother’s engagement ring and the other a chandelier ring that belong to my aunt). Ms. Underdown helped me design a ring for myself with the remaining stones from my aunts ring. The result is a beautiful band with the diamonds and  aquamarines which were my aunts birthstone. I cannot thank you enough for the care and concern that was shown in the remaking of these family rings. Jen Turner", "pics": null, "resp": {"time": 1613665010949, "text": "We're so happy that you are so happy Jennifer - thank you for sharing!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "117346413954371491044", "name": "Jecko Ecko", "time": 1617223057140, "rating": 5.0, "text": "Don and his co-workers were very polite and helpful with assisting me with what I needed and they were able to take care of my necklace in a timely manner.", "pics": null, "resp": {"time": 1617225509031, "text": "Thank you for the stars!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "100914802152796980425", "name": "Lori Whittle", "time": 1607635638283, "rating": 5.0, "text": "I always receive excellent service every time i walk into Goldstein’s. The staff is very friendly and knowledgeable. They are extremely helpful. Their jewelry is the best in Mobile. If you are looking for good quality, or just something special, I highly recommend Goldstein’s Jewelers.", "pics": null, "resp": {"time": 1609105891799, "text": "Lori, thank you so much for your review and your recommendation!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "109441634344757319609", "name": "Tommy Preslar", "time": 1622152563577, "rating": 5.0, "text": "Great service that feels like they care for you the customer and the products they sell. It’s like going home and sitting down with family!", "pics": null, "resp": {"time": 1622153569397, "text": "Thank you Tommy!  We're glad you're in our family!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "113821240986033569129", "name": "David Ferebee", "time": 1609093731372, "rating": 1.0, "text": "Too bad they don’t appreciate long time customers! My wife went in there days before Christmas and asked to have her  charm bracelet cleaned and a new battery for my watch. The watch, bracelet and ALL the charms over the years (20+)were purchased from this store.\nShe was told “we have not sold those items in years and would not be able to help her today”.\nMaybe leadership has changed here from the beginning and relationships do not matter anymore.\nI am not bitter, but disappointed that after my many years of buying my wife jewelry from the store it is over.\nI am sure I can find another jewelry store in town as I still have many years left to buy for my wife.", "pics": null, "resp": {"time": 1609105729368, "text": "David, I'm sorry your wife felt mistreated.  We did have a store full of customers when she was in during the week of Christmas.  We just cannot take someone away from a customer to clean jewelry or change a battery so we do it when we're closed.  As to the Pandora, we no longer have the equipment to properly clean it.  We have not carried Pandora for over three years.\n\nWe work very hard to do the best we can, and we're proud of the reviews we receive.  I am sorry you feel we dropped the ball this time.  I do appreciate your review and we will try to be better explaining ourselves in the future.  Richard Frank, Owner"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "118118379490131321065", "name": "Alissa Doll", "time": 1610830935797, "rating": 5.0, "text": "The staff at Goldstein’s is welcoming and very accommodating to a wide array of jewelry needs! The service is fantastic quality and efficient! I had my engagement ring cleaned and it looked like it did the day I got it! I highly recommend Goldstein’s!", "pics": null, "resp": {"time": 1610902058504, "text": "Thank you for your kind words, Alissa.  And thanks for coming to Goldstein's!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "114977637384084260427", "name": "Lydia Dillard", "time": 1609776259527, "rating": 5.0, "text": "I was Amazed to have made 1 phone call and they immediately guided me to their location. I was in a panic because my husband's wedding ring didn't fit. Being just married hours prior, It was imperative that I get him not just any ring but a nice one on our Wedding day. Well they welcomed us as if we were long time established customers. Ms Angela assisted us and showed him the perfect ring. Her and Andrew were so helpful during my time of panicking..... The service was excellent, The price was extremely affordable. We left as Happy Newlyweds thanks to Golstein's and their caring associates.", "pics": null, "resp": {"time": 1609874884038, "text": "Thank you Lydia and congratulations again!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "114308433728173450118", "name": "Danielle Isen", "time": 1610836534867, "rating": 5.0, "text": "My engagement ring was in need of significant repair.   The band had literally snapped in half and set was damaged.   The jeweler transformed the ring.   It looks brand new and was done very efficiently.   The quality of repair was exceptional,  and the employees in the store are friendly.   I highly recommend Goldstein's Jewelers!", "pics": null, "resp": {"time": 1610901785808, "text": "Thank you for trusting us with your meaningful jewelry.  I'm glad we could take care of this for you!  And thank you for the very nice review.  Happy New Year!  Richard"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "106213255905118986820", "name": "Gavin Grove", "time": 1616604304291, "rating": 5.0, "text": "Beautiful pearls, exactly what I was looking for. Don was very knowledgeable and accommodating, no pressure, a pleasant shopping experience.", "pics": null, "resp": {"time": 1616607475215, "text": "Thanks so much, Gavin.  It was my pleasure."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "103877944047712775821", "name": "Scott McIlrath", "time": 1615658738246, "rating": 5.0, "text": "I found a silver spoon marked J Goldstein and couldn’t find much on the internet. But I did find Goldstein’s Jewelry in Mobile. I emailed the store and Angela responded. After a few texts, Angela identified what I had found and provided some history. Service above and beyond!!! They have been around a long time. Service like this guarantees they will be around much longer!!! Thank you Angela!", "pics": null, "resp": {"time": 1615661464508, "text": "Thank you - I'm glad I could help!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "100261471741103376487", "name": "Jessica", "time": 1602372982826, "rating": 5.0, "text": "Going into a jewelry store can be intimidating and a little scary sometimes especially when you love the sparkle and shine. You don’t know how much items cost or if the people will be nice to you. From the minute you walk into Goldstein’s, they treat you like family. Whether you are just looking, buy a gift, convince someone to say yes or just want to treat yourself,  the team is there for to help you decide and maintain your purchase. Thank you Goldstein’s for being the best!!!!", "pics": null, "resp": {"time": 1602444872813, "text": "Thank you so much, Jessica.  We really appreciate your kind words!  Richard"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "109947423350856594782", "name": "Ty Edwards", "time": 1606583938454, "rating": 5.0, "text": "I had a few diamonds missing in my mom’s ring and had been scared to be without it. Goldstein’s came highly recommended. I just picked up my ring and I’m truly amazed at how it looks. I highly recommend ! Great work and customer service!", "pics": null, "resp": {"time": 1606586415125, "text": "Thank you Ty!  We know how important & sentimental jewelry can be.  We're happy you are so happy with our work!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "115732276242948695809", "name": "Joe Gibson", "time": 1618701388343, "rating": 5.0, "text": "10 out 10! Always treated with A+ customer service! Would recommend to anyone!", "pics": null, "resp": {"time": 1618932605481, "text": "Thank you Joe!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "111743741676045719099", "name": "Tierney Vial", "time": 1602964358710, "rating": 5.0, "text": "Goldstein's Jewelers is the best jewelry store in Mobile and along the Gulf Coast where you can find a beautiful selection of jewelry for every occasion. The staff is genuinely friendly and helpful with their knowledge and expertise in fine jewelry. Over seventy years and five generations my family has had the pleasure of shopping at Goldstein's Jewelers making many of our family's milestones special. This local family owned business is like family to me. Thank you Mr. Frank, Angela, Andrew, and everyone at Goldstein's Jewelers.", "pics": null, "resp": {"time": 1602963970965, "text": "Thank you!!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "118176964793699954832", "name": "Tamika Hesley", "time": 1608838020926, "rating": 5.0, "text": "Fantastic Atmosphere! Fantastic People! Fantastic Customer Service! Thank you, Don for a great experience! Especially during this 2020 Christmas season!", "pics": null, "resp": {"time": 1609105772323, "text": "Thank you so much, Tamika!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "109960162195709324747", "name": "Sian Morris", "time": 1598040171717, "rating": 5.0, "text": "Brought my favorite piece of jewelry in to get a repair the day after it broke. It was very sentimental to me. I believe it was Angela who helped me decide what my best option was for the repair. She was so helpful!!! I got a text a few days later saying it was ready. They did an amazing job. Can hardly see where the damage was and it came back cleaner than ever! Very quick and easy. Will definitely be returning.", "pics": null, "resp": {"time": 1598045240432, "text": "Thanks Sian!  We're always here to help :)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "105546548102448295877", "name": "Marissa Hamilton", "time": 1597524313904, "rating": 5.0, "text": "I came into Goldstein’s to get my engagement ring sized today. The manager Angela was so kind and helpful, even though I did not get it sized here today. She was honest with me about recommending I getting it sized at the (non local) jeweler my ring was purchased from, but she still sized my finger and cleaned my ring for free. Because of this awesome customer service, I will certainly come back to Goldstein’s for all my future jewelry needs.", "pics": null, "resp": {"time": 1597528304719, "text": "Thank you Marissa and congratulations!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "116194583795797588069", "name": "Kathy Cobb", "time": 1601397652604, "rating": 5.0, "text": "We are from out of State and I needed a gold chain for a Catholic medal that I bought my Daddy 41 years ago. He wore it from that day until the day he died. Sadly, he passed away 3.5 years ago. My Mama gifted me with the medal and we were passing through Mobile and I Googled jewelry stores and Goldstein's came up with rave reviews. Andrew met us at the door and helped us select the perfect chain. It was a wonderful experience and I highly recommend this store.", "pics": null, "resp": {"time": 1601403871510, "text": "Hi Kathy! Thank you for the great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "102783015216214740498", "name": "Troy Clemmons", "time": 1605997074311, "rating": 5.0, "text": "I went to Goldstein’s after having my rings cut off my finger. I wore them too long during pregnancy and it resulted in them having to be removed. They completely redid and fixed my rings back to brand new! So professional and worth every cent.", "pics": null, "resp": {"time": 1605998459291, "text": "Thank you for the stars!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "103328872739993213873", "name": "Faye Cartwright", "time": 1611918312904, "rating": 5.0, "text": "Friendly, courteous service and they had exactly the necklace I wanted for my great granddaughter’s birthday.", "pics": null, "resp": {"time": 1612567023261, "text": "Thank you Faye!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "115532433606972058184", "name": "Chris Butler", "time": 1588975056038, "rating": 5.0, "text": "Always a pleasure doing business at Goldstein’s. I got my wife’s engagement ring from them years ago, and just recently purchased a second wedding band from them. They already had the sizing and style, and had the band ready in just 3 short days. It’s going to make a wonderful Mother’s Day gift. They treat you like an actual person with respect and not just a number. I have the utmost trust in them to do a great job every single time. Thank y’all!", "pics": null, "resp": {"time": 1588980354232, "text": "Thank you, Chris!  You are a pleasure and we appreciate the review!  Richard"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "110174644798346330838", "name": "Ryan Unsworth", "time": 1613668688590, "rating": 5.0, "text": "They were able to get everything taken care of for me very quickly. I would recommend them for any of your jewelry needs!", "pics": null, "resp": {"time": 1613671775635, "text": "Hi Ryan. Thank you for the great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "116060848954208060187", "name": "Natalie Thornburg", "time": 1601892624543, "rating": 5.0, "text": "My fiancé & I had our first experience with Goldstein's when we were looking at engagement rings over a year ago. We had gone to FIVE other jewelers and had no luck. These people helped us for over an hour and would not give up until we found the perfect ring. Fast forward to three months ago when we went to pick out our wedding bands: once again, great experience. They were so friendly & helpful and made the process a breeze. Last month, I brought them my great-great-great grandmother's ring to be resized. Trusting someone to repair a diamond ring that has made it through 5 generations was difficult, but Goldstein's did an excellent job & were very professional. They even discovered two cracks in the ring, repaired those, and kept me up to date throughout the process as well. This is just a great jewelers with a fantastic staff. I highly recommend them!", "pics": null, "resp": {"time": 1601897083165, "text": "Thank you Natalie for allowing us to be a part of your lives.  And thank you for the recommendation!  Richard"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "101285171523990824230", "name": "Charles Walker", "time": 1590863687044, "rating": 5.0, "text": "My newest recovery medallion will not fit in the holder plus the link to one half of the clasp was hung up. Angela greeted me promptly and had to help remove my chain. She took the holder and new medallion along with my chain to the jeweler. He/she elongated the loop so it would not hang up again and gave me a longer screw to hopefully cross the larger gap that the new medallion created. There was no charge for the service and Angela also cleaned my neck chain. I would recommend them to others.", "pics": null, "resp": {"time": 1590870942293, "text": "Glad we could help Charles - thanks for coming in!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "114090820368090274494", "name": "Zane Patterson", "time": 1599923463160, "rating": 5.0, "text": "The staff at Goldstein's is always so kind and helpful any time you come in. It took me a while to find the perfect signet ring, but I was glad that they were so patient throughout the whole experience. They will always have my business!", "pics": null, "resp": {"time": 1599937460535, "text": "Thank you Zane!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "109184831990887974539", "name": "Leigh D", "time": 1578422073277, "rating": 5.0, "text": "I had a wonderful experience at Goldstein’s Jewelers. From the minute I walked in Angela and Andrew greeted me and patiently listened to my very specific ideas for a custom ring. My ring came out exactly as I hoped for and I attribute this to Andrew’s patience and willingness to really listen and help me through the process until I felt like I had covered all the topics that were important to me. I never felt rushed which was great.  I’m very detail oriented and I appreciated him paying such close attention to my specific requests.I will be a life long customer!! I have been to jewelry stores in many different states but Goldstein’s really stands out to me due to their excellent customer service; they treat you like family. Andrew was my main point of contact and I can’t say enough great things about his professionalism and willingness to help me until we got the ring design just right. Angela helped a lot as well and also worked with me on other logistics and was a joy to work with. Every employee I met was friendly and accommodating. I felt comfortable and at ease every time I went there. They were very trustworthy and honest. I am a very satisfied customer and can’t recommend these folks enough.", "pics": null, "resp": {"time": 1578687220535, "text": "We're so glad you're so happy, Leigh!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "111727705714695451157", "name": "Zane Frazier", "time": 1601585431853, "rating": 5.0, "text": "Amazing staff and amazing jewelry! Couldn’t ask for better. Don did a great job helping find what I was looking for", "pics": null, "resp": {"time": 1601587137821, "text": "Thanks so much, Zane! It was our pleasure."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "107438458450448766443", "name": "vanessa chappell", "time": 1605389076187, "rating": 5.0, "text": "Angela Underdown was so helpful! I brought in a set of freshwater pearls my husband gave me 28 years ago to replace the clasp. They did a beautiful job replacing the clasp and repairing the earrings that match and they also repair them for free. My family will be repeat customers. Thank you Vanessa Chappell", "pics": null, "resp": {"time": 1605649155232, "text": "Thank you Vanessa!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "107092939731290175768", "name": "Jaron Drake", "time": 1601148459597, "rating": 5.0, "text": "Goldstein’s did a beautiful job transforming mine my fiancé’s grandmother’s engagement rings into special wedding bands we will wear for the rest of our lives. Even during the pandemic, the process was very smooth.  Angela is very knowledgeable and helpful", "pics": null, "resp": {"time": 1601391160769, "text": "Thank you, Jaron - your rings are beautiful!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "113991174979220411104", "name": "Tina Ray", "time": 1591222553242, "rating": 5.0, "text": "Just picked my ring up and I am very pleased as usual. I was very happy with them only keeping it one day, since I usually feel lost without it. The curbside service was great and fast. Employees were very friendly. I really missed your yearly sale this spring. I look forward to shopping in-store hopefully soon.", "pics": null, "resp": {"time": 1591279578751, "text": "Thank you Tina!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "101408347920222737593", "name": "Dean Williams", "time": 1619629340059, "rating": 5.0, "text": "Extremely courteous, knowledgeable, and accommodating staff.", "pics": null, "resp": {"time": 1619639464500, "text": "Thank you!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "106765387745149362865", "name": "Cathy Wyatt", "time": 1602360363452, "rating": 5.0, "text": "So friendly and helpful. Went above and beyond to make sure I got just what I was looking for. Always an easy decision to go with Goldstein's.", "pics": null, "resp": {"time": 1602365033667, "text": "Thank you Cathy!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "112740975680507041886", "name": "Katelyn Bennett", "time": 1598180274324, "rating": 5.0, "text": "I brought two rings in, both to be appraised and one resized. I was welcomed as soon as I parked my car. The workers in this establishment are very informative on any questions you may have.  They had BOTH rings completed, resized and appraised in a week!  Overall, my experience was amazing.  Thank you all so much for all your help!", "pics": null, "resp": {"time": 1598278122534, "text": "Thank you so much, Katelyn!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "101454718685661721415", "name": "Rhonda Stringfellow", "time": 1591815462142, "rating": 5.0, "text": "Best customer service ever. For years I have been a customer of Goldstein's Jewelers for everything from my daughters first ring to unique silver wedding and baby gifts. They remember their customers and always greet you by name with a smile. Due to Covid, I went online and was able to text with them exactly what I was looking for, receive a response in minutes and arranged for pick up and complimentary gift wrap.   There is a reason why they have so much repeat business.", "pics": null, "resp": {"time": 1591817396695, "text": "Thank you, Rhonda!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "113668478928769712953", "name": "Chad T.", "time": 1608432061672, "rating": 5.0, "text": "Great service! Very friendly and very helpful.", "pics": null, "resp": {"time": 1608673066499, "text": "Thank you Chad!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "109998548521930884671", "name": "Marion Kirschner", "time": 1594593843473, "rating": 5.0, "text": "Goldstein’s is an amazing family-owned jewelry store. I’ve used them several times over the years, and the selection is totally unique!! From gemstones, to jackets, pearls, and bands, they have it all.", "pics": null, "resp": {"time": 1594648780590, "text": "Thank you so much, Marion!  We really appreciate the review.  Richard"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "105345220260183515868", "name": "Paige Taylor", "time": 1604077707290, "rating": 5.0, "text": "Goldstein’s has been with us every step of the way, from picking out my engagement ring to having it cleaned every year! They are amazing, friendly, and the sweetest business! Thanks Goldstein’s!", "pics": null, "resp": {"time": 1604078718738, "text": "Thank You for the great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "105163485920116541307", "name": "Ally Greer", "time": 1589297810584, "rating": 5.0, "text": "We love Goldstein’s! Their customer service is excellent and their jewelry is beautiful. We recently got my engagement ring reset in a Coast Diamond band. Angela, at Goldstein’s, was extremely helpful! We will definitely go back to purchase more jewelry!", "pics": null, "resp": {"time": 1589303641004, "text": "I'm so happy you're so happy Ally :)  Thank you!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "101744788521639320178", "name": "Meaghan Borowski", "time": 1579128532807, "rating": 5.0, "text": "Absolutely love this place! Everyone is so kind and personable. They devote their time to helping you find whatever you need and are honest about everything. I am so thankful my fiancé chose to buy my ring at Goldstein’s and that I got to meet the incredible staff as well. They made me feel at home and like I have known them forever! I will be referring everyone to Goldstein’s!!", "pics": null, "resp": {"time": 1579194529527, "text": "Thank you Meaghan, and you too Jordan!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "113050853098090111056", "name": "dhelpfulhands", "time": 1573953435410, "rating": 5.0, "text": "From the moment that we walk through the doors until the moment that we left out, the experience with Goldstein's was absolutely wonderful. They have a very calming atmosphere and everyone was readily available to assist with smiles on their face. Their smiles were genuine because they all had great attitudes. I will encourage anyone that's looking for that next beautiful and  special jewelry purchase to visit them! You will not be disappointed. Thank you staff for being absolutely authentic and having A-1 customer service.", "pics": null, "resp": {"time": 1574179502743, "text": "Thank you so much!!!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "108457225360874593070", "name": "Meg Walton", "time": 1578686194896, "rating": 5.0, "text": "They took great care of us. The staff was welcoming and friendly. We interacted with 3 employees, and each of them made us feel right at home. The work they did on my ring was quality, and the work turned out exactly as I expected. In the future we will choose to have work done at Goldstein’s again.", "pics": null, "resp": {"time": 1578689861889, "text": "Hi Meg, Thank you for the awesome review! Andrew"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "111052983170191565206", "name": "Emily Suddath", "time": 1601434655597, "rating": 5.0, "text": "Goldstein’s helped me and fixed my problems when another local jewelry store failed to deliver the customer service I would expect. I cannot explain what sets Goldstein’s apart until I share the negative experience I had at another jewelry store in Mobile, so I will share that first.\n\nLike I said, I had a ring repair somewhere else first. The other jewelry store not only sized my ring down (when I didn’t ask for it to be sized down), but failed to claim fault for it.  My diamond had fallen out of my setting and I asked the other jewelry store to reset the diamond and also solder my wedding band and engagement band together. When I got my rings back from them, my ring was a size 5 3/4 which is 3/4 smaller than the original size, which was a  size 6 (rings also fit tighter when they’re soldered together, so it fit much tighter than before.) I want to also note that their store never sized me in store either, but rather had the ring repaired with no size listed in their system. Goldstein’s makes a practice of sizing you and placing the size in the system, anytime you come in for ring repairs so that it is never your word against theirs.\n\nWhen I came back to the other store, not only did they not apologize, they did not want to take apart my soldered rings and resize them individually (so as to protect the integrity of them) , but they recommended making the two rings into one. The sales associate also sized me as a size 7 which is A LOT larger than the size 5 3/4 ring they had sent me home with just a few days before!\n\nI felt something was off with how everything was being handled, so I decided to not have my repairs done there but instead have them done somewhere else...which would be how I ended up at Goldstein’s a few days later.\n\nWhen I went to Goldstein’s, they measured my finger and reassured me that yes, the other store had sized my ring incorrectly. The rings wouldn’t even fit on my finger without redness and swelling (which the other jewelry store associate said was due to having large knuckles, or perhaps even the humid weather.)\n\nGoldstein’s assured me they stood behind their sizing methods. The other jewelry store actually told me they didn’t guarantee their fit and scoffed over the phone when asked if they guaranteed the fit. Goldstein’s on the other hand, said that they do guarantee the fit they size you with in store. They didn’t make me feel like I was being unreasonable at any step of the way, like I felt at the other store. They affirmed me, as one should do when providing quality customer service.\n\nGoldstein’s measured me as a size 6 1/2  and I noticed they had a careful attention to fit, and also that their ring sizing methods seemed more legitimate than what I was offered at the other jewelry store (they used individual rings to size me at Goldstein’s, and the other store used a keychain of sorts full of various sized rings. I was more impressed with the Goldstein’s method because if you’re getting rings soldered together, you want to see how the two stacked rings will fit your finger and that they come off easily, versus what was offered at the other store, with only one ring being placed on the finger to determine fit.)\n\nIf I had gone through with the second round of repairs at the other store, I would have been paying for extra gold that I would have had removed anyway because they sized me as a 7, and my true size is a 6 1/2, as determined by Goldstein’s (my rings fit beautifully now!) Goldstein’s got it right the FIRST time versus the other store which didn’t get it right the first two times.\n\nAll this to say, Goldstein’s did everything correctly and professionally. They even texted me to see how my rings were fitting a week later. I call that excellent customer service.\n\nIf you want a correct fit the first time with no back and forth issues that make you second guess yourself, and if you’d rather have extra money in your pockets (unlike I do, since I had to pay for correct repairs that the other store failed to provide) then please, go to Goldstein’s!", "pics": null, "resp": {"time": 1601480386580, "text": "Thanks so much for the great review.  We are sorry you had such an awful experience at the other jeweler, but happy we were able to help you.  So glad you are able to wear your beautiful rings again."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "110377379135076104290", "name": "Kimberly Freeman", "time": 1580314157223, "rating": 5.0, "text": "I wouldn’t trust anyone else with my jewelry! They went above and beyond to fix my wedding set and I feel like I came out with brand new rings! Definitely customers for life! This group is awesome and so personable!", "pics": null, "resp": {"time": 1580318028462, "text": "Hi Kimberly, Thank you for the kind words and Great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "111389440943353252351", "name": "Fanny Biesewig", "time": 1590699863143, "rating": 5.0, "text": "Love this place. Highly recommend if you need something special.  Angela and Don are wonderful and take care always!", "pics": null, "resp": {"time": 1590767190785, "text": "Danke! Thank you!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "104637167265145105379", "name": "Jan Avery", "time": 1591910237075, "rating": 5.0, "text": "Customer service was excellent! Very quick repair and impeccable work. I would certainly recommend them to anyone!", "pics": null, "resp": {"time": 1591914527297, "text": "Thank you so much for the stars!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "117730270434846321116", "name": "Donna Brown", "time": 1579132308684, "rating": 5.0, "text": "The staff at Goldstein’s provide excellent service and value their customers, as evidenced by the way they treat people from the moment they walk through the door. No matter whether you’re shopping for jewelry or bringing in an item for repair, you’ll receive first class service. They’ve been in business for many, many years and their jewelers are experienced and professional. I highly recommend Goldstein’s and will visit their store anytime I am looking for a gift or a piece of jewelry.", "pics": null, "resp": {"time": 1579194588841, "text": "Thank you - so happy to help Donna :)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "110981537592681855947", "name": "Madison Searcy", "time": 1591474570239, "rating": 5.0, "text": "Very friendly and informative. They have so much expertise and knowledge about their pieces. Angela was so helpful and personable.", "pics": null, "resp": {"time": 1591478296416, "text": "Thanks Madison and congratulations!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "111854216534167452657", "name": "Alicen Brizendine", "time": 1581107842665, "rating": 5.0, "text": "Everyone at the store is so friendly— from Bobbie to Steve to Andrew. They always are so helpful. My husband had my engagement ring made here years ago. I recently needed to get it resized. I dropped it off and 3 days later it looks like I have a brand new ring! (A week ahead of schedule!!!) Nice people, good prices, and AMAZING work. I only trust Goldstein’s for my jewelry!", "pics": null, "resp": {"time": 1581113810578, "text": "Thanks for the wonderful review, Alicen!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "109376439421901233727", "name": "Marlene Jones", "time": 1583857378937, "rating": 5.0, "text": "We’ve been going for years and know the costumer and are wonderful with helping my husband get what I like. Love them! And their devotion to local charity.", "pics": null, "resp": {"time": 1583875547452, "text": "Thank you Marlene!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "109826497098436532498", "name": "Ben Nabors", "time": 1608755316598, "rating": 5.0, "text": "Service with a smile. Thanks Don and Andrew.", "pics": null, "resp": {"time": 1609105848293, "text": "Thank you, Ben.  We appreciate your review very much."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "103200970952323418270", "name": "Amanda Heidbreder", "time": 1578178341481, "rating": 5.0, "text": "Goldstein’s is synonymous with an established “Old Mobile”jewelry store. The customer service is great.  Their staff is very knowledgeable and their jewelry is beautiful.  They made some repairs to some family heirlooms and I couldn’t be more pleased.", "pics": null, "resp": {"time": 1578414043881, "text": "Thank you, Amanda!  We're always happy to be able to help :)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "107728248226917209444", "name": "Bailey Brierly", "time": 1597171381456, "rating": 5.0, "text": "Amazing service and friendly people! I will definitely be going to them from here on out.", "pics": null, "resp": {"time": 1597175136651, "text": "Thank you Bailey :)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "110539938279524197763", "name": "Carolyn Lewis", "time": 1564749683200, "rating": 5.0, "text": "I am so happy with the ring that was designed at Goldstein’s. My mom wanted me to have her diamond ring and turn it into something of my own. I felt such an ease when I walked into the store and was greeted by Don, who helped me design the most perfect ring. The entire staff was very professional and extremely friendly. I will definitely come back with other jewelry needs. Thank you!", "pics": null, "resp": {"time": 1564861637639, "text": "Thanks so much Carolyn for the glowing review.  It was my pleasure."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "110683013766051045905", "name": "Ethan Welford", "time": 1578682980301, "rating": 5.0, "text": "For something as stressful as buying a ring, Angela and her staff really made the event a lot less stressful as I was preparing for. I never once felt like she was pressuring me or trying to convince me to go one way or the other. She was thoughtful, she listened and she answered my questions and gave great suggestions and really spent time with us. Really great experience.", "pics": null, "resp": {"time": 1578696346253, "text": "Thank you Ethan and best wishes!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "104923727303345797587", "name": "Amy Black", "time": 1570665205305, "rating": 5.0, "text": "First time in store to request jewelry repair, I was greeted with an open door, smiling faces, and personalized service! They repaired my jewelry in less then 5 minutes, were super professional and did not charge me a dime! As I browsed around the store, their jewelry is absolutely beautiful! I definitely will be back to purchase a special prize! Lovely service! Recommend 100%.. Don't waste time anywhere else!", "pics": null, "resp": {"time": 1570724849932, "text": "Thanks, Amy for the great review!  I am so glad we were able to make your necklace wearable."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "118294604452241230678", "name": "Laura Allyson Richey", "time": 1580513905755, "rating": 5.0, "text": "Goldstein’s has taken excellent care of our jewelry and repaired heirloom pieces for us on several occasions. They are very prompt and the jewelry looks brand new when it is returned to me. I have been very pleased with their services each time and we go nowhere else!", "pics": null, "resp": {"time": 1580574499804, "text": "Thanks so much, Laura.  We're happy that you're happy!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "103956881983043930580", "name": "Genny Pechar", "time": 1594410723308, "rating": 5.0, "text": "Best experience! Everyone one there is so friendly, I will always use them!", "pics": null, "resp": {"time": 1594417714413, "text": "Thank you Genny - we appreciate your kind words!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "108924041624951263424", "name": "Natalie Banfi", "time": 1600382483703, "rating": 5.0, "text": "Prompt work and kind employees\nMade my jewelry beautiful again", "pics": null, "resp": {"time": 1600439420507, "text": "Thank you Natalie!  Enjoy your beautiful jewelry :)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "112069867350918960562", "name": "davowaindav", "time": 1581783991729, "rating": 5.0, "text": "I had a ring resized here recently. The people helped me with everything. I had some other questions about jewelry and Andrew gave great advise to help me make a decision. Wonder service and treatment. I highly recommend!", "pics": null, "resp": {"time": 1581788028875, "text": "Thank you for the review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "100636822522194778122", "name": "Valencia Chaney", "time": 1580597884060, "rating": 5.0, "text": "I always have a great time at Goldstein's  Jewelers. The work that they performed for me turned out beautiful. The people there are professional but personable.", "pics": null, "resp": {"time": 1580593670052, "text": "thanks for the stars!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "104897558100235337645", "name": "William Duffy", "time": 1583955643720, "rating": 5.0, "text": "Always professional and knowledgeable. They ensure that you are satisfied with your purchases. I will continue to make my jewelry purchases there. I am satisfied and loyal customer.", "pics": null, "resp": {"time": 1583959520726, "text": "Thank you for the review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "112663435212571430792", "name": "Danny Burgin", "time": 1592334684471, "rating": 5.0, "text": "Don was so nice never rushed or pushed me.And helped me make the best decision LOVE GOLDSTEINS", "pics": null, "resp": {"time": 1592343579406, "text": "Thanks so much, Reva!  I'm hapy that you're happy!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "115628594223200261509", "name": "Andrew Counts", "time": 1571170749513, "rating": 5.0, "text": "I always get prompt and friendly service at Goldstein's.  They make shopping for a loved one very easy.  They sell high quality jewelry that is also a good value.", "pics": null, "resp": {"time": 1571172800661, "text": "Thank you for the great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "112339704860779283430", "name": "Havard Cathy", "time": 1572473370091, "rating": 5.0, "text": "Goldstein’s is the best! I recently had my wedding ring resized and their jeweler had it ready in just one day. This wasn’t just a little stretching...they had to cut the ring add gold to the band. Looks like new. Great folks, great company!", "pics": null, "resp": {"time": 1572543083337, "text": "Thank you - you made our day!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "101019378988831556346", "name": "April Lundy", "time": 1582386300888, "rating": 5.0, "text": "Angela was very helpful! She took her time to help me and was very very patient! It was an awesome experience and I will tell my friends and will continue shopping here", "pics": null, "resp": {"time": 1582393954525, "text": "Thank you, April :)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "111658752798773549844", "name": "carwei chen", "time": 1589661454995, "rating": 5.0, "text": "I had a necklace that needed to be fixed and the staff (her name is Angela) there was super nice and helpful during my visit :)", "pics": null, "resp": {"time": 1589666851135, "text": "Thank you for coming in, and thank you for the very nice review, Carwei!  Richard"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "107459714318161895406", "name": "mjill gee", "time": 1571446254198, "rating": 5.0, "text": "I have always loved the beautiful and unique sterling silver jewelry that Goldstein’s carries by Michou. She uses lots of colorful stones and shapes to make eye catching and stunning pieces that are, IMHO, very affordable pieces of art! Today I found a great multi-stone bracelet and the coolest ring for my sisters to get me for my birthday:). Thanks to Angela for all her help in narrowing down my selection from so many beautiful and unique options!", "pics": null, "resp": {"time": 1571496030543, "text": "Thank you!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "116072154896201182828", "name": "Ty Ve", "time": 1546734551100, "rating": 5.0, "text": "Amazing place and people! Been my jeweler for years and always a pleasure seeing everyone when I walk in. Very knowledgeable and takes time to explain differences  between stones or rings or designers. Angela is the person to see and talk to. Shes wonderful and always so sweet. I recommend them to any and everyone. Nice selection of designers and settings.", "pics": null, "resp": {"time": 1546833259581, "text": "Thank you Tyler!  You and your family are like family to us!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "104634111394483405370", "name": "Becky Payne", "time": 1566424557078, "rating": 5.0, "text": "I can't say enough positive things about my experience with Goldstein's!! They are the true definition of customer service! Andrew and all the staff were so helpful with the redesign of my wedding ring. I can't wait for the next occasion to work with them again!! Thanks guys!!❤❤❤", "pics": null, "resp": {"time": 1566426126962, "text": "Thank you for the great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "113372916865577406927", "name": "Natalie Baumgarten", "time": 1580827521468, "rating": 5.0, "text": "I always have great service with caring pleasant folks at Goldstein’s from beginning to end, helpful with any occasion! They treat you like family!\nNatalie Baumgarten", "pics": null, "resp": {"time": 1580833127106, "text": "Hi Natalie! Thank for the review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "104318221826907212151", "name": "Teresa Hughes", "time": 1554302421745, "rating": 5.0, "text": "The staff is welcoming. The jewelry is top of the line. Jewelry repair service is high quality. Repairs are always finished before pick up date.\nDon J.  is quite helpful in helping me select items for myself and gifts for others. Over all I WOULD recommend everyone to shop at Goldsteins's Jewelers.", "pics": null, "resp": {"time": 1554304126983, "text": "Thanks so much, Teresa!  We always love it when you come in."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "114664535713655011052", "name": "Marwa Gibson", "time": 1553891072664, "rating": 5.0, "text": "My Mom and I have shopped at Goldstein’s for many, many years (when they were located at the Mall)! Wonderful service, friendly faces and always willing to help with anything we are looking for. One time I needed a replacement earring ( I had lost one ) and they were able to locate the replacement for me. Highly recommend!", "pics": null, "resp": {"time": 1553895251583, "text": "Thank you, Marwa!  Always nice to see you!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "105285522795668120646", "name": "Teri Pickering", "time": 1558055592514, "rating": 5.0, "text": "Wonderful as usual - went in to get a new watch battery and managed to try on some beautiful Hearts On Fire jewelry! I may add to the collection my late husband started for me - if I win the Lottery, that is! Everyone there is always so nice - its always a pleasure!!", "pics": null, "resp": {"time": 1558106680921, "text": "Hi Teri! Thank you for the terrific review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "100867043054760668310", "name": "Rick Walker", "time": 1593291807113, "rating": 5.0, "text": "Excellent recommendations,  she loved them(ear rings)", "pics": null, "resp": {"time": 1593295586169, "text": "Awesome!  Thanks so much for the great review."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "117583666539106844830", "name": "Sheila Crocker", "time": 1567889972589, "rating": 5.0, "text": "Took in a ring for repair and was greeted warmly. Bought beautiful baby gift. They have so many unique things.", "pics": null, "resp": {"time": 1568139423564, "text": "Thanks so much, Sheila!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "112015051294661978883", "name": "Alessandra Mehditash", "time": 1588282991103, "rating": 5.0, "text": "i love goldstein jewelers. they have beautifull jeweley. are trustworthly, and the sales ppl are always so frendly", "pics": null, "resp": {"time": 1588280766765, "text": "Thank you Alessandra!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "102212341802741496965", "name": "lizzie marlow", "time": 1566669533927, "rating": 5.0, "text": "Me and my fiancé experienced amazing customer service as soon as we walked through the door. Everyone was so welcoming, offering us waters and taking care of our jewelry’s needs. I highly recommend Goldstein’s to anyone looking for jewelry or jewelry repair!!", "pics": null, "resp": {"time": 1566679102485, "text": "Thank you for the review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "108968287709219487342", "name": "Larry Johnson", "time": 1570812297962, "rating": 5.0, "text": "Have purchased from Goldstein's before. My wife loves her new diamond ring.  First class sales staff.  Always happy with purchase.", "pics": null, "resp": {"time": 1570816622700, "text": "Thank you for the great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "112110949083909103772", "name": "David Pryor", "time": 1610151213010, "rating": 5.0, "text": "Best jewelry store in Mobile. Quality product for the money and the most friendly staff. Highly recommend for any jewelry purchase.", "pics": null, "resp": {"time": 1571843292115, "text": "Thanks, David for the great review and recommendation.  I'm sorry I missed you when you were in.  Richard"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "108464161770465944155", "name": "Jennie Winger", "time": 1570758806251, "rating": 5.0, "text": "I brought a pair of delicate gold earrings to Goldstein’s for them to improve the way they were designed to close. I was always afraid I would break them. I wasn’t happy the first time around the way they turned out. I feel they went above & beyond to make me happy with them. I also appreciate Angela Goldstein  texting me Right away to make sure if I happy or not. You don’t get such customers service like that these days. I recommend this establishment to anyone. Thanks again. Jennie Winger", "pics": null, "resp": {"time": 1570804889820, "text": "Thank you, Jennie - we're always here to help!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "110438854446656652931", "name": "Tony Javens", "time": 1573606050221, "rating": 5.0, "text": "Absolutely the best Jeweler in the NATION! I purchased a ring from here going on 4 years. Angela was apart of this experience every step of the way! She helped create an experience that my wife and I will always be thankful for! Giving them 5 Stars isn’t enough to show how wonderful the experience was. Still to this day she and Goldstein’s are still involved! Goldstein’s (Angela) helped create a defining moment to what would be apart of our story forever! Picking out the ring ladies and gentlemen begins with Goldstiens and will always and forever no matter where you are they will be there to help you along the way!", "pics": null, "resp": {"time": 1573657627807, "text": "You made my day, TJ ;) We're always here to help!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "109947408879101435469", "name": "Ashley Todd", "time": 1561661488872, "rating": 5.0, "text": "Steve Lorenat and staff were extremely helpful. They helped me pick out the perfect chain for my grandmothers diamond. They even sized the necklace to get the charm onto the chain and then fixed it where it would not fall off.\nThank you so much!", "pics": null, "resp": {"time": 1561996279873, "text": "Thanks for the great review, Ashley!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "110533791345232509037", "name": "Lisa Russell", "time": 1539537272666, "rating": 5.0, "text": "They offer the very best in personalized service. Just walk through the door to receive service that is above and beyond, nothing is too big or too small for them to handle. Their Hearts on fire Diamond collection is stunning. If they don't have it they will offer to get it for you this is definitely my go-to place to look beautiful", "pics": null, "resp": {"time": 1539730494972, "text": "Gee thanks, Lisa! Your kind words make us smile ;)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "113525442675123773756", "name": "Jan Hibberts", "time": 1541800747885, "rating": 5.0, "text": "Called Bobby on the phone first to see if they had what I was looking for. She was very helpful with all questions I had. Went right to the store to pick up a beautiful omega necklace that’s sterling on one side and 14 k on the other. It was very reasonable in price as well. I will be a return customer!", "pics": null, "resp": {"time": 1541879237762, "text": "Glad we could help - thanks for the stars!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "111419954133335305927", "name": "Vann Bush", "time": 1582997783116, "rating": 5.0, "text": "As always at Goldsteins, the service was superb.  Don Johnson provides service at a level far above what we have come to expect.", "pics": null, "resp": {"time": 1583259073548, "text": "Thanks so much for the great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "101607938585166205857", "name": "Claire MacDonald", "time": 1553015180911, "rating": 5.0, "text": "I walked in today, having been a long time customer of a local store that had closed and was instantly treated like family. Don Johnson was unbelievably friendly and so much fun to work with!  I will definitely be a good customer!", "pics": null, "resp": {"time": 1553028509612, "text": "Thanks so much, Claire!  We are thrilled to have you as our special new customer."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "108500324006129073129", "name": "Janet Masline", "time": 1574301130362, "rating": 5.0, "text": "The jewelers at Goldstein’s are wonderful! I just had three rings resized and they look better than new!", "pics": null, "resp": {"time": 1574345453093, "text": "Thank you, Janet - enjoy your \"new\" rings!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "115510079211042387864", "name": "Leroy Crenshaw", "time": 1547576520266, "rating": 5.0, "text": "My experience with Goldstein's service was exceptional professional, from start to finish. I took my wife wedding ring in for repairing the ring crown. When completed the ring look better than first purchased. Wife love it. Many thank to a job outstanding job.", "pics": null, "resp": {"time": 1547581650973, "text": "Thank you, Leroy!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "101389710129553664481", "name": "Mary Kate Mccluney", "time": 1548536374877, "rating": 5.0, "text": "Goldstein’s has been amazing for all of our wedding jewelry! My engagement ring is absolute perfection, as are our wedding bands. They are always extremely helpful, and happy to clean our rings for us whenever we stop by. Thank you for everything!", "pics": null, "resp": {"time": 1548541460464, "text": "Oh Mary Kate - you're making us blush ;) thank you!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "102078235730869046376", "name": "adrianne duff", "time": 1557273313731, "rating": 5.0, "text": "I came in a while back with my Aunt, she was giving me a sapphire ring she had for over 20 years.  We came in to get it inspected, cleaned and resized.  The staff was great to work with and took the time to talk to us and answer all of our questions.   I will definitely be back for all future jewelry purchases!", "pics": null, "resp": {"time": 1557330504654, "text": "HI Adrianne! Thank you for the excellent review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "108433178332884283732", "name": "Kenneth Smith", "time": 1550349240078, "rating": 5.0, "text": "The nicest people I’ve ever met.  I felt so comfortable shopping there.   They won a customer for life!  You can also do a savings plan.  Awesome 😁!", "pics": null, "resp": {"time": 1550352775331, "text": "Thank you Kenneth - you made our day!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "111802525808897176555", "name": "Melodie Sarubin", "time": 1528494208802, "rating": 5.0, "text": "I was very pleased. Staff was super nice and willing to help me in every way possible.  The jeweler sized my ring and they told me I was probably gonna be able to tell where I could not at all tell where and it was done. It was back fairly quickly in 3 days. So I'm super excited to have my wedding bands back in perfect  condition.", "pics": null, "resp": {"time": 1528499602476, "text": "Thanks, Melodie!  We're glad we were able to help to make your ring fit just right!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "105353176945118415978", "name": "Darlene Allsup", "time": 1580586123268, "rating": 5.0, "text": "Professional, courteous, experienced in knowlege of jewelry and made me feel comfortable and welcomed.", "pics": null, "resp": {"time": 1580836403937, "text": "Hi Darlene, Thank you for the review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "115132022811181653191", "name": "MONICA HOGUE", "time": 1545666849994, "rating": 5.0, "text": "I can't say enough great things about Goldstein's and all their staff. It was the best buying experience.  Andrew was very personable and patient he took his time and found exactly what I wanted,  a custom piece, and at a great price compared to other jeweler's in town. You will not find any better service than Goldstein's.", "pics": null, "resp": {"time": 1545667922860, "text": "Hi Monica, Thank you for the great review and the kind words - Andrew"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "101400210425301031309", "name": "Susanna Smith", "time": 1573234284628, "rating": 5.0, "text": "Angela was great, very knowledgeable and she spent a lot of time with us. We are very satisfied.", "pics": null, "resp": {"time": 1573241432903, "text": "Thank you two, too!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "104310578918311592159", "name": "Trenton", "time": 1544292258546, "rating": 5.0, "text": "Best service in town. Could not have asked for better people to do business with. Andrew and Angela are great! I will definitely be a repeat customer.", "pics": null, "resp": {"time": 1544293752105, "text": "Hi Trent, Thank you for the 5 stars and the great review! - Andrew"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "107909438919555778579", "name": "Kristin Ellis", "time": 1545662606660, "rating": 5.0, "text": "Wonderful customer service! Richard and Angela make you feel so welcome. A great shopping experience! Oh! The jewelry is awesome too! :)", "pics": null, "resp": {"time": 1545929823453, "text": "Thank you Kristin ;) friends and customers like you make our job easy!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "110786048357022158209", "name": "JMou", "time": 1544557765222, "rating": 5.0, "text": "Great experience with Goldstein's. They were very helpful and very nice. They helped me with the price a bit and worked hard to meet the short deadlines a gave them. I shopped other places and they didn't even come close to the prices, quality, and sales environment.", "pics": null, "resp": {"time": 1544563669585, "text": "Thanks so much for your business.  Our goal is your satisfaction."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "113836502563277706774", "name": "Steven Pubillones", "time": 1545240162038, "rating": 5.0, "text": "Great engagement ring experience. Andrew helped bring my idea to life and always kept me informed of the status/progress of the ring. The rest of the staff were helpful and friendly when I’d stop by. New to the area and didn’t have any experience with the other jewelers, but I see no reason to go elsewhere.", "pics": null, "resp": {"time": 1545247395726, "text": "Steven, Thank you for the Great review. I had fun creating your ring. Andrew"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "112166107411986621710", "name": "matthew bray", "time": 1571504628235, "rating": 4.0, "text": "Service was great,  everyone was helpful and kind. Im enjoying my purchase very much.  However i feel that i over paid for my ring. Lessons. Learned !", "pics": null, "resp": {"time": 1571506673579, "text": "We too are surprised how the current price of gold has affected the price of many of the items we sell.  You purchased an heirloom quality ring that you will enjoy for years to come, especially with the hand engraving.  Thank you for letting us help you ;)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "106593961492869319742", "name": "Rachel Browning", "time": 1567271318566, "rating": 5.0, "text": "Wonderful people and a great fun place to find EXACTLY what you want. If you are looking for something really special and unique that's  Mermaid or Ocean Life related you dont need to look any further they have an extensive line of almost every sea creature you can imagine un Gold or Silver and at very very fair prices too. I went in to pick up my Danny Wong Blue Sapphire Sea Star ring and felt at ease to look and try on whatever else caught my eye with no pressure and very helpful staff and just had to have the cutest beautiful octopus ring also by Danny Wong so I am getting that too. They also do cleaning and repair very very great happy fun place to shop", "pics": null, "resp": {"time": 1567274877217, "text": "Hi Rachel! Thank you for the glowing review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "112575484851009900436", "name": "Anne Powell", "time": 1553873145751, "rating": 5.0, "text": "The customer service is outstanding.  I had some work done on a ring and they went above and beyond to make sure that it was done correctly.   Their knowledge and workmanship is well above the norm.", "pics": null, "resp": {"time": 1553878572258, "text": "Anne, Thank you for the 5 stars and the kinds words!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "100086892025038707616", "name": "LB Simmons", "time": 1574189639031, "rating": 5.0, "text": "The wonderful people at Goldstein's did an amazing job fixing my dad's rosary. It only took 10 minutes.", "pics": null, "resp": {"time": 1574205782620, "text": "Thanks, we appreciate the review ;)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "117123029012017766177", "name": "ND Ways and Means", "time": 1531352859629, "rating": 5.0, "text": "We just picked up my 35th wedding anniversary gift at Goldstein's!  It was a very special experience.  Two weeks ago we walked in and spent time talking to Andrew about options to repair my now 37 year old engagement ring and possibly purchasing companion rings like the ones we couldn't afford those many years ago.  Andrew fully evaluated my ring and provided us several options.  We decided to remount my diamond.  He found the perfect setting and a ring guard that resembled the companion rings we remembered.  He was knowledgeable and patient.  Fast forward to today, we were greeted at the door by Andrew, the team was there, and Andrew presented my ring and new guard.  The quality is exquisite, my old diamond looks better than ever, and the ring guard accentuates the center diamond just as Andrew said it would.  We were so impressed!  Goldstein's is still Mobile's premiere jewelry store!", "pics": null, "resp": {"time": 1531407108651, "text": "Denise, Thank you for the kind words. It was my pleasure to help you with your anniversary gift! Andrew"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "109660611884682154807", "name": "Rachel Vincent", "time": 1584824815367, "rating": 5.0, "text": "Staff was super helpful and extremely friendly!! Will be going here for all of our jewelry needs!", "pics": null, "resp": {"time": 1589666893736, "text": "Thank you, Rachel!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "114892332034211187879", "name": "Billy Wright", "time": 1565889887858, "rating": 5.0, "text": "Thank you for such good service. Very pleasant experience. The staff were friendly and knowledgeable. Tks agin Bill Wright", "pics": null, "resp": {"time": 1565895393489, "text": "Thank you for the great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "117665181131446379605", "name": "Michelle Murrill", "time": 1510694240810, "rating": 5.0, "text": "The staff is extremely professional and knowledgeable. The first time I shopped here I bought a $200 pair of earrings for my teenage daughter and was treated with kindness and respect. The second time I visited my husband and I bought a bracelet for $1500 and were treated exactly the same as when we bought the $200 earrings. I will continue to do business there and thank Richard and Angela and the entire staff for their kindness and helpfulness!", "pics": null, "resp": {"time": 1510784099572, "text": "Thank you so much, Michelle, for the wonderful review. We are happy to help! We look forward to seeing you all again soon!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "107043445683640900907", "name": "Rebecca Mallet", "time": 1567719939365, "rating": 5.0, "text": "Every person at Goldstein’s is a pleasure to do business with! They listen to what my needs are and, unlike other jewelers, they don’t try to sell you what you don’t want😀 My husband and I have been Goldstein’s customers for 34 years—ever since he bought my engagement and wedding rings that I still wear today! Goldstein’s will forever be our jeweler😃", "pics": null, "resp": {"time": 1567770296911, "text": "Thanks for the review, Rebecca!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "118441267114809705954", "name": "Joy Serra", "time": 1549052008291, "rating": 5.0, "text": "Angela was great to work with.  She really took the time to make sure my bracelet was perfect. Thank you for your wonderful customer service.", "pics": null, "resp": {"time": 1549056551449, "text": "Oh Joy! Thank you!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "100202720731869982334", "name": "melissa shirley", "time": 1558009067125, "rating": 5.0, "text": "Don at Goldstein's was super efficient and nice. He handled my necklace repair and cleaned my jewelry while I waited. I'm always satisfied when I go to Goldstein's.", "pics": null, "resp": {"time": 1558019486025, "text": "Thanks so much, Melissa!  It was my pleasure!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "114060188344836352393", "name": "Bobby", "time": 1550000258600, "rating": 5.0, "text": "What a great experience. I came in for help with a gift and they went out of their way more then could of been expected. I will return!", "pics": null, "resp": {"time": 1550010672546, "text": "Thanks Bobby - we're here to help!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "102707460242863981295", "name": "Betsy Hobbs", "time": 1557352566998, "rating": 5.0, "text": "Great customer service. The resized the band on my watch. It was a little pricier than another jeweler had quoted...by $10 but you pay for quality work.", "pics": null, "resp": {"time": 1557413212255, "text": "Thank you for the fantastic review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "111770230490864534232", "name": "Robin Ross", "time": 1538002277401, "rating": 5.0, "text": "Wow! First time to visit their Show room, Came in to get my fourteen year old gold chain repaired, They were Super knowledgeable about my options to repair it,  Since it had been such a significant piece to us .Thanks since he's had it on since kindergarten it is very Special to us, since we\"re entering High School so it was important to us that it be taken care of by a specialist someone I knew I could trust I picked it up today and they have done a superior job it looks as if it's brand new very pleased and everyone in the store is so nice so helpful and so informative when looking to purchase a new piece I'll be sure to go there first thanks so much!!!    Thanks again, Robin Ross", "pics": null, "resp": {"time": 1538057293568, "text": "So glad we could be of help Robin - Thank you!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "112059884923247257342", "name": "Karen Ball", "time": 1580240526171, "rating": 5.0, "text": "Very knowledgeable and helpful. The employees are so warm and friendly.", "pics": null, "resp": {"time": 1580246273246, "text": "Thanks so much, Karen!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "116026224196996323540", "name": "Maria Papastefan", "time": 1548956667700, "rating": 5.0, "text": "This is a great jewelry store with excellent customer service.  The repair work is always done correctly and honestly.  I would recommend them for all jewelry needs whether you are purchasing or repair.", "pics": null, "resp": {"time": 1548957750264, "text": "Thank you Maria!  Our great customers deserve great service!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "110423929682320273165", "name": "Eliza Drake Crosby Jordan", "time": 1531952592348, "rating": 5.0, "text": "They are amazing! Their products are superb! We have been doing business with them for 4 generations and I will continue to use them! Their customer service Is one of a kind. I HIGHLY recommend them!", "pics": null, "resp": {"time": 1532022938817, "text": "Thank you Eliza Drake - we think you're amazing too ;)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "107855508051978072350", "name": "Kathy Acton", "time": 1524430744213, "rating": 5.0, "text": "I love Goldsteins!  Angela and Richard are two of the nicest people I know.  They give great service, fair prices and they treat everyone with dignity and respect.  The very best jewelry store in Mobile.  For that matter anywhere.  I would not shop anywhere else.", "pics": null, "resp": {"time": 1525469819735, "text": "Thank you for the five stars and great feedback, Kathy!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "113521386139046737222", "name": "Lynn Byrd", "time": 1571688647008, "rating": 5.0, "text": "The staff is extremely helpful and the work I had done was exactly what I requested. I highly recommend Goldstein’s.", "pics": null, "resp": {"time": 1571768566827, "text": "Thank you for the great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "110260306917602998763", "name": "Brenda Hammack", "time": 1542179388617, "rating": 5.0, "text": "Always find exactly what I’m looking for. Great service. Excellent quality. Couldn’t find better people to assist me.", "pics": null, "resp": {"time": 1542211637953, "text": "Oh, Brenda - we love having you as a friend and customer - thank you again and again ;)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "104573806007012118962", "name": "Christopher Colvin", "time": 1533057517591, "rating": 5.0, "text": "Needed to get a ring re-sized. Staff was friendly and knowledgeable. Smooth process for placing and picking up my order. I would recommend this store to anyone looking to buy jewelry, having it repaired or re-sized.", "pics": null, "resp": {"time": 1533071341271, "text": "Hi Christopher, Thank you for the great review!!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "116520568320154775413", "name": "Pat", "time": 1545414595332, "rating": 5.0, "text": "Had a necklace and earrings to be repaired.  Also a ring to be sized.  They could not guarantee the repair to the earrings but they turned out fine.  On the other items, they had competitive pricing and were very helpful in suggestions as how to proceed.", "pics": null, "resp": {"time": 1545417004030, "text": "Thank you Pat for the Great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "117775866554105645536", "name": "Donna Mosley", "time": 1547933832495, "rating": 5.0, "text": "I have been a part of my Goldstein’s family for years now. They have been involved in so much of my life experiences from helping me pick out my first Pandora bracelet to helping my fiancé at the time plan a very unforgettable proposal. Goldstein’s is a very family oriented small business and I can’t imagine what my life  would be like if I had never met them.  They take pride in their customer satisfaction, so if you are looking for a place that you can get the best jewelry in town GOLDSTEIN’S is your place.", "pics": null, "resp": {"time": 1547936849135, "text": "LaDonna, we are so happy to have you and yours in our family ;) Love, Goldstein's"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "118317526464431648558", "name": "David Foster", "time": 1538162163672, "rating": 5.0, "text": "Goldstein's redesigned my wife's wedding ring for our fiftieth anniversary and did a wonderful job. Angela did a great job of leading us through the process with many iterations. Thanks to all at Goldstein's!", "pics": null, "resp": {"time": 1538174957033, "text": "Thank you!  It is a beautiful ring and I'm happy to have participated in making her dreams come true! Congratulations to you both ;)  Angela"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "106832429376109045472", "name": "Deidre Wade", "time": 1545432224394, "rating": 5.0, "text": "This is our new favorite jewelry store! Everyone is so helpful, and there is quite a big selection of merchandise. Complemetary refreshments are a nice touch. We will definitely be a repeat customer of Don’s!", "pics": null, "resp": {"time": 1545581332544, "text": "Thanks so much for the great review!  It is pleasure to have wonderful customers like you."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "112947536956354495030", "name": "Shaina Neece", "time": 1473530331500, "rating": 5.0, "text": "We just went to Goldstein's for the first time today. It was one of the best customer service experiences we have had in a long time in this city. Every staff member was very accommodating and helpful. The selection of Pandora charms were excellent and priced fairly. They treated our little girl like a princess and were very patient while we looked through the store. We ultimately purchased a charm. We will go to Goldstein's first for now on for all of our jewelry needs. They even had wonderful little music boxes for children. Thank you Goldstein's for making our search for the perfect gift very easy and enjoyable.", "pics": null, "resp": {"time": 1502309883215, "text": "Thank you, Shaina, for sharing your experience with us! As a family owned  business of the community, we strive for our customers' satisfaction and to maintain a good relationship. We look forward to seeing you and your family again! (Doesn't matter the age, every girl is a princess!)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "101244101735231314505", "name": "jenniferbryars bryars", "time": 1533320209591, "rating": 5.0, "text": "I have a small Tiffany’s necklace that had 2 bad knots in the chain which caused me not to wear it.  I stopped by to see if they could help. The staff at Goldstein’s took the knots out and cleaned it for free!  I’m so glad I stopped in. The staff was extremely friendly and very knowledgeable!", "pics": null, "resp": {"time": 1533328690968, "text": "Thanks for the great review, Jennifer!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "101318300060856854437", "name": "Cohen Holland", "time": 1542392170992, "rating": 5.0, "text": "I left four rings to be sized and the people were so nice and helpful. If you want wonderful service this is the place to be. I highly recommend Goldstein’s.", "pics": null, "resp": {"time": 1542399836452, "text": "Thank you Barbara! It was a pleasure to help you - Andrew"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "110946424088370270159", "name": "Ansley Bryars", "time": 1525401200765, "rating": 5.0, "text": "Goldstein’s has been nothing short of amazing since the day I walked in with my new engagement ring! They helped my now  husband create the most perfect ring. They are so friendly and go above and beyond with their jewelry as well as customer service!", "pics": null, "resp": {"time": 1525469699185, "text": "Ansley, thank you for the kind review! We love seeing you come in! :) Congratulations on the marriage!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "104299211516480279867", "name": "Barbara Parker", "time": 1587841619508, "rating": 5.0, "text": "As always, quality service and jewelry!", "pics": null, "resp": {"time": 1587850738162, "text": "Thank you for the stars and thank you for shopping local!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "104499360706136989587", "name": "Madelon Kominic", "time": 1525521011232, "rating": 5.0, "text": "Goldstein 's offers a wide selection of unique, high quality jewelry pieces of famous brands and current styles, as well as repairs and appraisals. Goldstein's is exceptional with their personnel - genuinely friendly, knowledgeable, experienced and qualified. A customer is always greeted, usually by name, and is tended to immediately. If customer satisfaction is their goal, they rate highest!", "pics": null, "resp": {"time": 1525649307895, "text": "Madelon, thank you so much for the kind review! We really appreciate your continued support and look forward to seeing you again!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "106862356115809907999", "name": "Stacie Taylor", "time": 1542330634847, "rating": 5.0, "text": "I always have a great experience at Goldstein's! They have a great selection and their employees are friendly and helpful. And I enjoy their special events as well.", "pics": null, "resp": {"time": 1542386868243, "text": "Thank you Stacie ;)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "104594277928848534267", "name": "jennifer jones", "time": 1558564344570, "rating": 5.0, "text": "We’ve been using Goldstein’s for over 10 years and have always received exceptional service. Love them!", "pics": null, "resp": {"time": 1558625020515, "text": "Jennifer, Thank you for being a customer and the great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "107280782829689306893", "name": "Jacob Corbett", "time": 1554237968547, "rating": 5.0, "text": "Richard and his team treat us like family. Goldstein’s is the only jeweler in town that we go to anymore. They sent my wife a birthday card, that they all signed, and me a reminder not to forget her. You can’t ask for better people. Not to mention they carry some of the most amazing pieces. Thank you guys for being the best group of individuals and for taking care of us. Jake", "pics": null, "resp": {"time": 1554245141221, "text": "Hi Jake.  Thanks for the very kind words.  Y'all are so much fun; we love it when you stop by!  Richard"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "104639630769269065496", "name": "Herminio Flecha", "time": 1538238627319, "rating": 5.0, "text": "My favorite jewelry store in Mobile. Staff is friendly and helpful. Beautiful items. Worth checking out.", "pics": null, "resp": {"time": 1538255213602, "text": "Thank you - we appreciate your kind words!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "104600649799619155381", "name": "adam vining", "time": 1531500646165, "rating": 5.0, "text": "Amazing service! Bobbi and Andrew were awesome to work with and answered every question I had and then some! Highly recommend for any jewelry needs!", "pics": null, "resp": {"time": 1531506274631, "text": "Adam, Thank you for your kind words! We appreciate you allowing us to help you - Bobbi and Andrew"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "105907175969615237931", "name": "Bob Holliman", "time": 1541013282712, "rating": 5.0, "text": "I have been a customer for years. Very professional service. Top quality merchandise!", "pics": null, "resp": {"time": 1541021143763, "text": "Thank you for the great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "103503805291264659119", "name": "Olga Liles", "time": 1550258066806, "rating": 5.0, "text": "I needed to get my wedding and engagement rings resized and was looking for a new place to have it done, as the jewelry store I originally bought them from went out of business. As advised by my mother-in-law I went to Goldstein’s and was not disappointed. The people I dealt with were very nice and professional. It took less than a week for me to get my rings back resized, repaired, cleaned and looking like brand new shining and sparkling. I was very impressed with the services I have received including the phone calls and text messages with information on the status of my order. I’m also pleased to know that I can get my jewelry cleaned at the store any time at no charge. Excellent services and wonderful experience and I highly recommend this place.", "pics": null, "resp": {"time": 1550273519851, "text": "We're happy when you're happy ;)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "101942039405183691572", "name": "Rachel Lunsford", "time": 1559859600196, "rating": 5.0, "text": "Everyone was very courteous and helpful. My daughter found the perfect ring.", "pics": null, "resp": {"time": 1559918762477, "text": "Hi Rachel, Thank you for the great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "100130604771468460167", "name": "Stewart Gruenewald", "time": 1569351250971, "rating": 5.0, "text": "Friendly staff who provide top-notch service.", "pics": null, "resp": {"time": 1569353115858, "text": "Thank you for the review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "114340817033740537583", "name": "Renea NORWICK", "time": 1515106907180, "rating": 5.0, "text": "Nothing but great things to say! The staff was so professional and knowledgeable. My bracelet has been altered to cater my personality and lifestyle perfectly! Would highly recommend! Thank you!", "pics": null, "resp": {"time": 1516402098611, "text": "Thank you so much, Renea! We are so glad you stopped in and look forward to seeing you again!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "108357286485445125175", "name": "mejo MelissaJ", "time": 1534019695892, "rating": 5.0, "text": "Friendly, helpful, and knowlegeable staff. They listened to what we wanted, and advised us to help our dream ring become reality! They created a ring that is even more beautiful than we imagined!", "pics": null, "resp": {"time": 1534259870925, "text": "Hi Melissa, Thank you for allowing us to be part of your anniversary. Andrew"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "105639747337973760955", "name": "Debbie Cioletti", "time": 1479997351554, "rating": 5.0, "text": "The staff could not be more accommodating and kind. After my father' passing I brought his wedding band in so my mom could wear it as a necklace and they were so helpful. I can't wait to pick it up, along with the beautiful new chain I purchased, in a few days.", "pics": null, "resp": {"time": 1480000642825, "text": "Thanks so much, Debbie.  I'm so happy we can help.  One of the real joys of our business is selling jewelry that lasts generations, and helping jewelry do just that!\nI hope your Mom enjoys her new necklace!\nRichard Frank"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "103335433691083244145", "name": "Nanette Asarisi", "time": 1558635432565, "rating": 5.0, "text": "Goldsteins is one of my favorite stores!!!!! I love shopping there!!!!! The sales associates are fabulous!!!! The store is beautiful. The jewelry is breathtaking !!!! Everyone there is wonderful and are wanting to help in anyway they can!!!!!", "pics": null, "resp": {"time": 1558649237630, "text": "Thanks so much, Nanette!  We always love seeing you!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "118264143155330554765", "name": "Tina Ray", "time": 1558256460521, "rating": 5.0, "text": "Sales staff is always friendly and helpful. Happy with the quality of the product.", "pics": null, "resp": {"time": 1558452766750, "text": "Hi Tina, Thank you for the great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "111047358926319776588", "name": "LeNae Denson", "time": 1522929001717, "rating": 5.0, "text": "I just  picked up a ring that had lost a diamond and needed to be resized and polished.  It looks like a new ring, I couldn't be happier! Customer service there is always a Impeccable and I love the fact that they always recognize me and treat me like a queen!", "pics": null, "resp": {"time": 1522936188517, "text": "Thanks LeNae - we're happy when you're happy! Angela"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "110547412864512112381", "name": "Yashira Ojeda", "time": 1565885359304, "rating": 5.0, "text": "Awzome! Love this place very classy and professional, there fixed my broken\nbvlgari  watch  now fix perfect and work perfect  ! Thanks so much Goldstein's iam very happy!", "pics": null, "resp": {"time": 1565899373103, "text": "Thanks so much for the great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "101700001678703248995", "name": "Georgina Anyidoho", "time": 1510684279413, "rating": 1.0, "text": "I have never been treated so badly and humiliated like i was at Goldstein's! If only I knew my experience with them later will be so emotionally and mentally traumatizing, I'd have never stepped foot in that store.\nI had insisted I'd rather patronize a local business rather than purchase online contrary to what my boyfriend wanted. In the store, I chose a ring that was in the showcase. It wasn't my size so I was told they'd order one in my size, also the diamond for the ring was not kept in the store so i had to wait for over a month for it to come in store. Unfortunately my wedding was called off and so I decided to return the rings for a refund 6 days after purchase was made and three days since receiving it from the store. There is a 15 day return policy for a full refund. I was denied a full refund because as the store owner stated; \" Its bad for my business\" and offered a 50% refund instead, which i refused. I don't understand why I  should bargain for a refund I'm  entitled  to. When I insisted to be treated fairly and given my refund,the store owner  Richard Frank Jr,  made comments suggesting bias and racism against my color and country of origin.Insinuating I'm ignorant and stupid because I'm a foreigner from another country and had an accent.  I have never been treated like this in any other store environment and urge any other potential customers to beware and steer clear of this rude and racist  business. I find Goldstein's store profession and ethics to be unsatisfactory and many other reviews will state the same. Today I have formally lodged a complaint with the Mobile commerce department and will be taking Goldstein's operator Frank to court.", "pics": null, "resp": {"time": 1511366029194, "text": "It is unfortunate that we are unable to give a return on special order items."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "107909944225799530485", "name": "V Bryant", "time": 1527127068429, "rating": 5.0, "text": "My husband and I have had a relationship with Goldstein’s for more than 37 years.  Prior to that,  my husband and his family had shopped there for more than 40 years.\nTo me,  Goldstein’s is like an extension of my family.  I am ALWAYS greeted at the door with a smile and they call me by my name.  ( That is an impressive start!) Even though I consider Angela my personal shopper, all the employees are very qualified to offer their services.\nI have never been displeased with their service.  The line of products is extensive,  reputable,  and reliable.\nRichard is the best “boss man” ever!  He is very soft spoken and polite.  He knows “his stuff!”  Richard can answer any question you might have and find any\nproduct you might desire!\nAngela is such a fine and outstanding representative of Goldstein’s.  She always takes the time to ask about me and my family.  She is sincere and genuine.  Angela wants me to be happy!!  And I ALWAYS am very happy and satisfied when I leave.\nI cannot day enough about my experiences at Goldstein’s.  I highly recommend them to anyone!!  You WILL NOT BE DISSAPPOINTED!!", "pics": null, "resp": {"time": 1527201286055, "text": "Thank you, Virginia ;) We love being able to help - that's the most important part of our business!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "105431616163229894617", "name": "Phyllis Richardson", "time": 1576193984146, "rating": 4.0, "text": "They were extremely helpful and friendly!", "pics": null, "resp": {"time": 1544135942288, "text": "Phyllis Thank you for the 5 stars! Andrew"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "114669410622351911334", "name": "Suzan Bacon", "time": 1550257814088, "rating": 5.0, "text": "I needed to get two rings resized. Exceptional and quick service. Highly recommend!", "pics": null, "resp": {"time": 1550273435463, "text": "Glad we could help - thank you!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "103440101535257802783", "name": "Holly Gray", "time": 1537645597494, "rating": 5.0, "text": "If I could give Goldstein’s more stars I would! This was the first jewelers we walked into looking for a ring and will be the only jeweler we use. The staff was amazing and Angela who worked with has perfect customer service!!", "pics": null, "resp": {"time": 1537885886172, "text": "Congratulations again, Holly and thanks for the stars!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "112118400678466637355", "name": "Kipper G", "time": 1536255738329, "rating": 5.0, "text": "I brought my engagement ring in to be repaired and resized. Unfortunately, as I expected, it wasn’t in good enough condition for the process. Andrew helped me pick out a new setting for my diamond and I absolutely love it! I loved my experience at Goldstien’s and will definitely do business with them again.", "pics": null, "resp": {"time": 1536271639903, "text": "Kristina, Thank you for your kind words - Andrew"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "115975197765952088210", "name": "Ashley Anderson Zavros", "time": 1560272826277, "rating": 5.0, "text": "Great customer service...friendly atmosphere and beautiful jewelry!", "pics": null, "resp": {"time": 1560274528807, "text": "Thanks, Ashley ;) we appreciate stars!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "107036332600754719571", "name": "Jesse Schaffer", "time": 1539122680843, "rating": 5.0, "text": "Great store! Great and friendly service and sales people. Can't recommend enough!", "pics": null, "resp": {"time": 1539124672443, "text": "Thank you and congratulations!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "110486019402910827339", "name": "Brandy Fraser", "time": 1529338031952, "rating": 5.0, "text": "My family and I choose Golstein’s for our jewelry needs. The customer service, follow up, and quality product is outstanding! Thank you for the attention to detail and personalized customer service.", "pics": null, "resp": {"time": 1529374051813, "text": "Thank you very much for your kind words, Brandy!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "109506646407819996737", "name": "Ashley Ramsay-Naile", "time": 1547931297939, "rating": 5.0, "text": "Wonderful job repairing my ring! Thank you so much! ❤️Goldstein’s!", "pics": null, "resp": {"time": 1547934213072, "text": "Thanks Ashley!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "113966313041772515835", "name": "Lindsey Mitchell", "time": 1532035072908, "rating": 5.0, "text": "My husband and I had the absolute BEST experience at Goldsteins! The staff was so welcoming and treated us like family from day 1. They helped my husband step by step design my dream ring and spent countless hours with me when it came to picking out and choosing the perfect engraving for his. The Goldsteins staff is absolutely amazing we will definitely be coming to them for special events in our future!", "pics": null, "resp": {"time": 1532041195270, "text": "Thanks Lindsey, you two are part of the family-we always enjoy your visits!  Don't forget, we're located at 30.69436, -88.04305  ;)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "113031547916819915193", "name": "Thomas Walker", "time": 1543376209731, "rating": 5.0, "text": "Great upscale jewelery store with a lot of customer service. The staff is outstanding.", "pics": null, "resp": {"time": 1543430182585, "text": "So happy to have you as a new Goldstein's customer."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "101094552672697857830", "name": "Mathew Helton", "time": 1544121370336, "rating": 5.0, "text": "Excellent customer service.  Bobby was wonderful and the quality of the ring is second to none.", "pics": null, "resp": {"time": 1544122080728, "text": "Thanks so much, Mathew!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "110582295457907652398", "name": "Duston Blocker", "time": 1528929782114, "rating": 5.0, "text": "Hands down,the best jewelry gallery I have ever done business with. The staff are very gracious and helpful in finding my needs. I would highly recommend them.", "pics": null, "resp": {"time": 1528931446008, "text": "Thank you so much, Duston!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "101516247425349087222", "name": "Cindi Reedy Voice & Piano Studio", "time": 1523718115518, "rating": 5.0, "text": "I love Goldstein ‘s . Not only do I love the jewelry but the customer service is outstanding. I enjoy going into a business that greets  me sincerely and I know they can answer all my questions. If you need to get in and out quickly they can accommodate you, or if you need some time to browse you can do that also withou feeling rushed. I highly recommend Goldstein’s for your jewelry needs.", "pics": null, "resp": {"time": 1524170826817, "text": "Thank you for the great review! We love seeing you!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "105261111347262988123", "name": "Apryle Mather", "time": 1344568338347, "rating": 5.0, "text": "I had a great experience at Goldsteins!  I received an email about an annual sale.  I forwarded it to my husband and he said he would love to take me.  We went to purchase a diamond pendant for my birthday.  The sale price was so great we were able to also get a  matching diamond ring for Mother's Day.  I love my beautiful new jewelry.", "pics": null, "resp": {"time": 1502308601797, "text": "Thank you so much for sharing your experience, Apryle!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "105520774458618307778", "name": "Gregory Henry", "time": 1534163406568, "rating": 5.0, "text": "Great customer service throughout the purchase process! Will definitely shop here for future purchases.", "pics": null, "resp": {"time": 1534259821099, "text": "Hi Greg, Thank you for the kind words. Andrew"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "103887426043907651316", "name": "Samantha Thompson", "time": 1547569861833, "rating": 5.0, "text": "Always friendly and helpful. Beautiful quality jewelry.", "pics": null, "resp": {"time": 1547581412757, "text": "Thank you, Samantha!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "113695462545965873732", "name": "Leigh Wright", "time": 1543950263781, "rating": 5.0, "text": "Fantastic local jeweler. The entire staff is always extremely pleasant and helpful.", "pics": null, "resp": {"time": 1544113307532, "text": "Thank you Leigh!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "100942369152150957279", "name": "Eric and Shirley Grizzle", "time": 1545502585336, "rating": 5.0, "text": "The staff is very friendly and helpful. Loved every piece they’ve designed for me.", "pics": null, "resp": {"time": 1545518414171, "text": "Thank you two, too!  ;)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "104370704613703780930", "name": "Rachel", "time": 1540500654963, "rating": 5.0, "text": "Ask for Angela, she’s fantastic! Also, my ring was resized in less than 48 hours! Two thumbs up and five stars for Goldstein’s!", "pics": null, "resp": {"time": 1540502069758, "text": "Thank you Rachel - we appreciate it!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "109662406437002125334", "name": "Mike Edwards", "time": 1589046140931, "rating": 5.0, "text": "Always a great experience at Goldstein’s.", "pics": null, "resp": {"time": 1589054088438, "text": "So nice of you - thank you!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "113243305133745389948", "name": "Paige Chavers", "time": 1532121027915, "rating": 5.0, "text": "Angela has always taken good care of all of my needs - whether it is cleaning my rings or picking a new favorite piece of Denny Wong jewelry!!!", "pics": null, "resp": {"time": 1532125562079, "text": "Thanks Paige - you make me smile! Angela"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "109966100337005326776", "name": "Raymond Weinshenker", "time": 1347314106330, "rating": 5.0, "text": "Having lived in The Mobile area since 1973, I grew up seeing Goldstein's pretty much my entire life. My first recollection was the opulence that was the gilt heavy barred store in Bel Air Mall near the fountain. Through the years I developed an appreciation for really beautiful items.\nNot always able to afford, but always with an appreciation, I would stop in to see Richard and his wonderful team.\nFast forward to today, and I now know that affordable is available and BEST PRACTICES in customer care are the norm at my favourite jewelry store in the world.\nI love my watches and the gifts that I have purchased from Goldstein's. If you've not been, GO and ENJOY what I know to be true. THIS JEWELRY STORE IS AMAZING!", "pics": null, "resp": {"time": 1502308659470, "text": "Raymond, we appreciate your continued support throughout the years! Thank you for sharing your story with us!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "106457743660940287696", "name": "Traci Buschmann", "time": 1559303112689, "rating": 5.0, "text": "Courteous and friendly staff that goes above and beyond!", "pics": null, "resp": {"time": 1559310992646, "text": "Thank you, Traci !"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "111190682599141377308", "name": "Tommy Thomasson", "time": 1543338447968, "rating": 5.0, "text": "Don is great! Thanks Don for your help and professionalism - as always.", "pics": null, "resp": {"time": 1543360917157, "text": "Thank you, as always!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "104308032798455657099", "name": "Mary Mather", "time": 1546552898247, "rating": 5.0, "text": "Just called to ask a ring sizing  question and was  given time and great  advice!", "pics": null, "resp": {"time": 1546615371929, "text": "Thank you, Mary ;) we're here to help!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "111996922940876638377", "name": "Greg Roebuck", "time": 1524673531385, "rating": 5.0, "text": "They did a beautiful job on my Grandmothers wedding rings!! They made 98 year old rings sparkle again!! Thank you to all the staff at Goldstein!!", "pics": null, "resp": {"time": 1525469791485, "text": "Greg- we are so glad you were pleased with the results! Thank you for taking the time to leave a great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "103824644755076579463", "name": "Corey Biggs", "time": 1534982607908, "rating": 5.0, "text": "Mobile is full of family traditions. One tradition that has stood strong, across the generations, is shopping at Goldstein’s, Mobile’s oldest jewelry store since 1879.\n\nGoldstein’s has an exquisite selection of fine jewelry and watches. You can also shop for unique gifts, that is sure to please that hard-to-buy-for person in your life.\n\nWether you are purchasing diamonds and gemstones, precious metals, or gift accessories, the welcoming staff at Goldstein’s will be right there to assist you in your selection.\n\nGoldstein’s premier services include jewelry repair, custom jewelry creations, and engraving.\n\nGoldstein gives back to the community with its tradition of sharing, and support of organizations such as; The Boys and Girls club of South Alabama, and Penelope House.\n\nMy first purchase from Goldstein’s was 16 years ago with the purchase of an engagement ring.  It was the beginning of my family, as well as my tradition of shopping for family and friend at Goldstein’s.\n\nMake shopping Goldstein your tradition, as Goldstein’s makes service to you, theirs!", "pics": null, "resp": {"time": 1535034437954, "text": "Thank you, Corey, for being a part of our family tradition!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "108809566002600255816", "name": "Britney Bryan", "time": 1533066375797, "rating": 5.0, "text": "Always great customer service and always willing to go above and beyond. Love Goldsteins!", "pics": null, "resp": {"time": 1533071290060, "text": "HI Britney, Thank you for the great review!!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "114586942667084552325", "name": "Christine Conken", "time": 1560363979780, "rating": 5.0, "text": "Angela is wonderful! Goldstein's has been our family jeweler for years!!", "pics": null, "resp": {"time": 1560373360436, "text": "Thank you Christine ;) you made my day!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "113792349167395934432", "name": "Mark Langham", "time": 1537978784855, "rating": 5.0, "text": "Goldsteins did an outstanding job customizing a diamond pendant necklace for my wife...service was excellent!", "pics": null, "resp": {"time": 1538001148521, "text": "I know she's gonna love it!  Thanks so much for the review ;)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "115439207583468518106", "name": "Jermmy Farr", "time": 1525615793493, "rating": 5.0, "text": "I recently went to Goldsteins to get a mother’s day gift for my wife. As usual it was a great experience. They had a large selection and excellent service. I found the perfect gift and that’s why Goldsteins is the only jewelry store for me.", "pics": null, "resp": {"time": 1525649168703, "text": "Thank you so much, Jermmy, for the wonderful review! We really appreciate your continued support throughout the years!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "109619675205096985804", "name": "Nghia Huynh", "time": 1507678984106, "rating": 5.0, "text": "My favorite local jewelry store. Very dependable and very high quality inventory!", "pics": null, "resp": {"time": 1510784129098, "text": "Thank you, Nemo, for the kind words! We really appreciate the great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "102191721202998200113", "name": "Joshua Fields", "time": 1545708620896, "rating": 5.0, "text": "First experience here it was a good one . I will be back .", "pics": null, "resp": {"time": 1545929715946, "text": "Thanks Joshua!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "118152958816065695278", "name": "Julius Randall", "time": 1538855199467, "rating": 5.0, "text": "The staff was very friendly and professional. They did an excellent job repairing my necklace. Thank you!", "pics": null, "resp": {"time": 1539093289337, "text": "We appreciate your comments and the stars - thanks!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "109898073810633354625", "name": "Willie White", "time": 1522943212270, "rating": 5.0, "text": "The sale was a very pleasant experience. No high pressure and the ring wassized and ready earlier than  we expected.  I will return and look when I am in the  market again.", "pics": null, "resp": {"time": 1522964687282, "text": "Thank you so much, Mr White!  We love that Sharon is thrilled with her new ring.  Please don't hesitate to come by any time so we can help keep it beautiful with our free cleaning and checking.  Richard Frank"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "112994838501949517283", "name": "Richard Frank", "time": 1487288328512, "rating": 5.0, "text": "This is my business. Our rating was 4.9 until recently reviewed by someone from Utah who had never been a customer of, or visited my store. We are in Mobile Alabama and have many happy friends through the years. This was probably from a blind phone call by an instant salesman trying to sell us something we did not want or need.", "pics": null, "resp": {"time": 1505162518925, "text": "Thanks Richard!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "107399987145860055562", "name": "Kimberly Vereen", "time": 1534381181474, "rating": 5.0, "text": "They are professional they make u feel so welcome and help you with anything u need...absolutely wonderful", "pics": null, "resp": {"time": 1534429155420, "text": "Thanks Kimberly ;) We're here to help!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "109897137249576144845", "name": "Denise Hester", "time": 1536160730357, "rating": 5.0, "text": "Super helpful and very pleasant to work with.  Repair work was amazing and delivered as promised.", "pics": null, "resp": {"time": 1536162339171, "text": "Thank you, we appreciate it!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "101728404518922190024", "name": "Charles Kinard", "time": 1544891397751, "rating": 5.0, "text": "Very nice and welcoming people beautiful selections would recommend to anyone", "pics": null, "resp": {"time": 1544898098715, "text": "Thanks so much Charles.  It was our pleasure."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "102324354094366272841", "name": "Nell Gustavson", "time": 1533660247472, "rating": 5.0, "text": "Great people, great service!  They have a beautiful selection of jewelry.", "pics": null, "resp": {"time": 1533664743406, "text": "Thanks for being a great customer, Nell !"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "100549020894943784111", "name": "Robert Freeland", "time": 1547235670126, "rating": 5.0, "text": "The staff is very friendly, excellently personable, and expertly helpful. I won't shop anywhere else...", "pics": null, "resp": {"time": 1547242317870, "text": "Thanks so much!  We love great customers like you."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "112718709321357051940", "name": "Melissa Sievering", "time": 1449069184165, "rating": 5.0, "text": "Love these guys! They truly value and appreciate their customers!! I highly recommend them to everyone!", "pics": null, "resp": {"time": 1450395151393, "text": "Melissa, Thank you So Very Much for your review!  You make it fun being in business."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "114873732958100294093", "name": "PAULEBIA BELL", "time": 1536022071549, "rating": 5.0, "text": "I love the fact that Goldsteins not only has beautiful jewlery but stands behind the quality of their pieces.", "pics": null, "resp": {"time": 1536073075642, "text": "Thank you, Libby ;)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "106131589223933714426", "name": "Frank Goodwin", "time": 1529712672779, "rating": 5.0, "text": "Awesome experience once again, Steve and the manager were very helpful,  courteous,  the ladies were just as eager to assist me. Actually was the 1st time I have ever been walked to the door and Thanked again.", "pics": null, "resp": {"time": 1529762595371, "text": "We appreciate your kind words and your continued loyalty and support, Mr. Goodwin :)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "100140213629567563046", "name": "Leigh Contratto", "time": 1532108787031, "rating": 5.0, "text": "Went in with a friend to ring shop for her, came out with my ring being resized, redipped, and refreshed! The staff were amazing, patient, and not pushy at all. They helped me get my size correct, made sure I was totally happy with results and were quick to complete the job! I highly recommend anyone shopping for some bling to check out Goldsteins!", "pics": null, "resp": {"time": 1532111076371, "text": "Thank you for the review Leigh!! We appreciate it."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "115973228786520853422", "name": "Kaitlyn Parker", "time": 1348374257036, "rating": 5.0, "text": "I had a great experience with Goldsteins jewelry and will definitely go there again. They have a large selection of many top jewelry brands at good prices. The staff was extremely friendly and helpful and they listened to what I was looking for and helped me find it without being too pushy. They even were nice enough to offer to clean a ring that I did not even purchase at their store and I've never seen it as shiny and pretty as after they gave it a complimentary cleaning! They answered all my questions and were just so helpful and knew what they wet selling. They have even sent me a personal handwritten post card in the mail to see how I was liking my new bracelet I purchased and to inform me of a upcoming sale they were having. I would definitely recommend Goldsteins jewelry to everyone. They are a very nice helpful and their location is convenient. I would definitely suggest going by and giving them a visit.   I'm sure they could find what you're looking for!", "pics": null, "resp": {"time": 1502308839349, "text": "Kaitlyn, thank you for the support, and really appreciate the wonderful review. We strive to maintain our relationship with our customers!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "105685850721117155676", "name": "Dana Carthen", "time": 1546552490576, "rating": 5.0, "text": "Great customer service. I Iove the results of my wedding ring repair.", "pics": null, "resp": {"time": 1546554304122, "text": "Thanks, Dana!  I'm so glad you're happy with your ring."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "106203087924722127906", "name": "Mona Wade", "time": 1525654763116, "rating": 5.0, "text": "I love Goldstein’s, o have only been a customer three times total, but it does not matter if your spending hundreds plus, or a mere twenty two dollars, they treat you like your royalty. Angela has helped me on my two most recent visits, one just a purchase of a little over seven hundred, but she listened and understood how much that purchase met and she worked with me to make it happen in a very Speical way. Most recent I was in the store looking for a replacement chain, sterling silver for my granddaughter, who has struggles with speical needs, Angela found the perfect little affordable chain to fit our needs, and even added a little piece of chain, so she could adjust it on her neck, didn’t charge us for her quick fix of placing the small charm on the necklace, that met so much to my granddaughter, I only paid for the small chain and we were out the door, as I was leaving she offered me a water for the road. That is such wonderful service, the kind you don’t get anywhere else. That charm was left at another store for over two weeks, just to be placed on a chain, when it wasn’t ready for my granddaughter’s flight, the jewelry store had a hard time finding our ticket and never seemed to mind, because we were only spending less then fifty. If ever I spend thousands, and I hope to do that one day soon, I will spend it at Goldstein ‘s. Thank Goldstein’s for caring about the person and not the dollar amount, and a special thank you to Angela, a fine representative of the Goldstein’s name. Sincerely, Mona Wade", "pics": null, "resp": {"time": 1526243503077, "text": "Mona, everyone who walks through our door matters! We look at all of our customers as they are family! I will be sure to let Angela know that you really appreciated her help! She is a great asset to our Goldstein's family!  We look forward to seeing you again soon, thank you so much for the kind review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "102349958133060930327", "name": "Linda Kearns", "time": 1540942738782, "rating": 5.0, "text": "Staff so friendly !  Great place to shop", "pics": null, "resp": {"time": 1540998410922, "text": "We appreciate the kind words - thank you!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "107080728618707287776", "name": "Chasika Jones", "time": 1531348993561, "rating": 5.0, "text": "Excellent Customer service & high-quality selections!", "pics": null, "resp": {"time": 1531406976255, "text": "Thanks for coming in and playing in the jewelry!  Bobbie"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "115009965484704268708", "name": "ashley", "time": 1502161774987, "rating": 1.0, "text": "After researching jeweler's who specialized in custom jewelry design, my husband and I were very impressed with the reviews we read about Goldstein's. Unfortunately, our experience was nothing like the reviews.  We wanted to redesign/enhance my wedding set and explained what we were looking for. The store manager took one look at my set and informed me it would cost us more money to custom design a new wedding set using my original stones. She then proceeded to show us settings and told us if we wanted to use my diamond they could put it in one of the settings, made a \"joke\" that I could have two sets and decide which set I wanted to wear based on the outfit I was wearing. Showed us countless settings then informed us to draw a picture of what we had in mind and bring it in.  Throughout the experience, a price point was never discussed.  We feel the store manager made a judgement call on what we could afford based on my current wedding set.  Needless to say, we left feeling very disappointed.", "pics": null, "resp": {"time": 1502309582161, "text": "We apologize for your experience, Ashley, whilst an apology will regrettably not alter the outcome or your experience, I do extend it will all sincerity. It is through feedback that we are able to maintain and, when necessary, improve the service that we provide to our valued customers. Is there any way you could call us to discuss? You can reach us at 251-460-9050."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "102063764184468055335", "name": "Alan Martin", "time": 1512243717989, "rating": 5.0, "text": "Always,helpful always great services  wouldn't go anywhere else especially,for pandora", "pics": null, "resp": {"time": 1513356139866, "text": "Alan, thank you for the wonderful review! We take pride in helping others find that perfect piece!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "113468682934228782756", "name": "Wendy Bagwell", "time": 1518892527228, "rating": 5.0, "text": "Lovely, helpful people with a beautiful selection of jewelry. I'll be back. ⚘", "pics": null, "resp": {"time": 1518896947901, "text": "Thanks Wendy!  We appreciate you coming into the store and look forward to seeing you again!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "101182834178116847319", "name": "Kay Smith", "time": 1535060084657, "rating": 5.0, "text": "Love this store and always receive wonderful service!", "pics": null, "resp": {"time": 1535123806261, "text": "Thank you, we appreciate it!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "109835638305784655317", "name": "Justin Hyzak", "time": 1541275865672, "rating": 5.0, "text": "Excellent service! Prompt, kind and knowledgeable!", "pics": null, "resp": {"time": 1541604728992, "text": "We appreciate the kind words - thank you!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "100895644872010778368", "name": "Brett Herrington", "time": 1513980899439, "rating": 5.0, "text": "Love the staff. Always my go to spot when i need a gift for that some one who says they never \"need\" anything", "pics": null, "resp": {"time": 1513899686182, "text": "Brett, thank you for your review.  We really appreciate you!  Merry Christmas, Richard"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "106505790085170772363", "name": "Paul Underdown", "time": 1513533932340, "rating": 5.0, "text": "Customer service here is top priority. Locally owned and operated AND the oldest jewelry store in Alabama!", "pics": null, "resp": {"time": 1514475529223, "text": "Thank you, Paul, for the wonderful review! We strive for satisfaction!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "113582016939949688457", "name": "G Y", "time": 1534619586931, "rating": 5.0, "text": "Angela and Bobbie exceeded my expectations. Angela was so attentive and professional. Go here for your jewelry needs!", "pics": null, "resp": {"time": 1534622374738, "text": "Thank you! We aim to please ;)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "100104896510742733911", "name": "erin Murphy", "time": 1565910475782, "rating": 5.0, "text": "Excellent customer service!", "pics": null, "resp": {"time": 1565965885516, "text": "Thank you - we aim to please!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "103266351475794791928", "name": "Michael Belnap", "time": 1487003785443, "rating": 1.0, "text": "called them and said \"Hi my name is Mike, do you guys do shipping?\" he said \"I don't like your approach\" and hung up on me.", "pics": null, "resp": {"time": 1489248024617, "text": "I really don't understand this rating.  This individual is in Utah and has absolutely no connection with our business.  If we offended you, we're sorry.  However, the only way we can take payment from so far away is via credit card and beginning questions regarding if we make shipments put up a big red flag with the credit card companies.  This is no excuse for the response you received.  We do ship to known customers all over the country.  I apologize if you were offended.  Richard"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "115305423644959546239", "name": "Mary Minick", "time": 1525298442211, "rating": 5.0, "text": "My favorite Jewelry Store in Mobile. Great Staff and Angela is awesome!", "pics": null, "resp": {"time": 1525469757835, "text": "Thank you for the review, Mary! We are proud to have you as a customer!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "103613192987881097062", "name": "Ryan Williams", "time": 1523396557256, "rating": 5.0, "text": "They had just what we wanted. Very easy to deal with.", "pics": null, "resp": {"time": 1523635949734, "text": "Thank you so much, Ryan, for the excellent review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "112824837939074012319", "name": "Debra Shiver", "time": 1531258110204, "rating": 5.0, "text": "Extremely happy did excellent work", "pics": null, "resp": {"time": 1531325319383, "text": "Thanks Debra!  We're working hard to make people happy :)"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "116269141247887751443", "name": "Kelsey Bebee", "time": 1536701178130, "rating": 5.0, "text": "Always a great experience when shopping with Goldstein’s!", "pics": null, "resp": {"time": 1536763158728, "text": "Thank you Kelsey!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "117680902433023871483", "name": "Debora Jett", "time": 1567076950888, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": {"time": 1559054552639, "text": "Hi Debbie! Thank you for the 5 star review."}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "107962631159640944963", "name": "Will Halliday", "time": 1550788112316, "rating": 5.0, "text": "Great personal attention", "pics": null, "resp": {"time": 1550790694571, "text": "Thanks Will!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "107389660440733516465", "name": "David Stein", "time": 1543683550968, "rating": 5.0, "text": "Don Johnson is great", "pics": null, "resp": {"time": 1544113624072, "text": "Thanks so much David!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "105853031955318194040", "name": "Justin Taylor", "time": 1496933585868, "rating": 5.0, "text": "Great service and prices", "pics": null, "resp": {"time": 1502309496729, "text": "Thank you so much, Justin, for the wonderful review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "106309389006522002781", "name": "Bob Kelly", "time": 1545424337747, "rating": 5.0, "text": "Good pricing, friendly service", "pics": null, "resp": {"time": 1545431419352, "text": "Thank you for the kind words - we appreciate it!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "114392670438206059517", "name": "victor Wilson", "time": 1473105697771, "rating": 4.0, "text": "They've got great jewelry!", "pics": null, "resp": {"time": 1502308438794, "text": "We really appreciate the wonderful review, Victor!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "109930273916849067940", "name": "Elizabeth Zimmerman", "time": 1532709661354, "rating": 5.0, "text": "Always GREAT service!", "pics": null, "resp": {"time": 1532791356108, "text": "Thank you Elizabeth ;)  We're here to help!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "103807285006922024583", "name": "Cheryl McDOLE", "time": 1534978182905, "rating": 5.0, "text": "Angela and the staff was excellent as always", "pics": null, "resp": {"time": 1535034317162, "text": "Thank you, Cheryl & Mardye ;) we're always happy to see you and help when we can!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "115874683334591312266", "name": "Geraldine Beech", "time": 1519951926136, "rating": 5.0, "text": "Loved it", "pics": null, "resp": {"time": 1520171216223, "text": "Thank you so much, Geraldine!  Richard Frank"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "106912437117020819081", "name": "Mark Ivy", "time": 1509242084932, "rating": 4.0, "text": "Nice People", "pics": null, "resp": {"time": 1510784155991, "text": "Mark, thank you for taking the time out to give us a great review!"}, "gmap_id": "0x889bb2e9729a0087:0x3b57e7b9a8170a7e"}
{"user_id": "102840917491943455967", "name": "Nicole T. Springer", "time": 1623785001761, "rating": 5.0, "text": "I was blown away by the customer service at Hudson-Poole. We came in to look at engagement rings on a Saturday about 30 minutes from closing, and the staff were incredible. I told them what I liked and my budget and they were able to help us find ones that fit what we wanted. The store is immaculate, and you can tell they truly want each customer to have a great and personalized experience. They were never pushy or looking to push us past our price point at all. Incredibly patient and just a fantastic experience all around. Highly recommend!!!", "pics": null, "resp": {"time": 1623786577473, "text": "WOW!!! Thank you so much, Nicole. It means so much to us that you took the time to share this. Please come back by to see us whenever you are close. We wish you both many blessings! Sincerely, John Poole"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "107296317123960819462", "name": "Andy Love", "time": 1622423661018, "rating": 5.0, "text": "The reviews here don’t lie.. excellent customer services! My name is Holly . I have visited the store to redesign a band for my diamond ring that I’ve had for a long time but not liking the style too much.\nThey drawer up a beautiful fancy computer graphics design of the ring base on details I want with measurements of all angle... and even provided me a wax version of the band to try on.. and everything is free of charge.. isn’t that Amazing 💕\nBut I later have decided of not to go with it because my sister like the original ring and wanted to purchase the ring from me..\nI felt bad to have them working so hard for me for nothing so I also purchased a beautiful pair of diamonds and citrine earring before I left the store just to thank you for their service ❤️\nLove them ❤️The best in town", "pics": null, "resp": {"time": 1623264507107, "text": "Holly, you are so sweet to take the time to write this incredible review!!! We love making custom pieces with family stones. That is what makes jewelry so special, the ones that can tell the story of the family and their journey. I am so glad that your sister will be enjoying that ring. Please let us know if we can help in the future. We wish you many blessings!!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "117350028610106512423", "name": "William Curry", "time": 1598721848510, "rating": 5.0, "text": "John and his staff are exceptional. The customer service at Hudson and Poole is great. When you walk in they greet you with a smile. Ten years ago, I purchased my wife’s engagement ring here because of their wonderful reputation. With help from Krista, I got the perfect ring (All of the 4Cs) for my wife. Thanks a million.", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "117351862295956355892", "name": "Benjamin Brown", "time": 1619587010291, "rating": 2.0, "text": "Very helpful and friendly staff, but the appraiser is incompetent. Don't waste your money getting your jewelry appraised here.", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "107032905048015366439", "name": "Honor Able", "time": 1609119798674, "rating": 5.0, "text": "I went there a year ago to get my sons name engraved on his necklace. They were very welcoming from the moment you walk in to the moment you walk out", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "115747766640828650812", "name": "Jamie lou Purser", "time": 1620871628132, "rating": 5.0, "text": "Very elegant store and friendly stafr", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "114510474672914380938", "name": "Shane Gardner", "time": 1560297695315, "rating": 5.0, "text": "Awesome jewelry and great service and the best book/do it all keeper ever 👍", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOfcFqFYjCpLexESgb_PywkpBBJ18WMjpP-qMka=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNaD7Ykw7W1Qod9XCBEO1P_rsTsV6vpwstmeSyp=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "118280183950205508913", "name": "Holly Ha†cher", "time": 1605207485521, "rating": 5.0, "text": "Super helpful people! Always beautiful jewelry!", "pics": null, "resp": {"time": 1615059708821, "text": "Holly, thank you so much for your kind words about our wonderful staff. We sincerely appreciate you for the time you took to give us this review!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "110563337074084001164", "name": "Jeffrey (Jeff) Muratori", "time": 1593463855769, "rating": 5.0, "text": "Great service with a friendly environment! Will definitely be going back!", "pics": null, "resp": {"time": 1593708453700, "text": "Thank you so much for the 5 star review, Jeffrey!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "108733920621680911075", "name": "Ashley “Kav” Kavanagh", "time": 1571781729088, "rating": 5.0, "text": "Incredibly helpful staff! They appraised and cleaned my antique and new jewelry and were very intrigued by a few pieces discussing with me all the details they could tell me. Definitely will be returning for future cleanings and hopefully purchases as well!", "pics": null, "resp": {"time": 1574288372217, "text": "Ashley, we thank you so much for taking the time to give us this great review and for the five stars! Come by anytime and have a great day."}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "106995639145196031562", "name": "James Waltman", "time": 1576273384600, "rating": 5.0, "text": "Wonderful collection of jewelry and other great gift ideas. The staff is knowledgeable and attentive. Hudson-Poole Fine Jewelers is the ONLY place i shop for my fine jewelry needs.", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "110764751778668080850", "name": "Junea Childers", "time": 1582902601570, "rating": 1.0, "text": "Traveled 108 miles getting there. Called before I went. Told them I was bringing a 1954 Gibson Mandolin. However when I got there. I was being checked in by a nice counter clerk, when all of the sudden a young man came out and abruptly rushed me out saying \"there was no market for instruments\". When in their TV ad they had promoted a variety of items they were accepting. Instruments included.", "pics": null, "resp": {"time": 1582911875323, "text": "Junea,\nI am so sorry that you took your time to come to our store and not get a good answer. This is the first time we have partnered with a buying group that does the variety that they do. I wish the young man had asked me or my father who in town deals in fine instruments. I have a wonderful referral for you, as we have already called one of the owners that would very much like to make an offer on your mandolin. Please contact Dan at the Guitar Gallery. Here is their website:\nhttps://theguitargallery.com\n\nWe really hope that this works out, and we will  always be here to help in any of your jewelry needs if you can give us another chance.\nSincerely,\nJohn Poole\nVice-President"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "113812551471418721094", "name": "Luke Remmert", "time": 1592952095130, "rating": 5.0, "text": "Simply the best jeweler in town. No need to go anywhere else.", "pics": null, "resp": {"time": 1593708521582, "text": "We really appreciate you giving us such a wonderful review, Luke!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "105519286227316234336", "name": "Andrew Durham", "time": 1554498396668, "rating": 5.0, "text": "I’m not sure where to start to explain how happy and satisifed I am with Hudson Poole. I walked in and met Heather, and from the second I met her I felt so comfortable and like I knew her. Mrs. Jamie Poole shortly also assisted me. Mrs. Poole was absolutely wonderful. She respected my opinions, she walked me through a step in life that I am new to. Hudson Poole has my business for life. Generally, going into a fine jewelry store is a very overwhelming experience as generally the staff doesn’t open up and welcome. These folks made me feel like family. Thank you Hudson Poole for being so amazing!", "pics": null, "resp": {"time": 1554576866565, "text": "Jake, thank you so much for this incredible review!! We are extremely proud and humbled that you have chosen us to be your family jeweler, and we work very hard to keep your trust."}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "111431523859423106816", "name": "Happy Lady", "time": 1565455846889, "rating": 5.0, "text": "First I would like to say thank John for doing a fantastic job with my ring. John went above and beyond to work with me. Everyone at Hudson Poole always makes me feel welcome. I will use Hudson Poole forever. The way I can custom do jewelry makes me so excited!", "pics": null, "resp": {"time": 1565633530945, "text": "WOW! This is an amazing review! Thank you so much!!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "103573636998049955244", "name": "caroline staggers", "time": 1579919307031, "rating": 5.0, "text": "Always very friendly, professional and helpful. Beautiful selection of jewelry and gifts. Do great repair work.", "pics": null, "resp": {"time": 1580940359105, "text": "Caroline, Thank you very much for this great review. We really appreciate you coming by to see us!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "117702128409677360351", "name": "Peony", "time": 1547659017469, "rating": 5.0, "text": "I spent a long time searching for a strong but delicate-looking die-struck (not cast) setting for the stones from my old broken down three-stone ring. Krista and staff helped me find the perfect setting. I drove hours to Tuscaloosa and back several times (past plenty of other jewelry stores) to get the prettiest ring and best customer service. Everyone at Hudson-Poole is responsive and so helpful--in person, by phone, text and email. The long trip was absolutely worth it!", "pics": null, "resp": {"time": 1548083738795, "text": "Wow! Thank you so much for giving us this wonderful review! We appreciate you trusting us to reset your three stone ring. Please come by anytime for us to clean and check it."}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "103103135690064321759", "name": "Jeremey Newell", "time": 1574366607261, "rating": 5.0, "text": "I had a very special wedding band sized down. I took it home and noticed it didn’t fit as well as I thought. This was a mistake that I personally made. It had nothing to do with the quality of work that Hudson-Poole provides. I went back to Hudson-Poole and asked them to resize again. Not only did they resize, but they did it at no additional costs. They said my satisfaction was their goal. Excellent customer care. They will definitely handle all of my fine jewelry business in the future.", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "110258603590792638509", "name": "Emily DeFrance", "time": 1581116255637, "rating": 5.0, "text": "Their jewelry is exquisite and there are so many beautiful choices. The customer service is excellent and you feel like family when you are there.", "pics": null, "resp": {"time": 1593724366142, "text": "Emily, thank you for coming to see us and for the excellent review. We will work hard to make sure it stays this way and for anyone you send to us. I am so sorry for the late \"thank you\". Have a wonderful 4th of July!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "116495680950984976137", "name": "Vivian Tant", "time": 1539887491858, "rating": 5.0, "text": "Gene and his staff are phenomenal. You immediately feel at home when you walk through the door. Gene and John both did a fantastic job of helping me pick out my wedding band and my future husbands wedding band. They talked me through the whole process, and I left feeling like I knew exactly what I was getting and how important I was to their company. I will forever send anyone looking for jewelry to them! Thankful for such a wonderful company in our community!", "pics": null, "resp": {"time": 1539910691172, "text": "Vivian, thank you so much for this phenomenal review! We appreciate you letting us be the ones to help you with your wedding bands and we will continue to work hard to keep that trust to be your family jeweler."}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "115986051540477936163", "name": "George Jacob Houghtaling", "time": 1541520023402, "rating": 5.0, "text": "The BEST jewelry store in Alabama!  The BEST customer service in Alabama!  The BEST prices in Alabama!  You get the idea?  I have been doing business here over 12 years and never have been disappointed.  Gene, Jamie, John, Krista and their outstanding staff are true professionals.", "pics": null, "resp": {"time": 1541560796209, "text": "Thank you so much for this awesome review, George!!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "108235948090409702562", "name": "Leanne Phillips Mays", "time": 1558034643159, "rating": 5.0, "text": "I just purchased my garnet and diamond \"Roll Tide\" ring from out of state. I originally saw this ring on Pinterest several years ago, and have spent many nights stressing that they would discontinue it before I could buy it. Ashley took care of me with the most professional and caring manner. My ring arrived today, and it is worth every penny. Thank you for helping my dream piece of jewelry become a reality.", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "101475650864451585974", "name": "Susie Palmer", "time": 1579823033272, "rating": 5.0, "text": "Always very friendly staff.  Always.\nI brought a box-chain necklace back, which I had bought from there.  It broke as I was cleaning it.\nThey repaired it on my visit and I walked out with it.\nNot too mention, they also helped me a with watch band adjustment (not bought from them). Noncharge.  Simply a complimentary service.\nThat's why I will wait, until a trip back to Alabama from Oklahoma, just to go by Hidson-Poole.  They always treat me well.\nThank you!  :)", "pics": null, "resp": {"time": 1580940451456, "text": "Thank you so much, Susie. I cannot thank you enough for taking the time to give us this great review. We hope to see you the next time you are back in Tuscaloosa."}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "111162890384266343559", "name": "Kathleen Stein", "time": 1568758809605, "rating": 5.0, "text": "They did a great job fixing my bracelet. Their price for the repair was very affordable and the customer service was great!", "pics": null, "resp": {"time": 1568818255539, "text": "Wow! Thank you very much, Kathleen!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "107539723727003357535", "name": "Christien Hawthorne", "time": 1501733100263, "rating": 5.0, "text": "I am absolutely in LOVE with my ring! I ordered it online and the next day received a call from John Poole who is the Vice President of the company. He told me that unfortunately the ring was out of stock but that he had already contacted the designer in New York to have them build a new one which would only take about two weeks. Sure enough, I later received another call from Mr. Poole notifying me that my ring was ready and that he would set up email alerts for the shipping so I could track the package. It arrived in a cute little wrapped box with a big bow and had a business card that was personally signed. Loved the personal touch. Awesome experience -- will definitely recommend to others!", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "106532673847811787187", "name": "HRH METALS", "time": 1576153583838, "rating": 5.0, "text": "Very nice people/helpful/nice large place/probably have what you need or want", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "116571530714155751744", "name": "Barbara Nicosia", "time": 1557426698885, "rating": 5.0, "text": "I left 2 pairs of earrings to be fixed.  When they called & gave me the price, I said just fix one, the other one’s too expensive for its worth.  When I picked them up, Mr. Poole told me they had fixed both of them, & he wasn’t going to charge me for the 2nd pair since it was their mistake.  So nice to find honest, reputable merchants still around!", "pics": null, "resp": {"time": 1557460659599, "text": "We really appreciate the five star rating and for this wonderful review, Barbara! Please let us know if there is anything else we can do for you."}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "103134629439879169911", "name": "Sammy Gray", "time": 1545517036403, "rating": 5.0, "text": "Exceptional service! Very courteous, and everyone went out of their way to help with all our needs. As a first time customer, I've definately found my new primary jeweler for future purchases!", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "108856045402691992469", "name": "Brittany Graham", "time": 1525141226070, "rating": 5.0, "text": "Hudson-Poole is a fantastic Place to purchase jewelry. Not only do they have an outstanding selection of merchandise that is all very different and can suit anyone’s taste, their customer service is out of this world. I will continue to shop from them, even though I am not a local, because of those two things.\n\nThey care about their customers, they have a fantastic selection, and you can tell that they care about you as a person and not just getting business from you. That, to me,  is everything. You can’t go wrong with this place! :-)", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "116060001029842830857", "name": "Kristy H", "time": 1535745297288, "rating": 5.0, "text": "Big thanks to John for taking such great care of all my needs and wants. I highly recommend this company if you are looking for your next piece of jewelry! Thanks again for being so kind and taking care of me.", "pics": null, "resp": {"time": 1536151793798, "text": "Thank you so much for giving us another chance and for this wonderful review!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "114355777483800043729", "name": "Hannah George", "time": 1528813853496, "rating": 5.0, "text": "A great jewelry shop with unique merchandise good for anyone's taste! Also, incredible customer service. The workers will spend time with you to suit your needs. When my ring I had bought a month ago began to lose color, Hudson-Poole replaced it without any charge. I cannot speak highly enough on how wonderful this place is!!", "pics": null, "resp": {"time": 1528903694999, "text": "Thank you so much for this wonderful review, Hannah! We thank you for coming back to see us to let us get it right."}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "110448095487165639586", "name": "Julia Clark", "time": 1530124933289, "rating": 5.0, "text": "Hudson Poole is full of some of the kindest staff members. I truly feel the people here look out for their customers best interests. A big thank you to John Poole for helping me get the necklace of my dreams in the metal color that I preferred. It's even better than I had envisioned and I cannot thank you enough.", "pics": null, "resp": {"time": 1530387983773, "text": "We are blown away by your wonderful review, Julia. Thank you so much for your time and thought that you put into it!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "116469666190143131819", "name": "Camille Robinson", "time": 1532631632028, "rating": 5.0, "text": "Very few jewelers have all the qualities I need in meeting my expectations for superior quality merchandise, customer service and custom pieces.  Hudson-Poole Fine Jewelers makes my “A List”.\nI have purchased and had custom pieces made by Hudson-Poole for many years.  In fact, I am working with John Poole now on a new custom ring.  If you are looking for a professional jeweler, visit Hudson-Poole in Tuscaloosa,Alabama.\n\nCamille Ogden Robinson", "pics": null, "resp": {"time": 1532700951037, "text": "Thank you so much for taking the time to give us such a great review, Camille!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "109302358461058304104", "name": "joseph ushe", "time": 1582046101671, "rating": 5.0, "text": "First class, actual people who want to Help you and make sure you are happy! I will be back again!", "pics": null, "resp": {"time": 1593724164755, "text": "Thank you so much for this great review, Joseph!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "107959100932389356402", "name": "Natalia Go", "time": 1504924742532, "rating": 5.0, "text": "If I could give a 10 star out of 5, I would! Hudson-Poole saved my wedding day! This is probably the best jewelry store I every walked into. My fiancee and I don't have a big budget for our wedding and we needed something that we could afford. Ashley was there with us every step of the way, making sure that we get the rings we want and that we stay on budget. She is a hero! Plus, they offer services for maintenance and repairs, some for free. I definitely love Hudson-Poole <3 This will be the first place I would go to for any piece of jewelry.", "pics": null, "resp": {"time": 1505326978720, "text": "Natalia,\nI read your review and was blown away! Thank you so much for taking the time to give us such a great testimonial. I spoke with Ashley and Tanner and we all truly appreciate you both thinking of us for your wedding rings.  We will do all we can to continue to be your family jeweler. The next time you are by the store I would really like to thank you in person, so please ask for me when you do. I wish you many blessings and Godspeed in all of your hopes and dreams together.\nSincerely,\nJohn Poole\nVice President"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "109348290021818579008", "name": "Connie Harris", "time": 1573249375060, "rating": 5.0, "text": "The girls that helped me were very kind and helpful.", "pics": null, "resp": {"time": 1574288222765, "text": "Thank you so much, Connie, for this five star review!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "114222884154225627591", "name": "Kaitie Brihn", "time": 1592352790669, "rating": 5.0, "text": "Everyone was very nice and helpful!", "pics": null, "resp": {"time": 1592417764823, "text": "Katie, thank you so much for stopping by and for this great review!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "110142520514842479547", "name": "Patterson \"Patt\" Howard", "time": 1527717532833, "rating": 5.0, "text": "Such a lovely buying experience at Hudson-Poole today. I felt well advised, knowledgeable staff and a very fair price on a lovely set of pearls for our mother. We will shop again with this store.", "pics": null, "resp": {"time": 1528903934495, "text": "Thank you very much for your kind words, Patt. We hope that we can continue to go above and beyond on our service to remain your family jeweler."}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "116179168599367278284", "name": "Marsha McAllister", "time": 1524602733626, "rating": 5.0, "text": "I would give Hudson Poole more than 5 stars if I could. All the employees are nice and knowledgeable. And the customer service is great. Repairs are timely.", "pics": null, "resp": {"time": 1524661518729, "text": "Thank you so much for the wonderful review! Also,  thank you for thinking of us for your jewelry repair needs."}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "108161426597633641220", "name": "Kayla Fleischer", "time": 1510778680061, "rating": 5.0, "text": "Absolutely stunning! The staff was more than courteous and delightful! They take the time to answer all your questions and really help you find that right piece. In love!", "pics": null, "resp": {"time": 1510802952442, "text": "Kayla, thank you so much for taking the time to give us this fantastic review! We truly appreciate it. Let us know if there is anything we can do for you."}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "107626960940596367380", "name": "Vicki Baggett", "time": 1501528278814, "rating": 5.0, "text": "I love supporting local family owned businesses and Hudson Poole Fine Jewelers makes this so easy for me. They always treat me like family and go above and beyond to meet my needs. Whether I'm needing a gift, making a big purchase, or only getting a repair done they are always so eager to assist me any way they can.", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "101073090208191667037", "name": "Andrew Todd", "time": 1508271601929, "rating": 5.0, "text": "I came in to have an additional appraisal performed for an engagement ring that I purchased for my girlfriend. They looked at the stone recommended revising the language of the existing appraisal rather than having a second appraisal performed. They extended the highest-quality service to me, even though the recommendation resulted in me not making a purchase today. I will use them for all my jewelry needs in Tuscaloosa!", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "108159466827093759158", "name": "Caroline Shines", "time": 1568067314231, "rating": 5.0, "text": "This is my number 1 place everything is beautiful", "pics": null, "resp": {"time": 1568206631918, "text": "Thank you so much for this wonderful review, Caroline! You make our day every time we see you!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "109548024974882208588", "name": "Heather Reeves", "time": 1501278318686, "rating": 5.0, "text": "Rachel is one of the sweetest, genuine people to assist people with jewelry purchases.  Ale is very honest and informed. Her trustworthiness is impressive which will always bring customers back.", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "109653510138635162442", "name": "Willie Aaron", "time": 1479853339813, "rating": 5.0, "text": "I have been doing business with this company for several now and each time it has been a class act. Mr. and Mrs. Poole have been wonderful to deal with. Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "102409815565825664003", "name": "Alwyn Protheroe", "time": 1529085357612, "rating": 5.0, "text": "Yet another shot of excellent service ! ! !\nHaving dealt with Hudson Pool for several, several years, with John in particular, I can say that not one time have I had ANY cause to complain about the service I have had, they are people who will go out of their way to help you.", "pics": null, "resp": {"time": 1529330859877, "text": "Alwyn, thank you so much for writing such a fantastic review for our store. We thank you for always thinking of us!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "104884040247340051400", "name": "Angelique Dean", "time": 1500309324619, "rating": 5.0, "text": "The staff at Hudson-Poole are always so helpful and kind! I get the best service from them whether I'm purchasing jewelry or just getting my ring cleaned!", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "117807460163069881737", "name": "Robert Bulson", "time": 1534212357765, "rating": 5.0, "text": "First class place of business. Very friendly and helpful employees.", "pics": null, "resp": {"time": 1534251795693, "text": "We are very thankful that you have been shopping with us. Thank you so much for the fantastic review!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "102051590123251870876", "name": "Rachel Willis", "time": 1540579954984, "rating": 5.0, "text": "Very helpful and friendly employees! Coming to Hudson-Poole is always a pleasant experience!", "pics": null, "resp": {"time": 1540652770407, "text": "Thank you for this great review, Rachel. We really appreciate you coming to see us!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "115431539665837008079", "name": "Dana Micael", "time": 1537801960376, "rating": 5.0, "text": "This is the place to go if you need jewelry or any help with current pieces! The staff is incredibly kind and are always welcoming to my husband and I. John Poole is the best at what he does!", "pics": null, "resp": {"time": 1537880054581, "text": "I cannot thank you enough for this fantastic review, Dana. Thank you both so much for your trust. This made my day! Sincerely, John Poole"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "113372761949281564662", "name": "Tristen Larson", "time": 1495070821657, "rating": 5.0, "text": "Very kind and helpful employees! Went in to get my glasses repaired, they were very efficient.", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "107976694110059338274", "name": "Nikki Little", "time": 1500739703121, "rating": 5.0, "text": "Very helpful picking out my finances wedding band! Thank you Tanner for your time and friendly service!", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "116555167969533640495", "name": "steve stay", "time": 1513057284287, "rating": 5.0, "text": "Knowledgeable, friendly and very experienced people at Hudson-Poole! Go here and you can't go wrong!", "pics": null, "resp": {"time": 1516115352500, "text": "Thank you for your time and for the great review, Steve!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "118232861291636759877", "name": "Anne Boyd", "time": 1501172695608, "rating": 5.0, "text": "The staff are incredibly kind, genuine, and very skilled! Thank you for fixing my necklace so well and so quickly!", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "106152584416759832823", "name": "Steven (Trent) Harris", "time": 1541021234176, "rating": 5.0, "text": "Very friendly service and has a good selection of pandora products", "pics": null, "resp": {"time": 1541106278978, "text": "We really appreciate you coming to us, Trent. Thank you very much for this wonderful review."}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "109616743056183460079", "name": "Danielle C", "time": 1510849701580, "rating": 5.0, "text": "For 24 years as a customer, they never cease to amaze me with their quality service and how they treat everyone like family!", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "108648102612582758802", "name": "Insert Yourname", "time": 1534966432325, "rating": 5.0, "text": "Hudson-Poole is a very nice store with great employees. Everyone we have dealt with has been very friendly.", "pics": null, "resp": {"time": 1536151825421, "text": "Mark, Thank you for taking the time to give us this great review."}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "107707029844496958533", "name": "David Slowikowski", "time": 1529178658477, "rating": 5.0, "text": "Always such expertise, selection and professionalism at Hudson-Poole!  Hands down, our favorite jeweler.", "pics": null, "resp": {"time": 1529330800548, "text": "Thank you so much for taking the time to give us a wonderful review, David!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "116685232567775932080", "name": "Laurie Wright", "time": 1497374629756, "rating": 5.0, "text": "Great people and great service!  Trust/integrity/knowledge-exactly what a jeweler should be.", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "116500246183212865443", "name": "Rebecca Fleisig", "time": 1513117618489, "rating": 5.0, "text": "They are so helpful and kind!! The only jeweler I go to in Tuscaloosa or Birmingham. Cannot sing praise high enough!", "pics": null, "resp": {"time": 1516115242061, "text": "Rebecca, thank you so much for taking the time to give us such a great review. We truly appreciate the opportunity you gave us to help you with your jewelry needs."}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "116234217029370777335", "name": "james ray", "time": 1545517188043, "rating": 5.0, "text": "Nice selection of Pandora and higher end jewelry.", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "108902225436843437066", "name": "Anna Katherine Geiger", "time": 1501012742279, "rating": 5.0, "text": "The staff is always very polite and helpful when I call or go to the store!", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "102117404463424167420", "name": "Brenda Randall", "time": 1415224761143, "rating": 5.0, "text": "Hudson Poole, under the expert leadership of Gene Poole, has always been very kind and gracious in donating beautiful door prizes for community fundraiser events, in particular the Women's Chamber and Homebuilders. Their gift is always the most sought after item!  Aside from being generous, they also have a very accomodating and considerate staff and a great display of jewelry and gift items.  Thanks so much for doing what you do for everyone in the Tuscaloosa area!", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "115972527892629297793", "name": "Brett Jenkins", "time": 1515872245308, "rating": 5.0, "text": "Amazing selection. Knowledgeable and friendly staff.", "pics": null, "resp": {"time": 1516115117607, "text": "Thank you so much for this wonderful review!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "106274413988582485690", "name": "David Martin", "time": 1503709095921, "rating": 5.0, "text": "Very helpful employees here. Nice jewelry.", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "113041559037049974687", "name": "Paul Smith", "time": 1565473270101, "rating": 5.0, "text": "Super nice people.", "pics": null, "resp": {"time": 1565633461509, "text": "Thank you so much for this great review, Paul!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "115972697703407323859", "name": "Callie Rhodes Outlaw", "time": 1524439252132, "rating": 5.0, "text": "Trusted source for jewelry repair, friendly service, great selection, locally owned. I always go here first!", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "105697180237725931575", "name": "Michael Calup Snider", "time": 1500739734512, "rating": 5.0, "text": "Tanner took all the pain and hesitancy over selecting a ring out of the process.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "100035935270849690551", "name": "Megan Walsh", "time": 1493742313803, "rating": 5.0, "text": "Hudson Poole always provides excellent service! They are my family's go-to place for gifts and jewelry.", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "107909308060370095906", "name": "Joe Gosa", "time": 1579817198662, "rating": 5.0, "text": "Courteous and trustworthy.", "pics": null, "resp": {"time": 1580940504548, "text": "Joe, thank you so much for this 5 star review and for the kind words about our great staff. Please come by anytime."}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "104133918078158675840", "name": "Keith Bradley", "time": 1501253150193, "rating": 5.0, "text": "Everyone is always extremely profesaional and courteous.", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "104067183955510141289", "name": "Scott Shepherd", "time": 1495058828742, "rating": 5.0, "text": "Always friendly! Great selection!", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "103393149990089813039", "name": "Connie Grechanik", "time": 1581182611234, "rating": 5.0, "text": "My favorite jeweler!!", "pics": null, "resp": {"time": 1593724242376, "text": "We truly appreciate this 5 star review and the kind words!!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "118053323389076762739", "name": "Adam Sealy", "time": 1574096905691, "rating": 5.0, "text": "Great place to do business!!!!", "pics": null, "resp": {"time": 1574288147088, "text": "Adam, we really appreciate you taking the time to give us a wonderful review."}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "114983538542779299010", "name": "Monica Culmer", "time": 1577559722722, "rating": 5.0, "text": "Customers  service number", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "102590565632504306760", "name": "Patricia Pritchett", "time": 1554312304646, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1554576895139, "text": "Thank you very much Patricia for this 5 star review!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "102630424830810188034", "name": "Ca Skinner", "time": 1533683283402, "rating": 5.0, "text": "These folks are THE BEST!", "pics": null, "resp": {"time": 1530388005731, "text": "Thank you very much for the five star review!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "110504910061610989560", "name": "Stephaine Buffaloe", "time": 1482237922386, "rating": 5.0, "text": "Beautiful items, locally owned by great staff!", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "116631117398423475179", "name": "La ne", "time": 1500062105087, "rating": 5.0, "text": "Great prices and service", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "116546312275559266414", "name": "Debbie Cierocke", "time": 1547005501927, "rating": 5.0, "text": "Very friendly", "pics": null, "resp": {"time": 1547044755288, "text": "Thank you so much for coming to see us and for this wonderful review, Debbie! We wish you many blessings in 2019. Please let us know if there is anything we can do for you."}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "104975796021878274945", "name": "Cheryl Lynn", "time": 1544243097690, "rating": 5.0, "text": "Good", "pics": null, "resp": {"time": 1544286158683, "text": "Thank you so much for the 5 star review, Cheryl!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "107732020678631071650", "name": "Andrew Kuhl", "time": 1537044866511, "rating": 5.0, "text": "Had a wonderful experience", "pics": null, "resp": {"time": 1537880123391, "text": "Thank you for taking the time to give us a review, Andrew. We will do our best to make sure that it is a five star visit every time."}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "103933087263204247836", "name": "Lakeisha Shepherd", "time": 1529049961196, "rating": 5.0, "text": "The Best Jewerly", "pics": null, "resp": {"time": 1529084212797, "text": "Lakeisha, thank you so much for coming to see us and for the wonderful review!"}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "117654766782531718314", "name": "Ben Carithers", "time": 1511051552880, "rating": 5.0, "text": "Really friendly people & helpful!!!", "pics": null, "resp": {"time": 1512232261185, "text": "Ben, thank you so much for the wonderful review! Please let us know if we can help with anything. Have a wonderful weekend."}, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "115478922754819592787", "name": "Alaca Averette", "time": 1498860306127, "rating": 5.0, "text": "Excellent customer service!!!!!!!  Very pleased with the personal service I experienced!!!!!  I will be sure to use them in the future!!!", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "110648794521715005200", "name": "Ryne Chandler", "time": 1460678787746, "rating": 5.0, "text": "This is the best jewelry store in Tuscaloosa.", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
{"user_id": "110826812874615679585", "name": "Cory Stevens", "time": 1462380638728, "rating": 5.0, "text": "Wonderful staff. Honest, personal, friendly, and helpful.", "pics": null, "resp": null, "gmap_id": "0x888602ee680afd11:0x20630562e2186665"}
