{"user_id": "118440893648343615222", "name": "Butch W.", "time": 1489091180761, "rating": 5.0, "text": "It's great", "pics": null, "resp": null, "gmap_id": "0x889a4b10ecc2892d:0x5cf2921af9e67b94"}
{"user_id": "106968681323766700999", "name": "Grant", "time": 1628547100474, "rating": 5.0, "text": "oops", "pics": null, "resp": null, "gmap_id": "0x888902b17d851fd3:0xdd3551f4aa93902d"}
{"user_id": "114332564855868269820", "name": "Hillandale Zoo", "time": 1608248472921, "rating": 1.0, "text": "So waited all day for someone to actually come out and give me a quote. Super glad I took a vacation day to sit here all day for no one to show up or even call to reschedule. Would not recommend for anything!!! Guess I will try again and maybe someone will want to actually earn my business. Good luck if you want to continue with Brown’s.", "pics": null, "resp": {"time": 1626732101225, "text": "Thank you for your feedback. There must have been a miscommunication with scheduling. We never received a notice. I too, am glad that you didn't take a vacation day to sit and wait. During the height of a pandemic, when the demand is so high for Generators, we are sorry that we missed an opportunity to give you a consultation. Have a great day."}, "gmap_id": "0x888902b17d851fd3:0xdd3551f4aa93902d"}
{"user_id": "100895984060236927650", "name": "Kim Johnson", "time": 1601061653378, "rating": 5.0, "text": "I would highly recommended Brown's Electrical. Due to Covid-19, First, I like to start off by saying that I was extremely impresses with Brown's Electrical because all of the custom commercial grade PPE every employees wore. They even wore shoe covers which I really appreciated. They arrived on time. They were did not take a break. They worked straight through the entire job. It was fantastic to see that they worked every minute until the finish the entire job.\n\nMy dad was super please. They gave us a great price and cleanup all the debris when they were done. The service was excellent. Timely and professional. In future, this is the only electrical company, I would contact. Everything we asked from our estimate was completed and was excellent. We were more than pleased with the efforts and performance of the two electricians as well as the final results.\nWe have been extremely satisfied with the cost and results. Brown's Electrical employees were well-qualified and professional. I would highly recommend them for any residential service.", "pics": null, "resp": null, "gmap_id": "0x888902b17d851fd3:0xdd3551f4aa93902d"}
{"user_id": "118047783427872239083", "name": "Raymond Miller", "time": 1593634423275, "rating": 5.0, "text": "Very punctual and professional. They completed the job in a timely manner.  I recommend this company for indoor and outdoor pot lights.  I'm a satisfied customer.", "pics": null, "resp": null, "gmap_id": "0x888902b17d851fd3:0xdd3551f4aa93902d"}
{"user_id": "106973267423509467697", "name": "Beverly Craft", "time": 1574477037512, "rating": 5.0, "text": "Made us comfortable throughout process. Very professional and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x888902b17d851fd3:0xdd3551f4aa93902d"}
{"user_id": "111695986555658740339", "name": "All En", "time": 1566483897143, "rating": 5.0, "text": "Product is outstanding, Generac brand is top of the line.", "pics": null, "resp": null, "gmap_id": "0x888902b17d851fd3:0xdd3551f4aa93902d"}
{"user_id": "111724864696762019427", "name": "Carl Jernigan", "time": 1621397056382, "rating": 5.0, "text": "Can't say enough about the customer service i received. I brought my RV motorhome for service on my generator fuel line. I needèd repairs done within a week for trip i was about to take. No one else would even look at it. Not only did they replace the fuel line but i also needed new shocks which i purchased and they installed them no problem and gave me recommendations on other stuff that needed fixing which i took care of also. Great staff and professional work. A++", "pics": null, "resp": {"time": 1621439693561, "text": "Thank you for the glowing recommendation. We appreciate you!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "109748375907729808742", "name": "Taylar TLC", "time": 1610423196930, "rating": 3.0, "text": "This is an update to my original review upon receiving a call and efforts to make it right from Marc the Service Manager.  As you all know, many businesses won't even take the time to contact a lost customer.  Marc not only reached out but followed up with us to confirm we were taken care of, even though we had to pull our truck.  He made no excuses and stated that the communication errors were taken seriously and will be addressed.  Ultimately our repair had to been completed elsewhere but Williams still followed up and showed accountability.  I would be comfortable continuing to use W.W. Williams as I have at various locations.  However, I would advise that you seek assistance from Management if communication is lacking.  I wish we had done so sooner.\n\nBe aware that every experience isn't the same.  We had a truck towed in to this location due to the good reviews and communication with the tech on our call.  We were told that our truck would be looked at first thing the following day.  Day 1, truck not looked at, we were told someone went home sick.  This was after we called to get an update.  We were told it would be looked at the following a.m.\nDay 2,  I we provided the potential location of the issue after speaking with our home mechanic.  We asked how pics could be sent to get things rolling.  We emailed a pic of the part and diagnostic which was from a recent repair of another unit with the same problem.  We followed back up after not hearing anything mid day.  The truck was not looked at by mid-day we were told this time 2 people were out.\nDay 3, Calls and face to face contact again resulted in no action, the truck was not looked at.\nDay 4, We went to location to try to nail down a realistic expectation of when the truck would be touched.  We were told they would try by late afternoon but could not say for sure, this came from advisement with the shop supervisor.\n\nThis has been the worst experience we have had with a WW Williams which we use often locally.  Our confidence in towing the truck was due to the quality of work and professionalism we experienced in the past.  This location has not met the standard exemplified by the WW Williams name.  Truitt has not followed up with us nor provided a realistic time table to address the misinformation provided prior to the town in.  We understand staff issues occur, especially in the current pandemic climate.  However, there is no excuse for not providing updates nor treating all customers with the same level of priority.  The business is open, there are technicians present, and trucks being worked on.  Yet, we have not been serviced nor updated with an expected diagnostic date.  The cost of being out of service has been extended due to the poor service standard.  Beware before taking your truck here.  Sitting and no communication is not a reasonable expectation and very costly in trucking.", "pics": null, "resp": {"time": 1610485566188, "text": "Thank you so much for updating this and we do hope that we can do better for you in the future!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "118413429877737385554", "name": "Kenneth Knight", "time": 1614692495633, "rating": 5.0, "text": "Very  nice customer service.....and the service department was great", "pics": null, "resp": {"time": 1614698766586, "text": "Thank you so much!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "108215941761391925114", "name": "Curtis Mathis", "time": 1585105211129, "rating": 5.0, "text": "Best shop in town! Honest, fast, done right the first time! Been going there for years. Robert and his crew are always looking out for me. I won’t take my truck anywhere else. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "116224449923543135208", "name": "kelvin james", "time": 1618447593730, "rating": 5.0, "text": "Great great service", "pics": null, "resp": {"time": 1618507041915, "text": "Thank you so much!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "104010787190080266303", "name": "Kenny Owen", "time": 1616608830602, "rating": 5.0, "text": "Great people to work with", "pics": null, "resp": {"time": 1616609732049, "text": "Thank you!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "115519949273179296156", "name": "Randy St John", "time": 1582143620348, "rating": 4.0, "text": "Pat was very helpful and easy to work with. Reasonable prices for the items I purchased", "pics": null, "resp": {"time": 1582152162930, "text": "Thanks so much for the feedback Randy!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "118228704701249784997", "name": "Michael Gautney", "time": 1599734013542, "rating": 5.0, "text": "Always get good friendly service", "pics": null, "resp": {"time": 1599746954173, "text": "Thanks Michael!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "116138372496205644838", "name": "Joseph Peroni", "time": 1576866312099, "rating": 5.0, "text": "Great shop, and customer service. Family atmosphere and a great place to work!", "pics": null, "resp": {"time": 1576870249548, "text": "Thanks Joseph!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "114161607885603002366", "name": "Daniel Burnley", "time": 1600905792957, "rating": 5.0, "text": "It was an excellent experience.", "pics": null, "resp": {"time": 1600958039574, "text": "Thank you so much!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "106166888234817752035", "name": "Justin Lasiter", "time": 1555697022966, "rating": 4.0, "text": "A great mechanic shop however very disappointed in how I was handled in hiring process. I was judged based on false charges but neglected to see I wasn't convicted on any crime! Not my fault someone filed false report on me but charges were dropped due to no evidence!! I'm a hardworking husband and father whom lives honestly and that is how I should be viewed. Very upset about this!! Been applying there for 3 years.", "pics": null, "resp": {"time": 1551711821323, "text": "Wow Justin! Thanks for the amazing review!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "113775023754455172169", "name": "Tim Smith", "time": 1580742858726, "rating": 5.0, "text": "Great Shop. Would recommend to anyone!", "pics": null, "resp": {"time": 1580746612525, "text": "Thank you Tim!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "116284012956829537207", "name": "M “Mobtownrider” R", "time": 1485361316737, "rating": 5.0, "text": "Absolutely fabulous customer service. Mark and the guys here are very knowledgeable and go the extra mile. I will definitely be doing business with them in the future.", "pics": null, "resp": null, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "100339413949066430970", "name": "e phipps", "time": 1580863975365, "rating": 5.0, "text": "Happy customer here! Thanks for doing great work!!", "pics": null, "resp": {"time": 1580913987378, "text": "Thanks so much!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "100896026337920169822", "name": "Paul Phipps", "time": 1580862962572, "rating": 5.0, "text": "Great service and very nice people!", "pics": null, "resp": {"time": 1580913982771, "text": "Thank you Paul!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "101240834146321417768", "name": "Lauren Thornell", "time": 1605305398519, "rating": 5.0, "text": "Ashley and the team are STUPENDOUS!!!!", "pics": null, "resp": {"time": 1605545535682, "text": "Thank you so much!!!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "105747534784458540235", "name": "Bach Wilson", "time": 1402314332118, "rating": 1.0, "text": "This company took advantage of us and ripped us off.\n\nI am a mechanic, but I don't often vacation with all of my tools, so I know what I am talking about here.\n\nWe suffered transmission problems on our motor home on Memorial Day weekend. AAA got us in touch with W. W. Williams. I described our problem over the phone to W. W. Williams. The front seal was leaking badly, our transmission was functioning normally as long as it had fluid in it, however was leaking too rapidly to drive. The mechanic on call nearly insisted that he come out and have a look at it on site, however I told him there was nothing that could be done on the side of the road. We decided we would spend the night on the side of the road and have it towed to W. W. Williams the next day.\n\nThe next day we had the RV towed to W. W. Williams. The mechanic on call insisted that we let him come out and put the RV inside the gates, even though we were not worried about it as it was a very industrial area. The mechanic came out and was nice and spent about 10 minutes installing the driveshaft since it had been removed by the towing company. We again explained and showed him the problem and he assured us that it would be no big deal for them to repair. The shop was very nice and appeared to be well equipped. The mechanic estimated 8-10 hours labor for the repair. He waited another 20 minutes for our ride home to arrive and we left.\n\nA few days later W. W. Williams called to say that they could not repair our RV. They said that since it was leaking from the front seal, they wouldn't have the tooling. They charged $600 to tell us this, which is very upsetting because I told them that was what the problem was from square one and several more times after that. They justified their price by a minimum 4 hour charge for the guy to meet us to put it behind the gate, and then a inspection fee on top of that to glance underneath the camper. Their seasoned mechanic should have been able to make that call right away, and charging for an inspection is ridiculous as this could and should have been done by the mechanic while we were paying for his 4hr service call, he had plenty of time for that as he was with us for an hour or less. The tooling is also a very lame excuse.\n\nThis company clearly took advantage of us, and figured they could make an easy profit without having to touch our RV. Life is expensive enough as it is, we don't need to gouge each other. I am really upset that I told them our problem from the very beginning and they still put us through all of this.\ncall right awaycl", "pics": null, "resp": null, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "113759996123349442535", "name": "lydicake yumyum", "time": 1525802566971, "rating": 5.0, "text": "Repaired my brother's truck in a timely manner, and compared to other places we've taken his truck their work is thorough. Costly, but worth every penny.", "pics": null, "resp": null, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "116293948450474491932", "name": "Patrick King", "time": 1598461471961, "rating": 1.0, "text": "Expectations are too high for the money", "pics": null, "resp": {"time": 1598536249116, "text": "We apologize you had a less than expected experience. It is always our intent to provide our customers with service that meets their expectations, and if we failed in that effort, we are deeply apologetic. If you'd like to speak to us more about your visit, please email us at info@wwwilliams.com and let us know how we can reach out."}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "105264621372232370170", "name": "Lee Mason", "time": 1580742782913, "rating": 5.0, "text": "Best shop in town", "pics": null, "resp": {"time": 1580746592746, "text": "Thank you Lee!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "111927341118701617740", "name": "Keith Warren", "time": 1564230695313, "rating": 1.0, "text": "Charged way to much money for diagnostics and it was wrong", "pics": null, "resp": {"time": 1564413870842, "text": "Hi Keith. We'd love to talk to you more about this. Can you please message us the best way to reach out to you?"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "109947812281148804442", "name": "Ronnie Allen", "time": 1573857281937, "rating": 5.0, "text": "Great place", "pics": null, "resp": {"time": 1574096831418, "text": "Thanks Ronnie!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "103982540728786899604", "name": "Ricky Pyles", "time": 1529861661963, "rating": 5.0, "text": "Great guys.", "pics": null, "resp": {"time": 1530634028712, "text": "Thanks for the kind words Ricky!"}, "gmap_id": "0x888e82757537d6dd:0x704f734fd94a65f7"}
{"user_id": "113717151222369756079", "name": "Evxta RL", "time": 1623976560517, "rating": 5.0, "text": "They were here super fast, in a pinch! He got our A/C up and running quick!! Thank you so much!!! The other places wouldn’t call back and I thought we’d have to go all night in this awful heat. Life saver!!", "pics": null, "resp": {"time": 1623978696307, "text": "Thank you so much for choosing us"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "103626544249785974200", "name": "David Herport", "time": 1626389211226, "rating": 5.0, "text": "Great job on installing new AC!  The guys were very polite and professional.  The work was completed in one day.  We are very pleased with the work completed and competitive pricing!", "pics": null, "resp": {"time": 1626389889131, "text": "David\nThank You"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "111218152315026613121", "name": "Patricia McPhillips", "time": 1614638050398, "rating": 5.0, "text": "Today was an inspection of our generator.   Johnny was great. He gave us lots more info about taking care of the unit and some additional details about the way we can take care of it.   Now we feel a lot more comfortable with it.  Really appreciate how well Baldwin Heating and Air has worked with  us and the generator\nSo glad we got it and how much support we've gotten after Sally.  Truly a great purchase.Thanks for taking such good care of us.", "pics": null, "resp": {"time": 1614641893990, "text": "Thanks so much Patricia"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "101582001604821582378", "name": "Babette Murphy", "time": 1625098308005, "rating": 5.0, "text": "Excellent install of a generator by Jake & Ryan.  They went over and above, working late waiting for the utility inspector to come out for final inspection.  Couldn’t be happier...these guys are the best.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "110932952283247221489", "name": "Janette Lammers", "time": 1619479008437, "rating": 5.0, "text": "Also maintenance on Generator (Generac). The maintenance man, Russell was professional, respectful and friendly. We enjoyed meeting him today and feel confident with his service. We are senior citizens and that is extremely important to us.", "pics": null, "resp": {"time": 1619523376514, "text": "Janette t\nThank You so much"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "113591024345809749742", "name": "Tom Sinclair", "time": 1616084631617, "rating": 5.0, "text": "We have had the pleasure of receiving preventative maintenance and occasional repair from Baldwin Heating and Air Conditioning both on our home and rental houses for years. The technicians are always prompt, courteous, and deeply knowledgeable. It give us great confidence and assurance to be able to rely on them.", "pics": null, "resp": {"time": 1616157564595, "text": "Thank you Tom"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "118087727857198556168", "name": "Polly Saunders", "time": 1608068790490, "rating": 5.0, "text": "All is well; this gentleman was efficient, very knowledgeable, helpful with tips and suggestions for future planning, and very affable. He obviously took pride in his work and cares about his customers. He loves his work and it shines!\nWe request him for any calls and our next service call...he did say all the others were equally qualified and efficient.\nOne great guy and obviously a great company. THANKS!", "pics": null, "resp": {"time": 1608069477151, "text": "Thank you Polly"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "105540459655938969614", "name": "Destiny Latham", "time": 1610140756345, "rating": 5.0, "text": "When our AC unit had to be replaced, a friend recommended Baldwin Heating & Air. I called them and George Cox came out the next day to look at the equipment we had and to decide what we needed. Our equipment had to be ordered, but delivered I'm just a few days. The technicians came out the following day to install a new unit inside and out. Both technicians were very professional and did a great job! We will continue to use Baldwin Heating & Air for all AC and heating needs. If you need AC or heating work done, I highly recommend Baldwin Heating & Air. You will not be disappointed 🙂", "pics": null, "resp": {"time": 1610146330703, "text": "Destiny\nThank you"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "115529961019704937646", "name": "Alana Gandy", "time": 1619737489745, "rating": 5.0, "text": "Showed up within an hour of my call. Excellent service! Highly recommend.", "pics": null, "resp": {"time": 1619738951970, "text": "Alana Thank You so much"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "102683048268122941044", "name": "Leo Vaulin", "time": 1625184614792, "rating": 5.0, "text": "The owner, Steve, responded to my concerns about getting my Generac generator serviced, and within 48 hours, the generator was good to go… just in time for the next storm!", "pics": null, "resp": {"time": 1624732538351, "text": "Why did we refuse to repair it Leo Vaulin\n\nLeo Vaulin maybe you misunderstood we only service Generac nothing else"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "114172968282909748451", "name": "Sidney Henderson", "time": 1619020544241, "rating": 5.0, "text": "Baldwin Heating and Air Conditioning replaced my worn out HVAC unit and has maintained the new one for several years. They also balanced the system by adding some new duct and installed new, more efficient registers.  They use top quality products, work professionally, and have fair prices.  Add to that the follow up care and superb maintenance and I am one very satisfied customer!  I highly recommend this company for your heating and a/c needs.\n4/20/21\nJust had another maintenance check; their service professionals are just exactly that — professionals.  John was very thorough as he inspected our system, offering advice to help keep things operating smoothly, while reminding me that service is available 24/7 should the need arise.  I continue to be very satisfied with Baldwin Heating and Air Conditioning and highly recommend them to anyone.", "pics": null, "resp": {"time": 1604162945918, "text": "Sidney thank you"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "108967905833099852599", "name": "Debbie Quinn", "time": 1609952019785, "rating": 5.0, "text": "BHA are very professional, always on time prices are great and they call back when you leave a message. We’ve even had them out in the middle of the night to fix a generator during Hurricane Sally!!  That’s above the call of duty. Superb service.", "pics": null, "resp": {"time": 1609872754230, "text": "Thank you Debbie"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "105337867474587898680", "name": "Ashton Hicks", "time": 1616883124771, "rating": 5.0, "text": "AJ is very professional and helpful. Early for the job and got it done perfectly so I didnt have to wait around.", "pics": null, "resp": {"time": 1617044471552, "text": "Thank You Ashton"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "100717478816528323025", "name": "Doug DeLisle", "time": 1617844628704, "rating": 5.0, "text": "On time, performed the required service efficiently.  Pleasant attitude.", "pics": null, "resp": {"time": 1617846157392, "text": "Thank You Doug"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "101569313852678930237", "name": "Noemi Mendez", "time": 1607542724668, "rating": 5.0, "text": "Generator maintenance after Hurricane Sally.  It's easy. . .they have good energy on the inside and it shows on the outside.  I was left feeling like I could rely on them in the future!", "pics": null, "resp": {"time": 1607545014134, "text": "Thank You Noemi"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "113541918959765881315", "name": "Corey Driscoll", "time": 1597765982580, "rating": 5.0, "text": "I was extremely pleased with the service, honesty, and professionalism that Johnny from Baldwin County Heating and Air Conditioning Inc. provided to me today. Not only did he perform maintenance but he also took the time to show me the issues I could potentially have and gave me advice on what I can do to maintain my systems myself. He even explained the use and limits of my home generator system as well. It’s not often that you hire a company and receive service that comes from such a passion to do the best job possible but Johnny is absolutely that technician. Thank you for the excellent and affordable service! See you on the next maintenance  visit! I HIGHLY recommend this company for your next service.", "pics": null, "resp": {"time": 1597770457908, "text": "Thank you so much. Glad to hear."}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "114450045305415570425", "name": "Paul Schultz", "time": 1619555860234, "rating": 5.0, "text": "Tech serviced the Generac.  He did a great job and also replaced the aging battery.", "pics": null, "resp": {"time": 1619558395272, "text": "Thank You Paul"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "112981418230506861334", "name": "Ann Bacher", "time": 1617216002971, "rating": 5.0, "text": "He did routine service on our Generac gas generator.  He was very efficient and pleasant.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "103683243456183506693", "name": "mharn100", "time": 1610404636896, "rating": 5.0, "text": "Baldwin Heating and Air recently installed our Generac home generator. The service was top notch. Everything from the technicians, knowledge and friendliness was second to none. My family and I highly recommend Baldwin Heating and Air.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "107425950308314411858", "name": "Eugene Mitchem", "time": 1616082194713, "rating": 5.0, "text": "Our technician Russell was early, he diagnosed the problem quickly and he explained everything that was going on with our Air Conditioning, very courteous and professional as well well.  I highly recommend Baldwin Heating and Air .", "pics": null, "resp": {"time": 1616157630793, "text": "Thanks again Eugene"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "116740020928300930593", "name": "Tomi Bree", "time": 1616000542759, "rating": 1.0, "text": "Half eaten breakfast burrito left on one side of my drive way and on the other side, barf; that's right vomit in my drive way.\n\nDestroyed the base board under the air handler closet, left a two foot mark and gouge on the wall adjacent to the air handler closet, ran into the hallway wall with hand cart and left tire tracks on the flat paint.\n\nI called my salesperson, who sent out a supervisor, Steven; they cleaned up the half eaten food and vomit and came inside to see the damage, Steve suggested to get me in contact with their painter and paint over the mark/gouge and the destroyed base board.\n\nI asked them to leave at this point; I have never been more upset on a business performing thousands of dollars of work for me.", "pics": null, "resp": {"time": 1616002023052, "text": "I offered to fix everything before you threw me out. Did not even get the chance to fix it.\nI drove over as soon as you called in the complaint.\nWithin 5 minutes you threw me out. I was not rude to you and offered to make everything like new..\nSorry I could not make you happy but you never gave me a chance\nThanks for your business\nSteve Dukes"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "105237064025916208319", "name": "thomas howlin", "time": 1615983979367, "rating": 1.0, "text": "It has been 4 months since we ordered a Generac standby generator. we paid 50% down-NOTHING done. They say we'll have to wait until June!!!", "pics": null, "resp": {"time": 1615985030842, "text": "Thomas\nWe are at the mercy of the manufacturer.\nBut since you are unhappy with us as a result we will glady cancel your order and send you back your money. I will take care of that for you today."}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "108159538566603758358", "name": "Mike Levesque", "time": 1605738161613, "rating": 5.0, "text": "The service technician, Johnny, I believe, provided the most comprehensive debrief of the system status and performance I’ve ever received.  He went over all of the measurements and ranges and reviewed tips for maintaining the system.  Good job!!!", "pics": null, "resp": {"time": 1605739206693, "text": "Mike\nThank you"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "110005655811146408773", "name": "Joe Ruffer", "time": 1616689624022, "rating": 5.0, "text": "Checked Generac generator for plenum failure as required by Generac.  Done no rust found.", "pics": null, "resp": {"time": 1616690731753, "text": "Thank you Joe"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "100619236855162095809", "name": "LARRY TURNER", "time": 1610120103819, "rating": 5.0, "text": "Routine preventative maintenance performed by Johnny from Baldwin Heating and AC.  Superb service  as always from Baldwin HVAC.  I’ve used them for 10 years and have had awesome service over that time.\nHighly recommended!", "pics": null, "resp": {"time": 1610146264788, "text": "Larry\nThank You so much"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "116658795732999146362", "name": "Jennifer Neto", "time": 1611626956709, "rating": 5.0, "text": "I enjoyed working with George.  He answered my questions and was very prompt and professional.  The installers took care of covering my carpet and cleaned up afterwards.", "pics": null, "resp": {"time": 1611627632402, "text": "Jennifer\nThank You"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "103286347040400599102", "name": "scott henry", "time": 1611263088225, "rating": 5.0, "text": "Had a whole home generator installed and some work on my HVAC system. They were quick, efficient and had it completed in one\nday. I would recommend them.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "101645711608641922435", "name": "Tim Adamson", "time": 1607641652485, "rating": 5.0, "text": "Johnny was very friendly and professional. He was knowledgeable and gave us valuable information for the upkeep of our system. Would highly recommend Baldwin Hvac to everyone.", "pics": null, "resp": {"time": 1607642509768, "text": "Tim Thank You"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "107032462681598092891", "name": "Andrew Veren", "time": 1605143923125, "rating": 5.0, "text": "Billy and Nathan did a great job replacing our HVAC system. They were courteous and professional. The new system looks and works great.", "pics": null, "resp": {"time": 1605206273941, "text": "Thank you Andrew\nI will let them know"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "103884795711353404667", "name": "Barbara Bianco", "time": 1591114420145, "rating": 5.0, "text": "Not only was Chris on time, y’all sent me a text yesterday to confirm my appointment, and again today to ask if there was anything in particular I wanted Chris (whose photo you included in your second text-thank you!) to check.  Once here, Chris explained what he would be doing, did it, and gave me a summary of his inspection.  He was friendly, professional, and most helpful when explaining the two items that could potentially need to be addressed.  Thank you Chris!  Y’all have. a great day!", "pics": null, "resp": {"time": 1591119004905, "text": "Thank you Barbara"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "107574861663738752179", "name": "Donna Handel", "time": 1604423493449, "rating": 5.0, "text": "Ryan Kennedy was above and beyond professional...very knowledgeable, I would hire him in a heartbeat. BHAC is very lucky to have a true team leader working them!!! Donna H., Foley AL", "pics": null, "resp": {"time": 1604424168348, "text": "Thanks so much Donna"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "100879602561341577977", "name": "David Arnold", "time": 1610409885037, "rating": 5.0, "text": "Tested and troubleshot the home generator power switchboard. The home generator technician is highly efficient and knowledgeable in regards to home generators.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "117048704528924028489", "name": "C Shaul", "time": 1596217766093, "rating": 5.0, "text": "Neils was my technician today and he was excellent! He was on time and very professional. I am grateful for his quick work and the detail in his explanation of the repair before and after completion.\nI also LOVE that they text you with the technician's name and picture when they are about 30 minutes from arriving.\nI definitely recommend Baldwin Heating & Air Conditioning.", "pics": null, "resp": {"time": 1596230673489, "text": "Thank You so much Christine"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "116949517623542008223", "name": "Katheryn Zeidler", "time": 1604003979506, "rating": 5.0, "text": "I have been doing business with BHAC for 4 years.\nThey have been wonderful. I highly recommend that if you are looking for a reliable company BHAC should be your heating and air company. Two thumbs up. THANK YOU to all of the employees who have taken such good care of me", "pics": null, "resp": {"time": 1604162975780, "text": "Katheryn thank you"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "106722971735769185784", "name": "Bridgett Dunn", "time": 1603915114967, "rating": 5.0, "text": "Our technician, Johnny took the time to walk me through how to use our house generator. We moved into the house a month ago and had no idea how to use it. He was professional, kind and thorough in his work.", "pics": null, "resp": {"time": 1603927832027, "text": "Thank you Bridgett"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "101857363135199472797", "name": "Pat Taylor", "time": 1607700779872, "rating": 5.0, "text": "Great service and great Technican. This is a company.  I highly recommend.", "pics": null, "resp": {"time": 1607701861107, "text": "Pat Thank You"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "110408161918750143912", "name": "TheElectricRayborn", "time": 1591026937830, "rating": 5.0, "text": "You need something fixed? Call Johnny!\nProbably the most passionate gentleman in their line of work I’ve ever seen.  He takes every job as a challenge to make sure the customer is 100% satisfied. In AC work, sometimes there can be hiccups or anomalies that you wouldn’t think would/could happen. Even when they do occur, Johnny dives in head first... sometimes literally to get the job done right!  I would definitely Call them and ask for him again. Really impressed !!", "pics": null, "resp": {"time": 1591391106815, "text": "Thank you"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "112636989624825745881", "name": "Ashley Taylor", "time": 1592271813879, "rating": 5.0, "text": "Had to call after hours when our AC went out. Baldwin Heating and Air arrived within 20 minutes and replaced the capacitor. Neil was our repairman and was very professional, prompt, and knowledgeable. We got to sleep in a cool house and everyone was happy! Highly recommend their great service! Thank you Baldwin Heating and Air!", "pics": null, "resp": {"time": 1592310717121, "text": "Glad we could help Ashley. Thank You"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "100107921510460459440", "name": "Bob White", "time": 1586812199279, "rating": 5.0, "text": "I have been using Baldwin Heating and Air for over 20 years. Great company and have always been impressed with the Tech's I've dealt with at my residence.\n\nI recently finally needed a new AC Unit and Air Handler. The two Techs, Ryan Kennedy and Mitch Carpenter were the utmost Professionals.  The entire process was easy and stress free for me. They did an excellent job with the installation, and cleaned up everything when the job was done.\n\nI will continue using this company in the future as they have been Great to work with over all these years.\n\nBob White\nSeminole AL", "pics": null, "resp": {"time": 1589980295888, "text": "Thank you for the review Bob.  We appreciate your continued business with us!"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "102024736751998506554", "name": "Heather Davis", "time": 1611249315206, "rating": 5.0, "text": "I have been using Baldwin County Heating and Air for years and have never had an issue with him. They a kind, courteous, and prompt.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "100516108644713786718", "name": "Kathy Gwizdala", "time": 1604094033346, "rating": 5.0, "text": "We recently had Baldwin Heating & Air Conditioning install a Generac Generator for our home on Mobile Bay. We are so very happy with our overall experience with this company. In fact (no lie) less than two hours after the final hook-up, there was a sudden storm, the electricity went out and the generator came on. It was seamless!!! We did have a misunderstanding with the salesman but once we brought it to the attention of Steve Dukes, the business owner, he quickly and decisively took care of it. Because we are on the Bay, we wanted the generator elevated so that, should there be flooding, the generator would be safe. That request hadn't been conveyed to the installers. However, when Mr. Dukes was made aware of the oversight, he actually constructed a metal stand for us himself. Plus he did this very quickly so that the delay was minimal. We were thinking they would build us a wooden platform, but the metal one is much better — both functionally (as it will last longer) and aesthetically. We are from Michigan and we had no intention of being here through hurricane season but we had traveled here with my 94 year old mother and, because of the coronavirus, she couldn’t fly back and she can’t physically tolerate such a long drive.  I was afraid that, because of the misunderstanding, we would be relegated to the bottom of the list and have to wait until they could “get around to it” because they were so busy...not so! There was only a slight delay while the frame was fabricated. So, fast forward to the present time: We had “bugged out” when Hurricane Sally was about 100 miles South of us and just now walked into the door after Sally had passed through. There is no electricity on either side of us but we walked into the door with the generator humming reassuringly beside the house. I don’t have to worry about Moms Bi-Pap or oxygen condenser working. She will be able to sleep comfortably tonight...and so will I. Mr. Dukes made sure we had the generator installed the way we wanted it and in a timely manner, smoothing out the bumps along the way. I definitely recommend getting a whole house (Generac) generator and I highly recommend doing business with Mr. Dukes of Baldwin Heating & Air Conditioning. He knows his business and is a man of integrity.", "pics": null, "resp": {"time": 1604097541449, "text": "Kathy thank you so much. It was a pleasure working with you."}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "111269975573345094654", "name": "Joan Brown", "time": 1596645796341, "rating": 4.0, "text": "Johnny did the generator maintenance for me. He was on time, very courteous  and efficient.  Shared with me the things I needed to know and do. I have used them for years and will continue to do so.", "pics": null, "resp": {"time": 1596718295211, "text": "Thank you Joan"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "110649215734435930392", "name": "Gary Ono", "time": 1593528915406, "rating": 5.0, "text": "This Maintenance man, Johnny Nolan, came to our house for the first time- replacing Chris. Just like Chris, he is excellent. He’s friendly, professional & explains clearly any repairs, improvements & info I should know about our a/c unit & generator. He’s the usual super competent Baldwin Heating & Air employee.", "pics": null, "resp": {"time": 1593543231643, "text": "Thank you Gary"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "118142145673323856619", "name": "Bill Bonniwell", "time": 1593025848863, "rating": 5.0, "text": "Richard and his crew did an excellent job of installing my generator.  Quality work done with precision and skill.  Sam, the Electrician, went above and beyond the call of duty completing his complex portion of the installation with a  bothersome eye issue.  The whole installation process exceeded my expectations.", "pics": null, "resp": {"time": 1593092927089, "text": "Thank you Bill!  We appreciate your feedback!"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "113287568347632990943", "name": "William Morgan", "time": 1595356041188, "rating": 5.0, "text": "The crew came this morning and did a wonderful job on installing my generator. They were timely and very professional. I will do business with them again.", "pics": null, "resp": {"time": 1595360634840, "text": "Thank you so much Bill"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "104095449104629943252", "name": "Cheryl Krebs", "time": 1618937521140, "rating": 5.0, "text": "Tech was very courteous and informative.", "pics": null, "resp": {"time": 1618967859995, "text": "Thank You Cheryl"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "115539185945196817689", "name": "Judy Panella", "time": 1594390919717, "rating": 5.0, "text": "The response was outstanding I called for service and the service man was to my home the same day.  I was also given  a window air conditioner to use until the central air was fixed.  The company did an outstanding job", "pics": null, "resp": {"time": 1594646042350, "text": "Thank you so much Judy"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "115712500530666882473", "name": "Mark Fisher", "time": 1618412160872, "rating": 5.0, "text": "Friendly on time service tech. Explained possible needed repairs or replacement of units.", "pics": null, "resp": {"time": 1618418157607, "text": "Thank You Mark"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "108762560812275874569", "name": "David Mullins", "time": 1597280021106, "rating": 5.0, "text": "Wonderful technician experience. He went above and beyond the call of duty to help with our generator. He was courteous and very customer service oriented.", "pics": null, "resp": {"time": 1597284162624, "text": "Thank You Julie and David"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "102772555927147605640", "name": "Lisa L.", "time": 1590520583465, "rating": 5.0, "text": "My technician Johnny is always so detailed and professional. I appreciate his authenticity and recommend him to anyone needing these services. Always happy!", "pics": null, "resp": {"time": 1591904427948, "text": "Thank you Lisa"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "117748502643494402015", "name": "Donna Lamberti", "time": 1588703467284, "rating": 5.0, "text": "We had Johnny here today for our yearly check up, and he did an outstanding job.  He took his time, explained everything thoroughly, and was very professional.  We highly recommend him and Baldwin Heating & Air Conditioning.", "pics": null, "resp": {"time": 1589980263619, "text": "Thank you for the review!  We appreciate your business."}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "106966586805243563557", "name": "Cathy King", "time": 1591220218099, "rating": 5.0, "text": "A fabulous company.  Their salesman was very professional and he was very knowledgable and polite.\n\nThe company has been in business for 3 generations.  I can share that it is due to their\nprofessional manor and their knowledge of the industry.\n\nThe owners were very helpful, too.\n\nOur installation team were professional, knowledgable, and polite.  Nathan and Billy were great.  I give them and the company 5 stars.  You could not do better than this company.  They are great from beginning to\nend.\n\nWe also took the maintenance contract because we wouldn't want anyone else\nto touch our AC.  They are the best! I give them 5 ***** stars.", "pics": null, "resp": {"time": 1591224441697, "text": "Thank you so much Cathy"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "115162758103741151109", "name": "Dana Lay", "time": 1593550110747, "rating": 5.0, "text": "I called Baldwin Heating and Air around noon when I realized our a/c unit was freezing up and not cooling my home. They had someone to my residence in less than an hour and had it fixed only 2 hours after that which was much faster and cheaper than anyone else had quoted me. They really know what they’re doing and care about their customers!", "pics": null, "resp": {"time": 1593556695046, "text": "Thank you Dana"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "106839460234334377167", "name": "Margaret Neely", "time": 1589467313604, "rating": 5.0, "text": "When our generator came on for testing it had a hard time starting, and when it started it was sounding rough. I called Baldwin Heating and Air immediately as hurricane season is quickly approaching. They came out right away, serviced the unit and now it’s running great!", "pics": null, "resp": {"time": 1589980187168, "text": "We appreciate the review!  Thank you for your continued business!"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "105476316519575863250", "name": "Judith Comer", "time": 1591983778160, "rating": 5.0, "text": "Our technician Johnny was courteous, followed the protocols we asked because of the pandemic, and seemed very knowledgeable about our equipment.  We felt he did a good job and was helpful in giving us information about our HVAC and our generator.   We would recommend him and Baldwin Heating and Air to the public and our friends and neighbors.", "pics": null, "resp": {"time": 1591992408222, "text": "Thank you so much Judith"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "100486438330393996249", "name": "Hunter McRight", "time": 1592503338185, "rating": 5.0, "text": "Johnny showed me how to operate the generator and what to do if I need to get it running if a technician is not available. He explained all their services. I appreciate all the help and information he was able to provide and he showed up 10 minutes early which was great.", "pics": null, "resp": {"time": 1592508297951, "text": "Hunter thank you"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "117229372277656497696", "name": "Jennifer Pool", "time": 1601481540329, "rating": 1.0, "text": "DO NOT USE! They are so unprofessional and rude. Our company paid for annual maintenance on our Generac generator. They never called to schedule. I called to get this service scheduled a number of times and unfortunately had to deal with the  \"Manager\" and he was so rude and obnoxious...he actually hung up on me. Use Bachelor's for your maint...they will call and be professional.", "pics": null, "resp": {"time": 1601482488330, "text": "Jennifer Pool\nI am sorry you feel this way. But you called and demanded a specific technician who already has maintenance customers scheduled. Come imediatlly. We offered another technician which you refused. We thank you for your past business."}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "109237402773648809619", "name": "James Partridge", "time": 1591889240994, "rating": 5.0, "text": "Generac home installation very kind and thoughtful.  Treated myself and my wife with respect and kindness.  Strongly recommend to anybody needing these services will recommend to anyone", "pics": null, "resp": {"time": 1591893997283, "text": "Thank you James"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "111188330993344118277", "name": "Rick Freeman", "time": 1591218686436, "rating": 5.0, "text": "We had an issue with the Generac generator. They were great. Resolved the issue. Checked the entire generator out, and tested the transfer of power to the house. Btw the dog hit the off switch on the outside of the unit 😱. They installed the generator when we bought our new house. Use them if your interested in a whole house generator. Rick", "pics": null, "resp": {"time": 1591391029476, "text": "Rick Thank You"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "108218291966876726624", "name": "J C", "time": 1610724081649, "rating": 5.0, "text": "Superb gas generator service!  Thank you Johnny!", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "107629492435957178092", "name": "Marolyn Morrow", "time": 1597281040742, "rating": 5.0, "text": "Have always had great service from Baldwin Heating and Air. So much so we now have maintenance agreements on not just our AC/Heating but also our generator.", "pics": null, "resp": {"time": 1597320629375, "text": "Marolyn and Robert\nThank You"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "113004986926335585076", "name": "Michael Stodard", "time": 1592582055801, "rating": 5.0, "text": "Johnny - who did preventative maintenance on our generator is very professional and wants to make sure you understand how the generator responds to power outage.  Very helpful and courteous.  I highly recommend Baldwin Heating &Air", "pics": null, "resp": {"time": 1592829462272, "text": "Michael Thank You so much"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "100978329606895007781", "name": "Brenda Burnett", "time": 1591025124284, "rating": 5.0, "text": "Johnny Nolan’s was very knowledgeable, courteous and helpful.   I appreciate his honesty and instructions on how to manually turn on generator in the event it fails to start during a power outage.\n\nGood job, Johnny!", "pics": null, "resp": {"time": 1591894376576, "text": "Thank you Brenda"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "113577510075475762311", "name": "Gale Fly", "time": 1615562881281, "rating": 5.0, "text": "Great service...prompt, experienced, courteous , and VERY competent", "pics": null, "resp": {"time": 1615822878619, "text": "Gale thank you"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "111540910566221078614", "name": "Michael Rader", "time": 1595002676954, "rating": 1.0, "text": "I called a month ago and spoke with a gentleman in regards to purchasing a generator pad. Three weeks ago I went up to the office, to purchase the pad and was told they were on back-order, and to call back. I have called back every week since, and today, once they have the items in stock, I am told by Ms. Brittney that they are not going to sell any of the generator pads out the door, but instead keep them for their own install use.  When I visited, or on any of the weekly phone calls this information could have been shared, and I would not have wasted my time waiting to support a local company.  This action on their part is not professional.", "pics": null, "resp": {"time": 1595007248734, "text": "Sir I am sorry you feel that way. And that you are so hurt that you feel that you should go out and publicly try to hurt my company and my team members. No one could have predicted a month ago that we would have issues like manufacturing shutting down. All the supplies we purchase are already designated to a client.\nAgain I am sorry your feelings are hurt. But for you complain about a small business that you did not do business with shows your charactor sir."}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "114549167502129844656", "name": "Mary Alice Fath", "time": 1592492344175, "rating": 5.0, "text": "Johnny Nolan’s performed annual service on the stand by house generator which was installed last year by Baldwin Heating & Air.\nJohnny is extremely knowledgeable about the system and thoroughly answered all questions we posed to him regarding the system.  Johnny is very courteous at all times during his visit and we look forward to his semiannual generator and HVAC systems inspections.", "pics": null, "resp": {"time": 1592508337331, "text": "Mary Alice thank you"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "114347521322353129234", "name": "David May", "time": 1593373365438, "rating": 5.0, "text": "Jessie did an outstanding job in the midst of this sweltering heat. Professional, prompt and courteous. BHAC is lucky to have him.", "pics": null, "resp": {"time": 1593523984140, "text": "We sure are. Thank you David"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "102799796941294433426", "name": "Mario DeFrancesco", "time": 1590154818389, "rating": 5.0, "text": "Over the past few years we have had two different ac service technicians from other companies service our central air system. Johnny from Baldwin Heating and Air Conditioning, in a very short time, proved to be the most helpful, caring individual we ever met. Thank you, Johnny.", "pics": null, "resp": {"time": 1590503532797, "text": "Thank you for the review!  We appreciate your business!"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "110343911364860566133", "name": "Marla Young", "time": 1592416902105, "rating": 5.0, "text": "Like how you are notified the tech is on their way and a picture of the person. The techs are always professional and polite. They get in, get the job done, and Clean up after their selfs.", "pics": null, "resp": {"time": 1592420809626, "text": "Marla thank you so much"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "102109033052819598419", "name": "Hugh Foster", "time": 1589999918484, "rating": 5.0, "text": "The technician was very thorough and explained  what he was doing.  He found a problem with the HVAC and was able to resolve it right away.", "pics": null, "resp": {"time": 1590503567189, "text": "Thank you Mr. Foster - we appreciate your business and review!"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "106520668431855845343", "name": "John Blackwell", "time": 1592415923384, "rating": 4.0, "text": "Service Technician Johnny was awesome! On time polite and knowledgeable about my generator.", "pics": null, "resp": {"time": 1592420919628, "text": "John thank you so much"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "107326970700032842127", "name": "Judy Dean", "time": 1591900227568, "rating": 5.0, "text": "The technician (Johnny) was very knowledgeable and patient as he explained what he was doing and told me what to do in an emergency.", "pics": null, "resp": {"time": 1591904533080, "text": "(Translated by Google) Thankbyou Julia\n\n(Original)\nThankbyou Julia"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "101512637846669625488", "name": "Helen Lestage", "time": 1591194819082, "rating": 5.0, "text": "Johnny was on time and did a very thorough inspection and testing of the home generator as well as instructing on how to operate manually if ever needed.", "pics": null, "resp": {"time": 1591198510711, "text": "Thank you Helen"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "116613727625431681726", "name": "Jennifer McRee", "time": 1599604115486, "rating": 5.0, "text": "Technician did a great job and was knowledgeable about his field...", "pics": null, "resp": {"time": 1599608167540, "text": "Thank you Jennifer"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "117740355071261239660", "name": "Kay Harden", "time": 1591384608963, "rating": 5.0, "text": "Johnny was extremely helpful in pointing out problem areas and recommending remedies!! He is always professional and courteous!!", "pics": null, "resp": {"time": 1591620399997, "text": "Thank you Kay"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "111196311038936136952", "name": "Martha Cronkhite", "time": 1576502197975, "rating": 5.0, "text": "Baldwin HVAC's employees are first rate, pleasant to deal with and thorough in their work.  And it's nice to see the same technicians return from year to year.  They're who we always call when we  need work on our generator, and were very helpful when we experienced a warranty problem with our Generac.", "pics": null, "resp": {"time": 1592926351961, "text": "Martha Thank you so much"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "108991622949721691888", "name": "Lydia Henley", "time": 1564355907262, "rating": 5.0, "text": "Me and my husband are very pleased with the service we receive from BH&A.  We have been customers for over 6 years. We have a yearly maintenance contract for our generator and air conditioning unit. The maintenance contract has kept our units in good working condition. Our great service man Chris is professional, courteous and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "100538769986664420280", "name": "Tom M", "time": 1572481387971, "rating": 5.0, "text": "Great experience with Baldwin Heating and Air. George was great providing a quote and answering questions, Jeremy and his assistant Cory did a great job with the installation/cleanup, and Chris was great with post installation inspection. Reasonable prices and all who we dealt with were conscientious.", "pics": null, "resp": {"time": 1592933282341, "text": "Thank you Tom!  We appreciate the positive feedback."}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "111053809279305076073", "name": "Melissa", "time": 1556509176615, "rating": 5.0, "text": "The serviceman (Neils) was fantastic!! I booked an appointment online, and was called the following morning. By that evening, my air conditioner was fixed and at a reasonable fair price.  He really went above and beyond to fix my unit, since it had been completely sabotaged by renters. Thank you Baldwin Heating & Air for prompt professional and excellent service.  I highly recommend this company. I will certainly use them again in the future!", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "117435365013086004826", "name": "Sandra Weekley", "time": 1551508708701, "rating": 5.0, "text": "Wonderful! Jeremy and Cory put in our unit today, they were fast, efficient and very courteous! We are very satisfied! Great company! Thank you! James and Sandra", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "115027497275044110546", "name": "Yvonne Brenner", "time": 1559926737201, "rating": 5.0, "text": "I was very impressed by the excellent service Neil provided. He arrived less than 2 hours after I called and was friendly and professional.  I was expecting to be taken advantage of but he quickly identified the problem and did not rip me off!", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "106806744105904676530", "name": "Mark Munteanu", "time": 1519422195885, "rating": 5.0, "text": "Great work, very knowledgeable team, fast service and decent priced. Not to mention I got the best warranty on my brand new system. Highly recommended!! Call Denny for a full professional detailed quote. 5 stars!!!", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "118027634794617089177", "name": "Tammy davis", "time": 1525903159489, "rating": 5.0, "text": "Nathan showed up right on time and was great at explaining everything to me. He even took  time to answer the questions I had.\nNathan got my AC back up and running, thank you for an awesome job. I know I'll sleep cooler tonight. 😊", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "114740243169991256572", "name": "Fink Condo Rentals LLC", "time": 1591026758043, "rating": 5.0, "text": "John is always the person I want to call & fix my air conditioner. He's gonna tell me exactly what is wrong with no bs. I couldn't imagine using anyone else. Always going the extra mile!", "pics": null, "resp": {"time": 1591391150417, "text": "Thank you Amy"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "116760644692886902014", "name": "L'shele Hamilton", "time": 1589459117719, "rating": 4.0, "text": "Staff is very attentive, especially my technician that performs my seasonal services.", "pics": null, "resp": {"time": 1589980225423, "text": "Thank you for your continued business & the review!"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "117641295927686317613", "name": "Steve Henley", "time": 1563239069162, "rating": 5.0, "text": "If you're looking for great service by knowledgeable technicians, be it for HVAC systems or back-up generators, Baldwin Heating & Air is the place to go.  Just received our semi-annual preventative maintenance servicing of both our HVAC unit and 22kW generator by Chris.  He arrived promptly on time as scheduled and had our generator taken care of in no time; even finding a problem with our AC system that we didn't even realize existed and verified that the parts would be covered by warranty.  So nice to have one person that is able to maintain both pieces of equipment.  Can't compliment them enough for the great work they do.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "105916697032272446277", "name": "Jim Hood", "time": 1616792001836, "rating": 5.0, "text": "Scheduled maintenance on the standby generator.", "pics": null, "resp": {"time": 1617044528465, "text": "Jim Thank You"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "108884753542806366182", "name": "Robert Newsome", "time": 1619556886751, "rating": 5.0, "text": "Good job", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "114527541039192777843", "name": "Kathy Hinrichs", "time": 1522433130088, "rating": 5.0, "text": "We were provided an excellent and thorough annual inspection service of our air conditioning and heating systems. Our service technician, Nathan McNelis was very knowledgeable and explained everything step-by-step.  He was neat, courteous and friendly and punctual with the appointment time.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "114758682246042554693", "name": "Paul Kachinovas", "time": 1567091797612, "rating": 5.0, "text": "Great service tech. Did a very good job on my generator.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "115062616047348883455", "name": "Fred Corte", "time": 1617901670495, "rating": 5.0, "text": "Bi annual service of the generator", "pics": null, "resp": {"time": 1617981457534, "text": "Thanks Fred"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "111867838260943983841", "name": "austin I Love you", "time": 1570218662864, "rating": 5.0, "text": "Best prices & they treat you with respect like family..They go the extra mile to fix your problem...Love these guys...", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "110887453673182402283", "name": "Terry Ullrich", "time": 1610578467816, "rating": 5.0, "text": "Service was prompt and professional for our generator.", "pics": null, "resp": {"time": 1610580464915, "text": "Thank you Terry"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "101756080736158892844", "name": "Denise Craver", "time": 1590095662260, "rating": 5.0, "text": "Prompt, professional, polite and a real asset for your company!", "pics": null, "resp": {"time": 1590503546287, "text": "Thank you!"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "117956507735523623865", "name": "Pam Thompson", "time": 1529954434271, "rating": 5.0, "text": "Just want to say Thank You to tech Nathan McNellis. He went above and beyond to accommodate my 71 year old Mother, in a desperate situation.  It's not everyday that you encounter a person that does their job with true heart. But He did!  His care , attitude and service gave us peace of mind during a really rough time. Thank You Nathan!!!", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "110740276537423107057", "name": "T Stephenson", "time": 1452715710299, "rating": 5.0, "text": "I have known this Company Owners for over 9 years. When I moved to this area I had no family or friends. So I had to find out who to call by research. I call Baldwin HVAC and they have always taken care of my heat and air conditioning needs with great service. Any business can have a sour day or a great day that does not really represent the regular experience.  Whether, you have a good or a bad experience, anybody can have an off day we all have them.   Steve and his crew as always went above and beyond to make sure that my unit works. I have called in the heat and cold. If something goes wrong his team get back with my family to make it right.  I have two dogs and they like them as well.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "101906076012446627743", "name": "Gene Ebert", "time": 1591977634188, "rating": 5.0, "text": "Great installers, very nice job, excellent employees", "pics": null, "resp": {"time": 1591981349624, "text": "Thank you so much Gene"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "114271752049556642176", "name": "Terrye Hall", "time": 1559135776774, "rating": 5.0, "text": "Baldwin HVAC has provided my service for several years now.  In my opinion, they are the best!!  Their technician, Johnny, is excellent and has earned my trust and total confidence.  He is prompt, courteous, considerate, and even tolerates my two spoiled dogs.  I have never had any problem or concern with Johnny nor with Baldwin HVAC.  It is rare, and such a pleasure to have people like this in my life.  Terrye L. Hall, Fairhope", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "106052636647907241564", "name": "terri shrader", "time": 1626100358827, "rating": 5.0, "text": "Generator maintenance", "pics": null, "resp": {"time": 1626109821111, "text": "Thank you\nTerri"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "105726204766581860452", "name": "Trevor Brite", "time": 1345743575218, "rating": 5.0, "text": "These guys have a great team. They were able to get the job done very quickly. Everything exceeded my expectations in terms of time, effort, and they were very thorough. Outstanding company!", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "106661209034874324201", "name": "Cyrus Avery", "time": 1464807319844, "rating": 5.0, "text": "Baldwin Heating and Air is the best in the business. They are honest and you can trust them to get the job done right. Wouldn't call anyone else. They have been in business a long time and that says something about a business. Call them and you will be glad you did.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "111238004064335326123", "name": "Jennifer Strickland", "time": 1526330776268, "rating": 5.0, "text": "Great, friendly and fast service! We bought our Trane HVAC with them and have had them come out a few times for maintenance and they have been wonderful! I definitely recommend them!", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "108616153432922508152", "name": "Renee Marshall", "time": 1466562772763, "rating": 5.0, "text": "Such a great business. Very knowledgeable and prompt! From the ladies that answer the phone to the service guys to the owner, all have been a pleasure to deal with. Will certainly use them again!", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "110085871883401144837", "name": "Renee Richard", "time": 1559993888689, "rating": 5.0, "text": "Been with BH&A for about 8 yrs now and have had nothing but great service. Chris comes 2x a yr. for routine service on heat, a/c and generator. If a problem is discovered, he explains it and gives options and suggestions.\nWed. he discovered a gas leak inside for the heater so he replaced the hose with the leak. He even texted me instructions on changing the exercise time on the generator when I had that question.  Chris has been super nice, with very knowledgable service.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "101553170519688085017", "name": "William Sams", "time": 1562021277392, "rating": 5.0, "text": "CHRIS serviced my home reestablishing the Generac service to the house.  He was very professional\nand as a representative of the company I am very pleased that my service contact is with\nBaldwin Heating & Air Conditioning.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "102221320406319346717", "name": "Johnny Boy", "time": 1451609505298, "rating": 5.0, "text": "These guys are amazing! Truly awesome! They fixed my AC and got in and out of there faster than I have ever had anyone else do it!", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "105916457695538807647", "name": "Linda Duren", "time": 1566516354777, "rating": 5.0, "text": "Speedy service and reasonable rates", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "103409855907639668411", "name": "Jeremy Ault", "time": 1494356768709, "rating": 5.0, "text": "I had a great experience when they swapped my extremely old gas heat pump for a new all electric system. They did a great job running the new 220 volt outlet and they sealed all the leaks in the AC closet as well. The price they have me beat the competitors. I love the wifi thermostat that came included in my deal. I can change my thermostat from anywhere right from my phone. Call them and you wont be disappointed. dan and his crew did an awesome job from start to finish.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "106984622879671362067", "name": "Ricky H Duncan", "time": 1570556502286, "rating": 5.0, "text": "Good price and dependability from the owner!", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "104568466441166885778", "name": "Randall Clark", "time": 1616775628634, "rating": 5.0, "text": "Always always always an excellent experience !! Highly recommended !!", "pics": null, "resp": {"time": 1590503494044, "text": "Thank you Randall!  We appreciate your business!"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "103336521981437065759", "name": "Rene' Taylor", "time": 1531337790140, "rating": 5.0, "text": "Chris was very Professional and Helpful! Thank for doing a Good job!!", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "105018765896246615902", "name": "Don Gresh", "time": 1523456773081, "rating": 5.0, "text": "I've had a Maintenance Agreement with Baldwin HVAC for the past three years and I am very pleased.  I just had my Spring check-up performed by Niels, a service technician for Baldwin HVAC, and he was on-time, professional and friendly.  The check-up was thorough.  I highly recommend Baldwin HVAC.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "106105316822116535125", "name": "bo bohannan", "time": 1466516290349, "rating": 5.0, "text": "Read about Baldwin heating and air in the Spanish Fort monthly magazine. During our recent heat wave our air conditioner quit. I called this company, he had 8 calls for help before us, but he made to our house later in the day. He fixed our ac. We were very pleased with his professionalism. We will use this company for our ac and heating upkeep", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "114136596302062422815", "name": "Tom Blando", "time": 1526487308540, "rating": 5.0, "text": "Baldwin HVAC is AWESOME! We are on their twice a year preventative maintenance program. Niels comes out to service our HVAC system. He is very friendly and knowledgeable. He is always willing to answer questions and explain any concerns. The staff inside has always been very friendly and accommodating. I highly recommend Baldwin HVAC for your HVAC needs.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "116640276033612827865", "name": "Zesty vlogs", "time": 1591466741121, "rating": 4.0, "text": "Great service great guys", "pics": null, "resp": {"time": 1591620379417, "text": "Thank you"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "113683818315897672373", "name": "Cindy Woodard", "time": 1345129466870, "rating": 5.0, "text": "The service I received was great. They fixed the problem immediately and in a timely manner as well. My ac unit has been great ever since!", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "104769894124955347801", "name": "Phillip Long", "time": 1486560954641, "rating": 5.0, "text": "I have three women in my house plus me and we were always running out of  hot water. I called Baldwin HVAC to get a tankless water heater. When the guy came out I went ahead and looked into a whole house generator to be totally covered. The experience was great from start to finish. Very fast! Two days to get both installed and my wife was so pleased at how clean, courteous and professional all the crews were. She is very meticulous about our house and she just raved and raved about how pleased she was. I was also happy because I had thought it would be much more expensive. Hurricane ready in Baldwin County. Win/Win! Great Job! I highly recommend the team at Baldwin HVAC.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "102104525539526978399", "name": "Carrie Andrews", "time": 1368334186847, "rating": 2.0, "text": "My  elderly fathers air conditioner went out suddenly and he called Baldwin Heating & Air Conditioning for the first time. When the mechanic arrived he immediatly started in on a sales pitch saying the three year old a/c was not worth repairing due to its age. He wasted over thirty minutes at $100.00 an hour trying to sell us on a new unit  before he even took his tools out of his truck. After one hour into the diagnosis he tells us he needs a part and will return shortly and he leaves. We wait without a/c for over two hours for him to run to get the parts. When he returns he quickly replaces what he calls the capacitor. We had to pay $685.50 for the total repair, $125.00 of which was the part When we were cleaning up his mess we found the reciept from Solar Supply for the part he purchased. That $125.00 part cost them $6.20 , The mechanic also charged us for four pounds of freon and he never even removed the freon caps from the a/c. I feel violated and would not recommend this company to my worst enemy. I will be calling the BBB", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "118396656652180438326", "name": "Mike wesner", "time": 1562588786555, "rating": 5.0, "text": "They are the best around.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "110234057166125948102", "name": "Fred Cox", "time": 1392394537794, "rating": 5.0, "text": "Baldwin Heating & Air is a great business. They do a thorough job servicing the units. Very prompt.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "114898967115662652787", "name": "Cody Howell", "time": 1360094033195, "rating": 5.0, "text": "Baldwin Heating and Air will perform the finest AC and generic generator maintenance service and is superior to any other company I have used in my twenty years of home ownership on the Eastern Shore of Mobile Bay.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "106127302978620307165", "name": "Judson E Crump", "time": 1509742745133, "rating": 2.0, "text": "A bit disappointing.  3 months ago, our AC unit wasn't cooling as well as it should.  So we called Baldwin HVAC.  They sent a guy to come out and look at it.  He looked briefly at the unit, walked around the house for a few minutes with a thermometer, and quickly pronounced that there was nothing wrong, and that all we needed was to change our air filters.  So they charged us $39 for the visit (the fee they quote you) plus $50 for \"labor,\" which I guess is that guy's rate for walking around your house for 10 minutes.\n\nObviously, I keep my filters changed, so I was suspicious, but I assumed that he knew what he was talking about.  2 weeks ago, our AC stops working completely.   Before calling anyone, I go into the attic and check it out myself.  The coils were completely frozen.  And not only that - they were clogged with dust and mold.  This was due to our blower motor malfunctioning, which had been happening slowly for some time at that point.\n\nI took a photo to show how bad it was.  Naturally, I called Baldwin HVAC to ask how their guy missed something so obvious.  The manager, Anthony, said that the initial $89 visit \"didn't include\" looking at the coils, even though it took me - an ordinary guy with no HVAC expertise - literally 5 minutes to open up the blower and look in there.\n\nLike an fool, I believed him, and so hired them to come out and fix the blower motor that had gone bad.  Their guy John came and he was nice and did a good job.\n\nBut the next day, the same AC unit goes dead again.  This time, the problem is the outdoor compressor.  So I call them to come check it out.\n\nThey charge us yet another $89 to come and look at the same AC system they'd worked on the very day before.  This time, we resist their high-pressure sales tactics (\"It's 4 PM, so if you want the AC working tomorrow, we need to order the part now! \") and call a different company to work on the compressor.  Baldwin HVAC quoted us $822 to replace the part (which was covered by warranty).  We went to Climatemp instead, and they charged us $550 for the exact same job.  They got the part that same day and had a guy out there the very next morning.\n\nLong story short: I'd recommend someone else first, if only because these people charge more than other companies, and in my experience, the quality of the work just wasn't sufficient to justify the extra cost.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "106161762694463060474", "name": "Patricia Bellare", "time": 1591889287441, "rating": 5.0, "text": "Generator recall check", "pics": null, "resp": {"time": 1591894033242, "text": "Thank you Patty"}, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "115185364787226499579", "name": "Maya Eichhorn", "time": 1375816234272, "rating": 5.0, "text": "They always come out to call immediately when I call them. Everything always works out perfectly and I have found Baldwin Heating and Air to be very dependable.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "100146609424768342404", "name": "James Roberson", "time": 1449202756998, "rating": 1.0, "text": "We had a Trane unit installed from this company in our home. Well just like the others said it doesn't work near like it should. They also charged us way to much. We finally found this out after calling another company to fix their problem. They told us they charged twice as much as they would of charged for the same system. They also told us that Trane has been having problems with there compressors since they have been bought out by ingersoll rand. We wished we would have knew this before. Buyers beware the Trane product is nothing like it use to be and this company can care less after they collect the check. There's better companies that actually stand behind their products and work out there.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "107095018738074708401", "name": "Don Rooker", "time": 1454776639898, "rating": 5.0, "text": "Baldwin HVAC recently installed a new Generac 22kw standby generator at the Humane Society's adoption center on route 98 in Fairhope, to protect the animals welfare in case of electrical failure during storms.  The job was done on time and on budget, even though some unexpected challenges were encountered.  The team members from Baldwin HVAC were extremely competent, courteous, and cleaned up the site upon completion of work.  We at the Humane Society are grateful to Baldwin HVAC and look forward to having them do necessary preventive maintenance in the coming years.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "116892216363126161889", "name": "Richard Banks", "time": 1449107996683, "rating": 1.0, "text": "We bought a Trane unit from these guys with nothing but problems. From the first night it was installed it would not cool properly. We called them to come back out the following morning they didn't show up to that afternoon to only tell us some part failed in the coil.  I said this is a brand new unit why would a part fail in one day. They said they have been having this problem with the trane units the sales man Dan never told us that while he was selling us the unit. On top of all of this it took a week to get us the part from Trane to fix my brand new unit. Evidently Trane has a problem there brand new units quit working before they ever even get started and you can't get parts for them in a timely manner. We will never buy another Trane!!! And we will never do business with Baldwin again do to selling us something they knew had a problem!!!", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "106864711352567201092", "name": "Thomas Patrick", "time": 1386101119468, "rating": 5.0, "text": "Terrific products and service. I get their twice a year preventative maintenance check and have no worries over whether my heating and air-conditioning will work when needed.", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "107386392298205242015", "name": "grody Grotefend", "time": 1475666399100, "rating": 5.0, "text": "good people, doing good work at a fair price. They've taken care of us through 12 years and 2 hurricanes ...", "pics": null, "resp": null, "gmap_id": "0x889a69f62d949da1:0x9a9bd9e00f87db88"}
{"user_id": "117714251123109679724", "name": "BJ Baker", "time": 1627511499875, "rating": 5.0, "text": "Sam was very knowledgeable and courteous.  He took the time to answer a litany of technical questions and explained every detail of what he was doing.  Excellent service!  Thank you!!", "pics": null, "resp": {"time": 1627566778556, "text": "Hi BJ, thank you so much for sharing your experience with our technician Sam. We appreciate your feedback!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "111033544341965677086", "name": "Bradley Wilkes", "time": 1626831610578, "rating": 5.0, "text": "Super appreciative of the work the team did installing a cassette mini split in our home.  All my dealings with the Capital have been professional and pleasant and I will definitely recommend them to family and friends in the future!", "pics": null, "resp": {"time": 1626872823462, "text": "Thank you so much for the kind review Bradley!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "101812433790337735282", "name": "Jessica Stephens", "time": 1625864952136, "rating": 3.0, "text": "Giving 3 stars only because it is the average between the two components of service received.\n\nTechnicians/Product Installation - Five Stars! Over-the-top knowledgeable, courteous and timely!\n\nCommunication/Interaction with Jacob Oswalt - ZERO stars. Very snarky, condescending and entitled when he could have just been transparent. Followed through with the install only because our AC was already completely out.\n\nNew units work great and we are so happy it is done, but I definitely would not recommend this company.  Too many other reputable companies that are not such a pain to deal with.", "pics": null, "resp": {"time": 1625875628017, "text": "Jessica,\n\nI am glad you are happy with the installation. I am sorry the rest of your experience was not satisfactory. We did our best to work with you on an expedited schedule given your existing system was not operational. We were able to move you up from the original scheduled date to get your systems installed sooner. Most of our communication was after hours and over email, so I'm sorry if it came off as snarky or condescending as that was not my intention. Sometimes things get lost in translation over electronic versus verbal communication. I am glad the installation went well and that we were able to get your new systems installed in a timely manner. I apologize again for any misunderstanding or miscommunication and hope you will consider us in the future for your HVAC needs. Please let us know if you need anything else. - Jacob Oswalt"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "109040478789009471912", "name": "Mike vonEschenbach", "time": 1626803655007, "rating": 5.0, "text": "Great response time when our generator was down, Eric was very professional and diagnosed and fixed our generator fast to get us power!", "pics": null, "resp": {"time": 1589462918812, "text": "Thank you for the review!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "105842310955451954024", "name": "JeffScott Ktoe", "time": 1625668767907, "rating": 5.0, "text": "Technician arrived on time. Courteous and polite. Used shoe booties when entering my house. Completed work in a timely manner. Payment either a credit card or check. And friendly to my dog.", "pics": null, "resp": {"time": 1625763962712, "text": "Hi JeffScott, we love to hear about your pleasant experience with us! We appreciate your kind feedback!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "117097301200131352508", "name": "Pam Bounelis", "time": 1625240028114, "rating": 5.0, "text": "The service technician was polite, careful, and thorough. He relentlessly tracked down the issue and fixed it. He explained every step he was taking so that we had no surprises. We couldn’t have asked for anything better.", "pics": null, "resp": {"time": 1625764088338, "text": "Hi Pam! We are pleased to hear about your experience with our technician! Thank you so much for your kind feedback!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "112039765062444246080", "name": "Tyler Welch - HHS", "time": 1626188740832, "rating": 5.0, "text": "Very pleased with the service I received. Ben and Hunter were knowledgeable, friendly and professional. They were able to diagnose the problem and fix my generator quickly and at a reasonable price.", "pics": null, "resp": {"time": 1626190689324, "text": "Hi Tyler! We are so happy to hear of your positive experience with Ben and Hunter. We appreciate your feedback!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "100267383070716834644", "name": "Robert McMahon", "time": 1623765761760, "rating": 5.0, "text": "Awesome job with installing and servicing our generator!  Great customer service and attitude by their team.  Best technician (both skill and interaction) I’ve seen anywhere!", "pics": null, "resp": {"time": 1623770428337, "text": "Hi Robert, thank you for the kind words! We are so pleased to hear about your positive experience with us. We will be sure to pass this along to the rest of our team!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "108746720559149137134", "name": "Joyce McKay", "time": 1622818211705, "rating": 5.0, "text": "Matthew was courteous, careful, friendly, and efficient. He listened and responded to my questions and needs. I like this company and am pleased with them, but for me Matthew was one of their most outstanding technicians.", "pics": null, "resp": {"time": 1584142349399, "text": "Hi Joyce, we are so happy to hear about your pleasant experience with Matthew. We will make sure to pass along the kind words!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "101317504170752627588", "name": "Stuart Frentz", "time": 1621957319184, "rating": 5.0, "text": "The technician managed to arrive early in response to our emergency call, identified and fixed the problem, installed a new filter (badly needed), and wrapped everything up in sterling fashion just before we both had to vacate the premises for a scheduled showing. Wonderful service!!!! Excellent.", "pics": null, "resp": {"time": 1622036460877, "text": "Hi Stuart, we are so happy to hear about your pleasant experience with us! We will make sure to pass along your satisfaction to Bill."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "104301974039913573116", "name": "Rick Wiitanen", "time": 1627696807313, "rating": 5.0, "text": "Service was prompt and outstanding! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "108776250246514399763", "name": "Grady Dill", "time": 1627564549842, "rating": 5.0, "text": "Referred to them by a friend.  Been very pleased so far with their service.", "pics": null, "resp": {"time": 1608564184930, "text": "Hi Grady, thank you so much for the 5 stars!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "118137562749069554952", "name": "Brenda Walker", "time": 1627081787046, "rating": 5.0, "text": "The technician arrived as promised and installed a new thermostat that is a step up from what I had.\nCan sleep in a cool house. He was knowledgeable and did a great job.", "pics": null, "resp": {"time": 1617109710042, "text": "Hi Brenda, thank you so much for the thoughtful review. We are happy to hear this and will make sure to pass this along to our technicians!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "101071002709566704225", "name": "Bryon Skellett", "time": 1623713624872, "rating": 5.0, "text": "Tim did a great job as always. Laura and Cindy are top notch as well. Wouldn't use anyone else.", "pics": null, "resp": {"time": 1623762800821, "text": "Hi Bryon, thank you so much for the thoughtful review! We will make sure to pass along the kind words to everyone!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "106558963238359102868", "name": "Susan Moore", "time": 1616027612303, "rating": 5.0, "text": "We have used Capital for installation and maintenance of a whole house generator since 2004. Can’t say enough about the quality service we have received. From the service department calling to remind me of appointments, to texts that the service tech was on his way, to our wonderful serviceman Ben. The entire experience has been a pleasure for all these years. I would highly recommend them and have done so, for people that have asked me. So professional, and attend to every detail in the service experience. Highly pleased!!", "pics": null, "resp": {"time": 1616081128632, "text": "Hi Susan, thank you for the kind and thoughtful feedback it means so much to us! We're so happy to hear about your pleasant experiences with us throughout the years. We will make sure to pass this along to Ben as well!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "117184363413319026012", "name": "Joe Holcombe", "time": 1623884786650, "rating": 5.0, "text": "Bobby / Tim / Conner / Kyle did a terrific job installing our new 4 ton + 2 ton systems today at our home. Timely, clean, courteous, and professional. Just what I’ve come to expect from Capital over 15 years of using them.  Looking forward to many years of enjoyment from our new HVAC and the new iWave-R air sanitizing systems that they installed.", "pics": null, "resp": {"time": 1623937772390, "text": "Mr. Holcombe, we are so appreciative of your thoughtful review! We will be sure to pass along the kind words to our technicians. Thank you for being a loyal Capital customer!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "107679835421467588587", "name": "Jeannene OBrien", "time": 1625067033768, "rating": 5.0, "text": "My generator was not working. They were here on time, diagnosed problem. Was able to fix problems and take care of maintenance that had not been done. Great service!", "pics": null, "resp": {"time": 1625171058647, "text": "Hi Jeannene, we appreciate the kind feedback. Thank you so much!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "116122292472894672631", "name": "Katey Nelson", "time": 1613594754714, "rating": 5.0, "text": "Capital Heating and Cooling is the absolute BEST!  We have been using them for years and wouldn’t think about anyone else.  We recommend them to family and friends.  They are extremely reliable, honest, hardworking, and fair.  They have done just about every service imaginable for us on our homes.  All of their employees and techs are wonderful.  Thank you Capital!", "pics": null, "resp": {"time": 1613665938787, "text": "Hi Katey, we are so pleased to hear about your pleasant experiences with us. Thank you for the positive feedback and for being a wonderful customer!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "110087862421336663620", "name": "Brian Hortman", "time": 1625068333365, "rating": 5.0, "text": "Very satisfied with Capital and our technician Sam specifically. Very courteous and patient with our children asking 100 questions!", "pics": null, "resp": {"time": 1625171114132, "text": "Hi Brian! We are so pleased to hear about your experience with Sam, we think he is pretty great too! We will make sure to pass along the kind words to him."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "102203433968748103052", "name": "Bob Booth", "time": 1614695015281, "rating": 5.0, "text": "The Technician arrived right on time to perform routine service our generator. Capital Heating & Cooling has installed and serviced all of our generator and HVAC needs for over 20 years. They are responsive, reliable, reasonable, professional, and knowledgeable. They clearly explain any issue, the solution, and costs. Capital knows that prevention is the best approach. Keeping our systems running at peak performance has always been their goal.", "pics": null, "resp": {"time": 1614696569019, "text": "Hi Bob, thank you for such a thoughtfully written review! We are so happy to hear about your pleasant experiences using Capital and for being a great customer these last 20 years."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "105099151002087756666", "name": "Beth Palmer", "time": 1613482462581, "rating": 5.0, "text": "Got home from a long trip to find heating system not blowing through any of the air ducts. House temperature was freezing cold! Called Capital Heating early the next morning after Googling a few local companies....received super professional customer service from Laura (sp?) and Cindy who arranged the appointment for same day service. 😳😳🙌🏽🙌🏽 Not only did the technician, Bobby S. show up as expected, he was SUPER professional, courteous, and thorough in his diagnosis of the problem. Bobby explained the problem with the system in plain terms, left/returned to pick up the needed part and made the entire process feel extremely transparent and straight forward. Will definitely be calling on this company in the future. Great job, Bobby!!! (The house is warm and toasty because of you)! Great company. Star employees.....👌🏽🙌🏽✅✅✅😁", "pics": null, "resp": {"time": 1613571510554, "text": "Hi Beth, thank you for the wonderful feedback! We are so pleased to  hear about your pleasant experience with us and we will be sure to pass this along to the team!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "105872618812179004675", "name": "Alice Wideman", "time": 1622003193161, "rating": 5.0, "text": "Our tech was Matthew Harper and he was great! He was prompt, knowledgeable and got the problem fixed quickly. I would absolutely recommend Capital Heating and Cooling!", "pics": null, "resp": {"time": 1622036042884, "text": "Hi Alice, we are so pleased to hear about this! We will make sure to pass along the kind words to Matthew."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "106371633847360577466", "name": "Tony Nichols", "time": 1623285368327, "rating": 5.0, "text": "I recently used Capital Heating and Cooling to install a 22kw Generac generator at my home.  I was extremely pleased with the service I received.  Tommy Oswalt came out and did an initial site assessment and gave me a very realistic look at all the work necessary and the expense involved.\n\nOnce the generator arrived, technicians Ben House, Eric Gray and Colby Winham came out to pour a pad on the slope beside my house.   Because of the steep slope, they had to build a form to pour a slab for the generator to sit on.  Our generator was installed the next week and being in the service industry myself, I was very interested in each stage of the process.  The guys all did a fantastic job of making the installation look neat.  When Hoover inspectors came out to give their final inspection, it was apparent that they had worked with Capital Heating & Cooling often enough that they knew everything would be up to code and signed off on the job without a comment.\n\nAll the guys were very professional and did exceptional work.  The office staff also went out of their way to help make sure Spire followed through and installed a larger gas meter  (Thanks Laura)\n\nI could not give Capital Heating & Cooling a better review. Job well done!😃", "pics": null, "resp": {"time": 1623340234864, "text": "Tony, thank you so much for the positive feedback. We appreciate your patience while we worked with Generac, Hoover Inspections, and Spire to get everything set up. We will pass your review on to our technicians as well! Please don't hesitate to give us a call if you need anything else."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "106844026581135742235", "name": "Africa Green", "time": 1615597043163, "rating": 5.0, "text": "Excellent Service all the time. The techs are professional and friendly. I appreciate the care that the office staff takes with scheduling and being proactive in sharing the details of who we should expect for upcoming service appointments.", "pics": null, "resp": {"time": 1615815557552, "text": "Hi Africa, thank you for the kind review. Your feedback means so much to us!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "115722224883236599755", "name": "George Potter", "time": 1624389331649, "rating": 5.0, "text": "They were on time and very professional. All of them were friendly and helpful. We will use this company again.", "pics": null, "resp": {"time": 1625764631547, "text": "George, thank you so much for the kind words! We are so happy to hear that you will be using us again."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "114347431500765345958", "name": "david turner", "time": 1613578553212, "rating": 5.0, "text": "Matthew was on-time and very knowledgeable about his job. Super nice and very helpful with next steps in the replacement process. There’s a reason these guys are the best in the business!", "pics": null, "resp": {"time": 1613579897445, "text": "We are so pleased to hear this. Thank you for the kind review, David!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "100690875489536869436", "name": "Dorian Reese", "time": 1626448285874, "rating": 5.0, "text": "Best generator installation and service in the Bham area.", "pics": null, "resp": {"time": 1626707033313, "text": "Hi Dorian! Thank you so much for the positive review and we are so happy to hear you are satisfied with your generator installation and service."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "105693269719844971998", "name": "Linda Levin", "time": 1611846870271, "rating": 5.0, "text": "Capital Heating and Cooling goes the extra mile to be professional, organized, and provide great customer service as well as do excellent work! The technician has always been on time, knows his craft, and is focused on good customer service. I have great confidence in using them for my HVAC needs.", "pics": null, "resp": {"time": 1611849352807, "text": "Hi Linda, thank you for such a kind review. We are so happy to hear about your pleasant experiences with us!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "114089033267294448335", "name": "Corey Kearse", "time": 1624635536891, "rating": 5.0, "text": "Hands down most qualified and professional company I have ever dealt with. I have worked with Capital many times on various issues and they are the best. I have no reservation whatsoever about recommending this company to anyone. They also service our Generac generator.", "pics": null, "resp": {"time": 1614625335785, "text": "Hi Corey, thank you for the kind words. We are so appreciative of your feedback and are pleased to hear about your pleasant experiences with Capital!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "105100900896704194457", "name": "Darla McMullen", "time": 1615923480607, "rating": 5.0, "text": "I had an annual inspection on my whole house generator. My technician, Colby, was efficient, knowledgeable, timely, and amazingly nice! What a positive experience.", "pics": null, "resp": {"time": 1615924726399, "text": "Hi Darla, thank you for the kind words. We will be sure to forward this along to Colby!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "117513818501972184801", "name": "Warren Cain", "time": 1623077945637, "rating": 5.0, "text": "Capitol installed a Generator and did a super job!\nVery nice service men and I’d recommend them to everyone!!!!", "pics": null, "resp": {"time": 1623158567992, "text": "Thank you for the kind review, Warren! We are so pleased to hear this!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "104571011565615219450", "name": "Sharon Kain", "time": 1615416968759, "rating": 5.0, "text": "Very kind and patient technician. Seemed so conscientious. Was determined to solve my problem and he did. Made necessary repairs and completed the maintenance.", "pics": null, "resp": {"time": 1615476380356, "text": "Thank you for the kind words, Sharon! We will be sure to pass this along to our technician :)"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "102498253781485661490", "name": "Joe E. Jones", "time": 1623710870876, "rating": 5.0, "text": "If you are concerned about service...this is the place for you. We had an issue with our Generac generator on Memorial Day. Called Tuesday morning and a technician was here the same afternoon. You won’t find any better customer service.  Joe and Jane Jones, Clanton.", "pics": null, "resp": {"time": 1623762250090, "text": "Joe, sorry you had an issue with your generator, but glad we were able to get it resolved. Thank you for the review!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "110964830631523381124", "name": "James Borders", "time": 1617457808485, "rating": 5.0, "text": "Mr. Oswalt was very professional and easy to talk to about installing a Generac generator.", "pics": null, "resp": {"time": 1617626781900, "text": "Thank you for the kind review Mr. Borders! We will make sure to pass this along."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "106641666493309241317", "name": "Matthew Moseley", "time": 1624468450317, "rating": 5.0, "text": "I called a bit before 10am and Bill had arrived and repaired my unit before noon! You couldn’t ask for more prompt service!", "pics": null, "resp": {"time": 1625764381065, "text": "Matthew, thank you so much for the kind words! We appreciate your positive feedback and are so happy to hear about your pleasant experience!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "108275318354155217531", "name": "Dennis Williams", "time": 1617314008680, "rating": 5.0, "text": "Estimate for whole house Generac generator and installation.  Excellent price and outstanding service.", "pics": null, "resp": {"time": 1617367399860, "text": "Hi Mr. Williams, thank you so much for the kind review. We are so pleased to hear this!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "103477786037965534758", "name": "Kathy Love", "time": 1610590350853, "rating": 5.0, "text": "Capital Heating is our go to AC Hearing company and has served our family for 20 years as well as our children’s homes and parents.  They are professional reasonable on time  and honest. We will always call Capital when we have AC and heating needs.", "pics": null, "resp": {"time": 1610636818804, "text": "Hi Kathy, thank you for such a kind review. We are so happy to hear this!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "107810049384582228362", "name": "Ken Osvath", "time": 1613419062998, "rating": 5.0, "text": "Over the years we had used a handful of HVAC service companies.  Capital Heating & Cooling earned our trust the first time they provided service; and has continued to keep it by consistently providing excellent customer service, quality and communication.", "pics": null, "resp": {"time": 1613421076488, "text": "Ken, thank you for the thoughtful review! We are so appreciate of the feedback and are thrilled to hear about your pleasant experiences with us."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "116344692198890619182", "name": "Vicky Fuqua", "time": 1606927681599, "rating": 5.0, "text": "My generator was not working. I called and they came the very next day. They arrived 10 minutes ahead of the specified time. They identified the problems and explained what needed to be done to get it running. They answered my questions and told in detail what my options were and the cost involved.\nThey were in and out in 2 hours and my generator is working. They were friendly and courteous and I will definitely call them again if I have any further issues.", "pics": null, "resp": {"time": 1607360015543, "text": "We're so happy to hear this, Vicky. Thank you for your feedback!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "113439810441402404419", "name": "David Abbott", "time": 1626758402898, "rating": 5.0, "text": "Technician serviced my Generator. Was very professional and friendly. The office staff was also very professional and courteous. We have used them before and had same experience.", "pics": null, "resp": {"time": 1579037077502, "text": "Thanks for the review, David!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "100469085969788119527", "name": "Harold Fleming", "time": 1605197000658, "rating": 5.0, "text": "Had a nice service call with Capital today. Our technician was very courteous, thorough and knowledgeable, and was readily able to address the problem and make recommendations. We will definitely use them again!", "pics": null, "resp": {"time": 1605795968021, "text": "Thank you for the five star review, Mr. Fleming! We appreciate the feedback."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "117456609379777367463", "name": "Terry Yarbrough", "time": 1615914335725, "rating": 5.0, "text": "Very pleased with the service. Would definitely recommend.", "pics": null, "resp": {"time": 1615915210907, "text": "Hi Terry, we are so happy to hear this. Thank you for the kind feedback!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "114173315171240370439", "name": "Lindsey Godlewski", "time": 1597415820410, "rating": 5.0, "text": "Capital is Exceptional! They have always been on time, all their employees are respectful, knowledgeable, honest and professional. I feel like I’m in great hands when Bill shows up (he’s such a great asset to your business) and Cindy is always so pleasant to speak with on the phone, she is so nice, helpful and immediately takes care of what need. Their business is very well run. I will only call Capital for all my HVAC needs.", "pics": null, "resp": {"time": 1597434503741, "text": "Lindsey, thank you so much for the great review! We really appreciate it."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "104836541246351007616", "name": "Phil Ferguson", "time": 1616516419660, "rating": 5.0, "text": "Installed Generac generator: on time, professional, finished in record time.  Gives us peace of mind, very clean job, very considerate personnel.  We are glad to be Capital customers!", "pics": null, "resp": {"time": 1609855500864, "text": "Thanks for the 5 stars Phil! We highly appreciate it."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "108270190959681507825", "name": "Stuart Sentell", "time": 1608643933682, "rating": 5.0, "text": "Installed our heat pump over ten years ago and have done a good job maintaining it twice a year. Good company to work with, and professional workers!", "pics": null, "resp": {"time": 1608657880300, "text": "Hi Stuart, thank you for the thoughtful review. We are so happy to hear about your pleasant experience with us throughout the years!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "115743177315789155209", "name": "Jane Jones", "time": 1612535395227, "rating": 5.0, "text": "We had a Generac generator installed on Feb. 4, 2021 and we wanted to share our experience.  From the time  Tommy came to our home to give us a  quote until the job was finished you could not expect a better transaction. They called to tell us they would be at our home at 7:30 and actually arrived a few minutes before.  Ben, Eric and the rest of their crew were very professional and thoroughly knowlegable of all the instellation.  You will not be disappointed to use Capital Heating and Air.  Joe & Jane Jones, Clanton", "pics": null, "resp": {"time": 1612548394041, "text": "Hi Mrs. Jane, thank you for such a thoughtful and kind review. We appreciate the positive feedback and are so pleased to hear about your pleasant experience!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "104210202672609099705", "name": "Albert Pacifico", "time": 1612396188556, "rating": 5.0, "text": "Installed a Trane HVAC system which because of location was difficult. Did a great job.very pleasant  high quality technicians.", "pics": null, "resp": {"time": 1612454852602, "text": "Thank you for the kind review, Albert. We will be sure to relay this to our technicians!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "112343344380358462458", "name": "Jubal Watts", "time": 1626712438453, "rating": 5.0, "text": "Reinstalled generator that was not installed correctly.", "pics": null, "resp": {"time": 1626803804690, "text": "Thank you for the 5 star review, Jubal! We appreciate your business."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "102408863600453429416", "name": "Phil Garratt", "time": 1602790670455, "rating": 5.0, "text": "Capital Heating & Cooling has been maintaining my HVAC systems for 15 years. Their technicians always provide excellent, professional, and courteous service. The fact that so many of them have been with Capital for 20+ years is impressive by any standard.", "pics": null, "resp": {"time": 1602865789580, "text": "Phil, thank you so much for the positive review and feedback! We really appreciate it."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "109390660061792536416", "name": "Jan Kuykendall", "time": 1612826084111, "rating": 5.0, "text": "We are always happy with Capital Heating and Air.  Service is efficient and staff are knowledgable and courteous.", "pics": null, "resp": {"time": 1613073186482, "text": "Hi Jan, thank you for the kind review. We appreciate the feedback!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "106063833179881880025", "name": "Anita Slater", "time": 1594154270599, "rating": 5.0, "text": "Always pleased with the attention to detail and quality service. Also, the technician today (David Cooper) wore a mask while inside my home, since we are still in the midst of a pandemic. 🙏🏾 I wore mines to protect him😷😊. He did a great job.", "pics": null, "resp": {"time": 1594217301539, "text": "Thank you for the great review, Anita! We will let David know he's doing a great job."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "104323874040300898510", "name": "Linda Warren", "time": 1609886037142, "rating": 5.0, "text": "Very pleased with professional service!  Will certainly use again for any problems we may have in future.", "pics": null, "resp": {"time": 1609886999713, "text": "Hi Linda, we are so happy to hear this! Thank you for the review!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "109081279785037885523", "name": "Vicki Ethridge", "time": 1598903811819, "rating": 5.0, "text": "Excellent work installing my new heat pump. I trust Capital for their expertise, trustworthiness, and professionalism. Mike, Tim and David were also respectful of me and my home.", "pics": null, "resp": {"time": 1598969751783, "text": "Thank you for taking the time to leave us a review! We appreciate your feedback and will pass your review on to the guys."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "116899580948661063412", "name": "Susan Cotten", "time": 1625168600442, "rating": 5.0, "text": "Been using Capital Heating and Air for years.   Prior to working with them, we hadn’t had satisfactory service from several HVAC companies.   We’ve had nothing but positive experiences with CH&A", "pics": null, "resp": {"time": 1625171190361, "text": "Hi Susan, we love to hear you have had only pleasant experiences with us. We are so appreciative of the kind feedback!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "110623843783796117205", "name": "Edward Bromberg", "time": 1616787156625, "rating": 5.0, "text": "Generator repair. Excellent response and service.", "pics": null, "resp": {"time": 1583525105137, "text": "Thank you for the review, Edward!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "100813214384810707767", "name": "Mark Williams", "time": 1520792097089, "rating": 5.0, "text": "Capital Heating & Cooling replaced the A/C portion (indoor evaporator coils and outdoor condenser coils) of two Trane HVAC systems at my home, one for the main level and one for upstairs. I am very happy with their work. They took the step of identifying that the original pvc piping used for the drain for the unit in the attic was not draining effectively (a worker in the attic poured a gallon of water into it while another worker in the garage observed and noted the water did not make it to the drain in the garage) and they corrected that, mounting fasteners in multiple places along the PVC pipe to ensure it sloped properly in its run across the attic, and they replaced the rusted overflow tray beneath the HVAC unit. They also eliminated the traps in the drains for both units, which is where algae would always build up; the traps were apparently redundant because both drains feed into a drain in the garage floor that has a trap beneath the concrete floor. They left straight cleanouts in place of the p-traps which should reduce algae buildup, and I can still pour vinegar or chlorine to reduce algae. The three workers, Bobby, Jason, and Matt seemed trustworthy and very competent. The installation looks really well-done.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMNtZtWINf9Qz3pwUGmLBrONsriWNdjQ1M6r58E=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMgujQlXd1z7Tnxc12p_Q1jtfShcq0ie9Db3P7p=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "103216296300285455621", "name": "Nancy Roderick", "time": 1616164371234, "rating": 5.0, "text": "Did a great job quickly and was professional and friendly", "pics": null, "resp": {"time": 1616165879639, "text": "Thank you for the kind words, Nancy. We will make sure to pass this along to our technician!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "107174007599407191773", "name": "Leanne Rogers", "time": 1611789995939, "rating": 5.0, "text": "Matthew was very friendly, polite, considerate, and professional! I would welcome him back for my spring maintenance!", "pics": null, "resp": {"time": 1611849279178, "text": "Hi Leanne, thank you for the thoughtful words. We will make sure to pass this along to Matthew!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "103738476137061040264", "name": "Cynthia Broom", "time": 1598039058472, "rating": 5.0, "text": "Great company. Honest, dependable& friendly. They email picture & info about technician. Very trustworthy. I use them for generator & HVAC. .", "pics": null, "resp": {"time": 1598273241135, "text": "Thank you for the review! We appreciate the feedback."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "106299837382959742845", "name": "Rod Yates", "time": 1605749763264, "rating": 5.0, "text": "Serviceman, Mathew was very professional and polite.  He serviced our HVAC system.", "pics": null, "resp": {"time": 1605796136572, "text": "Thank you for the review, Mr. Yates! We will pass your kind words on to Matthew."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "104644196760273603961", "name": "Ken M", "time": 1592862456387, "rating": 5.0, "text": "Great experience once again with Capital.  I've used them for many years & they've never disappointed me.  Great job, guys!  Keep up the good work!", "pics": null, "resp": {"time": 1592917510661, "text": "Thank you, Ken! We appreciate the kind words."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "107468489862981003778", "name": "Sunny Gilliam", "time": 1590264913353, "rating": 5.0, "text": "Everything went so smoothly. Its comforting to know my Generac is \"standing by\" and Capital is there if I need them!\nTommy the owner, is very professional and on top of things.\nWill definitely use Capital in the future!\nThanks Tommy and your staff as well.", "pics": null, "resp": {"time": 1592829898592, "text": "Thank you for the review and kind words, Sunny!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "111606190163857868105", "name": "Brian Landry", "time": 1593200481365, "rating": 5.0, "text": "Ben and his helper were awesome. This was a pre-purchase of a home inspection. Ben went out of his way and normal to help me.  Will definitely use Capital again and highly recommend them.", "pics": null, "resp": {"time": 1593434458592, "text": "Thank you for the review, Brian!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "108073037676852584182", "name": "Cherie Martin", "time": 1605022045769, "rating": 5.0, "text": "Specifically, Ben came out and knowledgeably started up our generator.", "pics": null, "resp": {"time": 1605795931977, "text": "Thank you for the review, Cherie! We will pass the feedback on to Ben."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "102351666947223293237", "name": "Jessie Lien", "time": 1605791071058, "rating": 5.0, "text": "Great service, friendly ,knowledgeable and trustworthy.thank you guys all you do 👍", "pics": null, "resp": {"time": 1605796198140, "text": "Thank you for the review, Jessie! We really appreciate the feedback."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "110457577494868668921", "name": "Vivian Swaim", "time": 1607997597485, "rating": 5.0, "text": "Good service. Have been using them for a number of years now.", "pics": null, "resp": {"time": 1608155463527, "text": "Thank you for the kind review, Vivian!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "110348196327161146192", "name": "Valerie Wallace", "time": 1600467972941, "rating": 5.0, "text": "The technician did a great, concise job. He was very professional and knowledgeable of the work required.", "pics": null, "resp": {"time": 1600693743658, "text": "Thank you for the review, Valerie! We appreciate the feedback."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "100149710736751319951", "name": "Andrew Bowers", "time": 1599058535473, "rating": 5.0, "text": "Super knowledgeable technician. Rectified issue and provided suggestions for maintenance items that would be coming up for generator.", "pics": null, "resp": {"time": 1599073432750, "text": "Thank you for the feedback and 5 star review, Andrew!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "114616390046414229747", "name": "Elizabeth B", "time": 1625874176777, "rating": 5.0, "text": "Most thorough maintenance I've ever had! Matthew was very professional and friendly. He was polite and knowledgeable. Thank you!", "pics": null, "resp": {"time": 1595008907056, "text": "Thank you for the kind review, Elizabeth! We will let Matthew know he's doing a great job."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "103071478479977923476", "name": "WesAmy Ward", "time": 1587585953174, "rating": 5.0, "text": "We had a wonderful experience today.  Our technician was prompt, knowledgeable and friendly.  We loved that we received an email with a confirmed time and picture and name of the technician that was coming.  Thanks Capital H&A.", "pics": null, "resp": {"time": 1589463866001, "text": "Thank you for the kind words and review!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "104831222634260170910", "name": "Marsha Twiford", "time": 1607121946359, "rating": 5.0, "text": "Very pleased with Capital Heating and Air from start to finish ! Highly recommend!", "pics": null, "resp": {"time": 1607359796845, "text": "Hi Marsha, thank you for the review. We appreciate your feedback!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "107178711765203589346", "name": "stevenh", "time": 1594758508077, "rating": 5.0, "text": "On time,and knew how and what to fix. Very professional and my unit is working and cooling our home. Would definitely use these folks again", "pics": null, "resp": {"time": 1594819947084, "text": "Thank you for the kind review, Steve!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "100659450741394003545", "name": "Richard Rogers", "time": 1597185004332, "rating": 5.0, "text": "This was for annual scheduled generator preventative maintenance.  Love you guys!!!  Bill & Eric were consumate profesionals! Great experience!", "pics": null, "resp": {"time": 1597244049357, "text": "Thank you for the kind review, Richard! We will pass it along to Bill and Eric."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "103367755454629020755", "name": "lori weil", "time": 1609362389194, "rating": 5.0, "text": "Responded immediately, always call to keep me up to date on arrival time, good workmanship and very professional...highly recommend!", "pics": null, "resp": {"time": 1594071696417, "text": "Thank you so much for the five star review, Lori! We appreciate the feedback."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "110110643929791639585", "name": "William Compton", "time": 1619523084232, "rating": 5.0, "text": "Knowledgeable service technician", "pics": null, "resp": {"time": 1619532732994, "text": "Hi William, thanks for the kind review. We will make sure to pass this along to our technician!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "106352675042876070821", "name": "John Pfaudler", "time": 1593655821438, "rating": 5.0, "text": "Great job by Capital heating and cooling. They have been friendly and took care of my project. They left my house clean and exactly the way they found it.", "pics": null, "resp": {"time": 1593715719450, "text": "Thank you for the kind review! We appreciate it."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "112008609891971267128", "name": "Richard Barrett", "time": 1596219622803, "rating": 5.0, "text": "Matthew was friendly, knowledgeable, and helpful. The work was done cleanly and efficiently.", "pics": null, "resp": {"time": 1596459049974, "text": "Thank you for the review, Richard!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "101685222076800288163", "name": "Donna Hardiman", "time": 1592578639088, "rating": 5.0, "text": "Matt was professional, on time, did a thorough job. Didn't leave a mess to clean up", "pics": null, "resp": {"time": 1592584952687, "text": "Thank you for the review, Donna! We will let Matt know."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "113539619175239410577", "name": "Jerald Ainsworth", "time": 1579901134441, "rating": 5.0, "text": "Guys did the job just as they indicated they would. Courteous and efficient. I really appreciate how they hide elements of the job so finished product is clean looking.", "pics": null, "resp": {"time": 1580130638249, "text": "Thank you for the review! We really appreciate the feedback."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "111278964797399450066", "name": "phillip thrash", "time": 1606930254983, "rating": 5.0, "text": "Workers on time and very nice an knowledgeable of work to be done 😁", "pics": null, "resp": {"time": 1598273258369, "text": "Thank you for the review!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "103082096524253342748", "name": "Brandon Peeples", "time": 1566416667837, "rating": 5.0, "text": "Excellent experience from start to finish! Our technician Micah was prompt and diagnosed the issue immediately. Took maybe a total of 30 minutes. They came highly recommended and did not disappoint!! Great company and will be using them again!!", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "107259056708302583836", "name": "Enrique Ruiz", "time": 1619572607999, "rating": 5.0, "text": "Great service  !", "pics": null, "resp": {"time": 1619704116077, "text": "Thank you for the 5 stars, Enrique! We very much appreciate it."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "104310815458163873627", "name": "Joanna Stockard", "time": 1594820208786, "rating": 5.0, "text": "Excellent customer service. Techs are always knowledgeable and courteous!!!", "pics": null, "resp": {"time": 1594828623171, "text": "Thank you for the kind review, Joanna!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "116685066760830790829", "name": "Ty Dodge", "time": 1564148840292, "rating": 5.0, "text": "Responsive... actually listen to the consumer... staff at every level is friendly, courteous, helpful, and diligent... installation and cleanup were pristine... Did I mention they employ great people? And does it get any better than that?", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "114640973160791747352", "name": "Helene Griffith", "time": 1582344271511, "rating": 5.0, "text": "They come on time and do a beautiful job like they say they are going to do.. Clean up and leave in pristine condition... Very pleased always with Capital.", "pics": null, "resp": {"time": 1582554658945, "text": "Thank you for the kind review, Helene!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "117265431053118373667", "name": "Jason Green", "time": 1614556635933, "rating": 5.0, "text": "I am Linda young posting this review - Jason Green is my grandson and this is his google account!", "pics": null, "resp": {"time": 1614695659794, "text": "Hi Linda! thank you for 5 stars, we sincerely appreciate it!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "104632309817237322549", "name": "William Cowley", "time": 1578866791581, "rating": 5.0, "text": "Our relationship with Capital Heating and Cooling is long standing.  We have come to expect, and  receive the best service carried out by knowledgeable and pleasant service personnel.\n\nWe feel we are dealing with long term friends.", "pics": null, "resp": {"time": 1578924467817, "text": "Thank you for the review, William! We appreciate the kind words."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "104664306842728888861", "name": "Kevin Walsh", "time": 1587676341005, "rating": 5.0, "text": "Good experience all around! Came on time; diagnosed the problem: explained the situation: recommended fix: offered advice going forward. I would b ecstatic if everyone who did work 4 me was this professional.", "pics": null, "resp": {"time": 1589463877637, "text": "Thank you for the kind words and review!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "104075845181127452385", "name": "Holly Lamb", "time": 1593700949712, "rating": 5.0, "text": "Matthew was our technician and he was outstanding! 😊 Can't say enough about how pleased we are with the service.", "pics": null, "resp": {"time": 1593715939989, "text": "Thanks for the 5 star review, Charlie! We will let Matthew know."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "118147498944109552597", "name": "Becky Neel", "time": 1615572929187, "rating": 5.0, "text": "Installed Generac backup generator", "pics": null, "resp": {"time": 1615575118648, "text": "Thank you for the 5 stars, Becky! We very much appreciate it."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "102124825330303552138", "name": "Jim Collins", "time": 1586006699922, "rating": 5.0, "text": "Capital Heating has been handling our heating and cooling needs for decades.  They just keep getting it right. Look no further.  These are the \"good guys.\"", "pics": null, "resp": {"time": 1589464072244, "text": "Thank you for the kind words and review, Jim!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "115737831356643517915", "name": "Kristina Vance", "time": 1584109289452, "rating": 5.0, "text": "Bill was great! He was early for our appointment & super helpful & knowledgeable about our unit. Thanks, Bil & Capital!", "pics": null, "resp": {"time": 1584142317199, "text": "Thank you Kristina! We appreciate the kind words and will pass them on to Bill."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "113736652802098362080", "name": "JL Shaia", "time": 1585319746222, "rating": 5.0, "text": "Ben is always so prompt and professional.    He has been servicing my generator for years and i always know I can trust his advise .", "pics": null, "resp": {"time": 1589463057748, "text": "Thank you for the kind words! We will pass them along to Ben!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "114769523310314938010", "name": "esther holloway", "time": 1556225149362, "rating": 5.0, "text": "I truly cannot say enough about the quality of service that was done on my newly installed HVAC. First I received a call to let me know the technicians where on there way next I received an email with a picture of each installer with work history. They arrived on time, and was very knowledgeable about their product.  Very respectful and cleaned up all debris. Continued to work until the job was complete. And if that's not enough the price was very reasonable less than I had estimated. All I can say is KUDOS to such a classy and efficiently ran company. Thanks to Bobby and Sam my installers and Cindy who took my call.", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "108036176148632466877", "name": "Timothy Mann", "time": 1557251702975, "rating": 5.0, "text": "We've had Capital Heating & Cooling service our HVAC systems for years.  There are clear reasons for that.  Ease in scheduling, on time arrival, professional service, expertise, reasonable fees, and an overall seamless process.  Today, we had our units serviced for the coming summer months.  The service technician was Jason--outstanding, courteous, thorough, great work, and clear on his communication.  I highly recommend this outfit!", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "111421304472269363884", "name": "Joan McLendon", "time": 1586878843020, "rating": 5.0, "text": "We would not use any other service provider for our HVAC or generator.  We can always depend on Capital for excellent and honest service!", "pics": null, "resp": {"time": 1589464015839, "text": "Thank you for the kind words and review!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "107593521216912489956", "name": "JOHN AKERS", "time": 1587494962009, "rating": 5.0, "text": "Service  technician was on time, new what he was doing and the price for the service was good", "pics": null, "resp": {"time": 1589463893248, "text": "Thank you for the review!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "116651740225641458728", "name": "Tyler Howard", "time": 1556386736840, "rating": 5.0, "text": "Great business , was referred by a friend who raved about their service . Jason came out to my house ahead of schedule, found several issues and fixed every single one of them. Very transparent on pricing, what exactly they are doing, and service in general. They will keep your service records and call out to you to schedule your semiannual service when needed. This is a great company!", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "107756240984845720982", "name": "Keith Bobitt", "time": 1622757080807, "rating": 4.0, "text": "Tech was very professional and knowledgeable.", "pics": null, "resp": {"time": 1599073454075, "text": "Thank you for the review, Keith!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "114766827218419826372", "name": "Gloria bell", "time": 1578527816655, "rating": 5.0, "text": "Always very nice and efficient service and repair men and also office personal .", "pics": null, "resp": {"time": 1578586465282, "text": "Thank you for the kind words, Gloria! We appreciate the feedback."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "102480414439257990808", "name": "Anita Stewart", "time": 1558111471181, "rating": 5.0, "text": "I have been using Capital Heating & Air for many years. They have installed 2 systems for me and do all my maintenance. Would recommend them to anyone. Great people that work there...", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "104162262919824458184", "name": "Fil Gilmer", "time": 1521854938152, "rating": 5.0, "text": "I was in the market to replace both of my AC units.  A conversation with two of Capital's techs working on a neighbors house led me to call Tommy for an evaluation and quote.  i knew the brand of product I wanted.  We discussed my needs that included improvement of air flow to a certain part of my house. We agreed on brand specific units and an upgrade in air filtration.  I received Tommy's quote and compared with two others.  Capital's crew (5 trucks) arrived on time.  I was very impressed with the professionalism of everyone who spent the entire day removing old equipment and installing the two new units.  Each had a task to perform and if one got through he jumped in and helped the others.  Great teamwork.  From start to finish this ended up being a no brainer.", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "103917249249385566889", "name": "Adam Sleeper", "time": 1536779512398, "rating": 5.0, "text": "Bobby is a professional, courteous, and easy to talk to guy. Did a thorough diagnostics of my AC. Had the part I needed on the truck. Took it upon himself to call Trane to check the warranty on my system. Saved me $100. Hard to beat that.", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "110673796836591419200", "name": "John Sanford", "time": 1585330158111, "rating": 5.0, "text": "The technicians are always pleasant, professional, competent and good representatives of the company.", "pics": null, "resp": {"time": 1589463083827, "text": "Thank you for the kind words!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "106857963606228547653", "name": "Terry Poole", "time": 1582929284617, "rating": 5.0, "text": "Great company!! Very trustworthy and responsive to our needs.", "pics": null, "resp": {"time": 1582999253700, "text": "Thank you for the kind words! We appreciate the feedback."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "112375570795402823611", "name": "Hsiu-Fang Liu", "time": 1557155474997, "rating": 5.0, "text": "Jason came  at 8 am right on time to do the AC maintenance. He took his time to do the maintenance and answered all my questions patiently! I like this company, very professional and I trust them!", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "112377125170279497787", "name": "Justin Heberling", "time": 1535423007202, "rating": 5.0, "text": "Capital Heating and Coling is top notch and focused on service. Our air went out last week and Matt went out of his way to get the air going again but we knew it would be short lived and went ahead and scheduled to have the system replaced this week. As we predicted the system died Saturday afternoon. Matt reached out and was able to get us moved up to Monday. The team that installed the new system did a fantastic job. They were very professional and we greatly appreciated the bio about the lead technician that was emailed prior to the install. I would definitely recommend Capital Heating and Cooling!", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "114864396076719746743", "name": "Red Stepchild", "time": 1496608555850, "rating": 5.0, "text": "Mr. Bill is AMAZING! He can fix ANYTHING! He's that honest guy neighborhood guy you keep on speedial in your phone. We are always VERY pleased with his work.\nWe will call and request him every time.", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "115978021819051779829", "name": "leslie kearse", "time": 1545401788159, "rating": 5.0, "text": "I would recommend Captial Heating & Cooling to anyone looking for any sort of HVAC work. They replaced our entire system and everyone that worked on the job was extremely courteous and professional. They went the extra mile to make sure the job was done right. I have no reservation whatsoever about recommending Capital for a full replacement or any type of repair work.", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "117517815778027445913", "name": "Joan McLendon", "time": 1518788005440, "rating": 5.0, "text": "We have used Capital for the last 15 years and would never use anyone else.....from HVAC to generator maintenance, they are the best! They come when they say they will and their pricing is very fair - everything is explained before any service is done.  I really don't think anyone would be disappointed!", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "117171020147261306702", "name": "Lloyd Rafalsky", "time": 1477063341016, "rating": 5.0, "text": "We have used Capital Heating and Cooling for many years and are very pleased with them and their service people. When we have a problem they take care of it quickly and don't make us wait days or weeks .\nThe men do a good job and they come when they say they are coming...and also give you a call to say the service person is on their way so you don't have to wait around all day!\n\nLloyd and Gail Rafalsky", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "104957089367525601388", "name": "CL Kraft", "time": 1609174283666, "rating": 5.0, "text": "Generator maintenance and HVAC maintenance", "pics": null, "resp": {"time": 1609182318711, "text": "Thank you so much for the 5 stars!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "110836786921868360188", "name": "Khris McAlister", "time": 1587995989759, "rating": 5.0, "text": "On time, efficient, competent.", "pics": null, "resp": {"time": 1589463791321, "text": "Thank you for the review!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "109047723180058259252", "name": "John Bergquist", "time": 1564665850864, "rating": 5.0, "text": "Excellent service over many years", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "106052443623313179289", "name": "Sandra Smith", "time": 1556831970334, "rating": 5.0, "text": "Highly recommended and great first visit.", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "101690870461322938369", "name": "Mark Klause", "time": 1372437732124, "rating": 5.0, "text": "I had a very pleasant experience using this company to replace my old Ruud AC units with new Trane units.  They came out the same day to inspect the problem and installed the new 410A units the next day.  Would high recommend using them.\n\nMark", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "107368853655969290098", "name": "Mike Aday", "time": 1615820795619, "rating": 4.0, "text": "Great crew", "pics": null, "resp": {"time": 1593715961013, "text": "Thank you for the review!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "107985755652476464745", "name": "MeMe Tresh Johnson", "time": 1569893493699, "rating": 5.0, "text": "They have been amazing", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "103240257937903480652", "name": "Naji Constantine", "time": 1596660465489, "rating": 5.0, "text": "Great experience!!", "pics": null, "resp": {"time": 1589463781050, "text": "Thank you for the review!"}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "109483270834128517845", "name": "Tish Patton", "time": 1519949952700, "rating": 5.0, "text": "Very professional and efficient.", "pics": null, "resp": null, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "102685323674039405163", "name": "Kati Bullock", "time": 1469040517627, "rating": 2.0, "text": "If you are a business, beware that they will not trust you to give invoice and be paid later. They will want payment right then. We unfortunately ran into this  issue with them. Our corporate office pays these bills and we had to stop the repair and find someone else.", "pics": null, "resp": {"time": 1472839823863, "text": "Kati is correct, we did not proceed with the repairs because payment had to be processed through a corporate office. We did apologize to Kati for the inconvenience but our policy is to collect after repairs are complete unless prior arrangements have been made."}, "gmap_id": "0x8889211833afed27:0x4ff4abb6cd4fbd2f"}
{"user_id": "117729305278777176735", "name": "Annie May", "time": 1598852709190, "rating": 5.0, "text": "Current Electrical and Generator Services installed a Generac generator for me. They were courteous and professional. They kept me informed every step of the way. They got with all the necessary contractors went to the city obtained the permits needed and scheduled with Alabama power. They made sure I had nothing to worry about and followed up. Awesome company I highly recommend them.", "pics": null, "resp": {"time": 1612885331991, "text": "Thank you Mrs May for writing such a wonderful review. We appreciate your time and look forward to continuing to serve you."}, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "102788713845751992909", "name": "R.G. Watson", "time": 1614880367626, "rating": 1.0, "text": "Zero effort customer service! Don’t expect any help at all while looking for a part for your DR equipment. I guess they don’t have computers or the skill to use one and help you find a part.", "pics": null, "resp": {"time": 1622034434492, "text": "Hello, would you like to expand on your visit? We always strive to support our customers in any way possible and would like to know more about your situation."}, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "100298736914800652632", "name": "HawkPilotUSA", "time": 1605306938841, "rating": 2.0, "text": "After years of performing my own spark plug, oil change, filter change and basic upkeep and documenting each service...I called Current Electrical to schedule a service and firmware upgrade. I do not have the capability or knowledge to update the unit and couple that with another spine issue preventing me from the physical aspect of the task- it was the logical choice to call the folks that sold me the unit.   I was told that if more than a year passed without them performing a service that I would pay an additional $198 on top of the $289 service.  After receiving over $5000 from my family for a 22kw Generac generator installation they have the nerve to charge what I see as a penalty of $198 because I didn’t use their services every year.  A basic service for me costs approximately $50-$60 to purchase the Generac OEM kit.  My labor is free.  When asked about their policy a lady who spoke with me stated it’s their policy.  Then went the route of telling me a hypothetical situation like “...if a technician comes out...whatever he touches ... he’s responsible for...that’s why we charge the fee.”  So I asked, “...so if he comes out and everything is ok and it just needs a service do you skip the $198 charge?”  She said”no.” I thanked her and found another Generac dealer company that has already provided me with a service date.  Be aware of your future responsibilities to this company that installs your generator.", "pics": null, "resp": {"time": 1622034635418, "text": "Hi! Thank you for leaving a review. As we stated to you and is our policy that is listed in our documents and verbalized, we service and maintain what we sell and once that service is declined we do charge a rate to come back out on top of our service rate. We would love to speak more about this with you."}, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "100126632346088209032", "name": "Quan Young", "time": 1595952519154, "rating": 5.0, "text": "We used Current Electrical to install a generator at our home. The team was very professional and did an awesome job. We will definitely call them when needed again.", "pics": null, "resp": {"time": 1595959634977, "text": "Thank you for your review! We appreciate your business and love the feed back.  We look forward to working with you in the future!"}, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "111186999433283763844", "name": "Leslie Hyatt", "time": 1602867810830, "rating": 1.0, "text": "VERY Expensive!!!! Charged $489 for 1.5 hours of work.  Tried to discuss with the manager, and he was very rude and belittling.   Definitely not a good way to start a business relationship.  👎🏻", "pics": null, "resp": null, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "101776904384639982017", "name": "L Michael Freeman", "time": 1580158609811, "rating": 5.0, "text": "Keith has been great all along the way, following through on all details, checking in with me frequently.\nAlex and his team took care of the installation expeditiously.\nBuddy was easy to work with from beginning to end.\nAll in all, it’s been a very positive experience.", "pics": null, "resp": {"time": 1594650266421, "text": "Thank you for taking the time to write a review! We value our customers opinions. Your peace of mind is our priority!"}, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "106285121352693584174", "name": "Google User", "time": 1587161396617, "rating": 5.0, "text": "The best name in the game. Mike and the guys will get you hooked up with the perfect home generator for your price range. No more blackouts this tornado season!", "pics": null, "resp": {"time": 1591726257224, "text": "Thank you for your review.  We appreciate all feed back."}, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "100207963423343041256", "name": "Louis LaBella", "time": 1594581231677, "rating": 5.0, "text": "The most professional and pleasant group of people you will ever encounter. From the ladies that answers to the phone to Mike Walley site visit, to the Project Manager who stayed over longer to visit with me in person. GREAT EXPERIANCE!!", "pics": null, "resp": {"time": 1594650587765, "text": "Thank you for taking the time to write this review.  We value you and your time and appreciate the kind words."}, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "115846643036602580344", "name": "Larry Adams", "time": 1587410092386, "rating": 5.0, "text": "I purchased a 22KW Generac from Current Electrical earlier this year. I have been very pleased with the product and service. Buddy Kelly, the Senior Project Manager, has been particularly helpful.", "pics": null, "resp": {"time": 1591726233126, "text": "Mr Adams, We are certainly glad to hear about your experience.  We look forward to continuing to work with you."}, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "116839214978469075179", "name": "Keith Weaver", "time": 1550850023981, "rating": 5.0, "text": "I work in sales for this company and started in September of last year, (2019) I have really enjoyed working for a company that offers such a unique and needed product for homeowner and businesses. I truly believe we are the best in the business, simply because it all starts with the owner and management and these are good folks who care about their customers and employees. There is a lot of work involved with the training of staff and all that is involved with the coordination of an install. I personally care about how i treat our customers and how they are treated by our staff and have grown to know the owner, front office staff and installers and know they feel the same. As with any company we do make mistakes,  and work as a team to constantly improve. We all receive training on a monthly basis and are always looking for ways to improve our processes.", "pics": null, "resp": null, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "105477340442484255948", "name": "Mike Radowski", "time": 1569615752836, "rating": 5.0, "text": "I have had the pleasure of purchasing two pieces of DR Power equipment at current Electric and Generator Services.  The sale was quick and easy, with thorough instructions given at the time of the sale.  The staff is courteous and friendly.  I did have one issue with the pressure washer which I found out was my error, again a quick walk through was all that was needed and the problem has never returned.  Both the String Trimmer and the Pressure Washer work as advertised.  Couldn't be more pleased.  A Thanks to Mr. Tidmore for all he and his staff did for me with easy sales and solid service after the sale. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "102550387933311946325", "name": "Kelley Mize", "time": 1576424232216, "rating": 5.0, "text": "We called Lynn to inquire about a whole home surge protector. Within a week, his team installed it professionally and seamlessly. Thank you for your excellent and prompt customer service!", "pics": null, "resp": null, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "115543744218509481834", "name": "Abby Vibbart", "time": 1587659002847, "rating": 5.0, "text": "David and Mike are great and go above and beyond to get the customer the best deal they can. Generac generators are the way to go....  Some big changes coming this way in the way in regards to solar energy. I am sure these guys will be happy to fill you in...", "pics": null, "resp": {"time": 1591726189070, "text": "Thank you for taking the time to write a review!"}, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "118110440018781353313", "name": "Austin", "time": 1587159506967, "rating": 5.0, "text": "A great company that sells great products at great prices! Mike Walley is a truly professional salesman!", "pics": null, "resp": null, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "106100984442842684849", "name": "James Wilkerson", "time": 1580391267686, "rating": 5.0, "text": "My spouse and I are retired United States Marines, when we decided to relocate back to Alabama and build our home, a Generac Generator was one item we considered a must have. All of my research lead us to Current Electrical and Generator Services. We were contacted and visited by Mr. Walley who provided us with a step-by-step explanation of the entire process start to finish. His professionalism, knowledge of equipment and processes confirmed we were considering a company that provided \"First Class Customer Service.\" It was also value in knowing that a fellow United States Marine was a employee of the company. Our experience from beginning to end was nothing less than exceptional! We received a follow-up phone call from Mr. Buddy the owner of the company regarding our experience, is another reason why Current Electrical and Generator Services  is a cut above all others.\n1stSgt Wilkerson, USMC Retired.", "pics": null, "resp": {"time": 1594650499927, "text": "Mr and Mrs Wilkerson, THANK YOU SO MUCH FOR THE KIND WORDS. We value and appreciate your business and review.  We strive on customer service and the knowledge our team has to making this experience the best possible for everyone!"}, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "107284171172760305411", "name": "Sandra Wilkerson", "time": 1580388461863, "rating": 5.0, "text": "We had a complete home generator installed  and could not be more satisfied with the quality of craftmanship and skill provided by the  technicians (Derrick and Jeff), whom installed our home generac generator.\nThe Wilkersons in Pleasant Grove Alabama.", "pics": null, "resp": {"time": 1594650279388, "text": "Thank you for taking the time to write a review! We value our customers opinions. Your peace of mind is our priority!"}, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "101145050257151487360", "name": "Mark Elrod", "time": 1570652048415, "rating": 5.0, "text": "Excellent customer service and products! If you need a portable standby generator for home or business then call Mike or Dave", "pics": null, "resp": null, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "109074638683358986158", "name": "chip nieder", "time": 1570590237132, "rating": 5.0, "text": "If you're in Hoover or Shelby county, these are the best guys for a standby or whole home generator.  Call David or Mike", "pics": null, "resp": {"time": 1594650185637, "text": "Thank you for taking the time to write a review! We value our customers opinions. Your peace of mind is our priority!"}, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "112290669806492147309", "name": "Jim Payne", "time": 1555092180041, "rating": 5.0, "text": "Bought a Generac home standby generator from these guys.  Keith in sales worked with us initially and was a pleasure.  Once we had gotten a deal, Alex took over and got us set up for installation.  It was a very busy time, but they worked us in due to a cancellation a few weeks earlier than promised.  No problems at all with the install and they came back out to give us a run through and to test the transfer.  They even filed the warranty paperwork for us.  Was a real pleasure dealing with them and I expect that service will be a pleasure as well as the unit ages.", "pics": null, "resp": {"time": 1594650103436, "text": "Thank you for taking the time to write a review! We value our customers opinions. Your peace of mind is our priority!"}, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "109454407562903536865", "name": "David Waggett", "time": 1564194219310, "rating": 5.0, "text": "Very professional Organization! I would highly recommend Current Electrical to all my friends and family for any of your Generator needs.", "pics": null, "resp": null, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "106509800518364421762", "name": "Generator Installations", "time": 1554978139985, "rating": 5.0, "text": "Great folks. The man that came out was knowledgeable and polite.\nWould highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "109912092221613279281", "name": "Steve Waggett", "time": 1570757658249, "rating": 5.0, "text": "For your best deal in the Birmingham  area call David", "pics": null, "resp": null, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "114845109575553977285", "name": "Ronnie Allred", "time": 1597525446602, "rating": 3.0, "text": "Stopped by to see about getting a generator. They were supposed to call us with a quote been over two weeks. Haven't heard back from them.", "pics": null, "resp": {"time": 1597754740450, "text": "Mr Allred, we are sorry the inconvenience could you please call Becky at 256-880-1880."}, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "101017738387242438890", "name": "Brian Moore (Armyballer)", "time": 1535332282183, "rating": 4.0, "text": "They guys do great work, prices are good, only issue could be scheduling, they are busy for a reason.", "pics": null, "resp": {"time": 1594650036906, "text": "Thank you for taking the time to write a review! We value our customers opinions.  Your peace of mind is our priority!"}, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "106852331856831443604", "name": "Robert Carrell", "time": 1541362585375, "rating": 1.0, "text": "I received quotes from three providers and ultimately chose CURRENT ELECTRIC SERVICE, LACEY'S SPRING, ALABAMA for install my standby generator.  They arrived, placed a pad and installed the generator.  The guy who seemed to be in charge said that they had checked the generator and it was good to go.  My wife and I discovered that the green light, indicating that the generator was functional, was not on.  A red light was on.  This was at 11:30pm at night.  It wasn't running or doing anything weird, so I called the Generac corp. office and a man there told me how to turn the generator off.  I did such and the next day, I called CES to inform them of the problem.  I had to tell my story to three different people.  THEN they said that the owner would have to talk to me to get an 'OK' for a service call.(?)  So, I called him and he proceeded to criticize how I had handled the situation.  I didn't want to call someone out in the middle of the night for, what appeared to be a non emergency problem.  He finally okayed a tech to come out.  The tech could not find anything wrong after a 'thorough and complete' exam.\nAbout 10 days later, my wife and I were out in the yard and we heard a very loud clang sound.  Repeatedly , a harsh noise seemed to be coming from the transfer switch that goes  to the generator.   We called CES and had to tell our story to three people again and, as it was 4:30pm, we finally were referred to \"Buddie\", who said that everyone had gone home for the day.  This was their response to what sounded like a very damaging situation occurring.  I demanded to talk to the owner.  He called again and criticized me again for how I had handled the situation.  He also was abusive about how I had spoken to his employees.  The best defense is, apparently, still a good offense.  So, I went on defense reflexively.  I just wanted the machine to be fixed.  He said that it was the Huntsville Utilities problem.  He said, reluctantly, that he would call back a tech who lived in Guntersville to make a service call.  I called HU and they had no complaints of outages.  I also checked with both neighbors, who had no problem.  At this  point, the HU tech came out and he said that everything on the electrical service was in good working order.  The technician from CES arrived and examined the generator. He said that he had never seen anything like this problem before.  GREAT!!   So, he increased the idle time between my service going out and the generator startup. His parting words were that he would call Generac and find out what the problem was and would call me.  RIGHT!!   At this juncture I had had enough of CES and I transferred my warranty to Mr. Electric.  Days later the same scenario occurred with harsh clashing sounds coming from the transfer switch.   I called Mr. Electric and one person handled the problem and sent out a service tech.  He discovered that two color-coded wires had been installed to the wrong color-coded positions, rendering the machine sensing low wattage coming into my house from HU.  He took pictures of the situation and re installed the correct color wire to the correct color position and the problem was solved.  He asked if the CES techs had performed a post installation check on the generator, because this incorrect wiring pattern would have been discovered if CES had done a post installation check.  I told him that the CES guy told me that they had done the check up.  EVIDENTLY NOT!!!  He showed me the reading on the machine with the crossed wires was stimulating the generator to turn on.  The wattage read on the LED was low.  He fixed this problem and looked the entire installation over.  I have to give at least one star to CES in order to get this posted, so  one star to CES for having a pulse.  Five stars to Mr. Electric.", "pics": null, "resp": null, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "100873913425729724098", "name": "Adam Gilreath", "time": 1570049049828, "rating": 5.0, "text": "Great Team. Great Service! Would defiantly use again!", "pics": null, "resp": null, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "111878268693572929195", "name": "aun walley", "time": 1508764723807, "rating": 5.0, "text": "It is great to have stand by power with a Generac Generator. Give you peace of mind.", "pics": null, "resp": {"time": 1594650049554, "text": "Thank you!"}, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "107938685311185827088", "name": "Mark Green", "time": 1489240073967, "rating": 4.0, "text": "Friendly and knowledgeable staff, Lynn can show you what you need for your backup power needs. Also has a great line of DR brand equipment", "pics": null, "resp": null, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
{"user_id": "112638448390811487434", "name": "Richard Martin", "time": 1555613715156, "rating": 3.0, "text": "Expensive!!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88627356036de3a3:0xcf111e024483c90c"}
