{"user_id": "107468981687777212947", "name": "Anne Martin", "time": 1607086019294, "rating": 3.0, "text": "This Wine boutique is a great addition to Pour Baby. The boutique/ gift shop is a very welcoming space, bright and open.\n\nI arrived with ideas to purchase but the customer service was limited. After more than few minutes, someone asked if I needed assistance and unfortunately, it was a bit rushed. They were working with another customer when they asked.\n\nI wandered around the store, I think, about 10 - 15 minutes. I didn't have a lot of time, so I wasn't able to wait until they finished with the other customer.  There was only one person available for customer service, but it looked as though they were preparing for an event, I saw tables outside and the door was open when I arrived.\n\nThere's an array of wines, gourmet food and truffles just to name a few reasons to check this place out. I had my eye on a couple of things so I'll definitely be back when I have time to linger and browse.\n\nI didn't have an opportunity to ask about the wine tastings or the personal consults for gift baskets because of the limited service. It's easy enough to check their website for the classes and there's plenty of time to check back for basket ideas.\n\nIt's a great place to get gifts for family, friends or co-workers.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM-5ZFNFaapcS3tx93Ruwhux7aE_N2RXgEjO_qq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOtah4rBijkCp_Kp3rk7tm0VKeGaj1qAJRBdvYV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP32NkXSmibKvHUPr8KzEDEsNkMe9deczmAydGR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPa_k7YsM3aJCMZIe4CducOPwxZ0WHSMh22YtZy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM6gHyv2WISwD8cGd_PseUxk-cgcRT4LUKglDiZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMNuXbKDvNmz5w38LaQ-pEEFdeCWrh9Us8TAoY6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNvkUGT2Ka65vOyMekjnkgv7ImjIHq9L7oBgGBw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMetblD9v_JvFIi3ZyMGfW6Zo-V2YhPSPbL1cij=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMmoYQjxT4-WaomrWMUblTmd61z4VaVqbRnUxgK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOav1b93YvXmcQ0Hb-D6er4jmoJKA0aId1GgZPo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMKhnkiZMImx7PcA-RKCCWp_AqdYVvWa8mXlndP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipODZl1hLyM3im5JjbrvTZ4JEGpsqMTWSNmB4Gp-=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb32c0847c87b:0x6354c7ecf71c4ea4"}
{"user_id": "104954698127403728626", "name": "C Lynn", "time": 1577725393351, "rating": 3.0, "text": "The hours are very tight if you work until 5pm, I was excited to go in on my off day friday but was turned away by a frowning lady saying they were closed. The hours on the door showed open 10am-6pm with no closed notification there or on social media/google? A disappointment for sure but will try again another day and hope they are open.", "pics": null, "resp": null, "gmap_id": "0x889bb32c0847c87b:0x6354c7ecf71c4ea4"}
{"user_id": "112418470332960095777", "name": "Dyann Munoz", "time": 1559873256109, "rating": 5.0, "text": "My friend and I try to attend every wine pairing they offer.  So fun.  So beautifully presented and Lavone does an amazing job of selecting and prepairing the most wonderful cheese boards, salads and lovely bites.  It's a full sensory experience.  Looking forward to the next one.", "pics": null, "resp": null, "gmap_id": "0x889bb32c0847c87b:0x6354c7ecf71c4ea4"}
{"user_id": "116781036626386718424", "name": "Vicki Nicholas", "time": 1575643684232, "rating": 5.0, "text": "My new favorite place. So friendly and helpful.", "pics": null, "resp": {"time": 1575905604106, "text": "Thank you so much for the kind words! We look forward to seeing you again soon!"}, "gmap_id": "0x889bb32c0847c87b:0x6354c7ecf71c4ea4"}
{"user_id": "102815631413545269639", "name": "Karen Cormier", "time": 1558827302554, "rating": 4.0, "text": "They have a nice selection of balsamic vinegars and flavored olive oils.  Lots of gift items and wines.", "pics": null, "resp": null, "gmap_id": "0x889bb32c0847c87b:0x6354c7ecf71c4ea4"}
{"user_id": "109876929732465867477", "name": "Paula Lindon", "time": 1628029653097, "rating": 5.0, "text": "Very friendly staff. Went above and beyond to find the scent I wanted in wallflowers even though they did not have it on the floor. The sales associate with certain they had it and she looked in other places in the store and found it for me. Very impressed!", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "113393998999103138159", "name": "Jessica Cost", "time": 1620287732291, "rating": 5.0, "text": "I shopped at this location a few weeks ago for the first time and was impressed! I wasn't hounded, but yet I wasn't ignored either. The store was spiffy, the guy who helped me out on the floor was super nice and knowledgeable. And best of all... no Bridgestreet traffic!", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "101571847249574868157", "name": "Naomi Cooper", "time": 1627227480541, "rating": 5.0, "text": "Greeted immed, asked us what we were looking for, AWESOME CUSTOMER SERVICE", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "107343106038946617219", "name": "Whitney Anyanwu", "time": 1624888198943, "rating": 4.0, "text": "Very attentive staff, smaller store but has a good stock.", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "103455665376002914146", "name": "Angelia Rembert", "time": 1615736837333, "rating": 1.0, "text": "I came in after working out, the 2 ladies were so focused on me and constantly asking me questions that they couldn't see the 2 women that was stealing merchandise! I (PURCHASED) over $176 worth of what I like. Employees everyone does not steal no matter what you (look) like.", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "107814774395505029820", "name": "Shalea154", "time": 1604877689813, "rating": 1.0, "text": "We have given this store 3 different tries. Each time, the employees only care about chatting with each other or looking at their phones. This visit, I finally had to step out of line and go ask a group of 4 associates if anyone in the store is actually qualified to work a register. And by the way, the “Keith” that posted that the staff is great, works there.", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "109614625940158012225", "name": "Sarah Bradley", "time": 1610641430392, "rating": 5.0, "text": "Hours as of 1/14/21\nSunday 12p-6p\nMonday 9a-9p\nTuesday 10a-9p\nWednesday 10a-9p\nThursday 10a-9p\nFriday 10a-9p\nSaturday 10a-9p\n\nWe have updated our hours on Google numerous times, including submitting photos. It continuously reverts back to the old hours of operation. Please call the store to confirm hours if you are unsure. We are working hard to stay open and safe for our customers!", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "109774557906538374762", "name": "natashia toney", "time": 1628639000718, "rating": 4.0, "text": "They're usually pretty helpful", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "107390838624626091985", "name": "Tonio Cardenas", "time": 1606834538649, "rating": 5.0, "text": "I love this store so much it’s one one the prettiest store in Huntsville! I love the staff they are super friendly I just can’t anything wrong about them!", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "110937319386178927481", "name": "Kim Hegwoid", "time": 1629429057561, "rating": 2.0, "text": "Clean not friendly service", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "115264550128720074941", "name": "eddie owen", "time": 1609078224770, "rating": 5.0, "text": "Always the right gift. Good product, good price.", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "111866616013405969643", "name": "Alicia Matthews", "time": 1605456205408, "rating": 1.0, "text": "Really annoyed that the online hours reflect that this location opens at 10am. Drove all the way over to only  see a sign that shows they open at noon on Sunday. Change the online hours!!!", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "103030976107740606070", "name": "Keith Heidecker", "time": 1601347604143, "rating": 5.0, "text": "So glad this store is open. Such a friendly staff.", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "103143964290923078801", "name": "Tara Dixon", "time": 1618622425390, "rating": 1.0, "text": "Placed an order for anniversary and it was suppose to be delivered today April 16, 2021. When I called the store, worker said it was in transit. Arrangement never arrived.\n\nI expect a full refund first thing in the morning. If they couldn’t provide the service why take my money and then lie like it’s in transit.\n\nAdding insult to injury, Cory Lewis, if that’s even his name called the recipient to say that the delivery address was outside of their delivery zone. However, no one called this morning to say that was the case, and even when I called at 4:49 pm, the woman who answered did not state this, she said the delivery was in transit.\n\nThen to put icing on the cake, Cory Lewis called me to say they tried to deliver the order but the man didn’t expect the order, there was no man at the address all day and someone was literally sitting home waiting on the order all day. Then he tried to add yet another lie to that.\n\nProfessionalism and truthfulness is not a big ask when doing business, this placed missed big. I expect a refund and a call from management.", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "112366573694339997317", "name": "Monica Bray-Grant", "time": 1619116279356, "rating": 1.0, "text": "Placed an order on Wednesday for an arrangement to be delivered on Friday for my Mother In Law's birthday. Called Thursday afternoon to see about adding some additional instructions to her delivery. The rep informed me that they are not doing deliveries to Tuskegee that weekend but will deliver to that area next weekend? What kind of business are they running here? No one had even called me to let me know that it was not going to be delivered. Shabby business!", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "100960094159447785736", "name": "Beverly Butler", "time": 1585379479535, "rating": 5.0, "text": "Fabulous and quick service! Order online even if you need delivery for a birthday the next day. I was able to order and have this wonderful gift delivered even though I couldn't be there to celebrate the event. I hope your experience goes as well as mine!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMxh6mJ41mKuppl-rCdkhVVUAHk4f80NxnHNJJb=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "112591952920655420000", "name": "Shay G", "time": 1619898284488, "rating": 1.0, "text": "I am 32 weeks pregnant an had a craving for their chocolate covered strawberries. The cashier was extremely rude as I was ordering my 6 strawberries. It had just turned 2pm an she said it would take 20-30 minutes and as I’m looking at the smoothies she tells me we close at 3pm and i don’t have any fruit chopped for smoothies (rolls her eyes and gasps for air). I honestly didn’t appreciate her whole attitude and decided not to even purchase here.", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "108287610401506123643", "name": "Takeya Wilkins", "time": 1588177518289, "rating": 5.0, "text": "I called in to place an order over the phone. My call was answered quickly and professionally. I was not sure what exactly I wanted but the representative gave me multiple options based on the information I provided of who I was sending it to. The call took less than 10 minutes to get me taken care of. I appreciated the expedient service! My mom LOVED her arrangement. The fruit was fresh and actually looked like the photo! I will be ordering again from this store!", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "106810870574279944945", "name": "Michelle", "time": 1604529578722, "rating": 5.0, "text": "Thank you NIKKI for your amazing customer service!! Very well spoken and catered to my edible arrangement needs!!", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "113942726722875705316", "name": "Monique Holland", "time": 1585932857292, "rating": 5.0, "text": "I have used this company multiple times and have found them to be courteous and very professional. All of the deliveries arrived on time and my guests devoured the fruit trays (especially chocolate covered strawberries) before any of the other items!! They create amazing arrangements that I have even used as centerpieces.", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "103821821030575178303", "name": "Kelroderick Pittman", "time": 1595613531558, "rating": 5.0, "text": "Nice friendly staff. They greeted me as soon as ai walked through the door. I wpuld highly recommend this place to everyone.", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "110301323900696061694", "name": "IMF", "time": 1552619381531, "rating": 5.0, "text": "I ordered super late on V-day and they still delivered in a timely manner to recipient!! I was hesitant at first b/c of the reviews but, to give them a chance. I'm glad I took a gamble. The recipient enjoyed their arrangement and raved at how fresh and delicious the fruit was!! Thanks guys!!", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "117073079482709374403", "name": "Marroni Blue", "time": 1567280159477, "rating": 5.0, "text": "I must say my husband ordered several boxes from this location and each time they never failed on quality.  Excellent politeness from the clerk but when I asked for a bag she stated she didn't have any.  Great products! !!", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "108044377688415902297", "name": "Lisa Burnham", "time": 1595177748529, "rating": 1.0, "text": "Orderes 6 carmel apples.  Tried pieces from two of them the apples where mushy.", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "100476842259077184414", "name": "Justin Stewart", "time": 1581702692441, "rating": 2.0, "text": "Poor phone customer service and they do not deliver. Selection is also very slim. Not living up to the Edible Arrangement stores I have used in the past.", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "107574805961359558204", "name": "Pooka Jay", "time": 1591767800126, "rating": 5.0, "text": "I love the Opelika location great arrangements and nice staff", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "104358586506230970898", "name": "Sarah Davis", "time": 1574265518422, "rating": 1.0, "text": "If I could give this place less than one star I would. Courtney (the owner) is a consistent liar. He makes promise after promise when confronted and never delivers. If this place stays open for the next 6 months I will be SHOCKED with poor management like that.", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "101285458337323705913", "name": "Tamara Williams", "time": 1544562674062, "rating": 5.0, "text": "Excellent customer service.  Beautiful arrangement. I will definitely order from this store again.", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "105048270418833252476", "name": "Kent Whitaker", "time": 1428096517294, "rating": 1.0, "text": "Horrible experience. My wife and I are not in Auburn so we chose this company to deliver an arrangement for Valentines Day for my mother-in-law in Opelika. We ordered a higher dollar item other than the lower priced special. Specifically for the reason of having more fruit and less chocolate as we were hoping for something a bit healthier because of health issues. They charged our credit card for the higher priced item we ordered but delivered the lower price special with added chocolate and it was a smaller item. In addition to the wrong item - they did not deliver it on Valentines Day. We called several times and they acted nice at first and promised to deliver the item the next day. Late in the day mom called and said it was never delivered. We called back and it was being delivered late in the day - a day late - and it was the wrong item, not the higher priced one we paid for.\n\nWe called again and one of the employees admitted they went to the wrong house on Valentines day so somebody got the higher priced item. My wife called again to at least get a refund for the overcharged amount or to have the right item delivered. We were promised the right item would be delivered. The next day, no delivery.\n\nAt this point, several days after Valentines Day my wife gave up so I started calling, was promised a refund or a deliver of the right item. There was no refund or proper delivery. I was then promised at least a call back from the owner, then another promise, another promised call back. I never heard back.\n\nMy mother in law never received the correct item and and we never got the refund. We finally tried to cancel payment with credit card and to get a refund but they disputed it - said that the item was delivered. Did not mention that it was the wrong item, and that it was late, missing Valentines Day. I'm sorry that they delivered the item, possibly twice, to the wrong house, and then the wrong item to the right address. That's three deliveries, three trips, three items. However, those mistakes are not our fault. All I know is that my mother in law never received what was ordered.\n\nI would not recommend this company to another person.\n\nI would probably have written a different review if the owner would have called me back as promised by the several employees.", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "105064354465825949424", "name": "C. K.", "time": 1543473378747, "rating": 5.0, "text": "Fresh and on time delivery. Good customer service. I highly recommend this business.", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "118353849051961259024", "name": "Kate Dorsey", "time": 1562703649768, "rating": 1.0, "text": "Placed an order well in advance enough to have delivered on mother in laws birthday, followed the ‘track your order’ the entire day of said scheduled delivery, and it finally changed to “arranging your order now” around lunchtime, and never changed again after that. I called several times, contacted via the live chat and email on website, had an automated reply sent with my “case number” saying I’d be contacted by the store. Never was. 3 days later on Monday I finally got someone on the phone and all she said was “yeah i don’t even what happened with that order haha. Do you want me to send it today?” (Never even got an apology or any type of discount offer or even an explanation) 4 days after her birthday? ummm yeah, no thanks. Never again. WAY too overpriced for quality of product and customer service", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "103326764959457889556", "name": "billy chapman", "time": 1560777927180, "rating": 5.0, "text": "Fantastic work and highly pleased with my wifes mothers day gift", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "115753620114538648299", "name": "Demitri Sargent", "time": 1547257541958, "rating": 5.0, "text": "What a beautiful healthy way to brighten someone's day. I had a great experience. Fruit was super fresh and the customer service was awesome!  #ediblearrangements #fruitbouquet", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "112376956369333900462", "name": "Tramon Woodson", "time": 1518797899078, "rating": 5.0, "text": "When i get there my order was ready on time and since its my first time I'm pleased with the product", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "105762316992361768256", "name": "Anna Bradham", "time": 1513658202821, "rating": 2.0, "text": "Took them 30 mins over the phone to take my order! They won’t make it in this town very long if they don’t get it together. Sad, because I love sending this kind of thing!", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "103025504557494660323", "name": "Jelisa Sharde", "time": 1494261007492, "rating": 1.0, "text": "They did not deliver the edible arrangement that my bf ordered for me even though he paid for deliver. When he asked them about it, they said they were too busy. They never gave him a courtesy call to let him know that they were not going to be able to deliver the order. From what I have read about other peoples review,  they do not deliver anyone's arrangements so what are they so busy doing? They should just close the Auburn store down because they give Edible Arrangements a BAD name!", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "101432112513542454688", "name": "B Morgan", "time": 1550034030551, "rating": 5.0, "text": "Wonderful people, exceptional product! 😊", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "114881420223135040453", "name": "Emily Nolan", "time": 1456863726533, "rating": 1.0, "text": "WORST customer service. I would stay far far away.  The owner, Courtney, talks out of both sides of his mouth.  He sends out inferior arrangements, then when you call to get it made right, he promises to do something and then won't follow thru.  When you call the main store, he actually LIES to them.  Stay FAR FAR away....", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "115913775964103002335", "name": "Michelle Bryant", "time": 1487115813371, "rating": 1.0, "text": "Awful customer service. Very disappointed. The order was never delivered today (Valentine's Day), and I paid for delivery today. I, nor the recipient, recieved a phone call to let us know. I have tried calling the store numerous times today and my call was continuously forwarded to a recording. Terrible!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "105601172610050862859", "name": "Tecoya Brown", "time": 1469886855947, "rating": 1.0, "text": "Worst customer service EVER! Don't waste your time dealing with this store. I will not recommend it to anyone!", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "103524593720489527503", "name": "Saddie Bell", "time": 1448171133165, "rating": 1.0, "text": "I ordered from them and optd for it to be delivered however they never delivered my order. Even thought i called the store mulitple times. They said they had my order and they were behind because of traffic. And yet i did not get my order. And they charged me. Now i have to was days to get my money back. I will never use this the store in auburn alabama again. I will never recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "100394021684328824796", "name": "selena resendiz", "time": 1487187946295, "rating": 1.0, "text": "order never got delivered awful customer service just an all around bad experience", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "100392554956512191650", "name": "Tina mcbride", "time": 1506823580541, "rating": 5.0, "text": "Excellent fresh fruit bouquets", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "117419634683249023645", "name": "Mido Sala", "time": 1464288021466, "rating": 1.0, "text": "Bad customer service. They forgot to deliver an order and when I called them, the guy told me I did not pay for that additional order and when I gave him the number of the order he was still not convinced until his colleague corrected him. Ridiculous !", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "105399052964596065399", "name": "Elizabeth McElroy", "time": 1537928080909, "rating": 4.0, "text": "Worst experience. Don’t open when they should- those hours on the website mean nothing!!\n\nUpdate: made it right", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "108482323592307007509", "name": "nakiya philpot", "time": 1524151988760, "rating": 1.0, "text": "STAY FAR AWAY !!! store owner is HORRIBLE", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "109883250324700987891", "name": "Mac Man", "time": 1555151711723, "rating": 5.0, "text": "Good.", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "113332798799277607463", "name": "allante smith", "time": 1487084926163, "rating": 1.0, "text": "Terrible customer experience", "pics": null, "resp": null, "gmap_id": "0x888cf2ce2392dbe3:0xba2152bd50d19c00"}
{"user_id": "117085046296901294662", "name": "Christy Hulsey", "time": 1612047413517, "rating": 5.0, "text": "Sandy put together a beautiful sympathy bouquet for me with little instruction from myself other than \"short white roses\" and \"blue flower highlights\". My friend loved it. It was a little more expensive than I'd hoped, but in the end worth it to get that professional touch. Thank you Kaleidoscope!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOLMKcCmJ2-fKSbMvAKHAhFYdVs0dWwz0JZ3et3=w150-h150-k-no-p"]}], "resp": {"time": 1612100230553, "text": "thank you sandy. i appreciate your business. anytime we can assist you please let us know\njoey"}, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "107889613906102103260", "name": "Nicolas Terry", "time": 1619284031055, "rating": 1.0, "text": "Showed the guy a picture of exactly what I wanted. Instead of telling me he didn't have enough white lilies to make it he filled in the rest with a bunch of other stuff I didn't want or ask for. He offered to take it back but that's not the point. Be honest up front instead of wasting someone's time making an arrangement they didn't ask for.", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "118405958167087610911", "name": "S Hamilton", "time": 1582125492509, "rating": 5.0, "text": "Hands down THE best Florist in the Shoals & Florence area!  Amazing work with exceptional quality every single time!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN8dYCUfUJXvEfIcpu_SO7kvcKMYHVgn-qLn3Ia=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNfIcqeRY3S4tGO8IBUZr91oxzFmC8SuJxl0kmU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "118070021361281533216", "name": "Amanda J Smith", "time": 1584993333343, "rating": 5.0, "text": "They have excellent and speedy service. I highly recommend them. THEY ARE WONDERFUL... USE THEM! I live in Huntsville and sent an arrangement to my aunt, I accidentally gave them the wrong house number and the woman refused to give the flowers back. They went and made my aunt a new arrangement... I cannot stress how amazing that was, especially since we are quarantined!!", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "110273018569943789708", "name": "She Mac", "time": 1620590837156, "rating": 5.0, "text": "Hastily created exactly what I asked.  Delivered also.  Could not have asked more...", "pics": null, "resp": {"time": 1620662398860, "text": "thank you so much   i appreciate your business.\njoey"}, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "113355461076375201120", "name": "Joshua “Boogeyman”", "time": 1590011130038, "rating": 5.0, "text": "Great quality and professionalism is all I can say. I am very impressed by the arrangements they have . Would definitely recommend and use again. Thanks A Bunch Guys.", "pics": null, "resp": {"time": 1612100276954, "text": "thank you sir. i appreciate y our business.\njoey"}, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "102081952045542046102", "name": "tamenda king", "time": 1554600762915, "rating": 5.0, "text": "Thank you Kaleidoscope! Great job!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPk5tbJOvzYmFrn2kGFBeFRvbXc4rafySIEIhqn=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "108914123793504841298", "name": "Paige Williams", "time": 1589224766790, "rating": 5.0, "text": "I had some issues with my order due to them being understaffed under a stressful time and they handled the issues very well and were understanding of my frustration and were never rude to me. The manager, David was very respectful to me and listen to all of my concerns and never made me feel under appreciated. I appreciate their business and customer care and will definitely continue shopping with them!", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "110520431280865375094", "name": "Cynthia Senn", "time": 1581799771118, "rating": 5.0, "text": "I have bought different things at this location flowers for graveside blankets angels etc an everything ihave purchased I have been more than pleased with it they do an absolute wonderful job would never think of going anywhere else love you guys y'all are all wonderful thanks", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "115907967500074368569", "name": "Cassandra Sandi Graham Thompson", "time": 1594273698461, "rating": 5.0, "text": "Kaleidoscope Florist has been and will always be my florist . Since 1999 . Thanks for always being there for me and my family's floral need for whatever the occasion.", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "109010807466102428498", "name": "Janice Myers", "time": 1562852703329, "rating": 5.0, "text": "After the experience I had at Muscle Shoals Florist , I will be dealing with kaleidoscope from here on out . Two different Florist owners in 24 hours . The difference from one to the other was nothing but professionalism. Thank you for helping us.", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "104455326238798202391", "name": "Donna Cassel", "time": 1575429279239, "rating": 5.0, "text": "Always looking for seasonal flower arrangements. They've got beautiful ones year around!", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "118086821880423480747", "name": "Bethany Small", "time": 1571069764139, "rating": 5.0, "text": "Went to  Muscle Shoals Florist after that waste of our Family’s time  I ended up here.  You Saved our day and we are so grateful.", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "110299227837303220857", "name": "Hunter Stone", "time": 1557700587693, "rating": 5.0, "text": "Beautiful flowers! Delivered on a short turnaround. Amazing service!", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "103462410124944052204", "name": "John Gist", "time": 1534371389874, "rating": 5.0, "text": "Manager was very helpful and friendly.  Shop is very organized and had a good selection of items to purchase.", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "102346072370340574986", "name": "Matt Wilson", "time": 1448746190591, "rating": 1.0, "text": "3.) After we put in an order for an arrangement we called back to add to the order. An employee who answered the phone asks for our personal information. We gave it. However he said we were not in the system. This is what we were told after waiting on the line for 12 minutes. Can you imagine??? However they charged our ‘charge card’ the day before. Figure that one out.  About five hours they found our order - but only because we were persistent – believe me (N.Y persistent). We were told that we did not put an order in with them and that we must have called another local florist (yeah we wish that were the case).\n\nGuy Vogel", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "109971756676666062007", "name": "Darall Basquin", "time": 1503239400267, "rating": 5.0, "text": "So very helpful with our trip to honor our niece and  nephew.  Thank you for your help and support for them both.", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "112096569488902482508", "name": "Rex Michael", "time": 1581714458872, "rating": 1.0, "text": "No flowers ordered two days ahead of time didn't get there Wednesday and Thursday they were ready but just not delivered. 100 dollars wasted with these folks", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "104405938358002922158", "name": "Get Brad", "time": 1557456877516, "rating": 5.0, "text": "Nothing like an arrangement of flowers to seal the deal on your holiday/event. No one knows it better than Kaleidoscope Florist.", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "113098471219868979646", "name": "Tonya Johnson (Sunshine)", "time": 1519332361309, "rating": 5.0, "text": "One of the best florist in the area. Awesome customer service", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "103051494640201265348", "name": "Darius Tae Freeman", "time": 1547315904941, "rating": 5.0, "text": "This place is awesome. David is the best.", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "108741368463629636588", "name": "Whitney Dawson", "time": 1478098209744, "rating": 1.0, "text": "Just Purchased a throw with flowers for my husband's uncle's funeral and it's awful!  And they also left the card off.  Won't be back! Flowers are cheap looking , I could have done a better job.", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "114619967498945019367", "name": "Charlie C", "time": 1509502733743, "rating": 4.0, "text": "Nice arrangements and great service.", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "112014392117123381540", "name": "Mike Sprinkle", "time": 1518639420985, "rating": 5.0, "text": "Excellent products,  friendly staff", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "108154929439758603421", "name": "Crystal Alexander", "time": 1499860200812, "rating": 5.0, "text": "Prompt, reasonable and friendly service", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "115734687273682663438", "name": "jeremy smith", "time": 1543683819434, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x887d4f22d50a2b5d:0x5724d1584eddb1f6"}
{"user_id": "106018048581410334018", "name": "Aaron Graffius", "time": 1470254586260, "rating": 5.0, "text": "Aug 2015 called the Scottish Rose florist in Millbrook which is no longer in business (owners moved to Georgia). Mr Jeff from Sonshine Florist & Gifts answered taking over the old Scottish biz phone number is based in Wetumpka was very courteous, gracious & friendly to work with for a same day delivery. He was quite informative about the area, servicing the Millbrook funeral home and surrounding area. He is a blessing and I would be happy to do business with again.", "pics": null, "resp": null, "gmap_id": "0x888c23571b6d5a2d:0x8053be53732e3480"}
{"user_id": "100830715021136939878", "name": "Patricia Powell", "time": 1504752837338, "rating": 5.0, "text": "Nice people", "pics": null, "resp": null, "gmap_id": "0x888c23571b6d5a2d:0x8053be53732e3480"}
{"user_id": "100854925844024538539", "name": "Caitlin Gray", "time": 1625173112010, "rating": 5.0, "text": "What a wonderful florist! My husband and I were in a pinch to send some much deserved flowers to our mom and they delivered!!! I couldn’t be more proud and thankful of the arrangement they put together. I asked for cheery, bright, and fun! And it’s as if I picked the whole thing out! Great job, beautiful & fresh flowers! we so appreciate you all making this happen same day with incredible work!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP0zgokgu6obCBGTbx3OGhKdlMN-CglSJE_6Yxx=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "117337032357439332012", "name": "Angel Boldin", "time": 1619207929648, "rating": 5.0, "text": "Jenilyn's Creations is amazing. I went to place an order for a sympathy arrangement and saw online they do not deliver on weekends. I called the store and was informed the arrangement would be delivered that day. Thanks so much!", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "107649530267655429799", "name": "joanna sanders", "time": 1615394056149, "rating": 5.0, "text": "I have ordered  from them before   & they are amazing", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "112362795904868370736", "name": "Don Mitchell", "time": 1589132984772, "rating": 5.0, "text": "Jerilyn’s asked me what did I want I said I don’t know but her fave color is purple, something special for Mother’s Day.  My mom has said over and over again how beautiful her flowers are, “I love them.  I love them!  There’s so many, all purple and and they smell so good!  Thank you thank you!  They just brighten up the whole house, I put them by the fireplace so I see them every time I walk by, I just love them!”  😊", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "108707794223855448769", "name": "Don Ireland", "time": 1593723867750, "rating": 3.0, "text": "Delivery person left the flowers on the porch in 90 degrees did not knocked or ring door bell.  Someone was home all day.  Let's do better Jenilyn.", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "112363881253773273311", "name": "Lori Mercer", "time": 1535124966729, "rating": 5.0, "text": "Sorry everyone - we can't seem to get this listing updated to show our correct address.  The phone number is correct so please give us a call.  We are physically located at 57 Virginia Dale Drive, Wetumpka, AL 36092 (however this is actually in the Town of Elmore between Millbrook and Wetumpka).  We are the closest florist to the Millbrook area.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOf56r-10ndozZ3_NKUVr5z2AC8udxuP3x5B1De=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "117292449014320733361", "name": "Hazel K", "time": 1581200809098, "rating": 1.0, "text": "I paid for next day delivery flowers to be sent to my niece on her birthday. I received a confirmation that they were delivered Late Friday afternoon. I called my niece to see if they were delivered and they were NOT. I immediately called the shop several times and left voicemails. No response - the shop was closed for the weekend. Long story short, they delivered to the wrong address, despite the correct address being on file with the purchase. It was very important for me to send flowers ON her birthday and not 4 days later. It was disappointing and a hassle to figure out what happened. There was no flower upgrade, add on, or partial refund to make up for the huge mistake on their part.", "pics": null, "resp": {"time": 1581218401991, "text": "Please give us an opportunity to research and respond properly to this situation before leaving a negative review. We value every order and do everything in our power to make sure your order is delivered correct and on time. Without know the specifics of this order I can’t help you resolve the problem. I realize it is too late for her birthday but I still need to determine what happened based on how the order was placed. Please send an email to wecare@jenilynscreations.com with your full name, phone number, the recipient, and the address given so we can address this properly."}, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "112111205568377489352", "name": "tls 1024", "time": 1591797065158, "rating": 1.0, "text": "The arrangement was delivered with the wrong card on it. This is not the first time I’ve had an issue with this florist. Last time they offered a partial refund to remove my bad review and I complied but this time I have to give my review. I’m not happy with the arrangement and wonder since the card was wrong if I possibly received the wrong arrangement. Even if not it’s not a very nice arrangement. I could’ve cut flowers out of my garden and stuck in a vase.", "pics": null, "resp": {"time": 1591807109576, "text": "We are sincerely sorry about the card message.  It was a mistake in our office and we take full responsibility for that.  The sender was wanting to acknowledge your family with a gift of flowers and their deepest sympathy.  Again we are very sorry for your disappointment."}, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "115401477121385090638", "name": "Jobelle Collie", "time": 1558321588597, "rating": 1.0, "text": "My son sent me flowers for Mother’s Day last week from Jenilyn’s and my daughter sent flowers from another florist.  They were supposed to look similar, based on online pictures.  I had to lie to my son because he wanted a photo of me with the flowers.  Yikes! If flowers are dead the Monday after Mother’s Day, that’s sad.  The flowers my daughter sent (from another florist) look as good a week later as they did the day they arrived.  Since my children live out of State, they rely on online photos to decide what to send. Please don’t ruin any more holidays please.", "pics": null, "resp": {"time": 1558373717953, "text": "Please give us an opportunity to make it right before leaving a negative review. I assure you we didn’t send out flowers that were less than optimal but we will gladly replace them if contacted directly within a reasonable time. All you have to do is call us at 334-567-3325."}, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "100701437344497079668", "name": "KatMaster", "time": 1492787451690, "rating": 5.0, "text": "We used her when my husband unexpectedly passed away.  She handled me in my grief so consolingly and even met the odd requests of my children for flowers in the arrangement.  The green plants we wanted she was patient enough to help me locate as I knew nothing of their name and could only describe them generically.... patience at its greatest!  We had out of town family and friends place orders through her as well, and there were no complaints on any arrangement.  Definitely my go-to florist for the area for any floral needs!", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "114760716281924291692", "name": "Cynthia Wood", "time": 1551887470891, "rating": 3.0, "text": "Very disappointed in the flowers this florist did for a funeral last week.  I called to let them know I was unhappy and the lady said she would let Jenilyn know but she never returned the call.  I feel that what I ordered and paid for was not what was delivered.\n\nUpdate: I received a call from one of the owners who apologized and offered me a refund which I declined. He said during the holidays they had a lot of extra help and the message was not relayed to owner/management. I am changing my rating from 1 to 3 stars. I appreciate the call back, apology and his offer to refund my money.", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "105790428630669930218", "name": "Ann Sheppard", "time": 1590211524943, "rating": 5.0, "text": "They were very nice.", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "102315330142204959281", "name": "ihatenubs", "time": 1492104032090, "rating": 5.0, "text": "I'll keep the 5 stars rolling. Very happy with everything. Thank you so much.", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "115733979214335974780", "name": "Art Faulkner", "time": 1550175339553, "rating": 5.0, "text": "As usual Jenilyn’s has done a wonderful job again. Not only were the flowers beautiful but I know how hard Jenilyn and the other designers work to make each persons arrangement special.", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "104039263884679701598", "name": "Brenda Brown", "time": 1556907637730, "rating": 5.0, "text": "Great customer service and beautiful arrangements!", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "111125155448434989665", "name": "TRUMP 2020", "time": 1601476876851, "rating": 5.0, "text": "The most flowers for your buck.", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "104149609086416925053", "name": "Thomas Owens", "time": 1526397694430, "rating": 5.0, "text": "A friend's brother passed away the Friday before Mothers day, having called a few florist in Prattville A.L. (town of funeral home) I couldn't find anyone to help. The people were rude telling me it was Mothers day they were either out of flowers or to busy to fulfill the order for delivery on Monday. As I old one of the florist deaths are not planned so giving a better lead time is ridiculous..Enough of the negative..\nI luckily found and called Jenilyns Creations, it was a breath of fresh air to find someone that understood and was very helpful.\nDo not hesitate make your FIRST call to Jenilyn's when doing business Montgomery AL area and save yourself aggravation.\nI want to thank Jenilyn's team for doing what they said!!! And the price was more than fair.. Again Great Job Jenilyn's Creations!!!!", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "109141310763665632184", "name": "Tiffany Marie", "time": 1516633031294, "rating": 1.0, "text": "It's not there, wrong address, sends you to city hall in Millbrook", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "116663697577860589294", "name": "M E", "time": 1466693680656, "rating": 5.0, "text": "**FANTASTIC in every way!** Beautiful work! Fabulous to work with! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "108350980835848761825", "name": "Stephanie Swink", "time": 1486060277936, "rating": 5.0, "text": "⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️\n\nIf  you want it done right always use Jenilyn's Creations!!!! I JUST WANT EVERYONE TO KNOW JUST HOW HELPFUL SHE REALLY IS, YOU WILL ABSOLITELY LOVE HER! 🍁🌾🌺🌻🕸🌸🌼🌷🌹💐🌸🌼🌷🌹🌱🌿🌻🌺🌾🍁🍂🌹🌷💐🌸🌹🌼🌸🌻🌼💐\n\nI wish I could give Jenilyns's Creation 100 Stars! She is beyond helpful and nice. She can answer any question you have for her. With my experience, I just told her this is my friends fav color, fav flower and I don't have a lot of money to apend(everybody nowadays is on a fixed income)!  You can give her different ideas of what you want\nAnd she will\nWork her magic to give you a finished product that will blow your mind...\n\nJenilyn's Creation\nIs the way to go when u WANT  something that will blow your mind at such a reasonable price... and if she doesn't have what you're looking for ,she will do anything to get it for you to make what you want special and just right!!!❤️❤️❤️\n\nShe can use her magic and you will get what you need that  EXCEEDS your  expectations for such a reasonable price! Not to mention she is so polite and helpful. I WILL NEVER USE ANYONE ELSE!! 👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "116747275006819243097", "name": "charles aldridge", "time": 1609354706714, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "111088471304957544964", "name": "Jack Schlee", "time": 1550176316645, "rating": 1.0, "text": "I ordered flowers twice. Both times they were not what I ordered.", "pics": null, "resp": {"time": 1550173911265, "text": "We are so sorry you had a problem. We just tried to call you and no answer. We’ll be glad to take whatever corrective measure you would like. Please let us know."}, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "102708471594614013701", "name": "Lynne White", "time": 1627146017104, "rating": 5.0, "text": "I get the Cheese Hooies and the Crisp Sweet Pickles. Love both of them. I try to stock up on both before I run out of them.", "pics": null, "resp": null, "gmap_id": "0x888849e15ef0d779:0x35ec94e18e384e96"}
{"user_id": "106399312948351371236", "name": "Janice Froberg", "time": 1615653523650, "rating": 5.0, "text": "I loved this little shop because it's a little hidden away gem that a lot of folks probably doesn't know exist. I didn't, until just recently.\nEverything there is made from scratch; the old fashioned way. And boy... is it delicious! Their brittle candies are to die for! Everyone needs to try this place, at least once... you'll be glad you did.", "pics": null, "resp": null, "gmap_id": "0x888849e15ef0d779:0x35ec94e18e384e96"}
{"user_id": "104735178752820148572", "name": "Tere King", "time": 1618713107550, "rating": 5.0, "text": "Great little shop... Cheese hooies are the bomb!!! Pecan brittle pretty tasty too...", "pics": null, "resp": null, "gmap_id": "0x888849e15ef0d779:0x35ec94e18e384e96"}
{"user_id": "107244109856419440917", "name": "Trent Eubanks", "time": 1612035074842, "rating": 5.0, "text": "Nice selection of homemade goodies in wonderful southern setting. Worth the the backcountry drive for the food and to meet the proprietor.", "pics": null, "resp": null, "gmap_id": "0x888849e15ef0d779:0x35ec94e18e384e96"}
{"user_id": "105038373554986337283", "name": "Dale Parrish", "time": 1608842437067, "rating": 5.0, "text": "A contractor gave me a jar of peanut brittle for Xmas.... wow best I’ve ever tasted !!!", "pics": null, "resp": null, "gmap_id": "0x888849e15ef0d779:0x35ec94e18e384e96"}
{"user_id": "105641573312197285815", "name": "Rachel Holloman", "time": 1576206785017, "rating": 5.0, "text": "Absolutely great staff and wonderful products.  The brittle is divine; many of the other products are scrumptious too.", "pics": null, "resp": null, "gmap_id": "0x888849e15ef0d779:0x35ec94e18e384e96"}
{"user_id": "113882448576871184267", "name": "Genna LaPerla", "time": 1577044242380, "rating": 5.0, "text": "I have loved this treat since I was a  baby. Worth the drive from Texas", "pics": null, "resp": null, "gmap_id": "0x888849e15ef0d779:0x35ec94e18e384e96"}
{"user_id": "101454309003267537221", "name": "Janet Suter", "time": 1540087309417, "rating": 5.0, "text": "Fantastic!! Thank you Josie for your kindness and spending time with our Daugther. Everything we tried was scrumptious and I LOVE that it is made right there. We bought the pecan brittle and roasted garlic pecans. I grew up with a pecan tree in my Grandparents yard and we made peanut brittle all the time so I was brought right back to childhood. If you pass this place without stopping and it's open it is your loss!!!", "pics": null, "resp": null, "gmap_id": "0x888849e15ef0d779:0x35ec94e18e384e96"}
{"user_id": "104251710559629778946", "name": "Grace Howard", "time": 1513107022485, "rating": 5.0, "text": "I absolutely love everything they make! The best is the Peanut Brittle that is so thin that it melts in your mouth!", "pics": null, "resp": null, "gmap_id": "0x888849e15ef0d779:0x35ec94e18e384e96"}
{"user_id": "115110911514200365301", "name": "Precision Graphics", "time": 1512577140644, "rating": 5.0, "text": "Great customer service and the candy is outstanding. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888849e15ef0d779:0x35ec94e18e384e96"}
{"user_id": "115354300653819247634", "name": "Jami D", "time": 1521565156258, "rating": 5.0, "text": "The greatest candies you have ever eaten! The pecan candies and peanut brittle are both unbelievable!!", "pics": null, "resp": null, "gmap_id": "0x888849e15ef0d779:0x35ec94e18e384e96"}
{"user_id": "112146934235259876808", "name": "Barry Borum", "time": 1568306719314, "rating": 5.0, "text": "Best peanut brittle on this planet. A+++", "pics": null, "resp": null, "gmap_id": "0x888849e15ef0d779:0x35ec94e18e384e96"}
{"user_id": "111385300098363814730", "name": "Roberta Bush", "time": 1503350764586, "rating": 5.0, "text": "Best place to get Peanut Brittle!!", "pics": null, "resp": null, "gmap_id": "0x888849e15ef0d779:0x35ec94e18e384e96"}
{"user_id": "110105275532085592739", "name": "Catfish 5235", "time": 1504667068759, "rating": 5.0, "text": "Best brittle  around", "pics": null, "resp": null, "gmap_id": "0x888849e15ef0d779:0x35ec94e18e384e96"}
{"user_id": "105004796660226657601", "name": "Cheryl Merritt", "time": 1482984562303, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x888849e15ef0d779:0x35ec94e18e384e96"}
{"user_id": "112414152375733157096", "name": "Bryan Balentine", "time": 1500852036741, "rating": 5.0, "text": "Yum", "pics": null, "resp": null, "gmap_id": "0x888849e15ef0d779:0x35ec94e18e384e96"}
{"user_id": "105590669391743655650", "name": "Tony Canterberry", "time": 1616632046143, "rating": 5.0, "text": "Flawless store! Perfectly organized, incredibly clean! Super cool, friendly staff! 5 stars!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNDVqr_U4nPa6Hnw0K9tSzbVM0Jgb8SDDavs6ai=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMixybQxZZyfgb8rAwpyTTdyeDWYsyD2iwHFr9F=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMnFnSksK7L6vQJwpYq6uzp1LWWdHoC4_AP6Nsm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNQeNfWsWmgBQrXIOlQAOeRwHsBj2vw-9-DZTfe=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM9pVxFCi0XsV__7HDRnKro5PGsZpORU58ZJUAB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM4ozLXygeXWJZk1_tl4asT3loigktkv3DG2u1a=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "111527915675556193472", "name": "Wendy Guillory", "time": 1627864121066, "rating": 1.0, "text": "I am writing this review to draw attention to a serious matter regarding the offensive behavior exhibited by Manager Beth. The incident occurred on the evening of 07/22/2021 at the Alabaster Alabama location. I frequently visit the Alabaster location, however Sales Manager Beth made my experience horrible. Due to the negative experience,  I will never visit that particular location.I’ve never been so disappointed with service.\nI reported the horrible experience to customer service and I am hopeful that the problem will be corrected but I would like to make all shoppers aware. A shopping experience should be delightful and not confrontational.\n\nHappy shopping!!", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "104332357052913618489", "name": "Laquisha Grace", "time": 1611099680422, "rating": 5.0, "text": "The store was extremely neat and organized.  All the staff was friendly. I got a ton of great products.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNTJQO4cbAqGvkRm4ykFesWOjG3qX-K5FdodPvB=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "116025801662937190461", "name": "Jennifer Christian", "time": 1620098910087, "rating": 5.0, "text": "Love that store, enjoy there bodywash , candles and there plug-ins 😀😍👍🏽💖👏💫", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "114785396217836884937", "name": "Sam Johnson", "time": 1599709099000, "rating": 4.0, "text": "Went today for $2.95 sale. Store organized staff helpful. Just go early during sale days they were pretty wiped out but 2pm", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO_Y8DOfSfP0SxHkDSDcJzcphBfFVODCF05pfAa=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "107946206971875488326", "name": "Key S", "time": 1617131706844, "rating": 5.0, "text": "Awesome as usual! Great products and superb customer service !👌", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "117594683567665070178", "name": "T", "time": 1604866726256, "rating": 1.0, "text": "I purchased items at a store and I forgot a coupon. I went back and brought the items to get the coupon added. The lady said one of the items was not on the receipt. That wasn’t my fault. So, instead of letting me keep the free item (THAT WASNT ADDED) she charge me for it and added my coupon towards it. I got annoyed and told her to just add charge me for the item and I’ll pay the difference with the coupon added. INSTEAD, she refunded everything and recharge me again for the full price. I check my balance and it still show I’m currently charge for two amounts. I did get a refund. I’ll wait 3-5 days but if I don’t get my money back. We got a problem.\n\nInstead of getting a free bonus air freshener. I got charge extra for something that wasn’t added and lost a free item. I WAS BASICALLY BETTER NOT RETURNING BACK TO THE STORE.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "105692052838576405951", "name": "Tameka Perdue", "time": 1620618554739, "rating": 5.0, "text": "I love it employees are very nice & helpful.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "106337615787355627267", "name": "Sydney Getz", "time": 1602207881299, "rating": 5.0, "text": "They’re always so nice and helpful! Love this store and will always recommend to anyone looking for a bath and Body in the area. Sometimes the policies and coupons can be confusing but this staff is always so patient and understanding. Couldn’t say enough nice things about them.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "105714452203811151103", "name": "Dorothy Guillory", "time": 1610598828946, "rating": 2.0, "text": "I visited the Bath and Body's Location in Calara, The first thing I noticed was the face mask that the staff was wearing, Not only was they protecting themselves by wearing the face mask they were also protecting the customers.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "113742891803081865815", "name": "ashley bee", "time": 1604788162133, "rating": 5.0, "text": "Alabaster bath and body is ALWAYS a joy to shop! The ladies that work here are SUPER nice and helpful. I will always shop here", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "101397915432144908781", "name": "Lynn Williams", "time": 1619324970224, "rating": 5.0, "text": "Love B&BW, but I hate that they never had a good online sale during the pandemic when people needed their products, not just wanted them. Shows they care only about money", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "117686807514009600407", "name": "AC", "time": 1602207461414, "rating": 5.0, "text": "beautiful and organized store! everyone was friendly, patient, and helpful. shannon was really kind and helped us out so much! will definitely be coming back to this location.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "101000554872663762717", "name": "Jessica Black", "time": 1583295912618, "rating": 5.0, "text": "We really enjoyed our experience here. The store is clean, organized and pleasantly fragranced. An employee named Jordan was not only helpful, but very personable and such a joy to talk with. She was very interactive with us and my little girl even while she was working hard, which made us feel at home. She needs a promotion for her dedication and warmheartedness! I have absolutely no complaints here!", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "116142183074156123853", "name": "Liz C.", "time": 1594462562605, "rating": 5.0, "text": "Went two days ago because I ran out of hand sanitizer and wanted more soap. There's really helpful arrows so all shoppers kept good distance, the sales team was very cheerful - I think they like their work. They talked me into a new scent for beside the kitchen sink! I will be back!!!!", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "106507208551753630863", "name": "Mary Costlow", "time": 1592756415370, "rating": 4.0, "text": "Great sale going on today in store.  Greeted at door with a shopping bag and cheerful sales associate.  Store has just reopened and they were starting to get busy.  Well stocked and ready for shoppers.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "110609813610372387116", "name": "Tonja Collier", "time": 1623447156030, "rating": 5.0, "text": "Very friendly and helpful", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "118062392948106904773", "name": "Bryan Hensley", "time": 1583535677085, "rating": 5.0, "text": "Jordan was absolutely delightful! The store was clean, organized and had a huge selection. I DEFINITELY recommend!", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "110175796928942480671", "name": "Dominique Houser", "time": 1582978494640, "rating": 5.0, "text": "I love bath and body wirk the staff is amazing and I can always fine a deal.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "111936647034879751984", "name": "Ashley Headley", "time": 1575716898481, "rating": 5.0, "text": "Never have a problem when I go. I’m there every week just about, and I always receive outstanding customer service.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "117454661474308416349", "name": "Marion Russell", "time": 1581384828267, "rating": 5.0, "text": "Knowledgeable and courteous to help with the what's happening , even better with the weekly flyer through email.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "112181012940118527668", "name": "John Galliera", "time": 1609437375121, "rating": 5.0, "text": "Great gifts.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "108548843700798847931", "name": "Candis Threatt", "time": 1583408330970, "rating": 5.0, "text": "Sales! Bought candles(3 wick!), body wash all under $40! Customer service is always top notch!", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "117224481041879352107", "name": "Kimberly Whatley", "time": 1605571058618, "rating": 5.0, "text": "Nice and helpful staff", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "111945202525454368202", "name": "Kimberly Ballard", "time": 1555727580151, "rating": 5.0, "text": "Mmmmm smelled so good. Staff dying to wait on me. Very helpful", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "112926813596588460233", "name": "Cortney C", "time": 1572285279412, "rating": 5.0, "text": "Great sale on aromatherapy! Jordan was the best!", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "112412906412230069120", "name": "J. Terry McCombs", "time": 1581267232800, "rating": 5.0, "text": "One of my wife's favorite shops for soaps and fragrances.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "111790365322525608445", "name": "Christina Chamblee", "time": 1600878393838, "rating": 5.0, "text": "Love the service and kindness", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "114180244527503270637", "name": "Monique Moore", "time": 1542071430100, "rating": 1.0, "text": "I was very excited when I found out there would be a Bath and Body Works in my area. I went once before with no problem. I went tonight and there were 2 customers there me another lady. I stood in line for a very long time while the lady in front of me was being assisted. Once it was my turn I asked the sales associate behind the counter if they only had 1 register open? When she tried to respond the manager comes over and was very rude and said yes there are no customers here so we just have one and walked away. I advised her that she was very rude and left the items there. The manager at this store needs more customer service training, you had more employees working than customers but I still waiting a lengthy time to be helped and she laughed like she didn't care. I will be reporting this to corporate.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "107865101297118594745", "name": "Veronica Ramos", "time": 1542733943485, "rating": 2.0, "text": "I went in yesterday and let me just say. There was a employee there who didn’t know what she was doing. On Bath and Body Works webiste it advertised a sale in store and online for any select lotions for $3.95. I grabbed my Japanese Cherry blossom body cream and went to go check out. It rung up at $13.00. I politely asked why didn’t it pop up at $3.95. She said what do you mean? I showed her the page and said there’s a sale going on. She proceeded to say “I need to see a barcode to scan” Clearly there was no bar code but she proceeded to roll her eyes and scan a peice of paper to give the discount. Other than that. I had a good experience.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "112432976753673152142", "name": "Cindi Freeman", "time": 1581192782427, "rating": 5.0, "text": "They have the best customer service", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "110332171743419440236", "name": "George Young Jr", "time": 1608413879765, "rating": 1.0, "text": "Didn't have anything", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "110675520458451068889", "name": "Niki Hope Talton", "time": 1561844916481, "rating": 5.0, "text": "Semi-annual sale. $3.12,$3.37,and $3.95 lotions, sprays, and gels. Must get there.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "107139689005062841799", "name": "Alicia Talley", "time": 1608907301896, "rating": 5.0, "text": "Candles, Candles, Candles!", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "110349620907823443404", "name": "A H", "time": 1614372390520, "rating": 5.0, "text": "Thank You Martha Rea’s! My mom loves the  flowers I had delivered for her birthday!!  Will definitely buy from you again!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "102605705026962046517", "name": "Alisha Myrsa", "time": 1626983126071, "rating": 5.0, "text": "Very helpful people.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "101149371640511116225", "name": "Helena Bosch", "time": 1598999064847, "rating": 5.0, "text": "I am so thrilled with the service and flowers! I ordered (online) a cake made of flowers the day before! And they were delivered as ordered and looked beautiful. Thank you so much.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "100402081091032388380", "name": "Jude Saint", "time": 1613090623240, "rating": 5.0, "text": "Timely delivery. My wife loved the roses 🌹.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "109009857513062981378", "name": "Menita Hyde", "time": 1581110685943, "rating": 5.0, "text": "I called at 4:00 in the afternoon with an urgent request for flowers to be delivered to a funeral home and the service was the next morning. The florist was so kind to work with me to get a basket out that day. She was limited in what she could offer but she took time to let me know my options and put together a lovely basket. The family was very complimentary of how beautiful the basket was. Thank you so much for going above and beyond to offer exceptional customer service.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "105065460704890744891", "name": "Allan Dunlap", "time": 1620199131660, "rating": 5.0, "text": "The go to for all your floal arrangements.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "117404230476239684312", "name": "Lydia Nations", "time": 1592513583206, "rating": 3.0, "text": "Flowers were suppose to be delivered by 12pm for my friends birthday, did not arrive till 3:40pm. I called the shop to see if the mistake was from bloomstoday.com or their shop. She said they must have missed the notice of the time. I guess the positive thing is they were honest...the flowers are pretty. :/", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "108719598490721891676", "name": "Charlotte Maise", "time": 1575919825507, "rating": 5.0, "text": "Great job on the pink and white carnations delivered to my granddaughter. She loved them and said that they were the prettiest flowers she had ever seen. I was just sent a recent picture of them and they are still beautiful!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "112469014805653379863", "name": "Erin Brager", "time": 1503783660867, "rating": 5.0, "text": "I had the best experience ever. I will definitely be returning. The flowers smelled amazing and were delivered promptly. I actually wanted the flowers delivered outside of their delivery hours and the owner personally accommodated my wishes. I received Grade A customer service and I was also notified before and after she delivered them. She was a delight to do business with. I am overjoyed with my entire encounter.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "113383959030480581170", "name": "Beth Hart", "time": 1571694968055, "rating": 5.0, "text": "Martha Rea’s had been a referral for us out-of-towners so I was not worried about the quality or delivery, but both were right on target. My mother was very pleased with her birthday bouquet! Thank you.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "101767073999609202116", "name": "varbara VLove", "time": 1612989546044, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "103677436078278271855", "name": "Amber Mertens", "time": 1407353562752, "rating": 5.0, "text": "I use Martha Rea's often for business and always receive excellent customer service. Then, last week, I was on the recipient side of the delivery. My husband found out about Martha Rea's through an online search (not knowing that I use their services for business) and liked what he saw on their website and gave them a call. I received a beautiful arrangement in a very lovely vase at work the same day he placed the order. It was a wonderful surprise! By the way, the flowers are still beautiful a week later.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "101560796046162363072", "name": "Shamara Ray", "time": 1531325399852, "rating": 5.0, "text": "I am thrilled with the beautiful arrangement delivered to my daughter on her 25th birthday.  It could not have been more perfect.  The customer service was magnificent.  Such friendly people.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "102369084346667803695", "name": "T.J. Conwell", "time": 1494589407723, "rating": 3.0, "text": "Thank you for delivering these flowers - however, the balloon that was attached said \"Happy Birthday\", and I know that I ordered the \"I Love You\" balloon.  We are not upset, but rather, wanted to ensure you knew that attention to detail was lacking on this order.  For $73, I think that the order should at least be correct.  Thanks.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "108547326957560522042", "name": "Marina Bowing", "time": 1373292532929, "rating": 5.0, "text": "Such a nice place. Here you can find so many beautiful flowers. Each of them is decorated in a different original way. I was happy to find what I needed and bought a little more than I should, but I don't regret. They were gorgeous!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "113495028385548854707", "name": "Anthony Raybon", "time": 1550264079486, "rating": 5.0, "text": "I have purchased flowers through them numerous times now, they are always gorgeous and delivered in a timely manner.  I definitely recommend them to others!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "117918204589238878864", "name": "Arlette Willis", "time": 1489941188718, "rating": 5.0, "text": "My experience is noteworthy, the florists diligently worked to assure a timely arrival of my purchase! The floral arrangement was breathtakingly beautiful and very much appreciated. Thank you for your respectful care and attention to detail. This a florist I will call upon again!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "103795081523102771802", "name": "Rick Hendrick", "time": 1570656517209, "rating": 5.0, "text": "Thank you for going the extra mile for my delivery! You guys are the best!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "114947941263255490493", "name": "Vicki Scott", "time": 1470484523915, "rating": 5.0, "text": "This florist is so understanding and kind. She listened to my desires for my Mother's Urn and delivered the most beautiful flowers I've ever seen. She went out of her way to get the arrangement to the funeral home in Wetumpka on time and took great consideration and care to insure they would be beautiful, and they were. I wanted big and beautiful and she did more than that. You wouldn't work with a kinder person who listens and then you let her take it from there. You won't be disappointed and you won't be unhappy with wilting flowers. She a master of her craft. ~Vicki~", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "108619907012538648028", "name": "Teresa Rodden", "time": 1572217679683, "rating": 5.0, "text": "Nothing better than getting a picture and message saying how our flower arrangement put somebody else’s bouquet to shame.\n\nJob well done!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "103727001462368502407", "name": "Guardian Adjusters and Appraisers", "time": 1581110755389, "rating": 5.0, "text": "Lovely sympathy floral basket. Thank you.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "111135612105657047584", "name": "danielle jones", "time": 1535478792057, "rating": 1.0, "text": "Placed same day order on 8/27 for my mom's 75 birthday. The delivery man called my mom and said that he has been trying to catch up with her all day...lies! And that he could not come back to the house because it was out of his way - unprofessional behavior. My mom knew there was a delivery so she stayed home.\n\nThis morning I spoke to my mom who started that the flowers were on their way (around 9:30, 10 am) l, by 12 still no flowers...wow! I called the florist and spoke to I could care less PAM and told her to cancel my order.\nCommon sense would tell you to deliver flowers that you did not deliver on the previous day, butI guess they're a little slow.\nBottom line...I will never use this florist again, they've ruined my mom's special day. You disgust me...end of story!!!!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "113917280537516466771", "name": "Uschi K", "time": 1462925900160, "rating": 5.0, "text": "I highly recommend Martha Rea's Florist. This is a business that means to please and this has been the most amazing experience. When recently I had a disappointing delivery, Maria came to my house and substituted with a beautiful and healthy plant. Thank you Maria!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "111724932576241636504", "name": "Chad White", "time": 1504041727062, "rating": 5.0, "text": "These guys are fantastic.  Delivered my wife a beautiful arrangement with a little teddy bear on our anniversary very quickly.  Thanks again guys!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "103987499634659700923", "name": "Danielle Davis", "time": 1483142271847, "rating": 1.0, "text": "Terrible customer service!!!! I paid for a birthday bouquet for my mother's 50th birthday. I called to make SURE it would be delivered today. My mother was out of town of town doing mission work on her ACTUAL birthday and I am out of state and could not be there with her.  I spent all day thinking about how delighted she would be to get her surprise gift and They called me 15 minutes before they closed to tell me that they tried to take the flowers but it was too cold and they had no number for her, but they had MY number and didn't say anything until the employees were about to  walk out the door. Whoever was on the phone said they could do it TUESDAY....what in the WORLD. I am out of state and not able to be there for my mother's birthday celebration and the ONLY thing I had for her today is ruined. 1 hour before her birthday dinner she has NOTHING from me.  I am beyond upset. Thanks for ruining the birthday surprise. ....Terrible.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "117210835878042065062", "name": "Nancy Breland", "time": 1494973748078, "rating": 5.0, "text": "I just wanted to thank your florist for the beautiful arrangement that you just made for my brother who is at Baptist South. He just got out of surgery after the flowers were delivered and was so delighted at how beautiful they were! He especially loved the lilies!\nThank you for making his sister (me) so thankful that her best wishes were sent to him,\nwith such beauty❣️\nSincerely,\nNancy Breland\nBainbridge, Georgia", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "116911237900020815211", "name": "Erin Dahlen", "time": 1373380695835, "rating": 4.0, "text": "I have placed online orders at Martha Rea's twice now. I live in North Carolina and am having flowers delivered to my mom in a hospital in Montgomery. The flowers were delivered the same day I ordered them and were beautiful according to mom. Very pleased with the service, even for those of us out of state!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "111739134837905010487", "name": "Kaylan Maradie", "time": 1552245478998, "rating": 1.0, "text": "Spent 100 dollars, flowers looked absolutely nothing like picture. Don’t waist your money", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "108547348818908101707", "name": "Jean Fader", "time": 1537659693601, "rating": 4.0, "text": "Beautiful flowers. Need to get web orders working properly.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "101443702267972430585", "name": "Dontae Williams", "time": 1562955465417, "rating": 5.0, "text": "Placed last minute orders online. Delivered within three hours to my wife!\n\nYou guys ROCK!\n\nThanks for what you do.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "103244432481966012081", "name": "Kim Lingner", "time": 1526940642928, "rating": 5.0, "text": "I walked in while they were closing and they still took the time to get my order in and I greatly appreciate them in this time of need !!!!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "106304078012950883400", "name": "Christie Tarantino", "time": 1392676590020, "rating": 1.0, "text": "I ordered flowers from Martha Rea's for my sick mother and her caregiver for Valentine's day.  I received the confirmation and assumed that the order would be delivered as promised.  I found out that the delivery was not made on Friday, and thought that maybe it would be delivered on Saturday due to a backlog.  When they were not delivered on Saturday, I placed a call to the florist this morning and was told that a manager would call me back.  5 hours later, I still have not received a call.  I'm very disappointed by the lack of customer service.  At the least, I could have received some sort of notice that the flowers wouldn't not be delivered on time so that I wouldn't have the expectation that they would be.  But, to add insult to injury, they are now not addressing the problem at all.  If you want to ensure your order would be processed, I would not order from Martha Rea's.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "109752344267260208214", "name": "Jennifer Comer", "time": 1474118031839, "rating": 5.0, "text": "I was ordering from out of state and they took careful thought on my requests in the notes portion of the online ordering process.  The arrangement exceeded my expectation in quality, size, and beauty. Thank you, Martha Rea's, for your talent and consideration. I look forward to using your services in the future.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "113345759837186777711", "name": "Clay Dudley", "time": 1389629587479, "rating": 1.0, "text": "I placed an order over the phone on a Wednesday to send flowers to an office that had an employee pass away. I requested the flowers to be delivered on Thursday AM. I called the office/client and came to find out that they never received the flowers. I spoke with someone on Friday morning and they apologized for not getting them out and explained that they did not file the order, but they did charge my account. I understood that mistakes happened, but requested that the flowers be delivered promptly that morning. I found out that they were not delivered until close to 4PM that Friday... after most of the office had gone home for the weekend. Mistakes happen, but if you cannot correct them and honor your word, then you clearly do not care about your customers. Needless to say, I will not be using Martha Rea's again.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "109940544007146303145", "name": "joan williams", "time": 1504916781205, "rating": 5.0, "text": "Having been a patron while at home in Montgomery; being overseas in Doha,Qatar your online services allows me to deliver love across the oceans. Thank you MarthaRea's", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "101448601885737847331", "name": "Martha White", "time": 1501019093872, "rating": 5.0, "text": "The flowers I've received from Martha Rea's have been of the highest quality.  The flowers are fresh, beautiful, and creatively arranged.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "108043605708967275825", "name": "Simona Yelder", "time": 1489373593122, "rating": 5.0, "text": "Thank you so much for all your help Ms.Maurean.I hope I'm saying  your name right. You was so helpful, I really appreciate all you did.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "116162563061200177900", "name": "Adrian Hopkins", "time": 1424804211328, "rating": 3.0, "text": "Ordered through Teleflora same day. Arrangement was poorly put together.\n\nRose buds weren't matched well(some closed, some half open, some full bloom)\n\nLeaves weren't trimmed well. Hopefully they bloom nicely", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "109721707309513105348", "name": "Brian Wren", "time": 1392419994158, "rating": 1.0, "text": "HORRIBLE. Ordered 14 roses to come with spray roses and 3 balloons. What did my wife receive? 7 roses with spray roses and no balloons. Attempted to get it corrected and they were the rudest people we have ever dealt with. tried to make my wife believe i was lying about what i ordered. (i have receipts obviously) and even told my wife to be thankful she got anything on valentines day because she (the owner) had no one to give her anything for valentines day. Well if this is the way she treats customers i can only imagine how she treats people who arent supporting her business. i guess we see why she has noone. Flower situation was never corrected although she did get the balloons but not before they had my wife in tears with their rudeness.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "107551414407832659067", "name": "Glenda Russell", "time": 1492458712724, "rating": 5.0, "text": "Arrangements from Martha Rae's are ALWAYS beautiful.  If I'm sending or receiving I have never been disappointed.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "107496470488077567028", "name": "Kathy Jackson", "time": 1455753463413, "rating": 5.0, "text": "had flowers sent to my mother in montgomery and they were beautiful she loved them and the whole house was talking about these flowers for months .. great job", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "107170398600021418153", "name": "Let's talk with Jd & Me Me D", "time": 1528487669234, "rating": 5.0, "text": "I've been ordering from out of state for the last 2 years and my recipient is always, always satisfied with her arrangements.. Thank youuuuuuuuuu!!!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "103318672168523932844", "name": "Lauren Phelps", "time": 1514492704349, "rating": 5.0, "text": "I order flowers from out of town and they couldn't have been more helpful!  They took the time to contact me and make the necessary arrangements for flowers going to a near by funeral home.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "106796660309048271530", "name": "James Files", "time": 1501546522520, "rating": 5.0, "text": "Thanks SO much.  Lynn loved the arrangement!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "115526398252671767800", "name": "John Alexander", "time": 1459254396009, "rating": 5.0, "text": "I've never been to the florist in person but have used them many times to send flowers to my daughter in Alabama. We have always been very satisfied.", "pics": null, "resp": {"time": 1459878890586, "text": "Thank you Mr. Alexander we appreciate you and Mrs. Alexander tremendously!! We know how important it can be to a parent to celebrate a child's birthday and we are delighted you choose Martha Rea's for your floral needs! Thank you again and looking forward to continue the tradition!!"}, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "111988275342240953357", "name": "Joshua Simmons", "time": 1493673603850, "rating": 5.0, "text": "Delivered on time and beautiful! My Gf absolutely adored them!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "117306361375268007489", "name": "Daphne Johnson", "time": 1527888613777, "rating": 5.0, "text": "Great customer service although I gave the wrong delivery address. Thank you very much.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "105074606609257589166", "name": "Eric Isaacson", "time": 1364304485762, "rating": 5.0, "text": "Whenever I need to impress someone I always immediately go to Jane and her talented crew. She has helped me out from dates to thank you gifts and even my moms birthday. Being an entreprenuer in the service industry I rarley run into places that meet my high standards for service, but this place met and exceeded! I highly recommend them for any of their sevices! Have used them and will continue to use them!!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "104383443392000033765", "name": "Jenny Kim", "time": 1569966789079, "rating": 1.0, "text": "It's very unkind. I will never go back.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "100922151410229353203", "name": "Jay Villagomez", "time": 1489182414114, "rating": 5.0, "text": "The corsage she did for my daughter was amazing!!! Honestly dont think i paid enough for it!!! Thank you guys so much!!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "105943151557768396358", "name": "Josh Bryan", "time": 1421187190610, "rating": 5.0, "text": "Ordered an arrangement for out of state for my mother who lives in Montgomery. The arrangement arrived as promised and was beautiful!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "110094489168081208344", "name": "Troy Gerren", "time": 1456783667670, "rating": 1.0, "text": "This is the most unprofessional florist I have ever come across. I ordered a white standing spray for a funeral. I paid  $95 for this arrangement and received 5 flowers in it. Tried to talk to the florist and they actually tried to suggest that the funeral home took the roses out that was not even advertised in the arrangement.When mentioned that the website says 100% guaranteed and was told the website does not state that. Then she had an attitude when talking to me.", "pics": null, "resp": {"time": 1457119589997, "text": "We have gone through all of our past sales receipts for the past two weeks, and we are unable to find a receipt associated with your name. It seems that your purchase may have been done through a different service other than marthareasflorist.com.\nHere at Martha Rea's we proudly support our local funeral homes and other business and we are sorry to hear that another company misinformed you about our affiliation. Best of luck getting in contact with that service to resolve this matter.\n\nFor future floral references please feel free to contact us directly, 334-262-1991 or visit our friendly website at http://www.marthareasflorist.com/ so we can handle your floral needs directly.\n\nBest Wishes,\nMartha's Rea's Floral Team"}, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "106511023316245683555", "name": "Robbie Amunds", "time": 1543876836866, "rating": 1.0, "text": "Ordered same day delivery online at 9AM this morning. Never received it. Called the store 5 times throughout the day and left two voicemails and never got a call back. Hopefully I will get them tomorrow. Very disappointed.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "102220670513206080033", "name": "Darius Holley", "time": 1484686888410, "rating": 5.0, "text": "Always Wonderful! I will not use anyone else EVER!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "109110502709236597302", "name": "Kim Namjoon's Sweetheart", "time": 1490247134957, "rating": 5.0, "text": "Beautiful arrangements, great customer service.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "112715028721015173685", "name": "Michael Davis", "time": 1497383213905, "rating": 5.0, "text": "Awesome. Martha Rea's sure made a beautiful arrangement for my precious girlfriend. Thanks a million.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "112764338884563325171", "name": "Trish P.", "time": 1457126144041, "rating": 5.0, "text": "They were so helpful & kind. I really appreciate them!!!!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "105816473230279438587", "name": "William Stone", "time": 1495200010924, "rating": 5.0, "text": "32 years together and the flowers made it special. great job!!!!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "112207669653945664242", "name": "Kevin Temple", "time": 1565996149691, "rating": 5.0, "text": "Very nice flowers!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "103480897236094535119", "name": "leonard gordon", "time": 1554413823769, "rating": 5.0, "text": "Great florist and outstanding service", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "116638004791361334512", "name": "Mary Lynne Wright", "time": 1497313561153, "rating": 5.0, "text": "Wonderful customer service! Thanks!", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "110716776654704284621", "name": "Austin Cook", "time": 1515770583353, "rating": 1.0, "text": "Terrible customer service, and a terrible attitude. I cancelled my order so I can't speak on the flowers.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "112008398992379842977", "name": "Vermon Tate", "time": 1509043706927, "rating": 1.0, "text": "Terrible customer service. Shop somewhere else.", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "116454070578619823402", "name": "jennifer wilkerson", "time": 1497876447253, "rating": 5.0, "text": "Very dependable and good prices", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "115619562845731794254", "name": "Doing Whatsright", "time": 1455320221749, "rating": 1.0, "text": "Horrible", "pics": null, "resp": null, "gmap_id": "0x888e8192decd9e93:0x98f143c65955383e"}
{"user_id": "103582672015975537203", "name": "Maxine Downing", "time": 1624630384985, "rating": 5.0, "text": "My family has used Fergusons for decades and I know why. I ordered a blanket for my mother's funeral and it contained what I requested but I left the rest to them and it was stunning! I also received numerous arrangements for the occassion from Fergusons as well and they were absolutely beautiful. When I placed my order, I was assured they would take care of me (as I was nervous because I was ordering for my family) and they did not disappoint, nor have they ever. They are my go-to florist for anything local.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPZmi76unButKJvGOLNah9PKF7_agnD1jFaN38K=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "104627321873903357856", "name": "Stacey Garmon", "time": 1625234410589, "rating": 5.0, "text": "Wes did a fabulous job on flowers for my daughter’s wedding.  Good price, EXCELLENT customer service.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "114978674406554240998", "name": "Seneka Stokes", "time": 1620770152663, "rating": 1.0, "text": "I order a floral arrangement for my Mother for Mother’s Day and it started dying after two days. Not only that, the floral arrangement I asked for was nowhere near as full as the one I saw on the website. When I went to pick the arrangement up and asked about its fullness, I was told that the flowers would bloom once they get warm. Some of the small roses that were in the arrangement were broken when I picked it up. There was green floral tape around the top rim of the vase which could have been easily concealed with a nice ribbon. It was so much green foam in the bottom of the small sized vase. That may be why the flowers aren’t lasting as they don’t have enough room and are poorly cut and crammed in. We put the few flowers that we could salvage in a larger vase. It’s unfortunate that I paid $66 dollars for an arrangement that my mother will only get to enjoy for a few days. I have Walmart flower bouquets that are outlasting these. I usually buy special occasion flowers from Publix at a cheaper price and better quality work, but I wanted to patronize Ferguson’s florist because they are a locally owned business. However I will not use their service again because it seems as though the work was rushed and thrown together and just not worth the money.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "102396976266793433914", "name": "Tashara Janae", "time": 1621887340978, "rating": 1.0, "text": "I have been ordering flowers for my mother every two weeks since the unfortunate passing of her husband. The flowers have not been up to par. We went to the florist today to return the flowers. When they arrived they were cut too short, looked nothing like the picture and were drooping and dying after two days. We arrived with a photo of the online order and were told that there was a shortage of flowers and they “substituted.” However, the substitution was poor quality. The owner, Noah Ferguson, came\nTo speak with us. He was rude, condescending and spoke disrespectfully to me and my mother. I will NEVER order from Ferguson again. I will be reporting this business to the BBB.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "115698175953959855879", "name": "Enga Sturns", "time": 1621798934528, "rating": 4.0, "text": "They are very nice people but the wait time was a little frustrating", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "110565226624627990842", "name": "Tony Lesser", "time": 1621613076277, "rating": 5.0, "text": "Fast and friend. Will use again", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "105331370771125010555", "name": "Cindy Camp", "time": 1581911074294, "rating": 5.0, "text": "I liked the white banner and bow for my friends mom for the front door", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNNYuR3abAAYH9eDRUykn4K2vb3tYLAMq8RdVTS=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "112360494125333580162", "name": "Tolly Walker", "time": 1613611289443, "rating": 5.0, "text": "Great flower selection.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "112836991326689361310", "name": "Katherine Parks", "time": 1579983396683, "rating": 5.0, "text": "I got my dress and flowers there they were so helpful", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "107862930548957262829", "name": "Seasoned Swine", "time": 1472520224436, "rating": 5.0, "text": "The flowers for the funeral in May were exceptional. Honestly the prettiest flower arrangements I had ever laid eyes on. This last weekend an artificial arrangement was picked up for her headstone. I have to boast of how real and professional they looked. If anyone is considering going anywhere else in Alabama don't do it! :)\n\nThank you very much for all you have done this year!", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "101551115554387366149", "name": "Michael Harper", "time": 1556113437045, "rating": 5.0, "text": "We had the most beautiful flowers from your shop. We had lost one of our granddaughters , I wanted them to be very beautiful for her and they were, again thank you very much.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "110674659164669875780", "name": "Randy Martin", "time": 1407092624671, "rating": 5.0, "text": "My daughter was married here April 19. We let Linda and Lori handle most everything from minister, D.J. and photos. The Azalea's were in bloom which made for gorgeous photos. The food was delicious and the arrangements and flowers were awesome. Thank you so much for a job well done and so stress free.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "117927166361001829313", "name": "gaige tedder", "time": 1448558127629, "rating": 5.0, "text": "I needed a special bouquet for a very special lady in my life, and I had a list of very particular flowers that I wanted in the bouquet. A few of the flowers were hard to come by due to the time of year, and I needed the bouquet in three days and Ferguson pulled it off! All 23 flowers were there and beautifully arranged. I will definitely be using Ferguson for all of my flower needs.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "110485170747079268649", "name": "Brenda Bone", "time": 1593556412134, "rating": 5.0, "text": "Friendly staff, always there to help you. Traded with them all my life and my parents did too.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "102100136414436006800", "name": "bnbskaggs", "time": 1535340366557, "rating": 5.0, "text": "Wonderful business with great service. They always have endless varieties of flowers and I love that they are open 7 days a week.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "108748240385346876188", "name": "Amber Rigsby-Bellew", "time": 1555184868290, "rating": 5.0, "text": "Made a corsage for my last minute son on the spot. Very appreciated!!", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "105237217219696409686", "name": "FireBerlin", "time": 1403403439697, "rating": 5.0, "text": "It's so hard choosing a florist from out-of-state. I went with Ferguson Florist for a flower arrangement for my aunt who has lived in Attalla all of her life. She LOVED the arrangement, said it was the prettiest she had ever received. Her sister later confirmed that Ferguson Florist does very nice work.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "118193145544866692315", "name": "Shirley Briggs", "time": 1523912005855, "rating": 5.0, "text": "I received an arrangement from Ferguson’s and it Wes absolutely beautiful and the real test is if the flowers last a week they sure have thank you", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "110699603321724320065", "name": "Tammy", "time": 1486089985676, "rating": 5.0, "text": "I want to say Thank You for doing a wonderful job on a floral arrangement that was done for my Mom and Dad's anniversary to put on Mom's gravesite.I had went to several florists trying to find the perfect arrangement and was very disappointed and didn't think I would find what I was looking for until I walked into Ferguson's.Everyone at Ferguson's was very polite and so willing to do their best at helping me to make sure I got the perfect arrangement to please my Dad.When my Dad went to pick it up the next day he was extremely happy with the arrangement.Ferguson's Florist has gotten two customer's that will only use Ferguson's for any arrangements we need from now on.If anyone wants to be pleased with beautiful arrangements and very polite,caring people then Ferguson's is the place to go.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "107771425401798260193", "name": "Sebrina Crosby", "time": 1518628153950, "rating": 1.0, "text": "I have never left a review for anything, good or bad, but the treatment I received from Ferguson Florist was so abhorrent, I felt compelled to not only leave a review but file a formal complaint with the BBB. I placed an order via their website to be delivered to a location clearly listed as one of the areas they service. A few hours later, I receive a call that they cannot deliver to that area. After being handed off to the manager, before I could even speak, the manager was SCREAMING at me that I'd have to pay 2.5 times the delivery fee that the website listed (which was determined after putting in the exact location). She said she didn't care if I got the flowers or not because I wasn't the one making them, they were.  She continued to scream and berate me. I have never, ever been treated so poorly by anyone, let alone anyone in any sort of customer service sector. The thing is, I would've paid the increase in the delivery fee, but it was the screaming and berating me, without even letting me explain what their own website said, that was so awful and upsetting.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "107949938661998613210", "name": "Doug", "time": 1486652205257, "rating": 1.0, "text": "I ordered a peace lilly for a funeral service.  They did not deliver the plant to the funeral home.  They refuse to own up to their mistake like a reputable business would and insinuate that the funeral home, my family and I are not being truthful.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "114074626507588205302", "name": "James Roberts", "time": 1553894787763, "rating": 5.0, "text": "Always has a good selection of flowers.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "106829898215616795348", "name": "Gina Farley", "time": 1461787206453, "rating": 5.0, "text": "I have asked for unique arrangements from Ferguson's and they have gone above and beyond every time. Excellent customer service!", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "105080368908382268223", "name": "Logan Barnard", "time": 1513790001610, "rating": 1.0, "text": "We have used Ferguson’s many times over the years and have had no complaints. My family ordered several arrangements from Furgeson’s and several other from other florists but only the Ferguson’s arrangements were wilted or mush within 24 hours at the funeral home. Furguson’s blames the funeral home heating however the other arranments were unaffected. I’ve never experienced this before but considering the amount of money involved I will take my business elsewhere in the future.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "114822980459193091246", "name": "carin whitney", "time": 1478104007415, "rating": 5.0, "text": "Always beautiful!  Birthday, prom, funeral, whatever the occasion, Ferguson Florist never disappoints us.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "102536263890710785964", "name": "Wanda Payne", "time": 1526133589621, "rating": 1.0, "text": "Asked for flowers for a baby's funeral. I got \"DARK\" bule roses. The leaves were black", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "103499436250673470189", "name": "Carol Payne", "time": 1532615237189, "rating": 5.0, "text": "Friendly and quality work.  Very helpful  .", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "106869841314390999084", "name": "Joleen Hibbs", "time": 1520394663397, "rating": 5.0, "text": "Great place to take prom pictures.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "116172740538465053768", "name": "Bridgett Whitney", "time": 1501453144827, "rating": 5.0, "text": "Beautiful arrangements & great customer service!", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "111915137427994442677", "name": "Terry McElrath", "time": 1569105035010, "rating": 5.0, "text": "Very friendly and helpful staff", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "110694548354986015092", "name": "Charlie Ridgeway", "time": 1487017603977, "rating": 4.0, "text": "The Best In Town Bar None", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "110173277927951668788", "name": "Bonnie Atchley", "time": 1538126372813, "rating": 5.0, "text": "Great service and kind.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "105203737149325868644", "name": "Mandy Vice", "time": 1545011096678, "rating": 5.0, "text": "Great selection.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "108247914253961258699", "name": "Dollie Gore", "time": 1470553006855, "rating": 2.0, "text": "My experience was awful and very disappointed. The arrangement was for a funeral it was a $150.00 arrangement but looked like a $15.00 arrangement. I will not use Feguson's again.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "111608662362585432992", "name": "Jnifr Hill", "time": 1554331359618, "rating": 4.0, "text": "The staff was very friendly.", "pics": null, "resp": null, "gmap_id": "0x888a3cb5de7ec63d:0x8a9cf36695ec74a2"}
{"user_id": "101497726354294772205", "name": "Jimi Griffin", "time": 1539375421855, "rating": 4.0, "text": "Great place for flowers I found what I needed in no time", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMD5uNee2Lw6EUlecgKZq3sw8WvheMI_GS57t7e=w150-h150-k-no-p"]}], "resp": {"time": 1539382453143, "text": "Thank you for the positive feedback, Jimi!"}, "gmap_id": "0x88891dd8a8bd5067:0x55a94fd3c647f896"}
{"user_id": "117240562029572543737", "name": "matthew thomason", "time": 1581555608508, "rating": 5.0, "text": "Norton’s always does a great job... best place to get flowers and arrangements in B’ham.", "pics": null, "resp": null, "gmap_id": "0x88891dd8a8bd5067:0x55a94fd3c647f896"}
{"user_id": "112862740850679484686", "name": "Justin Flowers", "time": 1475096166316, "rating": 5.0, "text": "I love this company. I've never had anything but quality service with great looking flowers.  A friend of mine told me about them a few years back and they still do a great job today. This is my go-to flower shop for delivery!", "pics": null, "resp": {"time": 1539382508587, "text": "Thank you for the positive feedback, Justin! We’ve been trying to do a great job since 1921!"}, "gmap_id": "0x88891dd8a8bd5067:0x55a94fd3c647f896"}
{"user_id": "105043468742288727333", "name": "Tint Pro", "time": 1473873862041, "rating": 5.0, "text": "They did a great job on the flowers for our anniversary. On time and they looked great.", "pics": null, "resp": {"time": 1539382534437, "text": "Thank you! Happy belated anniversary!"}, "gmap_id": "0x88891dd8a8bd5067:0x55a94fd3c647f896"}
{"user_id": "117534959607052759463", "name": "Vance Olmstead", "time": 1620673199960, "rating": 5.0, "text": "Another job well done! Best florist in town that always leaves me amazed with their end result!", "pics": null, "resp": {"time": 1620767589369, "text": "Out of all the great florists in town, Vance, we're flattered to see you think we're the best. There's nothing we love more than helping you out. If you ever need another beautiful arrangement, don't hesitate to give us a call. -Felisha, Owner"}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "103811209506940809396", "name": "Donny Harden", "time": 1488310988188, "rating": 5.0, "text": "thank you to the staff @ Amy's..  We live out of town, I called late morning and placed the order for our daughters birthday. I got a text and picture from daughter at 1:20 of the flowers, she was so excited, in her words \"BEAUTIFUL\" ...Amy's helped make a daughter and teachers day... THANK YOU!!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNaxwIrp4X_YCBHSok3LgSWVzWM5cZE7993aN3g=w150-h150-k-no-p"]}], "resp": {"time": 1555347745995, "text": "Thank you Donny!  It's our pleasure to make sure every customer is taken care of."}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "103460217828665876207", "name": "Bobby Hagler", "time": 1622511905229, "rating": 1.0, "text": "I ordered flowers for my wife on our 40th anniversary at 4:30 pm on 5/28 to be delivered between 12:00 - 2:00 pm on 5/29. They send an email at 11:57 am on 5/29 cancelling the order. This is pathetic.", "pics": null, "resp": {"time": 1622749119402, "text": "We apologize for the miscommunication in your order, Bobby. Given the long weekend for Memorial Day, we were closed Saturday and Monday. We also had a technical issue that didn't reflect our correct hours online. We understand your frustration and we are sorry for the inconvenience. If you'd like to discuss this further offline, don't hesitate to give us a call. -Felisha, Owner"}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "111353077511793062537", "name": "Camy Caruso", "time": 1615648829975, "rating": 1.0, "text": "I just called there to order flowers for my daughter in law.  The lady who answered the phone was rude. She acted like it was an inconvenience.  I'm glad I didn't spend my money on the flowers there. And the 1 star was too much. Ordering somewhere else!", "pics": null, "resp": {"time": 1616095104223, "text": "Camy, I'm so disappointed to hear we've left you with such a poor impression. You should always expect to be treated like a friend when you work with us to create a beautiful arrangement, and I can assure you this was just a misunderstanding. I hope you'll consider giving us the chance to make things right. -Felisha, Owner"}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "101290659229416287825", "name": "Neica Asher", "time": 1597327222252, "rating": 5.0, "text": "I ordered flowers online and called with special delivery instructions. Amy's you went above and beyond with your customer service. Thanks for delivering beautiful flowers and being so friendly to the lady that received them. Excellent experience all around!", "pics": null, "resp": {"time": 1597341128428, "text": "There's nothing like getting to share smiles with our neighbors, Neica. It was our pleasure to deliver the beautiful arrangement for you. Please don't hesitate to give us a call if you ever need anything. -Felisha, Owner"}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "111583130261216230051", "name": "shirley smith", "time": 1573142149202, "rating": 5.0, "text": "I used Google to find a place to deliver something, out of the ordinary, for a friend staying at a local hotel---and since it didn't require flowers I was at their mercy. The kind receptionist was able to help with everything in a matter of a few minutes... EXCEPTIONAL. Thank you!!", "pics": null, "resp": {"time": 1573668344809, "text": "Thanks for the support, Shirley! Glad to hear we were able to help out with your delivery. Let us know if you ever need anything else. -Felisha, Owner"}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "114809817289174804492", "name": "Teddy Jackson", "time": 1585850756684, "rating": 5.0, "text": "Great experience, Arrangement looked great! I will definitely use Amy's again.", "pics": null, "resp": {"time": 1588367491808, "text": "Teddy, I'm happy to hear that your order was everything you wanted. Our arrangements are some of the freshest in the area, so we're happy that you'll continue to support us. If you'd like anything specific, feel free to let us know next time. -Felisha, Owner"}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "100079217190651436786", "name": "Jeri Moody", "time": 1533940965310, "rating": 5.0, "text": "I called Amy's Florist from Georgia in hopes of ordering a plant for my son's girlfriend who just had surgery. Mark was a pleasure on the phone. He was very helpful in suggesting a plant, as well as tips on how to care for it. The delivery guy was also kind and delivered it promptly as well. I would definitely use Amy's again if I find myself needing another delivery in Tuscaloosa, AL. Thank you!!", "pics": null, "resp": {"time": 1534195386338, "text": "Jeri, thanks for the stars! We're so glad to hear we were able to help you out. Please don't hesitate to reach out if you need anything else!\n-Felisha, Owner"}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "105811231790213590829", "name": "Larry Savino", "time": 1458929776669, "rating": 5.0, "text": "I am in New York and needed a Great Easter basket for my Daughter who is in Tuscaloosa for college. I called in morning and the women I spoke with was very polite,Patent,and knowledgeable of her products. I described what I wanted she said NO PROBLEM, ask me for my budget and 3 hours latter my Daughter called and said she loved it. What more could you ask for from a vendor. Thank you to the staff at Amy's I appreciate the great service we received", "pics": null, "resp": {"time": 1500850298073, "text": "Larry, I know a year has gone by, but I just had to stop and thank you for these wonderful words! I'm happy we were able to help you make your daughter's day. I appreciate your support and hope you won't hesitate to reach out next time you need anything. -Felisha, Owner"}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "110718357847094347973", "name": "CATHY HOWELL", "time": 1518713918097, "rating": 1.0, "text": "I went in to Amy’s to get a plant for a funeral and there was 3 different people helping us and we got 3 different prices.  So unorganized. Feel as tho they are ripping people off!!  Watch when you order!  NONE of the flowers had prices so we had to ask. We left and went to Stephanie’s where all the plants had prices you knew what you were paying for.", "pics": null, "resp": {"time": 1519167033100, "text": "Cathy, we try to be upfront with our prices, so I'm sorry to hear you didn't leave with that impression. I appreciate your feedback, though, and I hope you'll give us another chance in the future. Take care.\n-Felisha, Owner"}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "116618363743617303638", "name": "Virginia Sanford", "time": 1532352186745, "rating": 5.0, "text": "Always very helpful with choosing the right flower or plant. Also very helpful with last minute needs.", "pics": null, "resp": {"time": 1532552887631, "text": "Virginia, glad to hear you can always count on us! Thanks for the kind words, and we hope to see you again soon. -Felisha, Owner"}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "111124892857497273382", "name": "Mona", "time": 1577225775813, "rating": 1.0, "text": "I was sent some flowers by my boyfriends parents for Christmas. The whole arrangement fell apart when I got it, as they cut the stems so short they wouldn’t even stay in the container. It was mostly filler and the flowers died within 2 days. Highly disappointed.", "pics": null, "resp": {"time": 1577743230084, "text": "Mona, we're always happy to be a part of such sweet gestures. However, we searched our database history and don't see the transaction you're speaking about. I can assure you that our displays are well-made and always fresh. That's what sets our flowers above the rest. In the future, we're always happy to provide you with a quality arrangement at a moment's notice. -Felisha, Owner"}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "104838282090293382558", "name": "Jennifer Stigall", "time": 1426256697653, "rating": 5.0, "text": "Great experience using Amy's Florist! Very nice people to work with!  I definitely recommend using them, and they are LOCALLY Family owned!", "pics": null, "resp": {"time": 1499887957016, "text": "I know a couple of years have gone by, Jennifer, but I didn't want to miss the chance to thank you for this awesome review! Your recommendation means the world to me, and I'm so happy to read you had a great experience here. Please don't hesitate to reach out next time you need anything. -Felisha, Owner"}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "105324674104027266620", "name": "Christian Parris", "time": 1487187089217, "rating": 5.0, "text": "I had a wonderful experience on the phone ordering flowers for my girlfriend. Cynthia was very helpful and funny", "pics": null, "resp": {"time": 1487256734596, "text": "Thank you Christian!  We hope your girlfriend enjoys her flowers."}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "110365860513268709442", "name": "M P", "time": 1477683581238, "rating": 1.0, "text": "Terrible Customer Service. In attempt to getting my girlfriend some Halloween themed flowers, Amy's Florist dropped the ball. I placed an order for one item and 5 minutes later they called and said they did not have the item or vase in stock YET I was still charged. After emailing and calling back, I was fully refunded. I decided to try my luck again and place another order but for a different item. Same thing, received a call saying it was not in stock. The people calling me were horribly unhelpful and rude and made it seem like I was to blame. Why have something on your website if it not in stock? I also find it suspicious Amy's Florist and Pat's Florist have the same exact webpage layouts besides color scheme. Trying my luck at a third floral shop and see if I finally can get something...", "pics": null, "resp": {"time": 1477950748029, "text": "Matthew, I am very sorry you had a bad experience with us. Yes you placed an order off our website that stated NO substitutions.  The closer it has gotten to Halloween we have sold out of most the containers. We would have been glad to do a similar arrangement for you but you said no substitutions. Also you did email us and I got back with you as soon as I seen the email, unfortunately I don't check my emails frequently.  The staff called and left you a message regarding the order, and soon as they spoke with you a refund was issued.  As for the two websites bringing the same...YES they are because a floral company designed them for us.  Nothing suspicious at all about that.  Again, I am very sorry we wasn't able to help you. It is not our goal to lose customers."}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "117088794634659074100", "name": "N Hinton", "time": 1484209649354, "rating": 5.0, "text": "My Dad works here. The manager and staff are very cordial and my father ,one of the delivery guys, is extremely attentive and punctual in delivering the flowers. My Dad's a work-a-holic.", "pics": null, "resp": {"time": 1500397732742, "text": "I know several months have passed, but I didn't want to miss the chance to thank you for this wonderful review! We love having your dad on our team, and we appreciate your reaching out with an all-star rating. -Felisha, Owner"}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "100337554526665963125", "name": "Ben Tuckerman", "time": 1516225717045, "rating": 5.0, "text": "Friendly staff. Locally owned. Beautiful flowers. What's not to love!!", "pics": null, "resp": {"time": 1516392901408, "text": "Thank you, Ben! Please don't hesitate to reach out if you need anything else. Take care. -Felisha, Owner"}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "103546667151620087606", "name": "Jack Przebienda", "time": 1471470097666, "rating": 5.0, "text": "Flowers were delivered and my girlfriend absolutely loved them. Great Value, would recommend", "pics": null, "resp": {"time": 1471642236452, "text": "We are so glad she loved them. Thank you for call Amy's Florist. We look forward to serving you in the future."}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "102713123027804351628", "name": "Andrea White", "time": 1513444339634, "rating": 1.0, "text": "Really rude people! Terrible customer service.  Called to get more information on their flower arrangements, unfortunately their website is limited on options so I went on their Facebook page and was able to find a lot more options for what I was looking for.  I had to literally described them the flowers I was looking at, and told them it would be easier for them to jump on their page with me .... nop! They started getting all mad and raised their voice over the phone because THEY DIDN'T KNOW how to even use Facebook.  The woman that was on the phone with me even started talking over me.  WILL NEVER buy anything from here and WILL NEVER recommend this place.\nOne star is even too much!", "pics": null, "resp": {"time": 1513700489771, "text": "Andrea, we want all of our guests to feel comfortable when talking to us, so I'm sorry to hear about your experience. It sounds like there was a miscommunication here, and I appreciate the feedback. If you do choose to do business with us again, we'll work hard to make it a better experience. -Felisha, Owner"}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "117637220938838724264", "name": "Pat Stephenson", "time": 1468440113644, "rating": 1.0, "text": "Nice folks, but somehow they lost the order, it was a funeral so you only get one shot at it.", "pics": null, "resp": {"time": 1471642953392, "text": "Pat I'm sorry to hear this.  I have researched our data base and I'm not showing where an order was placed in your name.  I surely hope if the order was placed with us, that we took care of you to make sure you where completely satisfied."}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "114527330723085439306", "name": "Holly Holman", "time": 1505151953214, "rating": 1.0, "text": "Extremely disappointed in Amy's.  I just sent my mother a birthday bouquet via Teleflora and paid extra for the Premium bouquet which featured a larger arrangement with more flowers (6 large roses and 6 smaller roses).  My mother just texted a picture of the flowers to say thank you and there are 2 roses and a bunch of filler flowers.  I'm in Kansas City, but believe if I were at home, I would be making my way to have a serious talk with Amy or whoever stole my money.  I could've gotten more money's worth out of a Publix bouquet.  I'm seriously angry.  This was NOT a $95 arrangement.", "pics": null, "resp": {"time": 1505247559290, "text": "Hello Holly,\nI'm so sorry you were disappointed in the arrangement. It's not our goal to make customers unhappy.  In this situation going through a 3rd party to place an order is not always the best thing to do. You mention you spent $95 on the arrangement but that's not what the sender gave us to work with. Also, out of the total, we had to take out for the 2 balloons and delivery charge that was associated with the order.  Yes, you could have got more flowers from Publix, but I don't sell Publix quality flowers. I only carry the freshest and finest. I agree the arrangement doesn't look like the picture you picked out and I'm more than happy to correct our mistake.  We want every customer to be completely satisfied ...that's our goal. We gain nothing from an unhappy customer!"}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "101295034883938808288", "name": "Brian Patterson", "time": 1494258644347, "rating": 1.0, "text": "I certainly wouldn't buy from a place that hangs up on its callers, as a vendor.... very unprofessional", "pics": null, "resp": {"time": 1555347676503, "text": "Not sure why you would make a statement as such!  My staff and I are very friendly to every caller unless you are a telemarketer.  We all know how annoying that can be."}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "105505477115782961324", "name": "Tara Campbell", "time": 1456154146070, "rating": 2.0, "text": "Not so nice.  The person I ordered from had an attitude the entire time I was on the phone.  UA discount or not, I do not recommend.", "pics": null, "resp": null, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "104789764592432749952", "name": "Dale Dowdle", "time": 1542236955850, "rating": 5.0, "text": "ALWAYS a Great Experience", "pics": null, "resp": {"time": 1544203608012, "text": "Dale, thanks so much for stopping in! Hope to see you here again, as always! -Felisha, Owner"}, "gmap_id": "0x8888a9e7f445c33d:0xbefd779d526e73a0"}
{"user_id": "108172343833529956193", "name": "Theron Struzik", "time": 1620431002436, "rating": 3.0, "text": "Lovely store front and flowers are ok.", "pics": null, "resp": {"time": 1621281581114, "text": "Thanks for visiting our store"}, "gmap_id": "0x888781b0ea6a70f9:0x699d0d72da6c975c"}
{"user_id": "104503518174746703395", "name": "Erika Deaton", "time": 1615692743246, "rating": 5.0, "text": "Went and rented a tuxedo for my son's prom. They have so much stuff.", "pics": null, "resp": {"time": 1615920329824, "text": "Thanks so much for your kind words!!"}, "gmap_id": "0x888781b0ea6a70f9:0x699d0d72da6c975c"}
{"user_id": "116214110894597865950", "name": "lisa pritchard", "time": 1608247994488, "rating": 5.0, "text": "Wonderful place, great people!", "pics": null, "resp": {"time": 1615920288605, "text": "Thanks so much! We love our customers!!"}, "gmap_id": "0x888781b0ea6a70f9:0x699d0d72da6c975c"}
{"user_id": "108151135159741348588", "name": "Susan Randolph", "time": 1563545276276, "rating": 5.0, "text": "Every item was distinct and beautiful! Reasonably priced also.", "pics": null, "resp": {"time": 1574350360670, "text": "Thanks so much!"}, "gmap_id": "0x888781b0ea6a70f9:0x699d0d72da6c975c"}
{"user_id": "112617314787657415676", "name": "Azsah Arnett", "time": 1521471772563, "rating": 5.0, "text": "Beautiful flowers. Amazing stuff in there store.", "pics": null, "resp": {"time": 1574350466097, "text": "Thanks for coming in. We appreciate out customers so much!!"}, "gmap_id": "0x888781b0ea6a70f9:0x699d0d72da6c975c"}
{"user_id": "109152404475757424898", "name": "Karen Ball", "time": 1546905971333, "rating": 2.0, "text": "Not open often enough", "pics": null, "resp": {"time": 1574350589221, "text": "Thanks for your input. We are open 6 day a week and are on call on weekends."}, "gmap_id": "0x888781b0ea6a70f9:0x699d0d72da6c975c"}
{"user_id": "115112248668161717421", "name": "Patrick Heintz", "time": 1456780260765, "rating": 5.0, "text": "Very friendly", "pics": null, "resp": {"time": 1574350479832, "text": "Thanks!!"}, "gmap_id": "0x888781b0ea6a70f9:0x699d0d72da6c975c"}
{"user_id": "104319636216450141987", "name": "Will Hallman", "time": 1618948980861, "rating": 5.0, "text": "Incredible work! My daughter is sick and flowers are her favorite. I believe these brightened her day. Thank you Joy's Flowers!", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "104350086158913937534", "name": "Jamie Moon", "time": 1609969122076, "rating": 2.0, "text": "I ordered a premium floral arrangement for a funeral.  The basket was delivered on time to the viewing, which is more than I can say for some companies. However, it was not as pictured and it was the most pitiful, smallest, arrangement received that day. An $80 basket should not be an embarrassment.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMlY586Uri51lWUPYtSSyHmEFEu4qsk0XBkcRtT=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "100737422915810062716", "name": "Corey McIntyre", "time": 1619542959182, "rating": 5.0, "text": "Flowers I ordered and had sent turned out beautiful..I did the custom pick and let the specialist work there magic ..excellent job and service ..highly recommend", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "113442398050181047960", "name": "Chris H", "time": 1617825995731, "rating": 4.0, "text": "Cool shop with more than just flowers. They were a great help and put together a nice bouquet last minute.", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "101318859791162013967", "name": "Audra Williams", "time": 1538706229656, "rating": 1.0, "text": "I ordered and paid for the premium 68 dollar basket..to say when I saw this arrangement that I was sorely disappointed and felt taken advantage of for the amount I paid is an understatement! I live out of state, so I guess the florist thought that I wouldn't see the end product.... I will never recommend or use this florist again! I could have purchased a basket in my home town and delivered it myself for less than I paid for this arrangement.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipODW16Zir3Do8qM2J4-ny_2LLi51lzBc8gJSoP7=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "110804388038162473248", "name": "Emily Crumpler", "time": 1606768742879, "rating": 5.0, "text": "I order a few baskets at once for different people.  One basket got put at the house behind theirs (there are two houses on their lot). This business offered and took another one out right away, they fix the situation and did not act like it was a problem at all. I would order from them in a heartbeat.  I personally also thought the prices were reasonable.", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "107834802787669993549", "name": "Jn F. Turner", "time": 1613771685738, "rating": 1.0, "text": "I received roses for Valentines day from my husband he was very disappointed at the arrangement looked really cheap and nothing like the picture arrangement he saw online.  You could barely see the roses. I was very disappointed as well after learning what he spent for it. He is still apologizing for it.", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "112159227473219900146", "name": "Senior HelpersNEO", "time": 1592262070228, "rating": 5.0, "text": "I ordered an arrangement from Joy's for the first time a few days ago, and my experience was amazing. The hydrangeas were beautiful and the staff was very helpful. They were able to fulfill my order in a few short hours (for a great price). I highly recommend Joy's, they take great care of their customers, and their flowers are of great quality! You will not be disappointed. Five stars", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "109994079993566614076", "name": "Courtney Moon", "time": 1599705683822, "rating": 1.0, "text": "Ordered an arrangement online for a funeral. Extremely disappointed and shocked when I actually saw the arrangement. Much much smaller in person.  Absolutely wasn't worth the price paid. Would not recommend ordering online. Will not be ordering again.", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "109980108122150253522", "name": "Robert Owens", "time": 1606251058481, "rating": 1.0, "text": "Ok.   Not the warmest reception.   Will try somewhere else next time.", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "107882279768267106448", "name": "Craig Bowman", "time": 1619773376895, "rating": 5.0, "text": "Wonderful experience there", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "115063894329394104846", "name": "Lanicsha W", "time": 1591826819902, "rating": 5.0, "text": "Overall the service from this business was exceptional, I was pleased with both the delivery and the quality of the floral arrangement. I would definitely recommend this business to everyone.", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "109807530112292945164", "name": "Kristen Frost", "time": 1584549970697, "rating": 5.0, "text": "Joy's did my wedding and they did an AMAZING job!! They are my go-to florist for everything! They do such wonderful work and are always so kind! I give them all the stars and will continue to use them and refer them to friends!!", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "108255142428087521267", "name": "Casey Riddlesperger", "time": 1560006613910, "rating": 5.0, "text": "Wonderful people. Great customer service. GORGEOUS flowers. Called with a last minute order needed for the next morning. Beyond impressed with the results. The arrangement was perfect!  Will definitely order from Joy’s again.", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "103095409787471077951", "name": "Kayla Rose", "time": 1572190680765, "rating": 5.0, "text": "Beautiful arrangement. Great price. Fast friendly delivery.", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "116595844582425074279", "name": "Viv Pace", "time": 1581708193125, "rating": 1.0, "text": "Very poor customer service skills taking order by phone giving cryptic answers as if uninterested. It's easier to simply go elsewhere.", "pics": null, "resp": {"time": 1584554290821, "text": "I am so sorry to hear this. We will take note of this and make sure to do a better job. I am truly sorry that you were not happy with your experience. If there is anything we can do to make it better, please feel free to call 256-546-6381 and ask for Kristen."}, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "108064794185268690435", "name": "Shanell Taylor", "time": 1494635896865, "rating": 5.0, "text": "My experience with Joy's Flowers was outstanding! The ordering process was simple. They arrived very quickly. And the flowers were amazing! My mother loved them. I highly recommend ordering from them!", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "104488726795658341962", "name": "Dawn Frost", "time": 1518366745591, "rating": 5.0, "text": "Nice atmosphere for a floral shop great decor with all kinds of items to decorate your home with. From hand painted vases to a refinished dresser for sale. Lady who worked there was very and helpful. She helped me decide on a bouquet for a friends birthday. Will be back to order more flowers for this Valetines Day!", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "103036779830703346636", "name": "C. Bos", "time": 1503605895475, "rating": 5.0, "text": "We count on Joy's flowers to keep beautiful arrangements on Mom's table for every special day. They accommodate special requests as best they can with the flowers they have. Our mom loves pink. :)", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "107121058334579774304", "name": "Crystal Grochola", "time": 1530505113468, "rating": 5.0, "text": "This is a wonderful flower shop and gift shop. Such wonderful people who work there and overall great prices. I will be using them again. Love Joy's .....", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "103477037028579088815", "name": "Jessie Miller", "time": 1583641981408, "rating": 1.0, "text": "My corsage for prom was horrible put together the rose fell off 30 mins of wearing it (thank god I had done senior lead out already) and the baby breath flow had out even bloomed yet and we paid 36.00$ so I give you  a 1", "pics": null, "resp": {"time": 1584554100367, "text": "We are so sorry to hear that. We will be in touch with you soon in hopes that we can do something to make this better. Is there a name other than Jessie Miller that your order would be under?"}, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "118163907088755252003", "name": "Jay P", "time": 1427993178188, "rating": 5.0, "text": "This is at least the 4th year I have ordered from Joy's and my sister loves the arrangements and baskets I send her from here.  This time I spoke with Tiffany and she was bright, pleasant and knowledgeable.  We were able for me to visualize a similar arrangement online  My former wife's family was in the flower business here in South Florida for decades and I appreciate good service and great arrangements and Joy's does it extremely well.", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "105296548097775644639", "name": "Jc Chandler", "time": 1517771987403, "rating": 5.0, "text": "Love this shop. I walk in and they know exactly what I want and my name. Recommend highly. They rap the roses anyway I ask.", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "110327547205904197785", "name": "Kathryn Ballard", "time": 1505398170151, "rating": 5.0, "text": "Excellent service, reasonable prices, and high quality in the snack basket that I ordered. I would highly recommend Joy's...", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "113846363323859468687", "name": "Gene Walker", "time": 1472168925615, "rating": 1.0, "text": "I ordered funeral arrangement and it was not delivered even after being told it had been when I checked the morning of service. Then they were suppose to have a plant delivered to the home of the mother of deceased and has been 2 days and still no plant. I live out of state and called the florist (Joys) myself. Will not use nor recommend them ever again.", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "105078222163305268532", "name": "Laura Singleton", "time": 1492614706674, "rating": 5.0, "text": "VERY EASY TO ORDER ONLINE AND WAS VERY IMPRESSED TO GET AN EMAIL ADVISING ONCE ORDER HAD BEEN DELIVERED", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "111890261710608206212", "name": "Kelsey Todd", "time": 1487116200248, "rating": 1.0, "text": "I got an email saying the flowers were delivered to my friend and she never received them. Hoping this will be fixed, but I am very unsatisfied right now. They were delivered after store hours with no way to figure out what happened so I am super upset. :(", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "104500776298412262686", "name": "C.Eric. Holcomb", "time": 1500322818163, "rating": 5.0, "text": "Wonderful place to find the flowers that you want for that special someone.", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "115314738013575193787", "name": "Tonya Mayhall", "time": 1503514042981, "rating": 5.0, "text": "It was so easy to order and when I called the person I spoke with was so nice", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "102858702926393303996", "name": "Colleen Reed", "time": 1517364774655, "rating": 5.0, "text": "My daughter was very happy with her beautiful flowers!", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "106688005491462985074", "name": "Craig Boose", "time": 1558199266429, "rating": 1.0, "text": "Very embarrassed with the pitiful arrangement i ordered.  Never again will I use this florist.", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "118362817175579735553", "name": "ethan johnson", "time": 1518095268933, "rating": 5.0, "text": "Best florist in Etowah County!! Hands down", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "118227498217614174469", "name": "David Stamps", "time": 1610500661130, "rating": 5.0, "text": "One of the best.", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "108335125616831194397", "name": "Terri Webb", "time": 1511728975560, "rating": 5.0, "text": "Love the employees and their work", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "103078373238438339915", "name": "Edwin Smith", "time": 1581987283777, "rating": 5.0, "text": "Joy\"s is Fantastic!!!!!!!!!!!!!!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "111570308307305049731", "name": "Montez Barker", "time": 1517940917886, "rating": 5.0, "text": "Great gift", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "101486971949994689858", "name": "Regina Vinson Ford", "time": 1489244191257, "rating": 1.0, "text": "Very rude", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "113041882179594942395", "name": "Teisha Johnson", "time": 1484535727746, "rating": 5.0, "text": "Beautiful arrangements and beautiful gifts!!", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "106640344561902476871", "name": "Donna S", "time": 1476145057804, "rating": 5.0, "text": "Great service with fresh flowers", "pics": null, "resp": null, "gmap_id": "0x888a3eae483af4a7:0x6a1722cec0d9f1dd"}
{"user_id": "113804584575764941574", "name": "Michal Massey", "time": 1620406249718, "rating": 2.0, "text": "2 stars because the strawberries were good. What wasn’t were the flowers received. They were more dead than alive when picked up. Picked up from the store. They are already over  priced and then to look like this, never again. I will not be back for strawberries or flowers after this. Pictures will be added.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "104245720813593919173", "name": "Tariq", "time": 1618538301176, "rating": 4.0, "text": "My order couldn't be completed in the manner I ordered it, and it also couldn't be delivered either. All that considered, these guys are outstanding at heart. I got some seriously bad news while standing in the store, and the employee went out of his way to make sure that I received no more negativity while in that establishment. The order was emaculent.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "110423172684984176352", "name": "TDB", "time": 1613788177067, "rating": 1.0, "text": "Sad and pitiful. I'm embarrassed that these were delivered to a friend from me. Nothing like the pictures online. I visited the store to complain and she saw nothing wrong with them; however,  I did receive a refund.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPkEcnN6aUUJWYGu2bBxUZzSTXrxMwuGD6C4M1T=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "101716786310607070915", "name": "Diana SSuarez", "time": 1614216567188, "rating": 1.0, "text": "Terrible customer service. There was a delivery that should have been made on February 14, 2021. The delivery was never made. No one has called about the delay. I have tried to call multiple times and no one answers. When I check online for the status of the order it says that they are \"preparing it\". I am really baffled by the lack of communication and professionalism from this store.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "106978145513380844974", "name": "Henry McElreath", "time": 1613657244930, "rating": 5.0, "text": "I use the website to order.  It is easy and quick. There is a huge selection of fruits and candies.  They deliver when they say they will and my friends are always happy with their baskets.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "112294717360537477678", "name": "Andrew Phelps", "time": 1620851592136, "rating": 2.0, "text": "Do not rely on their delivery. I ordered for my wife's birthday to be delivered to her workplace. It finally just made it... as they've packed up for the day. Silly me, i thought ordering a week in advance would be enough time for them to figure out how to deliver to a business", "pics": null, "resp": {"time": 1621516466901, "text": "Andrew, we apologize. Our mission is to always deliver the best possible customer service experience and we’re so sorry we fell short. We want to make this right. Please send us your order information at orderteam@edible.com."}, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "102030878760645641467", "name": "Ruth Dailey", "time": 1620495691712, "rating": 1.0, "text": "Placed an order to be delivered on Thursday and 3 days later had not arrived. Nobody answer the phone!", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "102618788166766270946", "name": "Allison", "time": 1608675816949, "rating": 1.0, "text": "They were not even PLANNING to deliver my \"SAME DAY DELIVERY\" order until TWO DAYS LATER and did not even reach out to let me know. No phone call, no email, nothing. I even paid extra to have same day delivery. What the heck?? I had to call them to find out what was going on. Worst. Customer. Service. EVER. Will never order from here again. WOW.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "105869576510951967952", "name": "S D", "time": 1614099213299, "rating": 1.0, "text": "Horrible customer service, specifically on 23 Feb 21.  I’m on military orders in DC.  Ordered VDay gifts for my mom and daughter.  They failed to deliver my order for VDay, understandably due to weather.  Spoke to them twice patiently thru the week.  Was told they could deliver it on 21 Feb.  never happened.  Called today and was told “we’re working on orders and calls from yesterday, we can work yours tomorrow.”  I ordered before yesterday...I called before yesterday.  Finally just requested a refund and the girl said done and hung up on me.  She failed to refund both my orders so I had to call back.  Outstanding customer service.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "106325245525438296012", "name": "Chelsea E", "time": 1608684052021, "rating": 1.0, "text": "Horrible customer service at the huntsville area!! My parents never received their arrangement after i placed the order well over two weeks ago! I was told by a staff member that it was on the way at 3pm and now (7pm) I've been on hold for the last twenty minutes trying to figure out where it is! after reading all of these reviews, im convinced there's a truck driver somewhere eating lots of delicious fruit and chocolate... Can I please just have a refund?", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "103236375584549401842", "name": "Ann West", "time": 1601679999651, "rating": 1.0, "text": "Half of my daughters Birthday delivery (from her Military Sister )came apparently the chocolate dipped bananas weren’t ready and were supposed to be delivered before 4pm. They never delivered them and will not answer the phone ! I DO NOT APPRECIATE MY ARMY DAUGHTER THAT IS DEPLOYED AT THE MOMENT AND SENT HER SISTER A GIFT BEING CHARGED FOR ITEMS THAT WERE NOT DELIVERED! That’s theft !", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "110791430982651435552", "name": "David Carr", "time": 1613578807834, "rating": 1.0, "text": "Ordered on 2 occasions, both orders incorrect. The cookies they sent this time looked like they had already been picked over by rats, and their phone is ALWAYS BUSY. same as last year. Never again.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "111435911302815184802", "name": "Rose Marie", "time": 1616274129023, "rating": 5.0, "text": "Excellent surprise and beautifully displayed!", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "102580462590773583896", "name": "M. Alexa", "time": 1606408540113, "rating": 2.0, "text": "My order was not delivered after the staff told me it would be. They ruined a surprise I planned for my son and his family. I called the store for a second time and they had closed. I am beyond disappointed and have left multiple messages asking for a refund.\nUpdate: Eventually delivered the following day.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "109696139141388872310", "name": "Jet Jones", "time": 1557693571500, "rating": 5.0, "text": "The owner of this location is magnificent! He made sure my  Mother's Day order was correct, even with the high volume of orders,  wonderful customer service. Very polite, store very clean. 100% satisfied. Would definitely recommend this location.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "114799205903242071080", "name": "Haley", "time": 1557337390909, "rating": 5.0, "text": "I just ordered an early Mother’s Day edible arrangement two days ago. They called me when it was ready in case I wanted to pick it up early. When I got there, it looked great! They were extremely nice and gave me some ideas to keep the chocolate covered strawberries in good shape for my 15 min drive home in a hot car. I hadn’t even thought about that, so it was very nice for them to mention. I will be ordering from them again in the future.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "114415626997342745515", "name": "Linda Bellamy", "time": 1559664112339, "rating": 5.0, "text": "I usually call for special occasions for my husband. The arrangements are nicely done and it’s eaten within 3 days. Delivery is not always dependable, but the workers are courteous.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "103313803648391788768", "name": "Collin Walker", "time": 1581961572444, "rating": 1.0, "text": "Terrible customer service and my order was never delivered, they barely answer the phone and never reached out to me about my undelivered order.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "108743392474406953172", "name": "B. Christine", "time": 1519169083831, "rating": 5.0, "text": "Update:  Feb 2, 2018\n\nSo after a year of not ordering an Edible Arrangement I decided to give them another try! This time I was blown away by the EXCELLENT service I received!!! The manager MARK is the epitome of a great manager with EXCELLENT customer service.  I had an arrangement scheduled to be delivered this morning 2/2/2018 to a business for an individual, but the individual decided not to go to work that day to my dismay. However, Mark said \"No worries, we will send it out on Monday, don't let that upset you!\"  He is such a great example of what managers should be!! I will support his store from here forward!\n\nAugust 2016\nI placed an order online fairly early in the day and the delivery was not made until very close to the time the recipient was getting off for the day. I was told it would be delivered between 1-3pm and I get a call a 330p stating it was just out for delivery! I don't understand why there is only 1 driver. The next time I'll just go pick it up myself to avoid such a terribly long delay in delivery!", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "101032221694889317052", "name": "Dana Edwards", "time": 1557695365895, "rating": 1.0, "text": "Fruit was good but we did not receive all that we ordered. I paid over 100 dollars for a bouquet AND a box of chocolate dipped strawberries. Only the bouquet arrived. And they have not been answering their phone all day. Very disappointed.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "109387818439428774049", "name": "Andrea “Dre” Mason", "time": 1581803198605, "rating": 1.0, "text": "Terrible customer service when I called in to place an order on Valentine's day. The employee who answered was very unprofessional", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "101017738387242438890", "name": "Brian Moore (Armyballer)", "time": 1554398276530, "rating": 4.0, "text": "Not a bad place, prices were a bit more than expected but I had no idea going in.  Fruit was amazing.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "114098631547103293251", "name": "Austin Pifher", "time": 1482896019900, "rating": 5.0, "text": "First arrangement was done ahead of schedule so I could pick up earlier in the day, fruit was fresh and delicious. Also I had a free voucher that had expired by a few days but the manager still honored it and had this arrangement done within the hour. Both positive experiences, definitely recommend this location!", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "109946204732627603588", "name": "Wabi Sabi", "time": 1493523710343, "rating": 4.0, "text": "The service and arrangement were great. I explained to the guy over the phone what i needed and he had the perfect \"Get Well Soon\" gift ready to go by the time i got there to pick it up.\n[Full disclosure: I didn't give this location 5 stars because i was on hold for a bit longer than i cared to be.]", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "100166886712155267032", "name": "Elizabeth Vance", "time": 1581988107255, "rating": 1.0, "text": "My daughter place an order for me of cover chocolate strawberries for Valentine’s Day pick up was 12:00 on the 14 got there at 12:30 the place was crazy and the people working didn’t know what was going on the order was not ready and said to come back because they were still working on orders for pick up at 9:30 really is 12:30 anyways came back at 4:00 pm waited another 30 minutes while there there was people in the back at least 10 doing nothing but talking one rude person in the front who had no customer service at all finally got my strawberries they were saggy and tasted old will not order go there or have anyone order there again", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "110556666337483618117", "name": "Susan Redwine", "time": 1413386483293, "rating": 5.0, "text": "I received an arrangement of dark chocolate fruit on Sept 26, 2014. Everything was fresh and delicious!  And the balloon that came with the gift is still flying proud on Oct 15, 2014. I will use them every time I have to send a gift.  Fabulous!!!!", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "105575567113623516538", "name": "Linda Ridgeway", "time": 1557700859634, "rating": 5.0, "text": "I HAD THE CHOCOLATE COVERED STRAWBERRIES TODAY AND THEY WERE THE BEST I EVER HAD! THANKS TO THE ENTIRE STAFF!", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "112709140326613927610", "name": "Jennifer Hodges", "time": 1493948361503, "rating": 5.0, "text": "Highly pleased!  Walked in store wanting a quick edible arrangement made & a few other pieces for teacher appreciation gifts!  Service was made a with a smile in no time at all!!", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "104289210672635638419", "name": "Randolph Russell Jr.", "time": 1532102317333, "rating": 5.0, "text": "Great customer service, product and location.  I'd recommend to everyone!", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "106985496090326668463", "name": "Jonathan Andrus", "time": 1487779035310, "rating": 3.0, "text": "Can I give zero stars? Poor delivery time, quality was poor, and to top it off items were missing from the arrangement. DO NOT ORDER FROM THIS LOCATION. $100 for a deflated balloon, sour strawberries, and missing items from the arrangement. A very disappointing Valentines.\n\nUpdate: They refunded my money which was a pleasant surprise. I'm still not convinced I'd order from here again though.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "113223759010523950784", "name": "William Brinkley (Ben)", "time": 1518895953130, "rating": 4.0, "text": "They have very tasty and beautiful looking Arrangements. Pretty neat concept.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "107868132836417947961", "name": "marquetta tatum", "time": 1522082349561, "rating": 5.0, "text": "Mark, you are AWESOME! Thank you for your wonderful Customer Service! God bless you! :)", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "108142356847127912642", "name": "John Gray", "time": 1520861728279, "rating": 5.0, "text": "First, hand salute!!! The service was amazing, ordered same day delivery, took a look at fine print, and it clearly stated \"delivery date and time not guaranteed, call store,\" so i called the store and was very impressed with service.\n\nSecond, the test...i ordered one from the university and whitesburg (neither knew), both same day, both same order, going to same address. Well, i am proud to say, make sure you order from whitesburg store. University did not have the same quality in fruit, even my 4 year old could tell, and some strawberries they shouldnt have used at all.\n\nThanks again Whitesburg store really enjoyed the arrangement and service.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "100921648700579258637", "name": "Waldemar Ramirez", "time": 1487177091850, "rating": 1.0, "text": "Bad experience. Made an order online to have it delivered on ST. Valentines day, did not happened. I called the store to ask about what happened, since I asked my wife about it and my wife said she did not received anything. So of course I am disappointed, I made the order , and hoping that while I was out of town, this would be delivered to her. No other details were offered to me, other than just \" delivery was unsuccessful \"... I know it was unsuccessful, duuhh!  So I asked for a complimentary delivery , the lady completely ignored my request and processed a refund. Which is ok, but you lost a client and possibly more than just me... I would not do no more business with edible arrangements , or at least with this store. Would not recommend you do any business with them.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "110631000538474010357", "name": "Jessica White", "time": 1455585920436, "rating": 1.0, "text": "After ordering an arrangement for my mother and learning that she never received it on the intended date of delivery (Friday, Feb. 12), I called the store multiple times and was unable to reach them. After finally calling corporate I was told that the order would absolutely be ordered, likely by 9 PM (unacceptable in itself).\nAfter it still went unreceived and I filed a formal complaint on Saturday, I was informed that they would likely be open that day due to the holiday weekend and my order would *probably* be delivered that day. Again, my delivery went unreceived.\nSunday, I called the store all day, always reaching a busy tone, but felt confident that the company would at the very LEAST deliver my order first thing that morning, despite it already being two days late. No such luck.\nFINALLY today, three days after my intended delivery date, I was able to get ahold at someone at the store and let them know that I was displeased to say the least, and would like my order to still be delivered but would like the delivery fee refunded, as it did not arrive the day it should have. The person on the phone then said he cancelled my order completely (although I have yet to receive a refund), rang up another order, and charged my card AGAIN for the amount of the basket. By now, there has been $200+ worth of charges put on my card. But hey, they offered to give my mom a free box with 6 chocolate strawberries to make up for it.\nAfter speaking with my mother, we decided to cancel the entire order and, YET AGAIN after not being able to get ahold of anyone at the store for several hours, I called corporate and asked to cancel my order and was informed not only did they have absolutely no record whatsoever of my 2nd purchase (even thought they were more than happy to charge my card earlier today), MY ORIGINAL ORDER HAD BEEN CANCELLED BY SOMEONE ON THE DAY IT WAS SUPPOSED TO BE DELIVERED. I was informed that I should try to get in contact with someone at the store (as if it's so easy) and my complaints would be passed on to the manager. This experience was absolutely DEPLORABLE as far as customer service goes and I am extremely disappointed with the lack of effort to correct the situation.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "112388937332381275500", "name": "Keith Richards", "time": 1432661372548, "rating": 5.0, "text": "Super friendly and the driver was fantastic with delivering my wife's basket to work I was very pleased will be back for other occasions!!!! THUMBS UP", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "117571669154311652454", "name": "Vernon T. Mccants", "time": 1517851512206, "rating": 5.0, "text": "Very very nice staff and made my 1st visit awesome. Make me want to buy everybody chocolate dipped strawberries.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "111081387432003790097", "name": "Dawn Todd", "time": 1482860814923, "rating": 1.0, "text": "Ordered on line to deliver on Dec 23..they never deliver the 90.00 arrangement when I called on Saturday they were closed...the customer service rep.. said iam sorry but there really nothing they can do other then refund the money...ok so they send us tons of offers via email and text ...but can not guarantee your order to be delivered...to me this is one of the worst stores there is they can not do the orders right ...will never order from them again ....as a retail manager...you want a happy customer they come back ...all I am reading on here is how poor service is this stores name...ordered Sherri berry's instead I know she will get it on time...", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "106990156600225585941", "name": "Sedohra Spears", "time": 1508882059157, "rating": 5.0, "text": "This store is amazing and honor customer's birthdays.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "117531827862824105476", "name": "Robert Smalley", "time": 1518811837220, "rating": 2.0, "text": "Blown away with the delivery excuses.  Two days after the delivery date we get strawberries that are inedible", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "108463739083505229509", "name": "Francis Hughes", "time": 1550524443733, "rating": 5.0, "text": "Wonderful, Friendly, pleasant atsmophere.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "110143702279180899219", "name": "Kian vampire", "time": 1557288027151, "rating": 1.0, "text": "Very Rude Employees", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "111769475619609821866", "name": "Southern Flavor 2 Seven Selma,Al", "time": 1549659991268, "rating": 5.0, "text": "Wonderful", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "115891951746885723475", "name": "Bannhen's Southern Que BBQ", "time": 1487112755829, "rating": 1.0, "text": "Horrible. Will never even Consider them again not even for 99.9% discount. Ruined my Anniversary/Valentine's Day 2017.", "pics": null, "resp": null, "gmap_id": "0x8862132575d829c7:0x2cc57f2e8be23c56"}
{"user_id": "104179538001247913938", "name": "Shan Price", "time": 1593018778057, "rating": 1.0, "text": "VERY UNPROFESSIONAL WILL NOT SPEND MONEY HERE AGAIN ONLINE SUCKS TOO", "pics": null, "resp": null, "gmap_id": "0x888923378b6da32f:0x84b3c38594eb6e0e"}
{"user_id": "105714452203811151103", "name": "Dorothy Guillory", "time": 1593488303786, "rating": 1.0, "text": "Okay, expensive and they wasn't given out or receiving any coupons, I was totally disappointed.", "pics": null, "resp": null, "gmap_id": "0x888923378b6da32f:0x84b3c38594eb6e0e"}
{"user_id": "114916332894602113574", "name": "Michelle Foster", "time": 1623267679799, "rating": 5.0, "text": "I looked up this shop online to order flowers for my daughter. I live 2 hours from Birmingham so the reviews and the location near where my daughter lives spoke volumes to me. The flowers were delivered to her within 2 hours after ordering them. The flowers were beautiful!! I just told the lady on the phone a fresh cut and when my daughter sent me a picture, they were gorgeous! I highly recommend this shop!", "pics": null, "resp": {"time": 1623337371641, "text": "Thank you Michelle!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "105196055679458092418", "name": "Jamilli Todd", "time": 1623023785651, "rating": 5.0, "text": "Ada is an angel on Earth. Goes above and beyond. This is a calling for her. She is too good❤️", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM5GGM_MOtgAZ9bHXoI5kM1EnHaB9NqAQyLDLaq=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "103985271404257355741", "name": "V T (YogiBearMom)", "time": 1621927682206, "rating": 5.0, "text": "I finally found my dream SUPREME SWEET PICKLE with or without heat from Bloom and Petal. It is crisp, thick cut and takes 14 days to prepare to perfection. You will NOT be sorry you chose this delicacy from the pickle world! I was a bit concerned to order that many glass jars from another state, however Vince and Aimee did an amazing job of packaging and delivery was swift and flawless! They are an absolute joy to work with and even helped me with ordering more to stock up with in the future. If only more business were so helpful and eager to assist their customers in their guilty pleasures of such a delicious pickle! Thank you so much you two for laughing with me instead of at me! ❤  More business definitely to come with this phenomenal place in good ole' Alabama...GIVE these phenomenal PERFECT PICKLES from Bloom and Petal A TRY!!!👍👍", "pics": null, "resp": {"time": 1617040453786, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "109315235041961515121", "name": "Gari Robin Deason", "time": 1616955497217, "rating": 5.0, "text": "My orders were above and beyond my expectations. The two orders were absolutely wonderful. My two friends that received their bouquets couldn’t stop saying they were beyond beautiful and they had never seen flowers so beautiful. I will definitely be using them again. I recommend them to anyone wanting to send something beautiful to someone special.", "pics": null, "resp": {"time": 1617040443929, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "106688276966332546820", "name": "Crista Roemen", "time": 1568052135417, "rating": 5.0, "text": "Absolutely beautiful! Ordered these for a coworker's birthday. Ordered them through the online process and it was efficient and easy. They had pictures of each bouquet with pricing and the checkout process was smooth. I forgot to leave something on the delivery instructions, so I called them. The person that answered was super helpful and nice. She told the the delivery driver was out with our delivery, but she would make sure she got in touch with him to give our instructions. The delivery was made in the right amount of time and our coworker was so excited. The bouquet is gorgeous, the flowers look vibrant and fresh! Absolutely recommend Bloom & Petal and will definitely use them in the future.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPRWxBMKFiTlA1ZyZ2pARYX68c1w6FhU7do4cR0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOvkgcaLle91TbiW4sUJiYcFDOes8vcpKV_PRK-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPMI8AqlUH-aazLXpDJRPAK6R-DbOlKhJCrnpV1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPgivZO9HO5y0VFJ7TV85_IMqStyvyFqNi73nI4=w150-h150-k-no-p"]}], "resp": {"time": 1579204557493, "text": "Thank you for the great rating!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "104761617080827570735", "name": "Chuck D", "time": 1619798807551, "rating": 5.0, "text": "When a place deserves a five star it should be shared! I placed an order at 9:30 and it arrived to my loved one by 11:00. Incredibly beautiful and to detail from their store photos. Thank you guys!", "pics": null, "resp": {"time": 1619799504773, "text": "Thank you Chuck. We hope she enjoys them."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "108099225090822052872", "name": "Kathleen Ruggiero", "time": 1620745012556, "rating": 5.0, "text": "I live out of state but found this gorgeous shop to send  flowers and gifts to my Aunt. Even from hundreds of miles away I can be sure they will deliver a beautiful arrangement and decadent small gifts that she will love. 100% recommend.", "pics": null, "resp": {"time": 1620745670424, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "100406637672403008394", "name": "bryan gonzalez", "time": 1621827756755, "rating": 5.0, "text": "I live in California and I bought some flowers for my older sister in Birmingham AL, as a birthday present. Whole order process was smooth and easy. Will order from here again.", "pics": null, "resp": {"time": 1623337475313, "text": "Thank you Bryan!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "109147043255836704053", "name": "Madeline (Maddy) Ricketts", "time": 1618332689415, "rating": 5.0, "text": "Bloom and Petal is my absolute favorite florist! They are so prompt with delivery and the arrangements are always beautiful and unique. I love how classy the colors and different flowers always look. Thank you guys so much!", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "110785283631410459189", "name": "Taylor Fitzgerald", "time": 1620155940154, "rating": 5.0, "text": "Thank you Vince, Aimee and your staff for making the process of ordering online, from out of state a simple process. My fiancées Mother, my soon to be mother-in- law, Judi, loved the arrangement! Thank you again!", "pics": null, "resp": {"time": 1620222757445, "text": "Thank you Taylor!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "108978598451608672551", "name": "Ann Henry", "time": 1619206766652, "rating": 5.0, "text": "Beautiful arrangements that exceeded expectations. Vince knew the event space well and made event planning from out of town super simple. Thank you!!!!", "pics": null, "resp": {"time": 1619207495267, "text": "Thank you so much Anne, we enjoyed working with you. Having great customers make our jobs a lot easier."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "113354009456038710631", "name": "Paige Lankford", "time": 1622823726943, "rating": 5.0, "text": "Ordered at 10:00 am was delivered by 11:30 in Pelham. Beautiful and made our friends day. Thank you for your prompt customer service.", "pics": null, "resp": {"time": 1623337412870, "text": "Thank you Paige!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "116380244858073516043", "name": "Kim Burdette", "time": 1615831652313, "rating": 5.0, "text": "They delivered flowers promptly on the same day I ordered. My daughter sent a picture and they were beautiful. Highly recommend Bloom and Petal!", "pics": null, "resp": {"time": 1615832437385, "text": "Thank you Kim! We hope she enjoys them."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "110142394177442963332", "name": "Will Steadman", "time": 1606922738854, "rating": 5.0, "text": "First class company right here! I ordered a customized box and it was delivered in less than 4 hrs from the time of order. Then after the order was delivered the owners sent me a personal Thank you email for my business. The box turned out great and their customer service is top notch! Support these guys if you are in search of flowers/gifts. A+", "pics": null, "resp": {"time": 1606923687180, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "112811364039041496619", "name": "Thad Miller", "time": 1617313930774, "rating": 5.0, "text": "Excellent website! Friendly personnel.\nFresh flowers! They do what they say they will do. Highly recommend this business.", "pics": null, "resp": {"time": 1617314751598, "text": "Thank you sir and thank you for\nYour business."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "101873853808682478850", "name": "S. Davis", "time": 1605559295465, "rating": 5.0, "text": "This was hands down the best florist I’ve worked with in the Birmingham area. I spoke with the friendly, helpful owner and ordered flowers/goodies to be sent to a friend. He did a fantastic job of working with my description of my friend to create something special for her. The arrangement was stunning and to top it off, it was delivered about an hour after I ordered it! My friend was thrilled, and I am grateful for B&P’s work. Bloom and Petal creates beautiful, unique arrangements for a reasonable price (unlike some of their competitors). I understand why the ratings are so high. This is now my go-to florist!", "pics": null, "resp": {"time": 1606258542861, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "112302406475554502184", "name": "Andy Jones", "time": 1614792769310, "rating": 5.0, "text": "Absolutely beautiful. Even better than the picture online. My wife loved them! Thank y’all so much.", "pics": null, "resp": {"time": 1614874154817, "text": "Thank you! We hope she enjoys them!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "114977335445000851826", "name": "Janet Riggs", "time": 1620429799180, "rating": 5.0, "text": "My mother was so very happy with her roses.  Thank you for helping to make her Mother's day special!!", "pics": null, "resp": {"time": 1620488217250, "text": "Thank you! Happy Mother’s Day!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "111499619017200368814", "name": "Luke Hand", "time": 1624037823963, "rating": 5.0, "text": "Awesome job they really know how to put flowers together", "pics": null, "resp": {"time": 1624038501015, "text": "Thank you Luke!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "104625055896976954446", "name": "Laura Luker Doe", "time": 1621962181175, "rating": 5.0, "text": "Vince and the Bloom and Petal team are the best!!! Beautiful flowers for any occasion and fantastic service!", "pics": null, "resp": {"time": 1623337449031, "text": "Thank you Luker Doe!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "112990706078335156535", "name": "Grateful America", "time": 1620220920040, "rating": 5.0, "text": "What a beautiful arrangement. The recipient just loves the flowers.", "pics": null, "resp": {"time": 1620222677442, "text": "Thank you so much. We hope she enjoys the flowers."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "105227683062969775115", "name": "Jake Talley", "time": 1623258239140, "rating": 5.0, "text": "Great Service….. Flowers was delivered in a couple of hours from the time I ordered them.", "pics": null, "resp": {"time": 1623337383194, "text": "Thank you Jake!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "109323288856669220041", "name": "Anne-Marie Brown", "time": 1618353986634, "rating": 5.0, "text": "They went above and beyond to make my experience wonderful and the recipient so happy!", "pics": null, "resp": {"time": 1618355340457, "text": "So glad your experience was wonderful. Thank you for your business."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "115130628808205101735", "name": "Heather Lavender", "time": 1617041991879, "rating": 5.0, "text": "Absolutely AMAZING service and the flowers are gorgeous!!! Thank you so much for working us in today.", "pics": null, "resp": {"time": 1617293220399, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "109597294454991677191", "name": "Gina Cox", "time": 1614628672590, "rating": 5.0, "text": "Always beautiful arrangements. Fast delivery. Great customer service!", "pics": null, "resp": {"time": 1614629914388, "text": "Thank you Gina! We appreciate your business and kind words."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "117930625563855262108", "name": "Cheryle Eiland", "time": 1618258215413, "rating": 5.0, "text": "Absolutely beautiful arrangements every single time. The gift snacks are always a hit with the recipients as well.", "pics": null, "resp": {"time": 1618258905912, "text": "Thank you!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "113400325510809486108", "name": "Geoffrey Gartman", "time": 1613269348612, "rating": 5.0, "text": "My wife received the correct order by my desited delivery time. She is very pleased with arrangement and its quality.", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "109733849082070763781", "name": "Janna Gobeo", "time": 1603662396405, "rating": 5.0, "text": "Everything was perfect! The Box of Joy was \"a nice surprise on this gloomy day...this was such a nice bit of sunshine,\" according to the recipient.  This is at least the third time I've ordered from Bloom and Petal for my daughter in law's important occasions  \"and they are always so beautiful and smell so good.\" This gift box included very thoughtful comfort items - flowers, chocolate, bath things.  I sent it in memory of a year's anniversary of a sweet canine companion's passing. Everything from Bloom and Petal is extraordinary quality - the bright bouquets, the prompt delivery, and the customer service. Outstanding!  Thank you for providing love to our loved ones when we are so far away from them.", "pics": null, "resp": {"time": 1588795651544, "text": "Thank you so much! We hoped she enjoys them!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "115494962407722638431", "name": "Kristin Fulda", "time": 1614383631456, "rating": 5.0, "text": "Lovely bouquet, timely delivery.  Very pleased & would definitely recommend!", "pics": null, "resp": {"time": 1614384269496, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "104639151861163432564", "name": "Bridget W", "time": 1606257029769, "rating": 5.0, "text": "Excellent service and an absolutely beautiful flower arrangement was sent to my friend!! I live out of town but they took great care of me!! Will definitely use again!", "pics": null, "resp": {"time": 1606258505177, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "105167587984385101445", "name": "Marc Tomlinson", "time": 1597871220140, "rating": 5.0, "text": "Had a special request for post funeral arrangements to be delivered to my sister's home and my brother's home in appreciation for their years of caring for our parents. Bloom and Petal listened and heard what I was trying to express. The flower arrangements they delivered brought over 92 years of my parent's lives to a beautiful ending. Thank you.", "pics": null, "resp": {"time": 1598652855675, "text": "Thank you and so glad we could be a part of something so special."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "101314150787428391432", "name": "Tuesdai Bradberry", "time": 1588880862256, "rating": 5.0, "text": "I'm not able to see my mom for mother's day. We live outside of Birmingham now and I was looking for something special I could send her. I made a customized basket on Blood and Petal's website. Great selection of items. I also wanted a smaller arrangement to go in the basket as well and they added that too. The flowers and basket were beautiful. (she cried) :) Customer service was excellent!! They were so detailed and so sweet. Thanks Bloom and Petal for helping us make Mother's Day personal for our mom!", "pics": null, "resp": {"time": 1588946981898, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "115796887640516222592", "name": "John Bowles", "time": 1613171841061, "rating": 5.0, "text": "Very Helpful. Always Beautiful Arrangements.", "pics": null, "resp": {"time": 1613172683212, "text": "Thank you!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "113220649363865739775", "name": "Cynthia Parris", "time": 1606319416908, "rating": 5.0, "text": "As always, Vince was so accommodating for our needs. He helped with flower choices to stay within a budget as we worked through all the details of our father’s funeral.", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "102387405360222216282", "name": "Jan Barnes", "time": 1603948424437, "rating": 5.0, "text": "Bloom and Petal was recommended by my daughter who lives in Alabama.  Great customer service and the flowers were beautiful.   Delivered to my friend the same day I called from Georgia.  Thank you!!!", "pics": null, "resp": {"time": 1604007753696, "text": "Thank you!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "110625695773081333257", "name": "Kristi Tolbert", "time": 1617898234140, "rating": 5.0, "text": "Very happy with my delivery order!", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "117149158759070839046", "name": "Jim Franz", "time": 1604351649543, "rating": 5.0, "text": "Excellent florist. Ordered the Great Pumpkin for my sister and it was a huge hit. Thank you, Bloom and Petal.", "pics": null, "resp": {"time": 1604411445004, "text": "Thank you Jim! We appreciate the kind words and great review!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "101031928334170985152", "name": "Denise Wall", "time": 1601494358328, "rating": 5.0, "text": "I have ordered from Bloom & Petal many times. Their flowers are always beautiful! i placed an order today and it as delivered within 2 hours. WOW, that was fast!", "pics": null, "resp": {"time": 1601495359025, "text": "Thank you so much! We look forward to serving you again."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "105369345462371761698", "name": "Kelli Walker", "time": 1616083362204, "rating": 5.0, "text": "Thank you Bloom and Petal. I'm all the way In Houston,Texas my Aunt loves them.", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "114494705141548355499", "name": "Aleia Crim", "time": 1589038068719, "rating": 5.0, "text": "Bloom and Petal were so easy to work with over the phone with great customer service. My order was somewhat complicated and they simplified things perfectly. They delivered wonderful custom gift baskets and absolutely beautiful flowers. Highly recommend them for you gifting needs!", "pics": null, "resp": {"time": 1589040354078, "text": "Thank you so much Aleia!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "110313155747145050638", "name": "Dan Jasnowski", "time": 1552480799425, "rating": 5.0, "text": "This is the place I buy all my flowers not only because they are sublime, dazzling and top notch but because they go above and beyond the call of duty to ensure you have a superb experience every single time.\n\nThis is the place to get special flowers, folks.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOWiajSSveWTzhhXVMw0XDDXimeO2BxDqLJmEwA=w150-h150-k-no-p"]}], "resp": {"time": 1560942191791, "text": "Thank you Dan!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "103790155118894263034", "name": "Wendy Garner", "time": 1595018571326, "rating": 5.0, "text": "I can always count on Bloom and Petal to provide the most beautiful arrangements! I have used them personally as well as for large events. Vince and his staff are incredibly talented floral designers and care about providing the best experience for their customers.", "pics": null, "resp": {"time": 1595023377253, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "117070743591550388524", "name": "Tammy Henderson", "time": 1604331612400, "rating": 5.0, "text": "I have always had excellent service and products from Bloom and Petal! I highly recommend them for any floral need.", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "106470819669036695129", "name": "Heather Averwater", "time": 1594692646816, "rating": 5.0, "text": "Bloom & Petal were extremely friendly and helped fulfill a unique gift basket order with fast local delivery. So impressed with the excellent service! My best friend loved the treats they customized for her gift basket.", "pics": null, "resp": {"time": 1596734752074, "text": "Thank you so much! We look forward to serving you in the future."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "116542582013202838472", "name": "Anne Weil", "time": 1602704546958, "rating": 5.0, "text": "The delivery was even faster than I expected, and my friend loved the bouquet.  Great work, as always.", "pics": null, "resp": {"time": 1602705605045, "text": "Thank you Anne! We appreciate you!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "114036065569352101107", "name": "Katherine Amerson", "time": 1590763336493, "rating": 5.0, "text": "I live abroad and wanted a gift delivered to someone back home. Ordering online was was super easy and I loved being able to make my own gift box. It was delivered on time and was beautifully packed. My sister was very happy and I am very happy with the service. Would order again!", "pics": null, "resp": {"time": 1596734832673, "text": "Thank you so much! We look forward to serving you in the future."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "103550391714361990355", "name": "Patti Johnson", "time": 1596643036349, "rating": 5.0, "text": "I had a concern and the owners were very open to listening to me.  They went above and beyond to ensure satisfaction of their product.  I will certainly use them again in the future.", "pics": null, "resp": {"time": 1596734690498, "text": "Thank you so much! We look forward to serving you in the future."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "106998344608271602212", "name": "Lisa Amann", "time": 1579806089217, "rating": 5.0, "text": "My daughter lives in Birmingham and I wanted to send her something unique for her birthday. Bloom and Petal’s website was easy to navigate, offered great photos and options, and delivered on time! She sent a photo and said it’s beautiful. Thanks to the delivery guy who made the surprise perfect and to Bloom and Petal for the beautiful living arrangement. Can’t wait for the next occasion!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP_qDw6Dtu9CqVxMD-zNSXubhniXNa085zIk9DP=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "114346212205337382132", "name": "Stephanie Grissom", "time": 1617982910535, "rating": 5.0, "text": "I am a regular customer...they never disappoint!", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "106867764709307281713", "name": "Amanda Heimerl", "time": 1605197581385, "rating": 5.0, "text": "Fast delivery, beautiful arrangement! Thank you for brightening our friend’s day💐", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "104042125662823208603", "name": "Melita", "time": 1597330213708, "rating": 5.0, "text": "Delivered perfectly! Even corrected my error in the delivery address immediately. I cannot wait for another occasion to send flowers to my friends in Birmingham. These aren’t your standard 1800flowers.com arrangements, they are BETTER! Shop local :)", "pics": null, "resp": {"time": 1597397802554, "text": "Thank you so much! Please let us know if you need anything in the future."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "103897102112825354699", "name": "Stephen Lbaz", "time": 1590868238953, "rating": 5.0, "text": "Ordered a dozen roses to be delivered via online platform. She loved them. Great presentation. Top notch service. Highly recommend", "pics": null, "resp": {"time": 1590930606519, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "112753959892816131146", "name": "JENNIFER EICHLER", "time": 1598367323496, "rating": 5.0, "text": "My order was delivered promptly and was exquisite! I will absolutely use this florist again!", "pics": null, "resp": {"time": 1598371754315, "text": "Thank you!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "113278903525212499367", "name": "Amy Wilson", "time": 1613239764555, "rating": 5.0, "text": "The flowers were so pretty!", "pics": null, "resp": {"time": 1613240595236, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "112334796553336625080", "name": "Kandi Allen", "time": 1606324176593, "rating": 5.0, "text": "Timely delivery and the flowers were beautiful. Thanks!", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "101242561233531361032", "name": "B. Luckowski", "time": 1579808119298, "rating": 5.0, "text": "Even though we no longer live in the area, I wanted to send my mother's birthday flowers from a local business, rather than a massive online seller. I finally decided to order directly from Bloom and Petal, and couldn't be happier! The flowers were delivered early the next morning, so she got to enjoy them all day, and they were absolutely beautiful. I'll be sure to order from them again next time!", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "106348419006677467106", "name": "Duckworth Mike", "time": 1596642020877, "rating": 5.0, "text": "Asked for an early delivery the day prior and a nice gentleman was there by 8:30am.  The wife loved the flowers as well.", "pics": null, "resp": {"time": 1596734708518, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "113381517369748546352", "name": "Jason P", "time": 1604768882172, "rating": 5.0, "text": "Ordered same day for pickup. Loved being able to make my own box!", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "114318696216311791908", "name": "Jay BIshop", "time": 1599069270947, "rating": 5.0, "text": "Beautiful arrangement delivered on time. Will always use local florist instead of box web sites.", "pics": null, "resp": {"time": 1600360777855, "text": "Thank you"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "109239251068922230760", "name": "Summer Foster", "time": 1592422944988, "rating": 5.0, "text": "Beautiful flowers and fast delivery. My wife loved them. Thank you so much.", "pics": null, "resp": {"time": 1592426851456, "text": "Thank you!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "103313573963894837212", "name": "Laura Beth Trucks", "time": 1597166617071, "rating": 5.0, "text": "I ordered the flowers and plant late last night, and they were delivered first thing this morning. THANK YOU for helping our family from all over the country give a physical expression of our sympathy, love, & support to a Birmingham family member.", "pics": null, "resp": {"time": 1597397816573, "text": "Thank you"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "116496563833907833249", "name": "Nancy Allen", "time": 1582158632747, "rating": 5.0, "text": "Your website was easy to use. The recipient said the flowers are beautiful. I don't live in the area but remembered seeing your beautiful add in the Hoover Sun some time ago.", "pics": null, "resp": {"time": 1582166144180, "text": "Thank you so much! We hope they enjoy them!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "108978849190494229929", "name": "Roz Houston", "time": 1624030059582, "rating": 5.0, "text": "Bloom & Petal is committed to excellence and their passion for superior quality and service is proven. It is a real blessing to have such a reliable florist in our community.", "pics": null, "resp": {"time": 1590424951099, "text": "Thank you so much! We really appreciate your kind words."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "113296693447990700082", "name": "Carol Loftus", "time": 1608579906200, "rating": 5.0, "text": "She was very very happy with the way delivery was made and the flowers!!!", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "106954972894220166094", "name": "Laura LeNoir", "time": 1594236409376, "rating": 5.0, "text": "I love Bloom & Petal!  Order flowers for mom’s bday and they arrived first thing and were stunning.  Beautiful colors and healthy flowers!  I can’t recommend enough.  This is probably at least the 10th order I have placed or purchased at their store front.  I have never been disappointed!  WOOT!", "pics": null, "resp": {"time": 1596734771732, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "110209469687953180618", "name": "Abbie Newman", "time": 1586553598735, "rating": 5.0, "text": "Beautiful arrangement for my mother’s birthday / Easter weekend. Highly recommend!!!! Check out their cute online gift shop too.", "pics": null, "resp": {"time": 1596735041006, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "112822482892911167094", "name": "Sara Gaiennie", "time": 1582737129444, "rating": 5.0, "text": "This is my go to florist for the Birmingham area! Their arrangements are absolutely gorgeous and they are always incredibly helpful and friendly. I cannot recommend them enough!", "pics": null, "resp": {"time": 1582761710625, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "103650847218893467509", "name": "Tim Cooper", "time": 1585703258956, "rating": 5.0, "text": "Beautiful arrangement of hydrangeas for my mother's 96th birthday. Ordered and delivered within 24 hours. Great service, I highly recommend!\nThank you Bloom and Petal!", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "112678666617707173117", "name": "Jessi Tygielski", "time": 1581477471425, "rating": 5.0, "text": "Vince & Aimee did the florals my husband and I’s wedding and rehearsal dinner and were so amazing to work with! Their years of experience and talent were so apparent in their work! They made our floral dreams come to life and were so organized and efficient! They even made the perfect floral leash for our sweet Peanut which made for some amazing pictures! :)", "pics": null, "resp": {"time": 1581715854834, "text": "Thank you Jessi, you were a pleasure to work with!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "106522045093288752691", "name": "Leah Blair", "time": 1545258871794, "rating": 5.0, "text": "Love this shop!  If I could give it more stars I would!  Called in to order since I didn't see exactly what I needed on the website.  Absolutely wonderful customer service!  They were so friendly, helpful and made the process super simple.  Received a receipt by email with all the order details.  Love that!  Thank you Bloom & Petal!", "pics": null, "resp": {"time": 1560942229604, "text": "Thank you!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "115432037522159167966", "name": "Ashley Nance", "time": 1593637248984, "rating": 5.0, "text": "I am so pleased at how easy it was to order & have it delivered.  Thank you Bloom & Petal!", "pics": null, "resp": {"time": 1596734782551, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "103101818359223521802", "name": "Kristen Swift", "time": 1586999413256, "rating": 5.0, "text": "They are incredibly easy to work with and helped me pick out the perfect flower arrangement for my sister’s birthday. The blooms were so beautiful!", "pics": null, "resp": {"time": 1596734999524, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "100135079196942419220", "name": "Mary Lynch", "time": 1591314204459, "rating": 5.0, "text": "My friend loved the arrangement and the picture she sent of the flowers looked amazing. Thank you!", "pics": null, "resp": {"time": 1596734820040, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "103650847218893467509", "name": "Tim Cooper", "time": 1585703258956, "rating": 5.0, "text": "Beautiful arrangement of hydrangeas for my mother's 96th birthday. Ordered and delivered within 24 hours. Great service, I highly recommend!\nThank you Bloom and Petal!", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "112963912134081624520", "name": "D Guerrier", "time": 1592686879366, "rating": 5.0, "text": "I’m always so pleased with every arrangement.. thank u so much !!!", "pics": null, "resp": {"time": 1596734808464, "text": "Thank you so much! We look forward to serving you in the future."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "107214664082510905481", "name": "Arden Upton", "time": 1597710376930, "rating": 5.0, "text": "Always on-time with deliveries and the most beautiful flowers ever!", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "107847665261004476176", "name": "Angela White", "time": 1568050866734, "rating": 5.0, "text": "I was pleased. I placed an order for a flower delivery late the night before and the flowers were delivered before lunch the very next morning. They were bright and pretty as well! Wished the arrangement was taller but over all I was very pleased!", "pics": null, "resp": {"time": 1579204562814, "text": "Thank you for the great rating!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "116179001871567319834", "name": "Thyra Campbell", "time": 1557509112360, "rating": 5.0, "text": "Vince and his team are amazing! From the beginning Vince helped with the direction we wanted to take after sending pictures of the ideas we wanted. Easy process and the flowers turned out absolutely gorgeous! Compliments throughout the wedding of “those are the prettiest flowers I’ve ever seen” Pick bloom and petal for all of your flower needs!!", "pics": null, "resp": {"time": 1560942166850, "text": "Thank you so much! We enjoyed working with you."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "114274787987109187949", "name": "Tanya Best", "time": 1566345658046, "rating": 5.0, "text": "The bouquet I ordered looked EXACTLY like the photos online. My daughter said they were very fresh when they were delivered. I loved taking care of the entire order online too...very very easy!", "pics": null, "resp": {"time": 1566347084307, "text": "Thank you so much! We hope she enjoys them!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "100194223943173950418", "name": "Alyssa Patronas", "time": 1591644228593, "rating": 5.0, "text": "Love all the options! My daughter was very pleased with all her Goodies!!!", "pics": null, "resp": {"time": 1592497873909, "text": "Thank you!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "102738049112164951883", "name": "Sam Houston", "time": 1593276019749, "rating": 5.0, "text": "Bloom and Petal did a fantastic job on short notice.  I would recommend them to anyone!", "pics": null, "resp": {"time": 1596734801708, "text": "Thank you so much! We look forward to serving you in the future."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "106999694565511647220", "name": "Jeff Elliott", "time": 1592493842045, "rating": 5.0, "text": "Easy as pie!  Delivered early the next day exactly how I wanted.", "pics": null, "resp": {"time": 1592497842881, "text": "Thank you Jeff!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "106704275986626425759", "name": "gary owen", "time": 1613246426252, "rating": 5.0, "text": "Roses where beautiful and fresh! Always top notch!", "pics": null, "resp": {"time": 1596734719316, "text": "Thank you so much! We look forward to serving you in the future."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "115220207241479705832", "name": "Lawrence King", "time": 1581791994980, "rating": 5.0, "text": "Ordered from afar.  Beautiful european style arrangment delivered timely to hotel of sweetheart.  Great company.", "pics": null, "resp": {"time": 1581824889559, "text": "Thank you sir!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "106361579718659712191", "name": "Bo Adkins", "time": 1549592601017, "rating": 5.0, "text": "I just experienced some of the very best customer service of all time.\nMr. Vince at Bloom & Petal personally called me back shortly after I placed an online order to re-assure me that my Valentine's Day order was received and that my expectations will be met. This is what I call  A+ service and thanks to Mr. Vince he has earned yet another extremely satisfied customer for life. What a remarkable person and company. They know how to go above and beyond to exceed a customers expectations. Highly recommend Bloom & Petal on Hwy 280 for your all of your floral needs.\n\nThanks Mr. Vince you are they best!\n- Bo", "pics": null, "resp": {"time": 1579204572425, "text": "Thank you for the great rating!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "107889072934309329949", "name": "Amy Trevathan", "time": 1589311828019, "rating": 5.0, "text": "Great customer service!! Will definitely use them again!!", "pics": null, "resp": {"time": 1589315577059, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "105884373298845885496", "name": "Natalie Garcia", "time": 1589385616251, "rating": 5.0, "text": "They did such a wonderful job on the Mother’s Day gift! Thank you!!", "pics": null, "resp": {"time": 1589450820981, "text": "Thank you!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "111183753034970208552", "name": "Eric Nuckolls", "time": 1533251599501, "rating": 5.0, "text": "Vince and Amy are absolutely fantastic. They far exceeded my expectations both in service and quality of work. My wife loved the flowers I got for her (thank you for your help picking them out Vince!) and still talks about how beautiful they are. Thank you so much for all of your help!", "pics": null, "resp": {"time": 1533255401032, "text": "Thank you Eric"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "105884373298845885496", "name": "Natalie Garcia", "time": 1589385616251, "rating": 5.0, "text": "They did such a wonderful job on the Mother’s Day gift! Thank you!!", "pics": null, "resp": {"time": 1589450820981, "text": "Thank you!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "116894808188539984188", "name": "Jo Ann Mickle", "time": 1607450689417, "rating": 5.0, "text": "Flowers delivered looked just like the picture when ordering!", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "107532457582301392414", "name": "G Weldon", "time": 1570573697627, "rating": 5.0, "text": "Received a spectacular birthday delivery - beautiful flowers, yummy cheese straws and even an impromptu song from the most delightful delivery person!  Perfection", "pics": null, "resp": {"time": 1579204540514, "text": "Thank you for the great rating!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "107889072934309329949", "name": "Amy Trevathan", "time": 1589311828019, "rating": 5.0, "text": "Great customer service!! Will definitely use them again!!", "pics": null, "resp": {"time": 1589315577059, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "104547914205723310891", "name": "Vicki B", "time": 1580393168332, "rating": 5.0, "text": "Outstanding customer service.  Beautiful Roses.  Thank you!!", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "117716806248394603840", "name": "Maria Pak", "time": 1530542710067, "rating": 5.0, "text": "Mr. Vince captured exactly what I wanted and created a bouquet, corsages, bouts, etc that were even more beautiful than I had envisioned. He set up for the ceremony and stuck around through the ceremony in order to set up the reception during the flip, and he even left to go get a flower girl basket as we had forgotten to get one! He truly went above & beyond and created beautiful arrangements that were exactly what I was looking for.", "pics": null, "resp": {"time": 1530544416780, "text": "Thank you so much! You were such a beautiful bride and so easy to work with. That makes my job so much easier!!!!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "113281628744699208890", "name": "Casey Alexander", "time": 1591625007426, "rating": 5.0, "text": "Grandmother loved her birthday bouquet this weekend.  Fresh flowers are her favorite and you all certainly brought her a lot of smiles and joy.  Thank you!", "pics": null, "resp": {"time": 1560942067615, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "100209658242105674423", "name": "Lillian Pascale", "time": 1592268476414, "rating": 5.0, "text": "Customer service was wonderful and flowers were spectacular!!", "pics": null, "resp": {"time": 1592497863754, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "111510793124539708970", "name": "Tammy Madden", "time": 1579971592959, "rating": 5.0, "text": "The flowers are beautiful... perfect for our Sadie’s dance!", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "102563249200081054590", "name": "Melissa Dayrit-Jakobiak", "time": 1600971592439, "rating": 5.0, "text": "Lovely quality products and service", "pics": null, "resp": {"time": 1601495428708, "text": "Thank you"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "117716806248394603840", "name": "Maria Pak", "time": 1530542710067, "rating": 5.0, "text": "Mr. Vince captured exactly what I wanted and created a bouquet, corsages, bouts, etc that were even more beautiful than I had envisioned. He set up for the ceremony and stuck around through the ceremony in order to set up the reception during the flip, and he even left to go get a flower girl basket as we had forgotten to get one! He truly went above & beyond and created beautiful arrangements that were exactly what I was looking for.", "pics": null, "resp": {"time": 1530544416780, "text": "Thank you so much! You were such a beautiful bride and so easy to work with. That makes my job so much easier!!!!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "104893110784345044258", "name": "R SAINT", "time": 1608679704382, "rating": 5.0, "text": "Absolutely beautiful!", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "116215248264964378667", "name": "Pam Baker", "time": 1581715874573, "rating": 5.0, "text": "This florist is AMAZZZING!!! I needed flowers after another order from a different florist was lost. They did the job.....and on Valentine's Day!!!", "pics": null, "resp": {"time": 1581719596478, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "115862059168402780376", "name": "Amy Materson", "time": 1594914527855, "rating": 5.0, "text": "Easy ordering process and early delivery", "pics": null, "resp": {"time": 1595023388729, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "109698420172957838537", "name": "Brody & MK Banna", "time": 1581011870134, "rating": 5.0, "text": "Bloom and Petal always creates the most beautiful flower arrangements.  In addition, their customer service is stellar!", "pics": null, "resp": {"time": 1581020670076, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "102563249200081054590", "name": "Melissa Dayrit-Jakobiak", "time": 1600971592439, "rating": 5.0, "text": "Lovely quality products and service", "pics": null, "resp": {"time": 1601495428708, "text": "Thank you"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "101597528868357639409", "name": "Tammy Lindsey", "time": 1588700527540, "rating": 5.0, "text": "My mother-in-law was very pleased!", "pics": null, "resp": {"time": 1588712988365, "text": "Yay! Thank you so much. We hope she enjoys them!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "102139149736113245775", "name": "Colleen Gentry", "time": 1530915890316, "rating": 5.0, "text": "Ordered an unique bouquet called the Shelby from Bloom and Petals website.   The flowers were extraordinary and robust so just a few blocks with a bunch of baby’s breath.  Delivered on time and to a very happy sister in law.  Thanks Bloom and Peral", "pics": null, "resp": {"time": 1579204603400, "text": "Thank you for the great rating!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "112630026201792946017", "name": "Layne Lavett", "time": 1527106490367, "rating": 5.0, "text": "Wedding Flowers: Bloom And Petal made the wedding absolutely beautiful. Vince and his staff were so friendly and personable with not only the flowers but with advise on anything we asked. They really exceeded my expectations. I highly recommend.", "pics": null, "resp": {"time": 1529320843381, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "109657962826127475430", "name": "Barb Nettleton", "time": 1510757268078, "rating": 5.0, "text": "We live in Michigan and needed to send a gift, incorporated into a floral arrangement, following the passing of loved one.  Aimee was so understanding and helpful, and the arrangement turned out beautifully, just what we anticipated.  I highly recommend this florist!", "pics": null, "resp": {"time": 1510758950005, "text": "Thank you so much! You were a delight to work with. The Angel is beautiful."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "102610703432288959699", "name": "Suzanne McCreedy, Esq.", "time": 1521492054250, "rating": 5.0, "text": "Today was the first time I ordered from Bloom and Petal. Aimee was so helpful! My recipient was so delighted to receive such a gorgeous plant! Thank you!! This will definitely be my go to florist.", "pics": null, "resp": {"time": 1521544175766, "text": "Thank you so much for the wonderful review. We look forward to serving you again. Aimee and Vince Gray"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "107138016004878413389", "name": "Nicole Freeman", "time": 1593615699841, "rating": 5.0, "text": "Wonderful arrangement, thank you!", "pics": null, "resp": {"time": 1596734793579, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "103309149376673186989", "name": "Jerri Tinney", "time": 1575297554257, "rating": 5.0, "text": "I put in an order at  7:45am and my flowers were out for delivery by 8:15am.\nGreat Customer Service!", "pics": null, "resp": {"time": 1579204519737, "text": "Thank you for the great rating!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "104691015565112341349", "name": "Mary Reams", "time": 1593107019729, "rating": 5.0, "text": "Quick service with impeccable taste!", "pics": null, "resp": {"time": 1593111124806, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "110801283589736038055", "name": "Megan V.", "time": 1572029339638, "rating": 5.0, "text": "Gorgeous floral arrangement that arrived super fast! Highly recommend!!", "pics": null, "resp": {"time": 1572032996565, "text": "Thank you so much!! We hope you enjoy."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "106612764603062375041", "name": "rebecca abbruzzo", "time": 1586017380383, "rating": 5.0, "text": "Fast and the flowers are beautiful!!! I’ll never use another Florist!!!❤️❤️❤️", "pics": null, "resp": {"time": 1596735049202, "text": "Thank you so much! We look forward to serving you in the future."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "105341687952981637534", "name": "Latitude Adjustment", "time": 1569346950336, "rating": 5.0, "text": "Thank you for the excellent job! The flowers looked fantastic!", "pics": null, "resp": {"time": 1579204551601, "text": "Thank you for the great rating!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "102436478250989987101", "name": "Theresa Preuit Rhodes", "time": 1570030926849, "rating": 5.0, "text": "Wonderful customer service and made ordering from afar exceptionally easy.", "pics": null, "resp": {"time": 1579204748133, "text": "Thank you for the great rating!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "103563100005790937910", "name": "Jamie Woods", "time": 1590434884391, "rating": 4.0, "text": "Would give 5 but delivery was left exposed with thunder storms in the area.", "pics": null, "resp": {"time": 1596734980178, "text": "We are so sorry about that. I have spoken with our drivers about this situation."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "110716583872107354613", "name": "Lisa Chandler", "time": 1571455016710, "rating": 5.0, "text": "Beautiful arrangements. Looked great!", "pics": null, "resp": {"time": 1571489509692, "text": "Thank you so much."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "116440633235143401632", "name": "Helen Johnson", "time": 1570822148086, "rating": 5.0, "text": "These guys do beautiful arrangements.  THey are my go to for flowers in Birmingham.", "pics": null, "resp": {"time": 1579204535980, "text": "Thank you for the great rating!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "105616791887066473057", "name": "Terese Reed", "time": 1567433530987, "rating": 4.0, "text": "Love this place. Just wish they were open Saturdays.", "pics": null, "resp": {"time": 1579204725082, "text": "Thank you! We are not open on Saturdays due to weddings and events. Please stop by Monday through Friday 8am-5pm. We are open an occasional Saturday during prom season and Homecoming."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "108809483058932623860", "name": "Michael O'Neal", "time": 1622218042696, "rating": 5.0, "text": "Great service!!", "pics": null, "resp": {"time": 1620222769040, "text": "Thank you!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "104059030768147557276", "name": "Sylvia Booth", "time": 1534795882514, "rating": 5.0, "text": "Very inviting place, beautiful arrangements.   I found exactly what I was looking for, a beautiful and healthy peace lily and small arrangement for coffee table in fresh flowers.", "pics": null, "resp": {"time": 1579204593273, "text": "Thank you for the great rating!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "111026019512423260053", "name": "Rodney Collins", "time": 1571762409336, "rating": 5.0, "text": "the flowers look great, and the were delivered on time!", "pics": null, "resp": {"time": 1572033014527, "text": "Thank you so much!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "110589490490581269289", "name": "Matt Dunaway", "time": 1502318631652, "rating": 5.0, "text": "I needed a very special bouquet for my wife on our 20th anniversary and Bloom & Petal was the perfect place to go.  The flowers were spectacular and service excellent.  Thanks so much!", "pics": null, "resp": {"time": 1502319520035, "text": "Thank you so much! Happy Anniversry! I hope she enjoys them."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "112957110078515884299", "name": "maria guzman", "time": 1606852015031, "rating": 5.0, "text": "Great Service!!", "pics": null, "resp": {"time": 1606852649997, "text": "Thank you!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "109452790869871055600", "name": "Kayla Lawrence", "time": 1543269129705, "rating": 5.0, "text": "Vince is AMAZING!! He was my wedding florist and the flowers were unforgettable and far beyond my expectations!", "pics": null, "resp": {"time": 1543273630235, "text": "Thank you so much! You were such a beautiful bride and we so enjoyed working with you!!!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "103494723346193151428", "name": "Karen Dailey", "time": 1576602775470, "rating": 5.0, "text": "fast delivery and beautiful flowers.", "pics": null, "resp": {"time": 1579204496380, "text": "Thank you for the great rating!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "116675514145143623012", "name": "Cris Harmelink", "time": 1590606728723, "rating": 5.0, "text": "Ordered a bouquet from out of state for family who lives in Birmingham. Not only were the flowers delivered the same day, the delivery person followed special delivery instructions for us just perfectly. Not to mention that the arrangement is gorgeous! Thank you!", "pics": null, "resp": {"time": 1590610589590, "text": "Thank you so much Chris!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "100742492721158744111", "name": "Liz Popwell", "time": 1509114368789, "rating": 5.0, "text": "I've never ordered or received flowers from this florist but I just saw a BEAUTIFUL arrangement being delivered to my office and had to go and check you out -- I will definitely recommend you because your flowers are out of this world gorgeous!  Good job!", "pics": null, "resp": {"time": 1509120745134, "text": "Thank you so much Liz."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "116675514145143623012", "name": "Cris Harmelink", "time": 1590606728723, "rating": 5.0, "text": "Ordered a bouquet from out of state for family who lives in Birmingham. Not only were the flowers delivered the same day, the delivery person followed special delivery instructions for us just perfectly. Not to mention that the arrangement is gorgeous! Thank you!", "pics": null, "resp": {"time": 1590610589590, "text": "Thank you so much Chris!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "109237563251326162571", "name": "Regina Hidalgo", "time": 1586641602978, "rating": 5.0, "text": "You guys are awesome!", "pics": null, "resp": {"time": 1596735026486, "text": "Thank you so much! We love awesome customers!"}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "113147052774999807117", "name": "Matt May", "time": 1519247907878, "rating": 5.0, "text": "Fantastic! Were able to deliver flowers on the same day, late in the day. Great customer service.", "pics": null, "resp": {"time": 1519248694817, "text": "Thank you Matt! They are on the way."}, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "118372570070537317298", "name": "Emily Bear", "time": 1613249704375, "rating": 1.0, "text": "Rude", "pics": null, "resp": null, "gmap_id": "0x8889160870dcec01:0xaff8b5d9bd2c15d2"}
{"user_id": "104380297278075783106", "name": "Jesus Navarro", "time": 1622310089335, "rating": 5.0, "text": "I’ve been here a couple of times. The candy selection is great. The gelato is delicious! There’s also many decorations for the home available. Definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "107998514978101956749", "name": "SincerlyTee", "time": 1617914841383, "rating": 5.0, "text": "First, this place is so cute AND clean! So neatly decorated and upon entering the staff was friendly & helpful! Stopped in for a quick gift and found myself some chocolates! The quality of the taste is far better than anything you can buy on the shelf! I will be back!! 5 stars!!!", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "104810623888777010267", "name": "K. Miller", "time": 1619474011645, "rating": 5.0, "text": "Delicious. Worth the drive from up North.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipORsV5AQeftM76CHLBvY8gwc1mAWLqSC0AZL8oa=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "117809555571674319786", "name": "Ruperto G. Rosado", "time": 1622503753168, "rating": 5.0, "text": "They have a wide selection of chocolates and other treats and the store is very clean and organized. The staff is very friendly as well. If you want something of quality, this is the place for you. 10/10 recommended!", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "117021142286141185731", "name": "Marcus Kirby", "time": 1528488666304, "rating": 5.0, "text": "This place is the best for candy and gelato!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOg3Ra_koKiSsKG0LhT076TmH1C15leW4eD0QqL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM0qINbxJO1d12pguLgHtQeX_pjVrrkaKqKAWT7=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN1UBYqCciAoPzkKRokKfR97Yhb8t9P67OmHyai=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMLxrxhotdGGxXg5d78rm1O3f0srrcxz3UGWKBD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipODA30VrZLNIZJhTI-0tUeVW0wHp3J6i_YEBkd0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMQj_i_JbuLohQ7WnDGk4GrxeYZ-OJFHZnHBg4t=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "114343211257755298191", "name": "G Smith", "time": 1612831047390, "rating": 5.0, "text": "I am no chocolate or candy aficionado, but I have sent this candy to  clients for over 20 years.  Everyone on my list looks forward to it and  they want nothing else!  This candy is a southern tradition in Alabama.  Everyone who walks in the door finds a home.", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "108839775574078781077", "name": "Kid Kid", "time": 1613660617597, "rating": 5.0, "text": "Very high in calories lol staff is awesome so was the sweets", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "106102501130054858754", "name": "Diane Slesinski", "time": 1615317402615, "rating": 5.0, "text": "Very pleasant all the time.", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "115175221854514625112", "name": "Vicky Brewer", "time": 1575507621914, "rating": 5.0, "text": "I received a gift basket for Christmas it included the peppermint /chocolate toffee, English toffee, cheese sticks,, heavenly bits and angel bits   OMG it was all delicious.  If you are looking for a Christmas gift or any occasion gift you cannot go wrong with these candies.  'Thank you for providing a perfect  basket of mouth watering delights..  And a big Thank you to my gifter!!!!!", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "102258395732174452622", "name": "mtuscaloosa", "time": 1555694574270, "rating": 5.0, "text": "We saw this candy store on Facebook and decided to stop in during a trip to the area. The ladies working are all super nice and very helpful. The candy is so good! Lots of gift ideas and my wife loved all the different things they stock besides candy.  Very much worth a visit!", "pics": null, "resp": {"time": 1555945309913, "text": "Thank you for stopping in!  We hope to see you again soon!"}, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "106473144445870658150", "name": "Nancy Steadmon", "time": 1563789278395, "rating": 5.0, "text": "Great candy. They did over 30 baskets for me for Christmas.  They were perfect.  The candies are so good", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "117720997514331602928", "name": "Erica Bridwell", "time": 1557520208387, "rating": 5.0, "text": "Best toffee I've ever had! Stopped by to get some for my mom, who loves the toffee too, for mothers day. Got a sample of pineapple gelato. So good!", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "114159614683055438421", "name": "Faith Nugent", "time": 1553823180237, "rating": 5.0, "text": "Such a cool store! You can watch the ladies make the candy, you walk in and it smells like heaven! Tons of candy and gifts to choose from. I purchased gummies, fudge, and caramels and all were delicious!", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "104805541010636908984", "name": "Adrienne Ballard", "time": 1539189830967, "rating": 2.0, "text": "Very disappointed in the staff. Not once could I get help from the 4 employees inside. My husbands birthday is tomorrow and I really wanted to make him a nice basket of treats. But when you walk in, don’t get greeted, don’t get asked if you need help (even after spending 10 minutes inside wondering around). But the two women who walked in before me got asked if they needed help by 3 different women and then the woman after me got asked. After spending $23 on a few pieces of chocolate sure do hope they taste good. Now I know not to waste my lunch break here.", "pics": null, "resp": {"time": 1539800258090, "text": "Hi Adrienne,\n\nI am so sorry that this was your experience! Thank you for your feedback. We will work to ensure that all feel welcome in the candy store. I hope your husband enjoyed the chocolate!\n\nMorgan Price Candy Company"}, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "118423613681479673808", "name": "Venessa Leffers", "time": 1538746638019, "rating": 5.0, "text": "Love having this store in Decatur! English Toffee and Macadamia Nut Toffee are wonderful!! Great place for teacher gifts.", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "111518365545205297775", "name": "Northern Hikes", "time": 1460158323437, "rating": 5.0, "text": "Was unable to attend a special birthday for my niece who lives in Decatur. After a five minute conversation with a helpful  employee, my basket was selected and on it's way. I was blown away when  my niece tested me  two hours later to say thanks. I highly recommend this store.", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "100145535234423435756", "name": "TJ Brakefield", "time": 1488234275834, "rating": 5.0, "text": "The ladies here make some really awesome treats. Out of everything I bought for my girlfriend on Valentine's I recommend the chocolate covered espresso beans above all else, providing you're into that sort of thing.", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "108712668431619994087", "name": "Sherry Nelson", "time": 1553818686782, "rating": 4.0, "text": "Yummy. Need i say more. All kinds of delicious treats.", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "115923169479687556134", "name": "Cynthia Mote", "time": 1578605276478, "rating": 5.0, "text": "Delicious candy!! Really nice employees!!", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "100820510518845217477", "name": "Tammy Hogan", "time": 1553205827886, "rating": 5.0, "text": "Cute shop! English Toffee is so delicious!! Yum!! Will go again!", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "108423630258509547287", "name": "Jennifer Mills Griffis", "time": 1580995676520, "rating": 5.0, "text": "Best sweet treats ever 😍", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "106949651808327289302", "name": "Bob Peters", "time": 1446506010460, "rating": 5.0, "text": "Bob Peters here,\n\nSweet Mother of all things sweet. This place makes me head bang! Every bit of candy I've had is a total screamer. I pick up 50lbs before every canoe trip I go on.", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "111439794424224954175", "name": "Donna Cooper", "time": 1577639286614, "rating": 5.0, "text": "English Toffee is delicious!", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "106221384246881689072", "name": "Karaline", "time": 1484431422820, "rating": 5.0, "text": "If you're not sure what to try, get a basic sea salt caramel. They are heavenly and melt in your mouth.", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "103588624031910221458", "name": "Jeremiah Comer", "time": 1512853286648, "rating": 4.0, "text": "I ordered by phone for a Christmas delivery. Everything was good, but i requested a three tiered box and they received a single box. :/", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "106813661559734078917", "name": "Gary McClimans", "time": 1519041305771, "rating": 5.0, "text": "Wonderful little store! Great service and wide selection.", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "107531207374851798311", "name": "Kimberly Gordon", "time": 1560888002641, "rating": 5.0, "text": "I love this place ..Geloto is sinful 😍", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "113231212067857330056", "name": "Jerry Nobles", "time": 1540247908675, "rating": 5.0, "text": "Excellent in every aspect! Service,quality,clenliness", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "113658556850348843044", "name": "Chandler Reynolds", "time": 1517345120799, "rating": 5.0, "text": "It's pricey but delicious. If you're looking for a treat this is the place to find it!", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "107113428881626018851", "name": "Lisa Pendergrast", "time": 1550550173946, "rating": 5.0, "text": "Amazing place. All i can say is TRUFFLES TRUFFLES TRUFFLES!!!!!", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "105690086703424272124", "name": "Leslie Maxwell", "time": 1528380305467, "rating": 5.0, "text": "Yummy candies and cute merch as well", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "113495585157283807853", "name": "CJ", "time": 1570582222220, "rating": 5.0, "text": "Great toffee", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "105666305968026165423", "name": "Teri Watson", "time": 1578686523515, "rating": 5.0, "text": "Delicious!", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "114952565284287842300", "name": "Rodney Alexander", "time": 1528571050792, "rating": 5.0, "text": "Best place in America to buy handmade candy!!!!!! Thanks Mrs Nancy", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "109368364268100289659", "name": "CJ", "time": 1547706319478, "rating": 5.0, "text": "Great gifts holidays", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "113319278659183954252", "name": "Ray Long", "time": 1570911284598, "rating": 5.0, "text": "Great candy", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "118243947913990594838", "name": "Steve Garner", "time": 1511298788131, "rating": 5.0, "text": "Smells like chocolate and they make the goodies in front of you. Multiple viewer choice awards from The Decatur Daily.", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "102642885560276512760", "name": "Ann Gebhart", "time": 1549936291183, "rating": 5.0, "text": "Wonderful", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "111501599498211535787", "name": "Presley Jenkins", "time": 1509320038334, "rating": 5.0, "text": "I like candy.", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "104032130813831683492", "name": "Jimmy Ray Smith (JRay)", "time": 1487661283036, "rating": 5.0, "text": "Best little chocolate place around", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "118442762822446015484", "name": "Robert Martin", "time": 1486606990608, "rating": 5.0, "text": "Really great... little pricey...", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "109847055798189265462", "name": "Paul Spell", "time": 1505996400493, "rating": 4.0, "text": "Good selection of special chocolates", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "117616862671826159899", "name": "Ryutaro Ozaki", "time": 1393573974450, "rating": 5.0, "text": "(Translated by Google) I was invited by a sweet smell.\nI think that it is good for your use ~.\n\n(Original)\nあま〜い香りに誘われて。\nお使い物にいいと思います〜。", "pics": null, "resp": null, "gmap_id": "0x886286a17eec491b:0x63865ed30289ccf1"}
{"user_id": "110971908054290837867", "name": "Adrian Mines", "time": 1621099573299, "rating": 2.0, "text": "I ordered my mother in law a dozen of doughnut rings ( green apple) with a bouquet of balloons ( mothers day)... well she received the rings which were left on the porch but no balloons.  When I called the manager she informed me they couldn't get any balloons out for 3 days or refund my money 😒.  I wanted my mother in law to have the balloons so she got them 3 days later. They were accompanied by a half dozen chocolate covered strawberries 🍓hence the 2 stars given. Customer service is EVERYTHING especially in these days.  I would do edible arrangements again but definitely at another location.", "pics": null, "resp": {"time": 1621542707295, "text": "Adrian, we apologize. Our mission is to always deliver the best possible customer service experience and we’re so sorry we fell short. We want to make this right. Please send us your order information at orderteam@edible.com."}, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "101117953526939982209", "name": "Da Don Eric O", "time": 1621932950272, "rating": 5.0, "text": "Very good Customer service. Very diligent at Expediting orders. Everytime I place a order it's just as I requested A1", "pics": null, "resp": {"time": 1621953334403, "text": "Hello, thanks so much for shouting out our team! We will be sure to pass this along to the store. We love our store owners and how they’re able to help everyone celebrate their special occasions! ."}, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "113567873198289283349", "name": "Angel Loveless", "time": 1620495162267, "rating": 3.0, "text": "I ordered the Mother’s Day treat box and it did not come in the box shown when ordering, I received 4 cookies not 6 like it said it would have, then instead of 2 mini cheesecakes I got 1 and a brownie, the strawberries did not have the Mother’s Day chocolate piece on top like the description stated. Very unhappy, when a person orders something they expect it to be as shown and as the description states.", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "112069736219237024376", "name": "Chelevia Thompson", "time": 1618529569352, "rating": 5.0, "text": "Perfect example of great customer service and friendly staff! Went out of their way to get my 12 yr daughter an arrangement!", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "104211527682981731687", "name": "Richard Munoz", "time": 1620681999008, "rating": 5.0, "text": "Very helpful. Very kind. Mother's day win!", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "102411070714288716140", "name": "Vance Torres", "time": 1610241915560, "rating": 1.0, "text": "They lie. They told me they weren't taking order anymore at 2pm. That i could schedule an order for the next day.  The person I was getting them for went online and placed the order.  So now she thinks I lied to avoid getting it.\nSo if you call and they lie just place your order online. Customer service is garbage.", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "115167846270224808289", "name": "Latonya Finkley", "time": 1609859129948, "rating": 5.0, "text": "One of the Best gifts to give a person for any occasion...Customer Service is always \"awesome\" and the fruits are always fresh.", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "103831703671271685751", "name": "Tracy Mills", "time": 1619806703071, "rating": 1.0, "text": "I am not one to give reviews but this was one of the worst customer services experiences I've ever had.  I ordered this for an employee to be delivered on their work anniversary.  It is 2 days later and it was never delivered.  They said they attempted delivery and now it needs to be picked up in store.  I will never order from this location again.", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "111230094317158417191", "name": "Lisa Cunningham", "time": 1598633817256, "rating": 5.0, "text": "Called and ask if they had pre-made arrangement, I picked up @hwood store, was beautiful and tasty♥️", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "115088242778529579564", "name": "Colby Lane", "time": 1607924023006, "rating": 4.0, "text": "excellent gift shop, great collection.", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "117543904708033435288", "name": "overworkedcop", "time": 1581729800664, "rating": 5.0, "text": "I made an order on line and the order went to another location by accident. The staff at this store went above and beyond to help me get my order in time for Valentines Day. They were super helpful and friendly. I would highly recommend this store!", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "104769555120761012389", "name": "Starry Jones", "time": 1603758518187, "rating": 1.0, "text": "If I could  give zero stars I would  this location  was so unprofessional, the fruit was old and smelling. The manager admitted to the fruit being over ripe but wouldn't give me a refund nor send another arrangement and demanded pics like I was lying. They are too high to be sending out old fruit and bad customer service", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "113382403438797109474", "name": "Pastor Deon Howard", "time": 1582167442025, "rating": 5.0, "text": "Placed an order for my wife that was delivered quickly, the presentation was awesome and the fruit was fresh and delicious. I have never had a bad experience with this company and will continue to support them.", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "100826151095063019119", "name": "Andy Marbutt", "time": 1582113724216, "rating": 5.0, "text": "I made an order online and somehow it got sent to another location. The staff at this location went above and beyond to help me. They were super friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "111299502187816967282", "name": "Nicole Thomas", "time": 1550355553730, "rating": 4.0, "text": "I ordered online Monday Feb 9th to have delivered to my husband's wk. Extremely easy online order & Exceptional delivery!! Fruit was fresh, ripe, & tasty. We're still enjoying the fruit 3 days later! A bit pricey with double delivery charge, but it was Valentine's. Busiest day of yr probably. I would recommend this to anyone.", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "111092588535648449812", "name": "Bernice Bunkley", "time": 1581730562295, "rating": 2.0, "text": "Received  Chocolate covered  Strawberries. The strawberry was not sweet.", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "106783254743141557464", "name": "Kasey Bodine", "time": 1561720515375, "rating": 5.0, "text": "I needed my delivery to meet a certain time frame and changed same day. I called and they made it happen within the hour! Very thankful for great customer service!", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "115438189676390179670", "name": "Linda Laughlin", "time": 1581689610798, "rating": 1.0, "text": "I know it was Valentine’s Day, but wouldn’t even help me to deliver something that was very close to them", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "101788747508256098733", "name": "Purrito 38", "time": 1568396369075, "rating": 5.0, "text": "Great workers nice and friendly and I love the smell", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "113036511893173740564", "name": "Shaprecious Mcgruder", "time": 1523141838507, "rating": 5.0, "text": "I live in GA and I wanted to do something special for my Aunt's birthday in Bessemer. I placed my order online at 1:14pm swear to God I got a confirmation at 2:56 pm saying it had been delivered! I was in shock. I thought \" oh maybe they did a crappy job\" or \" maybe the left out my additional items\" NOPE! She loved it and the personal note. Thank Thank You!", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "104263361737202048417", "name": "Kyle Partridge", "time": 1501776145947, "rating": 1.0, "text": "Set up a pick up for 10:30 and used my 30 minute break to go get it and bring it to my girlfriend for her birthday. Got here at 10:30 only to be told it wouldn't be ready for another 10 minutes and I wasn't the happiest but I understood and went to wait in my car. Sat in my car for another 20 minutes before I had to go back inside to check and see how much longer it was going to be. So not only was it not on time I am now late for work and I won't even get to bring it to her for her birthday while she is at work. Terrible customer service. If you schedule a time it should be done at the time not whenever it suits the workers.", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "108613597005269960014", "name": "Ben Tonner", "time": 1518054391366, "rating": 4.0, "text": "Placed the order online and used a coupon. It was ready before the time I requested which was really nice. Overall very happy", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "113332351981430032674", "name": "Pam Braswell", "time": 1548944482235, "rating": 5.0, "text": "So kind to me and I will be using them again in the future!", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "112295957606335461513", "name": "Michael Fagin", "time": 1469315328738, "rating": 5.0, "text": "Great customer service on 7/19/2016.  In addition to my online pickup, I ordered a smoothie and it was made with fresh fruits.  Highly recommend this store!", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "112682375408686146421", "name": "Shedrick Flowers", "time": 1358310746387, "rating": 3.0, "text": "Way over-hyped!! Save yourself some money and head to any supermarket to buy your own fruit and play around with arranging it. The presentation just wasn't all that great for the money.", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "109273166663482503223", "name": "King Williams", "time": 1562938394145, "rating": 1.0, "text": "They don’t feel like doing it today but done it last time if people money not good can u just close are let s business that want to make money do it please ughhh y’all really suck the lady sound rude why say u Delivered if you don’t want to deliver.", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "112097003136702233084", "name": "jarvis Wright", "time": 1584034814142, "rating": 5.0, "text": "Amazing service & food!", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "107146586776897888994", "name": "Chelsee Farwell", "time": 1412703427771, "rating": 2.0, "text": "Worst customer service ever. I live out of state and for my sisters 16th birthday we wanted to do something special for her so we decided to have an edible arrangement with balloons delivered to her high school. 72$ later they didn't deliver the balloons and when I called to get a refund for the balloons a man named Bryant answered the phone. I really just would have been fine if they were apologetic towards the situation and cared but instead in a monotone voice the response I was given was \"well sometimes we miss things, do you have the card so I can refund the money\". Outstanding response sir. Needless to say I told them my fiancé would call them with the card information. When he called the owner answered and again was not very sympathetic to the situation. He decided a refund wouldn't matter since the surprise for her birthday was ruined anyways. She had the balloons delivered the next day that we paid for already and a box of 6 complementary strawberries sent with it. At the end of the day if someone in this business would have ACTED like they cared that their business took away from what should have been a special sweet 16th birthday delivery I wouldn't have such a bad taste in my mouth for this company.", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "113906539896619563284", "name": "Michele Coco", "time": 1391649996085, "rating": 1.0, "text": "The customer service at this franchise is HORRIBLE. the manager, Rebecca, had a horrible attitude, as did the delivery driver,  and made what was supposed to be an awesome gift a pain to receive.  I almost called back to tell them to cancel the delivery entirely and to credit the person who sent me the gift.  I was not home for the initial delivery at noon on Wednesday. I was left a message on my cell phone by the delivery man to call the store to reschedule. I called, was placed on hold and then REbecca picked up giving me some stupid line of, \"They are a very busy company and cannot schedule a delivery in  set period of time.\" I then proceeded to ask her if I was supposed to wait here all day to receive my bouquet. She said no, I could come pick it up. They would try to make sure the bouquet was at the store when I arrived. So, wait?  You can't get it to me in a 2 ot 4 hour time period and then you will try to have it there, all the way across town, should I happen to show up?  WHAT?  How is it that FedEx, UPS and even the USPS can deliver things nationwide but this little mom/pop business that serves the Birmingham metro (population 1.5million) cannot get it together to deliver a bouquet in a 2 to 4 hour time slot?  PATHETIC.", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "107023822998551871037", "name": "Lala M", "time": 1504042554686, "rating": 1.0, "text": "Placed an online order. They called and stated they couldn't deliver until tomorrow. They have 5 hours before they close so why not? I originally tried to place an order earlier this morning and they couldn't deliver to the address I requested bc it was 2 miles outside of their delivery area. Ridiculous!!!", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "103750346457568919078", "name": "Remy Helu", "time": 1525303043487, "rating": 5.0, "text": "Yeah anything edible is cool", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "104534728618713097267", "name": "Marcus Ellis", "time": 1528579603389, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "113971358372097696427", "name": "Gerry DAlessandro", "time": 1519584575060, "rating": 1.0, "text": "Nothing edible insight.", "pics": null, "resp": null, "gmap_id": "0x8889218882bfade3:0x9aead16373f89bf3"}
{"user_id": "106935664729365753956", "name": "Nazmi Naziya", "time": 1611239107909, "rating": 5.0, "text": "Absolutely amazing!!! Everything. From the beautiful flowers and vase (that Coco personally took and spent extra time and attention with for us) to the timely response and delivery to the overall above and beyond customer service. This is one of the best shopping experiences I have had in some time and definitely exceeded expectations. Coco was amazing and we will definitely be shopping with her again.", "pics": null, "resp": null, "gmap_id": "0x8889c93b567ea9a5:0xabe29baaa74f53f3"}
{"user_id": "103455142167395535641", "name": "Robert Waldrop", "time": 1613758313168, "rating": 5.0, "text": "They were very helpful i am going to order flowers for Decoration Day for the third Sunday in May", "pics": null, "resp": null, "gmap_id": "0x8889c93b567ea9a5:0xabe29baaa74f53f3"}
{"user_id": "100188367488874096380", "name": "wayne falkner", "time": 1619538182422, "rating": 4.0, "text": "Did not have what I was told would be there .", "pics": null, "resp": null, "gmap_id": "0x8889c93b567ea9a5:0xabe29baaa74f53f3"}
{"user_id": "110633856908688948763", "name": "Diane Swan", "time": 1599160329600, "rating": 5.0, "text": "These are lovely people I stopped by with my sister Barbara Maynard she's been using them for 20 years and I see why they're are sweet people 😊. 5 Stars", "pics": null, "resp": null, "gmap_id": "0x8889c93b567ea9a5:0xabe29baaa74f53f3"}
{"user_id": "110998043594465646716", "name": "Amanda Kilgo", "time": 1589037277930, "rating": 1.0, "text": "I wouldn't even give them a 1 star if possible... Very Very rude I called this morning May 9th 2020 needing 2 items she was VERY RUDE over the phone as if how dare I call to start with  .. I ask if they were open to the public her rudeness started there with huffing and puffing  .. I continued the conversation me being very nice I'm desperate for the 2 peices I need for Decoration... By the end of the conversation she wanted to charge me arm and leg for a $7.00 item .. I told her no thank you and she could keep it I would go elsewhere .. It's sad during this time your try to buy local help small businesses and people have to be so rude and mean... As I will make sure to share my experience from Flowers & More with everyone in cullman... Use other local businesses not Flowers & More very very rude ... negative review...", "pics": null, "resp": null, "gmap_id": "0x8889c93b567ea9a5:0xabe29baaa74f53f3"}
{"user_id": "105528411447492031240", "name": "Renea Marchman", "time": 1569942195962, "rating": 5.0, "text": "Best price for your money .. big selection and good quality flowers.", "pics": null, "resp": null, "gmap_id": "0x8889c93b567ea9a5:0xabe29baaa74f53f3"}
{"user_id": "107018262134589829223", "name": "Dark red Line", "time": 1580581116736, "rating": 5.0, "text": "Great flowers store the people who operate it are awesome!", "pics": null, "resp": null, "gmap_id": "0x8889c93b567ea9a5:0xabe29baaa74f53f3"}
{"user_id": "100550326041198740598", "name": "Patricia McMinn", "time": 1566129574177, "rating": 5.0, "text": "Beautiful arranged flowers & unique arraned with other items incorporated in them 🌹", "pics": null, "resp": null, "gmap_id": "0x8889c93b567ea9a5:0xabe29baaa74f53f3"}
{"user_id": "105204657583969159852", "name": "Kelly Minor", "time": 1482953309724, "rating": 5.0, "text": "They offer the best costumer service and the most beautiful arrangements.", "pics": null, "resp": {"time": 1483285010986, "text": "Thank you Kelly, we appreciate your review and strive the same for every customer."}, "gmap_id": "0x8889c93b567ea9a5:0xabe29baaa74f53f3"}
{"user_id": "118008413569438454763", "name": "Sabrina “Beanna” Songalewski", "time": 1560124174813, "rating": 5.0, "text": "Great service and friendly staff!!!!", "pics": null, "resp": null, "gmap_id": "0x8889c93b567ea9a5:0xabe29baaa74f53f3"}
{"user_id": "116511075244194127651", "name": "Ted Payne", "time": 1560321887300, "rating": 4.0, "text": "Good choice", "pics": null, "resp": null, "gmap_id": "0x8889c93b567ea9a5:0xabe29baaa74f53f3"}
{"user_id": "115515823340403881239", "name": "glenn whitley", "time": 1619465959387, "rating": 5.0, "text": "These folks deliver a great product. They are very helpful and flexible. I will use their services again and would recommend them to anyone looking for a great gift and excellent service.", "pics": null, "resp": null, "gmap_id": "0x8889100b50bb1ac7:0x70c57791037dcc0d"}
{"user_id": "103195242572080911447", "name": "Victoria Harris", "time": 1621891561429, "rating": 5.0, "text": "They have a wonderful basket-maker", "pics": null, "resp": null, "gmap_id": "0x8889100b50bb1ac7:0x70c57791037dcc0d"}
{"user_id": "105767417209614742420", "name": "Rab Stewart", "time": 1574289964300, "rating": 5.0, "text": "Thank yo so much to Mike Lorino and the good people at Contri Brothers. Their gift baskets make a great gift. They have tons of options and you can also customize your gift basket. The gourmet options they have are delicious.", "pics": null, "resp": null, "gmap_id": "0x8889100b50bb1ac7:0x70c57791037dcc0d"}
{"user_id": "116376865874274335044", "name": "James Stone", "time": 1550285176232, "rating": 5.0, "text": "The very best designer in Birmingham, Andrew Stone at the Arrangement Florist at Contri Brothers on 1st Ave North is the most creative and accommodating and personable designer I've ever felt with... I would recommend him for any event... weddings, funerals, holidays and special events. He is the one to call !!!", "pics": null, "resp": null, "gmap_id": "0x8889100b50bb1ac7:0x70c57791037dcc0d"}
{"user_id": "106641888869593728277", "name": "Diane H", "time": 1568396443925, "rating": 5.0, "text": "Great place and wonderful staff! Beautiful arrangements! Fast delivery and great service.", "pics": null, "resp": null, "gmap_id": "0x8889100b50bb1ac7:0x70c57791037dcc0d"}
{"user_id": "118044799174115161543", "name": "Thomas Rodgers", "time": 1534779545530, "rating": 5.0, "text": "I cannot really express how thankful I am that I can simply pick up the phone and have flowers sent to funerals, and that they so consistently express my respect and sadness.  Neither can I easily say how well gift baskets are presented in a nuanced way for any occasion.  Such professionalism is a rare thing.", "pics": null, "resp": null, "gmap_id": "0x8889100b50bb1ac7:0x70c57791037dcc0d"}
{"user_id": "118398827337383561545", "name": "Bryana Mitchell", "time": 1536123290013, "rating": 5.0, "text": "Great customer service. On time delivery. Their wonderful products made a very special surprise for my sister.", "pics": null, "resp": null, "gmap_id": "0x8889100b50bb1ac7:0x70c57791037dcc0d"}
{"user_id": "101797978606144319466", "name": "Kara West McMunn", "time": 1554142940207, "rating": 5.0, "text": "Gray place to get a quality gift basket or flower arrangements.  Love it and they are always unique!", "pics": null, "resp": null, "gmap_id": "0x8889100b50bb1ac7:0x70c57791037dcc0d"}
{"user_id": "116780377774502319613", "name": "Sonja Layton", "time": 1583373967367, "rating": 5.0, "text": "Service was great", "pics": null, "resp": null, "gmap_id": "0x8889100b50bb1ac7:0x70c57791037dcc0d"}
{"user_id": "114465254896411167067", "name": "Lane Hatcher", "time": 1516981072697, "rating": 1.0, "text": "The emptiest most lifeless flower shop I ever seen.", "pics": null, "resp": null, "gmap_id": "0x8889100b50bb1ac7:0x70c57791037dcc0d"}
{"user_id": "110536712111073958337", "name": "Deborah Houser", "time": 1538849954899, "rating": 3.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x8889100b50bb1ac7:0x70c57791037dcc0d"}
{"user_id": "118433572970093274226", "name": "Makenlii Anderson", "time": 1518227496028, "rating": 5.0, "text": "Its a great place for gift shipping", "pics": null, "resp": null, "gmap_id": "0x8889100b50bb1ac7:0x70c57791037dcc0d"}
{"user_id": "112687260347572026591", "name": "Marv Howell", "time": 1578115614798, "rating": 5.0, "text": "Greg is a superb touch of class that has talents that understand what the client wants for the price. Such an easy guy to speak with too!", "pics": null, "resp": null, "gmap_id": "0x888904ee82601e47:0xebbddac6d86a9093"}
{"user_id": "103836910154691426230", "name": "B. Patrick Grider", "time": 1518635803635, "rating": 4.0, "text": "I walked in on Valentine's day looking for half-a-dozen yellow roses with some purple embellishment. The sweet lady and her friendly colleague were able to get me what I wanted and get me out of there in about 15 minutes. I'm pleased with the flowers too! They only lost a star because flowers shouldn't cost $10 a piece.", "pics": null, "resp": null, "gmap_id": "0x888904ee82601e47:0xebbddac6d86a9093"}
{"user_id": "102361263013556769336", "name": "Gregory Hall", "time": 1471786835284, "rating": 5.0, "text": "Used them for years. Best florist in Birmingham. I will use them again...", "pics": null, "resp": null, "gmap_id": "0x888904ee82601e47:0xebbddac6d86a9093"}
{"user_id": "106840379931560257112", "name": "Grace Church", "time": 1514988689693, "rating": 1.0, "text": "I order a flower basket and it was way below my expectations. I was not happy with my purchase! I will not be ordering from A Touch of Class in the future!", "pics": null, "resp": null, "gmap_id": "0x888904ee82601e47:0xebbddac6d86a9093"}
{"user_id": "110526759114887811694", "name": "David Meeks", "time": 1529202552576, "rating": 5.0, "text": "Greg is a great florist.", "pics": null, "resp": null, "gmap_id": "0x888904ee82601e47:0xebbddac6d86a9093"}
{"user_id": "103136168224154012801", "name": "Destiny Fitch", "time": 1479686550987, "rating": 5.0, "text": "Sweet lady", "pics": null, "resp": null, "gmap_id": "0x888904ee82601e47:0xebbddac6d86a9093"}
{"user_id": "116574898161253662052", "name": "Margaret Davis", "time": 1609813334469, "rating": 3.0, "text": "The product was well received, but the employee was not wearing a mask. I asked about it and she said she had \"health issues,\" then walked away and had someone else wait on me. That's the end of this store for me!", "pics": null, "resp": {"time": 1609860849293, "text": "Ma’am, I’m sorry you had a bad experience, but the woman who helped you at first has gone through things that you can’t possibly imagine, therefore she does not wear a mask. She even told you she has issues. That is why she got someone else to help you when you started acting like you were the mask police. I do not work there anymore, but I personally know the people that do. They are hardworking and try their hardest to please everyone and produce great arrangements. Before you go running to Google to post something bad, think about it from all sides first."}, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "112600467893321257732", "name": "jay davis", "time": 1581558666978, "rating": 1.0, "text": "Strawberries were old, browning, mushy, not fresh. Paid $60 for inferior quality. Wasn’t sweet tasted like water. Definitely asking for a refund.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMm-EvrlFC1aLWOhN3iSZoVmhhKRW-_Fs9kptsc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOKUaQhOZlv8yHE5ykKvSRMYZZOoMTtFIq6Gupv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNwheYgu4RpWtEpQwRZXv2z1m2F365tT187Vw_r=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPa8DHv627JB7ompsJKzRVnJ6-f1tTCKz4xhtoD=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "113149321721203532572", "name": "Brent Black", "time": 1613445911113, "rating": 1.0, "text": "Ordered 2 dozen strawberries over $100 for my daughter and wife’s valentines gift.  Confirmed pickup for 6pm at the store that closes at 7pm on Valentines Day.  Get to the store at 6:15 and the store is closed.  Go to the store the next day and not one apology but blame placed on me that it was my fault I wasn’t their at exactly 6:00 pm. Worst customer service I’ve ever dealt with.", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "112399333849609232030", "name": "James Hall", "time": 1620146023135, "rating": 1.0, "text": "I ordered a mothers day arrangement over 100.00 and I asked to have a couple things chocolate  dipped, I was told NO. Even if I paid extra.  I placed my order 5 days before I needed it....so I had to cancel my entire order....they would not work with me at all", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "104246430379799128119", "name": "zachary courtney", "time": 1550180693227, "rating": 1.0, "text": "Not really sure why it takes three hours to get 12 chocolate covered strawberries. Order has been placed since very early a.m. for pick up at 2 p.m. can’t understand why these are not being made until we have arrived and checked in. This place seems under and poorly staffed. As a first time costumer I’m am not impressed and from here on out I will most likely use Shari’s Berries.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPTKya2FA8HH7zkCrsjLe1p7H98zZPHQDaXfv8p=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "116510437807973371456", "name": "carla sigler", "time": 1613320084338, "rating": 1.0, "text": "The platter i received 1 do not look like the picture on site the cookies are not even cooked al the way and the cheese cake is nasty im not happy with this company right now", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "104406937999279663180", "name": "Ashley Green", "time": 1597448541496, "rating": 1.0, "text": "Had placed an order as a surprise for my sister's birthday today. I had begun to get worried when nothing was delivered at 4pm, but the lady on the phone assured me it would be delivered once the driver got back. It is now 6:39 and not only has nothing been delivered, but they are now CLOSED. I am highly infuriated and had to ruin the surprise in attempts of figuring out what all is going on. I definitely will be requesting a full refund and cancellation, as well as making a call to corporate. As I had spent over 80 dollars to be inconvenienced, even though the order was placed ahead of time.", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "102020528460063281642", "name": "Prudence Knight", "time": 1587772283708, "rating": 1.0, "text": "My strawberries were old and at first; they didn’t want to take my order over the phone because I sounded “black”, I heard them whispering in the background, and when they did, the presentation was horrible. They barely wanted to open the door for me because one of them said I was going to rob them. What a mess.", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "106819100192874622856", "name": "Ultreya Park", "time": 1533499619674, "rating": 5.0, "text": "Delicious! They have a ready-to-eat case with single items and a menu to order from in-store. I was looking for something healthy but fun and got the donut, which is a cross-section of an apple dipped in chocolate with coconut on top. Young woman clerk in here was super patient, friendly and helpful. Pine Brook shopping center is a good substitute mall experience, sort of going up and down the sidewalk, and had never been in here.They have three ready-to-go larger arrangements in the refrigerated case. They have balloons and cards, and deliver for a fee. My companion got a chocolate-dipped piece of pineapple in the shape of a star on a stick. They also offer fruit parfaits in a cup @$5, and cones of fruit which are the best deal, and have a binder of other items you can order. The woman answered all of my questions and wasn't in a rush and not phased when chocolate fell on the floor. Fun contest with their photo cardboard cutout.", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "109650027726513069402", "name": "Tracey Quinsey", "time": 1593870835308, "rating": 5.0, "text": "My gift chocolate covered strawberries were devine.", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "106060005435117259933", "name": "Leslie Phillips", "time": 1566222984765, "rating": 5.0, "text": "I placed an online order at 9:00 AM and my friend received her arrangement by lunchtime (same day).  She absolutely LOVED it .  I was very happy with the product, the ease of ordering online, and the quick (same day) delivery.", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "101654060967829356649", "name": "Bearofkratos", "time": 1558545766080, "rating": 4.0, "text": "Best to call ahead before coming and picking, but never had any problems with the choices already made.", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "117763945692894415269", "name": "cindy h", "time": 1561322576209, "rating": 5.0, "text": "A bit pricey but sometimes it is the perfect gift in the summertime!", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "100195995110575869391", "name": "mark christianson", "time": 1534620591486, "rating": 5.0, "text": "Fresh, clean giant sushi rolls. Bowls are nice too. Definitely going back", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "105872407043556709408", "name": "Wedia Billups", "time": 1571239564796, "rating": 5.0, "text": "Awesome place to shop for beautiful fruit arrangements.", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "111264617176720917655", "name": "Carla Owens", "time": 1554492468987, "rating": 5.0, "text": "I’m a frequent customer, amazing customer service, beautiful and fresh product! Never disappointed!", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "115665684708331109043", "name": "Roland Hayes", "time": 1534947389143, "rating": 1.0, "text": "READ THE REVIEWS-YOU WILL SEE I'M NOT THE ONLY ONE WITH THIS PROBLEM!\nI placed my order on Wednesday, August 15, 2018 for an arrangement for my Brother and Sister-in-law who's daughter had died 25 years ago this week and I just wanted to send them something to let them know I was thinking about them.  I ask the representative when was the soonest they could deliver the arrangement?  She told me they could deliver it around 12 Noon on Thursday, August 16, 2018.  I told her that would be great and to please get it there as close to Noon as possible.  She said they would.  I called Edible Arrangements at 12:30pm to see if my order had been delivered. The lady told me it was on the table being finished.  I told her it was supposed to be delivered at Noon and asked her when would it be delivered.  She told me by 2pm.  Bottom line, they did not get the arrangement delivered until 4:45pm and where they had to deliver it to was less than 3 miles from the Edible Arrangements shop.  I called and spoke to the manager and she didn't care at all about the problem and said there was no way they could have gotten it there by Noon.  I ordered it the day before. They open at 8am and you can't fix, arrange and deliver an arrangement by Noon and it is less than 3 miles from your place of business?  Something is wrong with your Business Plan then.  I called and complained to corporate  and they said they would have the owner call me from the Mobile, Alabama location but, I have not received a call yet.  I spent over $100.00 and the business delivered it when they wanted to not, when I wanted them to.  If I don't hear from the owner this week, I'm sending it to my attorney. I know it's just a $100.00 but, it's about the principle of the matter.  This business did not do what they said they would do and they have not even offered an apology, much less a refund.  Well, I expect a call and if I don't get one, it will most certainly cost them more than$100.00.  I don't want to have to do this but, it's time people are held accountable for their actions and it starts now for Edible Arrangements in Mobile,  Alabama.", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "109091393709226165801", "name": "Phil Jones", "time": 1551710563298, "rating": 1.0, "text": "I have never had any problems with any Edible Arrangements location except this one.  After waiting in line on Valentine's Day for almost TWO hours for an order I had placed online, I finally had to leave and get a different V Day present.  Nobody ever came outside to give updates or give reasons for anything. People who had previously ordered days before were coming out saying their order wasn't even done!  It was so disorganized and confusing, and NOBODY was coming out happy.   I would personally like my money back, but the only thing we got was management sending a letter a week later saying they were \"sooooo sorry\" (actual quote, which shows how \"professional\" they are).  They should have had a line for order pick-ups, and then a different line for people last minute ordering. Or they could have at least had someone come out and explain whatever the heck was going on inside the store. Very disappointed and I was definitely not the only one.", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "107218076800035763161", "name": "Bailey Whittington", "time": 1476720401112, "rating": 5.0, "text": "I spoke with a Mr. Colten today who was perfect and gave me every bit of information i needed and more. His customer service skills are excellent. Highly recommended!!", "pics": null, "resp": {"time": 1478279491497, "text": "Bailey Whittington, we're so glad everything worked out for you! Would you like us to enter a compliment to the location on your behalf. If so, please e-mail us at orderteam@edible.com. We'd love to share this with that management team!"}, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "105486801344381786749", "name": "Angela Haynes", "time": 1550195875709, "rating": 1.0, "text": "Terrible customer service, ordered for Valentine's day, went to pick up at my arranged time, stood in line 2 hrs, still not ready. Won't order from this store\never again. Will order from Shari's berries.They don't even deserve 1 star", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "113603569603579055256", "name": "Andrew Conant", "time": 1490741110049, "rating": 3.0, "text": "Called the day before my wife's birthday to get her some strawberries, pineapples, and bananas all covered in chocolate. For whatever reason they thought I said no bananas and add apples. I'm sure it was a misunderstanding of some sort. MAKE SURE YOU DOUBLE CHECK YOUR ORDER WHEN YOU ORDER OVER THE PHONE.\nI contacted the store to tell then what happened and the last laughed and said \"well the apples and pineapples are really good.\" That's not the point. My wife loves chocolate covered bananas and she didn't get any of them.\nI called back and spoke with a man who said I could come back by and pick up the bananas, thus salvaging later purchases from me.", "pics": null, "resp": {"time": 1491266688998, "text": "Andrew Conant We’re very sorry we disappointed you. Please email us at orderteam@edible.com with your order details, and we will look into this farther for you."}, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "103819610094251364461", "name": "Nikki Scairono", "time": 1439672520205, "rating": 5.0, "text": "Keshawn was so sweet! Excellent customer service. He went above and beyond and his employer is lucky to have him!", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "114273563913280115084", "name": "eddieb247365", "time": 1536152122078, "rating": 3.0, "text": "The arrangements are nice but a little pricey", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "111541243915609230257", "name": "Keon Davis", "time": 1550184322371, "rating": 1.0, "text": "This store was not prepared for valentines day! This is by far the worst store ive been too!", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "117866583130808632816", "name": "Braxton Carrington", "time": 1526257094009, "rating": 1.0, "text": "Horrible ! My order wasn’t delivered. I called to let them know and they hung up in my face ! Can’t make this stuff up!", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "109460956839007430589", "name": "Michael Vaughn", "time": 1530798640515, "rating": 5.0, "text": "Had to take care of a client", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "111069683638222972229", "name": "Todd Phillips", "time": 1591459093125, "rating": 5.0, "text": "Delicious!!", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "112710469963522246222", "name": "Trish Lewis", "time": 1563147563189, "rating": 1.0, "text": "Fruit not ripe", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "107376857926500224244", "name": "Pam Ward", "time": 1558409404547, "rating": 5.0, "text": "Great place!", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "100446408515755439944", "name": "Brandon Barnes", "time": 1550517720940, "rating": 1.0, "text": "Terrible place Valentine’s Day order three days prior and when I arrived I was greeted to a long line and waited over 3hrs for my order we were never told the hold up or what was going on manager never came out and answered any customer questions poor and very under staff customer service was awful", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "111976912886079517991", "name": "Alexis Washington", "time": 1522466971388, "rating": 1.0, "text": "Ordered and wanted something delivered paid over $200 to have it delivered today and was told over and over it was out for delivery but it was never delivered I’m very disappointed and will be looking to get my full refund back being that I never received my items at all but I already paid Smh never order anything from this place or place a delivery because you won’t get it at all 👎🏼👎🏼👎🏼👎🏼👎🏼", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "111993576957308125006", "name": "J Hennessy", "time": 1457147690712, "rating": 3.0, "text": "They take forever to make deliveries", "pics": null, "resp": null, "gmap_id": "0x889a4d4074fa14bb:0x90ccbfe0582f1c5c"}
{"user_id": "110485934399467527726", "name": "LWS TD", "time": 1594936346919, "rating": 5.0, "text": "I had a simple order. 3 artificial roses wrapped in plastic paper. I was traveling to Huntsville to a cemetery to pay my respects to someone I never knew personally. I called them because they were on my drive route. They were beautiful...wrapped in lace plastic wrapping with a bow. I appreciate it so much.", "pics": null, "resp": null, "gmap_id": "0x888ec62c6a49dbc9:0xd3f07281469cd3c2"}
{"user_id": "106654076367096367238", "name": "Jacob Atwell", "time": 1583948877254, "rating": 5.0, "text": "Beautiful place, calm environment, the air is very fresh.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO3m85YnNLmsluucUJvTpjemuwyC8rxM5v8oLqu=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ec62c6a49dbc9:0xd3f07281469cd3c2"}
{"user_id": "103204073816472845587", "name": "Bradley Walker", "time": 1588788854212, "rating": 5.0, "text": "They were very professional and helpful with getting flowers delivered. I would highly recommend this business to anyone that is looking for exceptional service and beautiful flowers. Thank you for the outstanding customer service!", "pics": null, "resp": null, "gmap_id": "0x888ec62c6a49dbc9:0xd3f07281469cd3c2"}
{"user_id": "105501869617739521120", "name": "Dorothy Larmore", "time": 1574465071145, "rating": 5.0, "text": "We ordered a flower arrangement for a dear friend of ours in her time of loss. I could not have been happier with the flowers or the stuffed animal we got her (she sleeps with it every night and named it after the person she lost.). My friend LOVED her gifts! We will order again in the near future!", "pics": null, "resp": null, "gmap_id": "0x888ec62c6a49dbc9:0xd3f07281469cd3c2"}
{"user_id": "110876359911239578516", "name": "Cynthia Mcwhirter", "time": 1576248605407, "rating": 5.0, "text": "Purchased flowers for funeral of family friend.  Received call that arrangement I ordered was not available and they would make something comparable.  Flowers they provided were beautiful.  I would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x888ec62c6a49dbc9:0xd3f07281469cd3c2"}
{"user_id": "112992697324743306042", "name": "Anita Jackson", "time": 1615060787007, "rating": 5.0, "text": "Always has what we're looking for.", "pics": null, "resp": null, "gmap_id": "0x888ec62c6a49dbc9:0xd3f07281469cd3c2"}
{"user_id": "107938719616097332871", "name": "Cherie", "time": 1554518573497, "rating": 3.0, "text": "Friendly service and reasonable prices.  For Valentine's Day they have nice little buckets filled with candy, snacks, and plushes and will deliver them to the schools. Only negatives the exterior conditions, you definitely would not know it was a florist by the outside plants around the building.", "pics": null, "resp": null, "gmap_id": "0x888ec62c6a49dbc9:0xd3f07281469cd3c2"}
{"user_id": "103134012100308671704", "name": "Stuart Herring", "time": 1550187276411, "rating": 5.0, "text": "I like to shop locally, so I chose Pinedale Gardens as my florist. I'm glad that I did, because of their good selection, friendly and helpful staff, and nice prices. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x888ec62c6a49dbc9:0xd3f07281469cd3c2"}
{"user_id": "103117274664713758433", "name": "Ray Burnett", "time": 1517728852026, "rating": 5.0, "text": "I will always go to pinedale gardens for all of my floral needs. Like on Feb. 3 2018 I bought my wife one dozen red roses for her birthday. She loved them, and the roses were rather reasonable too", "pics": null, "resp": null, "gmap_id": "0x888ec62c6a49dbc9:0xd3f07281469cd3c2"}
{"user_id": "116738011028988193871", "name": "Lori Abbott", "time": 1554231429524, "rating": 5.0, "text": "Amazing people, Mrs. Becky did an awesome job helping me with my wedding flowers", "pics": null, "resp": null, "gmap_id": "0x888ec62c6a49dbc9:0xd3f07281469cd3c2"}
{"user_id": "107869505902952787450", "name": "Barbara Edwards", "time": 1554142341456, "rating": 5.0, "text": "Love the flowers for my mother's funeral", "pics": null, "resp": null, "gmap_id": "0x888ec62c6a49dbc9:0xd3f07281469cd3c2"}
{"user_id": "113591027289076254350", "name": "deborah keefer", "time": 1462543979076, "rating": 5.0, "text": "This is the best florist I've used in my many years of traveling and numerous states I've called home. TY! DK", "pics": null, "resp": null, "gmap_id": "0x888ec62c6a49dbc9:0xd3f07281469cd3c2"}
{"user_id": "109218002279408925988", "name": "TIM Williams", "time": 1555974248882, "rating": 5.0, "text": "Has a nice selection of flowers", "pics": null, "resp": null, "gmap_id": "0x888ec62c6a49dbc9:0xd3f07281469cd3c2"}
{"user_id": "100827980336443509071", "name": "Ron Rothenstine", "time": 1571324848217, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x888ec62c6a49dbc9:0xd3f07281469cd3c2"}
{"user_id": "115078565600981301315", "name": "Carol Moore", "time": 1551920261556, "rating": 5.0, "text": "The best!", "pics": null, "resp": null, "gmap_id": "0x888ec62c6a49dbc9:0xd3f07281469cd3c2"}
{"user_id": "109946448081327677019", "name": "Janine Sims", "time": 1559107283526, "rating": 5.0, "text": "Amazing florist!!!", "pics": null, "resp": null, "gmap_id": "0x888ec62c6a49dbc9:0xd3f07281469cd3c2"}
