{"user_id": "117560578500078862094", "name": "Christopher Dickhute", "time": 1618588802213, "rating": 5.0, "text": "Jonathan did a fantastic job! He is very knowledgeable about window tinting and helped me select the right film for my condo. I had the Cool Touch IR installed and I can already tell a reduction in radiant heat, which will be helpful in the summer months ahead. Would do again in a heartbeat!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN16ddyE9k67flbWzpiIVHBYg3j1PPHfqsC-JBr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMSUBR5jn14OfdX3BM72ntn_-HV2-YzcPHjz7d2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP7NFtJhzarmWaCguhDMKBc37XfwiHY50DopNWn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMdVIB0--FReHD-KiqllyY0KNCUsc9-GEVCGdeD=w150-h150-k-no-p"]}], "resp": {"time": 1619473528791, "text": "It was a pleasure working for you.  Thank you so much for the 5 star review and the positive feedback!"}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "109463666926105323019", "name": "Nicole Thomas", "time": 1627339765529, "rating": 5.0, "text": "Johnathan was very professional. The turn around and install time was very quick. The films have been working great, our house stays much cooler. Would recommend to anyone.", "pics": null, "resp": {"time": 1627576582205, "text": "Thank you.  It was a pleasure working with you guys. I appreciate you taking the time to leave this 5 star review."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "102052772769119208117", "name": "wrew were", "time": 1619468136079, "rating": 5.0, "text": "He did a wonderful job on our Turquoise Place end unit. My wife has light sensitivity and we decided to tint the windows to help with that. Johnathan was professional and polite and worked around us as we were all home. He is also a minister at a local church and just a really nice person. Our condo is now much cooler and my wife can walk around the condo without sunglasses. We will use them again for all of our tinting needs and recommend them to everyone!", "pics": null, "resp": {"time": 1619473458526, "text": "Thank you so much for your positive feedback and for taking the time to post this 5 star review. It truly was a pleasure working for you!"}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "107684513837022982864", "name": "Ken Baird", "time": 1626252079063, "rating": 5.0, "text": "I am extremely pleased with the entire process and results. We have an east end unit at Tidewater Condo that experienced radiant heat issues. There is a noticeable reduction in heat permeation through the windows and I look forward to recouping the cost of the project in reduced energy bills!", "pics": null, "resp": {"time": 1626305749451, "text": "Thank you for the 5* review. You guys were a blessing to work with."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "117087422397601147070", "name": "Alan Petitfils", "time": 1625577156844, "rating": 5.0, "text": "My Wife and I are absolutely thrilled with the work Johnathan did for us. His response time was quick and he provided quality work. He was very friendly and accommodating. I will most certainly recommend his services.", "pics": null, "resp": {"time": 1625606905561, "text": "Thank you for the 5* review.  You guys were a blessing to work with.  👍🏻"}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "103652467784328251028", "name": "Cliff Davis", "time": 1623423952761, "rating": 5.0, "text": "Awesome! Legacy came out and installed a privacy frost on an office door. Quick, professional, and all around great transaction. Highly recommend Legacy and will use them again in the future!", "pics": null, "resp": {"time": 1623429558958, "text": "It was a pleasure working with you.  Thank you for the awesome review!"}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "115113384247717285140", "name": "Gina Sutton", "time": 1616794877474, "rating": 5.0, "text": "Jonathon was very easy to work with and professional in my dealings with him.  He removed and installed solar film within a few days of my contacting him. He performed excellent work. I would definitely recommend him to others.", "pics": null, "resp": {"time": 1619473562704, "text": "Thank you for taking the time to post this awesome review. It was a pleasure working with you."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "105300794406364266093", "name": "Brian Ennis", "time": 1622041119993, "rating": 5.0, "text": "Great service on time and did exactly what we discussed at a very reasonable price. Joy to work with", "pics": null, "resp": {"time": 1622054870707, "text": "Thank you.  It was a pleasure working with you guys.  I appreciate you taking the time to leave this 5 star review."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "113155529474799325908", "name": "Shannon Waters", "time": 1611159843060, "rating": 5.0, "text": "Extra nice and professional. Work quality is definitely a 5 star! Will be referring Jonathan to others.", "pics": null, "resp": {"time": 1619473599295, "text": "Thank you Shannon. It was a pleasure to meet and work for you!"}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "103859744832356757162", "name": "Christina Kountz", "time": 1584453327890, "rating": 5.0, "text": "Jonathan is extremely professional and gets the job done very efficiently! He tinted the windows of our Chiropractic Office. We had questions about which level of tint to use and he was amazing about bringing us samples (TWICE) all in the same day. I requested samples on a Wednesday- he was in here installing on a Monday. He is incredible and we love how everything turned out! Thank you!", "pics": null, "resp": {"time": 1584463982135, "text": "Thank you so much for your positive feedback and for taking the time to post this awesome review.\nIt's our customers that allow us to constantly improve the way we do business, one of which we're really proud of, the quick response time you've been experiencing. I'm so glad you're happy with the end result.  Thank you for your business."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "109827465845246726880", "name": "Ashley Caudle", "time": 1599675464203, "rating": 5.0, "text": "Window films look great and provide so much protection from the heat/sun. You still have the great view we were looking for and a mirror kind of tint on the outside. Very quick installation and professional.", "pics": null, "resp": {"time": 1599776494924, "text": "It was a pleasure working for you both,  Thank you so much for the 5* review and earring your trust."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "106110079338582529064", "name": "Debra Webb", "time": 1593731434074, "rating": 5.0, "text": "We had Jonathon to do all our windows and front door in our home. He provided prompt service and reasonably priced. Thank you Jonathon for a job well done!!\nWe highly recommend Legacy!!", "pics": null, "resp": {"time": 1593746056713, "text": "Thank you so very much for leaving this review.  Glad we could help you guys out.  You’ve both been a pleasure to work for."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "111700087650495347010", "name": "Rian Pedalino", "time": 1594340880614, "rating": 5.0, "text": "Very easy to work with. Very efficient and high quality work. Would recommend Jonathan to anyone!", "pics": null, "resp": {"time": 1595294802256, "text": "Thank you for leaving us this review.  We really appreciate your business.  So glad we could help you out by keeping you cooler  while saving you money."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "111536084014506659681", "name": "brandy jane fox", "time": 1591977017817, "rating": 5.0, "text": "had our windows tinted in our home, great customer service! would highly recommend legacy window film! thanks again!", "pics": null, "resp": {"time": 1592249029284, "text": "Thank you so much for your positive feedback and for taking the time to post this awesome review.  It was a pleasure working with you both."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "116381078269250146855", "name": "S Belanger", "time": 1570238449115, "rating": 5.0, "text": "Very pleased and happy with my window and glass door tint. Johnathon was very professional and prompt. Thank you. I highly recommend him.", "pics": null, "resp": {"time": 1570239828866, "text": "It was a pleasure working for you both.  Thanks again for your business.  Appreciate the review!"}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "100698769870426334269", "name": "Stefano Feo", "time": 1502670975542, "rating": 5.0, "text": "Legacy Window Films did me right.  Excellent workmanship on my Lexus.  Jonathan really knows the greatest new high tech products in window tinting.  His craftsmanship is Suoerb.  Super kind and courteous too.  Will do more of my vehicles!!", "pics": null, "resp": null, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "100337463158889624349", "name": "Stacie Reynolds", "time": 1579383041774, "rating": 5.0, "text": "The response time was quick, the work was done efficiently, and the price was very reasonable.", "pics": null, "resp": {"time": 1579388748524, "text": "Thank you so much for taking the time to leave us this amazing review.  We appreciate your business."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "111370049562308023149", "name": "Dick Kaufman", "time": 1561655263063, "rating": 5.0, "text": "Jonathan did all the Windows in our home\nThe effect is wonderful.  I would recommend him to anyone.", "pics": null, "resp": {"time": 1599776521547, "text": "Thank you so much for your positive feedback and for taking the time to post this awesome review. It was a pleasure working with you."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "111877763545774062844", "name": "Stephen Pridgen", "time": 1530982637006, "rating": 5.0, "text": "Great service, great price & a job professionally done. Pleasant service to boot. Would use again if ever the need.", "pics": null, "resp": {"time": 1531004638233, "text": "Thank you for your using Legacy.  It was a pleasure to work for you."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "115405801130506911106", "name": "chuck chavis", "time": 1553027913191, "rating": 5.0, "text": "Johnathan is very professional and knows his stuff. I would recommend him to everyone . If you are looking for honesty and quality with a fair price than this is the company for you!", "pics": null, "resp": {"time": 1553211652464, "text": "Thank you for leaving a review on Google."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "114486821311018627011", "name": "Alicia Barton", "time": 1510020286639, "rating": 5.0, "text": "Jonathan did an incredible job applying tinted window film on all the windows at our Full Armor center. Fantastic work!!! Highly recommend.", "pics": null, "resp": {"time": 1553211732245, "text": "Thank you for your business!  It’s very much appreciated!"}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "114607230010163160101", "name": "Esther Milne", "time": 1414369378816, "rating": 5.0, "text": "We had Window Film Solutions, LLC come out and put film on all our east facing windows.  The offices are so much cooler now.  Would recommend to all who need their windows tinted.  Thanks guys.", "pics": null, "resp": null, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "110046955877749939347", "name": "Asael Rodriguez", "time": 1520741062366, "rating": 5.0, "text": "Did a great job tinting my 18 wheeler  even though they don’t work with semis\nGreat price and professional job!\nI’m happy with the results,\nWill recommend with all my 18 wheeler driver partners and friends!", "pics": null, "resp": {"time": 1599778564259, "text": "Thank you for the 5* review."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "109648611556657697494", "name": "Stephanie Rhodes", "time": 1506982384886, "rating": 5.0, "text": "We had Jonathon put some film on our windows at our office and it has made an amazing difference in the temperature!  Great job!  I’m actually having come to my home to install the film on a skylight that heats my living room up terribly.", "pics": null, "resp": {"time": 1599778685805, "text": "So pleased to hear you are so much cooler now.  Thank you for your business."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "114176451437147691543", "name": "Sheryl Mitchell", "time": 1506379315411, "rating": 5.0, "text": "I love my tinted windows!  Thanks for the great service.  I would highly recommend Legacy.", "pics": null, "resp": {"time": 1599778729473, "text": "Thank you!  I appreciate the 5* review and your business."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "110934690720377403336", "name": "kal patel", "time": 1453495289094, "rating": 5.0, "text": "We had Johnathan come out and put a white frosting on some of my windows in my store.  Great service and a very reseasobable price.  I would highly recommend them.", "pics": null, "resp": {"time": 1599778806943, "text": "Thank you so much for giving us the opportunity to serve you.  We really appreciate the trust and 5* review."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "101974818445365072161", "name": "Kasey Watkins", "time": 1513431464364, "rating": 5.0, "text": "We have used Jonathan’s services for tinting office windows and car windows and will not use any one else! He’s very professional, thorough and reasonably priced!", "pics": null, "resp": {"time": 1599778642940, "text": "Really enjoyed working with you guys.  Let me know if I can help you out with your home or business tinting needs."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "106300614610396153124", "name": "Jena Watson", "time": 1553204858202, "rating": 5.0, "text": "Excellent job!!!  High recommend them.", "pics": null, "resp": {"time": 1553211692566, "text": "It was a pleasure working for you.  Thank you for leaving a review on Google!"}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
