{"user_id": "106722603154900505973", "name": "Bruce Hillyard", "time": 1595606353270, "rating": 5.0, "text": "We had a total of 5 different glass tops cut for new furniture we had bought. Some had different measuring corners, some had curved fronts but every glass he cut was perfect.  He even had them done 2 days early. I couldnt be more satisfied with his work.", "pics": null, "resp": null, "gmap_id": "0x88882af41d8b72d9:0xf7a7ec826a93804d"}
{"user_id": "114035790724037000092", "name": "Candi Long", "time": 1603766390475, "rating": 5.0, "text": "Phenomenal service. As always!", "pics": null, "resp": null, "gmap_id": "0x88882af41d8b72d9:0xf7a7ec826a93804d"}
{"user_id": "112270870045427218515", "name": "Scott Leslie", "time": 1591555513089, "rating": 5.0, "text": "I can't say enough good things about Jim and his company. Our tile cracked shortly after he installed our shower door, due to no fault of his. He fixed the problem at no charge. He replaced the tile and it looks as good as new.  Thanks Jim!", "pics": null, "resp": null, "gmap_id": "0x88882af41d8b72d9:0xf7a7ec826a93804d"}
{"user_id": "102391108247591118272", "name": "jean cochrane", "time": 1554553934832, "rating": 5.0, "text": "I had an antique piece of furniture that belonged to my grandmother and the mirror was broken.  I was worried that it would be super expensive to have the mirror replaced so I put it off.  I called Hartselle glass and they made the process super easy and I had it back in about a week.  I was surprised at how affordable it was and they were even able to use the original backing on the frame.  I will definitely use them again.", "pics": null, "resp": null, "gmap_id": "0x88882af41d8b72d9:0xf7a7ec826a93804d"}
{"user_id": "117239811618414081877", "name": "MLB S", "time": 1504281935394, "rating": 5.0, "text": "We just moved to Hartselle a few weeks ago and met the owner of Hartselle glass after we closed on our new house while they were installing shower door and closets. He is Fabulous! Great quality and very personable. I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88882af41d8b72d9:0xf7a7ec826a93804d"}
{"user_id": "102754211864275731526", "name": "eric valentine", "time": 1560957365418, "rating": 5.0, "text": "I ordered a Shower glass door coming from Kentucky, They said 2 weeks Just got a call the door came in will be setting up appointment this Wednesday for install. Install was great and they did a great job, great service, and great price.", "pics": null, "resp": null, "gmap_id": "0x88882af41d8b72d9:0xf7a7ec826a93804d"}
{"user_id": "107878752856087800208", "name": "Ben Eubanks", "time": 1528930480989, "rating": 5.0, "text": "Good price, very friendly service. Will definitely use them again! Had a table top and glass cabinet door done.", "pics": null, "resp": null, "gmap_id": "0x88882af41d8b72d9:0xf7a7ec826a93804d"}
{"user_id": "112408494137736015208", "name": "Scott McKelvy", "time": 1516999279497, "rating": 5.0, "text": "Great business.  First class service and great pricing.  Went above and beyond on our repairs.  Thanks Jimmy", "pics": null, "resp": null, "gmap_id": "0x88882af41d8b72d9:0xf7a7ec826a93804d"}
{"user_id": "110098627848741130473", "name": "Collette McEntire", "time": 1555701962654, "rating": 5.0, "text": "Nice people!", "pics": null, "resp": null, "gmap_id": "0x88882af41d8b72d9:0xf7a7ec826a93804d"}
{"user_id": "108347951528179731870", "name": "Shane Witt", "time": 1561235568840, "rating": 5.0, "text": "Slow!", "pics": null, "resp": null, "gmap_id": "0x88882af41d8b72d9:0xf7a7ec826a93804d"}
{"user_id": "110285365145564672263", "name": "Mike Wooley", "time": 1572229534807, "rating": 5.0, "text": "I have known these people every since I was 8 years old. They are one of the few companies who do business the old fashioned way. They earn your trust through hard work, honor and integrity.", "pics": null, "resp": null, "gmap_id": "0x888985876354a959:0xcf60c8602ff107b4"}
{"user_id": "116932230839172833498", "name": "Chris Mahan", "time": 1515443515471, "rating": 5.0, "text": "Great honest business. They helped me out not long ago and were very professional and friendly.", "pics": null, "resp": null, "gmap_id": "0x888985876354a959:0xcf60c8602ff107b4"}
{"user_id": "117719937288074386546", "name": "Mckala Oliver", "time": 1557323799755, "rating": 1.0, "text": "CUSTOMER SERVICE IS AWFUL!!", "pics": null, "resp": null, "gmap_id": "0x888985876354a959:0xcf60c8602ff107b4"}
{"user_id": "104478475884831198893", "name": "Jennifer Abbott", "time": 1566073965139, "rating": 5.0, "text": "👍👍👍👍👍", "pics": null, "resp": null, "gmap_id": "0x888985876354a959:0xcf60c8602ff107b4"}
{"user_id": "102612026182579018353", "name": "Hristo Ivanov", "time": 1509451612084, "rating": 5.0, "text": "One truly windshield professionalist ! The windshield repair service is on level and good price ! Highly recommended !", "pics": null, "resp": null, "gmap_id": "0x88890fd7826e24e3:0x5185ee5d9e41fa98"}
{"user_id": "115812101219814536086", "name": "Mona Manning", "time": 1510577522761, "rating": 5.0, "text": "the best company for me!", "pics": null, "resp": null, "gmap_id": "0x88890fd7826e24e3:0x5185ee5d9e41fa98"}
{"user_id": "102057177947349082898", "name": "Markus Das", "time": 1512464260585, "rating": 5.0, "text": "Amazing Windshield Replacement ! Highly recommend !", "pics": null, "resp": null, "gmap_id": "0x88890fd7826e24e3:0x5185ee5d9e41fa98"}
{"user_id": "106271173574746374754", "name": "Cindy Hankins", "time": 1624061627528, "rating": 5.0, "text": "At my initial appointment, Wade clearly explained options and prices and was very transparent with how the process works.  For the installation, Wade N. and Kevin G. were on time, very professional, did a phenomenal job installing my shower doors, and cleaned up after themselves - even ensured the shower doors were spotless!  Bonus - they offer a military discount on parts.  I highly recommend using Madison Glass Company for all your glass needs!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMZC_FNCT9O1qM4jXqvTIsNaMxto8UNf9vjCRRx=w150-h150-k-no-p"]}], "resp": {"time": 1624989225424, "text": "Cindy, we are so thrilled to hear about your positive experience. Thank you for sharing."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "106501654518344573029", "name": "Nicole Harris", "time": 1621089254520, "rating": 5.0, "text": "This place was great. Ciara and Stephanie were amazing. My husband and I felt like we were family. They went above and beyond to help our unique request.  This will be our go to for all our glass needs. You guys rock", "pics": null, "resp": {"time": 1623939132559, "text": "Fantastic! We love to hear our customers sing praises for our employees. We are so happy to hear that they were able to help you. We can't wait to work with you again!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "105441068661964995562", "name": "James Warren", "time": 1625600154479, "rating": 5.0, "text": "Stephanie and Ciara had the plexiglass had the it cut and holes drilled perfectly.  Our wall next to our wash tube looks great.  Thank you so much.", "pics": null, "resp": {"time": 1626116045383, "text": "Always great to hear from a satisfied customer. Thank you for allowing us to serve you."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "106486106022988955240", "name": "Sherri Schrimsher", "time": 1616506588817, "rating": 5.0, "text": "Stephanie and Ciera are always amazing to work with.  From the time they answer the phone to the time they give you your production everything is smooth and simple!! They make ordering & picking up glass a task I don't dread.  Thanks ladies! Keep up the great work!!", "pics": null, "resp": {"time": 1616695374638, "text": "Sherri, we are ecstatic to hear all the kind words.  Life is tough, so it's great to know we are able to facilitate some smooth and simple transactions. We look forward to serving you each and every time you need us."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "108047890811850547127", "name": "Jeff Burnett", "time": 1622833291122, "rating": 5.0, "text": "Just had my front home window replaced with a quality product...Devin and Keith were on schedule, professional and respectful, and did a timely install - they make a great team (working in-sync and properly representing their company).", "pics": null, "resp": {"time": 1623940116337, "text": "Jeff, thank you for sharing. We are very proud of the guys we have working for us."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "116770864720388397866", "name": "LarryC", "time": 1620136416421, "rating": 5.0, "text": "Wade, Kevin, and Ciara offered excellent help and suggestions in the showroom and on site for our shower door installation.  The installation was on time and done with great quality, service and clean up afterword's.  Call them prior to starting any project for suggestions and help.", "pics": null, "resp": {"time": 1620923686468, "text": "LarryC, we are so happy to hear that our team was able to offer help and suggestions with your shower door installation. There is always more to it than \"just a shower door\". We are always available to answer questions and offer guidance."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "110228523147332099270", "name": "Sydney Prince", "time": 1618504114987, "rating": 5.0, "text": "These guys saved us, big time.\nWade, Kevin and Steph were an awesome team and did a phenomenal job installing our glass shower surround.\nWe originally hired another company to do this, and they wrecked it. Wasted money and damaged our new tile, but Madison Glass got us fixed up and it looks perfect. Super reasonably priced and professional. They deserve 10 stars! Thank you guys so much!", "pics": null, "resp": {"time": 1620056869105, "text": "You are very welcome Sidney!! We truly hate to hear what all you went through before finding us. You are absolutely correct when you say they were an awesome team."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "112343803704036398856", "name": "Katrina Hutchins", "time": 1619459681405, "rating": 1.0, "text": "Called to ask about a quote, $80 before any measuring done and at least 2 weeks before coming out to do the quote.... but when the girl on the phone heard that I’d have to call her back without hearing why, she hangs up in my ear!!😡 I’m definitely not calling back now!", "pics": null, "resp": {"time": 1619467963463, "text": "Katrina, we have a large area of North Alabama where we provide free estimates at absolutely no cost to the customer.  It includes 72 different zip code areas and most of the metropolitan areas. Unfortunately your home is in Gurley which is not included in the free estimate area.\n\nOur typical time to get out to jobs for estimates has historically been one or two days maximum.  It’s a source of pride for us.  But during Covid many people have chosen to stay home and upgrade their homes.  Unfortunately, like all businesses that specialize in home remodeling, we have a backlog of several weeks of work.  We have been working overtime to get our lead times back to normal and are making headway in catching up.\n\nWe offer our sincere apology for any inconvenience this has caused.  We feel it’s more important to be honest and upfront about the current backlog than to promise quicker lead times and then fail to deliver on them.\n\nWe have had problems with our VOIP phone system all day, experiencing several dropped calls. Again, we apologize if this has caused any of our customers to feel anything less than important."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "110990289325471499446", "name": "Sherri Schrimsher", "time": 1614110636008, "rating": 5.0, "text": "We (Alabama Cabinets) uses Madison Glass weekly to fill our glass needs.  Every time I call Ciera or Stephanie are always quick to answer the phone with a smile and go above and beyond for us.  We appreciate how quick their turn around time is and love the customer service that the girls in the office provide.  Keep up the great work Madison Glass!!!", "pics": null, "resp": {"time": 1614112846021, "text": "It is such a pleasure to hear from our repeat customers. We are very fortunate to have Stephanie and Ciara as part of our team; they take customer service seriously. Looking forward to our continued partnership!!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "103241926075298362534", "name": "Keegan Benson", "time": 1611849047573, "rating": 5.0, "text": "Decided to turn my garage into a home gym and thought to call these guys to figure out how much a mirror would cost. I'm definitely glad I did! It was not only cheaper than I expected, but the installation and advice that I received from Wade and Kevin were phenomenal bringing up points I'd never even considered. It was easy, pain free, and the mirror looks awesome!", "pics": null, "resp": {"time": 1611870724002, "text": "We are glad we were able to help you complete your project. We love it when a plan comes together!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "112833182173132440925", "name": "Willie Allemeier", "time": 1617310437180, "rating": 5.0, "text": "Definitely recommend for any/all glass work!  Searched the internet for a glass shop and stopped in, Stephanie and Ciara were great!  I was looking for a place to cut a piece of glass to put in a retirement shadow box.  They measured out everything and then asked to keep the shadow box to make sure everything fit just right.  Rob took it upon himself to cut the glass, ensured just the right fit, and even paid the bill!  Greatly appreciated Rob!", "pics": null, "resp": {"time": 1618517011428, "text": "Willie, we are so glad you found us! We have a wonderful group of people on our team and it's great to hear they were able to take care of your needs. We look forward to being there for you again!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "109494161434288701047", "name": "Shanna White", "time": 1617371371441, "rating": 5.0, "text": "Could not ask for better service, from Christy at the office to Keith and Devin who repaired the window. We had a window broken from a soccer ball and Madison Glass did a great job on the repair! They were quick and professional. Will definitely use Madison Glass again should we have any window issues.", "pics": null, "resp": {"time": 1618863270968, "text": "Shanna, we understand the frustration of the unexpected. We are so glad that Christy was able to get Keith and Devin out to get that repair completed for you. Please let us know if there is anything else we can do for you !!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "115571479194544325884", "name": "Currey Holley", "time": 1615241707786, "rating": 5.0, "text": "I ordered some glass for my showcases on Thursday and they had them cut Friday morning. Stephanie and Ciara were very nice. WILL BE BACK!\nCurrey Holley", "pics": null, "resp": {"time": 1615395864453, "text": "Currey, we are so happy to hear about your quick turn around. The ladies at Madison Glass are really outstanding. We look forward to serving you again."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "106106009588249153542", "name": "Rebeccah Brownlee", "time": 1612643152374, "rating": 5.0, "text": "Wade and Kevin did a great job installing two new glass bathroom mirrors in our home. They were professional, timely, and did fantastic work. We will definitely reach out to Madison Glass for future needs.", "pics": null, "resp": {"time": 1613403799737, "text": "Great to hear !! W look forward to future business with you."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "111221363817758422052", "name": "Martin Choate", "time": 1611346821197, "rating": 5.0, "text": "I just got off the phone with Stephanie \" Peachy\" to get a quote on replacing my dining room table top - She was great!  Gave me a quote in a very efficient amount of time and she even explained to me about the thickness of the glass I was inquiring about.  Thank you!", "pics": null, "resp": {"time": 1611869358689, "text": "We really appreciate you taking the time to let us know how well our employees have treated you! We look forward to serving you again in the future."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "112887060463469808703", "name": "Caroline Hudson", "time": 1616425624950, "rating": 5.0, "text": "We had our shower door made and installed a few years ago. Due to a remodel we had Wade and Kevin come out to remove it then put it back up once we were finished. Each time they were professional, on time and got the job done in a timely manner. We Couldn’t recommend Madison glass company/north Alabama glass enough.", "pics": null, "resp": {"time": 1616695116587, "text": "Caroline, we truly appreciate you taking the time to share your experience. We are pleased that you chose us again. And we look forward to future projects with you."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "113301058451224533667", "name": "Brad Fulda", "time": 1613045847179, "rating": 5.0, "text": "Wade N. And Kevin G. Came by to do some work on our shower.  We needed to have the aluminum and sliding glass doors replaced.  They came on time and did excellent work.  When my wife called, Ciara, answered the phone and was very professional.  Wade and Kevin did excellent work and were also very professional.  I wouldn’t recommend anyone else to do the work you need concerning anything glass.  They also replaced a window pane for us the same day.  Excellent company and folks there at Madison Glass!", "pics": null, "resp": {"time": 1613406004167, "text": "Wow! Thank you so much for taking your time and sharing your kind words. We strive to exceed the normal expectations. Glad to hear we did that!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "102946093339511419150", "name": "Sally Bruer", "time": 1611953290116, "rating": 5.0, "text": "I found Madison Glass on Google and was so glad I did!  Stephanie and Ciara were absolutely the best and made sure that what I ordered was perfect!  This is the place to go for all your glass needs!  I will definitely be back!", "pics": null, "resp": {"time": 1612554992022, "text": "We are so glad you found us as well!! It was a pleasure serving you and will look forward to serving you again."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "110888265648075054632", "name": "Packmasters Moving and Storage", "time": 1614425978915, "rating": 5.0, "text": "Madison Glass is my go to place for glass replacement. Stephanie and Ciara always go above and beyond to meet my needs. They are knowledgeable, friendly and honestly. Great pricing and accurate cuts.", "pics": null, "resp": {"time": 1614889250491, "text": "FABULOUS!! We are very lucky to have Stephanie and Ciara on our team! We look forward to your continued patronage."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "113911091316273245242", "name": "Dai Tang", "time": 1610983717591, "rating": 5.0, "text": "The two technicians Wade and Kevin are quite responsible. They delivered the mirror on time and did a nice job installation them. The mirror is of good quality so I am pleased with the product and the service. Thanks.", "pics": null, "resp": {"time": 1611086090662, "text": "Always great to hear from satisfied customers!  It was a pleasure serving you!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "112645837887515480975", "name": "Susan Merschat", "time": 1622396147572, "rating": 5.0, "text": "Have used couple times good service", "pics": null, "resp": {"time": 1623938957052, "text": "Thank You!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "109007363666717331960", "name": "Judy Stokes", "time": 1605023116291, "rating": 5.0, "text": "A bird shattered my kitchen window, and I Madison Glass Company was recommended to me. They dispatched two technicians immediately who provided temporary and safe correction, while a new window was ordered. Today I had the pleasure of having the window replace by Matt Mayfield and Brett Miller....truly a team of knowledgeable, professional, courteous, careful and highly skilled technicians. What an asset they are to Madison Glass. I will recommend this company without hesitation.", "pics": null, "resp": {"time": 1606152689273, "text": "We appreciate all your kind words. It's great to hear that we were able to take care of you. We strive to exceed your expectations, and sounds like we did!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "105940279425435103278", "name": "Andy Schrimsher", "time": 1604014595955, "rating": 5.0, "text": "Another local company told me that my glass order would take a week, but Madison Glass got my order done in 1 hour! Great service! Thanks Stephanie for your help with getting my order in and thank you Robby for cutting the order so quickly! The glass for this job worked perfect and I would highly recommend them for any glass needs. Great Showroom!👍", "pics": null, "resp": {"time": 1604327794539, "text": "It was a pleasure meeting you Andy. I am so glad we were able to get you the glass you needed to complete your job. Thank you for the recommendation, and we look forward to serving you again!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "114565534141451570949", "name": "Brian Condon", "time": 1617718723015, "rating": 5.0, "text": "Technicians Keith and Devin came to take out a damaged window and replace it with a new one.  They were very professional and the process was quick and easy.", "pics": null, "resp": {"time": 1618865137406, "text": "Brian, we are glad to hear that our technicians were able to complete your repairs in a timely manner. Thank you for sharing! We look forward to working with you again!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "105523427918582111108", "name": "Harold Burkett", "time": 1609210797065, "rating": 5.0, "text": "Great company and great work. The staff is always incredibly helpful and friendly. Always able to get what I need easily.", "pics": null, "resp": {"time": 1609251678265, "text": "We truly appreciate your business!!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "113601383815497648603", "name": "Tamarii O Ra'i Madison Polynesian Dance Studio", "time": 1599238242217, "rating": 5.0, "text": "My studio mirrors were installed today...they're FANTASTIC! Chris and Kory met with me last week to take measurements, discussed options with me -- very friendly, courteous guys. They were here at the appointed time, ready to work and work they did. Everything was very carefully done, and the studio is complete!\n\nI also have to mention Stephanie, who was the first person I spoke with, and William, who did the scheduling of both the measuring and installation. All the folks at Madison Glass Company are very kind and so friendly. This experience was TRULY a pleasure.\n\nChris and Kory, ohmahgawd, you guys, like seriously! :) You're both awesome! Thank you so much!", "pics": null, "resp": {"time": 1599581277400, "text": "We appreciate you taking a moment to brag on our employees. We are so glad that we were able to provide you with pleasurable service. We understand that getting a new business ready to open its doors can be a daunting experience."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "114545739822124092370", "name": "Colby Malone", "time": 1615488835131, "rating": 5.0, "text": "Stephanie Grayson and Ciara did a great job helping me get some tempered glass I needed for a job quickly!", "pics": null, "resp": {"time": 1615997163173, "text": "Thank You Colby!! As always, it's a pleasure serving you!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "113442890220402836877", "name": "Emily Scruggs", "time": 1598287291814, "rating": 5.0, "text": "Madison Glass Company installed a glass barrier in Forest Hills Elementary School's front office. It was done in a timely manner. Chris Grim and Cory Stewart were very friendly and professional. We have had many compliments on how good the glass looks! I would highly recommend using this company.", "pics": null, "resp": {"time": 1598380497105, "text": "We really appreciate you letting us know about your experience with our technicians and how much everyone likes the new glass. We were grateful for the opportunity and would be happy to help again!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "112712704355409760716", "name": "Huey Hudson", "time": 1601066929998, "rating": 5.0, "text": "Madison Glass installed new shower wall glass for me. They were very professional, knowledgeable, affordable, and friendly. I actually used them to perform 2 jobs for me in the past 3 months and we are very pleased with both jobs. Highly recommend them for glass work and/or shower wall installation.", "pics": null, "resp": {"time": 1601322455608, "text": "Mr. Hudson, We really do appreciate you taking the time out of your day to share your kind words. We appreciate your business and we look forward to working with you again."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "111378281746266177347", "name": "Angel Little", "time": 1614038486160, "rating": 5.0, "text": "I'm a furniture refinisher and had a beautiful antique vanity with a broken center mirror.  The 2 ladies up front, Stephanie and Ciara (hope I spelled that correctly) walked me through everything, advised me on the best thickness and the differences. Very professional, very fast and I know have a complete vanity to paint! All my glass/mirror needs will be done there.", "pics": null, "resp": {"time": 1614089606401, "text": "Thank You Angel! It's great to know that our team could offer you guidance on your project! I'm sure they will be there for you during your next project as well!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "104842271562199237164", "name": "Guy Piskulic", "time": 1618931429556, "rating": 5.0, "text": "Ciara and Stephanie were very helpful and turned a major problem into a simple repair through the extensive knowledge they posses.  Thank You Guy", "pics": null, "resp": {"time": 1620057313158, "text": "You are very welcome Guy. It was definitely our pleasure to serve you!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "106281161883511609660", "name": "Casey G", "time": 1604676352808, "rating": 5.0, "text": "We had a great experience with Madison Glass Company.\n\nWe recently replaced the builder grade shower in our master bathroom with a new tile shower. After the tiling was complete, I reached out to five different companies in the area to come give me quotes on a glass shower door and surround as well as an interior window pane for an insulated double pane window that one of kids had managed to crack.\n\nOut of all five companies that came out, I felt like Wade and Kevin from Madison glass were the only ones that tried to assess the job and recommend the best solution for us. They were the only one of the five companies that realized there was not a stud behind the tile where the door was to be installed and actually recommended a solution that ended up saving us money (though they also made sure I knew they were capable of going with the more expensive solution if we decided to go that route).\n\nUsing the information that they provided, I was able to go back and get a slightly cheaper quote from one of the other companies. Despite that, I went with Madison Glass because I felt I could trust Wade and Kevin to do the job right. I'm glad I did.\n\nWe had a small hiccup with the manufacturer on the first replacement window and shower door that came in, but Wade and Kevin set us up for the mean time and made sure to prioritize getting back out as soon as the replacement glass came in.\n\nThe shower looks great, the service was excellent, they let us know what to expect and then kept us informed throughout the process, and we ended up spending less than what we expected. I have already recommended them to a friend and will certainly use them in the future.", "pics": null, "resp": {"time": 1606757555087, "text": "We understand that it is difficult to find honest, dependable help. As a company, we want integrity to be the norm, not the exception. With custom installations, there are bound to be a few bumps in the road, but it's the way people handle those bumps that truly matter. I'm glad we were able to come through for you!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "101146674384713940022", "name": "Nicola Duncombe", "time": 1598377457614, "rating": 5.0, "text": "My shower door had broken after 14 years. I checked around for prices and Madison Glass had the best price. I ended up going with them to have my shower door replaced last week.  I found them to be very friendly, responsive, and professional!  Wade and Kevin were skilled and courteous. They did an awesome job, and loved how they explained things to me that I wasn't aware of! I highly recommend Madison Glass, and will use them in the future.", "pics": null, "resp": {"time": 1598387489824, "text": "We are so glad to have been able to help you Nicola. Thank you for letting us know about your overall experience. Your feedback is greatly appreciated. We would be happy to help you again in the future!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "112728691397888337844", "name": "Sheryl Payne", "time": 1599236147187, "rating": 5.0, "text": "I called to request a quote and I spoke with GRAYSON. She was kind and offered informative details to help me make my decision.  Although I ultimately used a different vendor for service, it's worth noting the interaction I had.  She spoke to me in a way that I appreciate  - she did not sound 'overly scripted', but like someone who cares for people with questions.", "pics": null, "resp": {"time": 1599580614386, "text": "Sheryl,\nThank you for taking your time to let us know about your experience. It is always great to hear that our employees have taken the time to provide our customers with a memorable experience. We pride ourselves in helping our customers even if we need to refer them to a different vendor."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "111086430602365637755", "name": "Max Tall", "time": 1610661384543, "rating": 5.0, "text": "Thanks window looks great now, I should have fixed it a few years ago:)  The installers that came to my house were very friendly and honest.", "pics": null, "resp": {"time": 1610742048897, "text": "We were glad to help!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "102220726468979504818", "name": "Susan Ondrusek", "time": 1605820346703, "rating": 5.0, "text": "I needed to replace glass in two windows to sell our home. From the phone call to set up an appointment, to the gentleman who came out to do the measurements, and finally to Keith and Devin that installed the glass, everyone was extremely friendly and professional. I was also quite happy that the turnaround time was less than 2 weeks.", "pics": null, "resp": {"time": 1606755852937, "text": "It is always wonderful to hear when our customers have a great experience. Each job takes multiple people and that can leave room for error. We work hard to eliminate that possibility. Thank you for letting us know we are exceeding expectations!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "108572478143628326081", "name": "Bessie Tackett", "time": 1598899853387, "rating": 5.0, "text": "Stephanie, the new employee, was amazing! She went over and above to accommodate my special order. She prescreened all material when it arrived, called me promptly.  Will definitely use again.", "pics": null, "resp": {"time": 1598907346468, "text": "Bessie, we are so glad to hear that our staff took great care of you. Thank you for letting us know about your experience. Your feedback is greatly appreciated. We would be happy to help you again in the future!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "102730729319247519790", "name": "elise williams", "time": 1597428751279, "rating": 5.0, "text": "We just built a huge custom shower and chose Madison Glass Company to do our shower glass door.  Their prices were comparable to other quotes we received, however Wade was very thorough and took the time to explain everything.  For this reason, we decided to go with them.  It looks beautiful and is very well done!  We are very happy with it!\n\nOn another note, we used them to replace the glass in foggy windows of an old house (we sold last year).  For that job, they were the cheapest option and also did a great job!", "pics": null, "resp": {"time": 1597676245181, "text": "Elise, we are so glad to hear that you like your new glass shower door and that Wade took great care of you. Thank you for letting us know about your experience last year with our window glass replacement team as well. Your feedback is greatly appreciated and we would be happy to help you again in the future!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "106989413441949372972", "name": "Aaron Thomas", "time": 1602770152676, "rating": 5.0, "text": "This business has amazing customer service! I needed an order of plexiglass done as quickly as possible. It was done sooner, and cost less than I anticipated. They definitely earn a repeat customer. Thanks Stephanie!", "pics": null, "resp": {"time": 1602860853586, "text": "Aaron, it was a pleasure serving you. We don't mind going the extra step for our customers and we appreciate you going the extra step for your employees. We look forward to future opportunities."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "115635466644180839567", "name": "John Keeling", "time": 1593712467272, "rating": 5.0, "text": "Matt and Nick replaced the transom window in our bathroom and it looks absolutely fantastic! They were prompt, worked efficiently, restored the window to better-than-new condition, and cleaned. I was going to do this project myself, but after seeing all the work that was required, I'm glad I called for help. Highly recommended,", "pics": null, "resp": {"time": 1594068770607, "text": "We are so glad you chose us to help you John and are glad to hear our technicians took great care of you and your home. Thank you for sharing your experience. We really appreciate your feedback. We would be happy to help again in the future!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "109470979456619841642", "name": "Susan Svendsen", "time": 1593723614538, "rating": 5.0, "text": "The guys who came to repair my window were very polite and personable. The work they did was excellent! Within a matter of 15 minutes they had taken the broken window out, replaced the glass, ands reinstalled my window!!! I would definitely recommend Madison Glass to everyone I know and I will use them again if I need any glass repairs. Love the work and the employees!!", "pics": null, "resp": {"time": 1594068973954, "text": "We have a great team of professionals Susan. We are so glad to have been able to help you and would be happy to help again in the future. Thank you for sharing your experience!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "102446750234736826950", "name": "Rita Miserendino", "time": 1600365698830, "rating": 5.0, "text": "I found my storm door glass broken and in a panic I picked Madison Glass randomly from Google. A kind voice answered the phone only 7 minutes before they closed, and spoke with me well past their closing time. She walked me through the process and assured me it wasn’t as bad as I thought. Then I met three more efficient kind people as they came to measure and give me an estimate, and when they came to install it. As a homeowner, you can not ask for better treatment than I received from them.\nThank you to all ! Will recommend you to everyone.", "pics": null, "resp": {"time": 1600370668074, "text": "It is always an alarming feeling to discover broken glass, and very understandable that you may panic. We  take pride in meeting customer's expectations, and we never tire of hearing when we have exceeded them."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "106333790186824834221", "name": "Neal Cole", "time": 1621954436373, "rating": 5.0, "text": "They are very knowledgeable and helpful!", "pics": null, "resp": {"time": 1623939006688, "text": "Thank you!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "107402139982241742600", "name": "Mike L", "time": 1606499878526, "rating": 5.0, "text": "Called to get a quote and Ciara took care of me. Very professional, received and email with my breakdown of my repair and time frame of completion. Technicians came out quickly and assessed damage.", "pics": null, "resp": {"time": 1606757728208, "text": "Thank you for the 5 Stars! Ciara is the newest member of our team, and we are glad to have her!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "117400841892955971388", "name": "rosalyn Blackwell", "time": 1605808113830, "rating": 5.0, "text": "Wade and Kevin  did a great job of installing my shower door. They were very professional.", "pics": null, "resp": {"time": 1606511564413, "text": "Thank You!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "109265030755820109714", "name": "Mariana", "time": 1599336613562, "rating": 5.0, "text": "They were very professional and had Covid safety measures in place like self distancing, required masks, and wore masks properly. Received a quote while I was there and my glass is on special order to arrive in about 2 weeks. Will update once installed.", "pics": null, "resp": {"time": 1599581727095, "text": "It has always been our goal to provide  a safe friendly environment for our customers. We are pleased to know that we were able to provide that for you. Thank you for reassuring us!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "108660288082006713140", "name": "Liz Moulder", "time": 1588718050657, "rating": 5.0, "text": "We had our shower doors replaced this week by Madison Glass.  We found them to be very responsive and professional, and the job was completed much faster than we ever expected!  Wade and Kevin were skilled and courteous.  We highly recommend Madison Glass, and will use them in the future.", "pics": null, "resp": {"time": 1589809482672, "text": "Liz, we are so glad to hear our technicians took great care of you and really appreciate you taking the time to share your experience. We look forward to assisting you in the future!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "113169320170924832515", "name": "Stan Souvenir", "time": 1597168198059, "rating": 5.0, "text": "Replaced shower glass with semi frameless shower glass.  Looks great and installers were most professional.  Highly recommend Madison Glass and especially Kevin and Wade who did the work.  Thanks", "pics": null, "resp": {"time": 1597241817568, "text": "We are so glad to hear you like your new glass shower enclosure Stan. Thank you for letting us know about your experience and our technicians work. If you have any future glass needs we would be happy to help!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "117463624305316604608", "name": "Ben Stanley", "time": 1589473046785, "rating": 5.0, "text": "EXCELLENT work. Matt M. and Nick M. were nothing short of the friendliest and most professional installation crew I have ever had the pleasure of working with. I was promised a time that installation would begin, and they were 5 minutes early.  Installation went smooth with zero problems and that was that! Job well done.  I have nothing but positive things to say about my experience with this crew.", "pics": null, "resp": {"time": 1589809782887, "text": "Thank you for sharing your experience Ben. We are always glad to hear that our technicians are doing a great job. We really appreciate your feedback and would be happy to help you again in the future!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "100992669199587510979", "name": "Carrie Wilson", "time": 1583860685127, "rating": 5.0, "text": "Highly recommend this company.  Wade & Kevin did a great job and got it done fast.  They know what they are doing.  They were nice polite gentleman and explained everything for our new shower door.  Even when they came out to measure the door they explained everything well.  Reasonably priced too, don't feel like I'm getting ripped off life many places around here seem to do.  Will do business with this company again.", "pics": null, "resp": {"time": 1583866494151, "text": "Carrie, we are so glad to hear our technicians took great care of you and really appreciate you taking the time to share your experience. We would be happy to help with any of your glass needs!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "104080395840035314285", "name": "Kelly Cook", "time": 1604692850361, "rating": 5.0, "text": "Wade and Kevin installed my new shower walls & door and It looks great!!!!!  Highly recommend Madison Glass!", "pics": null, "resp": {"time": 1606152514556, "text": "We're glad to hear it !!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "107871995438824395388", "name": "David Compton", "time": 1601658162552, "rating": 5.0, "text": "Keith Lyell and Devin Dutton did excellent work very professional and prompt. I HIGHLY recommend these technicians.", "pics": null, "resp": {"time": 1601913169780, "text": "David, Thank you for your kind words and your recommendation!!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "108880946343129328686", "name": "Brenna Bonner", "time": 1587674465804, "rating": 5.0, "text": "Briana, Matt and Nick gave us excellent customer service. They were quick to come out and measure the window, and quick to return with the window and replace it. They made it so easy! And it looks great.", "pics": null, "resp": {"time": 1589809292114, "text": "Brenna, we really appreciate you taking the time to let us know about your experience. We are glad to have been able to help you and would be happy to help you again in the future!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "108219742365814426507", "name": "Jennifer Ceci", "time": 1598879125818, "rating": 5.0, "text": "Wade N. was very thorough and we were very pleased with everything. Thanks so much!", "pics": null, "resp": {"time": 1598883085224, "text": "Thank you for letting us know about your experience Jennifer. We really appreciate your feedback and would be happy to help you again in the future!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "101817037301610266521", "name": "Stewart Robison", "time": 1581365101283, "rating": 5.0, "text": "First class operation.  Stephanie was very professional with my estimate, and Wade and Kevin were nothing short of the best.   Courteous, knowledgeable, and efficient.   Highly recommend these folks for any glass or mirror work.", "pics": null, "resp": {"time": 1581370870073, "text": "Thank you Stewart for sharing your experience. We really appreciate you letting us know that our staff and technicians took great care of you. We are happy to help and look forward to assisting you with your future glass or mirror needs!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "109838137517901969142", "name": "Jeffrey Lake", "time": 1593723079856, "rating": 5.0, "text": "We needed cracked window glass in our sunroom replaced.  Madison Glass Company was quick to respond to my internet query after business hours.  They came to measure the glass the very next day.  Nick and Matt just finished installing the replacement glass.  They were very professional, courteous, and efficient. I would highly recommend.", "pics": null, "resp": {"time": 1594068920012, "text": "Jeffrey, we are so glad to have been able to help you so quickly. Thank you for letting us know about your overall experience. If you have any future glass needs we would be happy to help!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "106467668851917319825", "name": "K Peters", "time": 1581642192742, "rating": 5.0, "text": "Excellent experience working with Madison Glass on our shower enclosure.  Stephanie was very helpful explaining different options and preparing detailed proposals.  The high standard she set was met by the installers Wade and Kevin, on-time, friendly and competent.  Will definitely contact Madison Glass again for similar jobs.", "pics": null, "resp": {"time": 1581688586712, "text": "We are so glad to hear you had a great overall experience. We pride ourselves in providing great service. Thank you for letting us know that our staff and technicians took great care of you. We would be happy to help you again in the future!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "114406574991907593836", "name": "Leslie McNutt", "time": 1592243575090, "rating": 5.0, "text": "I have never seen glass fit more snugly. Wade & Kevin did a wonderful job. I would definitely use them again.", "pics": null, "resp": {"time": 1592578499425, "text": "Leslie, we are so glad to hear you are happy with your new glass shower enclosure installation and our technicians work. We would be happy to help you again in the future!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "104960893806740341769", "name": "Michael Weimer", "time": 1588001762411, "rating": 5.0, "text": "Our sunroom had 3 large windows that we starting to fog up.  Call Madison Glass; the same day a two technicians came out to measure and get info for a quote.  They called with a quote the next  day & the glass was ordered.  The glass was installed within a week and a half.  Their workers were prompt, efficient, and pleasant.  In and out within an hour and a half.  Recommend highly.", "pics": null, "resp": {"time": 1589809365689, "text": "Michael, we are glad to hear you had a great overall experience and we really appreciate you sharing! If you have any future glass needs we will be happy to help!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "103579837689022438256", "name": "Christopher Barksdale", "time": 1570470613424, "rating": 5.0, "text": "Outstanding customer service! From Inquiry, measuring, and installation, Madison Glass Co. could not have been more helpful. Extremely satisfied with my purchase of glass for my large farmhouse table. Quick turn around too!", "pics": null, "resp": {"time": 1570560633639, "text": "Thank you for the great review Christopher. We are so happy to hear you like how your custom table top turned out. Your feedback is greatly appreciated and if you have a need for glass in the future we would be glad to help!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "104094719807206462485", "name": "Dale Albright", "time": 1582854862009, "rating": 5.0, "text": "These guys (Wade and Kevin) were great!  Easy to work with and always on schedule.  Very happy with the quality of work they did.  Highly recommend Madison Glass.", "pics": null, "resp": {"time": 1582896347067, "text": "Thank you for letting us know of technicians took great care of you Dale. We really appreciate the feedback. If you have any future glass needs we will be happy to help!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "111376657967782762509", "name": "Richard Jung", "time": 1571277295579, "rating": 5.0, "text": "Great experience with Madison glass. Wade and Kevin came to our house on a day's notice to replace a large sheet of glass before I went into the hospital for surgery. They're very polite, professional, and efficient. Madison glass's price also be the competition. Highly recommend Madison glass.", "pics": null, "resp": {"time": 1571340652973, "text": "We really appreciate you sharing your experience Richard. We are glad to have been able to help you. Thank you for letting us know our technicians took good care of you. If you have any future glass needs we would be happy to help!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "103079557221293786533", "name": "Patti Pinkerton", "time": 1574373729930, "rating": 5.0, "text": "Wade and Kevin were absolutely great! Wonderful experience, they knew I needed to get the new door in quickly due to my handicapped husband and they made it happen. Despite supplier problems and other obstacles they got it done quickly and professionally. I highly recommend Madison Glass for a great customer experience.", "pics": null, "resp": {"time": 1574428066917, "text": "Patti, we appreciate your feedback and are glad to hear our technicians took great care of you. If you have any other glass needs we will be happy to help!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "110547063211498330444", "name": "Greg1971 s", "time": 1594206575327, "rating": 5.0, "text": "Very Professional and knowledgeable staff,  knew exactly what I needed for a replacement Pella sliding door glass that was busted out , less than a week turn around time on building the tempered DBL pane glass. Very pleased with Madison Glass Company, highly recommend .", "pics": null, "resp": {"time": 1594651959300, "text": "Thank you for letting us know about your experience Greg. We are so glad to have been able to help you with your door glass and would be happy to assist you again in the future!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "103728558930521475081", "name": "MK W", "time": 1575998610322, "rating": 5.0, "text": "It was easy to work with the installers and the office in selecting fixtures and scheduling.  The shower door and glass half wall look great, and this was a very professional installation by Wade N. and Kevin G.  Would  not hesitate to recommend Madison Glass to anyone.", "pics": null, "resp": {"time": 1576004019706, "text": "We really appreciate you taking the time to share your experience and are glad to hear you are happy with the new glass shower enclosure. If you have any other glass needs we will be happy to help!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "111583588648092561253", "name": "Armand Capanna", "time": 1581002556630, "rating": 5.0, "text": "Wade was very helpful in assisting us in deciding the size of our bathroom mirrors when he came to our home to measure. The mirrors were installed in a matter of days after they were ordered. We could not be more pleased.", "pics": null, "resp": {"time": 1581003861666, "text": "We are so glad to hear our technician took great care of you. Thank you for sharing your experience. We would be happy to help again with any of your future mirror or glass needs!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "114024576163316842202", "name": "Susan Conner", "time": 1593262691440, "rating": 5.0, "text": "I was very happy with the job Wade and Kevin did installing glass shower doors and vanity mirrors. They were very professional, courteous, helpful and the outcome is beautiful.", "pics": null, "resp": {"time": 1593434816478, "text": "Thank you for sharing your experience Susan. We love to hear our customers are happy and our technicians did a great job. If you have any future glass needs we would be happy to help!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "102174165911867280556", "name": "James Rochester", "time": 1579303605886, "rating": 5.0, "text": "From the time that I stepped into their showroom to select the type of shower door that I wanted, to saying goodbye to Wade and Kevin, after they completed the install...my experience was positive.  I highly recommend Madison Glass for all of your glass needs.", "pics": null, "resp": {"time": 1579536543158, "text": "James, we are glad to hear you had a great overall experience and we really appreciate you sharing! If you have any future glass needs we will be happy to help!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "110777713451420213892", "name": "Brandon Pittman", "time": 1582757527964, "rating": 5.0, "text": "Dropped into MADISON Glass after breaking a shelf for some antique furniture.  Staff is very friendly and promptly gave me an estimate and made the piece I needed in less than an hour.  Don’t get service this good many places.  Will definitely use them for any future glass needs.", "pics": null, "resp": {"time": 1582811942850, "text": "Brandon, we really appreciate you taking the time to let us know about your experience. We are glad to have been able to help you and would be happy to help you again in the future!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "114763747382514494104", "name": "Chase Renegar", "time": 1565632454425, "rating": 5.0, "text": "Very pleased with the communication, help, service and quality of Madison Glass. We had a hard time matching our shower head, etc with the hardware they offered, and they went above and beyond to help us find the right fit for our needs. Glass on our shower doors looked great! Wade did an excellent job at communicating things with us. Very happy!", "pics": null, "resp": {"time": 1565638611834, "text": "We are so glad to hear everyone took great care of you. Thank you for taking the time to share your experience. We really appreciate the feedback. If you have any other glass needs we are happy to help."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "111536911899165733602", "name": "PJ Giles", "time": 1570799478478, "rating": 5.0, "text": "Madison Glass did excellent work for the replacement of commerical glass double doors. From setting up the appointment and paperwork with Stephanie- to Sully and Clay’s installing the doors and cleaning up the area- I could not be more satisfied with the work they completed for me.", "pics": null, "resp": {"time": 1570824123092, "text": "We really appreciate you taking the time to share your experience. We were happy to help and look forward to working together again next year!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "102598143852505280103", "name": "Jenny Johnson", "time": 1568656129894, "rating": 5.0, "text": "Super Customer Service!  I only needed one small piece of glass cut for a tray I was making and Stephanie was great to work with.  Even though my order was very small, I still felt valued and appreciated as a customer.  Would definitely go back and have already recommended them.", "pics": null, "resp": {"time": 1568656822346, "text": "Jenny, we are so glad to hear you had a great experience and appreciate you spreading the word about Madison Glass. We are happy to help you with any of your future glass needs!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "111050941480713527735", "name": "Ashley Pritchard", "time": 1575326422228, "rating": 5.0, "text": "Awesome experience.  Stephanie was great at helping me with my order. Highly recommend!", "pics": null, "resp": {"time": 1575381957587, "text": "Ashley, we are so glad to hear you are happy with your glass order and service. Thank you for taking the time to share your experience. We would be happy to help you with any of your future glass needs!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "108759026398111044170", "name": "Michael Guillebeau", "time": 1589293452617, "rating": 5.0, "text": "Matt and Nick were punctual, fast and professional, wore masks the whole time. Thanks.", "pics": null, "resp": {"time": 1589809661705, "text": "Michael, we will always gladly take the precautions to make our customers feel comfortable during this uncertain time. I'm glad our technicians took great care of you and appreciate you letting us know. We would be happy to help with any of your future glass needs!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "114396122343992553331", "name": "Kim Tate", "time": 1587662954642, "rating": 5.0, "text": "Could not be happier with the work that Matt and Nick did,These two were very professional and made sure to clean up everything before they left. Would definitely recommend", "pics": null, "resp": {"time": 1589809227866, "text": "Thank you for letting us know of technicians took great care of you Kim. We really appreciate the feedback. If you have any future glass needs we will be happy to help!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "108994481308184525121", "name": "B G", "time": 1587405544509, "rating": 5.0, "text": "I have purchased a few mirrors for custom projects from them and both times they were quick, polite, and the price was great!", "pics": null, "resp": {"time": 1589808327920, "text": "We are so glad to hear you were happy with your experience. Thank you for sharing. We would be happy to help you again in the future!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "106891002040112600808", "name": "Carnivorous Meat", "time": 1578068702915, "rating": 5.0, "text": "Had me in and out while I waited for a standard piece of glass to be cut and fitted and gave me more options for an upgrade project. Stated they had another location with even more available options as the Madison location is fairly new.", "pics": null, "resp": {"time": 1578404193889, "text": "Thank you for taking the time to share your experience. We are happy to help and look forward to assisting you with your future projects!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "109523662809571036663", "name": "Kurtis Clark", "time": 1560209875437, "rating": 5.0, "text": "I needed glass cut for a project I’m working on and they were so friendly and it was ready that day. Thank you guys. I couldn’t be happier!", "pics": null, "resp": {"time": 1560350394543, "text": "Thank you for sharing your experience Kurtis. We are happy to help with all your glass needs!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "100146705075110714518", "name": "Alvin Decay", "time": 1573514837758, "rating": 5.0, "text": "I love this spot in view of their awesome client care and particularly Stephanie who help me the most.", "pics": null, "resp": {"time": 1573565792913, "text": "Thank you for sharing your experience Alvin! We greatly appreciate your feedback and are happy to help with any of your future needs!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "116307095624068046667", "name": "Susan Isbell", "time": 1569615570103, "rating": 5.0, "text": "They cut a piece of glass for me and did a great job! So nice and helpful!!", "pics": null, "resp": {"time": 1569847132635, "text": "Thank you for sharing your experience Susan. We really appreciate the feedback. If you need anything else we will be happy to help!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "106548156703481251788", "name": "Shirley Vargas", "time": 1605290242280, "rating": 2.0, "text": "Bad window repair - loose in the sash, and they have bad customer service - woman unnecessarily became rude, maybe she was having a bad day before I called.", "pics": null, "resp": {"time": 1606152312398, "text": "Ms. Vargas, We are disappointed that your experience was less than satisfactory. It appears that the window repair was done in our shop. As I looked into the circumstances of your review, I was told that our customer service representative contacted you shortly after your initial contact to schedule sending an installer out to your home instead of having you bring your window back into the shop. We want to make sure that you understand you are important to us. I have just been informed that our guys completed this repair Friday. I hope we were able to rectify the issues with your initial window installation. We do hope you contact us if you have any future glass needs."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "106234031348283274351", "name": "Rebecca Hobbs", "time": 1570033584619, "rating": 5.0, "text": "I had a broken pane in a window in my home and had been trying to get it fixed for months.  I called Madison Glass (I wish I had called them first!) and within 2 weeks they had measured the window, ordered the pane and replaced it perfectly!  Everyone I dealt with (Beth Wilbanks, William Wilbanks, Matt Mayfield and Matt Jones) were pleasant, prompt and extremely professional.   I highly recommend them!", "pics": null, "resp": {"time": 1570044562936, "text": "Rebecca, thank you for taking the time to share your experience. We are so glad to have been able to help you and we really appreciate you letting us know how everyone took care of you. If you have any other glass needs we are happy to help!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "100086868838925345744", "name": "esther sartor", "time": 1570226292919, "rating": 5.0, "text": "The technicians were courteous, efficient and did a great job.", "pics": null, "resp": {"time": 1570453153868, "text": "We are so glad to hear everyone took great care of you Esther. We really appreciate you taking the time to share your experience. We would be happy to help with any of your future glass needs!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "117623325318041365381", "name": "Jeffrey Strock", "time": 1568410207172, "rating": 5.0, "text": "Went to pick up a piece of glass they cut for a friend nice work reasonable price friendly staff", "pics": null, "resp": {"time": 1568656527147, "text": "Thank you for giving us a great review Jeffrey. We really appreciate you letting us know how your experience was. If you have any glass needs we would be happy to help you as well!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "115814246791031114604", "name": "Steven Watson", "time": 1601354252388, "rating": 5.0, "text": "Good job", "pics": null, "resp": {"time": 1601484948477, "text": "Thank you!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "111692902103524868010", "name": "Michael Bankester", "time": 1565185346821, "rating": 5.0, "text": "Quick, on time and very efficient.", "pics": null, "resp": {"time": 1565188233435, "text": "Thank you for sharing your experience Michael. We really appreciate the feedback. If you have any other glass needs we are happy to help!"}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "107373616914335557241", "name": "Lee Harris", "time": 1567515297393, "rating": 4.0, "text": "Good guys", "pics": null, "resp": {"time": 1567600510958, "text": "Thank you for sharing your experience Lee. If there is anything we can do to give you a five star experience please let us know."}, "gmap_id": "0x886265fd2db01163:0x2321ed9100b39f74"}
{"user_id": "110850349481105175451", "name": "Lori Ozley", "time": 1611595026384, "rating": 5.0, "text": "I have worked with GBM several times for windshield repair/replacements.  They go above and beyond to help their customers.  Highly recommend!!!!", "pics": null, "resp": {"time": 1611604151999, "text": "\"Our service is what we sell\"\nThank you for seeing our commitment to serving our customers from day one and for further days ahead"}, "gmap_id": "0x88890530ff55aacb:0x471b131350554450"}
{"user_id": "104085437175862402530", "name": "valarie mcclellan", "time": 1604160564983, "rating": 5.0, "text": "David & Danny were so nice. Very knowledgeable, courteous, & professional. Diagnosed & repaired my issue in a timely manner while I waited in the shop.  Thx GBM..", "pics": null, "resp": null, "gmap_id": "0x88890530ff55aacb:0x471b131350554450"}
{"user_id": "115980252999132553480", "name": "Thomas Russell", "time": 1593741770228, "rating": 5.0, "text": "Good friends and family and people who want to help you", "pics": null, "resp": null, "gmap_id": "0x88890530ff55aacb:0x471b131350554450"}
{"user_id": "108902578610871848112", "name": "Hannah Mickwee", "time": 1570124905313, "rating": 5.0, "text": "GBM provides the quickest and most reliable service in the area !!! Thanks again Shane for saving the day !!", "pics": null, "resp": {"time": 1570126837860, "text": "Thank u for the review and we try to provide excellent service to our customers as far as saving the day anytime I can help u just let it be known and consider it done"}, "gmap_id": "0x88890530ff55aacb:0x471b131350554450"}
{"user_id": "113608739978863599395", "name": "Mike Rader", "time": 1553904966056, "rating": 5.0, "text": "GBM replaces windshield for Hornady every week great service and reliable and fast service so our trucks can stay on the road making money. Thanks GBM", "pics": null, "resp": {"time": 1553906510651, "text": "Thank you  our service is what we sell we pride ourselves with reliable prompt service"}, "gmap_id": "0x88890530ff55aacb:0x471b131350554450"}
{"user_id": "106387239818783358078", "name": "George Montgomety", "time": 1553296223821, "rating": 5.0, "text": "Service is great, prices are fair.", "pics": null, "resp": null, "gmap_id": "0x88890530ff55aacb:0x471b131350554450"}
{"user_id": "100300997362288446120", "name": "David Lee Broadhead", "time": 1519060898358, "rating": 5.0, "text": "GBM replaced my special order windshield for nearly half the price of others, and got the job done in about 30 minutes while I was at work! Awesome work guys.", "pics": null, "resp": null, "gmap_id": "0x88890530ff55aacb:0x471b131350554450"}
{"user_id": "100999915707844294764", "name": "Rachel lightning Pannell", "time": 1506815577439, "rating": 5.0, "text": "I work there and I love it", "pics": null, "resp": null, "gmap_id": "0x88890530ff55aacb:0x471b131350554450"}
{"user_id": "115797661052777597961", "name": "Christopher Harman", "time": 1611656820357, "rating": 5.0, "text": "I couldn’t be more impressed! They installed multiple glass shower doors throughout our house. Excellent quality every time! Staff is excellent to work with! They also beat the prices of various companies in Huntsville.", "pics": null, "resp": {"time": 1614019001143, "text": "Thank you for trusting on Guntersville Glass and team"}, "gmap_id": "0x8889f90be008a4c7:0x6af3df75b6237eec"}
{"user_id": "103975656850969328077", "name": "Robb Young", "time": 1582303456612, "rating": 5.0, "text": "Showed up late yesterday afternoon needing sliding window replaced in the work boat, they had it done first thing this morning! Very kind staff, and Wonderful customer service!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMrYAtxCcavzzojLMb2NRCijVGiezY82XRgroYG=w150-h150-k-no-p"]}], "resp": {"time": 1582326192614, "text": "Thank Mr Robb for trust on Guntersville Glass"}, "gmap_id": "0x8889f90be008a4c7:0x6af3df75b6237eec"}
{"user_id": "104902187337865184355", "name": "Jason Williamson", "time": 1604503966676, "rating": 5.0, "text": "I've had several pieces of glass cut by them. Always fits great and fair priced. Staff is very easy to deal with.", "pics": null, "resp": {"time": 1614019121473, "text": "Thank you for trusting on Guntersville Glass"}, "gmap_id": "0x8889f90be008a4c7:0x6af3df75b6237eec"}
{"user_id": "104314414970853514167", "name": "Ricky Phillips", "time": 1563544807146, "rating": 5.0, "text": "Amazing Work on the door at Libby Mays State Farm! They came out the day they said they would! We were super pleased with the work they did! Ron and Ivan were super friendly. Very impressed with how quick, affordable and professional they were. Thanks!! - Rick", "pics": null, "resp": {"time": 1563552269322, "text": "Thank you Ricky Phillips for trust on Guntersville our clients make Guntersville great"}, "gmap_id": "0x8889f90be008a4c7:0x6af3df75b6237eec"}
{"user_id": "105114520162301349875", "name": "shannon moody", "time": 1549400154964, "rating": 5.0, "text": "Guntersville Glass listened as I explained our creative idea of adding custom framed mirrors to our bathroom remodel. They made our idea come to life quickly with professional installation. We are so pleased and look forward to working with them again. Thank you Ivan!\nShannon M. Cornelius", "pics": null, "resp": {"time": 1549412611008, "text": "Thank you Shannon M. Cornelius\nFor trusting Guntersville Glass"}, "gmap_id": "0x8889f90be008a4c7:0x6af3df75b6237eec"}
{"user_id": "100583006442203961242", "name": "stan livingston", "time": 1553880166324, "rating": 5.0, "text": "They did a great job! showed up on time for the estimate and on time for the job. Quality work at a great price. Very professional service.", "pics": null, "resp": {"time": 1553885904286, "text": "Thank you Mr Stan for trust on Guntersville Glass"}, "gmap_id": "0x8889f90be008a4c7:0x6af3df75b6237eec"}
{"user_id": "115102988323731508208", "name": "Stephen White", "time": 1572463062985, "rating": 5.0, "text": "The guys at Guntersville Glass did an awesome job with our shower doors. Would definitely use them again.", "pics": null, "resp": {"time": 1582326312846, "text": "Thank you for trust on Guntersville Glass"}, "gmap_id": "0x8889f90be008a4c7:0x6af3df75b6237eec"}
{"user_id": "102986070607176550943", "name": "Cameron Troilo", "time": 1564687613014, "rating": 5.0, "text": "Great guys, did a great job on my shower doors. Very responsive and timely", "pics": null, "resp": {"time": 1564748940298, "text": "Thank you for the opportunity to work for you project"}, "gmap_id": "0x8889f90be008a4c7:0x6af3df75b6237eec"}
{"user_id": "103924359274132856099", "name": "C K", "time": 1555028049135, "rating": 5.0, "text": "Great service! Had a window in our house accidentally broken and Westside did an outstanding job replacing it.  Looks better than new!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPaCrBSOLt8uf3ZendfOoW8H07228OvuxfNyfzO=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb1b7b0b60915:0xe2a7e79093ffcab8"}
{"user_id": "109309476957997395941", "name": "Debbie Daniel", "time": 1623782873202, "rating": 5.0, "text": "I have tried for two years to have a glass company come and look at a custom made double paned window that needed the inside glass replaced.  No luck.  Then I thought I will try one more time.  I call Huntsville Glass, Mr. James Davis came out and looked at the window, they called and gave me the estimate, and once the glass was in Mr. Davis came back and installed the glass.  He was exceptionally professional, let me know when he would be out and in no time it was done.  I really appreciate the service.  The window looks great.  I will do business only with Huntsville Glass.  I highly recommend them.", "pics": null, "resp": {"time": 1623938002683, "text": "Wow Debbie! We hate to hear that you ran into so much trouble before you found us. James is definitely an asset to our company as well as to our customers. Thank you!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "105644864830892919820", "name": "Debbie Schaffer", "time": 1595096526989, "rating": 5.0, "text": "We are repeat customers - this is our second glass shower door installed by Huntsville Glass, and we are extremely pleased. From our first phone conversation, the installer coming to the house to measure, and the actual installation, Huntsville Glass was professional, courteous, careful, and did excellent work.The first door was installed over 4 years ago and still looks beautiful and works like new today. The second door - a slider door, is only a week old, but we are loving it. If we needed a third shower door, I would call Huntsville Glass! Over the years, I've also had various pieces of picture frame glass and mirror glass cut to size and had excellent service too. Thanks to installers John and Curtis!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO9zjm4xmfGi0MACxC8lAMTMgoSRFqk2YxuPLB7=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNLY8GvQiw63GCg1FWDL8gvEBbvSRoJfDCa4B1H=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMO3UYpbIgyxtE4FF4km1aCSy6Muh1QLu3-IhaU=w150-h150-k-no-p"]}], "resp": {"time": 1595250756676, "text": "Thank you for letting us know you have had a great overall experience with us over the years Debbie. We are always glad to hear our technicians and staff are taking great care of our customers. We look forward to continuing to help you with your glass and mirror needs!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "109959072705782395465", "name": "cathy veque", "time": 1620676836608, "rating": 5.0, "text": "We have had Huntsville Glass replace the double pane glass in several of the windows at our home.  They are very good to work with from the office to the technicians.  They arrived on time and went right to work.  They did the reinstall  in a short time frame and were very professional and courteous.  Today was our 2nd time to use them for this service and they were once again a pleasure to work with.", "pics": null, "resp": {"time": 1620924368150, "text": "Always a pleasure to hear from repeat customers. We hope to always be your \"go to\" for any and all of your glass needs."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "108491249220046490131", "name": "Ryan Green", "time": 1616688604848, "rating": 5.0, "text": "Punctual, quick, and affordable. Responded to my broken window situation in very little time. Pleased with my experience would use HGC again for my glass needs. James JR did a great job and was very communicative during the entire process. Thank you!", "pics": null, "resp": {"time": 1617285037814, "text": "Ryan, we are so glad to hear about your pleasurable experience. It's always great to hear when our employees put extra effort into customer service and communication. We look forward to serving you again!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "112728691397888337844", "name": "Sheryl Payne", "time": 1600440195254, "rating": 5.0, "text": "Recently a rock got flung toward my storm door while the front yard was being mowed.  I had one of those decorative films on the window pane that actually kept the glass from shattering everywhere. I called HSV Glass and working with the support team was very easy. I accepted the estimate and 3 weeks later my new window pane is installed. Mr. John May and Mr. James Davis, Sr. came out this morning and did a great job of removing the old shattered pane and installing the new one.  I was told to let the window 'set' for about 24 hours to really let the seal do it's job and after that I can put a new film on if I wanted.  I really appreciate the work the guys did and of the great customer support /service from Ms. Sherri.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNPT_Oi_49fDgykC6HCqzlqYo2bPaPMcu9hvPxI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMM7S1XQe06C1ig0BIWZriu7QfLyndOLB-DSdOb=w150-h150-k-no-p"]}], "resp": {"time": 1600462057815, "text": "Sheryl, we appreciate you taking the time to share your experience. We understand that dealing with the unexpected can be difficult. So glad to hear that we provided such service."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "108338303405212834735", "name": "Jon Hutchinson", "time": 1620674630553, "rating": 5.0, "text": "Very pleased with Huntsville Glass. Very friendly, courteous and professional staff. James and James Jr. did a fantastic install of a new pane to replace one that was broken by a flying rock.", "pics": null, "resp": {"time": 1620924311867, "text": "Thank you Jon!!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "105677509162545709977", "name": "Derrick Graham", "time": 1612789481740, "rating": 5.0, "text": "I wanted to share my testimony. It’s long but it just shows how much this company cares.\n\nI took my broken window glass to Huntsville Glass for repair. They gave me a temporary one because it would take around five weeks for permanent fixture to  return for pickup.  During this time, I took my bent screen frame to them, or so I thought.  I was told they were unable to do the work and referred me to another company in Huntsville.  Due to my poor memory, I forgot about the conversation. I called to inquiry when would the work be completed. They searched and searched around their facility and couldn’t find it.  To make a long story short, they went the extra mile and called other glass and screen repair companies. They found my screen, through their tireless efforts, they coordinated with those companies to get it repaired. Then, they called me and told me where it was and gave me the number. I was so impressed and I felt bad because I thought they had it.  I apologized and to my surprise, they were very kind and patient with me.\n\nI said all of that to say this!!!!! THIS COMPANY CARES ABOUT YOU AND YOUR BUSINESS!!!!!’ Thank you all for being so professional and patient with me.", "pics": null, "resp": {"time": 1613404191025, "text": "Its great to know that some businesses still care about their customers. It is an honor to be included in that prestigious group."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "102847357755630293440", "name": "Camaria Caudle", "time": 1614900704708, "rating": 5.0, "text": "Huntsville Glass has worked with us for years! James Davis, Jr. Is amazing! Our residents always have nothing but nice things to say when he come to the property. Service is always professional, and timely.", "pics": null, "resp": {"time": 1615395444499, "text": "Camaria, Thank you for taking the time to let us know how pleased you are. We especially appreciate you telling us that the customer service you receive is consistently excellent!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "108449979513122764850", "name": "A.J. Battle", "time": 1623182314764, "rating": 5.0, "text": "Team worked quickly, and efficiently. Davis Sr, and Davis Jr. Very prompt, and professional", "pics": null, "resp": {"time": 1623938930877, "text": "Fantastic!! Glad to hear!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "100453338755363758004", "name": "Phillip Tucker", "time": 1604398529004, "rating": 5.0, "text": "Excellent service provided by Huntsville Glass. Our repair was relatively simple, but technicians John May and James Davis, Sr. were courteous, professional, and quick. The replacement of our broken window glass was done as scheduled and to our satisfaction. I would definitely recommend Huntsville Glass for home or business glass repair/replace work!", "pics": null, "resp": {"time": 1604438788883, "text": "We appreciate your recommendation. It was pleasure serving you. We look forward to serving you again."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "116951973233530473712", "name": "Nick Coleman", "time": 1608654336620, "rating": 5.0, "text": "These guys were great! Excellent service and great install by John May and James Davis Sr. My son broke our window over Thanksgiving and they came out quoted, ordered and installed soon as possible. Highly recommend!  Thank you", "pics": null, "resp": {"time": 1609249955932, "text": "You're Welcome! It's never fun dealing with broken windows during the holidays. I am so glad we were able to be there for you!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "112937945499753742336", "name": "Robert Wolff", "time": 1602951079276, "rating": 5.0, "text": "From start to finish it was a  great experience.  First I got a quote on the phone.  Then I placed the order.  Within a couple of days of placing the order, my glass was manufactured and John called to schedule the delivery.  John and James were courteous, considerate, and friendly.  My glass top for my desk is fantastic.  Highly recommend the Huntsville Glass Company Team!  Thank you John and James.", "pics": null, "resp": {"time": 1603294702610, "text": "We, too, had a great experience Robert. We are very glad we were able to provide you with your desk top glass in a timely manner. Don't hesitate to give us call next time you find yourself needing glass."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "107110277706295096902", "name": "Will Johnson", "time": 1608580277667, "rating": 5.0, "text": "James and John really did an outstanding job in replacing my windows.  Due to warranty issues,  I had three windows that needed replacement, They were very efficient in their work and cleanup.   I would certainly call on Huntsville Glass to do my next job.", "pics": null, "resp": {"time": 1609249776810, "text": "We appreciate your business and we thank you for your recommendation!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "114168582759130574809", "name": "mike fischer", "time": 1600097428002, "rating": 5.0, "text": "Huntsville Glass Company of Huntsville, Al  staff were phenomenal, all the way from the initial call, to the technicians contacting me to arrange a the initial service call to measure the window to be replaced, and subsequently arriving. The staff was professional and courteous. The Staff contacted me with a price quote, which was extremely reasonable, and a best estimate with when the replacement glass should arrive.\nThe technicians contacted me the day prior to arrange a convenient time to replace the damaged glass, in turn showed up promptly at the scheduled time. Both technicians, # 80 and #95 were the utmost courteous and professional, went right to work, answered all the questions very honestly and forthright.  They completed the task and the workmanship was stellar from start to finish.\nI would highly recommend Huntsville Glass to anyone now and in the future.", "pics": null, "resp": {"time": 1600181167521, "text": "OUTSTANDING!! We are very proud of all our employees, from the office staff to the installers. Thank you so much for taking the time to express all your kind words. We are so very pleased to hear of your positive experience and we look forward to serving you again!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "101082680977212494899", "name": "Nathaniel Zickefoose", "time": 1609347995156, "rating": 5.0, "text": "I had an attic window replaced at an affordable rate. John May and James Davis, Jr were professional and did a great job. I will definitely be using Huntsville Glass again when needed!", "pics": null, "resp": {"time": 1609775608582, "text": "It was pleasure doing business with you and we look forward to future endeavors."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "107591624857877186506", "name": "john shallenberger", "time": 1614780898653, "rating": 5.0, "text": "Very straight forward and easy to work with even with my small orders . the order entry Lady on the phone is highly effective and friendly . will use again and highly recommend !", "pics": null, "resp": {"time": 1614890619844, "text": "John, we really appreciate you taking the time to let us know about your experience. We look forward  to working with you on future orders."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "111851100595615218838", "name": "kathy Straub", "time": 1615598701857, "rating": 5.0, "text": "Always a happy customer when dealing with Huntsville Glass.  Mr. Davis, Sr. and Mr. Davis, Jr. were a pleasure to have in my home.", "pics": null, "resp": {"time": 1615998541313, "text": "Kathy, it is always great to hear from our customers. We are pleased that you remain a loyal and happy customer."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "117873008405694506827", "name": "lavinia gullett", "time": 1614268687661, "rating": 5.0, "text": "My technicians were Mr. James Davis and James Davis Jr. They were excellent and the job was done in a very short time. Very professional!", "pics": null, "resp": {"time": 1614888333288, "text": "FANTASTIC!!  We love to hear that our installers are doing an excellent job in a timely manner."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "112549929170752054764", "name": "Sasha Clausell", "time": 1591362010380, "rating": 5.0, "text": "PROFESSIONAL! COURTEOUS! GREAT PRICES!\nI just want to say \"Thank you!\" Huntsville Glass for the amazing work you have done at my home. I am beyond pleased. The technicians were extremely knowledgeable regarding the work that needed to be completed and always arrived on-time as scheduled. John May and James Davis, SR, you are AWESOME! I can't say thank you enough and I will definitely recommend Huntsville Glass to everyone.", "pics": null, "resp": {"time": 1591619766993, "text": "We are so glad to hear you had an amazing experience Sasha. We really appreciate you letting us know how our technicians took great care of you. If you have any future glass needs we would be happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "104418514189457770698", "name": "Lisa Saenz", "time": 1613138067191, "rating": 5.0, "text": "Our technicians James Davis and James Davis Jr. were great! Very fast installation process!", "pics": null, "resp": {"time": 1613168454166, "text": "Super!! We were happy to serve you!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "113647078620422091334", "name": "Alan Hovexak", "time": 1610713626720, "rating": 5.0, "text": "I just love glass. Silicon dioxide is so pretty, so shiny. Especially cobalt blue.", "pics": null, "resp": {"time": 1610742009446, "text": "We love it too!!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "101177810983771558209", "name": "Jim Howe", "time": 1611862906544, "rating": 5.0, "text": "Quick and professional work done by James Sr and James Jr.  Will definitely use this company in the future.  Excellent work!", "pics": null, "resp": {"time": 1611870983456, "text": "Our father and son duo shines again! Thank you!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "107345999604729073120", "name": "Ryan Hughes", "time": 1606155319969, "rating": 5.0, "text": "John and James did a great job replacing glass in several of our windows. They were on time (and really 15 mins early), got the job done quickly, and cleaned up when they were done. Very pleased with the work and product!", "pics": null, "resp": {"time": 1606510467458, "text": "Our installers take pride in their work as well as their customer service. We love to hear when they exceed expectations!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "116061145090745034327", "name": "Denis Schaffer", "time": 1611158273742, "rating": 5.0, "text": "Had to replace a cracked window at the top of a sunroom.  It turned out to be a very difficult job, but John May and James Davis, Sr. did a great job, and got it done.  I was very happy with the results.", "pics": null, "resp": {"time": 1611868360764, "text": "We are so glad to hear it!  We are proud of our guys!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "106797796267629175713", "name": "Edward Griffin", "time": 1602159007247, "rating": 5.0, "text": "Great job in a very short time.  I only wish that they could take care of all my handyman needs!  I highly recommend technicians:  John May and James Davis, Sr.", "pics": null, "resp": {"time": 1602254626801, "text": "Nowadays, it is hard to find someone to address situations in a timely manner. We are so glad we could be that for you. Thank you Edward, we appreciate your kind words."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "106161697456378563654", "name": "Oldwood Custom Cabinets, Inc.", "time": 1583332664566, "rating": 5.0, "text": "As a custom cabinet company, we rely heavily on skilled glass professionals to provide high quality glass and mirror products. We have chosen to solely use Huntsville Glass Company, Inc. because that's exactly what they provide. They have always given us what we need to ensure our clients have the best product. This is truly a partnership between two companies in the Huntsville homebuilding industry. We couldn't be more thankful for the customer service we receive from Stephanie Grayson, Angie Smith and the entire team at Huntsville Glass Company, Inc.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN58cDuSTFOQYERZ06vnDKbToRGDe0biceEWhrn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPX_vufymzTq9oCZmKOB6MO4HgnTNb8pIpDCNPT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMUzX6OMHe3RbMab8QxDSuhLi4mVt6Si1ROK-Fz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOPbNHpKCsooc6CYQA6Y6SIZFMt2CtuklZAaRNQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMbzZ9REDA5kTthlmM35OoyXQ0T9JhAKdDj7EKZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNotv6TnhTQK2JGZ1snr42XrR47FxAlvIEJ0UCJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP5IjvvXUnYf4HWQfzyVn8kpRRmCxXJ8akMDXGn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMNuD98bQ17AnA1mMoKjBs9u-kidKPQ0RijCr-y=w150-h150-k-no-p"]}], "resp": {"time": 1583518196027, "text": "Thank you for taking the time to share your experience and for letting us know that our team has taken great care of you. We really appreciate your business and look forward to our continued partnership. We also love the pictures you shared. Beautiful work! Our glass and mirror definitely accents your magnificent cabinets!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "105333094208695013416", "name": "Bette Goodman", "time": 1607120495715, "rating": 5.0, "text": "This is the second time Huntsville Glass has installed shower doors at our house. We highly recommend them for the quality of the doors and excellent professional installation!  Thank you to our technicians John Saeger and Curtis Campbell 😊", "pics": null, "resp": {"time": 1608039449984, "text": "We value our repeat customers and we welcome the recommendation. Thank you for your business!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "111290455821458130840", "name": "Steven Werdehoff", "time": 1607127460787, "rating": 5.0, "text": "John Seeger, Curtis Campbell and the team at Huntsville Glass are amazing. Took a tricky job no one else would touch, made it look easy and at affordable prices! Will always be my go to shop for any glass needs.", "pics": null, "resp": {"time": 1608039497912, "text": "We are very proud of our talented installers. We look forward to serving you again."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "106825976700536593648", "name": "Brian Mayfield", "time": 1606157480502, "rating": 5.0, "text": "John May and James Davis, Sr. performed a window repair/replacement in our home.  They not only saved us considerable $$ over our initial expectation, but they also made a great impression about the professional culture of this company.  They showed up to both appointments on time, were very professional, and did a great job with the repair.  They were even kind to our dog.  We will use this company again.", "pics": null, "resp": {"time": 1606510714052, "text": "FANTASTIC!! We appreciate all your kind words as well as the reminder that we have some great folks working for us!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "101872664091890395556", "name": "Richard Hull", "time": 1608063866699, "rating": 5.0, "text": "We are very pleased with the installation of mirrors done by John and his assistant.  On time, pleasant and efficient.", "pics": null, "resp": {"time": 1608134945135, "text": "We were very pleased to provide you a timely, worry free installation!!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "107079850527388171740", "name": "Kim Carter", "time": 1594489716608, "rating": 5.0, "text": "We requested a quote for one large fogged/failed window and a broken bathroom window on a Friday and by Monday John and James were there to take measurements. Fast service!  I really wanted the grille color to match the neighboring windows. John had a fan deck of colors with him and James was awesome  when I stopped in the store to place my order, helping to assure me the right color was ordered.  Once the windows arrived they were able to come out the next day and I was so happy the install crew was going to be John and James again.  They were quick, efficient and wonderful to work with.  Will definitely hire them again!", "pics": null, "resp": {"time": 1594651350821, "text": "Thank you so much for your thorough review Kim. We do have some pretty amazing technicians and we are so glad to hear you had a great experience. We look forward to helping you again in the future!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "115958606428442565058", "name": "Harold Robinson", "time": 1605119632277, "rating": 5.0, "text": "John and James did a very good job replacing glass panels in a 40 year old door. They were early for their appointment to boot. Very happy.", "pics": null, "resp": {"time": 1605889076974, "text": "Harold, Thank You for letting us know you were pleased! We like it when our installers exceed expectations!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "116132368582075846225", "name": "Al Moore", "time": 1600447838414, "rating": 5.0, "text": "Replaced a large fixed pane in the peak of a gable. They were right on schedule and I was very pleased with the work. They took extra care cleaning up after the job. I will definitely use them again.", "pics": null, "resp": {"time": 1600459833267, "text": "Thank you for your feedback! We look forward to working with you again."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "116062583746079698819", "name": "TA CHUNG WANG", "time": 1592069699818, "rating": 5.0, "text": "They showed up on time and were very professional. The two gentlemen, John and James, demonstrated excellent workmanship. They replaced glass of my 78” arch window and you can’t tell the frame was worked on. It was a very pleasant encounter.  It is a five star coming from me.", "pics": null, "resp": {"time": 1592315714874, "text": "Thank you for sharing about your recent experience. We are so glad to hear our technicians took great care of you and your home. We would be happy to help you again in the future!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "102354120121352287172", "name": "Meghan Stewart", "time": 1587736787676, "rating": 5.0, "text": "Huntsville Glass showed up to estimate and installation appointments on time and swiftly made the repair.  Their price was extremely fair and competitive.  Their installers explained the job to us in detail, making us feel very comfortable with the quality and timeliness of the work being performed.  We'd give them a 15/10 if we could!", "pics": null, "resp": {"time": 1587748214902, "text": "Meghan, we really appreciate you letting us know that you had a great overall experience. We are glad to have been able to help and would be happy to help with any future glass needs!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "108304858657821811309", "name": "Bob B.", "time": 1606052209706, "rating": 5.0, "text": "Hsv Glass installed a glass walk-in shower for us. Their technicians, John Saeger & Curtis Campell, were prompt, professional, and completed entire job in 2 hours.  It looks beautiful. We would definitely use them again.", "pics": null, "resp": {"time": 1606510296122, "text": "Bob, we appreciate you taking time to tell us about your experience. We are lucky to have such talents on our team. We look forward to working with you again!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "115305936433580656747", "name": "H2Brew", "time": 1602264552886, "rating": 1.0, "text": "In this case, do not buy local. I could have saved over $700 buying this glass online, and it would have arrived already, but I really wanted to support local businesses. I spent over $1100 for a few pieces of trapezoids and rectangles at 5/8\" low-e. It has been over a month and the glass is still not here. Just excuses about broken or mis-sized pieces. I will have the glass someday, it will probably be the wrong size and I will have to live with it. Never again though.", "pics": null, "resp": null, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "104156497372562356872", "name": "Mike Tilley", "time": 1601045880244, "rating": 5.0, "text": "My experience with Huntsville Glass has been totally positive.  They have been friendly, helpful, courteous, prompt, competent, and go the extra mile.  They will get my future business.", "pics": null, "resp": {"time": 1601322519015, "text": "Mr. Tilley, thank you for sharing. We look forward to working with you again."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "115279231991911476460", "name": "Jeffrey Boudreau", "time": 1594827764780, "rating": 5.0, "text": "John and James were excellent! They arrived exactly when they were scheduled to, took very little time to get the job done, and were very courteous and prompt about updates with the job itself. Our new window looks great!", "pics": null, "resp": {"time": 1594920029319, "text": "Jeffrey, thank you for taking the time to let us know how great our technicians did. We really appreciate your feedback. If you have any future glass needs we would be happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "107087991266948486956", "name": "Edie Hermes", "time": 1591728147841, "rating": 5.0, "text": "Excellent work and friendliness. Very prompt and precise. Also fairly priced. James Davis Sr & John May are my favorite - they have been out a few times and are outstanding", "pics": null, "resp": {"time": 1591879144279, "text": "We are so glad to hear you have had several outstanding experiences with our company, Edie. We really appreciate you sharing about your overall experience and would be happy to help you again in the future!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "107668992382558053108", "name": "Lori Hall", "time": 1586982077739, "rating": 5.0, "text": "If I could give 10 stars, I would. From start to finish Huntsville Glass Company was professional and speedy! I called to get an estimate on a half round window that had a broken seal. They came out within a day to give me an estimate and it was replaced within two weeks. John and James were an amazing team.  I was so impressed I asked them to replace the glass in a master shower enclosure. They measured while they were there, and I had an estimate within a few days. The glass came a week earlier than expected, and James and John came back and replaced the whole enclosure in less than an hour. Such a great experience. Thank you!", "pics": null, "resp": {"time": 1587039795542, "text": "Lori, your thorough review is greatly appreciated. We are glad to have been able to help you and see that our technicians took great care of you with all of your glass needs. If you have any future glass needs we would be happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "106248396108024239228", "name": "Chad Bickford", "time": 1587074965074, "rating": 5.0, "text": "We had an accident with a window at home. I've done business with these wonder folks through work on multiple occasions and I didn't think twice about calling them first. I was given a fair price and a 2 to 3 week date of turnover. Day 13 and the window is back in with a perfect fit. Angie, again I want to thank you and the guys for such great service and customer service. I'll throw all the business I can at y'all. Thank you so much!", "pics": null, "resp": {"time": 1587127941422, "text": "Thank you so much for your kind words Chad. We are grateful for your loyalty and really appreciate you taking the time to give us a thorough review. We look forward to helping you in the future!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "114536572411765385287", "name": "Eric Skeldon", "time": 1586385583298, "rating": 5.0, "text": "Had 3 windows replaced. John May and James Davis (installers) did a very professional job. Lowe's wanted to replace the entire window sills for the 3 windows. John and James gave me an estimate to replace the glass only. Less than half the price of Lowe's. They took the window frames apart and replaced the glass. In and out in couple hours. Job well done.  Highly recommended.", "pics": null, "resp": {"time": 1588943529152, "text": "Thank you for sharing Eric. Sadly we hear similar stories all the time where people are told by other companies that they have to replace the entire window and not just the glass. I am glad you found us and that our technicians took great care of you. If you have any future glass needs we would be happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "118186058764781532960", "name": "Jimmy Parry", "time": 1599743923184, "rating": 5.0, "text": "The outside pane of glass on one of our windows was broken by a bird or a frisbee.  We called HSV Glass Company, they sent someone out to give us an estimate. We paid for the glass,  They were very flexible as we had to reschedule the installation many times.  James Davis Sr. and James Davis Jr. came out and replaced the broken window glass.  They were professional and fast.  I will be calling them again when I have broken glass in the future.", "pics": null, "resp": {"time": 1599753121366, "text": "FANTASTIC! Your feedback is very much appreciated. It's great to hear that our guys were able to accommodate your scheduling needs. We look forward to working with you again."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "106191636873943055808", "name": "Grace Black", "time": 1583247315760, "rating": 1.0, "text": "Called to get an estimate and the woman on the phone was so rude! They obviously don’t care about doing business with people or fostering lasting business relationships to encourage repeat customers. I guess they don’t need business. Called K&M glass instead and they were so friendly and answered all my questions. Will recommend K&M to everyone that needs glass repair!", "pics": null, "resp": {"time": 1583262566370, "text": "Grace, we are so incredibly sorry that you had a bad experience. That is never our intention and we are addressing the problem. If you call back and ask for Stephanie she will take great care of you. We sincerely apologize for the bad customer service you received and we hope to be able to earn back your business in the future."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "113670322713698324308", "name": "Margaret Dukeman", "time": 1583866234559, "rating": 5.0, "text": "As usual Stephanie was a delight to work as was your new employee.  However, when I arrived your other employee who sits in the West corner never made any motion to see or ask if I needed any help.  As I stood there waiting and waiting.  Finally Stephanie peeked our from what looked like a lunch area to see if I needed help.  She was obviously at lunch but she stopped her lunch and came out and helped me.  Still the other lady never did look up or ask if she could help.  This isn’t the type of service I have grown accustomed to at your place of business. Your company is far better than that.  You got five stars because of Stephanie and her exceptional attention to detail and always providing me with exactly what I needed!  Not just every store is willing to work with an artist and their creative ideas and carry them through in a stellar manner.", "pics": null, "resp": {"time": 1583934785614, "text": "Margaret, we really appreciate you providing a thorough review of your most recent experience. Your feedback is very important to us and we will do everything we can to ensure a better experience the next time. We hope to continue to be a great source for your glass needs."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "115274717037097606735", "name": "Lesa Saylor", "time": 1594057980309, "rating": 5.0, "text": "Great work from John and James. I was very pleased that they arrived on time and did a perfect job. Thank you!", "pics": null, "resp": {"time": 1594068668429, "text": "Thank you for taking the time to give a review Lesa. We really appreciate you letting us know how well our technicians did. If you have any future glass needs we would be happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "112337144695508322095", "name": "Kathleen Abalos", "time": 1594227605854, "rating": 5.0, "text": "Very happy with the widow replacements. John May and James Davis did an excellent job. They were professional and personable.", "pics": null, "resp": {"time": 1594650506672, "text": "Thank you for sharing your experience Kathleen. We are so glad to hear our technicians did an excellent job and we really appreciate your feedback. If you have any future glass needs we would be happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "106353207297685310741", "name": "Becky Kelly", "time": 1584402408972, "rating": 5.0, "text": "Three of our sunroom glass doors needed to be replaced.  Huntsville Glass got in the doors in less than three weeks and John came out to install them.  They look beautiful!!  Thanks so much for your hard work!  Will definitely call Huntsville Glass the next time we need glass work!!", "pics": null, "resp": {"time": 1584552876645, "text": "Thank you for letting us know about your experience Becky. We are glad to hear the replacement glass looks great. We would be happy to help you again in the future!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "105661573725164785374", "name": "Mary Thompson", "time": 1602616978255, "rating": 5.0, "text": "They underpromised and overdelivered.  I needed replacement glass for a double hung window that had lost its seal. I was told it would be a couple of business days before they scheduled a measurement appt and they scheduled the next day!  I was told it would take 2-3 weeks for the replacement glass to be installed and John May and James Davis, Sr.  were back the next week to install. They were in and out in less than 15 minutes!", "pics": null, "resp": {"time": 1602622331984, "text": "With so much going wrong, it sure is nice when something goes right. We are at the mercy of our distributors with regards to receiving the products we order in a timely fashion. Unfortunately, things don't always go as planned. We are so glad they came through for you and we were able to get it installed so quickly."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "113371828768907443575", "name": "Meike Fisk", "time": 1578973935664, "rating": 5.0, "text": "I was selling my property and had two windows that needed replacing. One had thermal seal failure and one was broken.  I had gotten a quote from a “window” company and they said the whole window plus the transom above it would have to be replaced and their cost was over 1700.00.  I called another glass company and they have yet to call me back to even come out and look at replacing the glass only. I called  Huntsville Glass and I believe they came out within 2 days to measure and give me a quote. It was under 600.00. After I gave them the go ahead to order the replacement glass I was told it would take 2-3 weeks and that was fine with me but they came in at least a week sooner and they installed them within two days of calling me to say they were in!! John and James arrived right on time and were finished quickly and left behind no mess.  The even answered my questions and explained the process to me patiently.  I will definitely use them again!  I appreciate their exemplary customer service!", "pics": null, "resp": {"time": 1579007760884, "text": "Meike, we are so glad to have been able to provide you with a great experience and are thankful that you took the time to provide an in depth review. We really appreciate your feedback and will be happy to help you in the future!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "111867033877817823221", "name": "Mike Brown", "time": 1583932283369, "rating": 5.0, "text": "Great job.  John May and James Davis Jr. arrived on time and were very courteous.  Worked around other contractors.  Office staff were very helpful.  We have used Huntsville Glass for decades and never been disappointed.", "pics": null, "resp": {"time": 1584016979017, "text": "We are so glad to have your continued business Mike. Thank you for taking the time to share your experiences. We look forward to assisting you in the future!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "103654798009011148269", "name": "Adrian Fann", "time": 1581970246733, "rating": 5.0, "text": "Hsv Glass came out to estimate when they said they would. Got back the next day with the estimate which was fair. Told me it would take 3 weeks, it did. Called to schedule an appointment to install at my convenience. Showed up on time and began work. Worked all day to get it done. Cleaned up and were gone. Very satisfied with their work.", "pics": null, "resp": {"time": 1582032120088, "text": "Adrian, we appreciate you letting us know about your experience. If you have any future glass needs we would be happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "117394390888217281815", "name": "Megan Dey", "time": 1592948879002, "rating": 5.0, "text": "Both John and Curtis were wonderful and well-knowledgeable with their craftsmanship. I highly recommend them from Huntsville Glass.", "pics": null, "resp": {"time": 1593095933560, "text": "Megan, your feedback is greatly appreciated. We are so glad to hear how well our technicians took care of you. Thank you for sharing your experience. We would be happy to help you again in the future!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "114785090021605237267", "name": "Denise Garrison", "time": 1578229304922, "rating": 5.0, "text": "Had exterior glass door resealed. Repair was scheduled easily and in timely manner. Technicians, Mr May and Mr Davis Sr. arrived on time on repair was done quickly. Repair was exceptionally less than replacing door. I would use their service again without any hesitation.", "pics": null, "resp": {"time": 1578404019200, "text": "We really appreciate you taking the time to share your experience Denise. Your feeback is greatly appreciated. We would be happy to help you with any of your glass needs!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "109543988149308377481", "name": "SM Battles", "time": 1583623503639, "rating": 5.0, "text": "Leading Edge Trophies & Screen Printing came to Huntsville Glass with a last minute job that needed to be done immediately.  Stephanie, Angie and Shari went above and beyond to get the job done.  It turned out beautifully.  Thanks Huntsville Glass Company and your courteous Staff.", "pics": null, "resp": {"time": 1583758406392, "text": "We are very glad to have been able to help you with your last minute needs. Thank you for letting us know that our staff took great care of you. We really appreciate you taking the time to share your experience. If you need anything else we will be happy to help."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "114287762194981096949", "name": "Chris M", "time": 1580325850390, "rating": 5.0, "text": "Excellent. Professional, fast, reliable, not expensive, kindly and helpful. I haven't ordered anything fancy nor complicated , but they helped me to have it in the best possible way. I will definitely ask them next time I need a glass work!", "pics": null, "resp": {"time": 1580393730727, "text": "Thank you for sharing your experience Chris. We are so glad to have been able to help you and look forward to assisting you in the future!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "103645128576235629073", "name": "Jessica T. McNair", "time": 1565746267544, "rating": 5.0, "text": "What a great experience!  Stephanie went above and beyond from the very beginning. I told her in person that the service she offers is rare, and I really appreciate how helpful she was. She is full of ideas and helped me creatively resolve the issue I came to her and Huntsville Glass with. And the price was better than expected too!  Can’t recommend enough! I’m a very happy customer.", "pics": null, "resp": {"time": 1565788827782, "text": "Thank you for letting us know our staff took great care of you Jessica. We really appreciate you taking the time to write a thorough review.  If you have any other glass needs we will be happy to assist you!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "105119534717370518926", "name": "Nemil Shah", "time": 1587489946838, "rating": 5.0, "text": "Great experience with this company and especially John and Curtis. They are quick, detail oriented and above all trustworthy. I highly recommend this team.", "pics": null, "resp": {"time": 1587493995515, "text": "We are so glad to hear you had a great experience Nemil. We really appreciate you letting us know and that our technicians took great care of you. If you have any future glass needs we would be happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "100938923951462355894", "name": "Kitchen Designer", "time": 1583539447427, "rating": 5.0, "text": "Stephanie and Hsv Glass are great!!! Very prompt, very efficient, always right and always on time!! We've never had any issues whatsoever when ordering glass for our cabinets!  We typically email our orders and go to the store to pick them up....we are very pleased with the service we receive and will continue to count on Huntsville Glass for our needs.", "pics": null, "resp": {"time": 1583758254831, "text": "Thank you for sharing your experience with Huntsville Glass. We value your business and look forward to our continued business relationship. Your feedback is greatly appreciated!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "107771829467932137964", "name": "Monte Davis", "time": 1601390857197, "rating": 5.0, "text": "They were timely and the install only took 20 minutes. Thank you guys!", "pics": null, "resp": {"time": 1601484981450, "text": "You are very welcome Monte!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "110656086729126935653", "name": "Glen Jones", "time": 1561207962795, "rating": 5.0, "text": "Excellent experience.  They installed multiple panes of glass in very old window frames (19 pieces of glass in window frames that are pushing 100 yrs old).  price was very-very good for assistance and service provided.  they  are experienced and provided good suggestions on options for how things could be done and what to expect with each.  Friendly service counter staff.  I'll definitely use this business for future work.", "pics": null, "resp": {"time": 1561410097970, "text": "Thank you Glen for your review. We really appreciate your feedback and are so glad to hear our technicians and staff took great care of you. We look forward to helping you again!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "101646505844661161892", "name": "Joyce Brewster", "time": 1588255142311, "rating": 5.0, "text": "James gave professional and courteous service. He was patient and answered all our questions. Knowledgeable young man.", "pics": null, "resp": {"time": 1588681232439, "text": "Joyce, we really appreciate you letting us know about your experience with our technician. I am glad he was able to assist you. If you have any future glass needs we would be happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "113272552398904814228", "name": "Tammy Anderson", "time": 1582565509358, "rating": 5.0, "text": "Huntsville Glass did an excellent job replacing a broken window for us.  John and James were very prompt and professional when they came to give the quote and replace the window.  Our window came in sooner than expected and setting up the appointment was a breeze!  The guys even installed it in the rain.  I would definitely use Huntsville Glass again.  Everyone we dealt with, from the office staff to the installers were a pleasure to work with.  Thanks Huntsville Glass!!", "pics": null, "resp": {"time": 1582646334002, "text": "We are so glad to hear you had a great overall experience Tammy. Thank you for letting us know. We really appreciate your feedback and would be happy to help you again!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "111635726293238950000", "name": "Bradley Thomas", "time": 1582087120741, "rating": 1.0, "text": "I called to get an estimate on a bathroom mirror and spoke to an incredibly rude woman on the phone. She did a poor job explaining the dimensions that were needed and became frustrated easily. Chose not to do business with a company with poor customer service.", "pics": null, "resp": {"time": 1582126687166, "text": "I am so sorry to hear that you had a bad experience. We sincerely apologize. I'm not sure what was going on, but if you are still in need of a mirror please call and talk to Stephanie. She will take good care of you. Once again, I am sorry for the inconvenience and we never want our customers to have a bad experience."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "108735645249218867224", "name": "Jill Burton", "time": 1583339445989, "rating": 5.0, "text": "Great Customer Service!   Stephanie, Angie and Shari are always ready to help.  Glad to have them as a business partner.", "pics": null, "resp": {"time": 1583518540747, "text": "Jill, we really appreciate you letting us know that our staff takes great care of you. We are glad to be of assistance and look forward to helping you in the future!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "106113796404167196244", "name": "Randy Taylor", "time": 1579570361314, "rating": 5.0, "text": "I ordered a custom piece of glass and the staff was very prompt and courteous.  They worked with me to reschedule based on my availability.  John and James did a good job, and within the the time estimated.", "pics": null, "resp": {"time": 1579620965455, "text": "We are so glad to hear you had a great experience Randy. Your feedback is greatly appreciated. If you have any future glass needs we would be happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "101607540765104703404", "name": "Alicia Fox", "time": 1591714621918, "rating": 5.0, "text": "Thank you Huntsville Glass!! and Thank You John and James for your amazing work!! Highly recommended", "pics": null, "resp": {"time": 1591879022417, "text": "Alicia, we really appreciate your feedback. We always love to hear our technicians did amazing work. Thank you for letting us know. If you need anything else in the future we would be happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "110672649949484329902", "name": "Diona Salverson", "time": 1561406833237, "rating": 5.0, "text": "Huntsville Glass replaced one of the windows in our iron front door.  They got the window in with a scratch so they returned it and reordered.  In came in less than two weeks and they scheduled a crew for the first available opportunity.  The installation crew consisted of John May and James Davis, arrived when they said they would, they had the window installed in a short time, cleaned up their work area and were on their way.  They were pleasant, polite and courteous.  They answered all our questions.  We would recommend this company and this crew to anyone needing glass replacement anytime.", "pics": null, "resp": {"time": 1561409439791, "text": "Thank you Diona for sharing your experience. We really appreciate the feedback and are so glad to hear that our technicians took great care of you. We are happy to help with all your glass needs!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "100672911127713388667", "name": "Michael R", "time": 1589207736168, "rating": 5.0, "text": "Huntsville glass fixed my windows quickly and professionally. James Davis SR and JR did a great job on the windows.", "pics": null, "resp": {"time": 1589287828330, "text": "We are glad to hear you had a great experience Michael. Thank you for letting us know about our technicians work. If you have any future glass needs we would be happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "113865661331936288359", "name": "Mary Smith", "time": 1589471850701, "rating": 5.0, "text": "John and Curtis arrived on time, greeted me, introduced themselves and got to work.  We are happy with our large mirror install.", "pics": null, "resp": {"time": 1589547749568, "text": "Mary, we really appreciate you letting us know about your recent experience. I'm glad that John and Curtis took great care of you and that you love your new mirror. We would be happy to help with any of your future glass or mirror needs!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "103116009793804297734", "name": "Makenzy Jackson", "time": 1583268191087, "rating": 5.0, "text": "I called Huntsville Glass with a plethora of\nquestions & Sherry was very polite & tried to be helpful but unfortunately she didn’t have all the answers, so she gave the phone to Stephanie. And thanks to them, when I do get around to getting my glass situation taken care of, Huntsville Glass will be my only call.", "pics": null, "resp": {"time": 1583329148628, "text": "Thank you for sharing your experience Makenzy. We really appreciate you letting us know that our employees took the necessary steps to ensure your questions were answered. We look forward to helping you in the future!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "101835735325772277911", "name": "Saundra Adams", "time": 1572622447215, "rating": 5.0, "text": "Amazing service and great techs!!! John and Curtis were very professional and courteous. They were on time and we love their work. I would recommend them to everyone.", "pics": null, "resp": {"time": 1572629445436, "text": "We really appreciate you letting us know about your experience Saundra. Feel free to add a picture of your new shower glass to our google listing! If you have any future glass needs we are happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "116128278332042739222", "name": "Greer Eleazer", "time": 1585784195060, "rating": 5.0, "text": "Called them to replace a broken window on my house. Excellent service and price. They also replaced the window screens. Professional Technicians (John and James).", "pics": null, "resp": {"time": 1588943345806, "text": "We are so glad to hear you had a great experience Greer. We really appreciate you letting us know and that our technicians took great care of you. If you have any future glass or screen needs we would be happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "104605085472942076767", "name": "Rhonda Roland", "time": 1586917839382, "rating": 5.0, "text": "They did a great job installing custom shower doors.  Very prompt and courteous.", "pics": null, "resp": {"time": 1587039691316, "text": "Thank you for letting us know about your experience Rhonda. We really appreciate the feedback and would be happy to help you again in the future!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "117913695744766891686", "name": "Drenda King", "time": 1571339269115, "rating": 5.0, "text": "I had a large glass replaced in a door and was extremely pleased with the personnel in both the store and the installation process at my home. My technicians were John May and James Davis, Jr. who were courteous, professional, timely and expert. Very good experience!", "pics": null, "resp": {"time": 1571401157212, "text": "Drenda, we are always happy to hear our staff and technicians took great care of our customers. Thank you for letting us know about your experience. We would be happy to help you again if you need any glass in the future!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "114754340195453532952", "name": "Michael Bedard", "time": 1614356954321, "rating": 5.0, "text": "Made good in the end", "pics": null, "resp": {"time": 1614888509344, "text": "We are glad to hear it!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "101050453485966004687", "name": "Jim Perkins", "time": 1583860412079, "rating": 5.0, "text": "John and James did an excellent job both in measuring for and replacement of our windows with broken seals.  They are knowledgeable, efficient, and take a sincere interest in customer satisfaction.", "pics": null, "resp": {"time": 1583866311849, "text": "Jim, we are so glad to hear our technicians took great care of you. Thank you for taking the time to share your experience. If you have any future glass needs we would be happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "112419560470918522791", "name": "Chip Carter", "time": 1568495414075, "rating": 5.0, "text": "John May and James Davis were excellent in measuring and replacing our insulated glass windows. In and out very quick. Love looking out new windows.", "pics": null, "resp": {"time": 1568638926851, "text": "Your feedback is greatly appreciated Charles. It's always good to know our technicians are taking care of our customers. I'm glad you like the new window glasses. We would be happy to help if you have any future glass needs!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "106074081626739524252", "name": "Sally Thrower", "time": 1564669540709, "rating": 5.0, "text": "We had a storm window recently broken while the yard was being mowed.\nWe called Huntsville Glass who was very friendly and helpful.  Two employees came out that day to measure for a repair quote which we received the next day.  Those two employees  John May and James Davis Sr. came back to the repair work.  They were friendly and knowledgeable in doing their work.  They also made sure that the window area was clean and no broken glass fell on the ground.  Thank you so much.\nJosephine Adams", "pics": null, "resp": {"time": 1564753767037, "text": "Thank you so much for the thorough review Sally. Your feedback is greatly appreciated. We hope to help you again with any future glass needs!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "115745774942892056135", "name": "John Bearden", "time": 1584208591061, "rating": 3.0, "text": "I'm allergic to cats...and was greeted by one when I entered the door. Honestly I don't know more to say. I left quickly.", "pics": null, "resp": {"time": 1584371759619, "text": "I am sorry we were not able to assist you with your glass needs. We have actually had a cat at this location since it opened in 1941, but we are aware people have allergies to cats and will gladly make accommodations to serve you best. If you can let us know that you have an allergy to cats before coming to the store or tell us you have an allergy when you walk in the door we will gladly put the cat up. We are sorry to have inconvenienced you and would be happy to earn your business in the future."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "105604422916600292756", "name": "Heather Baumbach", "time": 1597241790729, "rating": 5.0, "text": "Wonderful and fast service and great craftsmanship!", "pics": null, "resp": {"time": 1597407824210, "text": "Thank you for sharing your experience Heather. We really appreciate the feedback!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "113395682702091013810", "name": "Garrett Stickels", "time": 1583354288494, "rating": 5.0, "text": "Awesome fast customer service. Great product", "pics": null, "resp": {"time": 1583518808551, "text": "Your feedback is greatly appreciated Garrett. We are glad to hear you like our service and products. If you have any future glass needs we would be happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "100283551473861274719", "name": "Cindy Hallman", "time": 1568243964507, "rating": 5.0, "text": "James Davis and John May were my glass installers and they were friendly, professional, and they did a great job! I had three broken window panes and they were all difficult to replace, either because they were hard to get to or just big and risky. I am so relieved this is done! Thank you to everyone there at Huntsville Glass. You guys rock!", "pics": null, "resp": {"time": 1568300552483, "text": "Cindy, we are so glad to hear that our technicians did a great job. We really appreciate you taking the time to give them a review. If the need for glass does arise again we would be happy to help you!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "113366322517090735026", "name": "Beverly Ketchum", "time": 1574260038864, "rating": 5.0, "text": "Excellent!   Available earlier than appointment and called ahead.  Finished quickly and cleaned up after.", "pics": null, "resp": {"time": 1574349310787, "text": "Beverly, we appreciate you sharing your experience. Your feedback is greatly appreciated. We would be happy to help you with any future glass needs!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "101314311462581901922", "name": "Brent Bailey", "time": 1561055604137, "rating": 5.0, "text": "Huntsville Glass Company continues to over deliver for us. Their staff is extremely helpful and can be counted on for creative solutions to some of our challenging projects. I highly recommend....Brent Bailey, Owner of DreamMaker Bath and Kitchen of Huntsville", "pics": null, "resp": {"time": 1561067651104, "text": "Thank you Brent for the great review! We are always happy to help and look forward to helping you again in the future!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "100350721429372931190", "name": "Tom Irby", "time": 1589998219966, "rating": 5.0, "text": "Great service. Competent, efficient service technicians.", "pics": null, "resp": {"time": 1590064380093, "text": "We really appreciate your feedback Tom. Thank you for letting us know how you feel about our staff and technicians. If you need anything else in the future we would be happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "108863543910192498920", "name": "Wagon Wheel Liquors", "time": 1568112473914, "rating": 5.0, "text": "Wonderful experience. Huntsville Glass was very responsive to our needs and wasted no time. James & John were very professional. Highly recommend!!!", "pics": null, "resp": {"time": 1568229703197, "text": "Thank you for letting us know our technicians took great care of you. We really appreciate your feedback. We are happy to help with any of your future glass needs as well!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "109658242148737992703", "name": "Barbara Staggs", "time": 1562253414422, "rating": 5.0, "text": "I had a piece of glass installed.  The workers actually came a bit early.  They were efficient in their work and pleasant to deal with.  Couldn't ask for more.", "pics": null, "resp": {"time": 1562594638162, "text": "Thank you for the great review Barbara. We are happy to have been able to help you!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "112375862148283518006", "name": "TCJSMOM R", "time": 1569072213495, "rating": 5.0, "text": "So fast in getting our order done and worked beautifully for what we needed. Very friendly staff. Couldn’t ask for more!!!", "pics": null, "resp": {"time": 1569854790804, "text": "Thank you for sharing your experience. We really appreciate the feedback. If you have any future glass needs we are happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "112697788553082196747", "name": "Maureen Vaughn", "time": 1604269997647, "rating": 5.0, "text": "James SR and John M. Excellent installers with concerns for making sure all aspects of installation was perfect and dedication to details. Cleaned up afterwards. Completely satisfied.", "pics": null, "resp": {"time": 1556651684823, "text": "Thank you for sharing your experience. We love to hear our technicians took great care of you!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "112773928944344459402", "name": "Dona Thompson", "time": 1565800085120, "rating": 5.0, "text": "Today I had the priveledge of having James Davis Jr and John May in my home to replace several windows. They were very nice and respectfl, they definitely deserve the 5 stars I gave them.  I would gladly have in m home should the need arise. The people in the office were the same way when I had to reschedule my appt time when I had to leave suddenly to go to Missouri when my daughter had a stroke. Thank all of you.", "pics": null, "resp": {"time": 1565807639624, "text": "Dona, we are so glad to hear you had a great overall experience. Your feedback is greatly appreciated. If the need for glass does arise again we would be happy to help you!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "114988597679300788164", "name": "Linda Lawless", "time": 1584629804770, "rating": 5.0, "text": "John Saeger and Curtis Campbell were great!", "pics": null, "resp": {"time": 1584706978652, "text": "We are glad to here are technicians took great care of you Linda. Thank you for sharing. If you have any future glass needs we would be happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "113052565868479787944", "name": "Sharon Mullins", "time": 1583348792347, "rating": 5.0, "text": "Great service by, John May and James Davis Sr.", "pics": null, "resp": {"time": 1583518734640, "text": "Thank you for letting us know our technicians took great care of you Sharon. We would be happy to help with any of your future glass needs!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "101600391339139086365", "name": "Trish Newman", "time": 1559734750195, "rating": 5.0, "text": "John May and James Davis did an OUTSTANDING job for us! Very professional, courteous, ahead of schedule, and fast!!!! Thanks guys!!\nMike Neeley, The Neeley Center for Health", "pics": null, "resp": {"time": 1559740437718, "text": "We really appreciate the feedback and are glad to hear you had a great experience. Huntsville Glass is happy to help with all your glass needs!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "106040576511168444796", "name": "Jerrilynne H", "time": 1565362556705, "rating": 5.0, "text": "Guys, John and Curtis, were on time and courteous. Did a good job.", "pics": null, "resp": {"time": 1565620217957, "text": "We really appreciate you letting us know about your experience. Thank you for sharing! If you need anything else we are happy to help."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "114050768190331460192", "name": "Mary K Hill", "time": 1534772509586, "rating": 5.0, "text": "Angie was very nice and personable on phone. Also very knowledgable. Answered all my questions quickly and easily. Give that woman a raise!", "pics": null, "resp": null, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "102626080836533746878", "name": "Blake Hargrove", "time": 1498760089156, "rating": 3.0, "text": "*** UPDATE ***\nRating - 3/5\nThe manager called back, apologizing for the experience we had. He seemed very sincere and wanted to earn our business, but we had already signed an agreement with a different company.\n\nWhere the individual we interacted did not show professionalism and courtesy, Huntsville Glass Company's manager did. We'll consider them for service in the future, solely based off our interaction with their manager.\n******\n\nRating - 2/5\nI'd consider giving a better review if I could actually get them to come out and provide an estimate. For 2 weeks, we've been attempting to get on their schedule. Instead, we get last minute phone calls stating that they're in the area and can stop by. If we could get maybe a 2 hour head's-up, we could accommodate Huntsville Glass' busy schedule.\n\nOur most recent interaction ended with the individual hanging up abruptly. I suppose they're busy enough they don't need to take the time to schedule estimations with customers 2 hours in advance.", "pics": null, "resp": null, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "106590650692424792446", "name": "Lila King", "time": 1567694188054, "rating": 5.0, "text": "Prompt, honest, and friendly team are experts in their field!", "pics": null, "resp": {"time": 1567696451004, "text": "We really appreciate you taking the time to give us a review Lila. Your feedback is appreciated and we are always glad to hear that our team has taken great care of our customers. If you have any future glass needs we are happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "102626080836533746878", "name": "Blake Hargrove", "time": 1498760089156, "rating": 3.0, "text": "*** UPDATE ***\nRating - 3/5\nThe manager called back, apologizing for the experience we had. He seemed very sincere and wanted to earn our business, but we had already signed an agreement with a different company.\n\nWhere the individual we interacted did not show professionalism and courtesy, Huntsville Glass Company's manager did. We'll consider them for service in the future, solely based off our interaction with their manager.\n******\n\nRating - 2/5\nI'd consider giving a better review if I could actually get them to come out and provide an estimate. For 2 weeks, we've been attempting to get on their schedule. Instead, we get last minute phone calls stating that they're in the area and can stop by. If we could get maybe a 2 hour head's-up, we could accommodate Huntsville Glass' busy schedule.\n\nOur most recent interaction ended with the individual hanging up abruptly. I suppose they're busy enough they don't need to take the time to schedule estimations with customers 2 hours in advance.", "pics": null, "resp": null, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "103382321999700335885", "name": "Stacy Tankersley", "time": 1508466678658, "rating": 2.0, "text": "I would not recommend this place.  The front desk has about the most unfriendliest, unhelpful ladies I have ever worked with.  After more than two weeks when the glass was finally ready for pickup they left a message that it was ready and for me to bring my own packing material because it will not be in any packaging there….  Really?\nIt also took two trips with all the measurements they ask for the glass, and I even provide pictures since it is going in an old house with no square corners.  After picking the piece up, packing it in my own material and getting it home, it did not fit.  I took the glass by Absolute Glass Service on Church and without an appointment or calling they had it cut correctly and the edges polished in five minutes for the whole sum of ten dollars.  I gave them a twenty for being so customer oriented.", "pics": null, "resp": null, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "102736638920765666128", "name": "rarbona 1029", "time": 1544929401497, "rating": 5.0, "text": "Measuments on my 3 pieces of glass were exact and consistant.", "pics": null, "resp": {"time": 1545936739214, "text": "Thank you for sharing your experience."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "116544580074979810927", "name": "Sean Tyler", "time": 1577162628131, "rating": 5.0, "text": "I love how I called an was in an out", "pics": null, "resp": {"time": 1577369769890, "text": "Thank you for sharing your experience Sean. We were happy to help!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "105260766089318237677", "name": "Baxter Bax", "time": 1552135309373, "rating": 4.0, "text": "All of your glass needs, fast too.", "pics": null, "resp": null, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "113946263352278771143", "name": "Stephanie Grayson", "time": 1553222114514, "rating": 5.0, "text": "Excellent customer service !! From placing the order to picking up my order - I couldn't have provided better customer service if I had done it myself.", "pics": null, "resp": {"time": 1553260311852, "text": "Thank you Stephanie for sharing your experience with Huntsville Glass. We are always happy to help with your glass needs."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "113548781979716413481", "name": "Curtis Lindsay Sr", "time": 1529692833510, "rating": 4.0, "text": "Friendly staff will go the extra mile to help you get the most for your money", "pics": null, "resp": null, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "105847324804520415986", "name": "Eric Ibarra", "time": 1458422610518, "rating": 3.0, "text": "Orders take a while, but the work seems good. They aren't open on weekends which makes it difficult to get in.", "pics": null, "resp": null, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "115857333678529987103", "name": "Da Hing", "time": 1540574442677, "rating": 4.0, "text": "Only dealt with front desk for a couple pieces of special cut glass. All went well, including courtesy phone call that order was ready.", "pics": null, "resp": {"time": 1545936862818, "text": "Thank you for sharing your experience. We are glad to have been able to help with your special cut glass."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "103399593414210718922", "name": "Daniel Callens", "time": 1522248010889, "rating": 1.0, "text": "Terrible attention. I would called \"lazy glass\"\n24 hs to cut 3 small rectangular pieces, because there is a lot of orders behind. And the glass cutters where in the front , elbows on the desk and nobody was working on the back! I made the same pieces after this experience on other company and I paid a third of the price !", "pics": null, "resp": null, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "117353345698617385405", "name": "Glen Hamrick", "time": 1507293729330, "rating": 5.0, "text": "Great service for an out of town visitor.", "pics": null, "resp": null, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "105334513067248821178", "name": "John Saeger", "time": 1579133954828, "rating": 5.0, "text": "Great place", "pics": null, "resp": {"time": 1579185453259, "text": "Thank you for sharing your experience John. We really appreciate your feedback!"}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "107729262705039371430", "name": "susie adams", "time": 1566158576540, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1566217084874, "text": "Thank you for sharing your experience Susie. We really appreciate the feedback."}, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "103149752610878155589", "name": "Walter Walker", "time": 1525956095201, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "110564407698752526821", "name": "Aly v", "time": 1485369012568, "rating": 5.0, "text": "Very quick and curteous", "pics": null, "resp": null, "gmap_id": "0x88626b5e4c2eed59:0xb3054d6f2ff51ed8"}
{"user_id": "109165970434733372522", "name": "debra79273234", "time": 1618527665583, "rating": 5.0, "text": "Highly recommend Cassidy Glass. Came to my work and replaced my windshield. Devin and Parker did a great job. Nice young men. The windshield sparkled when they finished! I will be a returning customer, if ever the need.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "102731016837400068202", "name": "Daniel Jackson", "time": 1614898321188, "rating": 5.0, "text": "They came to my job, just needed 2 parking spaces next to each other, was given a \"ball park\" time figure of when they would show and they showed up on time. Nice guy, explained everything...no complaints. i did price shop 2 places, these guys were the cheapest of the 2 for about $20. Will use again if the need arises.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "111589652439627904118", "name": "Stephanie Goodman", "time": 1620328406630, "rating": 5.0, "text": "Highly recommend. Devyn and Parker came to my work and replaced my windshield. Such nice young men. Parkers personality was a plus.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "113395625245407061093", "name": "Duy Le", "time": 1622995291966, "rating": 5.0, "text": "Fast quality work at a fraction of the cost compare to safe-lite.  Over 50% off!!!!", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "111714064384079909554", "name": "Gage McHenry", "time": 1607443875855, "rating": 5.0, "text": "Devon did great. He got out here on the Far East side of Tuscaloosa by 9:30am and was done in 30 minutes. They also did it for half the price that safelite said they would do, and they came to me. The service was quick and easy, and Devon was very nice and easy to communicate with. I will definitely be using this service again!", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "109613259577484256292", "name": "Pamela Colley", "time": 1618416005361, "rating": 5.0, "text": "Eric was vey professional and easy to talk too, very confident in his work.....@ keeping me informed..", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "111845551353158969096", "name": "David Lucas (Killing the Dragon)", "time": 1616527280242, "rating": 5.0, "text": "Very Professional treated my vechile like theirs.  If you need window work done couldn't recommend a better company price was very reasonable.  Called updates.  Will differently do business with again.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "114226207227850074664", "name": "Melisa Saville", "time": 1609893597015, "rating": 5.0, "text": "Fast, friendly and cheaper than any quote I got around town. Erick did a great job. I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "108347515510283055316", "name": "David Reich", "time": 1606503669295, "rating": 5.0, "text": "Great service. Service technician, Brandon Fulton, was professional and thorough. Great example of work ethic and pride in a job well done. I highly recommend using Cassidy.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "100176406872729364654", "name": "Nikkole/Ethan Melvin", "time": 1603929566180, "rating": 5.0, "text": "Top notch service and above quality product! They came to ME and replaced my busted windshield. Nice people and WONDERFUL prices!", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "108635222250389111107", "name": "Pam Townsend", "time": 1610749639329, "rating": 5.0, "text": "Repaired gasket over the windshield that had come loose.  They were friendly and very professional. My car looks great again. I will choose them again for any future repairs.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "109053698785181289853", "name": "Vonda", "time": 1613697617827, "rating": 5.0, "text": "I was very pleased with Cassidy Glass.  Brandon was very friendly, professional, and replaced the glass in my car window without a problem.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "113314284818142836783", "name": "Alisha Fulenwider", "time": 1611636368195, "rating": 5.0, "text": "Brandon is so gentle on our CLS63 AMG- I have called him twice to repair rock chips on the front windshield. He is detailed and makes certain the vehicle is taken care of, before leaving the job (even allowing alittle extra time to cure). If you have a luxury car and you’re scared to call someone besides the brand, I highly suggest Brandon, first!!", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "112711678749446807595", "name": "Rusty shackleford", "time": 1605123002933, "rating": 1.0, "text": "They did not install the window when promised. When it was installed they made a huge scratch in my paint on the roof. Not to mention the adhesive on my hood and cowling and to top it all off he didn’t even hook up the washer fluid lines to my wipers he disconnected. My advice stay far away from this company.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "100804407097119882923", "name": "Mike Curtis", "time": 1620417856975, "rating": 5.0, "text": "Nice job great price. Thanks 😀!!", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "115573210928557981065", "name": "Jody Payne", "time": 1596669281062, "rating": 5.0, "text": "Highly recommend and affordable. A++ service from the first phone call. Speedy service and the tech Brandon was knowledgeable and professional. Keep up the good work!", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "101972766934278453949", "name": "Ashley Lee", "time": 1597948002280, "rating": 5.0, "text": "Needed  a new windshield after buying a used vehicle. Brandon and Parker were extremely nice and thoughtful. They didn't even mind me watching the process. Would recommend 1,000 times over. I'd also request Brandon and Parker lol", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "104216901674514389629", "name": "SABINO MOTORS LLC", "time": 1616520912340, "rating": 5.0, "text": "Excelent service...highly recommend", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "104377975503760092340", "name": "Drew Sharpe", "time": 1594856244200, "rating": 5.0, "text": "Had an accident that busted out the back glass on my truck yesterday. Called Cassidy, went to their shop this morning at 8 am. After replacing the whole back window including the motor and fixing a windshield ping I was out $100.00 less that quoted at other shops and was at work by 9am! You can not ask for any more than that in a service company. Great job guys!!!", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "101009187115564074856", "name": "Catrina Black", "time": 1595537306642, "rating": 5.0, "text": "I have been using Cassidy Glass for years. They have always been courteous and provide great quality. There has been several times driving on I-65 North and my windshield gets popped around Fultondale (every time - not sure why that is).  I call Cassidy Glass and they meet me right away to catch the starburst on my windshield before it gets worse. Definitely recommend Cassidy Glass to be your windshield company!", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "110087553062023412307", "name": "Lily Pierson", "time": 1593036949436, "rating": 5.0, "text": "Brandon was great, he was very nice and accommadated to my needs. The installation was very fast and professional.I would recommend this company to anyone and will definitely use them again! Thank you", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "112294338396555025400", "name": "L.Mccall", "time": 1578158370252, "rating": 5.0, "text": "He replaced my windshield in less than 30 minutes and provided me some free glass cleaner to keep my glass streak free. The price was 100 dollars less than others around and offered convenient scheduling to to fix my windshield. He provided shelter to fix on a rainy day. Thanks Cassidy Glass!", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "108700960294994844581", "name": "jdblackbelt", "time": 1600442522476, "rating": 1.0, "text": "Their vehicles on I65 drive at literally over 100mph and swerve in and out of lanes without signaling. Be safe.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "108510516634484734205", "name": "Justin Oden", "time": 1595618228798, "rating": 5.0, "text": "Brandon and Trevor did and excellent, thorough, and timely replacement of our windshield. They came to where I was and were very professional. If you are on the fence about which company to choose, choose these guys!!", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "109198613340430789360", "name": "Jessica Oneman", "time": 1576099208348, "rating": 5.0, "text": "I Strongly recommend using Cassidy Glass for your Commercial 7 residential needs! they have replaced several of our work vehicle windows & a couple of my personal & families! They do a great  job!! They are so professional you almost forget they are there until you see your nice new window...  FYI the $ is pretty good also ! thanks Cassidy Glass y'all keep up the good work!", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "103617662114065866965", "name": "Angela Hardiman", "time": 1578087609871, "rating": 5.0, "text": "Eric installed the windshield in a very timely manner. He and his assistant were professional and courteous. I recommend using Cassidy Glass, Inc.\nNOTE: This is a man working hard for his own small business. This is not the larger chain glass company with the same name. Support small business owners like Eric!", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "111740228163574034451", "name": "Mark Criswell", "time": 1581542820567, "rating": 5.0, "text": "Eric was very knowledgeable. He answered all of my questions and knew his business. No leaks and a great price!", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "106636098289029942320", "name": "Donna Belter", "time": 1597169471061, "rating": 5.0, "text": "I might add that the owner has fired the undesirables in the past and he and his son did an awesome job. I would recommend again.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "108557297620994976581", "name": "joe kennel", "time": 1614177415721, "rating": 1.0, "text": "So far just rude encounters...", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "104440046689057178046", "name": "Kasey Graydon", "time": 1582743205669, "rating": 5.0, "text": "I have used Cassidy Glass for several years at my auto dealerships. They are always very helpful and make it happen in a timely manner. I definitely recommend using them for your next windshield.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "117071149432750824386", "name": "Gamble Services", "time": 1610324555371, "rating": 5.0, "text": "The only call you need to make.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "103105627099352288526", "name": "Patrice Ravizee", "time": 1581329713504, "rating": 5.0, "text": "Cassidy Glass is the best. I was not treated fairly by anther glass company but Erick at Cassidy took care of the problem by finding out why it was raining in my truck after the other company called themselves putting in a window in  Cassidy Glass found my problem and fixed. Erick treated me like family by going the back by find the problem , fixing it, and not taking me to the bank to do it.\nIf you have any glass need please call Cassidy Glass and you won't have to call anyone esle afterward. God bless you Erick (Cassidy Glass) !", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "115085028036640879711", "name": "Anthony Kiley", "time": 1576118721366, "rating": 5.0, "text": "Cassidy Glass has been the only company that would take on the job of replacing the front window of my Kenworth without having to remove the visors. They have done several of my vehicles and I’ve never had a problem.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "111781237525903221663", "name": "Larry Wood", "time": 1592430339004, "rating": 5.0, "text": "Great people. Great prices.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "108388716567310086259", "name": "Terri Culp", "time": 1597583750802, "rating": 5.0, "text": "On time and did a great job!", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "103597069868747632730", "name": "Mark Williams", "time": 1579750844031, "rating": 5.0, "text": "Cassidy glass has done several repairs for me and they have gone above and beyond to get my problems fixed. I highly recommend them for you next class problem", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "107097972418339380836", "name": "Bama Grill", "time": 1583427348180, "rating": 5.0, "text": "The price was great. Give them a call.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "106212191023286548424", "name": "Dustin Massey", "time": 1530291426891, "rating": 5.0, "text": "Thorough communication skills throughout the entire process. After having a bust in on my car, Derek at Cassidy Glass (who was recommended to me by the local Kia shop) gave me the most attention and treated me like I was his sole customer for the entire day. He was also very precise, knowledgeable, and gracious with my time. I think anyone who needs mobile glass repair should look at Cassidy Glass first.  Big fan, the repair looks fine too", "pics": null, "resp": {"time": 1569803408505, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "113716242239638967391", "name": "Louis Spano", "time": 1577731233188, "rating": 5.0, "text": "Great company ...on time and very professional job", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "101564644655264317591", "name": "Alabama Beaches", "time": 1583426248805, "rating": 5.0, "text": "Good experience. Good price. On time.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "106828194139262927448", "name": "Gideon W.", "time": 1605894350646, "rating": 5.0, "text": "Nice people!", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "112695731438455385076", "name": "J Wang", "time": 1537894070870, "rating": 5.0, "text": "This was for a cracked windshield replacement (2011 Toyota Prius) under insurance. Gave me a heads up as the arrival time over the phone so I could plan my morning, arrived at my location on time, performed the work expeditiously, and cleaned up thoroughly during and afterwards. Brandon was prompt, polite, and professional. Would do business again.", "pics": null, "resp": {"time": 1569803335532, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "109532041613419744314", "name": "GG", "time": 1516817841713, "rating": 5.0, "text": "I would highly recommend this company. The gentlemen who replaced my windshield was very polite and friendly. He replaced my windshield in a very timely manner and it looks very good.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "110065902589635163553", "name": "John Brown", "time": 1516948148210, "rating": 5.0, "text": "1/23/08\nVery professional. They did the job in very reasonable time. The job was done right and they cleaned up when done. The guy that put my 2001 tacoma windshield in was friendly and a pleasure to be around. He meet me at my location. By the way he was the owner of the company. Reasonable pricing.\nMy 2 ¢\nDavid Brown", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "105507263804212644297", "name": "Sheila haynes", "time": 1531234871987, "rating": 5.0, "text": "I loved Brandon and Corey!  Came when promised, very professional, performed at my workplace at a reasonable price.  Would use again!", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "103725572024924547455", "name": "Cori Crisson", "time": 1571073501213, "rating": 5.0, "text": "Awesome people and super fast service", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "106533867485419949287", "name": "Jenn G", "time": 1529694920295, "rating": 1.0, "text": "If I could give no stars I would. I called today to set up windshield replacement on two vehicles. The person who answered the phone was distracted (okay I can forgive that), but he was also rude. I expressed interest in paying the difference in order to get factory glass. I was told that would be a real fn problem because he was at the beach. I informed him to not bother, I would take my business elsewhere.\nI am a small business owner. I like to support other small business owners. I will not however give this person any of my hard earned money and neither should you.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "115744954657900094951", "name": "Derrick White", "time": 1532382199507, "rating": 5.0, "text": "Those guys rock. Super punctual and incredibly nice. Can't beat the prices either.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "112136138893380602952", "name": "CarNutz", "time": 1533654389967, "rating": 5.0, "text": "Awesome people, super nice guy fixed my cascadia window on the spot and I didn't have cash on me so he didn't even charge me, I cant thank you enoug.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "107966454426230816033", "name": "Kimberly Smith", "time": 1509050604658, "rating": 1.0, "text": "I wouldn't recommend this man to my worst enemy. After making different arrangements to work so he could have my truck to fix my window he never showed up. I called to see if he could come a time that was convenient for me this time since he never showed up when i went out of my way for him and I was cussed out like a dog. This guys has no customer service and doesn't care who he offends in the process.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "118205131962026597330", "name": "Brandon Fulton", "time": 1527339685064, "rating": 5.0, "text": "Great place to have your glass replaced!! Great ppl great work and low prices", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "101221444048595369702", "name": "aaron rothe", "time": 1527099745086, "rating": 5.0, "text": "I’ve meet the owner several times he’s a great person, he’s the type to go out of his why for you . I don’t believe any of the reviews that claim he cussed them or was rude . Sounds like someone in the business trying to make him look bad . Use them you won’t be disappointed", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "110404199960571099421", "name": "Doug 9044", "time": 1503751317030, "rating": 1.0, "text": "I contacted these guys to install the rear glass and a new windshield in my 93' Toyota Paseo, nothing out of the ordinary. They come out during normal business hours so I was unable to be there but I had my father let them into my garage. The guy called me and said he's never seen this type of car and he was \" pretty sure\" he could put the front windshield in right but knew he could do the back. I just told him not to install the front since he had no clue what to do. Then he install the rear with their universal molding, which is fine since Toyota didn't have it available anymore.\nI got home and looked over the job, it was horrible. He had installed the rear windshield way out of sort, it wasn't positioned in the opening evenly as it is extremely too far forward, to the point that there's a 3/4 inch gap at the bottom. Even with the gap they only installed their molding around the top and two sides leaving the huge gap in plain sight.\nI called the owner the next day and he was horribly rude, told me he wouldn't come back and to take it to a paseo specialist. Clearly I took it to a hack.\nI wouldn't recommend this company to my worst enemy, not only do they perform poor installations they owner has a filthy mouth when speaking to you about it.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "113323086355493549892", "name": "kay martin", "time": 1499635426234, "rating": 5.0, "text": "Mr Cassidy and his son came to my house but had the wrong glass but the next day it was raining  so I went to Mr Cassidy's house and he installed my windshield both Mr Cassidy and his son were very nice and professional. I would highly recommend Cassidy Glass great price and service", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "111457538459138685061", "name": "lady foxx", "time": 1529078803313, "rating": 1.0, "text": "Cassidy gas no idea how to conduct buisness he is also a liar i called to get a price check on my car he told 165 when i called back to get the service he then told me over 200 i also rried to call the day before like he he rold me to with no return call and no one answered the phone i will taking my car else where for service i would strongley reccomend some place else", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "117455815820647661219", "name": "Harrietta Mitchell", "time": 1572818129337, "rating": 5.0, "text": "Really fast service", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "117195542542050165168", "name": "Connor Gaston", "time": 1413335720737, "rating": 1.0, "text": "They replaced glass on both of my cars. One car wasn't a problem. My SUV was more difficult. I asked for good quality glass and I'm not exactly sure what I got.\nI wanted the glass installed following the instructions spelled out in the factory Service Manual. When I would explain to the installers how it NEEDED to be done they pushed back by saying that was not necessary. My SUV has a specific way to install the windshield that is out of the ordinary. If steps aren't followed then its going to leak. They assured me that it wouldn't leak the way they did it and I really did not want to put that to the test with their way of doing it. I supplied my own new factory gasket for the job. If I had not had that they would have reused the 20 year old gasket that was glued to the old windshield. The manual says to use a NEW gasket.\n\nAll the glass installers I have delt with to get this done have just about all been the same. They are payed by they job and want to get done and on to the next job. I care about my car and if I'm gong to pay to have this done I want it done right. As the customer they need to consider that I probably have a good idea what I'm talking about and should listen and absorb what I'm telling them because I didn't want it to leak and I know they didn't want to have to come back and fix it.\n\nMy experience with the installers that came today was the reason for the bad rating. I don't appreciate their attitude towards my instructions I had for them.  I walked inside to get cash to pay them while they were working and quietly came back outside to hear them talking about me and how I was trying to micromanage them.  One of the guys actually told me he could see why they other companies didn't want to do the job. Which was a rude thing to say. He couldn't handle I wanted things done a certain way (the correct way).\n\nI'm sure most windshields are simple and easy to replace. If you have any specifics on how your car windshield should be done like I did then skip this company. Along with Cassady and Self. They were worse.", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "109977663668593152274", "name": "Anthony Caminiti", "time": 1527280854952, "rating": 5.0, "text": "Brandon managed to fix a problem in a matter of minutes that others refused to touch!!! Awesome job!!!", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "105184846847131232693", "name": "Ed Thomas", "time": 1543970675628, "rating": 5.0, "text": "Very professional, and timely", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "109547182390159187729", "name": "kory Nicholas", "time": 1509041066908, "rating": 1.0, "text": "He never showed up and when I tried to give him a chance to redeem himself he just cussed me out and was the most unprofessional person I have ever had the displeasure of dealing with", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "108278481545335789382", "name": "Tucker Cassidy", "time": 1482261857714, "rating": 5.0, "text": "Amazing", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "104820951804327225528", "name": "Robert Craft", "time": 1509825262939, "rating": 1.0, "text": "(Translated by Google) Stay away, he pane off\n\n(Original)\nStay away, he rude af", "pics": null, "resp": null, "gmap_id": "0x888901976e6521ff:0x23df663e0fa70098"}
{"user_id": "102796355603970432522", "name": "Shane Snyder", "time": 1611090785504, "rating": 5.0, "text": "Great service, great pricing, and great work! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "108351788759812065730", "name": "Karen Walker", "time": 1606348911532, "rating": 5.0, "text": "Very impressed, so friendly,I was  dealing with the haul side ,I will go back", "pics": null, "resp": {"time": 1606349685344, "text": "Thank you, ma'am. We appreciate you and your husband's business."}, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "108004663394765582141", "name": "Jerry Brightwell", "time": 1620605857999, "rating": 5.0, "text": "Good folks", "pics": null, "resp": null, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "108640086051477551674", "name": "Phil Walker", "time": 1606857280713, "rating": 5.0, "text": "Great ,I rented here ,the best", "pics": null, "resp": null, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "111510929471728807577", "name": "Justin Oneal", "time": 1561833693920, "rating": 5.0, "text": "I had A1 tint a couple of windshields for me and they turned out perfect. His prices are great and his service was fast. A+", "pics": null, "resp": {"time": 1561834871207, "text": "Thank you, we appreciate your business."}, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "110414676029988183432", "name": "Antonio Wilcher", "time": 1587047086625, "rating": 5.0, "text": "Great Guy!! Reasonable price lifetime warranty is amazing!", "pics": null, "resp": null, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "105769463504575671007", "name": "Lynn Alexander", "time": 1518554866251, "rating": 5.0, "text": "You want a great tint job!? Exceptional customer service!? Great prices!? With a friendly atmosphere!? A1 Jasper Tint is where you need to go! The men, who run the shop, have an eye for detail! You will NEVER walk out dissatisfied!! Highly suggested!!", "pics": null, "resp": {"time": 1518555999740, "text": "Thanks!"}, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "110356883841300175950", "name": "Jared Cook", "time": 1598113519071, "rating": 5.0, "text": "Friendly people helpful and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "110619095455973840155", "name": "buddy smith", "time": 1554008734838, "rating": 5.0, "text": "Awsome people and great service very pleased with the quality of work", "pics": null, "resp": null, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "118168700799154081437", "name": "Rhet Christmas", "time": 1562956429975, "rating": 5.0, "text": "I agree...wonderful people.", "pics": null, "resp": null, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "112244656510287476474", "name": "Jennifer Cain", "time": 1518568628541, "rating": 5.0, "text": "Exceptional work!! Great shop! Go see them for all your tint work", "pics": null, "resp": {"time": 1518976061965, "text": "Thank you for your business."}, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "115081704722743783516", "name": "Linda Sides", "time": 1563907008875, "rating": 5.0, "text": "Good wo4k, honest & dependable.", "pics": null, "resp": null, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "117980170583819189143", "name": "Jay Boldt", "time": 1560467622529, "rating": 5.0, "text": "Great place great people.", "pics": null, "resp": null, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "110460377467663280397", "name": "Stone TheBoi", "time": 1518571099683, "rating": 5.0, "text": "Great work and excellent customer service! Definitely recommend to everyone!", "pics": null, "resp": {"time": 1518976053804, "text": "Thank you for your business."}, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "110258031406225661614", "name": "Christopher Kerns", "time": 1518565570701, "rating": 5.0, "text": "Quality work and professional atmosphere I would highly recommend  A-1 Jasper Tint to anyone👍", "pics": null, "resp": {"time": 1518976072187, "text": "Thank you for your business."}, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "105633208760652082170", "name": "Brian Wiggins", "time": 1567438396825, "rating": 5.0, "text": "Quality customer service.", "pics": null, "resp": {"time": 1567646868433, "text": "Thank you."}, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "111566394117151906131", "name": "Kimberly Lindsley", "time": 1518594815489, "rating": 5.0, "text": "For great customer service please go visit the guys", "pics": null, "resp": {"time": 1518976033167, "text": "Thank you for your business."}, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "100564685714318711153", "name": "David Lay", "time": 1552346116019, "rating": 5.0, "text": "Good work and fast service.", "pics": null, "resp": null, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "101924754308269261283", "name": "Angela Wiley", "time": 1581280166899, "rating": 5.0, "text": "Great Friendly Service", "pics": null, "resp": null, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "114170280235078698069", "name": "Kipp Allred", "time": 1561947130227, "rating": 5.0, "text": "Great service and great job", "pics": null, "resp": null, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "106767098378792958256", "name": "Natasha Stewart", "time": 1518562815064, "rating": 5.0, "text": "These guys know what they are doing.  They get the job done right!", "pics": null, "resp": {"time": 1518976080782, "text": "Thank you for your business."}, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "111132456672085067748", "name": "The Kennel House Club", "time": 1525430129074, "rating": 5.0, "text": "Great work and stand up owners.", "pics": null, "resp": null, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "113205277067169576061", "name": "Libbie Hartley", "time": 1518594717624, "rating": 5.0, "text": "For a great tint job check A1 tint", "pics": null, "resp": {"time": 1518976042642, "text": "Thank you for your business."}, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "100721763382406960623", "name": "Hezie Guyton", "time": 1569346527734, "rating": 5.0, "text": "Those guys are all over it", "pics": null, "resp": null, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "113971882593396896113", "name": "Barbara Haynes", "time": 1577505849675, "rating": 5.0, "text": "Great work!!!", "pics": null, "resp": null, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
{"user_id": "113479682739389334753", "name": "Rick Taylor", "time": 1536931203703, "rating": 5.0, "text": "Great job", "pics": null, "resp": null, "gmap_id": "0x8888611e95906395:0x5c8f349bf6daa0d6"}
