{"user_id": "107468981687777212947", "name": "Anne Martin", "time": 1607086019294, "rating": 3.0, "text": "This Wine boutique is a great addition to Pour Baby. The boutique/ gift shop is a very welcoming space, bright and open.\n\nI arrived with ideas to purchase but the customer service was limited. After more than few minutes, someone asked if I needed assistance and unfortunately, it was a bit rushed. They were working with another customer when they asked.\n\nI wandered around the store, I think, about 10 - 15 minutes. I didn't have a lot of time, so I wasn't able to wait until they finished with the other customer.  There was only one person available for customer service, but it looked as though they were preparing for an event, I saw tables outside and the door was open when I arrived.\n\nThere's an array of wines, gourmet food and truffles just to name a few reasons to check this place out. I had my eye on a couple of things so I'll definitely be back when I have time to linger and browse.\n\nI didn't have an opportunity to ask about the wine tastings or the personal consults for gift baskets because of the limited service. It's easy enough to check their website for the classes and there's plenty of time to check back for basket ideas.\n\nIt's a great place to get gifts for family, friends or co-workers.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM-5ZFNFaapcS3tx93Ruwhux7aE_N2RXgEjO_qq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOtah4rBijkCp_Kp3rk7tm0VKeGaj1qAJRBdvYV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP32NkXSmibKvHUPr8KzEDEsNkMe9deczmAydGR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPa_k7YsM3aJCMZIe4CducOPwxZ0WHSMh22YtZy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM6gHyv2WISwD8cGd_PseUxk-cgcRT4LUKglDiZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMNuXbKDvNmz5w38LaQ-pEEFdeCWrh9Us8TAoY6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNvkUGT2Ka65vOyMekjnkgv7ImjIHq9L7oBgGBw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMetblD9v_JvFIi3ZyMGfW6Zo-V2YhPSPbL1cij=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMmoYQjxT4-WaomrWMUblTmd61z4VaVqbRnUxgK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOav1b93YvXmcQ0Hb-D6er4jmoJKA0aId1GgZPo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMKhnkiZMImx7PcA-RKCCWp_AqdYVvWa8mXlndP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipODZl1hLyM3im5JjbrvTZ4JEGpsqMTWSNmB4Gp-=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb32c0847c87b:0x6354c7ecf71c4ea4"}
{"user_id": "104954698127403728626", "name": "C Lynn", "time": 1577725393351, "rating": 3.0, "text": "The hours are very tight if you work until 5pm, I was excited to go in on my off day friday but was turned away by a frowning lady saying they were closed. The hours on the door showed open 10am-6pm with no closed notification there or on social media/google? A disappointment for sure but will try again another day and hope they are open.", "pics": null, "resp": null, "gmap_id": "0x889bb32c0847c87b:0x6354c7ecf71c4ea4"}
{"user_id": "112418470332960095777", "name": "Dyann Munoz", "time": 1559873256109, "rating": 5.0, "text": "My friend and I try to attend every wine pairing they offer.  So fun.  So beautifully presented and Lavone does an amazing job of selecting and prepairing the most wonderful cheese boards, salads and lovely bites.  It's a full sensory experience.  Looking forward to the next one.", "pics": null, "resp": null, "gmap_id": "0x889bb32c0847c87b:0x6354c7ecf71c4ea4"}
{"user_id": "116781036626386718424", "name": "Vicki Nicholas", "time": 1575643684232, "rating": 5.0, "text": "My new favorite place. So friendly and helpful.", "pics": null, "resp": {"time": 1575905604106, "text": "Thank you so much for the kind words! We look forward to seeing you again soon!"}, "gmap_id": "0x889bb32c0847c87b:0x6354c7ecf71c4ea4"}
{"user_id": "102815631413545269639", "name": "Karen Cormier", "time": 1558827302554, "rating": 4.0, "text": "They have a nice selection of balsamic vinegars and flavored olive oils.  Lots of gift items and wines.", "pics": null, "resp": null, "gmap_id": "0x889bb32c0847c87b:0x6354c7ecf71c4ea4"}
{"user_id": "101741119532894049792", "name": "Danny Milligan", "time": 1626832364205, "rating": 4.0, "text": "No issues here other than they did not have the type of trees we were looking for. They were very busy and it took a few minutes to get help but when we did they were very friendly and helpful. I may be checking back with him on some trees and will update accordingly.", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "106367547065135486293", "name": "Rachel Finner", "time": 1620504617470, "rating": 4.0, "text": "It was a great day for a bike ride.  Beautiful flowers,  friendly people and service at trade days.  We will definitely be back soon.", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "100981765284599850142", "name": "Trae Otwell", "time": 1625845064653, "rating": 5.0, "text": "Great local business with very friendly  staff.", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "100482401272500010586", "name": "Jami Powers", "time": 1616272896061, "rating": 5.0, "text": "Great selection of local items.", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "112759328471125639874", "name": "Brittany Windham", "time": 1590265794333, "rating": 5.0, "text": "The staff here is very friendly, love having a local shop that supports other local sellers and craftsman. Such a pleasure and always nice varieties of items for gifts also. Fresh produce and plants galore. 😍", "pics": null, "resp": {"time": 1590272928390, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "111665168328261853034", "name": "Derek Ried", "time": 1601580426531, "rating": 5.0, "text": "Great place! I love to buy plants and soil there.", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "103373153066407071813", "name": "Lori Covington-Strouss", "time": 1608408592532, "rating": 5.0, "text": "I always enjoy the garden market. !", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "113272776509253741993", "name": "Neisha Dorantes", "time": 1587592050241, "rating": 1.0, "text": "We have been so happy to support this shop since they opened. The guy owner is very nice, the lady however is very rude and has a temper. She came up behind me yelling at my daughter and I, made me jump off the ground startling me. We were doing nothing deserving of this behavior. Did it make you feel good yelling at my autistic daughter?", "pics": null, "resp": {"time": 1587599645447, "text": "Ma'am, no one yelled at your daughter. We only requested that you and your daughter leave the bird's nest undisturbed (I even said \"please\"), because often a mother bird will not return to a nest which has been disturbed. We respect that we share our outdoor space with the local wildlife, and we just don't want the baby birds to die. We want everyone who visits our store to feel welcome, people and wildlife."}, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "117512965993065586282", "name": "Mike Weathers", "time": 1592096001613, "rating": 5.0, "text": "This is a cool place.what a variety of goods.everyone needs to stop n check it out", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "101322525306646343161", "name": "jason cobb", "time": 1613864486937, "rating": 5.0, "text": "Great people to  shop with", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "112376839297593451644", "name": "Rebecca Macks", "time": 1573678922276, "rating": 5.0, "text": "awesome place, very clean and an amazing collection of interesting food items", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "100062114960308825772", "name": "Angela Boackle", "time": 1591462840725, "rating": 5.0, "text": "My favorite place to shop", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "112368767078718935065", "name": "justin martnez", "time": 1590446779957, "rating": 5.0, "text": "(Translated by Google) Many pretty plants\n\n(Original)\nMuchas plantas bonitas", "pics": null, "resp": null, "gmap_id": "0x8889294535d1321b:0x865fc2453bdb13a4"}
{"user_id": "105429570858358896295", "name": "Rachelle Wallace", "time": 1590607156658, "rating": 1.0, "text": "Not very wise.  I was just refused service because I didn't have a mask.  As a chronic asthma sufferer I can't breathe in a mask that is effective against this virus.  I used to live in Montgomery and shop here all the time.  I  came to town for boot repair and was going to shop but you lost me for good.", "pics": null, "resp": {"time": 1590774566772, "text": "Hello Rachelle - I couldn't agree more sincerely with you that it is \"not very wise\" - that is your statement, for you, it you do have chronic asthma, to be out and about in this possibly infectious time without some type of facial covering.\n\nIn no way has it been verbally stated, written or implied that someone has to wear an n95 procedural or surgical mask to enter. Our sign, placed in front of the door where you actually have to read it and go around it to access the door states, and I quote exactly: \"ATTENTION - IF YOU DO NOT HAVE A MASK OR FACIAL COVERING, PLEASE STAY OUTSIDE. WE WILL CURBSIDE YOUR ORDER. CALL 334-277-9925.\n\nThe sign also states: \"DUE TO THE RISK OF CONTAMINATION, ALL SALES ARE FINAL - NO REFUNDS.\"\n\nYou were not refused service as you have incorrectly stated - you were refused entrance to the INSIDE of our business since you had no facial covering. You were given the option to our curb side service - which you refused to take advantage of. We provide a nice, socially distanced safe outside sitting area for those without masks or facial coverings to use. We actually have a large amount of customers who prefer the outdoor curbside service and delivery option.\n\nWe require this of everyone - regardless of race, color, gender, religious or political orientation. Why you consider yourself some elite exception in that you feel that you have some special entitlement, are better than all our other customers,  and can disregard our store policy, which has been in effect for many months now, I do not know - and there are no exceptions to our store entrance policy. We are a privately owned and operated local, family business - and we set the store policy here.\n\nYou are not entitled or above all our other customers who follow the store policy and are very, very happy to be able to shop in such a sanitary, healthy and very friendly 32+ year service and community oriented business\n\nAll of us wear our correct facial coverings all day long. We do take short breaks from wearing the coverings when not in the store to allow for C02 reduction and etc - but are right back on when back inside the store.\n\nFunny, but no one here remembers anyone of your mask intolerance issue trying to come in. What ever - there is an outside curbside service area for those reading this post who may have some type of facial mask/covering issue that can benefit from this incident, and know there is an outside curbside service option for them.\n\nWe  hope you find your happy place to shop. We are extremely busy assisting our correctly attired and extremely satisfied multi-generational customers."}, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "111853014944006559745", "name": "Ty Callahan", "time": 1588172010313, "rating": 1.0, "text": "Although the products can sell themselves employees aren't friendly at all and even if you're spending a lot of money they will give you the wrong item and when you correct them they will try to tell you what THEY use... Like no I asked for this kind and I'm paying. NOW you wanna tell me what you use. Felt like a drug deal or something. Poor customer service maybe racist/biased, I don't know but I know I  felt my business was NOT appreciated will DEFINITELY go somewhere else going forward. Edit: And  I didnt look for manager or ask for names as from atmosphere from the particular employee i was immediately turned off.. And as someone cleverly cross-examines me as \"reply\" from \"management\" below I don't feel any different from my experience prior.", "pics": null, "resp": {"time": 1588165970816, "text": "Hello Ty...have no idea what you were looking for since you weren't working with either me, Willard or Matt...who are the upper management and who one should go to if there is some issue that didn't meet your expectations...you obviously don't frequent our store to know our 30 plus years and history offering 3 generations of persons of all races, religions, orientations and etc to even use the racial bias statement. Since you did not attempt to speak with myself, Willard or Matt...and discuss your issue...that makes it difficult to know and understand your statements...our 3 generational loyal and very appreciative customers know from long term experience that we are a caring business that serves persons of all colors, or whatever differences with equal appreciation and attention...the young cash register clerks are nothing but that and are not meant to give advise or tips on anything other than where products are and to assist you in the checkout process...questions over and above that level should be directed to the management level if seeking advise of any kind...we apoligise in advance if your experience was not what you were looking for, and wish you health and wellness, and we hope you find your happiness in shopping where you so choose...racial bias is not a practise allowed at our business. We wouldn't have been in business for 32 years in Montgomery Alabama where at least half of our customer base are persons of color and different cultural and religious persuasions...also...in closing...let me thank you for your review and any other similar post claiming an inequity or racial bias...your post has actually brought in even more business from our cutomer base calling and coming in to shop and support our loving and caring business even more...best free advertising in a while...so many thanks again..."}, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "100752320602966531164", "name": "Shenee Furr", "time": 1587848605564, "rating": 5.0, "text": "Steve is amazing he had no problem with help my mom and I find items we were looking for ...Thanks Steve..", "pics": null, "resp": {"time": 1588163241699, "text": "Thank You Shenee for your post! We try out best to help each and everyone we can! Stay safe!"}, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "107808290308255291653", "name": "Rosemary Perdue", "time": 1590947777207, "rating": 5.0, "text": "i have been doing business with Health Wise Foods since 2010 when i discovered the store while taking Hot Yoga classes in the basement.  Then when i got sick.... i became a frequent customer.  The owners, Management and staff have all been supportive, friendly, professional and knowledgeable throughout my journey.  They have been in business 30 years, and have never exhibited any prejudice against anyone.  I was homeless 18  months and they knew it, and helped me to get the best products for my needs to keep me functioning during that time.\n\nDue to my chronic babesia flares,  i have been unable to wear a mask during the ongoing pandemic, and all of the staff have been very helpful getting my products and bringing  them out to my vehicle.  I love the fact that they care about their customers and have gone above and beyond during this time to make sure that those of us who are immune compromised have the natural treatments we need even if we are unable to wear a mask.\n\nAdditionally, i love their knowledge.  When i have a weird symptom that im not sure what to do about, they give me suggestions, as well as warnings on contraindications. Both in person and via Facebook.   Healthwise is where i send everyone!", "pics": null, "resp": {"time": 1591030553876, "text": "Thank You so much for your review Rosemary! You have come along way on your life's journey living with Lyme's and I am so proud to see how much you've learned and shared with so many others dealing with the many trials that come along with it. I enjoy our frequent talks and updates both in person and on FB...and we've had  quite a few over the years! Hopefully we won't have to deal with face mask issues for too much longer...I guess time and common sense will tell. Let me know how your doing with the Kroger Kit protocol. Thanks again for being such a great role model for those with Lyme!"}, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "102527333420264086325", "name": "Dora J Crow", "time": 1591047032145, "rating": 5.0, "text": "I’ve been shopping at Healthwise for many years, since way before they expanded. I’ve seen them grow into a welcome presence in the natural homeopathic all in one stop shop they are today. They offer so much more than vitamins & minerals. Fresh organic sustainable food, and dry goods that rival any large grocery store. I’ve bought probiotics, prebiotics, vitamins, minerals, alkaline water and so much more. They offer local products too, like honey and candles. The personalized one on one service they offer is above and beyond any local store. They are kind, compassionate and helpful to anyone asking questions when faced with so many choices. Anything and everything they ever suggested for me helped me so much. Now, with the Covid-19, they are asking people to wear masks in the store or plan to call ahead and order what you need and they will bring it out to you, curbside. People complaining they cannot wear a mask have the alternative to call from their car, make an order and literally in seconds they bring it to your car. I also have health issues where I cannot breath if I wear a mask. I ordered a couple minutes before reaching their store and had my purchase soon as I pulled into the parking lot. I don’t understand people thinking the store staff try to push only the products that they use themselves. They have not done that to me in all my times in store. Well. That doesn’t include the time they suggested some tasty tea, though. All in all, there’s not another place around that offers what Healthwise Foods does. Check them out for yourself. Call or visit them today! Check out their local honey and candles!", "pics": null, "resp": {"time": 1591066930166, "text": "Thank You Dora for your great review! We appreciate you sharing your experiences while shopping with us for the many years we've had the pleasure of assisting you. I am so glad you mentioned the outside curbservice available for those who either forgot their facial covering or have some issue where they can't tolerate the mask for certain reasons. Will be glad when the new batches of honey become available soon. The candles are such a nice product to have on hand for your own enjoyment or as great gifts...made from the beeswax that the honey comes from at Sweet Bee. Very green oriented to not waste the beeswax and make a great product at the same time! Thanks again for sharing your experiences and helping with the awareness of the common sense in using a facial covering at this time!"}, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "113325685128011902370", "name": "Pam Lowe", "time": 1580827052804, "rating": 5.0, "text": "They are knowledgeable, helpful, and friendly. I trust the products they carry. I have always gotten sound direction in a variety of questions.", "pics": null, "resp": {"time": 1588166221937, "text": "Thank you for your review Pam...appreciate you!"}, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "117862776900653688431", "name": "Lizzy Gray", "time": 1572706685849, "rating": 5.0, "text": "Excellent place to shop, if they dont have what you need they will shop around to find it for.", "pics": null, "resp": {"time": 1588166399054, "text": "Thank you for your wonderful and positive post!"}, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "109418657928759327149", "name": "Debbie Fulton", "time": 1544244537222, "rating": 5.0, "text": "I love Health Wise Foods! The staff is very knowledgeable about their products.  Always very friendly.  I'll try to remember to take a picture the next time I go in.", "pics": null, "resp": {"time": 1588170519711, "text": "Thank you Debbie for your 5 star review,  we appreciate you!"}, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "101652635744049485614", "name": "Roger Rodgers", "time": 1559440390939, "rating": 5.0, "text": "Always great service  Willard and Steve are very knowledgeable  about every item they carry", "pics": null, "resp": {"time": 1561066610916, "text": "Thank you Roger for your 5 star review, we appreciate you and all the great technical computer assistance yall have helped us with both at the store and at home!"}, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "115130806657375671164", "name": "Kyle Mathews", "time": 1555869615783, "rating": 5.0, "text": "Provides the absolute highest quality of foods and herbs in the city and more than likely the whole state", "pics": null, "resp": {"time": 1588170745165, "text": "Thank you Kyle for your 5 star review, we appreciate you! Hope you all are doing wonderful and staying safe and healthy!"}, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "116592232854268512116", "name": "Alek Arcane", "time": 1486835469491, "rating": 5.0, "text": "Been going here for 18+ years. Healthwise has always been a great store. Great selection, and if they don't have something they will get it.", "pics": null, "resp": null, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "113466331260366333573", "name": "James Keller", "time": 1530127534743, "rating": 5.0, "text": "The owners and staff are very knowledgeable and helpful! I totally recommend them.", "pics": null, "resp": {"time": 1588170407358, "text": "Thank you James for your 5 star review...we appreciate you! Hope the bees are working hard on making us some of your great Sweet Bee honey!"}, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "109747690899803434073", "name": "The Chavah Black", "time": 1522012663872, "rating": 5.0, "text": "Informative down home good people.", "pics": null, "resp": {"time": 1588171200761, "text": "Thank you Jessica for your 5 star review, we appreciate you!"}, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "116698174237850236324", "name": "Danny Randolph", "time": 1473111214883, "rating": 5.0, "text": "If you are serious about your health you need not go anywhere else. Healthwise is the store you have been searching for!\n\nI have shopped at Healthwise for over 15 years. The owners stay on the leading edge of knowledge related to health and nutrition. They are always available to assist you with answering your questions. They have never rushed me and they take the time to answer all my questions. I trust them for their extensive knowledge of nutritional and holistic treatments and practices.\n\nAdditionally, I trust them to validate and verify that their suppliers are actually providing the product identified on the package. Many large chain stores and grocery stores sell brands that are nothing but sawdust and powder. You can be confident you are getting the product on the label. They also sell grass-fed beef and other meat products that are healthy for you -- not full of hormones and antibiotics.\n\nThe owners require their staff members to train on which herbs or supplements would be the best solution to address whatever health condition you are trying to treat. The staff is very friendly and they are right there to help you if you have a health related question, or you can't find a product you are looking for.\n\nI realize the are other health stores in the local marketplace. I have stepped into some of them as I was driving around town. I was curious about their knowledge of health and nutrition, the suppliers they purchased from, and the prices they were charging for the different products I regularly purchase. I could not find any store who could match the knowledge of owners and staff at Healthwise. The range of products were usually not as extensive as Healthwise and the prices were comparable to Healthwise.\n\nI trust the owners of Healthwise and the quality of the products they sell. I will continue to purchase my health related items from them!", "pics": null, "resp": null, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "108139283803043439577", "name": "Rebecca", "time": 1491001026865, "rating": 5.0, "text": "Very informative.", "pics": null, "resp": null, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "102534595825654564016", "name": "Boyd ANDERSON", "time": 1474840597556, "rating": 5.0, "text": "Best ever!", "pics": null, "resp": null, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "118110165750670892028", "name": "Hosheyah Yisrael", "time": 1493928876928, "rating": 5.0, "text": "Awesome", "pics": null, "resp": {"time": 1588171317678, "text": "Thank you Hosheyah for your 5 star review, we appreciate your post!"}, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "106979149559681703193", "name": "BYRDIE Yeah", "time": 1485013279835, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "117022149504213889574", "name": "Dennis Montgomery", "time": 1487865354814, "rating": 3.0, "text": "Availability", "pics": null, "resp": null, "gmap_id": "0x888c2a2e56267227:0xff334b082af99c2c"}
{"user_id": "113228031789311121840", "name": "Wesley Ransom", "time": 1623235783593, "rating": 5.0, "text": "Absolutely the best steaks you can buy. Little pricey but you will realize it's worth every penny after you take it off the grill. Be sure to get the finishing butter also.", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "117416155803327130717", "name": "Julia Peart", "time": 1554516453285, "rating": 5.0, "text": "We really enjoyed our lunch. The meatloaf sandwich and Turkey club were so fresh and good...service is awesome, oh and we bought a huge loaf of bread to take home!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPTGGLVfI-cvuq3UWBWx7Pje65cQ74scS7WZJuP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP4B7kiUhnyrhWFwKmbVMB5cd6EmWcjEJgYp6tq=w150-h150-k-no-p"]}], "resp": {"time": 1554732177897, "text": "We're so glad you enjoyed your visit! Please stop by again soon!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "110852571980153445951", "name": "Gary Rush", "time": 1620340045009, "rating": 5.0, "text": "Great food and great service. Environment is fun and staff make sure your satisfied with your order. First time visit, but will definitely return.", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "101810580357671867036", "name": "Kim Ouellette", "time": 1616029649627, "rating": 5.0, "text": "The Italian sandwich is so good ( I heat it up)   big enough for two meals.   I love the crown filets...they cook up nicely and melt in your mouth.  Service with a smile.", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "111042857403207248276", "name": "Danny Neaves", "time": 1567192807560, "rating": 5.0, "text": "Okay, I've heard a little bit about this place from word of mouth. Didn't realize they prepared food for you to eat on site. I thought they were only a butcher shop type of grocery store. They are a restaurant, and that is why I came by to try them out. I had a burger, and wow it was really good. It is a big burger, fresh, thick, and juicy. There are other sandwich style meals they offer with a variety of different meats and veggies. I will be back to get some cuts of meat to try out and to try some of the other sandwiches too. I have only had it the one time, but I would recommend it based on what I have had so far. Looking forward to trying some other stuff too!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMz_eDMemmTt04ejmWvlu8yOcPo-UEJ5yYujWIj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNIOsBGZEcnQKwiM7a1FKumxOvD9xUzLex_T8_7=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO-EEvwveoWRNj7ntWgjTLCTlVrAIveYK8kUgjk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM59gSs62OSzNh4Z0tuegq2iWsjpjn5y478er0D=w150-h150-k-no-p"]}], "resp": {"time": 1567195681430, "text": "Thanks for stopping in to check us out! We’re so glad you enjoyed your burger and hope you’ll stop back in again soon!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "114737031268591142249", "name": "Tim Lowe", "time": 1613763754689, "rating": 5.0, "text": "I drove through today to get lunch.  This cheeseburger is solid.  The people here are so nice, too.  I'm gonna make it a point to drive through here more often.", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "106989991718181837900", "name": "jettt111", "time": 1599678343092, "rating": 5.0, "text": "We just had the Italian hoagies ( with their fresh made bread ) and heated up. It was the best sandwich I’ve ever had. Way more quality Meat and flavors than subway , I’ll get the hamburger next time. It’s unlike any other around", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "118128475499413059541", "name": "pJ Smitherman", "time": 1614381824751, "rating": 2.0, "text": "The price for two usda prime filets was very high, considering I was unable to taste a difference from that of a grocery store chain usda prime steak. I overpaid expecting a better steak and was let down. Cant say I would make the trip to smiley brothers again. Staff was friendly but for $60 a lb I’ll try somewhere else next time.", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "112814778237741877000", "name": "Cre Hill", "time": 1563739467405, "rating": 5.0, "text": "Best Burger I’ve had in a long time!! Fresh, seasoned and of great quality!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOj7C_kPm8UknhGupSvNQf1tZ3nrxrIvmBRVL6j=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMIxY7u5mKEKT-6e3CEgj_SUSRTXsJvwUTqFcj9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPYwDPjqIA6NIjryLdReTNx8blPcL2ANxPT_ZjZ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "104837000179851236448", "name": "Julian king", "time": 1595102096025, "rating": 5.0, "text": "Food is amazing. Service is impeccable. Not many places you go to that the owner is working the drive thru and greeting everyone. Highly recommend.", "pics": null, "resp": {"time": 1598537899860, "text": "Thank you so much for your kind words Julian! We hope to see you again soon!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "118330602737433284474", "name": "Cindy McRee", "time": 1579451083949, "rating": 5.0, "text": "What a unique find! Dryed, aged beef! Unique cheeses you cannot hardly get anywhere else. Too many unique homemade items to mention such as pickles, sauerkraut, breads, etc. As must for an early evening of a glass of wine, a few cheeses, sliced meats and quality conversation with a friend or significant other.", "pics": null, "resp": {"time": 1580578241211, "text": "Thanks so much Cindy! We hope you’ll visit again soon :)"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "113278020854251842032", "name": "Life Is Brewtiful", "time": 1528858955452, "rating": 5.0, "text": "I absolutely loved this place! The owner and sous chef we're incredibly helpful, attentive, and polite. They were very knowledgeable of their products, provided samples of anything requested and seemed to have a genuine passion for their profession. I loved being able to see the high end and made in house products be made either through the window into the kitchen or in their air drying system for their meats. The sandwiches we're absolutely delicious and made with an obviously higher caliber of product quality than you will find anywhere else in the area. And for the (on average) $10 you get chips and a drink as well. You can even call in and pick up your order at a later time! Now some people will say that the prices are too high, and to a point I agree. However, I also appreciate that this is a premium product with supurb quality which demands and justifes a higher price. Seems fair to me. In my opinion this place is too good for Pelham.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPYGrqwG6y3HF0XAMtSxhF7mWwlwXXTC1GZLTY2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNOTvT0jGVAi_Hjnrtwhfr3R1lBulmpiKhJEaow=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPnFK6ZkJS7gu0cd_N3ki0ptnT0BII1jd-i9diE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOTytGZzrGp0yeZIfAJZGdbVjvPTIqFmMsd3PsD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPTAiJsGftWVCNfaNqZZWpOX8ORlbexJ7r6Pskh=w150-h150-k-no-p"]}], "resp": {"time": 1537553879006, "text": "Thank you so much for your kind words. We're glad you decided to stop in and we hope you've enjoyed everything!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "114542069878830853359", "name": "Robyn Arrieche", "time": 1592590450384, "rating": 4.0, "text": "Let’s face it, they know what they are doing here. I had the Wagyu Pastrami sandwich toasted that was VERY good. However, my only critique was that there was an overpowering taste of saltiness coming from the mustard or the sauerkraut which was disappointing because the meat was soooo good.", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "117838854156878556439", "name": "Rick McCoy", "time": 1607625855042, "rating": 5.0, "text": "Best in town. Bar none.", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "101507818332259337272", "name": "Doug Cole", "time": 1569539850441, "rating": 5.0, "text": "Went for the first time last night and wasn't disappointed.  Criss was extremely knowledgeable about the various cuts of meat and the dry aging process.  I felt like I was attending a culinary class.  The meal was excellent!\nI'll definitely be back for seconds!", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "102279828869453628760", "name": "Taylor Hart", "time": 1590164873921, "rating": 5.0, "text": "It was SO good. That Jon Green guy is a dream.  That meatloaf sandwich though.... it's a winner.", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "108545893631599041184", "name": "Danita Ryan", "time": 1550147314764, "rating": 5.0, "text": "I stopped in from work at about 4:00 p.m. to grab a chicken salad sandwich. I rate it a 10, it was delicious and fresh. Smiley Brothers is a different place but when you walk in the door you know that you are about to receive great service and wonderful food. I recommend it to everyone. I love their customer service because if you don't know they have time to talk you through it and you can have it your way.", "pics": null, "resp": {"time": 1550155945484, "text": "Thank you for such a kind review! We’re so glad you enjoyed everything and hope you’ll stop by and see us again soon!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "110861250339977989418", "name": "Dennis Tymkiw", "time": 1550111987802, "rating": 5.0, "text": "Prime grade dry-aged steaks cut to order. Loaded baked potatoes ready to warm up and devour. They pickle their corned beef and make their own pastrami. Select cheese and wine. A jewel of a store with a knowledgeable staff. Foodies-don't miss this place.", "pics": null, "resp": {"time": 1550955864913, "text": "Thanks for the kind words Dennis!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "110861250339977989418", "name": "Dennis Tymkiw", "time": 1550111987802, "rating": 5.0, "text": "Prime grade dry-aged steaks cut to order. Loaded baked potatoes ready to warm up and devour. They pickle their corned beef and make their own pastrami. Select cheese and wine. A jewel of a store with a knowledgeable staff. Foodies-don't miss this place.", "pics": null, "resp": {"time": 1550955864913, "text": "Thanks for the kind words Dennis!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "112550011891030356726", "name": "David Vaughn", "time": 1590625108701, "rating": 5.0, "text": "Outstanding Italian beef sandwich today. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "104730656035101605965", "name": "Christina Klockow Runnels", "time": 1549729802488, "rating": 5.0, "text": "We have eaten there a few times and everything we have gotten has been delicious! Everything is fresh and seasoned perfectly and their cookies are out of this world! My favorite is the pimento cheese and my husband always gets the club sandwich. Looking forward to trying the chicken salad next! We are so lucky to have this gem in our town!", "pics": null, "resp": {"time": 1549751146307, "text": "Thank you so much for the kind review! We’re so glad you liked what you tried and can’t wait to hear what you think of our house made chicken salad!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "100295703978161562404", "name": "rene generoso", "time": 1537736953885, "rating": 5.0, "text": "Great meat great cheese and great high prices haha", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNKeaHPz2dX6k5_rKjB5hmACpXJSZvxp5GHgasC=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "113957397853085315675", "name": "Marnie Reineke", "time": 1539398387003, "rating": 5.0, "text": "Highly recommend if you are in the Birmingham area!  They prepared an amazing meal to go for our daughter’s soccer team and everyone enjoyed it. Terrific selection of delicious meats, cheeses  and other specialty foods  that works for one or a large group. Can’t say enough good things about both  the shop and the people who work there.", "pics": null, "resp": {"time": 1554732401395, "text": "Marnie, you're too kind! Thank you for such a thoughtful review, we're so glad you enjoyed your Smiley Brothers experience!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "101978389291841995938", "name": "Darlene Talton", "time": 1547248440521, "rating": 5.0, "text": "Smiley Brothers has great deli sandwiches. They make most all of their ingredients on site. Everything is fresh made. They put plenty on your sandwich. They have a large selection of cheeses.\nThey do catering and cooler packages. Friendly and helpful employees.", "pics": null, "resp": {"time": 1550955954461, "text": "Thank you Darlene for your kind words!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "104801829989955890190", "name": "Vintowsi Farms", "time": 1583969672709, "rating": 5.0, "text": "Traveling from Sacramento, California to Florida in an RV and stopped for a sandwich. Little did we know this would be the best sandwich of our trip!    So delish!\nCriss knows quality, and he delivers that.\nWow, soooooo good and fresh!\nWill stop again on our way back to Sacramento.", "pics": null, "resp": {"time": 1587822410892, "text": "We’re so glad you stopped by and that you loved your sandwich! THANK YOU!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "113153443246155631193", "name": "QuantumPolagnus", "time": 1549743184579, "rating": 5.0, "text": "My wife and I came here with no idea what they even sold.  We found out they sell lunch, so my wife got their Special Burger and I got a bowl of their Tomato Soup.  They showed us around and told us more about what they do as the food was being prepared.  Apparently the burger was a house recipe combination of different steaks ground together with butter, parsley, etc.  Suffice it to say that the burger was one of the best we have ever had.  The soup was also really good and creamy with shredded gouda and croutons on it.", "pics": null, "resp": {"time": 1549751080786, "text": "Thank you so much for the kind review and for stopping by to give us a try! We so glad you enjoyed what you tried and hope you’ll come back and see us again soon!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "107471663492182542402", "name": "Scott Lamoreaux", "time": 1537475200205, "rating": 5.0, "text": "We have had almost every sandwich on the menu and each one has top quality Meats, cheese and bread. All of the take-home meats and items are as good as you will find in this area. Of course it's not cheap because it's the best. Also the only place I know of locally that has true dry aged beef.", "pics": null, "resp": {"time": 1537553976298, "text": "Hi Scott, thanks for the kind words! We're glad you've enjoyed the sandwiches and hope you'll come back and see us again soon!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "105872523835650933048", "name": "Candace Herron", "time": 1549158975917, "rating": 5.0, "text": "Great roast beef sandwich!  Also picked up some house made sausages and cheese.  I plan to come back for some dry aged steaks soon.", "pics": null, "resp": {"time": 1550955889611, "text": "Thanks for the kind review Candace!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "112438361401349508922", "name": "Garrett Bowling", "time": 1582392369909, "rating": 5.0, "text": "I finally branched out and tried something other than the beloved Meatloaf Sandwich....OMG am I glad I did because the Wagyu pastrami sandwich was AMAZING! The tangy house made pickles, cut through the rich fatty goodness of the Wagyu. The whole grain mustard and swiss cheese round out the flavors and it is served on wonderfully toasted Rye. Now the only problem I have is what to try next!", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "110992669626438631371", "name": "Chris Ashley", "time": 1578166183287, "rating": 1.0, "text": "Bland sandwiches. Roast beef especially bad possibly expired or old.  Had club, roast beef, and chik salad.", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "112135088215058794286", "name": "Em", "time": 1531605021124, "rating": 5.0, "text": "Wonderful place with friendly staff!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN6YbbDmyNTF87rjgr6TO6TFM2RON16fPEmAbau=w150-h150-k-no-p"]}], "resp": {"time": 1554732485933, "text": "Thanks Emily!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "111002517206943200655", "name": "David Price", "time": 1551909591282, "rating": 5.0, "text": "The staff was super friendly and helpful.  I had their cheese burger with a lettuce wrap instead of bun.  In my opinion, it is the best cheese burger in Shelby County.", "pics": null, "resp": {"time": 1551969663692, "text": "Thank you David for such a nice review! We’re so glad you enjoyed your burger!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "104184647338644127105", "name": "Jonathan Eidson", "time": 1521289015828, "rating": 5.0, "text": "The meat here is a premium product, so expect to pay a premium price. You’ll end up with a better steak from your own grill than you’d get at any place outside of a $100+ per plate fine dining restaurant for much less. The staff is friendly and willing to spend time discussing their products with you. Definitely will go to again for a fine steak dinner at home with the wife or other special meals.", "pics": null, "resp": {"time": 1521291465331, "text": "Thank you for your kind review! Please come back and see us soon!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "103142819436678065616", "name": "Tommy Barberini", "time": 1547236500093, "rating": 5.0, "text": "Had an amazing sandwich but you better bring your appetite! Dry/wet aged meat available as well. Will definitely be back.", "pics": null, "resp": {"time": 1554732315814, "text": "Thanks Tommy! Hope you and your appetite are able to stop by again soon :)"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "113402879738620556757", "name": "Bill Burn", "time": 1549428657774, "rating": 5.0, "text": "Had the Smiley Burger over the weekend and this is absolutely the best burger in bham! This thing is stacked tall and they apparently have butter in their beef mix! The cheddar is melted over the meat dripping down the toppings. They have lots of great sandwiches, but this is my new favorite! I would pit it against any burger in bham!! If you haven’t been in here yet, check it out. Great wine, cheese, and sandwiches. Chef Josh and the guys are always polite and helpful!", "pics": null, "resp": {"time": 1549751270678, "text": "Thank you Bill for such a kind review! We’re so glad you enjoyed your Smiley Brothers Burger!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "104175798833163468912", "name": "garrett bowling", "time": 1580514412757, "rating": 5.0, "text": "Never been here before today but I had the Meatloaf sandwich and it was INCREDIBLE! Will definitely be ordering it again!", "pics": null, "resp": {"time": 1580578199164, "text": "Thanks for stopping in and giving us a try! We’re so glad you loved your sandwich and look forward to seeing you again!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "102442120984825649610", "name": "mhtate", "time": 1556481438930, "rating": 4.0, "text": "Stopped in to pick up some sandwiches.   The wagyu pastrami was quite tasty but the cons Reuben was a bit too salty for our tastes.   I look forward to going back to try the good selection of cheeses, charcuterie, prepared foods and butcher cuts.", "pics": null, "resp": {"time": 1561581011190, "text": "Thank you for your review! The Reuben can definitely be a strong flavor! Hopefully you'll be able to stop back in soon and try out our other options!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "103877067353497416512", "name": "Monique Smith", "time": 1540743764434, "rating": 5.0, "text": "Very knowledgeable staff and owner. Wonderful quality, clean meat options. And when you're there check out the home made pimento cheese and french onion dip!!", "pics": null, "resp": {"time": 1554732367866, "text": "The French Onion Dip is a favorite all around, we're so glad you enjoyed it!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "110752217566017997611", "name": "Eddie Stroud", "time": 1542414697262, "rating": 5.0, "text": "Beyond friendly! The kind of old school freibdly helping hand that seems to be to few and far between nowadays. Mr. Smiley knows his meats. I will definitely be back again and highly suggest you visit if you haven't yet already! Great honemade oversized lunch specials. Nowhere anywhere close that can compare to this place.", "pics": null, "resp": {"time": 1554732247600, "text": "Thank you so much for your kind words Eddie! Hope you can come visit us again soon!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "103610777712575692006", "name": "Owen Stayner/ThisWorkplace360", "time": 1559241779497, "rating": 5.0, "text": "Had the BLT salad... excellent! Good service and nice space.", "pics": null, "resp": {"time": 1559486315989, "text": "Thank you for the kind words Owen! We’re so glad you enjoyed your experience!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "106939563325590637230", "name": "Alabama Sedan", "time": 1509939077615, "rating": 5.0, "text": "I really enjoyed my first visit to Smiley Brothers. Had no idea it was an excellent Deli as well as a butcher shop! I will definitely go back often to enjoy the ambience as well as the food.", "pics": null, "resp": {"time": 1510928689747, "text": "Thank you so much for the kind review and we hope you can stop by again soon!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "100295703978161562404", "name": "rene generoso", "time": 1537736953885, "rating": 5.0, "text": "Great meat great cheese and great high prices haha", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNKeaHPz2dX6k5_rKjB5hmACpXJSZvxp5GHgasC=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "112819738281568595645", "name": "Lee Courington", "time": 1525285774240, "rating": 5.0, "text": "Amazing Experience! Staff took time to explain all menu items and the sandwich I had was delicious!\n\nHighly recommend the pickles as well.", "pics": null, "resp": {"time": 1554732549727, "text": "Mmmmm, the pickles are definitely a fan favorite! Thank you for stopping in and we're so glad you enjoyed everything!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "104190810662203523370", "name": "Ashley Winslett", "time": 1521863220872, "rating": 5.0, "text": "Im new to the whole steak buying thing and honestly don't know what I'm doing. The people were so helpful. They answered my questions and never once made feel intimidated by the experience. The steaks were amazing! Looking forward to trying the deli. Keep up the great work.", "pics": null, "resp": {"time": 1522013857680, "text": "Thank you Ashley! We hope you stop in again soon!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "104819349375149466373", "name": "kevin woody", "time": 1564505357247, "rating": 5.0, "text": "the pimento burger is literally the best burger ive ever had.", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "110684725888578576653", "name": "Patrick Connor", "time": 1565186140661, "rating": 5.0, "text": "Best burger in Shelby and maybe all of Bama", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "101074681440227965515", "name": "Austin Shadix", "time": 1550946858671, "rating": 5.0, "text": "Friendly staff, quality products, lots of housemade goodies and ready to cook packages.", "pics": null, "resp": {"time": 1550955838577, "text": "Thanks Austin for such a kind review!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "101375988494592270655", "name": "Eboni Greene", "time": 1532454610598, "rating": 5.0, "text": "I love the smoked Gouda can't wait to make grilled cheese sandwiches. The staff was really nice and I will most definitely be returning.", "pics": null, "resp": {"time": 1537554079670, "text": "Thank you got your kind words Eboni! We hope the grilled cheese sandwiches were delish!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "115312825557495889551", "name": "Sharon Kellum", "time": 1521817310829, "rating": 5.0, "text": "Awesome new place if you are looking for a top quality butcher shop! Very knowledgeable owner and staff...", "pics": null, "resp": {"time": 1522013890093, "text": "Thank you! We hope you’re able to stop in again soon Sharon!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "111087323353435379298", "name": "•GalaxyFloofy•", "time": 1576268643115, "rating": 5.0, "text": "Amazing burgers and plenty of options!", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "105053087152366565601", "name": "Alan Thompson", "time": 1553221181599, "rating": 5.0, "text": "Very nice selection of delicious cheeses and meats.", "pics": null, "resp": {"time": 1554732198003, "text": "We're so glad you enjoyed everything!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "116065669500119812948", "name": "Michael Sims", "time": 1523641118024, "rating": 5.0, "text": "Very friendly and informative. Did not make a purchase today, but will be back very soon.", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "116744236744118369895", "name": "John Kubas", "time": 1541899360115, "rating": 2.0, "text": "very over priced......i bought a ribeye bone in from them....not good for the money i paid......much better ribeye on sale at piggly wiggly..", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "117822283738761533531", "name": "Lorraine Reeves", "time": 1515766084579, "rating": 5.0, "text": "From the moment you walk in, you are greeted by a friendly and helpful staff.  Fresh vegetables and any type of infused olive oils you can imagine.  The cheese display is incredible, and the staff is more than happy to give you a sample of any you would like to try.  Let's not forget the meat!  You can see the dry aging of beef in process.  It takes about thirty days to age the beef.  I bought a ready to cook meal that includes chunks of prime beef, carrots, onions, celery, potatoes, a half bulb of garlic, tomato paste and a red wine jus.  Cooked it in my dutch oven, and it was perfect.  I didn't have to cut up the vegetables or meat, so it was a great time-saver.  Did I mention the filets?  Bought two dry-aged and they grill to fork tender.  The flavor is certainly better than regular filets from the grocery store.  All meat is butchered in-house, by well-trained chefs and the house-made sausage is unique, yes classic.  I also bought pork chops that must have been over an inch thick.\nI highly recommend you buy from this specialty food store!", "pics": null, "resp": {"time": 1517078292301, "text": "Lorraine, thank you SO MUCH for your incredibly kind words. We strive everyday to make sure each guest loves their Smiley Brother experience both in shop and once they take their purchases home. We hope you come back to see us soon!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "102141761182222234896", "name": "preston naish", "time": 1563733898337, "rating": 5.0, "text": "Stop what your doing and come eat here! Amazing food!!!!!", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "112404732411338774436", "name": "Marty Eagle Meaglesales@gmail.com", "time": 1532893196494, "rating": 4.0, "text": "Food was awesome, just need a little more seating for guests", "pics": null, "resp": {"time": 1537554046354, "text": "Hi Marty! Thank you for your kind words and feedback! I hope you've stopped back in lately to see that we have added more seating for folks to enjoy in store!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "113147793786028854418", "name": "Brad Satterfield", "time": 1561878901757, "rating": 2.0, "text": "Nice dining, terribly over priced, my personal opinion it could be a great place if they had a wider selection", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "112135088215058794286", "name": "Em", "time": 1531605021124, "rating": 5.0, "text": "Wonderful place with friendly staff!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN6YbbDmyNTF87rjgr6TO6TFM2RON16fPEmAbau=w150-h150-k-no-p"]}], "resp": {"time": 1554732485933, "text": "Thanks Emily!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "101443494280313109957", "name": "Alabama Sedan", "time": 1580928280772, "rating": 5.0, "text": "Great food an Facility", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "114070351214597599436", "name": "Mike Hamner", "time": 1517613688207, "rating": 5.0, "text": "Superb meats, knowledgeable staff, awesome decor/style", "pics": null, "resp": {"time": 1521291481930, "text": "Thank you!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "118377850725129467486", "name": "Kenneth Wesley", "time": 1528280886965, "rating": 5.0, "text": "Profestional, Kind and Clean. My new home for all things meats, cheese and breads.", "pics": null, "resp": {"time": 1537553784120, "text": "Thank you for your kind review!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "101410953577309401871", "name": "Ricky F", "time": 1580928325128, "rating": 5.0, "text": "Great food!", "pics": null, "resp": null, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "104170481511620258072", "name": "Mark Watson", "time": 1554592831041, "rating": 5.0, "text": "Wow is all i can say", "pics": null, "resp": {"time": 1554732153070, "text": "We hope that's a good wow :)"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "110343264834677266165", "name": "Pamela Pouncy", "time": 1542473618222, "rating": 5.0, "text": "Excellent chili!", "pics": null, "resp": {"time": 1554732255924, "text": "Thanks Pamela!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "102062605548944571595", "name": "Rebecca Hill", "time": 1553019023563, "rating": 5.0, "text": "Great food!", "pics": null, "resp": {"time": 1554732202706, "text": "Thank you!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "110251294371142747792", "name": "Pat Reid", "time": 1523728348071, "rating": 5.0, "text": "Bomb hero!", "pics": null, "resp": {"time": 1537553888522, "text": "Thank you!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "107152680934515047880", "name": "Josh Naro", "time": 1521913530970, "rating": 5.0, "text": "(Translated by Google) Great foody shop.\n\n(Original)\nGreat foody shop.", "pics": null, "resp": {"time": 1522013816978, "text": "Thanks!"}, "gmap_id": "0x88892445ac9c1f7b:0x20552de628ec0d6d"}
{"user_id": "113359488662814657667", "name": "Robert C", "time": 1544212449013, "rating": 5.0, "text": "An absolute gem of a store that offers try-before-you-buy gourmet Olive oils and Balsamic vinaigrette. Olive oils this fresh are hard to find and the infused options are an awesome way to mix it up. There is also a huge variety of balsamic vinaigrette with quality you'll never find at a local grocery store. I was also pleased to find bread dipping spices to add to the oil. Prices are very reasonable and the staff make you feel like family!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMd_Y4KyoqlJ6dPCfOahssSsx6WxPkc86jvQMtY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPG06ije2g28e6fzrSvSch4tXgtWek4WQTl-7hb=w150-h150-k-no-p"]}], "resp": {"time": 1557851562735, "text": "Thanks Robert! So glad you came by, we love coming up with & sharing recipe ideas & flavor combinations. Glad you like our bread dipping spice blend, it's one of our favorites!"}, "gmap_id": "0x888c2c819c84fce5:0xadf6f366c784f229"}
{"user_id": "103359442376434767709", "name": "Debbie Dunaway", "time": 1603504282024, "rating": 5.0, "text": "This is an incredible place for balsamic vinegars and infused olive oils. The owner is very knowledgeable and helpful. Great for gifts.", "pics": null, "resp": null, "gmap_id": "0x888c2c819c84fce5:0xadf6f366c784f229"}
{"user_id": "106562546004754021588", "name": "Gerard", "time": 1549333058595, "rating": 5.0, "text": "I have thanked the owner twice for opening a store like this in Montgomery. It is a wonderful treasure if one enjoys food or cooking. I love to cook and I feel I know something about olive oil and balsamic vinegar but she knows far more than I will ever know. It is an extremely wonderful treat for Montgomery. Now we do not have to commute to Atlanta, New Orleans or New York City for extremely high quality olive oil and balsamic vinegar.\nThank you to both owners!!!", "pics": null, "resp": {"time": 1549418699258, "text": "Wow, thank you so much Gerard! So very glad you’ve enjoyed using our products, cheers to great food!"}, "gmap_id": "0x888c2c819c84fce5:0xadf6f366c784f229"}
{"user_id": "117341605406154606454", "name": "Philip Lerner", "time": 1617493477860, "rating": 5.0, "text": "Excellent place", "pics": null, "resp": null, "gmap_id": "0x888c2c819c84fce5:0xadf6f366c784f229"}
{"user_id": "117155713020964732473", "name": "Larry Summons", "time": 1546048482488, "rating": 5.0, "text": "I absolutely love to cook, I was pleasantly surprised to find this location. A wide variety of olive oils and balsamic vinegars, and my personal favorite the Foco charcoal! Our last visit was amazing, sampling different balsamic flavors and exploring the possibilities for future dishes.", "pics": null, "resp": {"time": 1557851376377, "text": "Thank you so much Larry! We love when you sample so you can experiment & know you'll love what you get, there are so many ideas!"}, "gmap_id": "0x888c2c819c84fce5:0xadf6f366c784f229"}
{"user_id": "105356112945719972509", "name": "Marion Ackley", "time": 1574880924459, "rating": 1.0, "text": "When I hand you my money hand me back my money don't ever put my money on the counter. Happy Thanksgiving", "pics": null, "resp": {"time": 1574877121385, "text": "We apologize Marion. At the time it appeared you were looking for something in your purse so I placed it on the counter for you to get at your convenience while I finished packaging your order for you. Sorry if I misread the situation and that you felt offended, that would NEVER be our intention."}, "gmap_id": "0x888c2c819c84fce5:0xadf6f366c784f229"}
{"user_id": "117940039936205596701", "name": "Anita Rabidou", "time": 1557667042964, "rating": 5.0, "text": "This place is amazing! If you are looking to add flavor to your life check out the wide array of vinegar and oils they have to offer.", "pics": null, "resp": {"time": 1557851231966, "text": "Thank you so much Anita! Always good to see you, glad you're enjoying everything, thanks again!"}, "gmap_id": "0x888c2c819c84fce5:0xadf6f366c784f229"}
{"user_id": "111363699303397475235", "name": "Janet May", "time": 1529195070364, "rating": 5.0, "text": "I just love this shop. Friendly staff and great products!!", "pics": null, "resp": {"time": 1529259187710, "text": "Thank you Janet!"}, "gmap_id": "0x888c2c819c84fce5:0xadf6f366c784f229"}
{"user_id": "105915372360989840450", "name": "Casey M", "time": 1599936532128, "rating": 5.0, "text": "This husband / wife owner combo are so friendly and welcoming. Whether it is your first visit, or your 30th time to come back for refills, they treat everyone like family. I enjoy exploring different flavors each time but my all time favorite is the Granny Smith Apple Balsamic.  It is delicious!  They have so many flavors of both olive oil and balsamic that you become inspired to cook a masterpiece just walking in the store.  They also offer a nice selection of unique and locally made gifts.  This is a must see while exploring historic downtown Oxford!!", "pics": null, "resp": {"time": 1600575108042, "text": "We are so grateful for your kind words of encouragement Casey M!  You had such a kind spirit about you in the store that made serving you a pleasure!  Granny Smith Apple Balsamic is one of our favorites too!  It’s almost like eating an apple in the field!  And yes, all the oils and vinegars are constantly sparking us to create new recipes too!  It’s people like you who inspire us to serve our local community!"}, "gmap_id": "0x888bb147629a105b:0x9dcbbf5b8a54cc10"}
{"user_id": "115746438103668886571", "name": "Judy Papic", "time": 1613564324004, "rating": 5.0, "text": "Great variety of flavored olive oils and vinegars", "pics": null, "resp": {"time": 1613573182549, "text": "Thank you! We truly appreciate you!!"}, "gmap_id": "0x888bb147629a105b:0x9dcbbf5b8a54cc10"}
{"user_id": "112348573849511172561", "name": "mr weasel1", "time": 1579972944686, "rating": 5.0, "text": "Great products, great products, and great customer service! There were so many tasty things to get here. The lady helping us was just the sweetest and super easy to talk to. Great place! We will be coming back there!", "pics": null, "resp": {"time": 1579976932359, "text": "Thank you so much for stopping by! We truly appreciate your business!"}, "gmap_id": "0x888bb147629a105b:0x9dcbbf5b8a54cc10"}
{"user_id": "118197456694534848308", "name": "Ann Wilson", "time": 1611872862937, "rating": 5.0, "text": "Boy have I missed my Olive Oil - just couldn't remember to stop!", "pics": null, "resp": {"time": 1613573237055, "text": "We truly appreciate you!"}, "gmap_id": "0x888bb147629a105b:0x9dcbbf5b8a54cc10"}
{"user_id": "112154809920350875581", "name": "Jody Dalton", "time": 1597526527147, "rating": 5.0, "text": "incredibly unique selection with a friendly and knowledgeable staff", "pics": null, "resp": {"time": 1597530242017, "text": "Thank you so much! We are so glad you chose to shop with us & truly appreciate your business!"}, "gmap_id": "0x888bb147629a105b:0x9dcbbf5b8a54cc10"}
{"user_id": "103050833108413004003", "name": "Josh Hale", "time": 1613589314549, "rating": 5.0, "text": "Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x888bb147629a105b:0x9dcbbf5b8a54cc10"}
{"user_id": "116027326119187868451", "name": "Nicole F", "time": 1559074572879, "rating": 5.0, "text": "My husband and I popped into this quaint little store during my recent Memorial Day weekend visit to Oxford and was kindly greeted by staff who offered for me to taste test their infused olive oils and balsamic vinegar's. They were absolutely delicious, and I ended up purchasing bottles to take home. I have enjoyed them each day since and will be a repeat customer! Yum!", "pics": null, "resp": {"time": 1580484466251, "text": "Thank you so much for the kind words!   We are glad you enjoyed tasting our oils and balsamics in the store and each day since then!  We look forward to serving you in the future!"}, "gmap_id": "0x888bb147629a105b:0x9dcbbf5b8a54cc10"}
{"user_id": "105139166861647261291", "name": "Kayln Hess", "time": 1544825298900, "rating": 5.0, "text": "This locally own shop is a true gem. They have everything from salsas to artisian oils. Their jams are imaginative and delicious. The staff are friendly and knowledgeable. Anytime I need a special gift for someone I stop in and normally I pick something up for myself as well!", "pics": null, "resp": null, "gmap_id": "0x888bb147629a105b:0x9dcbbf5b8a54cc10"}
{"user_id": "107870507785114666754", "name": "Roger Mcclellan", "time": 1581277941723, "rating": 5.0, "text": "Great selection and friendly service", "pics": null, "resp": {"time": 1597530279132, "text": "Thank you so much! We truly appreciate you!"}, "gmap_id": "0x888bb147629a105b:0x9dcbbf5b8a54cc10"}
{"user_id": "102968378646204201594", "name": "Grace Dyal", "time": 1526910476097, "rating": 4.0, "text": "A great selection of olive oils. Great service", "pics": null, "resp": null, "gmap_id": "0x888bb147629a105b:0x9dcbbf5b8a54cc10"}
{"user_id": "100889682739799404444", "name": "Aleshia Wiley", "time": 1493329208930, "rating": 5.0, "text": "Great ppl & great oil, vinegar and olives", "pics": null, "resp": null, "gmap_id": "0x888bb147629a105b:0x9dcbbf5b8a54cc10"}
{"user_id": "118013631740696585111", "name": "Rickey Moore", "time": 1491591609807, "rating": 5.0, "text": "Great selections of favored olive oils", "pics": null, "resp": null, "gmap_id": "0x888bb147629a105b:0x9dcbbf5b8a54cc10"}
