{"user_id": "112640003984510363868", "name": "Kim", "time": 1620231787519, "rating": 1.0, "text": "Never in my life been hated on, talked to or treated such a way as I have encountered at this place. Discrimination is a definite problem here and it's ridiculous.", "pics": null, "resp": null, "gmap_id": "0x888ced2f73c2d421:0xb289a0a3c7f1e8f7"}
{"user_id": "116467172043087260700", "name": "Cindy Campbell", "time": 1613437107107, "rating": 5.0, "text": "Felt very safe and I felt they cared for the well being of others, on my visit during the pandemic.", "pics": null, "resp": null, "gmap_id": "0x888ced2f73c2d421:0xb289a0a3c7f1e8f7"}
{"user_id": "101800152867986077333", "name": "benjamin hernandez", "time": 1610053988860, "rating": 4.0, "text": "They get to you fast", "pics": null, "resp": null, "gmap_id": "0x888ced2f73c2d421:0xb289a0a3c7f1e8f7"}
{"user_id": "101085521907465339202", "name": "Axel B.", "time": 1570710323737, "rating": 5.0, "text": "Very Cooperative and deal with your time efficiently", "pics": null, "resp": null, "gmap_id": "0x888ced2f73c2d421:0xb289a0a3c7f1e8f7"}
{"user_id": "106967044967268725901", "name": "Tierra Carreker", "time": 1548768754978, "rating": 1.0, "text": "They have gain green grow in the sales when the state come they never go all the way in to see it ...the staff talk to u horrible\n..it just a disgrace .....", "pics": null, "resp": null, "gmap_id": "0x888ced2f73c2d421:0xb289a0a3c7f1e8f7"}
{"user_id": "108216712362464346211", "name": "Doris Kyles", "time": 1521126672156, "rating": 5.0, "text": "IT'S AN EXPERIENCE THAT IS ETCHED IN MY MEMORY.", "pics": null, "resp": null, "gmap_id": "0x888ced2f73c2d421:0xb289a0a3c7f1e8f7"}
{"user_id": "107181264253508085528", "name": "Christian Dawson", "time": 1562622759860, "rating": 5.0, "text": "A great fire Department", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOwQsvhMLJuFBz7VYzesLpSKkz2ocmTOBMCq8tc=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c0f798cf4fabf:0x9d4c73552c94ae41"}
{"user_id": "115733418957364408745", "name": "jonathan raney", "time": 1623811659771, "rating": 1.0, "text": "100% a scam.  These guys literally almost reversed at speed into a car behind them who already paid, like they were doing it on purpose.  The actual driver looked like he wanted to same something while he angrily tore at cables and reciepts while the guy in the passenger seat lied to me.  Hot tip, don't say it wasn't you who answered the phone when you have a very distinct voice, it's just silly.  And yeah, I'm talking about you, guy with random (traditional style) tats on his right arm.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "108555706466706405704", "name": "Iryna Harris", "time": 1624936013344, "rating": 1.0, "text": "Very rude ! Not professional! Worst experience ever! I was thinking how missable they job is!", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "114263481977462055767", "name": "Michael Kendall", "time": 1628088063172, "rating": 5.0, "text": "awesome company.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "112556169972809970039", "name": "Patrick Sullivan", "time": 1619299939216, "rating": 1.0, "text": "rude. seemed like they wanted to pick a fight when we were just trying to pay them to get our car back.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "104055571008559047485", "name": "Brian Richey", "time": 1491669622327, "rating": 1.0, "text": "Went to a MS fundraiser at Regions field at 9am on a Saturday.  Was there for an hour was towed from a lot that was less than 25% full.  They have a fleet of douchebags riding around in tow trucks like vultures.\n\nAmazing to tow people at regions field for a fundraiser for people with a terminal illness.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOUHFy0AgC1OBBQeHgx4COOXjFF4cq5bHwb-Ze_=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "107471259757336338165", "name": "Marina Bartoletti", "time": 1596594014356, "rating": 1.0, "text": "We parked in the parking lot off of 2nd Ave N and 22nd Ave N for dinner at El Barrio. We paid for a parking ticket for 5 hours and placed the ticket on the dashboard of our vehicle. We had dinner for 1.5 hrs then returned to the parking lot to find that our car had been towed. When we explained that the ticket is inside of the car on the dash, the men argued that the ticket must’ve fallen on the floor and therefore, they couldn’t see it and towed it. Once we arrived at the impound lot, they refused to let us leave without paying $177 (even though we had paid to park in the lot)!!!! Horrible, horrible company. I can’t think of worse employees to deal with - extremely rude and cursed at us multiple times.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "118209988054320527184", "name": "Michael Bemis", "time": 1577891474370, "rating": 1.0, "text": "DAMAGED VEHICLE - This company towed my vehicle in an area where my car was authorized. It also turned out that the tow truck damaged the rear end and braking system on my car. A small court claim will be filed as this should definitely not happen again. I WOULD ADVISE AGAINST USING THIS COMPANY. Use a professional tow truck company!", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "113041610261392388829", "name": "Victor Oconner", "time": 1581716273043, "rating": 1.0, "text": "These people are crooks and very unprofessional. They towed my friends truck while he was at my apartment for maybe 45 minutes, the next day we go to the lot to pick it up and they had smashed the front, missing headlight, crushed fender, and multiple other somewhat significant damages. When we talked to the guys on site he told us one story then the “owner” came and gave us another story and the damage doesn’t match either of the stories. And my friend still had to pay to get the car out after the criminal of a owner delt with the situation unprofessionally and came off as hostile, which wouldn’t have been a problem But still very unprofessional and a totaled car in the end. These guys are scum, not professional tow drivers.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "110809505574501361368", "name": "Tyler Douglas", "time": 1517070340222, "rating": 1.0, "text": "Parked to eat dinner at Chick-fil-a in 5 Points. Decided to walk across the street to Dave's. I'm not a late night person, so I came back just after they had closed to find a completely cleared-out lot thanks to these vultures.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "109803842563303063766", "name": "Chris Wade", "time": 1544408864333, "rating": 1.0, "text": "Predators is all these people are. No handicap parking places available and getting a wheelchair out of a car on the street is dangerous. I was excited to find a space I could actually get my wheelchair out of my car.I was in the store 35 mins just to come out and my car is gone. They had to have watched me get out and then towed my car. What goes around comes around. Karma!!!!", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "103664789126596926479", "name": "Sandra Erskine", "time": 1559273117668, "rating": 1.0, "text": "My husband and I were sitting next door on business of our own  and watched the thieves stealing cars with their snatch truck and obviously there is NO WAY....ALL THE CARS THEY TOW COULD BE ILLEGALLY PARKED! Within 30 minutes or less,  1 of their tow trucks snatched a minimum of 5 cars! Looked up the name of the company on the truck and sure enough....ITS THE BIGGEST SCAM I HAVE EVER SEEN! SOMEONE NEEDS TO STOP THIS COMPANY! They are CROOKS! I  Can’t imagine so many cars are illegally parked! Just can’t be true! One day they are gonna tow the wrong car from the wrong person!! Heads up people visiting Birmingham......SAD Someone HASN'T STOPPED THIS!", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "116929727964183565125", "name": "Dana Ellis", "time": 1535565777374, "rating": 1.0, "text": "Would have been more appropriate to be able to give a negative rating. Very rude people work for this company. Predatory towing practices are bad enough but having to deal with rudeness and intimidation makes the whole situation worse.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "115539194288763198316", "name": "Molly Cole", "time": 1406611062793, "rating": 1.0, "text": "As the disabled sister that was mentioned in Elizabeth Goodrich's review, I am infuriated in the way Birmingham Parking enforcement does business. Because, I don't drive  some people may say that my opinion doesn't matter, I disagree. Because I don't drive, and have mobility issues, I need help from family members and friends\\to help with grocery shopping and errand running. If They know they run the risk of being towed because they helped me bring things into my apartment, they could be  less willing to help me. Paying $285 is a steep price to pay for doing the right thing.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "116544563449743974069", "name": "Holly Stiles", "time": 1513830235765, "rating": 1.0, "text": "This company is nothing but a scam. I will not only contact the Birmingham City Council Rep that presides over this district tomorrow, but I will contact the business and the realtor of the lot from which I was towed. My vehicle was towed less than 8 minutes after it was parked and sat at the tow lot for less than an hour. When I inquired about who told them to tow my car, who owned the business, their operating practices, suddenly the \"attendant\" at the lot went silent. If we want Birmingham to grow and for people to visit the downtown area, the city should start by getting rid of this \"business\".", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "113123800889574886063", "name": "Banks236", "time": 1390615827180, "rating": 1.0, "text": "If you feel you have been done wrong by this company please feel free to contact me. We are in the process of building a case against them for predatory and illegal towing. Please contact me on here. In the subject line put \"Parking Enforcement Inc\" so I will know you are not a spammer. We have to come together on this issue...", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "115619896009696766275", "name": "Ace Dragon Trainer Hart (AcetrainerAdam)", "time": 1511094791613, "rating": 1.0, "text": "I at work parked right in front of my bosses car and yall took it?!!!? Really worked at Dunkin Donuts for over 2 years now and have never had this occur. Yall had no business stealing my car!!!!", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "103762260619047557713", "name": "Jonathan Brown", "time": 1362104916302, "rating": 2.0, "text": "I am surprised nothing has been done about this yet. I am months behind on rent, having my heating shut off, electric shut off, and having neighbors pay my internet bill. So I sell my computer for $300 which was much lower than what it was worth. My girlfriend wanted to take me out to dinner to cheer me up. The lot we parked in was a very small, dark parking lot with no visible sign whatsoever. We walked into the place, saw there were absolutely no seats and was crowded, visited the bathroom and came out to find the car towed. After searching frantically for some sort of sign - we found the sign. Behind what looked like months of shrubbery grown around it, in a bush. The sign was clearly not visible, and these people will now be single-handedly responsible for me having to light candles and walk around wrapped in a blanket for the next few months until I can get some sort of help with my power bill. All of them were rude, nasty, and obviously used to being hated because they ride around town victimizing innocent people. I won't be visiting anywhere near this side of town ever again. They made one of the darkest periods I have ever had to endure seem more hopeless than I could have ever imagined. And what can I do? Take them to court? I have a picture of their bushes, with a sign hidden behind it. And a receipt of me signing the last of my money away with barely enough left for gas money to get home and sit. I can't believe this is legal, and that nothing has been done about it yet. Makes me want to leave this city.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "105473865017744639041", "name": "Peyton Yarbrough", "time": 1342908586395, "rating": 2.0, "text": "These thieves stole my car after it had been parked for about an hour in a Lakeview parking lot during non-business hours.  I walked around and finally found their tow away sign at the parking lot EXIT.  They charged me $285 and another $25 because I couldn't locate them before 6:00 AM, so $310 total.  I had to pay cash in exact change through a guy's car window.  I asked to see their license and they said they didn't have to show it to me and wouldn't.  I don't know how they did it but my car battery was dead as well when I picked it up.  I called the cops and wrote to city hall.  This has to stop.  It's extortion.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "106940049868049556945", "name": "conner beane", "time": 1472149798694, "rating": 1.0, "text": "Legal scam. Total crooks. They lay out like vultures to pray on the people.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "115225694384899332672", "name": "Bryan F", "time": 1581009369804, "rating": 1.0, "text": "extortion is all this is. if able, get a ride into southside if you need to go there.  no car, paid or not, is safe from the trash that operate this scuzzy place.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "107150281010085425531", "name": "Jane Curtis", "time": 1460813590249, "rating": 1.0, "text": "Unbelievable scam of thieves who are given a license to steal from the public. There must be something that can be done to eliminate this serious black eye. I paid the parking fee at a lot, only to come back later to find my car had been towed. When I finally located my car, the attendant was standing there with his credit card machine ready. If the company can pay the person to stand there all night and collect fees to retrieve your car, then why can't they have someone at the parking lot to keep the car from being towed in the first place? Why? Because they're thieves posing as a legitimate parking enforcement business. The city of Birmingham, if it intends to keep moving the city forward, must stop this!", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "108110618594605063085", "name": "Jeff Whitlock", "time": 1561056568982, "rating": 1.0, "text": "Will take your car - even if you're told it's ok to park there.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "110691369055691962512", "name": "Priest Ward", "time": 1463206198059, "rating": 1.0, "text": "I was towed while @Athen Flatts on 5/13/16. I also live at Athens Flatts.  I parked my rental car to retrieve a hang tag for the lot only yo return and my rental was gone. I called these extortion enforcement systems only to be told even with hang tag in hand i still have to pay $165.00 to get this vehicle back even as a resident of Athens Flatts.  This is bullshit considering I was just told the no parking signs were not up to code. This makes towing a very treacherous game. At the very least Athens Management Company could have informed residents that the hustling of any kind of vehicle parked has begun. Why hire such a thirsty ass low life towing service for enforcement. Upon trying to retrieve my vehicle I was asked for ID. With my AX Card and the drag queen at the gate informed me he wouldn't take it without id. Yet a drunk gentle man in front of me presented none at all.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "109457713645262143178", "name": "L", "time": 1461287426547, "rating": 1.0, "text": "Last night, at around 7:30, I parked in the parking lot on 2nd avenue. It's across from Collins Bar. I paid for parking. Entered the space number. I was meeting moms from my Birmingham Moms group for dinner at Bamboo on 2nd. My car was towed because the ticket wasn't visible. Which, I honestly didn't think about or notice because the screen was dark, and I entered the spot number. They charged me $165 to get my car.  They said the receipt wasn't visible. Even if it wasn't, I entered my spot number on the kiosk.The towing company said its the person who owns the parking lot kiosk, which is Crook Realty (perfect name) and not his problem, but he refused to tell me who that was or where I could contact them. And if I called back he would file a police report for harassment.\nThe only info I have is:\nParking Enforcement Systems\n2101 6th Avenue N\nBirmingham, AL 35203\n\nAgent: Christopher Mayer, 2011 Oak Lane, Birmingham AL 35226\nAgent: Christopher Mayer, 3543 Harrier Rd, Trussville AL 35173\n\nI'm beyond upset. Why go downtown and support new businesses for them to tow your car, even when you pay. Why require a parking spot number if they go by a ticket?\nI swear they must have seen on cameras I was alone, etc. Had my friend not needed a ride a few blocks away (afraid to walk alone because of the crime rate, and those begging for money) I would have been alone.\n\nAccording to Google, FAcebook and previous news articles, this is nothing new. Birmingham police even commented on it. I called city council, they told me they illegally towed my car and its larceny, and trespassing chattel.  If they know this business is doing things shady, why allow them to have a business license? Why support businesses and celebrate growth in our city only to have to worry about not only being shot, or mugged, but an unethical business that treats PAYING customers like crap.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "104039994137647402761", "name": "andrew thomas", "time": 1341683711402, "rating": 2.0, "text": "My friend had a similar experience. Her car was towed from a lot near lakeview (6th ave south and 27th street).  She was charged $285.  We both felt threatened by the people operating the lot, and the tow truck drivers.  They were abrasive and rude.  I feel like this \"industry\" needs to be regulated or made illegal.  We arrived as they were towing the car and I followed them to insure that it wasn't being stolen.  It wasn't very clear.  I'm not sure how we would have found the car otherwise.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "106912187900102434456", "name": "Christina Turner", "time": 1348859636840, "rating": 2.0, "text": "I parked at Chick-Fil-A after hours and got a permit from Black Market.  At first the guy wouldn't let me in the gate to go look at my car and show proof that I indeed had a permit.  The permit had fallen off the passenger dash.  He didn't care and refused to give me my car without paying $310.  I'm currently getting in touch with Chick-Fil-A, Black Market, the Birmingham City Council, and the BPD.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "102069383915269330929", "name": "Elizabeth Goodrich", "time": 1367378764405, "rating": 2.0, "text": "I parked beside St. Mary's on the Highlands to help my disabled sister move something into her new apartment on a Tuesday evening. No other cars in the lot- we weren't bothering anyone. Within ten minutes, my car was towed. When we went to pick it up, the men in the lot tried to charge us more money than the recording specified. This is a disgusting racket that is terrible for business in Birmingham. Sleazy, terrible operation.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "107528720521465974050", "name": "Trent Daniels", "time": 1528893791485, "rating": 1.0, "text": "Vulchers! This guy literally waited on my friend to leave his vehicle before pulling and immediately began towing his vehicle. Funny thing is, my friend HAD permission from the apartment complex to park there. Of coarse you can’t get in touch with these people. I pray to God that these people aren’t raising children", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "105485915834447364587", "name": "Brian Limbaugh", "time": 1491418784546, "rating": 1.0, "text": "wish you could give zero stars. biggest scam ever. this is whats wrong with birmingham", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "105053300358264255876", "name": "Carlos Pockets", "time": 1355645475952, "rating": 2.0, "text": "These people are thieves, nothing more.  I parked to pick up some friends from a bar and my car was towed after 20 minutes maximum.  Is this worth $300?  They towed my car two blocks.  It is shameful what they do for profit.  New York City's average towing fee is one hundred dollars less than what these crooks are charging.  Something needs to be done.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "110206252821838097229", "name": "Kyle Kilgore", "time": 1454098803977, "rating": 1.0, "text": "These people just steal your car and say you didn't have a receipt on your car's dashboard. I had one on my dashboard and these people stole my car and then made me pay $165 to get it back. I will be writing and distributing multiple press releases about the illegal crap this company is doing to people here in Birmingham", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "109583039232434051217", "name": "Edward Symmonett", "time": 1527040975621, "rating": 1.0, "text": "Bunch of thieves", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "100916762929163905969", "name": "Drew Barnett", "time": 1474596680078, "rating": 1.0, "text": "Pure extortion.", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "100035692854020838107", "name": "Marc-Cameron Kossow", "time": 1550287323747, "rating": 1.0, "text": "Scam", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "109654533438080343055", "name": "Debbie Somma", "time": 1507942221182, "rating": 1.0, "text": "Crooks", "pics": null, "resp": null, "gmap_id": "0x88891b974d059b7d:0x4540732fb6b95f62"}
{"user_id": "112948618587334555259", "name": "No No", "time": 1614689542801, "rating": 1.0, "text": "The IRS received over 100 million calls last year but only 1 in 4 callers were able to get through. I think that was an overestimate because I've been calling multiple times a day for a week now and have gotten no one to answer and received no help. The automated line is useless. Defund the IRS!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d0925af989d:0x540816c255900f5c"}
{"user_id": "117724168043315913943", "name": "dana faucette", "time": 1605208608161, "rating": 1.0, "text": "I have been trying to talk to someone about paying taxes on the insurance claim from my moms death. I'm not in the mood. Give me a person to talk to. I would give minus 5 stars.", "pics": null, "resp": null, "gmap_id": "0x889a4d0925af989d:0x540816c255900f5c"}
{"user_id": "101478209402837257124", "name": "janice miller", "time": 1618506241215, "rating": 1.0, "text": "Can not get forms or any type of information from this office . It is close all of April when people need forms and help", "pics": null, "resp": null, "gmap_id": "0x889a4d0925af989d:0x540816c255900f5c"}
{"user_id": "115795343802902892773", "name": "Maria Pharr", "time": 1620752603673, "rating": 1.0, "text": "Refund delayed can't speak to a living soul", "pics": null, "resp": null, "gmap_id": "0x889a4d0925af989d:0x540816c255900f5c"}
{"user_id": "116905503855529803653", "name": "Glynn Dykes", "time": 1583435851302, "rating": 1.0, "text": "IRS agent got very angry and started pointing his finger in my face. I was simply asking for help getting results. His ability to control his anger was not present.  You can't get anything done at this office. They just push you off to a phone number. A very non-productive group of people just looking to give taxpayers a hard time. They just have your removed from the office if they don't want to help you. To bad that person dont like his job or help his customers. Just a government paycheck to him.", "pics": null, "resp": null, "gmap_id": "0x889a4d0925af989d:0x540816c255900f5c"}
{"user_id": "116736713556836163148", "name": "rene lopez", "time": 1583938586539, "rating": 5.0, "text": "Awesome do your appointment that’s all", "pics": null, "resp": null, "gmap_id": "0x889a4d0925af989d:0x540816c255900f5c"}
{"user_id": "104699544827960283655", "name": "me to you (M)", "time": 1539635228258, "rating": 1.0, "text": "Do not waste your time and gas driving to IRS Office, 1110 Montlimar Drive, Mobile, AL.!!!!\n\nWhat a waste of time!! A security guard greets you as you enter and asks if you have an appointment. He says you have to have an appointment regardless if you drove 500 miles for nothing!! Another USELESS GOVERNMENT OFFICE THAT SCREWS THE CITIZEN.\n\nI only wanted to ask a simple question!!!\n\nWhat a waste of government funds!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d0925af989d:0x540816c255900f5c"}
{"user_id": "117259590368720056894", "name": "LA LA", "time": 1580499915675, "rating": 1.0, "text": "You must make an appt and they only have 1-2 agents in office. Great inconvenience", "pics": null, "resp": null, "gmap_id": "0x889a4d0925af989d:0x540816c255900f5c"}
{"user_id": "104543828145120768282", "name": "Nikki Hays", "time": 1423493726944, "rating": 5.0, "text": "Love this site", "pics": null, "resp": null, "gmap_id": "0x889a4d0925af989d:0x540816c255900f5c"}
{"user_id": "107238062202817080736", "name": "Trey Hamilton", "time": 1549323768089, "rating": 4.0, "text": "Good food when in a hurry! Service is fine but customers were always in a rush when I was there. Wouldn't want to eat there for longer than a few months, but when a must it's good enough!", "pics": null, "resp": null, "gmap_id": "0x888e86a37aa4bc97:0x93ec51abd46433bb"}
{"user_id": "108050248859925564176", "name": "Sherri Brooks", "time": 1568256959944, "rating": 3.0, "text": "Awkward dining experience... people stand at the tables and stare at each other until someone tells them to sit. Staff yells a lot. Was rushed eating because they have strict waiters. Overall food was pretty good.", "pics": null, "resp": null, "gmap_id": "0x888e86a37aa4bc97:0x93ec51abd46433bb"}
{"user_id": "106723711134367862155", "name": "kenneth matheson", "time": 1566739114528, "rating": 5.0, "text": "They didn't have the Chardonnay my party and I originally requested, and my filet mignon was slightly overcooked 😁 However, the staff are amazing, flexible, and very friendly. For serving thousands of meals a day, they're doing an incredible job!", "pics": null, "resp": null, "gmap_id": "0x888e86a37aa4bc97:0x93ec51abd46433bb"}
{"user_id": "107281424578429120203", "name": "Shane Waldrop", "time": 1561825469565, "rating": 1.0, "text": "Nice staff but food gives me the runs half the time.", "pics": null, "resp": null, "gmap_id": "0x888e86a37aa4bc97:0x93ec51abd46433bb"}
{"user_id": "107025803149515894336", "name": "samantha williams", "time": 1602004006501, "rating": 5.0, "text": "Super professional and helpful with resource information", "pics": null, "resp": null, "gmap_id": "0x888cf2c429fc7753:0x4918099aed0958ec"}
{"user_id": "105946262325231529260", "name": "venus9 Cotton", "time": 1597338034573, "rating": 5.0, "text": "Very professional and good customer service", "pics": null, "resp": null, "gmap_id": "0x888cf2c429fc7753:0x4918099aed0958ec"}
{"user_id": "114477015149495090697", "name": "Teresa Archie", "time": 1589168409360, "rating": 5.0, "text": "Place is really good, about.helping people!", "pics": null, "resp": null, "gmap_id": "0x888cf2c429fc7753:0x4918099aed0958ec"}
{"user_id": "102586673712111375548", "name": "Larrecia Shealey", "time": 1589391130308, "rating": 1.0, "text": "Can never get answer here", "pics": null, "resp": null, "gmap_id": "0x888cf2c429fc7753:0x4918099aed0958ec"}
{"user_id": "108217544397285198792", "name": "Michael Pearson", "time": 1575303415537, "rating": 2.0, "text": "Don't give you main number to call", "pics": null, "resp": null, "gmap_id": "0x888cf2c429fc7753:0x4918099aed0958ec"}
{"user_id": "110159666459884368909", "name": "Carmen De Hostos", "time": 1593632499633, "rating": 2.0, "text": "(Translated by Google) They never answered the call\n\n(Original)\nNunca contestaron la llamada", "pics": null, "resp": null, "gmap_id": "0x888cf2c429fc7753:0x4918099aed0958ec"}
{"user_id": "112801956661950878690", "name": "James Lee V", "time": 1559060421600, "rating": 5.0, "text": "I am a libertarian and usually have nothing good to say about the government. However my experience with trying to get my property tax rate adjusted with the Shelby County Tax Accessors office was shockingly wonderful. They listened to me and were completely fair. They even went out of their way to help me with information about the tax system and rules that helped me out. I know other people have their own opinions but my experience was that if you are open and honest with them they are very helpful as fair.", "pics": null, "resp": null, "gmap_id": "0x888937ba629de22d:0x5c526840b8f50a2f"}
{"user_id": "101580725140614288024", "name": "Stephanie Young", "time": 1510170631474, "rating": 1.0, "text": "Horrible and rude! Will not work with you at all!!! I thought Jefferson County was bad... I have all my legal documentation to prove I don't owe this hellacious amount of taxes they are collecting on for my new home purchase that I filed Homestead on, on time. The previous homeowners owe it. They are just making the rules up as they go! Calling a lawyer now!!! I'm not going to pay someone else's taxes on a house that I did not own, or live in at the time!!! Simple as that! They also made the comment Shelby County is better than Jefferson County. I think not with that attitude! Huge ego!", "pics": null, "resp": null, "gmap_id": "0x888937ba629de22d:0x5c526840b8f50a2f"}
{"user_id": "104871362465258701829", "name": "Diego Carmona", "time": 1535145973973, "rating": 1.0, "text": "Pam was so Rude! They expect you to know everything! Horrible service!", "pics": null, "resp": null, "gmap_id": "0x888937ba629de22d:0x5c526840b8f50a2f"}
{"user_id": "107538886483988363258", "name": "April McCullough", "time": 1497985268815, "rating": 1.0, "text": "hung up on me for asking a question about library taxes. ridiculous.", "pics": null, "resp": null, "gmap_id": "0x888937ba629de22d:0x5c526840b8f50a2f"}
{"user_id": "104804338498608459098", "name": "Champ Ion", "time": 1544043704595, "rating": 1.0, "text": "VERY VERY VERY RUDE.I called for basic info. Is this how \"loving\" bham treats people?", "pics": null, "resp": null, "gmap_id": "0x888e81792c5057c7:0x7631e545a43f3051"}
{"user_id": "116893147674134217288", "name": "James Ransom", "time": 1593717684602, "rating": 5.0, "text": "They are always helpful. They are needed in this area.", "pics": null, "resp": null, "gmap_id": "0x888decfe7f76fed7:0x580d0ddc8b1f6a3d"}
{"user_id": "104137371332312084646", "name": "Theodore Scott", "time": 1588850875606, "rating": 3.0, "text": "Nice ppl", "pics": null, "resp": null, "gmap_id": "0x888decfe7f76fed7:0x580d0ddc8b1f6a3d"}
{"user_id": "117587584719405946006", "name": "LivingOurDreamNow", "time": 1571872367997, "rating": 5.0, "text": "Visited the Bankhead National Forest Ranger District Office.  The staff provided quality information.  We decided to hike out to the Caney Creek Falls.  The short 1.5 mile out and back hike was sure worth the effort.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO9vB18C11MZ4hWWcED3-GLc9n2-kB2O7GJDA2f=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO9kGNNPpcwteOg0EVM6hW6tE_rL3kmeF7UHYKy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM1HAnmyEhiQ1mJFaxFUvAhUPQheNYaq-Kkh0yW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPela1mLsy2Z2bAbZjBEVXPR8fcsTuTCs2rjzYi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNcN-iwLXj8Ybl5Ods0EPuvyKy-f1rszU6OGxbf=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNkuAgc39jM-nUlPJNS0oyBrh_X1FVtNmFFQjon=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO86-cQKogB_fK3BFk6_Un7aoViJPZF9RaMuwTg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOAOeM9lc_kctVpL85sEndlKyRELKhs2WkJ59k6=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88880d9367ad2e99:0x408f0ba2964f920a"}
{"user_id": "103956491695534443273", "name": "Ken Johnson", "time": 1509200815044, "rating": 5.0, "text": "The staff was very helpful in helping us choose a hiking destination in the Sipsey Wilderness.", "pics": null, "resp": null, "gmap_id": "0x88880d9367ad2e99:0x408f0ba2964f920a"}
{"user_id": "104186857667142205186", "name": "Abu Anas", "time": 1579041641582, "rating": 4.0, "text": "Great service. Very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb4d39312cbe7:0x36f2967e1698640b"}
{"user_id": "108968815426128658343", "name": "mo jadah", "time": 1553201375436, "rating": 1.0, "text": "They rob you because they know you have no other choice . My bill keeps increasing and no one can tell me why. Also, talked to several people who all agree they charge certain neighborhoods differently. Somehow, people in some of the nicer areas are paying ridiculously low amounts.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "107551427947573041590", "name": "Jolisa Maybin", "time": 1535644300054, "rating": 1.0, "text": "Don't move to Dothan... Cause this is the only electric company that's here and it really sucks. They just want yo money. That's it ! Ain't no trynna help you out. I suggest go somewhere with Alabama power they are awesome", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "110056337755262921040", "name": "Bradley Ripple", "time": 1555868513097, "rating": 5.0, "text": "I have lived in other cities and Dothan is by far the best! Very little outages and fast restore! Plus if you live within the city all is on one bill", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "113603197524621215911", "name": "Wm Peyregne", "time": 1503596890330, "rating": 5.0, "text": "Okay Dothan! Before you get all upset about nothing, just hear me out. Learn some manners towards your fellow neighbors.  How about a lesson in mathematics;  there are 6 counter representatives that assist walk-ins, drive-through payment area and answering calls. I was there for 45 minutes waiting in-line to open a new account.  I pulled my number and waited my turn as all of you. During my wait, all I heard was complaining about the wait time and no room for people sit and so on and so on.  This is a small town with limited resources available without rising your city tax again. Yes, I agree with you, somethings could be changed. Larger lobby area, better drive through access, one parking lot, crosswalk to stop cars from running you over, and more understandable web site. Voice your negativity at the City Counsel meetings not to employees. It's up to us to create change not them. Thanks Dothan Utilities employees for making my visit a pleasurable one. Hang in there.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "103367840874504316725", "name": "Marie Garvin", "time": 1526400422733, "rating": 1.0, "text": "Haven't received one bill from them. Ever. I always have to call and get account information to pay online. I have done it for 3 years and all of the sudden they tell me I can't because it's in my husbands name and not mine. Really???? I'm wanting to pay the bill and you don't care. Praise God this will be the last bit you get from us. Thankful for putting a well in.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "114285541317796031917", "name": "Christin Paige", "time": 1502471596964, "rating": 1.0, "text": "If i could give less than one star i surely would. For starters my deposit was $600 and they said it was based on my credit (( my credit score is a 712 )), then they charge you a large amount for connection plus your first bill (( it was nearly the amount of my rent )) , and finally i had a change of employement , went in to request a 4 DAY EXTENSION which i have never done before, and after waiting for 45 minutes ( after being told to take a number and have a seat )) I still was not seen. The people that work here are an understatement of rude, and have no desire to actually help anyone, but simply to take your money and go on to the next one. This company would be so much more pleasant if they looked into hiring individuals who actually had CUSTOMER SERVICE EXPERIENCE, AND POSITIVE ATTITUDES . This could go on and on but long story short, if you wanted to be treated as a person this is not the place to go.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "117791156545673223743", "name": "Christopher Gardner", "time": 1466554221326, "rating": 1.0, "text": "Typical 3rd world quality.\nThis \"business\" charges you a huge deposit when you have to pay for move in costs. I imagine more fun will unfurl as I continue to live under their territorial purview. Maybe they are trying to keep out low income residence, which is also poor taste, but this practice for a service feels like theft.\nPlain and simple, give me back my deposit and quit skimming your customers for investment cash.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "100341003612451534907", "name": "Claire Mognceia", "time": 1513702780836, "rating": 1.0, "text": "They don't care about helping you. They'll cut your power off the day they send you a bill, and God forbid you get upset about it. Their website hardly ever works especially if you want to pay via mobile. It could take an hour for your power to get turned back on or it could take 3 days. Not to mention your bill will never be a steady amount. Try your best to avoid using this company. It's in your best interest to go somewhere else.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "107248936772708766377", "name": "Misspm07", "time": 1504830497418, "rating": 1.0, "text": "This company is horrible. They give you the run around about after hours help. They cut your lights off scarily quick. Then when you have to call police dispatch to get someone to turn lights back on the service man is so rude. I wouldn't recommend their service to the devil himself. Giving them one star is too polite.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "101368979340532710539", "name": "Michael Addesa", "time": 1487880385599, "rating": 1.0, "text": "Here's it is simple. Everyone who's posted something is telling the truth. They are a garbage company. Everyone inside the building where you start and pay. Needs to be fired. They suck at customer service. And if the front desk suck at their job. Then the management sucks to. If I have a choice which I doubt. Go with alabama Power. They made moving in and out painless.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "110201482242739771997", "name": "Robert Locascio", "time": 1489162130469, "rating": 1.0, "text": "Haven't received a single bill from them, I've called and complained and nothing. I have forgotten to pay my bill because of this and have had to wait 8 hours for them to turn it back on. I just want to receive a bill or email, not asking for much.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "110282555171589453657", "name": "Tiffany Butterfield", "time": 1539297643863, "rating": 1.0, "text": "I hate dothan utilities. The only good thing is they include everything together. They are ripping people off.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "103224350726438997487", "name": "pearl curry", "time": 1494619404528, "rating": 5.0, "text": "Very  pleasant.   Willing to reach out and help  while I was  out of town.  Hometown  people.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "101022695291606834084", "name": "Dontaiz Rouse", "time": 1497289647958, "rating": 1.0, "text": "These people are horrible to work with. They can not follow simple instructions. I gave them detailed instructions on where to send my security deposit (which was an outrageous amount in comparison to other power companies $250) and a week later I found out it was sent to an address that was completely wrong. Upon writing this, it has been two weeks, and still haven't received my money", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "114509550528141453092", "name": "Diana Bordsen", "time": 1512155578192, "rating": 1.0, "text": "Seems we could get a class action lawsuit. This is a monopoly as we have no choice to pick Alabama Power. They have no reason for good Customer Service as you don't have a choice. Do as they say, or......? We had our power turned off unexpectedly. Figuring it was just a power outage, we waited. Later that day when the mail came, there was a shut off notice in the mail. When I called to straighten it out, we were told \"that was just a \"courtesy letter\". By the way...Can anyone find a phone number to report outages? They use to have one. Now the only number that I can find answers \" Dothan Utility Collections\". Do they not have a Main Number? Just wondering!", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "113454020857107812237", "name": "Alissa Frazier", "time": 1501345037132, "rating": 1.0, "text": "Dothan Utilities full of it my power went out today they came out but guess what still no power what they get paid for and what we pay our bill for no need to pay a bill if ur power going to keep going out this is crazy so now I'm sitting here with no power. Can't feed my kids lunch now that's mass up.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "113116794661792753786", "name": "Angela Hill", "time": 1518810230324, "rating": 1.0, "text": "If I could give a Zero I would.  No customer service. They are rude and disrespectful. Everyone need to be fired and all new hire with better training.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "116592204685591143428", "name": "Jeffrey Dempsey", "time": 1524782168456, "rating": 1.0, "text": "The way some of these employees treat customers should be illegal... we are going solar soon just so we don't have to deal with them anymore", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "113454020857107812237", "name": "Alissa Frazier", "time": 1501345037132, "rating": 1.0, "text": "Dothan Utilities full of it my power went out today they came out but guess what still no power what they get paid for and what we pay our bill for no need to pay a bill if ur power going to keep going out this is crazy so now I'm sitting here with no power. Can't feed my kids lunch now that's mass up.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "113116794661792753786", "name": "Angela Hill", "time": 1518810230324, "rating": 1.0, "text": "If I could give a Zero I would.  No customer service. They are rude and disrespectful. Everyone need to be fired and all new hire with better training.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "109665710911726709899", "name": "Matthew Houston", "time": 1521639332476, "rating": 1.0, "text": "So I've been a customer since 2016 since I moved to Dothan(Not that I have a choice on who I receive electricity from). Never been late paying my bill once and my electric bill is usually 50-80 dollars a month so it's not that much of a concern, but anyways so I forgot about paying for the first time. Has that ever happened to anyone else? You forget to do something? Well it happened to me after being less than two weeks late paying my bill of 70 dollars my power was shut off. Of course they were closed by this point so i had to call and after being on hold for about 30 minutes I was told that they were sending someone over and that I would have to pay a reconnection fee and then be in their office by no later than 12:00pm the following day. I understand that I was late paying my bill and it's no one's fault but my own, but the way this was handled is demeaning and I personally don't appreciate it. If i had another choice in electricity I would be going somewhere else, but they have a monopoly and are not very concerned with delivering exceptional customer service.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "107203818827726504559", "name": "Renee McGriff", "time": 1487009797977, "rating": 1.0, "text": "One star is way too much for these people.  Horrible customer service, they take you off hold and tell you to hold again.  Very high rates. Rates are 3 times higher than alabama power or wiregrass electric.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "107543394613470604599", "name": "Tim Bigham", "time": 1549067983891, "rating": 1.0, "text": "No customer service at all they don't deserve one star.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "106922938431891344728", "name": "Olliesaurus Rex", "time": 1494591000710, "rating": 1.0, "text": "Incredibly rude and unwilling to work with you. They give 1-day notices and even though we paid that day they still cut power.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "107962701879013159595", "name": "Eugene McElvin", "time": 1498796641975, "rating": 1.0, "text": "Dothan City As A Whole is a Joke in the state of Alabama poor Service from the entire city. Plus it's these so call city commissioners that don't care all they are about personal gains ask them a question it's like asking a brick wall Dothan City is still stuck in the 1950's", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "102434084180535713387", "name": "robert owens", "time": 1475177876057, "rating": 5.0, "text": "Very pleasant. Very nice enployees..", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "115246110706480431623", "name": "Levi James", "time": 1518634559823, "rating": 1.0, "text": "They are after one thing, the money that you don’t have. They just don’t care about anyone including the elderly.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "109135484676467390746", "name": "Swee Pops", "time": 1544998650223, "rating": 1.0, "text": "It's a 1 because I couldn't give a zero.  What an awful department.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "114200599263765987671", "name": "Rex Blackshire", "time": 1517123641080, "rating": 1.0, "text": "r u n . these cranky ladies live on vengeance and are dedicated to making you feel small and patronized.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "105811339970125173571", "name": "Mikel", "time": 1486655936528, "rating": 1.0, "text": "Be ready to pay them your full check when starting an account and don't be surprised when you see your bill. . You'll probably never get your deposit back . . And they give you the run around inside the building, o and last you get a receipt as a contract and make you pay for your copy .  . Just a warning ! ! !", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "113585105315297649017", "name": "Raymond “Chronosyn” Fickett", "time": 1557684750375, "rating": 1.0, "text": "How can a company that takes such an obscene amount of money from people be such trash?", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "113645013176660039768", "name": "Stavious Carter", "time": 1524498063721, "rating": 1.0, "text": "Bad costumer service the utilities half", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "106224204915613957930", "name": "edgar gomez", "time": 1545232205298, "rating": 1.0, "text": "Customer service is terrible but don’t have a choice.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "107164591860085409341", "name": "Adam Topoozian", "time": 1533856256854, "rating": 1.0, "text": "Straight up robbing folks", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "109667923191459200642", "name": "Bigerv Express", "time": 1519649400759, "rating": 1.0, "text": "They are straight Trash!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "105462905936717388288", "name": "Wade Xman", "time": 1536177630478, "rating": 1.0, "text": "this place is a JOKE !", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "115984385700092467074", "name": "Jesse Griffin", "time": 1518528682023, "rating": 1.0, "text": "Just pitiful", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "103656118571398457624", "name": "Jessica Cottrell", "time": 1525756970107, "rating": 1.0, "text": "Charge Too Much!!!! And whats up with the DARN CREDIT CHECK!", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "114149696050482788418", "name": "Elijah Ellis", "time": 1454015473467, "rating": 1.0, "text": "In comparison to Alabama Power, these people are clueless.", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "106326214674678040574", "name": "leslie westberry", "time": 1506372309742, "rating": 2.0, "text": "Slow", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "106152709441547514531", "name": "Brandon Childree", "time": 1515189688012, "rating": 1.0, "text": "Not sending out e billing out to people there rude gives you a to soon disconnect notice i have no choice to use these people we need a better company here", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "115019434756583712652", "name": "Brandy Smith", "time": 1484571444598, "rating": 1.0, "text": "Too high!  Very unfair", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "110619008545425224600", "name": "Amie Smith", "time": 1468112473790, "rating": 1.0, "text": "Terrible company...extremely to high!! The deposit system is a total rip off!! I feel sorry for people that don't have the means to pay such!!", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "109585454916437846834", "name": "Thegawd VEGITO!!!?!!", "time": 1507497764449, "rating": 1.0, "text": "Horrible and the bills are extremely to high and they don't seem to care about they customers at all", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "110168812039930086015", "name": "Seth McCollough", "time": 1470775844855, "rating": 1.0, "text": "Horrible!!!!!!!! Total rip off!", "pics": null, "resp": null, "gmap_id": "0x88929300cad93937:0x8c8404044a80b7b0"}
{"user_id": "104845521257877073178", "name": "Erick Saks", "time": 1583277326802, "rating": 5.0, "text": "Officer Training School - For some reason Google refuses to accept that this is not the Holm Center 🤔", "pics": null, "resp": null, "gmap_id": "0x888e86a490400001:0xd4b11c7ef8725874"}
{"user_id": "102836379147657333805", "name": "Carie Frost", "time": 1594119756902, "rating": 5.0, "text": "Nice building", "pics": null, "resp": null, "gmap_id": "0x888e86a490400001:0xd4b11c7ef8725874"}
{"user_id": "111488831251573542750", "name": "Benjamin Allen", "time": 1550355517419, "rating": 5.0, "text": "Fly fight win", "pics": null, "resp": null, "gmap_id": "0x888e86a490400001:0xd4b11c7ef8725874"}
{"user_id": "115677354975600494668", "name": "Brittney N. Oakley", "time": 1541802285938, "rating": 5.0, "text": "Took a trip with our 4 year old daughter here @ the Von BraunCenter. We went to the \"Jurassic Quest\" (dinosaurs) we had a blast. Seeing ask the dinos.. She even got to ride a dinosaur. Plus me & her both got our face painted. We had  so so much fun. We had a blast.  Definetly will be going back in near future again for more of their \"Jurassic park quest\" adventures :)", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNegL-fqzNQ6P8n9tzvte9RoL6fdnIWuW2j-n-V=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMdinqateA7qFKs4PAgpB_V452Q2yyRR4zLlc-e=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNLmchPvUoE0e1yurTYM37RQXF5xJcczH-lKWxq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPCe2Gtoyt9laTppdXuPhS3DBg21ERzrSlRL1Om=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMcVgopVqf044O0EkGEGUhKjK7HJ2vWsTGmqWq7=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOOq48ftbtZ65kqzRzTAIaOEcW35jN8ZvejzorJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPuBxKvLyexoEXcTTmyWDk1q4BCL-dO0O43Qpij=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOGg5ebw7NeBBDFBXrr5WwxBiLU9S8smCw3HyQo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM1QRR-jHuxk17NbD1dD8qPU81WvejChZatvtxE=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626d92ab97c3f5:0xe247f4d1601805e6"}
{"user_id": "103346707282955159231", "name": "Rick g", "time": 1527102379675, "rating": 5.0, "text": "Nice venue. Not too big. Easy to get in and out of parking.", "pics": null, "resp": null, "gmap_id": "0x88626d92ab97c3f5:0xe247f4d1601805e6"}
{"user_id": "105734037768932705438", "name": "Rita Turner", "time": 1533749769150, "rating": 4.0, "text": "Nice entertainment venue!  Great shows!", "pics": null, "resp": null, "gmap_id": "0x88626d92ab97c3f5:0xe247f4d1601805e6"}
{"user_id": "107762235413680156701", "name": "Sam NA", "time": 1533965353489, "rating": 5.0, "text": "Beautiful venue and grounds, top notch!", "pics": null, "resp": null, "gmap_id": "0x88626d92ab97c3f5:0xe247f4d1601805e6"}
{"user_id": "106669975643861502461", "name": "Bob Monty", "time": 1512583964350, "rating": 5.0, "text": "Hey marvelous Children's Theater.", "pics": null, "resp": null, "gmap_id": "0x88626d92ab97c3f5:0xe247f4d1601805e6"}
{"user_id": "109213003174968680924", "name": "rita turner", "time": 1533476079763, "rating": 4.0, "text": "Nice entertainment venue!", "pics": null, "resp": null, "gmap_id": "0x88626d92ab97c3f5:0xe247f4d1601805e6"}
{"user_id": "103081497014169306673", "name": "Sabrina McDonald", "time": 1531959681236, "rating": 5.0, "text": "That's my job", "pics": null, "resp": null, "gmap_id": "0x88626d92ab97c3f5:0xe247f4d1601805e6"}
{"user_id": "108624264582240892779", "name": "Richard Garland", "time": 1528041591139, "rating": 5.0, "text": "Nice venue", "pics": null, "resp": null, "gmap_id": "0x88626d92ab97c3f5:0xe247f4d1601805e6"}
{"user_id": "107811843898030150947", "name": "Ann Wood", "time": 1602739922195, "rating": 5.0, "text": "I was in an accident and these police officers were so professional, helpful and kind. They are the best.", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "111659191304811028894", "name": "MrJonugget", "time": 1591746260786, "rating": 1.0, "text": "I called the Department of Public Health to inform them that we had just left a business, that is supposed to be at 50% capacity, but were totally ignoring the Covid-19 guidelines that they had posted everywhere. After explaining what we had experienced, I was told that this business was absolutely in violation and could be fined or even shut down. They advised me to call the local law enforcement, which is Foley Police Department. When I called, the lady who answered the phones informed me that all of the Covid-19 guidelines put forth by the governor, were merely suggestions. Obviously  the almighty dollar is more important than everyone’s health. Thanks so much for your help, Foley PD!", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "117799273793683767359", "name": "J", "time": 1566167087561, "rating": 5.0, "text": "Witnessed a minor car accident today. Called Amy at the PD; she was very alert, attentive and kind in taking the info for the call. An officer arrived in 12 minutes and instructed both the members involved how to proceed. Everyone was safe and calm. Thank you Foley PD for your service!", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "103733386563679037662", "name": "Chris Hoonbag", "time": 1598139422033, "rating": 1.0, "text": "Kids hang out in the academy parking lot with loud radios and bad language coming out of radios, I do not recommend shopping here. Police department said they could not do anything. This is\nMy last vacation here.", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "103182040948510353171", "name": "Gail Wins", "time": 1588157380622, "rating": 5.0, "text": "The FOLEY FORCE,  just AWESOME 🇺🇸", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "104611517392606409333", "name": "Ricky Howard", "time": 1560766916263, "rating": 5.0, "text": "These officers deserve and WILL get respect. Shout out to my fav peeps😄 thanks for the serve and protect men and women in blue!", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "104650074200748157122", "name": "Kayleigh Wilson", "time": 1590447476450, "rating": 5.0, "text": "Extremely fast, friendly and professional!! Thank you Foley PD!!", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "107777898807619487692", "name": "Debra Dixon", "time": 1564341322480, "rating": 5.0, "text": "I work in Orange Beach Alabama and get off on exit 49 at the Buc-ee's to go to work 5 days a week. The exit is almost always backed up but never have I seen anybody sit on the shoulder of the road in a line waiting to get off the exit. There was as least 10 cars on the shoulder of the road before we even came upon the exit. I wasnt sure what was going on, I thought maybe there was a wreck so I continued to slow down until I saw the exit lane appear and when I did I turned on my blinker so I could get over. I saw an officer in a police truck with Owens Cross Roads on the side and assumed the police would surely let me over. I continued inching slowly to the right with my blinker on and the police officer pushed forcefully up so I couldnt get over and then rolled down his window and started yelling at me, \"you better watch where you're going.\" I am in shock at how disrespectful and rude you're police officer acted when a car is simply trying to get over in a correct and legal manner. I can't believe your police officer would rather have a car sit at a halt on I10 blocking traffic than let them over. Chivalry is surely dead.\n*I posted this on the Owens Cross Roads police department page as well but thought I should post here also so the Foley police department is aware that people are now using the shoulder as a new turning lane. I have not had any problems with the Foley police department. *", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "116987898473313041978", "name": "Noah Longshore (Cooljerk69atgmail)", "time": 1486522293139, "rating": 5.0, "text": "Decent people work here..give respect to get it", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "106661301735559142860", "name": "Natasha Phillips", "time": 1535877955504, "rating": 5.0, "text": "Everyone was very nice.", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "100665965008898744223", "name": "Chris Uptagrafft", "time": 1536595387139, "rating": 5.0, "text": "Blue lives matter", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "101024238584605769557", "name": "Brian R", "time": 1450172745514, "rating": 5.0, "text": "Responded very quickly & helped with my mother's wreck. Thank you", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "100761976214908395391", "name": "Vic Robertson", "time": 1554727161650, "rating": 5.0, "text": "The Aviation & Missile Center has a critical mission for the United States Army.", "pics": null, "resp": null, "gmap_id": "0x88626d8b45f64dd7:0x75ba64f9940713a5"}
