{"user_id": "115878511567537051728", "name": "Leslie Huggins", "time": 1488646493255, "rating": 5.0, "text": "Excellent Customer Service!  The new manager Bradley is so very helpful and very informative", "pics": null, "resp": null, "gmap_id": "0x886284775f3c5059:0xbafeea3c0144781"}
{"user_id": "106889816728629286135", "name": "Laron Hardy", "time": 1513822370308, "rating": 1.0, "text": "Terrible customer service!!  Waited an hour to talk to someone. Told two different people I had gift cards to return when I first got there. After waiting an hour, the manager told me all sales were final on gift cards. They took advantage of my mother (who is 81 and suffering from dementia) by selling her AT&T gifts cards that she thought were prepaid Visa cards.", "pics": null, "resp": null, "gmap_id": "0x886284775f3c5059:0xbafeea3c0144781"}
{"user_id": "106091066261240355196", "name": "David L Casteel (MonkC)", "time": 1490898541195, "rating": 5.0, "text": "Helpful employees", "pics": null, "resp": null, "gmap_id": "0x886284775f3c5059:0xbafeea3c0144781"}
{"user_id": "107138705211410703313", "name": "The Stig", "time": 1622642207583, "rating": 5.0, "text": "Honest, trustworthy, quality work and priced right. These folks have earned my business!", "pics": null, "resp": null, "gmap_id": "0x88626b3734ae82bb:0xf27ed5d9c5ec4eaf"}
{"user_id": "105522451081100639715", "name": "Andrew Washko", "time": 1619974281953, "rating": 5.0, "text": "Good service..Good people", "pics": null, "resp": null, "gmap_id": "0x88626b3734ae82bb:0xf27ed5d9c5ec4eaf"}
{"user_id": "118358225781610162759", "name": "Mr High", "time": 1593015696136, "rating": 4.0, "text": "Do good a/c repair .", "pics": null, "resp": null, "gmap_id": "0x88626b3734ae82bb:0xf27ed5d9c5ec4eaf"}
{"user_id": "108098061022280726841", "name": "Robert Jeter", "time": 1507125657517, "rating": 5.0, "text": "If you need auto air conditioning take your auto to Smith Enterprises they treat you right and fair.", "pics": null, "resp": null, "gmap_id": "0x88626b3734ae82bb:0xf27ed5d9c5ec4eaf"}
{"user_id": "105461899841818891099", "name": "T Price", "time": 1576808859334, "rating": 5.0, "text": "Noma Stewart at AT&T is the best. She was so patient with us and answered all our questions. She really helped us transfer from Straight Talk and set up our new accounts. Excellent Service all the way around!", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "108574540768319966793", "name": "Jacob Gilliland", "time": 1574103358879, "rating": 5.0, "text": "Kris the manager here is great! He got me and out in under an hour and even got me the free phone there offering and broke down the detail. Excellent experience!", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "110040008580768822234", "name": "Donny Oglesby", "time": 1574091590482, "rating": 5.0, "text": "The store was amazing helped me get a new phone and DirecTV! I never knew how cheap it was!! Will definitely go back for all my future business", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "114695900718133455186", "name": "leesha Johnson", "time": 1556545989670, "rating": 5.0, "text": "I visited this location last week and the young lady Jasmine was awesome. She explained to me why I was having issue and after checking my account she saw I was eligible for an upgrade. She took her time and explained things to me and she did it with a big smile on her face. Way to go AT&T you guys have a rock star on staff. Thanks Jasmine.", "pics": null, "resp": {"time": 1557511430305, "text": "Thanks for the shout out, Leesha!! We LOVE hearing about the wonderful experiences our customers are having in our stores! It is our mission to make our customers #GenuinelyHappy, and I'm so excited we could make that happen for you!! Thanks for being a loyal AT&T customer!! Great job taking care of the customer, Jasmine!"}, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "104153460360914270776", "name": "Jeremy combs", "time": 1574089701596, "rating": 5.0, "text": "Great service from a friendly staff. The manager Kris is a stand up guy that will shoot you straight and go out if his way to make sure he takes care of you.", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "107605275165269486105", "name": "Kobe Glover", "time": 1556547330649, "rating": 5.0, "text": "Jasmine is beyond amazing. This lady was more than knowledgeable and professional she helped me througout my whole experience in the store due to me being a first time buyer. Her positive attitude, welcoming behavior, and professionalism needs a raise or promotion ASAP", "pics": null, "resp": {"time": 1557511399968, "text": "Thanks for the shout out, Kobe!! We LOVE hearing about the wonderful experiences our customers are having in our stores! It is our mission to make our customers #GenuinelyHappy, and I'm so excited we could make that happen for you!! Thanks for being a loyal AT&T customer!! Great job taking care of the customer, Jasmine!"}, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "112567030460311935140", "name": "Latosha Taylor", "time": 1563385662596, "rating": 1.0, "text": "Had a AT&T salesman to sell me two phones on Saturday. I was told that I had 3 days to exchange my phones with no issue. I called the salesman on Sunday and he agreed to meet with me on Monday but he had an emergency, and I was told to go to the store and swap phone out. I get to the Hoover AT&T store and was told that I would be charged a restocking fee and would have to pay additional taxes to swap phones, none of this I was told before hand. I am now stuck with a phone that does not have good service in my area at home and calls are dropping. I am not at all happy! Plus my old phones that were paid for , the salesman has them. This has been a horrible experience. I called the store and the manager is out of town and AT&T does not have a corporate office (per store rep) or anyone that can help me. I will have to leave a message. Again, this has been going on since Sunday... SMH!! If I had of known about the customer service or lack of info, I would have stayed with Tmobile.", "pics": null, "resp": {"time": 1564182427747, "text": "Latosha, we are very sorry to hear about the experience you had in our store! Please reach out to our Customer Support team at http://bit.ly/ATTExperience so that we can work with you to resolve these concerns!! Our mission is to make our customers #GenuinelyHappy, by creating a premier environment for our customers to shop! Thanks for being a loyal AT&T customer!!"}, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "112121798136811548199", "name": "Allyson Rosser", "time": 1553197719279, "rating": 5.0, "text": "Johnathan was absolutely amazing! He was patient and helped me find the perfect phone case! I will be back to this store", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "113008263168562394695", "name": "Marian McKinnon", "time": 1561825823879, "rating": 5.0, "text": "The location in Riverchase Galleria Mr Kris Fuller was extremely helpful and very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "116273673295632384303", "name": "Nancy Hamilton", "time": 1563659928334, "rating": 1.0, "text": "The store by Sprouts don't go there. I wanted to switch my service out of my mother's name to mine. Sales person lied to me. Told me I had to cancel service and start new service. That was not true. My bill went up and they want do anything about it. They know she lied but refuses to do anything. Been dealing with since March. The admitted it was a way to make money. DO NOT GO THERE. Yes I have spoken with sales person and two managers. Was told Friday it is all about money from manager. Hate to post this on FB but people need to know", "pics": null, "resp": {"time": 1564174486101, "text": "Nancy, please accept our apology for the experience you had in our store! We really appreciate you bringing this to our attention, as we are always looking to improve our customers experience in our stores! It is our mission to make our customers #GenuinelyHappy, and I'm really sorry we weren’t able to accomplish that for you this time!! If you'd like to share your feedback with our Customer Support team, please reach out to us at http://bit.ly/ATTExperience, as we’d LOVE the opportunity to work towards improving your experience! We look forward to hearing from you! Thanks for being the best part of AT&T!!"}, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "116762667849123169922", "name": "deidre moore", "time": 1553629631035, "rating": 5.0, "text": "Jasmine was really nice and well knowledge of all the products. Thanks so much for being nice and helpful.", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "101664272891102094889", "name": "nick ballenger", "time": 1574090804797, "rating": 5.0, "text": "Amazing service and very low wait time!", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "101606578763946097934", "name": "Terrence jones", "time": 1553703526989, "rating": 5.0, "text": "Awesome staff and I am glad the Store Manager Jasmine is back! She is awesome!", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "108162706971567362362", "name": "Tylan", "time": 1527738933179, "rating": 4.0, "text": "Impeccable service from the staff and manager. Very helpful to the extent of what they are able to do in store. The selection of cases and phones are large and in charge with plenty of options to look at (as long as you aren’t getting lost in the mega tv in the back usually playing a sport channel lol) My only wish is that they could actually receive the Apple watches as they have been expecting for months and still nothing yet. Maybe soon? I hope so", "pics": null, "resp": {"time": 1527796643892, "text": "Thanks for the excellent feedback, Tylan! Happy you had a good experience in our Hoover store--and keeping our fingers crossed that they get the inventory you're looking for in soon!"}, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "118201674164790815165", "name": "Candice Reed", "time": 1555710028129, "rating": 5.0, "text": "Loveddddd the atmosphere! Every one was so nice and helpful!", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "105307669998744525629", "name": "Susan Darby", "time": 1533607327103, "rating": 5.0, "text": "Ty Hallmark was the best resource I have ever had for any type of cellular purchase or service.  My husband and I bought new phones and Ty provided the best customer service that we have ever had.", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "100701921981285975240", "name": "Joel Pike", "time": 1574094506521, "rating": 5.0, "text": "Super helpful, quick, knowledgeable, and a great friendly atmosphere!!", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "103750346457568919078", "name": "Remy Helu", "time": 1531677368349, "rating": 1.0, "text": "They wear more intrested in the Taco Bell than the customer when I got passionate about my issues the manager asked to leave.. WOW.. only one way you get as t company cancel there service DiShane", "pics": null, "resp": {"time": 1531755656151, "text": "Hi Remy,\nWe are sorry to hear this! If you have any follow-up questions from your visit, please feel free to reach out to us here and we'll be happy to have our customer service team reach out: https://springmobile-customerservice.zendesk.com/hc/en-us/requests/new"}, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "109442834330220311914", "name": "Austin Orr", "time": 1555690572602, "rating": 5.0, "text": "This store has impressed me by far the most, the customer service is Impeccable. This store will be the only AT&T store I visit when I'm in Birmingham ..", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "114963805711083450266", "name": "Miranda Breeding", "time": 1531922458211, "rating": 5.0, "text": "Excellent staff, always willing to go above and beyond general customer service. Typically a fast interaction!", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "118275560378471594284", "name": "Laura B", "time": 1546551855197, "rating": 1.0, "text": "Just purchased new iphone at Pelham Store. Was told by \"Chip\" that their transfer equipment there was broken, so he gave me written instructions and a AT&T number to call to make file transfer from old phone to new iphone. I had no success! The next day I then went, conveniently, to the Galleria Store for help. Was simply told that \"all was good with iphone from their (AT&T) end\". I ask for assistance three times about how I can setup and transfer files myself to make new iphone operational. Was simply told by the young lady to \"download transfer app to both phones\". And how do I do that I ask... \" follow the instructions\" I was told. I ask can you help me through the process...\"no, everything is fine on our end, you must take your (NEW) iphone to the MAC Store at the Summit! I left very frustrated, the process was not simple for me, and will now go back to AT&T a third time but back to the Pelham store to see \"Chip\" who was more helpful. NOT HAPPY!", "pics": null, "resp": {"time": 1546627350512, "text": "Laura, thanks for letting us know about the experience you had in our store! Please accept our sincerest apology, as it is our mission to make our customers #GenuinelyHappy. I'm really sorry we weren’t able to accomplish that for you this time!! Please reach out to us at http://bit.ly/ATTexperience, as we’d LOVE the opportunity to make it right! We look forward to hearing from you! Thanks for being the best part of AT&T!!"}, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "100389417007592327136", "name": "Kim Cauthon Kois", "time": 1540955547716, "rating": 1.0, "text": "I came into this store and upgraded to bogo special. This was in July, I changed my mind and carried both phone back to the representative that gave me the upgrade. Here it is 4 months later and I'm still paying for both phones and a extra line that I don't have!! I get the runaround every time I call. Suppose to have money credited back to my acct. And today when I get another bill. I call again, just for them to tell me the phones that I returned can't be found. Now I've got the receipts where I returned both items within the 14 day grace period, but they tell me that don't matter.\nI'm getting very aggravated with these people that are suppose to be professionals in customer service.\nThey've got documentation where I returned the phones and charged me a restocking fee, I've got receipts where the store gave me for returning the items. But for some reason they are lost ( argh!!) and my receipts isn't going to help. Someone please tell me how this is possible or legal. This is so messed up. I guess I need to contact a attorney to try and recoup some of the money I've already paid these crooks.\nMy phone bill is normally 45.00 a month. Last month they cut it off after I was assured it wouldn't be disconnected untill this matter was resolved. I paid 484.20 to get my phone back on, and was assured the charges and extra line was removed, and that I had a 300.00 credit coming to me. Guess what this bill said....\n259.41 the phones and extra line are still on there!#!  THIS NEEDS TO BE AND ALREADY SHOULD HAVE BEEN UNDER INVESTIGATION!!!!!!\n#fedupwiththebullsh*t\n#thisisunbelievable\n#lostloyalcustomersafter this\n#dotherightthing\n#makeitright", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "107052803261281962027", "name": "Casey Benefield (Think A Little)", "time": 1528070851417, "rating": 2.0, "text": "Meh. Bluh. I showed up first in line about 3 minutes before opening at 12:03PM, but ended up being 17 minutes before I could ask a question about employee discounts, which had a disappointing answer.  I think the primary issue is staffing. There was only one person in the store. Prices were quite outrageous on phone hardware, and it was a retailer. Even so, didn't provide the value that I would have expected. Sorry, it was quite a disappointment.", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "116218242584782906444", "name": "joseph d.", "time": 1548024571007, "rating": 5.0, "text": "iPhone xR is the best phone there and XS Max", "pics": null, "resp": {"time": 1548277482775, "text": "Hey Joseph!! We are sooo happy that you're happy!! Thanks for sharing about your experience with us! Our mission is to make our customers #GenuinelyHappy, and I'm really glad we could accomplish that for you during your visit to our store!! Thanks for being a loyal AT&T customer!!"}, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "109432534388258676840", "name": "LimewirePro Sasuke", "time": 1489107625269, "rating": 5.0, "text": "Excellent customer service I wouldn't see why somebody would say something so bad about this location out of smite. Keep up the good work guys!", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "105968255701235919114", "name": "AVC SM LLC", "time": 1524338134316, "rating": 1.0, "text": "They are fraudulent. They will sign you up for a different plan then you ask and when you find out before you leave they won't refund you then they force you to leave. Called corporate, no awnser. Called police and will sue.", "pics": null, "resp": {"time": 1527796677765, "text": "Hi there,\n\nWe are very sorry to hear you had a bad experience! Please send us a detailed explanation by submitting this form, so that we can forward it on to the appropriate manager. We want to help!  https://springmobile-customerservice.zendesk.com/hc/en-us/requests/new"}, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "112541693316872293957", "name": "Bobby Crabtree", "time": 1470511630598, "rating": 1.0, "text": "I was told by Att uverse to bring in the equipment I had to the nearest Att store. I called to check on location and eligibility for this store on the galleria and a gentleman named Darrius answered the phone. I asked for help with this issue and he told me that I needed to go to a corporate store. When I asked him where the nearest one was, he told me to look it up. I didn't know there was a difference of else I would've called the right store. When u asked for his help to distinguish between the 2, he didn't want to help me at first until the 3rd time I asked him for help and he looked it up and gave me a number and told me to call it. No store location nothing. When I asked for his name just in case I  had to call back he asked me why I needed his name. Let's start with customer service. If you're an authorized retailer and you can't help all Att customers with Att issues them your franchise license needs to be pulled. This employee was rude and unhelpful. He acted like my problem wasn't his problem and treated me like I was nothing more than a begger on the street. Is this the way you want your store to represent Att? The fastest network and the poorest customer service? I would have a talk with Darrius about customer service. I'm going to bring this up with the corporate store. Fail.", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "117300856521032804803", "name": "Kendra Little", "time": 1555693005135, "rating": 5.0, "text": "Jasmine was very helpful, knowledgeable, and friendly.", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "103796884433238777163", "name": "Anna Rich", "time": 1553630141014, "rating": 5.0, "text": "Thanks to Jonathan for my accessories sale!", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "104189312930261530044", "name": "Seth Boman", "time": 1574094243557, "rating": 5.0, "text": "Friendly staff!", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "118403837348571467056", "name": "Jasmine Holmes", "time": 1551621140472, "rating": 5.0, "text": "Great experience", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "102549244457734098670", "name": "Lekervis Jefferson", "time": 1553889722935, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "102588765550674009614", "name": "Scott Hays", "time": 1560716379473, "rating": 4.0, "text": "Very helpful", "pics": null, "resp": {"time": 1560803157197, "text": "Hey Scott!! I'm so happy we were able to help!! Thanks for sharing your experience with us! We love it when our customers are #GenuinelyHappy, and I'm really glad we could accomplish that for you during your visit to our store!! Thanks for being a loyal AT&T customer!!"}, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "106751775178759739631", "name": "Raymond Dunn", "time": 1555500647110, "rating": 1.0, "text": "No help, incompetent", "pics": null, "resp": {"time": 1555522164937, "text": "Raymond, I'm sorry to hear about the experience you've had in our store. If you'd like to share your feedback with our Customer Support team, please reach out to us at http://bit.ly/ATTExperience, as we’d LOVE the opportunity to work towards improving your experience! Our mission is to make our customers #GenuinelyHappy, by creating a premier environment for our customers to shop! Thanks for being a loyal AT&T customer!"}, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "113498455348346529021", "name": "Judy Cannon", "time": 1581040302231, "rating": 5.0, "text": "Helpful and thoughtful", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "113765780319162458098", "name": "Jupiter Jetson", "time": 1530040199529, "rating": 5.0, "text": "Got all I need for my devices.", "pics": null, "resp": {"time": 1530226605813, "text": "Thanks for the shout-out, Jupiter! We're happy that you're happy with us!"}, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "104157465691080144718", "name": "Sylvia Jones Davis Stevenson", "time": 1555448123009, "rating": 5.0, "text": "Fantastic!", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "114772569278427835542", "name": "courtney kindler", "time": 1574091094343, "rating": 5.0, "text": "Awesome store!", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "105139417921592150748", "name": "Raechelle McCoy", "time": 1545969905982, "rating": 5.0, "text": "Great location", "pics": null, "resp": {"time": 1549988853102, "text": "Thanks for the 5 stars, Raechelle!! We LOVE it when our customers have a great experience in our stores! Our mission is to make our customers #GenuinelyHappy, and I'm so excited that we could accomplish that for you!! Thanks for being a loyal AT&T customer!!"}, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "108666153601818107165", "name": "Kiddo", "time": 1552768358802, "rating": 1.0, "text": "Trash", "pics": null, "resp": {"time": 1552943409216, "text": "Hi Cheikhouna! From the star rating, it looks like you may have had a bad experience at our store. Our mission is to make our customers #GenuinelyHappy, and I'm sorry we weren’t able to accomplish that for you!! If you'd like to share your feedback, please reach out to us at http://bit.ly/ATTExperience, so that a member of our Customer Support team can follow up. We’d LOVE the opportunity to make it right! We look forward to hearing from you! Thanks for being a loyal AT&T customer!!"}, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "112513374472450093360", "name": "Corey McNulty", "time": 1571514459651, "rating": 5.0, "text": "Nona = rockstar.", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "114424512744106569188", "name": "Jack Cartee", "time": 1543235841050, "rating": 5.0, "text": "Friendly staff", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "103591247482155363454", "name": "Sandra Macedo", "time": 1538393224550, "rating": 5.0, "text": "(Translated by Google) Good attention\n\n(Original)\nBuena atención", "pics": null, "resp": null, "gmap_id": "0x88892216e04cba71:0xc8009b39ea451926"}
{"user_id": "112856602004917921444", "name": "Todd Haney", "time": 1564351789222, "rating": 5.0, "text": "This is a great company to partner with for your security and surveillance needs. All of the staff and technicians are very knowledge, and very helpful, fast and efficient. They know their stuff better than anyone.  Their prices are very reasonable as well. They responded to me as quickly the first time as they did the last time I called needing something else done. Really happy with how everything has turned out, and will always use Spy Pro Shop!! Thank you!!", "pics": null, "resp": null, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "101701922366446090627", "name": "Marilyn Hubbard", "time": 1564005453169, "rating": 5.0, "text": "I have always had great customer service from the folks at the store. They are very knowledgeable and patient with people like me who really don’t know for sure what they are looking for. I explain what I thought I needed and they gave me their recommendations. I have been very happy with what I purchased and went back to see more! They just have all kinds of neat things that you would never guess were cameras. A very fun place to go.😃", "pics": null, "resp": {"time": 1564009275328, "text": "Thank you Marilyn"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "117034214258122051868", "name": "Shirley", "time": 1564004202634, "rating": 5.0, "text": "Great store!!! A+ customer service!!! Went in not knowing exactly what I needed but after talking with their knowledgeable staff I left with the perfect product. Will definitely shop here again and will highly recommend them!!!", "pics": null, "resp": {"time": 1564004311499, "text": "Thank you"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "115207430185759453190", "name": "Victoria Faison", "time": 1564112240480, "rating": 5.0, "text": "These guys are great! Excited service. I felt very helped and welcomed. So friendly. 👍🏼", "pics": null, "resp": null, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "114945697833672343552", "name": "Mr Barber", "time": 1564008769343, "rating": 5.0, "text": "This is a great place nice family friendly and knowledgeable I would highly recommend.. I mistakenly left a review that was intended for another business the spy pro shop is great 👍", "pics": null, "resp": {"time": 1564000239203, "text": "Please everyone pray for this person .He gives everyone bad reviews."}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "117098541664549792522", "name": "Jack", "time": 1564004678642, "rating": 5.0, "text": "This store has great products and customer service is unmatched!\nThey are one of the best in the business when it comes to investigative services I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "107299600524733523281", "name": "Rebecca Roof", "time": 1578281695829, "rating": 5.0, "text": "Nice people. Helpful and friendly.", "pics": null, "resp": null, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "112535199449092179179", "name": "David Schove", "time": 1564004879008, "rating": 5.0, "text": "Great customer service.  Learned a lot from the staff about cameras.  Will be back to buy more next month.", "pics": null, "resp": {"time": 1564009291416, "text": "Thanks David"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "105138351444654433896", "name": "Jerry Quinn", "time": 1456283325530, "rating": 5.0, "text": "The Spy Pro Shop is such a cool place.  I had no idea that some of this stuff existed.  I was so impressed with the product knowledge on eveything they sell.  The GPS trackers, drones, video/audio surveillance was unbelievable.  Do yourself a favor and check this store out.  You will walk away with many ideas for sure.", "pics": null, "resp": {"time": 1465226521610, "text": "Thanks, Jerry. That's the sort of thing we love to hear our customers say."}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "106492890632772686089", "name": "Carrie Kelly", "time": 1455122359703, "rating": 5.0, "text": "I rated the Spy Pro Shop with 5 stars because I had previously purchased a trackimo from somewhere else,   and had a problem with the battery running down to fast.  I had to charge it every other day.\nAfter searching around for an extended battery with no luck, that was until I found Spy Pro  Shop! They made it possible for me to have a battery that will last from 2 to 6 months without changing it (so excited).  It has been a week now, and is still  showing 100% (yes!).\nThe Spy Pro Shop customer service was exquisite!  So friendly, patience, and prompt on returning my trackimo to me, after I asked them to fix it to where I could have an extended battery life on it.\nI would definitely recommend this shop to others!!!", "pics": null, "resp": {"time": 1464924352451, "text": "Thank you, you; we enjoyed helping you with that challenge."}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "100631821959112696948", "name": "Connie Briggs", "time": 1505852829887, "rating": 5.0, "text": "Jim walked me through the process of getting Wi-Fi enabled and was very patient.  I couldn't have done it without out.  Awesome customer service.  Thanks so much for getting me up and running.", "pics": null, "resp": {"time": 1564004384957, "text": "Thanks Connie"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "114947854872628358644", "name": "Jack Knight", "time": 1539996859454, "rating": 5.0, "text": "Incomparable to any other businesses in Greater Birmingham, AL.  Love the concept, the store and the helpful, knowledgeable staff!", "pics": null, "resp": {"time": 1564004363981, "text": "Thanks Jack"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "114694930595001994064", "name": "doc lamb", "time": 1543074828658, "rating": 5.0, "text": "Very interesting place with very friendly and knoledgeable staff.", "pics": null, "resp": {"time": 1564004344938, "text": "Thank You Doc"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "118295129268261647230", "name": "Sam Osman", "time": 1474593376554, "rating": 5.0, "text": "For the first time you meet people that knows what they're doing customer service was amazing plenty of merchandise and great hospitality excellent service", "pics": null, "resp": {"time": 1474634470191, "text": "Thank you Sam and all of our customers; we appreciate everyone of you."}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "109859722064579446001", "name": "CRI Trains", "time": 1522183856429, "rating": 1.0, "text": "I was interested in purchasing a wifi security camera, purchased a unit only to get it home and find out that the unit did not have wifi.  I brought it back and they insisted that in fact it did.  Called the support number included they confirmed the unit did not have wifi.  Brought it back a second time for a refund and the lady behind the counter was quite rude and acted as if she did not believe me.  I would avoid this place.", "pics": null, "resp": {"time": 1522188092518, "text": "I'm sorry for the confusion, the camera was wifi enabled but was made to be covert therefore the controls were hidden behind a slide off panel that was not easily detected. I hope Mr. Hammer does not avoid this place as we would love to see him back as a customer. If by chance Mr. Hammer, you do order that camera online, we found that the entire rear panel will pop off with a little pressure and reveal the wifi switch. This was an upgraded model and I'm sorry that our people had not yet become familiar with it."}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "102474340518745711562", "name": "Jamie lee Hallman, Ross", "time": 1459273857656, "rating": 5.0, "text": "The customer services was great !!\nI wish I knew the ladies name working yesterday bc she was locking the door to go home for the day..she seen me see her closing so I turned to walk away she stoped asked if she could help me . then\nunlocked the door to let me look around. She did not rush was very sweet and patient with me.\nAlso bless her heart as I was leaving another customer walked in and she helped him out too 😊\nIsn't that the worst when your about to step in the door of a store and the tell u to get out they are closed, even if they wasn't supposed to close yet !?!\nI'm going back to day to get something that will let me look in at any time and see how my child is doing while I'm at work while being babysat for the first time. #💝Hwy280spypro!!!!!", "pics": null, "resp": {"time": 1465226444703, "text": "Thank you Jamie, the lady was Betty. We appreciate the review. :)"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "108060166920348938263", "name": "Nathan Kimes", "time": 1446062419122, "rating": 5.0, "text": "Great shop with friendly people.  Would recommend to anyone.", "pics": null, "resp": {"time": 1446063174068, "text": "Thanks! We appreciate you."}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
