{"user_id": "102607449747312705860", "name": "Sydney Ann", "time": 1625342424765, "rating": 5.0, "text": "I hired Prestige Power Washing to clean my parents home in preparations for the sale. I don't leave reviews but this company most definitely deserves recognition for most professional business I've ever hired.\n\nAfter doing my research of other local Power and Soft Washing businesses reading these reviews here and on their Facebook page I realized I was dealing with a legit and knowledgeable business. After speaking to the owner about scheduling a in person quote I knew I also had made a great choice. They scheduled a quote that suited my schedule showed up on time and gave extensive information regarding there service and proper techniques they use that other companies don't use. This is when I decided this company was Most definitely my best choice for cleaning my house.\n\nI'm so impressed with the outcome of the outside of the house and not only that but our realtor said \"I've never seen such a difference this house looks like it was just painted\"!  Just to add the best possible outcome our house was shown to the first family the next day and within 12 hours it was sold right here in Foley, Al.\n\n***Please Don't hesitate to Hire this Company To Wash your home and concrete you won't regret it. ***", "pics": null, "resp": null, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "108382424430496020824", "name": "Carolyn Dickinson", "time": 1627008603732, "rating": 5.0, "text": "I love supporting our local businesses! And, especially when they do such an awesome job! Friendly, professional and goes beyond what others offer! Even after having finished,  John took time to clean the mailbox out front as he was leaving. Thank you!", "pics": null, "resp": {"time": 1627083893211, "text": "Thank you very much for your business and your kind words! We love to show our customers appreciation by going above and beyond every time!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "106816665531163198909", "name": "V Dragon", "time": 1620661336231, "rating": 5.0, "text": "John and crew were very careful to make sure power washing was not done to my brick because it had a special coating that would be ruined if blasted with a power washer. They also cleaned my whole house and roof with a special solution that got cleaner with every coming rain. It looks terrific.\nThey were efficient and courteous and checked back to ensure I was satisfied with their work. I had to wait a few weeks due to everyone still recovering from hurricane cleanup efforts of last year...but!...he is worth waiting for~\nI'm thankful there are still a few honest, respectable, dependable businesses out there who aren't trying to take advantage of you.\nThis is a difficult (and sometimes dangerous) job and they have it down pat.", "pics": null, "resp": {"time": 1620664284432, "text": "Thank you so much for your wonderful and detailed review of my services.\nWe always strive for the absolute best with everything we do and I’m sure glad your pleased!\n\nWe look forward to working for you in the future and hope you’ll spread the word to family and friends about us!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "104638281583354767797", "name": "Nelson Moseley", "time": 1623170047520, "rating": 5.0, "text": "We had Prestige do a wash on our home a few months back. They cleaned the house, windows, porch, deck, and the driveway. The results were fantastic. The crew was on time and very professional. I would highly recommend Prestige.", "pics": null, "resp": {"time": 1623231952988, "text": "Thank you Mr Moseley it was a pleasure to get your beautiful home clean in Orange Beach, Al. You know who to call now for all your exterior cleaning needs."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "106710097819687869453", "name": "Taylor Means", "time": 1622648682877, "rating": 5.0, "text": "Prestige Power Washing came to us referred by a local friend. Our home on West Beach was very nasty with mildew. John and his crew did a great job and got it nice and clean in a timely manner. We will definitely be using them again.", "pics": null, "resp": {"time": 1622907149200, "text": "Thank you Taylor for your great review of me and my company. We definitely look forward to taking care of more or your properties for you and your company as well!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "115808847586237620728", "name": "John Graham", "time": 1616980494560, "rating": 5.0, "text": "Very responsive; goes out of own way to ensure property is left in clean and safe condition, while  also meeting requested deadlines and ensuring customer satisfaction.  Prestige is the ONLY company we’ve used for several years for business projects and our personal home because of trust, quality work, and ethical consistency.\nTheir service definitely makes life easier, leaving you with piece of mind when protecting your largest investments.\nTop notch company and owner!", "pics": null, "resp": {"time": 1617023877101, "text": "Thank You Mr. Graham for your time and great review of my services. I’m definitely glad we’ve been your #1 choice as always !"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "112672032087563269956", "name": "Terry Rickell", "time": 1619582489847, "rating": 5.0, "text": "If you are needing to have your home power washed this is the company you should use. John does a phenomenal job and we highly recommend his company.  He takes pride in his work and cleaned our home like it was his own.  We will definitely  use him again.", "pics": null, "resp": {"time": 1619698477869, "text": "Thank you very much for you great review! I really appreciate you guys 👍🏻🙏🏻!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "109438755939930295545", "name": "Paul Orosco", "time": 1622294969538, "rating": 5.0, "text": "They do very professional service.  Highly recommend. I have used them twice and very satisfied with their work.", "pics": null, "resp": {"time": 1623231731336, "text": "Thank you Mr Orosco we definitely enjoy cleaning your property for you and your wife. See ya next year."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "113831443148724573820", "name": "Cynthia Baumann", "time": 1608145490219, "rating": 5.0, "text": "Extremely pleased with John's quality of work, attention to detail, and professionalism. He treated our home as if it was his own!  We could not be more pleased and would highly recommend him to others. Very reasonably priced, as well.", "pics": null, "resp": {"time": 1608650307997, "text": "Thanks so much Cynthia it was a great pleasure! Have a wonderful day and look forward to seeing you in future!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "116881243303599667631", "name": "Chuck Thur", "time": 1616950083321, "rating": 5.0, "text": "They came out and did a fine job. John even noticed a couple of things that needed washing and threw them in at no extra charge. Definitely recommend them.", "pics": null, "resp": {"time": 1617023791451, "text": "Thank you Chuck for you great review of me and my company! Glad you had a great experience and we will see you soon 😎!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "107870583489280414795", "name": "Robin H", "time": 1616342958271, "rating": 5.0, "text": "If you want someone who will care about your home, call John @Prestige Powerwashing. My “vintage” home in Foley was in need of some TLC. After reading online reviews, I called Prestige to get a quote on exterior power washing. John answered the phone himself, and though he was busy took the time to give me a reasonable time window to drop by. He was not only on time, thorough and professional, but he also listened, cared about my goals and took my own schedule into consideration. I was somewhat flexible on the timing, but he showed up at his first availability because he wanted me to see how good the house could look before the new roof goes on. The service was exactly as promised and more. Every detail was taken into consideration. It’s a joy to do business with someone who takes pride in their work.", "pics": null, "resp": {"time": 1616375377533, "text": "Thank you very much for your wonderful review. I truly love what I do and putting smiles on clients faces when they see the results!\n\nThank you!\n@prestigepowerwashing"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "103196641462356084720", "name": "Snowbird Company", "time": 1611185667232, "rating": 5.0, "text": "John did an excellent job power washing our pool area and home. He went above and beyond. Plus it was so easy to schedule and he was very professional in every way. I highly recommend him!!", "pics": null, "resp": {"time": 1611325227898, "text": "Thank you so much for the wonderful review! It was a pleasure and hope you guys have great success with the sell of the home!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "103166745705047082138", "name": "Danny Carpenter", "time": 1615219791525, "rating": 5.0, "text": "They did a great job. Anything that I wanted to have cleaned better, they took care of it with questions. I would use them again.", "pics": null, "resp": {"time": 1615226845945, "text": "Thank you Danny we appreciate your nice review of my business! Congratulations on your quick sell of your beautiful home!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "106245956565549873800", "name": "Jbird Jordan", "time": 1617198071649, "rating": 5.0, "text": "Absolutely amazing job...I didn't realize that our home and driveway was so beautiful until John at Prestige Power Washing cleaned our home...Thanks guys for going above and beyond and being one of the most professional companies we have ever dealt with...thanks to yall we are in love with our home again...", "pics": null, "resp": {"time": 1617832666875, "text": "It was a pleasure Mr. Jordan to get your home all cleaned up including your large concrete driveway! It was a great pleasure to meet you as well 👍🏻!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "116496613457418760987", "name": "Linda Kious", "time": 1613792768055, "rating": 5.0, "text": "I contacted John Lankford of Prestige Power Washing about removing two large spots of a tar- like substance from my driveway. He came out and inspected the substance immediately. The chemical to remove it had to be special ordered, but just a few days later he returned and removed the stain. He was friendly, prompt, and professional. I highly recommend Mr. Langford and his business.", "pics": null, "resp": {"time": 1613866964040, "text": "Thank you very much Linda for sharing your experience! We strive for nothing less than the best at all we do!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "115499014493779490499", "name": "Tommy Stanton EXIT Realty Gulf Shores", "time": 1599782271382, "rating": 5.0, "text": "John and his crew were great! They came out and let me know what they would do, their process, and gave me an estimate within an hour of coming out. They came and exceeded my expectations and did a great job and everything is so fresh and so clean!\n\nHighly recommend!", "pics": null, "resp": {"time": 1599963642382, "text": "Thank you Mr.Stanton for your wonderful review of me and my business! We strive for the best possible service for everyone we do business with. We hope you’ll refer your friends and family to our services in the future."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "108422398661347059770", "name": "Ruth Dunwoody", "time": 1603222612369, "rating": 5.0, "text": "John was somehow both quick and thorough! 😂 Very reasonable pricing. The house looks better than new and he was wonderful to work with! Definitely recommend.", "pics": null, "resp": {"time": 1603337075133, "text": "Thanks so much Ruth we enjoyed helping clean your beautiful Home in prep for sale!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "105900200880782809356", "name": "Brian Boyer", "time": 1613340288789, "rating": 5.0, "text": "My fiancé hired John to pressure wash our house as a valentine gift to me, and all I can say is wow!!!!! Great service and great guy!!!! As he was leaving after doing a wonderful job, he noticed my mailbox was dirty and he stopped and cleaned it also!!!!!!! Highly recommend!!!!!!", "pics": null, "resp": {"time": 1614991833597, "text": "Thank you Brian it was pleasure meeting you!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "108267983832315110994", "name": "Wes Smith", "time": 1614632345129, "rating": 5.0, "text": "These guys made my porches and roofs look brand new. Really great work!", "pics": null, "resp": {"time": 1614693936962, "text": "Our pleasure, you have a beautiful home we would love to help keep it that way for you!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "114549838499870155981", "name": "Cathy Myers", "time": 1592965467793, "rating": 5.0, "text": "This company was awesome in its quality of work and professionalism. They responded quickly and actually were able to come before expected. John was very professional, moved furniture as needed and replaced without me needing to rearrange at all. And that’s saying something given how picky I am. Highly recommend them!", "pics": null, "resp": {"time": 1593124801111, "text": "Thank you so much Mrs. Myers for your great review of my company. We strive to make sure every customers very happy with our service from start to finish! Spread the word about us and let them know we are #1 Exterior Cleaning Company in Baldwin County!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "118390121310855898967", "name": "kenneth brink", "time": 1619995202607, "rating": 5.0, "text": "I had an issue with my pressure washer and they were very helpful in walking we through the problems to correct it", "pics": null, "resp": {"time": 1620488822364, "text": "Thank you Kenneth glad I could help!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "102760086096251802575", "name": "Lacey Dugger", "time": 1597869100409, "rating": 5.0, "text": "Prestige Power Washing always does such a great job when washing my home! The driveway looks like new after it has been cleaned! I recommend Prestige to anyone who needs power washing services!!", "pics": null, "resp": {"time": 1599060965253, "text": "Thank you very much Lacey! Your always so kind and we are thrilled to be your choice for your exterior house and property cleaning company!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "115384600115541264980", "name": "Deborah Carlson", "time": 1589805176085, "rating": 5.0, "text": "Wow, these guys are great!! They are real professionals who know what they’re doing. Not like others who show up with a portable pressure washer and knock off the top of mold but don’t get down deep. These guys use an algeacide to kill the algae then they rinse it away. They did a soft wash on the screen over our pool and on our metal roof. Hadn’t been done in 5 years. They look brand new now. They spend lots of time prepping the area to make sure plants are protected. They clean up their messes when done and when they left I was very proud of the way our home looked. Yes, they personify the saying, “You get what you pay for!”  They are not the least expensive, but they are the best.", "pics": null, "resp": {"time": 1591032644113, "text": "Wow thanks Deborah for that fantastic detailed review. No one else does what we do or knows how to properly do it! Thanks again and we will see ya again!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "115262972946447610442", "name": "Jonathan Carrigan", "time": 1623125163058, "rating": 5.0, "text": "Very friendly, fast and professional", "pics": null, "resp": {"time": 1623231811835, "text": "Thank You Mr Carrigan, you have a beautiful home we are thrilled to clean it for you and your family."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "101289915332239487204", "name": "Deb Devore", "time": 1583427814896, "rating": 5.0, "text": "John was great to work with.  I had called a few others regarding power washing. John was the only one to actually take the time to come to the house and give me an estimate.  I appreciated that.  He did a great job!  I am very pleased.", "pics": null, "resp": {"time": 1583424142392, "text": "Thanks Debbie it was a pleasure to earn your business by showing you how we do things and our professionalism. We will be in touch again."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "117777772390535811488", "name": "Ruth Ann Powell", "time": 1587344740968, "rating": 5.0, "text": "I’m so happy that I found Prestige Power  Washing. John was very nice and even though my request was just doing my patio to get pollen off, he was more than willing to do it. I absolutely will have him do my entire house. Thank you John.", "pics": null, "resp": {"time": 1589421692718, "text": "Thanks so much Ruth your a wonderful woman so nice to meet great people like yourself."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "110556750419786899424", "name": "Alton McRee", "time": 1587955714000, "rating": 5.0, "text": "Prestige team, John and Donald, did a great job on my house, roof, pool enclosure and driveway. They are very professional and take care of all the details. Everything looks brand new! I highly recommend Prestige Power Washing!", "pics": null, "resp": {"time": 1590113704111, "text": "Thank very much for your great feedback and recommendation Alton! Your a great customer and I know we will continue being your #1 choice for exterior cleaning!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "117462756208289773266", "name": "Brenda Childress", "time": 1569889123960, "rating": 5.0, "text": "I highly recommend this company! They gave us a no hassle quote, performed the work while we were out of town with our permission and upon our arriving home everything was perfection! It’s really hard to find good, trustworthy, reliable people to do what their suppose to now a days. It’s a breath of fresh air with this company! I don’t normally leave reviews either but felt they deserve public recognition for an outstanding job!", "pics": null, "resp": {"time": 1569891656738, "text": "Thanks so much for the kind words about our company. It was a absolute pleasure to clean your beautiful home and property!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "101631060042981620490", "name": "Peter Verrett", "time": 1583434311363, "rating": 5.0, "text": "Prestige did an excellent job power washing our house and driveway.\n\nThey were extremely efficient in getting the job done as they were finished in less than 2 hours.\n\nWe were very satisfied with their effort and would highly recommend them to anyone who needed their house taken care of.", "pics": null, "resp": {"time": 1583633110089, "text": "Thanks so much Peter, it was a pleasure to clean your beautiful home in preparation for sale!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "107426550376348760013", "name": "Boxcar Willy", "time": 1611263609508, "rating": 5.0, "text": "Great job! Great price!", "pics": null, "resp": {"time": 1611325261674, "text": "Thank you very much for the wonderful review and it was a great pleasure working for you."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "101592866450499389465", "name": "Mo Fitzgerald", "time": 1588094529775, "rating": 5.0, "text": "Owner John was really awesome! He kept us in the loop about the process & timeframe. Our steeply pitched metal roof had never been cleaned as thoroughly in the past. John was approachable, relatable and conscientious.\nI highly recommend Prestige Power Washing for your roof or any of your pressure washing needs!", "pics": null, "resp": {"time": 1589421758964, "text": "Thanks so much Mo your a wonderful person I’m so glad I got to meet you and your husband! Please give me a call if you need anything else!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "107480943789967080693", "name": "Butch Zaragoza", "time": 1597958757729, "rating": 5.0, "text": "I would highly recommend Prestige Power Washing to any one that is looking for a quality company to do pressure washing. They where very professional in doing the work at our home.", "pics": null, "resp": {"time": 1599061062902, "text": "Thank you very much Butch it was our pleasure to clean your beautiful home. I’m thrilled you’ve hired us and very grateful for your great review sir!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "109514709916519262726", "name": "Julia Lynn", "time": 1578884463550, "rating": 5.0, "text": "Most amazing company. The owner is fabulous. I highly recommend this company to anybody. Thank you so much for what you did for us", "pics": null, "resp": {"time": 1578923233509, "text": "Thanks so much, it was my pleasure to help you out. We will be in touch and see ya soon!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "113732071446681514872", "name": "henry vogt", "time": 1599134888563, "rating": 5.0, "text": "You killed that fire man, keep up the good work", "pics": null, "resp": {"time": 1599405883848, "text": "Thank you brother, just doing what any good human being should do!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "106432855515397009141", "name": "Blake C", "time": 1572973825200, "rating": 5.0, "text": "John was very professional, prompt, and knowledgeable. The job they did on my house was awesome, he even gave a Military discount! I'll definitely hire them again when my house needs washing again.", "pics": null, "resp": {"time": 1576172395653, "text": "Thanks so much Blake for your kind words. We really appreciate customers like yourself and remember we are just a phone call away!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "106460994553320939471", "name": "Stephen McClantoc", "time": 1544634262953, "rating": 5.0, "text": "John did a great job on cleaning the exterior of my house. Was on time and easy to work with my schedule. Highly recommend his services, I will have him come back next year to do it again.", "pics": null, "resp": {"time": 1544634433426, "text": "Thanks so much for your recommendation it was a pleasure to clean your home looking forward to cleaning your concrete for you."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "116935017826210536622", "name": "Mark", "time": 1575682269763, "rating": 5.0, "text": "Outstanding service.  High quality pressure wash of pool screen enclosure.  Looks like new.  Highest  recommendation!", "pics": null, "resp": {"time": 1575764430358, "text": "Thanks Mark for your kind thoughtful review, we will continue the great service and see you soon!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "118396962198104553586", "name": "Katherine Eddy", "time": 1571853321256, "rating": 5.0, "text": "Excellent service with great results. On time, reasonable price, friendly, and great attention to detail. We will definitely use Prestige again.", "pics": null, "resp": {"time": 1572980816403, "text": "Thanks so much for the great review. It was a pleasure to work cleaning the exterior of your home. See ya soon!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "115832014485254501950", "name": "Cindy Dunn", "time": 1583687974477, "rating": 5.0, "text": "We highly recommend this company for power washing.They did our driveway and all of the cement work around our house and made it look like new! They were prompt, friendly, and professional.\n\nJim&Cindy Dunn", "pics": null, "resp": {"time": 1583802292079, "text": "Thanks Mrs. Dunn we love wonderful customers like you and we enjoyed cleaning your concrete!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "103878872917346926162", "name": "Robin Hulse", "time": 1567599213200, "rating": 5.0, "text": "Will definitely call on them again. Donald was very thorough & careful about not harming painted surfaces. Everything looks amazing!", "pics": null, "resp": {"time": 1567602270505, "text": "Thanks so much Mrs. Hulse, it’s wonderful customers like yourself that recognize our dedication for a great experience and care in our services! We will see you again soon!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "104283792659679732399", "name": "Maria Chapman", "time": 1586987261875, "rating": 5.0, "text": "Great communication.  Professional job.  Very pleased", "pics": null, "resp": {"time": 1589421635554, "text": "Thanks so much Mrs. Chapman it was our pleasure to clean your beautiful Community!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "110160288257773210927", "name": "Barbara Lee Thompson", "time": 1552345137714, "rating": 5.0, "text": "Highly recommended 👍.  We had John power wash our home and driveway last week.  Prestige Power Washing is the whole package.  John is professional, written quotes, fair pricing, quality work, courteous, timely, and follows ups.  We are already on his list for next year.  Barbara and Porter Thompson, Foley AL.  Thank you John!", "pics": null, "resp": {"time": 1552355720362, "text": "Barbara Thompson it was a pleasure to clean your home and even better meeting you. Thanks again see you soon!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "107473687987995826073", "name": "sandie birch", "time": 1548800779437, "rating": 5.0, "text": "John did an outstanding job! He pressure washed my roof, my house, and my driveway. I highly recommend him for all pressure washing needs. My house looks like new!", "pics": null, "resp": {"time": 1548807287714, "text": "Thanks so much see ya next spring!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "107875480936041911169", "name": "Mathew Thompson", "time": 1546035092228, "rating": 5.0, "text": "Great person. Very punctual and professional. Got a free estimate and went from there. Will use again and recommend to others", "pics": null, "resp": {"time": 1546039230762, "text": "Thanks Mathew cleaning your home and making it shine like new was my pleasure. Looking forward to continued business and referrals from you."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "109223396509552101288", "name": "Heather Cole", "time": 1548541396858, "rating": 5.0, "text": "John does amazing work! His work is of high quality and he’s trustworthy. We will always use John for our pressure washing needs and we refer all of our friends and clients to him as well.", "pics": null, "resp": {"time": 1548546738315, "text": "Thanks Mrs. Cole working for you guys is great. I appreciate great customers like yourself."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "107937793716518772407", "name": "Amy Pearson", "time": 1574405011296, "rating": 5.0, "text": "Great end result and such a nice, easy guy to work with! Very impressed!", "pics": null, "resp": {"time": 1574428240131, "text": "Thank you Amy it was a great pleasure to work at your home and get it looking it’s best. We appreciate your support and kind words regarding our services. See ya again soon."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "108459492116657679906", "name": "Becky", "time": 1548779468342, "rating": 5.0, "text": "A job well done! John cleaned our home and driveway as we prepare to list it for sale & it looks amazing! He was professional, polite and accommodating.", "pics": null, "resp": {"time": 1548807338500, "text": "Thanks for your hospitality it was a absolute pleasure cleaning your home."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "109307230176041755907", "name": "Mark", "time": 1548603426611, "rating": 5.0, "text": "Reliable and knows what they are doing. Fantastic job on time, under budget. Highly recommendable!!", "pics": null, "resp": {"time": 1548726559852, "text": "Thanks Mark it was a pleasure cleaning your home again. Such a nice beautiful home!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "108730094920266823104", "name": "Megan Miller", "time": 1569802784353, "rating": 5.0, "text": "Prestige Power Washing did an awesome job! Very professional, easy to work with, great price and the end result was better than i imagined it could be!", "pics": null, "resp": {"time": 1570045797511, "text": "Thanks so much Mrs. Miller for your great feedback and kind words. We strive for the best and most professional results possible."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "108767780918297859853", "name": "Jared Crawley", "time": 1548773608994, "rating": 5.0, "text": "John with Prestige Power Washing LLC did a fantastic job cleaning my brick house, concrete driveway, and sidewalk. Very professional and knowledgeable. I highly recommend Prestige Power Washing. Thanks John.", "pics": null, "resp": {"time": 1548807363550, "text": "Thanks Mr. Crawley it was a pleasure."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "113225084035553833606", "name": "Jennifer Knight", "time": 1554827562315, "rating": 5.0, "text": "Awesome job and very professionally handled. I will not hesitate to contact this company again!\n\nJennifer Knight", "pics": null, "resp": {"time": 1554857902759, "text": "Thanks so much Mrs. Knight it was a pleasure cleaning your home. See you soon."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "105210517146112586888", "name": "Randy Boettcher", "time": 1548380000643, "rating": 5.0, "text": "Great work by Prestige Power Washing. Hard brick mold eliminated. Very detailed oriented.", "pics": null, "resp": {"time": 1548385582668, "text": "It was a absolute pleasure cleaning your home see you in 6 months for the maintenance plan. Thanks for your business."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "113961504009980222673", "name": "Schertz Services, LLC", "time": 1552444044014, "rating": 5.0, "text": "Very cool putting out the fire! I can guarantee a good hearted service like you does a fantastic job and cares about customers!", "pics": null, "resp": {"time": 1552445744779, "text": "Thanks so much for the support and kindness. Just doing what the good lord put me there for!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "109281445246740831147", "name": "Dennis Faust", "time": 1552583426728, "rating": 5.0, "text": "A great job from John and crew.  A difficult place to work and John handled it perfectly and promptly.  A pleasure to work with.", "pics": null, "resp": {"time": 1552601048446, "text": "Thanks Mr. Faust it was a pleasure to clean your gorgeous home. See ya soon!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "113131221653354621399", "name": "Brenda Fuller", "time": 1560690967574, "rating": 5.0, "text": "Very polite and caring person. Did excellent job for me.", "pics": null, "resp": {"time": 1560705755174, "text": "Thanks Mrs Fuller your kind words and recommendation is very much appreciated!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "115724174923083057041", "name": "Lindsay Dennis", "time": 1563999434843, "rating": 5.0, "text": "They did an amazing job on our house and patio! It looks brand new!", "pics": null, "resp": {"time": 1564012431121, "text": "Thanks so much for hiring our company. We enjoyed cleaning your home and property thanks again!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "101931518176962710324", "name": "Stacy Huff", "time": 1545191535174, "rating": 5.0, "text": "Would highly recommend Prestige Power Washing, they provided great customer service and the house looked amazing afterwards!", "pics": null, "resp": {"time": 1545255067628, "text": "Thanks Stacy it was a absolute pleasure to clean your home for you. It looks amazing and even more beautiful."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "105737400117270413224", "name": "Jason Jarrell", "time": 1548291529479, "rating": 5.0, "text": "Great friendly and honest hard working", "pics": null, "resp": {"time": 1548294672351, "text": "Great to work with you and look forward to continuing business."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "116721897187501045134", "name": "Kim Duckworth", "time": 1560727929250, "rating": 5.0, "text": "Very professional! Excellent results!! I highly recommend Prestige Power Washing!!!!", "pics": null, "resp": {"time": 1560733298117, "text": "Thanks Mrs. Duckworth it was a absolute pleasure and I’m thrilled with your experience you had! See ya next year."}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "106873701620131440025", "name": "Tammy Pierce", "time": 1584678927933, "rating": 5.0, "text": "Great service and very friendly!", "pics": null, "resp": {"time": 1584705678467, "text": "Thanks Tammy for your wonderful review. Hope to see ya again!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "104422210222764702084", "name": "Jennifer Jones", "time": 1554844604882, "rating": 5.0, "text": "Great experience all around! Very professional!", "pics": null, "resp": {"time": 1554858025136, "text": "Thanks so much Mrs. Jones, it was a pleasure to clean up your home and concrete. Will look forward to next year!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "103172405957597031548", "name": "Jonathan Bennett", "time": 1550195318217, "rating": 5.0, "text": "Excellent company with top notch professional service!", "pics": null, "resp": {"time": 1550198860879, "text": "Thanks Jonathan we pride ourselves in remaining professional and doing the job right every time!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "108142632926431898558", "name": "Dave Hayden", "time": 1552450594476, "rating": 5.0, "text": "Not only cleans houses and driveways but puts out fires. Thank you Sir!", "pics": null, "resp": {"time": 1552451001195, "text": "Thanks so much for the great support!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
{"user_id": "101132046910974338275", "name": "Sharpe Power Washing", "time": 1552434543963, "rating": 5.0, "text": "Nice job putting out that fire. I'd give you 10 stars if I could!", "pics": null, "resp": {"time": 1552442313548, "text": "Thanks for your support it means a lot to me and my business!"}, "gmap_id": "0x889a0e0f72c33b87:0x31063832c81731cf"}
