{"user_id": "109256953018443662601", "name": "Neal Evans", "time": 1531247065057, "rating": 5.0, "text": "Matthew is a phenomenal Krav Maga coach and instructor. My sons, who are teenagers, and I started with Vindication last fall, and have been devoted apprentices ever since. You will find all levels of experience in the class: from beginners to students who have already achieved some level of certification in Krav Maga. Women, men, young, and older--all types are of folks are welcome. Matthew provides attention to individual students, while keeping the class challenging and fun for all. Vindication Krav Maga is indeed challenging, but offers great rewards for those who dare!", "pics": null, "resp": null, "gmap_id": "0x88891a6c517be76f:0xefabd491a4165485"}
{"user_id": "112932692952736298698", "name": "S ONeal", "time": 1506542808081, "rating": 5.0, "text": "Matthew Holder is passionate about Krav Maga and a thorough instructor. If you are interested in self defense and want someone who has the patience and knowledge to help meet your specific needs he's the instructor for you! I highly encourage women who lack defense skills to try some classes. Even a few classes could mean the difference between becoming a victim and going home safe.", "pics": null, "resp": null, "gmap_id": "0x88891a6c517be76f:0xefabd491a4165485"}
{"user_id": "117858606729746917091", "name": "Andrew Brown", "time": 1508351835943, "rating": 5.0, "text": "I would recommend trying Krav Maga training to just about anyone, including those without any prior self defense experience. started without any background and have been training for about 5 months, and my wife and teenage daughter have also trained for several months. Be prepared to be challenged, physically and mentally, but in a good way and in a safe container. This class is also very physical, so it will double for your movement and exercise needs. The first 2 classes are free...try it out!", "pics": null, "resp": null, "gmap_id": "0x88891a6c517be76f:0xefabd491a4165485"}
{"user_id": "103625045484908168022", "name": "Christopher Story", "time": 1531777395874, "rating": 5.0, "text": "Matthew Holder is an excellent instructor for both myself and my young daughter.  He is very patient and thourough particularly with my daughter.  He pushes his students to excel helping them to really get the best benefit from the sessions.\n\nI wholeheartedly recommend Vindication Krav Maga for anyone wanting to gain a very practical and effective self defense education for all ages..", "pics": null, "resp": null, "gmap_id": "0x88891a6c517be76f:0xefabd491a4165485"}
{"user_id": "106497653525649910319", "name": "Erik Whiting", "time": 1481307833640, "rating": 5.0, "text": "I feel like there's no better way to spend an hour twice a week than making sure that you're safe during the rest of the week. Matthew Holder at Warrior Krav Maga Birmingham AL is a great humble teacher. He has a lot to teach and classes are always full of useful material.\n\nHardest part is going. If you haven't gone yet, try it! He's still offering the first class free!", "pics": null, "resp": null, "gmap_id": "0x88891a6c517be76f:0xefabd491a4165485"}
{"user_id": "107217506419672952996", "name": "Sam Logue", "time": 1482514558381, "rating": 5.0, "text": "Matthew Holder at Warrior Krav Maga in Birmingham Alabama is an incredible instructor! He always helps me improve my form and I'm getting the most killer cardio workout I've ever had during each session. I highly recommend him if you're looking for self defense classes or even just to get some great exercise.", "pics": null, "resp": null, "gmap_id": "0x88891a6c517be76f:0xefabd491a4165485"}
{"user_id": "116042535254012782650", "name": "William Jenkins", "time": 1554601206720, "rating": 5.0, "text": "Was a great class and in many ways life changing for me, definitely worth giving it a try.", "pics": null, "resp": null, "gmap_id": "0x88891a6c517be76f:0xefabd491a4165485"}
{"user_id": "100307855372752491867", "name": "Nicholas Holder", "time": 1509994002908, "rating": 5.0, "text": "I really enjoyed the classes I took at this self defense school and I feel confident if anything were to happen I would know  how to handle the situation. I would definitely recommend this krav maga school to everyone. The instructor makes it easy to pick up on and understand  so you can progress really quickly", "pics": null, "resp": null, "gmap_id": "0x88891a6c517be76f:0xefabd491a4165485"}
