{"user_id": "109692036090398201348", "name": "Ashley Purandare", "time": 1628221010370, "rating": 5.0, "text": "My husband and I ate at Indian Kitchen in the shopping center on the corner of Whitesburg and Airport Rd. In the same place as Ruchi (they moved to south parkway just past Applebee's). Indian kitchen has a buffet everyday from 11-2,. Indian kitchen had a great amount of choices on their buffet. Try them out! I pretty much tried everything and it was all good!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPqmaZMKAqNEFtdM97w8zcz0qjaHkc6zKK8TJgf=w150-h150-k-no-p"]}], "resp": {"time": 1628630767491, "text": "Thanks Ashley for your feedback. Glad you liked our buffet. We try to serve fresh food made from locally grown vegetables   and make sure our customers get a good choice in both vegetarian and non vegetarian. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "103451376400347515648", "name": "Savanna Gunn", "time": 1626634360187, "rating": 5.0, "text": "I was so sad when Ruchi shut down, but heard the head chef is at Indian Kitchen so I decided to try it. 10/10 recommend it. Service was great, but the food was even better. They offer the lunch buffet on the weekends and everything was hot, fresh, and delicious!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOTeGkpsA99DTjQYt5RTd698yNng0HEjWWQHHpm=w150-h150-k-no-p"]}], "resp": {"time": 1626811018395, "text": "Thanks Savanna for your kind words and giving us such a wonderful rating. We will try to live up to your expectations. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "101867861312224833081", "name": "William Crane", "time": 1628808421975, "rating": 5.0, "text": "Food here phenomenal! Some of the best Indian cuisine i have had in a long time. There hot is no exaggeration , it is HOT . There somsa’s are always a special treat . The staff is always very polite and pleasant , and I look forward to the next time to have the  opportunity to go", "pics": null, "resp": {"time": 1629222903535, "text": "Thanks William for taking the time to write the review and your kind words to describe the food and the service. Hope to see you soon again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "103612860800770545051", "name": "Caleb Harvey", "time": 1628474543793, "rating": 1.0, "text": "Worst experience I’ve ever had at a restaurant. I wouldn’t give them another penny of my business in my lifetime nor will my family.\n\nFrom the moment we arrived, the two ladies running the front were extremely rude, and acted as if they didn’t want us there at all. Once we were seated, our drinks were slammed down on our table. 15 minutes passed before we saw them again to place our orders, of which we were given major attitudes.\n\nWe ordered a mango lassie, which was very gritty and was made from some sort of powder. The yogurt tasted rotten, and we told the server about it. She snatched it off our table, and rolled her eyes.\n\nWhile we were here, and the 15 minutes passed by, we saw two other tables get up and walk out without ordering because of the terrible customer service given to them by the “manager”. Please roll back your cameras and watch people walking out after encountering the most rude servers/managers in Huntsville.\n\nThe rice was so dry, we asked for a different entree. Once we got the bill, she refused to take off the drink that cost $3.99 because we took one single sip out of it to find it wasn’t good, and the yogurt was sour. She said “you took a sip so you’re paying for it”. I told her that was ridiculous, that it was rotten, and she rolled her eyes, snatched my debit card from my hand and charged it.\n\nI asked where the manager was, and she said “I’m the manager” and laughed. I truly hope the owners read this review because I have been a very loyal customer to this location, and the chef despite the Ruchi drama. Now I’ve decided to never come back here. If the owners are reading this, please take this seriously and do something about these two because they are running off loyal customers.", "pics": null, "resp": {"time": 1628630268134, "text": "Hi Caleb I appreciate the review and your experience at the restaurant. We spoke to the staff about their behavior and their attitude towards our customers. We gave them a verbal warning regarding their service towards you and your family. Just give us one more chance so that next time you come to the restaurant you can have a good and better experience. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "109148561078733715096", "name": "RalphFLA", "time": 1626472573780, "rating": 4.0, "text": "I have never eaten in a real Indian restaurant before--just a couple of small take-out stands in large cities.\n\nThe person with whom I was dining has had experience dining in Indian restaurants so I followed his lead and my own instincts based on what type of food I generally like.\n\nOne of my favorite foods, and one that I do not often get to eat, is lamb. With that in mind, I decided to try the Lamb Tikka Masala. It was served in a metal bowl. There were a great deal of lamb in the mixture (see the photo). There was also a lot of it. I ate about half of the dish and got a take-out box for the remainder to enjoy it later.\n\nIt was a tomato cream sauce with spices harboring a different flavor than I am used to experiencing. It looked like a thick tomato bisque soup and had some tomato flavor but with different spices.\n\nI also had a Naan bread to accompany the dish. It was very much like the pita bread often served in Greek restaurants and had a similar flavor. There were four large slices of bread.\n\nOverall, the meal was very filling.\n\nMy dining companion ordered the Tandoori chicken. It is pieces of chicken with yogurt and spices and cooked in a clay oven. I had one of the chicken pieces and liked it very much. Again, a different spice than I am used to having but it tasted good.\n\nThe chicken was served on a plate that was sizzling when it came out. Obviously, it was very hot and an impressive presentation with the chicken sizzling rapidly.\n\nFor a drink, I ordered Masala Tea. Again, I had never had this tea and ordered it on a whim. It was very good. Strong black tea with milk and spices, probably cinammon and some other spices. It was robust and filling and served hot.\n\nThis restaurant is in the back of a shopping center and can be easy to miss. Until we got close, I did not see the sign although we were looking for it.\n\nThe meal was tasty and the prices were very reasonable. The servings were generous and many adults will have food left over to take home for another meal.\n\nFor those who have not tried Indian cuisine, this would be a good place to start.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO6dsTnmwlDgq5lxG1NHW_vXiSY8narQmHiffWE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOT_MuHJ-Q5Tdy1zWssaxlpTxYznq_o_cLMc7dU=w150-h150-k-no-p"]}], "resp": {"time": 1626811951087, "text": "Thanks Ralph for you good review. We were happy that you had a wonderful experience at this restaurant. Thanks once again for recommending this place to other people. We need loyal customers like you so we can improve on the quality and quantity of food. Hoping to see you again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "112134516023113586435", "name": "San", "time": 1614559956690, "rating": 5.0, "text": "Newly opened Indian Kitchen have delicious food, right now they are only doing takeout but owner who is also chef said they will be open for dine in soon.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMZ9nn0M6BLmGIub3VUjwL39r3Y53MmAHZyfG23=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO4BAq22H_ORqNMbHwa1CvU8jtnhY2eJ802A1mp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPgTeLgYV9ycRFQ2tpdExDoehm7dcZE4gK_ZRRz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPihXw1Byd6-cME8OcndzvOKgs--k1bFJmv8Rjf=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN_wY6ihuHUA6MkZznVpOBwzLN4ESikr5R5z_kk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNRlFgPnrxVIBhxFTmN0H6NHuVKzbJKRXLmnIwo=w150-h150-k-no-p"]}], "resp": {"time": 1615229403746, "text": "Thanks Santosh for your feedback. We will try to open the dine in soon. Just waiting as a precautionary measure to open the dine in because of the Covid. Till then you can do takeout and enjoy the food."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "112243721236662436087", "name": "Will Sanders", "time": 1628465283224, "rating": 1.0, "text": "From the moment we walked in, we were treated poorly. It took 15 minutes to even get someone to our table. Several patrons walked out the restaurant due to the lack of service. This should’ve been my first indication. We received our food, the food was ok, but we asked for a few things to be taken off. When the bill came the “manager” said since you “tired the food and drink we can’t take it off”. This makes no sense to me… I swiped my card then she turned the screen and I’m not sure if she tipped her self, or changed the amount. She also forged my signature to be able authorize the purchase. This is not right, and I recommend never eating at this restaurant.", "pics": null, "resp": {"time": 1628630497192, "text": "Thanks Will for your feedback. We spoke to the staff and gave them verbal warnings about their behavior towards our loyal customers. Don't worry they did'nt overcharge you or took off any tips. Please try to come back again and have a good experience at this restaurant. Hope to see you again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "105525458803615027637", "name": "Rebecca Booth", "time": 1623211821280, "rating": 5.0, "text": "All I can say is WOW! I have been to India several times and I can honestly say this is THE MOST Authentic Indian food i have had stateside.  Their fresh ingredients and great prices will definitely have you coming back for more.  Do yourself a favor,  stop and experience the BEST Indian food around. You won't be disappointed!!", "pics": null, "resp": {"time": 1623700927661, "text": "Thank you Rebecca for your kind words and your good review. Hope it guides other people to our restaurant who are craving for good authentic Indian food"}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "107499727408090968108", "name": "grey ish", "time": 1621054594808, "rating": 5.0, "text": "This is one of the best restaurants in the city. Not one of the best Indian cuisine restaurants, of which there are too few. One of the very best, any cuisine, any style.\n\nWe have enjoyed a few very nice Indian restaurants in the area over the years, but they closed down or were sold. We have been craving a place like this and when we saw it was open, we took a chance. Long story short, we we back two days later.\n\nTried a few different entrees, naan, samosas, and a few cauliflower dishes. The Gobi Manchurian is a real treat. And the samosas with the mint chutney/sauce.... I put the leftover sauce on a sandwich.\n\nThis is a bit of a hidden spot but I really hope everyone goes there. They are making amazing food.", "pics": null, "resp": {"time": 1618427668413, "text": "Thank you for the good review and the 5 stars you gave for the restaurant. Hope your review helps us to get more customers so we can serve them good and authentic food.  Hope to see you soon again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "116002136322061448698", "name": "Dr. David Thomas", "time": 1628467809932, "rating": 1.0, "text": "Very rude, I would not recommend. We left without ordering. I will never come here again.", "pics": null, "resp": {"time": 1628714255521, "text": "Hi Dr. David, can you please call us and let us know your bad experience with us. In that way we can take the necessary action against any staff who made your experience a bad one. We hope to see you again and make you our loyal customer."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "105521335047088053333", "name": "J. Berger", "time": 1628808066896, "rating": 5.0, "text": "Excellent food. Always delicious and fresh!", "pics": null, "resp": {"time": 1629222969758, "text": "Thanks Ms. Berger for your good review about the food. We have a lot of choices on the menu. Hope you will like it and enjoy. See you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "104474139759000562369", "name": "Jonathan Korbell", "time": 1628871639644, "rating": 1.0, "text": "Unimpressed, unamused, and displeased with the rude staff. The Mango Lassie is powder based, and not fresh. Quite sour on the palate.", "pics": null, "resp": {"time": 1629222834041, "text": "Thanks Jonathan for your feedback. We tried to brief the staff about their behavior. Regarding Mango Lassi we do not use any powder. We make it fresh on order. Maybe you liked it sweet. Next time let us know and we will make it to your order. Thanks and hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "109584292791393837695", "name": "Joel Gaddis", "time": 1624746692960, "rating": 5.0, "text": "Amazing food, so much flavor!!! And the dining room is now open!  If you are reading this: close your app and just go here!!!! Seriously, this is some of the best food I have eaten. Definely the best Indian food.  I can say that the lamb vindaloo, coriander chicken, and chicken 65 were delicious.", "pics": null, "resp": {"time": 1625164784175, "text": "Thank you Joel for the amazing review you gave for the restaurant. Hope it guides people to our restaurant who appreciates a good quality of Authentic Indian food."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "108747879160155919984", "name": "Sierra Belle", "time": 1627499707871, "rating": 5.0, "text": "The Butter chicken-spicy was phenomenal! My fiancé got the lamb Roganjosh and really enjoyed that as well. It was our first time trying Indian food and we will definitely be back. Everything we got was amazing down to the Naan and the dessert. 10/10 would recommend. Price wasn’t bad for the portion size either.", "pics": null, "resp": {"time": 1627682682290, "text": "Thanks Sierra for the good review you gave for our restaurant. Glad your first time was a good experience. Hope to see you and your fiance next time."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "102311668675687723900", "name": "Jalen Johnson", "time": 1628465423723, "rating": 1.0, "text": "Would not recommend eating here. The service is horrible.", "pics": null, "resp": {"time": 1628714663399, "text": "Hi Jalen sorry for your bad experience you had  at this restaurant. We have taken the necessary action against the staff. Hope you will have a good experience the next time you dine in. See you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "101055970265859953306", "name": "Sherman Wilcox", "time": 1614826902775, "rating": 5.0, "text": "Excellent food, nice to have a great neighbourhood Indian restaurant", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPUoWHo2WBWagjKSiTqK0M6LvBOhPCoLIX_ZIzl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPX-fE-s0MpOOS7I0E0xsNtk7DyXRBtrc7xw5WB=w150-h150-k-no-p"]}], "resp": {"time": 1615228160100, "text": "Thanks Sherman for the 5 Stars. Its nice to have you Sherman in our Good Customer list."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "105264286556309634197", "name": "damintrading trading", "time": 1626569711416, "rating": 1.0, "text": "Worst restaurant ever. I ordered food for the family and everyone got major upset stomach. I called just now to complain and the girl who answered the phone told me that there are lot of diseases out there and it wasn’t them instead of admitting her mistake. Just to know I wasn’t looking for either a compensation or my money back. Just wanted them to acknowledge.  Please order from here if you definitely want diarrhea", "pics": null, "resp": {"time": 1626811515100, "text": "Sorry to hear that you had a bad experience at our restaurant. We take these reviews very seriously. We investigated the case and found out there were so many orders on that day when you ordered but you were the only one whom we learnt had a problem with the food. Maybe it was just a coincidence that you ordered food on that day and we got the blame for it. Anyways give us one more chance and you might give us a good rating next time you visit."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "114678771439236343626", "name": "Anthony", "time": 1617231026395, "rating": 4.0, "text": "I have been waiting for some good Indian restaurants to come to Huntsville. The other options don’t meet my expectations by a long shot. Indian kitchen is your best option in Huntsville by far. Much better flavors, slightly larger portions, and better heat levels. The lamb was hit or miss. Some pieces were tender and moist, but most were dry and chewy. Really wish this restaurant would sell papadums. It’s a very common item to find in Indian restaurants so I’m not sure why they don’t have them. Overall a big step up from the other Indian restaurants. Looking forward to trying many other dishes", "pics": null, "resp": {"time": 1618427808782, "text": "Thank you for your feedback. Try our other dishes too from the menu. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "100265178809566164000", "name": "Cameron Blake", "time": 1624595939202, "rating": 5.0, "text": "Super friendly service and amazing food.\n\nThe butter chicken is exceptional and pairs perfectly with the garlic naan.", "pics": null, "resp": {"time": 1625165092561, "text": "Thank you Cameron for the  review. Try other dishes too which are equally good so next time you have a choice to select. Hope to see you again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "109554853328849809248", "name": "battenro", "time": 1620928152963, "rating": 5.0, "text": "If, like myself, you crave authentic Indian curry with all the spice and taste you could ever want than this is the place for you. You can have your curry as mild or as hot as you want and it’ll still be the best in Alabama.", "pics": null, "resp": {"time": 1623700739233, "text": "Thank you very much battenro for your good review. Hope it helps other people who are craving for authentic Indian food. Thanks once again and we will try our best to keep up the good work."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "101066518308205231811", "name": "Yasir Afzal", "time": 1626760502079, "rating": 5.0, "text": "Amazing food. Don't forget to try their buffet from Friday to Sunday.", "pics": null, "resp": {"time": 1626811068507, "text": "Thanks Yasir for the 5 Stars and the good review. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "112048518799893780634", "name": "Angela Keys", "time": 1616887223859, "rating": 5.0, "text": "My husband and love Indian food and this is by far the best we've had in town.  The spice is right, the price is right, and the portions are generous.  My children even love it!", "pics": null, "resp": {"time": 1617163503267, "text": "Thank you for leaving us a rating of your experience at our business. We hope to see you again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "114429590628606961998", "name": "Erik Walsh", "time": 1625979263021, "rating": 5.0, "text": "Really good! Friendly staff. Everything was great!", "pics": null, "resp": {"time": 1626292616499, "text": "Thanks Erik for your wonderful review. We are striving to keep up to the standard and the quality of the food. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "107565195687720692215", "name": "Brandon Hardiman", "time": 1625874339395, "rating": 1.0, "text": "The reviews sound great but good luck eating at this place. Every time I call to place an order I get a busy signal or hung up on.", "pics": null, "resp": {"time": 1626292736532, "text": "Hey Brandon we apologize about your experience. We just investigated the problem and tried to fix it. You can try to order now and enjoy your favorite Indian food."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "103891599538365443925", "name": "Kelsey Ballard", "time": 1624482758824, "rating": 5.0, "text": "Best Indian food in Huntsville! I will miss this place when we move :( Awesome butter chicken, palek paneer, tikka masala, garlic naan!!!! it’s fast, always hot, perfect spice level, and huge portions!", "pics": null, "resp": {"time": 1625165274048, "text": "Thanks for the review Kelsey. Its sad to hear about your moving but till then you can enjoy the amazing food. Hope to see you again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "103286463787828150038", "name": "Lisa GV", "time": 1624765568384, "rating": 5.0, "text": "This is the absolute best Indian food!! We recently moved to North Alabama from Colorado, and I didn't expect to find the most delicious chicken tikka masala, Peshwari naan, and gulab jamun I've ever had right here in Huntsville. The flavor and quality is amazing! This place is well worth the drive for us, and I can't wait to try more items from their large menu. Also, they were open for dinner dine in service tonight (June 26, 2021). I hope more people discover and support this delicious restaurant, as I'd love to see them one day expand and build additional locations in the Madison or Athens areas! :)", "pics": null, "resp": {"time": 1625165184027, "text": "Thank you Lisa for the best review. Its our pleasure serving your family. Hope to see you again soon in the future."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "115468059962084050307", "name": "Watching You", "time": 1627748384957, "rating": 5.0, "text": "Wow what can I say . The cook NO he is not a cook he’s maker of art in Preparing Indian food with class Namaste to the chef  found a new home to eat", "pics": null, "resp": {"time": 1627929606560, "text": "Thanks for your review. Glad you liked our food and made our place your home to eat. You will be always welcome. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "110548127646591728358", "name": "Katie Duncan", "time": 1622233669605, "rating": 5.0, "text": "The best Indian restaurant in Huntsville. Their butter chicken is amazing!", "pics": null, "resp": {"time": 1623701034957, "text": "Thank you Katie for the good review. Hope you try other dishes from the menu. All are amazing made from fresh ingredients and locally shopped."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "104091280627351472944", "name": "Sarah Mayers", "time": 1618187615384, "rating": 5.0, "text": "Best Indian food in huntsville. Get the chicken tikki masala and you won’t regret it 🤌🏼", "pics": null, "resp": {"time": 1618427526042, "text": "Thanks Sarah for your feedback. Hope you try other dishes from our menu. See you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "115136592800815272885", "name": "Dylan Lawson", "time": 1619111609609, "rating": 5.0, "text": "Some of the best spicy food I have ever had, excited about this again and again!", "pics": null, "resp": {"time": 1623701174188, "text": "Thank you Dylan for the good review and we are glad to have you as a regular customer. Hope we keep our good relationship"}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "105366432682695181344", "name": "Tanu Singhal", "time": 1614307206947, "rating": 5.0, "text": "Tried this place and it’s awesome. The owner is very friendly.  The food quality is super good and the quantity is just the perfect amount.  They definitely have my business.  I am very picky when it comes to food and this place meets my expectations! Thx  AJ", "pics": null, "resp": {"time": 1615229526476, "text": "Thanks Tanu for your feedback. And we are glad that we meet your expectations in regards to the food. We try our best to use the local grown fresh ingredients so our customers can get a good taste of the food. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "114959979351838162804", "name": "James", "time": 1614658008862, "rating": 5.0, "text": "Easily the best indian restaurant in huntsville.\n\nPortions for the price is exactly what you would expect.\n\nQuality is consistent. Food is rich in flavor as you would expect from indian food.\n\nThe chief is clearly passionate and it really does come out in his food. Hope this restaurant keeps its consistency and wish them the best. Give this place a try you won't regret it.", "pics": null, "resp": {"time": 1615228010161, "text": "Thanks for your feedback. We will try our best to keep up the consistency of the food. Thanks once again James."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "114305506286996643516", "name": "Matthew B.", "time": 1628564575995, "rating": 1.0, "text": "Rude staff, charged for drink we asked to be sent back, PHYSICALLY snatched my card from me so they could charge it without any sense of hospitality. Terrible service. Hope this place burns.", "pics": null, "resp": {"time": 1628714382123, "text": "Hi Matthew sorry for the terrible experience you had from our staff. We have taken the necessary action against the staff and we promise you wont be disappointed the next time you come in."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "109894387448692012147", "name": "Yasmin Baria", "time": 1615232380188, "rating": 5.0, "text": "We ordered takeout twice and the food was delicious, great quality & quantity and authentic. A must try.", "pics": null, "resp": {"time": 1616559971483, "text": "Thank you for taking the time to leave your feedback. We hope to see you again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "103934930776023448710", "name": "Jeremy Lawson", "time": 1615083967311, "rating": 5.0, "text": "Unfreakinbelievable!!! THIS is the place to go for Indian. Loved when Ruchi was there but since they moved, their food hasn't been as good. Not sure what happened but what they lost, Indian Kitchen found. Hoping Ruchi figures it out but until then, Indian Kitchen is the place for us!", "pics": null, "resp": {"time": 1615228103961, "text": "Thanks Jeremy for your feedback. We would like to keep up the good work and make sure customers keep coming back. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "108588572612880142685", "name": "Vanessa Coutinho", "time": 1615296002256, "rating": 5.0, "text": "The best Indian food ever. I would recommend this restaurant as it has quality food with reasonable price also the stuff is super friendly. I had chicken tikka masala, garlic naan, vegetable samosas.", "pics": null, "resp": {"time": 1616559963684, "text": "Thank you for leaving us a rating of your experience at our business.We hope to see you again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "109395855166440750812", "name": "Sam Sungg", "time": 1629233213390, "rating": 1.0, "text": "Impudent staff members. Won’t be back.", "pics": null, "resp": null, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "102650922004617323408", "name": "Sean Kruer (Normal Human Person)", "time": 1620082603246, "rating": 5.0, "text": "Very tasty! Great portions, great flavor!", "pics": null, "resp": {"time": 1623701100249, "text": "Thank you Sean for the 5 stars and the good review."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "106552933216372447886", "name": "Nick Rainosek", "time": 1628962482305, "rating": 5.0, "text": "Great food, great service!!", "pics": null, "resp": {"time": 1629222658924, "text": "Thanks Nick for your good review. Hope to see you soon again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "102524070747235829604", "name": "Annika Rettstadt", "time": 1614650478730, "rating": 5.0, "text": "Indian Kitchen is where it's at!! My boyfriend and I were visiting from out of town and love Indian food, so we decided to order from Indian Kitchen on a whim. We were not disappointed! This is a mom and pop store hidden away in an outlet mall. Please support small and local businesses!\n\nWe ordered two vegetarian entrees: Palak Paneer and Paneer Tikka Masala. We also ordered the Mixed Vegetable Pakora appetizer, and a side of Garlic Naan. I will say that this is a LOT of food for two people since the portions were huge (we have days worth of leftovers) and we were served rice to compliment our meals. All of the food was absolutely delicious, and I look forward to returning to Indian Kitchen very soon.", "pics": null, "resp": {"time": 1615229173841, "text": "Thanks Annika for your feedback. We are glad you and your boyfriend liked the food. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "114957049018370812649", "name": "Taylor Satula", "time": 1614650739661, "rating": 5.0, "text": "Really impressed with the food me and my significant other ordered. We got a spread just to try it out and everything we ordered was delicious.\n\nWe got palak paneer, panner tikka masala, naan, (a boatload of) rice, mixed vegetable pakora, and it came with mint sauce and tamari sauce.\n\nThe paneer was firm with a great mild flavor. You could tell it was made fresh by the firm bouncy texture.\n\nThe spinach and the tikka masala sauces were nice and thick. Just the right amount of good spices talking to each other in the sauce.\n\nNaan had great crispy tips and was also clearly homemade\n\nPakora was KILLER dipped in the mint sauce\n\nI will absolutely be going back to Indian kitchen. It was a little bit hard to find because they don’t have an illuminated sign yet. It has a red curtain draped out front. Staff was very nice and I have nothing but good to say about it,,,,, it was just a really good spot. Glad they’re near my house.", "pics": null, "resp": {"time": 1615229096722, "text": "Thanks Taylor for the feedback. Now with your comparison we know where we stand. We will try our best to give our best in terms of food. See your soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "109002625900397804407", "name": "Amy Ragan", "time": 1614565607040, "rating": 5.0, "text": "I was loyal to Ruchi when they were at this location. Tonight my husband and I did a taste taste between the newly-relocated-Ruchi and the newly-opened-Indian Kitchen. We got a medium chicken tikka masala and a garlic naan takeout from both restaurants at the same time.\n\nIndian Kitchen’s curry was thicker and more flavorful, and their chicken looked like it had been nicely charred. Ruchi’s gravy was thin and much more bland, and the chicken was dry and kinda sad looking.\n\nThe rice and naan were pretty comparable for both, but Indian Kitchen’s naan was totally loaded up with garlic so it had more yummy garlic flavor.\n\nWe did not expect this outcome! We just thought it would be fun to compare. But it looks like we will be returning to Indian Kitchen!", "pics": null, "resp": {"time": 1615229294312, "text": "Thanks Amy for your feedback and  for the hardwork you and your husband did to compare the food. We will try to keep up the good work and keep the consistency in terms of the food. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "118215758882543425758", "name": "Lauren Badia", "time": 1618364421370, "rating": 5.0, "text": "Amazing food! We are in love with this place!", "pics": null, "resp": {"time": 1618427603577, "text": "Thanks Lauren for your feedback. We will try our best to meet your expectations and make sure you keep loving this place. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "100393840576742808125", "name": "Oscar Delehoya", "time": 1628467895430, "rating": 1.0, "text": "DO NOT EAT HERE!!!", "pics": null, "resp": {"time": 1628714480400, "text": "Hi Oscar can you please elaborate the bad experience you had dining here. So we can take the necessary action against whoever did it to you or your family. Hope to see you again soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "115677236025395872822", "name": "Andrew Kelley", "time": 1626650426142, "rating": 5.0, "text": "Best Indian food in Huntsville", "pics": null, "resp": {"time": 1626811151682, "text": "Thanks Andrew for the good review you gave us. It  really helps us and motivates us to keep the 5 stars which you rated us. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "109818532959708356034", "name": "Michael Smith", "time": 1620351314016, "rating": 5.0, "text": "Amazing", "pics": null, "resp": {"time": 1623701062455, "text": "Thank you Michael for the 5 stars"}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "109007667694871771198", "name": "Vikram Gupta", "time": 1623013588402, "rating": 5.0, "text": "I ordered chicken 65 and paneer 65 bowl and the taste is just awesome.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOOVdSe7n6Xh3Hcme9VukGr54jA4_Cqh8NnyLov=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOA5Wg46KV015gMgGD1PARh4FyXR82811hYnfrt=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "109101683760206148966", "name": "Sadie Mae Carlson", "time": 1622485578994, "rating": 5.0, "text": "I always love coming here! I’ve been here even before they started making food. It’s so good, I love how they have so many options where you can even build bowls and wraps too. The customer service is beyond phenomenal and I could honestly eat here everyday. It never gets old! Beyond recommend.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "108227725576654885622", "name": "arlevia anderson", "time": 1623621235049, "rating": 5.0, "text": "DELISH OMG 🙌🏾😋", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPM8u-0-chwyGEKjUfZvzAaAjkEyxivI7mevS5a=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO19yLyYkdGQoYf2mEeX2IlLZ0ghhhgVc2TK5EY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMHge2wavFF711HMeAVDjobZ10UzkgGrz3EUS1x=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "113343903625619805596", "name": "Keith Walker", "time": 1619898716247, "rating": 5.0, "text": "O\nM\nG\nThis place is incredible! This is family owned and operated.\nThey are now serving Indian food—bowls, wraps, special dishes—\nAll made in-house...it tasted soooo good. It felt like the food came right out of their home kitchen.\nWe met the family—the husband, wife, son...incredibly kind and gracious, and very proud but humble about their delicious made from scratch food.\nI’ve had black pepper beef (incredibly tender and flavorful) and tandoori chicken—perfect—and the fries with the sauce.\nI highly recommend dining here. I’m trying the ice cream next time!\n👏🏻💯‼️", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "100978275127662040175", "name": "Brianna Bowles", "time": 1619546565277, "rating": 3.0, "text": "Decent Indian food. The tandoori was way to salty. Almost unpalatable. But the chicken 65 was delicious. I like that the food has some spice to it.\nRice was the perfect tenderness. We also got fries for our little one and they were amazing! If it weren't for the tandoori and 30 min wait (only ones there too) I'd give it a 5 star. But to have your main dish too salty to eat was a bummer. Will definitely go back to have the chicken 65 though.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "114305805397818525701", "name": "East West Martial Arts", "time": 1618619680005, "rating": 5.0, "text": "Delicious Food! Great staff and owners, friendly and helpful. Try something different besides burgers, you won't be disappointed! I highly recommend pairing tandoori chicken with the delicious white garlic sauce! You'll get a creamy delicate spice!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "107443148721868943918", "name": "Cecilia Venus", "time": 1616188594829, "rating": 5.0, "text": "The best halal food around 👍🏻 my husband and I come here atleast once a week. The owners have become very good friends :) thank you for the excellent quality and hospitality", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPjJRuGph7_YBMxgtK08TVvdWuEJxUIji-eGOiD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNZ6Pk86yYhbl7-NixN9N5LKF5VvaGiTmrv52I7=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "117973332734875818492", "name": "Jose Negron", "time": 1616812151714, "rating": 5.0, "text": "Family run business that has great customer service!! Best hand crafted ice cream in Columbus with fresh ingredients and delicious bubble tea. The food is authentic and prepared fresh daily! I highly recommend this place and look forward to returning again and again!!!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "107890459463858030584", "name": "Diana Childs", "time": 1616600968845, "rating": 5.0, "text": "Hidden Surprise! This is a one of a kind Indian/Dessert Palace. Gluten Free Excellency!!! A MUST Try🍧 We had a smoothie with strawberry 🍓/Mango 🥭 Boba beads.\n\nRolled Ice cream AWESOME\n\nGREAT ATMOSPHERE & SERVICE VERY FRIENDLY!! Will be back 😊", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "100640659364101266492", "name": "Raadia Khan", "time": 1622342790233, "rating": 5.0, "text": "Amazing restaurant ! Halal Indian food, we got the tandoori chicken wrap and masala fries. It had the perfect amount of spice. We then had the masala chai, love you smores ice cream, and the coffee vegan ice cream. The staff was so friendly and helpful. Definitely going to be a regular here. I can’t wait to try all the different menu items", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "105852922882754340025", "name": "John Oliver", "time": 1606678637761, "rating": 5.0, "text": "My friends and I stumbled upon this place by chance on a day trip to Columbus. At first glance, it’s a quaint, clean, cool little ice cream shop. However, in a quick conversation with the owners, my friends learned that they also offered Indian cuisine and they were offered a free sample. Intrigued, But unable to eat there that day, we all decided to make a special trip to try to the food the following week.\n\nWe could not have made a better decision, as this was some of the best food I have ever had. The abundance of flavor was just what I was hoping for and the quality was almost like having a homemade meal served at your table. The owners (it’s a family operated business) checked on us and seemed very genuinely interested in our experience. They were extremely hospitable and friendly, making great conversation and adding to the experience with a very personal touch.\n\nIce Queen is well worth the time and I’m looking forward to going back!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "115659347180008828371", "name": "Corey Moore", "time": 1606595774669, "rating": 5.0, "text": "This place is a hidden jem. My wife and I wanted ice cream so we stopped randomly here to find they offer a full authentic Indian menu. We came back this weekend to try their food and it was beyond incredible. Gluten free friendly and vegetarian friendly, which is perfect for my wife and I. We'll travel from Albany for this every chance we get from now on. Could not recommend enough.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "106071210199375798295", "name": "Daniyal Gaziani", "time": 1516477659464, "rating": 5.0, "text": "Really enjoyed having rolling ice cream here. Probably, the best ice cream I have ever had. The staff is very welcoming and provides good hospitality. I would highly suggest this place.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOqV7uhIi2DwrFxOOX43WCIls4119sIfFFqioDg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOZBjuMVp7Xdq11-DclBagJSVizCo2rHtIztPIp=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "115945489828079110917", "name": "Lucy Clarke", "time": 1598746677652, "rating": 5.0, "text": "Everything there is delicious. I had the tandoori chicken bowl and samosa as my meal, and it was great. Their coconut milk tea was very refreshing, too. The rolled ice cream was excellent, all of the flavors were very good. Everyone working there was super nice and helpful, and they even gave us an extra samosa to apologize for any extra wait time. I would definitely recommend coming here for dessert or dinner (or both).", "pics": null, "resp": {"time": 1606713725670, "text": "Thank You for your kind review Lucy! We can’t wait to serve you guys again!"}, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "117272474469710887666", "name": "Radon Vex", "time": 1609592007784, "rating": 5.0, "text": "My wife and I use to come here only for bubba tea. Today, we decided to try their food and it was better than I expected. I got a matcha tea and I hated so the guy made me a Tara tea free of charge. It was absolutely delicious. Ice queen truly deserves 5 stars. The staff is extremely nice the place is always clean. They work quickly and the prices aren’t to bad either. Definitely a hidden gem in Columbus.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "112453631245110966891", "name": "Amber", "time": 1618690763468, "rating": 4.0, "text": "Been there three times in the past month. I love the boba, especially the brown sugar boba. And I love the honeydew milk tea and the chai milk tea.  The staff was super friendly and helpful. The only reason I didn't give it 5 stars is because when we got the popping boba, a lot of them were already popped so we were just getting the empty boba shells. Besides that, this place is awesome! I definitely recommend going", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "111641498028970203331", "name": "Megan Phillips", "time": 1606595759567, "rating": 5.0, "text": "PHENOMENAL traditional Indian food. Yes, the ice cream is great too, but we drive all the way from Albany for the Indian food. The Chicken 65 is incredible. I can’t have gluten and the owner’s mother is so sweet and guides me on what I can order. We are addicted.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "105841706038848176820", "name": "Jessie Daniel", "time": 1622414826069, "rating": 5.0, "text": "Great service and yummy food :) respectfully 💕", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "111358742334338870132", "name": "Vivian 'Valkyrie' Piorkowski", "time": 1574484182253, "rating": 5.0, "text": "Our first time and I want to go back. Thankfully it's not far from my house. My sons really enjoyed being able to watch them and they thought it was just amazing how it turned from liquid to ice cream. The variety of ice cream flavors and toppings is great. My husband got a philly cheesesteaks and he said it was really good.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMW7XINDdsi4vdyW8zrJrTUdyRtUezVTwFwTs1n=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM1fST1xqkuy0bOIoupXbftMtZnixBFoWkZy_1r=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMM412okURczHiHHElPz_bB8yJXP9yxBlBs8Tpo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP1vOJeEfg_a5a88Llgl_w_9kmHJ_hbM-8cN0ve=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "112453631245110966891", "name": "Amber", "time": 1618690763468, "rating": 4.0, "text": "Been there three times in the past month. I love the boba, especially the brown sugar boba. And I love the honeydew milk tea and the chai milk tea.  The staff was super friendly and helpful. The only reason I didn't give it 5 stars is because when we got the popping boba, a lot of them were already popped so we were just getting the empty boba shells. Besides that, this place is awesome! I definitely recommend going", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "111641498028970203331", "name": "Megan Phillips", "time": 1606595759567, "rating": 5.0, "text": "PHENOMENAL traditional Indian food. Yes, the ice cream is great too, but we drive all the way from Albany for the Indian food. The Chicken 65 is incredible. I can’t have gluten and the owner’s mother is so sweet and guides me on what I can order. We are addicted.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "105841706038848176820", "name": "Jessie Daniel", "time": 1622414826069, "rating": 5.0, "text": "Great service and yummy food :) respectfully 💕", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "111500113567121248726", "name": "JoAnna Hill", "time": 1619962812216, "rating": 5.0, "text": "Had a spicy tandoori wrap and fries.  So delicious!!!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "113759996123349442535", "name": "lydicake yumyum", "time": 1605483954092, "rating": 5.0, "text": "My husband heard about it through a coworker, so we decided to give it a try. When I tell you we weren't disappointed about our trip here. We chose make your own ice cream bowl. It was so delicious, and I love the strawberry pop. The strawberry pop is little squeeshy balls that burst in your mouth, and they are excellent", "pics": null, "resp": {"time": 1606286014707, "text": "Lydicake! Thank you so much for your review! We are glad we were able to meet your expectations and deliver a great product! We can’t wait to share more exciting items with you soon! PS: Strawberry Pop’s are our absolute favorite too!"}, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "106071210199375798295", "name": "Daniyal Gaziani", "time": 1516477659464, "rating": 5.0, "text": "Really enjoyed having rolling ice cream here. Probably, the best ice cream I have ever had. The staff is very welcoming and provides good hospitality. I would highly suggest this place.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOqV7uhIi2DwrFxOOX43WCIls4119sIfFFqioDg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOZBjuMVp7Xdq11-DclBagJSVizCo2rHtIztPIp=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "100992905999575539899", "name": "Michael Lynch", "time": 1518057421446, "rating": 5.0, "text": "Novelty way to prepare your ice cream. Watching them prepare your treat is a treat. The post it wall is a great idea.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMqRCYD5Q4Kl0FO9P10yCcmRVU6tB1QLnVmCniL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM-bbTVswdJOHCGGh6sKaKHRnAKeEKvUFtF0pVF=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "112042435550056543226", "name": "Benjamin Poteat", "time": 1600461819465, "rating": 5.0, "text": "Definitely a nice place to go for dessert, even during quarantine. They wear masks and prepare your treat safely, as always, and are very nice! Definitely recommend to anyone looking to get a tasty treat for a decent price!", "pics": null, "resp": {"time": 1606799193189, "text": "Thank You for your kind review Benjamin! Yes! Safety of our customers and crew is of the utmost importance to us! We can’t wait to see you guys again soon!"}, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "102911683113358112193", "name": "Breanna Swain", "time": 1623515756483, "rating": 5.0, "text": "Really Vegan friendly and good food", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "110163446081214772271", "name": "Ben Butler", "time": 1611519959006, "rating": 5.0, "text": "good food ,great fresh ice cream ,great and polite staff", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "116234058904826424258", "name": "Jewel Patterson", "time": 1600364514376, "rating": 5.0, "text": "This is INCREDIBLE food. Go try it, you will NOT be disappointed!!! The ice cream and drinks are also fantastic, but really really go for the food.", "pics": null, "resp": {"time": 1606799105354, "text": "Thank You for your kind review Jewel! We can’t wait to serve you again! PS: We have added an expanded menu since your last visit 😉 come check out more of delicious items we have to offer!!"}, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "104418681808631929635", "name": "Titian Dahlvang", "time": 1597108402594, "rating": 5.0, "text": "Great little shop for rolled icecream and Indian food! It's all halal by the way! Great service, and great product. Family run little joint. Best things to get in my opinion are Taro Bubble Tea, Morning Call rolled icecream, and Chicken 65!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMkuT0sxVgeII-bSwZJ90h_xCbUNSrufo1Zhqi5=w150-h150-k-no-p"]}], "resp": {"time": 1606713471679, "text": "Thank You for your review Titian! Come see us sometime with Nadia!"}, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "110160051062139816587", "name": "Zachary Stine", "time": 1563236821790, "rating": 5.0, "text": "Best ice cream in Columbus!  Quite a spectacular process to watch them roll the ice cream on a cold table. Tastes as good as it looks!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOz6UWy9zf84chHGpMAB6c1TzfYiht6OWpYbA7i=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "106067468279907668949", "name": "Angel", "time": 1619564131144, "rating": 5.0, "text": "Well definitely visit again.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "116473654330778983289", "name": "Luke Miller", "time": 1605463265615, "rating": 5.0, "text": "Delicious Indian food, bubble tea, and rolled Ice cream. They have amazing service and a nice calm atmosphere.", "pics": null, "resp": {"time": 1606285804038, "text": "Thank You so much Luke. We are so glad you enjoyed your visit! Can’t wait to serve you again soon!"}, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "106417402854556242105", "name": "A M", "time": 1599679892128, "rating": 5.0, "text": "I have been her twice. I love their bubble tea and the bowls. The food is great and is prepared quickly.", "pics": null, "resp": {"time": 1606713846692, "text": "Thank You for your kind review AM!"}, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "105638802291952119158", "name": "Angela Graves", "time": 1589132233053, "rating": 5.0, "text": "Didn’t even know this restaurant was back here. We stopped in to try, what a great find. Food was fresh and delicious, will be back again.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMhyTlGpOXAAnD-7-x8ZFoh3uV1U0HuHQYtDkZr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOEHiZJsxfGeB7GRydedd1CTCd15XkojHzLfb7r=w150-h150-k-no-p"]}], "resp": {"time": 1592184989166, "text": "Thank You Angela! We can’t wait to see you again!"}, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "113699269656175599313", "name": "G Bre'Z", "time": 1534367176472, "rating": 4.0, "text": "The ice cream rolls are good and getting to watch them make them is an experience in itself.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMaKBvAhSn7mX-MEDcuZFKK0E8503cC83RvEzjx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOOKMcwdr6KTFXh2Sn2zNi4c_FKutEPKH_EPQFV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOYndadQQBXz2RHRGx0dZrnNSIqtVuAo5uIj-Il=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN2BpPG6rAm8Qlw6GSyc9PMpYbiVacMdrZPRT8f=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "109711725702583756354", "name": "Ternice Coles", "time": 1614580120809, "rating": 4.0, "text": "Quick service. Very clean", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "117339362302017184403", "name": "Joy Childree", "time": 1615660344858, "rating": 5.0, "text": "Wonderful Ice cream..Great staff.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "104015243005919411206", "name": "Dalvin Tucker", "time": 1547517803580, "rating": 5.0, "text": "Love the ice cream hope they have many great years at this location, and love the presentation of the funky monkey", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO1jthEIdFn0BSSOYIMnik6BlkPWzhvcbSPUK7X=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNUMVFtM2mE3DTwGfsBt-mri6DHijRwnHMfh7XL=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "111358742334338870132", "name": "Vivian 'Valkyrie' Piorkowski", "time": 1574484182253, "rating": 5.0, "text": "Our first time and I want to go back. Thankfully it's not far from my house. My sons really enjoyed being able to watch them and they thought it was just amazing how it turned from liquid to ice cream. The variety of ice cream flavors and toppings is great. My husband got a philly cheesesteaks and he said it was really good.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMW7XINDdsi4vdyW8zrJrTUdyRtUezVTwFwTs1n=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM1fST1xqkuy0bOIoupXbftMtZnixBFoWkZy_1r=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMM412okURczHiHHElPz_bB8yJXP9yxBlBs8Tpo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP1vOJeEfg_a5a88Llgl_w_9kmHJ_hbM-8cN0ve=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "104267394994659328626", "name": "Kaman Yang", "time": 1536469137276, "rating": 5.0, "text": "Delicious rolled ice cream! There are a lot of choices for toppings. Great little dessert place to hang out with family and friends.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPFOFKMtVPRI33pFkNgjdcK-bCAbFfQ96tdsuiK=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "113588932486319399911", "name": "Mitz Zey", "time": 1610655765099, "rating": 4.0, "text": "Awesome folks and wonderful Indian food.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "112042474617853922107", "name": "Heather Om", "time": 1531946303716, "rating": 4.0, "text": "Really good rolled ice cream, fun to watch them make it. Awesome flavors, and they have bubble tea. If they had shaved ice Korean style I would be here everyday. We didn't try any of the food, but it looks good too!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPKO9WtSocB9rZH2TmxyUYZaYzIX6y4Y3IDQLvo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNLFSWs4Q-AA8WDsvr6KI3TmeK7jOiR-GDnBu0D=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "115411883368680641064", "name": "Alex Bow", "time": 1547514566323, "rating": 4.0, "text": "As fun to watch being made as it is to eat.\nEdit: RIP Royal Cafe, long live Ice Queen.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOxlo-s8sFW-eccxckjc4Sdey7dR6oTZ4ibG9-u=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "100787161986415252636", "name": "MISS NITA", "time": 1560625240205, "rating": 5.0, "text": "Very delicious ice-cream... I loved it! 🍧", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMzrqPRBm5I_r0kUJobwL9diG_nRLWbY31-xrys=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "102074124223847539329", "name": "mohammed newcombe", "time": 1616013736147, "rating": 5.0, "text": "Quick serving and yummy taste", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "104042768113198404121", "name": "Red2Gaming", "time": 1594785993352, "rating": 5.0, "text": "I dont generally leave reviews unless the place is bad but this place is by far my favorite ice cream place ever I 10/10 recommend here worth the wait time if there is a wait", "pics": null, "resp": {"time": 1595370275258, "text": "Thank You so much for taking the time to leave us a feedback! We are so glad to be your favorite icecream place! We are trying very hard to rectify the wait times without sacrificing quality or the signature homemade taste that our customers love!"}, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "104473268260013127087", "name": "Tylor Hall", "time": 1584400375162, "rating": 5.0, "text": "My first time, and didn't disappoint.  I'm a kid at heart, so I got the fruity pebbles.  Staff was very friendly with greeting when entering and exiting.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "100890178534778479146", "name": "Victor Craven", "time": 1597271411872, "rating": 5.0, "text": "This place is 100% 🔥, go in or get their food delivery. The fruit tea is delicious everytime! #IndianFood #BobaTea", "pics": null, "resp": {"time": 1606713541481, "text": "Thank you for your kind review Victor! We strive hard to be 100%🔥 for our customers!"}, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "116992222846126783521", "name": "erc royals", "time": 1595431829872, "rating": 2.0, "text": "I have been to 2 other rolled ice cream places and this was bad.  After we ate the ice cream we had a faty oil residue all over the inside of our mouth it was gross.  The workers were very nice.  However they need to wash the curtain to the back room it was very dirty looking.\n\nUpdated response to ice queen response:\n\nIf you use fresh then you wouldn't have pulled out a container of already crushed up oreos. The other places I've been to places 2 whole oreos on the frozen plate and then pours chocolate or vanilla milk.  Not chocolate syrup!", "pics": null, "resp": {"time": 1595369820063, "text": "Hello, we are sorry you had a negative experience! Thank you for your feedback! We have corrected the issues highlighted. The fatty residue is because we use fresh cream, milk and Sugar in our icecream base so it gives that rich homemade flavor, please come back and give us a try and we can make it right for you!"}, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "113768145369375631478", "name": "Stephani Alsop", "time": 1592171121733, "rating": 5.0, "text": "Extremely delicious ice cream 😍 SUPER friendly staff! Love this place", "pics": null, "resp": {"time": 1592184945200, "text": "Thank You Stephani! We are so glad you enjoyed your first time! We can’t wait to see you again and share our love for good food and icecream with you!"}, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "112641009860475790719", "name": "Hunter Mitchell", "time": 1599613141899, "rating": 4.0, "text": "Ice cream was good. They should livin the place up a bit though", "pics": null, "resp": {"time": 1606713793101, "text": "Thank You for your kind review Hunter! Yes we are in the process of renovating the space! We just had a couple of setbacks due to Covid."}, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "116911940186991496738", "name": "Jennifer Riedel", "time": 1566542442737, "rating": 5.0, "text": "My first visit under the new ownership and the associate was very sweet and professional. There was an issue with my 15% off coupon and she still honored it! I purchased the s'mores ice cream and my father purchased the mango green tea. She was very quick and courteous. The establishment was clean, very nice music playing, and the vibe was chill.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "107764812479333053979", "name": "cupcake toturial", "time": 1598477775306, "rating": 2.0, "text": "I did not like my drink, and it expensive !", "pics": null, "resp": {"time": 1606713669023, "text": "We are sorry for your experience Cupcake! Come back and see us to give us a chance to make it right! Please ask for the manager when you come in!"}, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "116641912092953777762", "name": "James Galbraith", "time": 1593382832495, "rating": 2.0, "text": "Good product, but extremely long wait time after placing order", "pics": null, "resp": {"time": 1593404487723, "text": "Hello James, we are extremely sorry that you had to wait a long time after placing your order, we always prioritize our service speed and are extremely sorry that we weren’t able to deliver on it, after speaking with the team it was brought to our attention that we were short staffed due to two employees calling out and that contributed to a long wait time when you visited, the staff shortage was resolved soon thereafter when other employees were called in. Please do come back and give us a try again and please accept this coupon for a free order of rolled icecream on us. Just show this response and your ID to the manager or shift leader and we will take care of you! See you soon!"}, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "106718964744801202997", "name": "Carliese Inman", "time": 1527364069747, "rating": 5.0, "text": "Very good ice cream and friendly staff. Will be returning.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPxl5drNOFv4GzkPaXUq6-jVGpvnQCPT75lM2tg=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "102361578977376463404", "name": "Emily B", "time": 1574824262598, "rating": 5.0, "text": "The ice cream is so fun to watch being made. It looks pretty and tastes pretty good too. The kids loooooove going to get ice cream at the Ice Queen. We go often.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "114416391721286343578", "name": "Brittany Bailey", "time": 1555857180888, "rating": 5.0, "text": "I went with my parents last week. They provided awesome service, and were very willing to answer a million questions. The ice cream is made right in front of your eyes from a fresh custard mix! It's a lot like having sushi made in front of you. They add the flavorings and the chopped up candy/fruit/etc right there as they freeze and form the liquid ice cream on a frozen surface. (See my video) They also make a nitrogen frozen ice cream on the spot too. I didn't try that, but there were lots of kids around who really seemed you be enjoying it. Highly recommended. Great for sharing, since you get several rolls. Toppings are included with no extra charge.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "103051952833047269408", "name": "SIMPLYBABY G", "time": 1552086541702, "rating": 5.0, "text": "It was delicious made my own strawberry ice cream, toppings: strawberries, pecans, and cupcake bites (balls) and a strawberry sauce 😍💖", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOMBgtPVfsd7XgP8ZtXKPslnRRtvLux5y9dF59X=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "100788064659446329749", "name": "Fredek Leiningen", "time": 1572239010162, "rating": 5.0, "text": "Great food. Great prices. My buddy got this fajita dish that was ridiculous. Full of shrimp and steak that came out sizzling. Atmosphere was ok. Not much ambiance. That said the food... Wow. Close to Elgin CC too!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "106895763905753097710", "name": "Chloe Nam", "time": 1574568685974, "rating": 5.0, "text": "This was first time been there and it was so different...and taste was good...♥", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOOosXuuOpiwPsKd-lxquLgS-_rbZFf94FPgfvV=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "116007127879162396841", "name": "Breanna Garza", "time": 1549868158722, "rating": 1.0, "text": "I don’t know why Royal Cafe closed down, but I sure wish it hadn’t. It was my favorite place in Columbus to go for ice cream! Went into Ice Queen shortly after they opened....I didn’t even get anything because they changed the menu up SO much!! Now everything that was good is gone. R.I.P. Royal Cafe", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "113925209021669576159", "name": "Johnny Adams", "time": 1561214572900, "rating": 5.0, "text": "Took my daughter to go try this place and wow were we surprised.\nAmazing ice cream. I will definitely be back.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "103448300519317676475", "name": "Hispoet Johnson", "time": 1576020523358, "rating": 4.0, "text": "The service was great the process is so cool the tapioca was ohhh so sweet but mercy so was the ice cream lol I think I got the wrong flavor. I love taro because its not so sweet but that one tasted like a sugar shack! Lol but I tell you it's the absolute creamiest ice cream I've ever had! Great place", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "109806525120861888401", "name": "J", "time": 1556928765025, "rating": 5.0, "text": "This place is really great. Simple formula, but they make the ice creams so well. Staff was very nice as well. We are def coming again.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "112842882564058717556", "name": "Jahmali Samuel", "time": 1529374102800, "rating": 4.0, "text": "This was my first visit, went with the family.  We had the rolled ice cream.  It was very good! Lots of flavor combinations to choose from. It's prepared right in front of you, fun to watch.  Definitely will be returning in the near future.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "109265075781494353961", "name": "Mercedes Ryles", "time": 1622523526598, "rating": 3.0, "text": "Her food is really good the ice cream is good. I've had alot of my order wrong due to language barrier. I honestly think the shop would have more business if she worked on that too. The chicken teriyaki with fried rice and vegetables is a hit...her chicken philly's are great too..", "pics": null, "resp": {"time": 1603513453967, "text": "Hello Mercedes, we believe this review was meant for the previous owner, we do not serve the dishes you mention in your review, we have completely overhauled our menu after taking over in March 2020, we welcome you to give us a try and check out our new menu! We sure hope we can earn a five star rating from you! See you soon!"}, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "103448300519317676475", "name": "Hispoet Johnson", "time": 1576020523358, "rating": 4.0, "text": "The service was great the process is so cool the tapioca was ohhh so sweet but mercy so was the ice cream lol I think I got the wrong flavor. I love taro because its not so sweet but that one tasted like a sugar shack! Lol but I tell you it's the absolute creamiest ice cream I've ever had! Great place", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "112842882564058717556", "name": "Jahmali Samuel", "time": 1529374102800, "rating": 4.0, "text": "This was my first visit, went with the family.  We had the rolled ice cream.  It was very good! Lots of flavor combinations to choose from. It's prepared right in front of you, fun to watch.  Definitely will be returning in the near future.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "109806525120861888401", "name": "J", "time": 1556928765025, "rating": 5.0, "text": "This place is really great. Simple formula, but they make the ice creams so well. Staff was very nice as well. We are def coming again.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "109265075781494353961", "name": "Mercedes Ryles", "time": 1622523526598, "rating": 3.0, "text": "Her food is really good the ice cream is good. I've had alot of my order wrong due to language barrier. I honestly think the shop would have more business if she worked on that too. The chicken teriyaki with fried rice and vegetables is a hit...her chicken philly's are great too..", "pics": null, "resp": {"time": 1603513453967, "text": "Hello Mercedes, we believe this review was meant for the previous owner, we do not serve the dishes you mention in your review, we have completely overhauled our menu after taking over in March 2020, we welcome you to give us a try and check out our new menu! We sure hope we can earn a five star rating from you! See you soon!"}, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "103921191460420011214", "name": "Atif Iqbal", "time": 1525570298407, "rating": 5.0, "text": "Amazing ice cream. Had this type in California long ago but the flavor here was amazing. Ambience was great. They have a patio that’s so relaxing . I will be there again . Try their Thai tea .\n\nI had all this after their Italian Philly for lunch .", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "107664043842731352285", "name": "pam saltsman", "time": 1570930097898, "rating": 5.0, "text": "Best experience I have ever had with ice cream. Wish there was a place like this in Indiana!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "103637808565782235082", "name": "Raudell M", "time": 1570998706064, "rating": 5.0, "text": "Great taste good quick service also you can watch them make your 🍦 icecream its cool", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "114721261350742202515", "name": "Tianna Storey", "time": 1516120137345, "rating": 5.0, "text": "I always saw places like this on YouTube and always wanted to go and now there's this place in Columbus that does the rolled ice cream is amazing. I'm going to have a task where I try every single kind and combination that they serve. Everything from green tea,mango and coffee.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "101666788264825523271", "name": "Lacy Harden", "time": 1529781199222, "rating": 2.0, "text": "This place has an identity crisis . It's called a cafe and deli but it's actually an ice cream shop . We had no idea until we arrived. The other customers seemed to be enjoying the ice cream but can you really screw up ice cream? The deli part is about 10 items mostly variations of a cheese steak. I asked about the ingredients and the guy obviously didn't know and as another employee walked up, he simply walked off without answering. I asked her the same question and she didn't know either. I mean seriously?!? Overall the service was completely lacking! Obviously no training had been performed. With all that said, the food was actually great once it arrived. I had to go back to ask for ketchup and they had forgotten the coffee purchased. The place also lacked any cleanliness standards for an eatery and there was no place to store the tray from the food.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "112127419764510550190", "name": "Crystal Ramsey", "time": 1584215336720, "rating": 5.0, "text": "My kids nice new ice cream spot", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "101468722967187157302", "name": "Jamie Gregory", "time": 1561351268581, "rating": 5.0, "text": "Excellent ice cream rolls and good customer service.  We will definitely be returning", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "115135117668102381325", "name": "Sumgirluknow", "time": 1539055868863, "rating": 5.0, "text": "Yummy ice cream and food! I got the green tea rolled ice cream & loved it! Their chicken sandwiches are simple yet tasty as well.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "107539115282492418876", "name": "Trish D", "time": 1540935126501, "rating": 5.0, "text": "It's fun to watch them roll the ice cream on the slab. Their fries are good, too. Tuesday is military discount day!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "108243108807829008424", "name": "brianna guidry", "time": 1553909220459, "rating": 5.0, "text": "Fantastic place. Love the ice cream and the show they let us watch them make the ice cream.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "106536864539342639502", "name": "Moises", "time": 1530935094178, "rating": 5.0, "text": "This young boy that wear glasses did an amazing job! OUTSTANDING ICE CREAM!!!! That young boy was so kind. I think his name was Maximus? But if that’s not it he wears a cap and glasses he’s a good worker!! So kind!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "108340163994101798367", "name": "Kim “KW” Williams", "time": 1547289518017, "rating": 1.0, "text": "Daughter received a gift card from Royal in September, 2018 for her birthday. Tried to use it today, January, 2019 and was told they could not accept it because of the company name change 😠. Made my daughter cry and wasted my friend\"s money. So now that's $10 free in their pocket. Very bad business practice in my opinion. Didn't even try to work with us or apologize.  Do not buy any gift cards from this place. They def will not receive my business.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "104183718341336143275", "name": "simply chaynee", "time": 1563984721535, "rating": 5.0, "text": "Good ice cream and not that bad when it comes to price.good service", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "117018320407696024425", "name": "Alrendria Blaze", "time": 1579143135013, "rating": 5.0, "text": "Very good, love the rolled ice cream and good service", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "112028605250662399315", "name": "Terran Nichols", "time": 1554661502693, "rating": 5.0, "text": "Absolutely amazing!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO39-N6CFps5qh5_r9v1kyOQycFjoskYXdMkb-h=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMbSP51zEKxZfIi9Xxa9k5wEjEr7iSXxEZFlEsL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNg8ehPKEyCcJBVJvZdU1DLL7YsHDbochBOdhIp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNALpU4hgM8sbjkmHdNnmqoaS81rXPWcCf3yIj8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPX24MT01QVYEkiiEjOryKkPxCiIcm34-e1AZ-t=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "110649493861921631776", "name": "Sabrenia West", "time": 1573828800107, "rating": 5.0, "text": "My first time but definitely not my last!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "117018320407696024425", "name": "Alrendria Blaze", "time": 1579143135013, "rating": 5.0, "text": "Very good, love the rolled ice cream and good service", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "104183718341336143275", "name": "simply chaynee", "time": 1563984721535, "rating": 5.0, "text": "Good ice cream and not that bad when it comes to price.good service", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "103620330267698115348", "name": "Jed Mangal", "time": 1570589561943, "rating": 5.0, "text": "Enjoyable bubble tea,  excited to try rolled ice cream", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "110649493861921631776", "name": "Sabrenia West", "time": 1573828800107, "rating": 5.0, "text": "My first time but definitely not my last!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "105571723176098476989", "name": "Daniel Hall, Jr.", "time": 1560602120399, "rating": 5.0, "text": "Now this was really great. They make your icecream while you're looking. Wow", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "100406359912037502586", "name": "Daron Allen", "time": 1546976802126, "rating": 4.0, "text": "If you want to try something new and fun, this is it. Good first date place.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "105290242693144764911", "name": "Ryan Janeway", "time": 1549736445606, "rating": 1.0, "text": "Needs serious decor work. They should've finished decorating and rounding out those rough edges before opening.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "109603881449716644797", "name": "Codie Bell", "time": 1516031223003, "rating": 4.0, "text": "Overall great customer service; it only takes a few minutes to be served after completion of ordering from the menu. The staff is very polite and knowledgeable with any questions you may have on their menu.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "115400113775509953643", "name": "Lynette Teall", "time": 1522335574236, "rating": 5.0, "text": "First time trying rolled ice cream and I loved it. I mean it’s hard to get ice cream wrong. Takes a while especially if there’s already a line but worth the wait.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "100751352663254535373", "name": "Ashley Dailey", "time": 1560566677501, "rating": 3.0, "text": "The first time I tried Ice Queen was in Lagrange,GA and let me say it was amazing. Being a lover of bubble tea and working for a bubble tea store at one point I was so excited to learn that there was an Ice Queen in Columbus,GA as well! I’ve been there multiple times and while the tea/tapioca pearls are a hit or miss I still go because I like that they don’t use powdered Thai tea, to my knowledge anyways. I also enjoy one girl who seems to always work there and is very friendly and nice( I don’t know her name but she is short and always has hoop earings). I recently went there with my friend (a HOUR and about ten minutes before they closed) and ordered our typical drinks with the tapioca pearls and was told that they didn’t have any. Disappointed because that is one of the biggest reasons for a BUBBLE tea, they did offer strawberry and mango popping boba (which aren’t our favorites due to it being a Thai tea and my friend doesn’t enjoy them at all) and I nicely told them never mind. The girl that was working gave me a really rude/nasty look that almost makes me not want to come back because of it.( this same girl has helped me my first time coming to this location and her friend was behind me and she was very, VERY distracted by that). Besides those things most of my visits here have been pleasant.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "115400113775509953643", "name": "Lynette Teall", "time": 1522335574236, "rating": 5.0, "text": "First time trying rolled ice cream and I loved it. I mean it’s hard to get ice cream wrong. Takes a while especially if there’s already a line but worth the wait.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "117860615208290960353", "name": "Steven Miller", "time": 1553400575301, "rating": 3.0, "text": "I got a fruit slush and it was extremely sweet I ended up throwing in out", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "109603881449716644797", "name": "Codie Bell", "time": 1516031223003, "rating": 4.0, "text": "Overall great customer service; it only takes a few minutes to be served after completion of ordering from the menu. The staff is very polite and knowledgeable with any questions you may have on their menu.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "100406359912037502586", "name": "Daron Allen", "time": 1546976802126, "rating": 4.0, "text": "If you want to try something new and fun, this is it. Good first date place.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "112026572417675865568", "name": "Catherine Stanton-Schmoll", "time": 1531366659225, "rating": 5.0, "text": "The ice cream was really good.  Staff nice.  Never had rolled ice cream until today and it was a real treat.  Will be going there again.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "111916898330984994053", "name": "jeanne Adam", "time": 1529365801709, "rating": 2.0, "text": "We Arrived at 11:30 and placed our order. The last two people were served at 1:00 there were 16 of us.  They gave out of French fries after about 6 of of our orders and we were served chips.  There was no ice for the drinks,  we saw several to go orders leave before we were served. The buns were cold.  The servers were nice but not efficient.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "106168823097959325125", "name": "Mike Harmon", "time": 1582598473152, "rating": 1.0, "text": "What a joke this place is... don't think it will last to much longer", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "112258230245845360946", "name": "JEREMY Baxley", "time": 1585682735437, "rating": 4.0, "text": "Really good froyo.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "112550691006582222148", "name": "Desiree Spezialy", "time": 1544580902555, "rating": 5.0, "text": "Great fries and Philly, love the Italian! Drinks were nice and I love how they lid them!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "111213718876619176445", "name": "Cari Best", "time": 1553991134366, "rating": 5.0, "text": "Delicious ice cream roll ups!  The only thing I would change would be for them to advertise outside and inside on the walls that roll up ice cream is what they do/serve!  We had no idea that’s what it was bc there aren’t any pictures of it anywhere to see and the dominant menu on the wall is for slushes and milk slushes - it doesn’t say “create your own ice cream ROLL UPS” which would make a huge difference bc it’s super fun to watch and delicious to eat. Can’t wait to come back.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "108076670785983370389", "name": "Marco Polo", "time": 1548110400294, "rating": 5.0, "text": "Decided to try out the place, and I did enjoy the ice cream and the way that it was prepared. The only minor complaint I have is that the menus could use a little bit more detail, but overall five stars from me", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "104062718884829961422", "name": "C.C.", "time": 1534093367406, "rating": 1.0, "text": "Placed first order through waitr..OMG..new york hotdog?..How dare you even use the name. And it was suppose to come with fries..didnt happen. The spicy subs were so so..i guess its the ice cream..not the food.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "115116750584304000664", "name": "Robin Hobbs", "time": 1514501403304, "rating": 5.0, "text": "Really enjoyable experience. The ice cream was really good. I also really enjoyed watching them create the rolled icecream", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "109830104215006567428", "name": "Adeel Chaudhry", "time": 1515536055572, "rating": 5.0, "text": "Was back in Columbus for the weekend, asked a random local for a recommendation for a good place to get some desserts . Was told about you guys and the unique way you serve ice cream .Had to suppress my guffaw because i had already been to your place during my last visit , and enjoyed my experience !\nKeep it up guys , you are getting famous !\n😊🤘👍", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "117271933630935990418", "name": "Ashley Burkett", "time": 1523824128583, "rating": 4.0, "text": "The ice cream was really good. Would of liked to had interaction w the staff they had their own convo. Between one another. Took awhile for the wait. Overall good ice cream", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "112097559539018183533", "name": "Maximus Raniero", "time": 1533234913236, "rating": 5.0, "text": "I tried the original and the Italian Phillies, and they were so good! The customer service was excellent and it was very clean!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "117974718931102955288", "name": "Abdul Basit", "time": 1532768786919, "rating": 5.0, "text": "Unbelievable food . This is a place which caters to everyone . Recommend  the Philly meat on a platter you have to ask for it they will give it on bed of seasoned fries .  Ice cream is out of this world .They roll it and my cousons enjoyed it . Excellent customer service .", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "108596734143170171619", "name": "Gua Pa", "time": 1527203017458, "rating": 5.0, "text": "Customer service here is A+. We've found a new place for great ice cream 🙂🍦🍧🍨.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "117001511674605368217", "name": "Victoria Rosado-Cohen", "time": 1529180880404, "rating": 3.0, "text": "The ice cream was decent but I expected more for what it was worth. It kinda had a frost bite taste which makes sense considering they rapidly freeze it. Glad I tried it though!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "103424819783567888152", "name": "Carla Alvarez", "time": 1530990206779, "rating": 1.0, "text": "It's the little things...\nI just left this place with my ice cream, wich I was really looking forward to since everyone has had nothing but good things to say about. The service was nice and quick and the ice cream tasted really good, HOWEVER, as I separated the rolls I noticed the one thing that will make me not want to come back (and the reason for the one star, A HAIR.\nThis is DISGUSTING!!!\nThe young man that was doing my ice cream was wearing a cap and wearing gloves, and his hair was blonde not black. Clearly it wasn't his hair. It makes me wonder what else you could find.\nIt sucks, because this really ruined it for me.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "105803034591752871362", "name": "Chami Storey", "time": 1536949783417, "rating": 5.0, "text": "Great phillys, yummy rolled ice cream, and great bubble tea. Nice staff and always a great atmosphere.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "104501987796921596586", "name": "Rave HZ", "time": 1538281586774, "rating": 2.0, "text": "My fiance and I ordered through waitr as we had never tried this place before and wanted to see if it was good due to the reviews. Well I ordered an Italian sub sandwich and it was really greasy and it looked smaller than the picture on Waitr. The fries....they were okay but they were soggy and not at all crispy. It tasted like someone cooked them and then figured it wasn't worth the extra 5 minutes and said it was done. The grilled cheese wasn't even brown and the chicken was a little dry but I think that's Waitrs fault since I'm sure it was juicier when made. The only good thing honestly was the ice cream. I'm just really concerned about the quality of the food and dont know if I'll ever order from Waitr again.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "117271902604684921363", "name": "Rizwan Khan", "time": 1515901952688, "rating": 5.0, "text": "Great place for the whole family! Awesome ice cream and good ambience . Highly recommended", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "111448910041234678346", "name": "DeBron", "time": 1551912630918, "rating": 5.0, "text": "Delicious, fast service. Watching the ice cream be made was a treat itself.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "113090656392218357572", "name": "stephen coates", "time": 1537364490522, "rating": 5.0, "text": "\"Cool\" twist on build your own ice cream sundae.  Rolled icecream!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "103562859963531285644", "name": "Lavanya Vuligonda", "time": 1535405462460, "rating": 2.0, "text": "I am a person who really enjoys bubble tea/smoothie specially me being from cali. I am a regular customer, Icecream here is really good but i have to give a 2 due to service, i always ask for extra tapioca for smoothie and i am ready to pay few extra bucks. I dont understand why they do this all the time they dont put extra tapioca specially few staff people in the evenings. I am really disappointed as today even though the guy keeps on telling the other girl to put extra tapioca she did not. I wish there is other bubble tea place in columbus.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "115965435242824701536", "name": "CJ", "time": 1526524911715, "rating": 5.0, "text": "Great place to go locally and sit back and enjoy your family and friends with a cool treat!\nSo many options to choose from and the service was excellent!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "100425167943971456278", "name": "salman shehryar", "time": 1517575367003, "rating": 5.0, "text": "Wonderful place. Nice atmosphere. I really enjoyed my time there with family.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "118426895004479276181", "name": "Raina Alexis", "time": 1561936971421, "rating": 4.0, "text": "I've never had rolled ice cream before it was a good experience.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "107948939714221834506", "name": "Shelia McIntyre", "time": 1532959255840, "rating": 3.0, "text": "My son really wanted to experience the rolled ice cream so I took him here and he enjoyed it but it was a bit pricey and the staff could have been a little more engaged with the customers. Other than the price and customer service it was ok.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "106419856711556199072", "name": "F32 STEVEN", "time": 1538600962745, "rating": 1.0, "text": "Ordered a Thai tea and it comes out as thick tea. The Bubble tea isn’t good here.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "111016762759172105708", "name": "Adele D'Eon", "time": 1518479349032, "rating": 5.0, "text": "Tasty ice cream for a reasonable price. Hot tip: Green tea ice cream goes really well with nutella mixed in!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "105480935893638622804", "name": "Flint Meycall", "time": 1515900577043, "rating": 5.0, "text": "Unbeleavle ice cream very fresh not like marblestone or dairy queen . Will come back regularly.  Thanks", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "111806691057735368609", "name": "Lauren Gray Baby", "time": 1558570572004, "rating": 5.0, "text": "They had mango ice cream and that's really all that matters to me. 🤣", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "116958605680141324313", "name": "Ashfaque Malek", "time": 1542684226636, "rating": 5.0, "text": "Great place for roll-up ice cream..!!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "104576986167848607971", "name": "JMSA460", "time": 1521325739017, "rating": 4.0, "text": "Wait time is super long.\n\nNot that clean when handling food. They have tonsils to get the oreos out of the jars but they use their hands with gloves on.\n\nNote: just because you have gloves on doesnt mean your gloves arent clean.\n\nI saw the same individual open the door to outside several times also handle food improperly.\n\nMikalea did check on us and asked us how long we have been waiting; thank you, ma'am.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "117817538991699274255", "name": "Lisa Santa", "time": 1555716911762, "rating": 5.0, "text": "Good service awesome icecream..", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "115832102588110580540", "name": "Jacee", "time": 1534005071917, "rating": 5.0, "text": "Kind people, always ready to help, answering any questions and of the employee can not answer they quickly find or call some one who can.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPE8moUwbYML1qQrgExehOHuk41fY3OwR_HXIWI=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "102329647413360642246", "name": "Quinn Bent", "time": 1561145245213, "rating": 5.0, "text": "Just go...super yummy", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "105491425980867479924", "name": "Andrea Brown", "time": 1516057120095, "rating": 1.0, "text": "It wasn't sweet enough for me. Also they are slim on the toppings for it to cost almost 7.00", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "105646265009940703109", "name": "CrazyTown On The Spectrum", "time": 1537661383027, "rating": 5.0, "text": "Fun place! Great ice cream", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "101060250007927430394", "name": "Thomas Cook", "time": 1525272092617, "rating": 5.0, "text": "Really cool to see the rolled ice cream and taste great as well", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "111614260784473553466", "name": "Shalon Chester", "time": 1523500632758, "rating": 5.0, "text": "Delicious homemade rolled ice cream and nice spot to enjoy with the family", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "115307029676542675566", "name": "Milton Watts", "time": 1547510423347, "rating": 5.0, "text": "Great place to get an ice cream!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "113471376701014570078", "name": "Raymond Nichols", "time": 1583720371000, "rating": 5.0, "text": "Soooo good", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "117410703807037833209", "name": "Abby Miley", "time": 1520293173406, "rating": 5.0, "text": "This place was delicious I loved the rolled icecream 🍦 and I totally RECOMMEND !!!! 💖", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "111997421288438674592", "name": "donald williams", "time": 1520475306245, "rating": 5.0, "text": "Great place to eat. Love their Philly .", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "112090960427093320954", "name": "Scherita Unique", "time": 1563829313181, "rating": 1.0, "text": "My icecream tasted terrible.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "102296770768967839194", "name": "Mohammad Imtiaz", "time": 1519519641287, "rating": 5.0, "text": "Great food and concept . Enjoyed their Philly sandwich as well.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "117356858301303253882", "name": "Mandy Tarvin", "time": 1521940328470, "rating": 5.0, "text": "Great customer service, fresh toppings and an experience you have to try!!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "102559937417122180067", "name": "Mohammed Piracha", "time": 1536610505145, "rating": 5.0, "text": "Hi AWOSOM service and excellent food.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "106733757841169346158", "name": "Philbert Witherspoon", "time": 1597879777281, "rating": 5.0, "text": "Great Ice Cream", "pics": null, "resp": {"time": 1606713609902, "text": "Thank You for your kind review Philbert!"}, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "113615667642042361409", "name": "Gregory Cotto", "time": 1540083822808, "rating": 5.0, "text": "Came in for a Philly recently and it was awesome!! Will be back!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "101876240349471786287", "name": "Angela Moss", "time": 1532632060587, "rating": 5.0, "text": "Staff is quick and make great rolled icecream!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "107332726472971687544", "name": "James Stacy Vann", "time": 1515356883787, "rating": 5.0, "text": "Very good ice cream rolls, excellent staff, cool atmosphere.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "111139855141013319144", "name": "Willie Oglesby", "time": 1528070001621, "rating": 5.0, "text": "Great people, great service, and great ice cream!!! Will definitely be back!!!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "116604561526744136778", "name": "Faiza Uzair", "time": 1554767825893, "rating": 5.0, "text": "Best bubble teas in town", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "107003719793091209163", "name": "Callie W", "time": 1536862855308, "rating": 5.0, "text": "Fun place, good food, and great service! :)", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "111346841573629107111", "name": "April Smithwick", "time": 1546120676898, "rating": 4.0, "text": "The ice cream was delicious.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "108589388234414853692", "name": "Zack Saleem", "time": 1518375093156, "rating": 5.0, "text": "Better than any other ice cream I have ever had .", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "114135958361881932308", "name": "Mike Davenport", "time": 1522696261085, "rating": 2.0, "text": "Not impressed. The ice cream was bland and hardly with the wait.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "116632868384172810370", "name": "Amiri Sonie", "time": 1529105073424, "rating": 5.0, "text": "Ice cream was delicious!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMvqMrIkYbo68IJuRhXb-fdISeUt6isJnoM50Ef=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "116385724701275795176", "name": "xavier williams", "time": 1566331197677, "rating": 5.0, "text": "Great Ice Cream", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "111184716914645036397", "name": "Jynean Wolf", "time": 1557592980273, "rating": 5.0, "text": "Best ice cream around", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "104919712042567750419", "name": "Leslie Lanning", "time": 1559936901684, "rating": 5.0, "text": "Fun to watch, and delicious!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "109188246733502046470", "name": "Kathy Storey", "time": 1539650830256, "rating": 5.0, "text": "Delicious rolled ice cream!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "108155237841432174902", "name": "Mark Snider", "time": 1535221601202, "rating": 1.0, "text": "Had to get a refund because they didn't have enough people to fix our order.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "109973025383634705295", "name": "Ehsan Iqbal", "time": 1515899424819, "rating": 5.0, "text": "Delicious ice cream . Great wings as well .", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "104920296625385281435", "name": "Jonathan Offthat", "time": 1553304634656, "rating": 5.0, "text": "Nothing bad here", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "105463577123260675315", "name": "Stephanie S", "time": 1542293426530, "rating": 3.0, "text": "Staff is kind product not enough flavor and it cost way too much for that little bitty old Bowl", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "116160206742316395783", "name": "Tremaine Winston", "time": 1538765169687, "rating": 5.0, "text": "Great atmosphere and attitude.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "105319879471573732306", "name": "Against Odds", "time": 1545682635996, "rating": 5.0, "text": "So amazing", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "103738787586797778492", "name": "Linda Miller", "time": 1527105130285, "rating": 5.0, "text": "My grandchildren love it", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "103411542883349635239", "name": "Mike Jones", "time": 1583192134422, "rating": 5.0, "text": "Great experience", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "110980102857918208891", "name": "NADEEM CHAUDHRY", "time": 1515900335748, "rating": 5.0, "text": "Amazing ice cream rich flavor ...", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "116458565883025239751", "name": "Shay Norman", "time": 1538432260468, "rating": 4.0, "text": "Delicious rolled ice cream!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "111465958254815156556", "name": "Jason Buice", "time": 1517523315587, "rating": 5.0, "text": "Great rolled ice-cream", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "105980870170656547810", "name": "Mateo Castillo", "time": 1583546323673, "rating": 5.0, "text": "Quick and yummy", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "103213640558605442375", "name": "Sohaib Lodhi", "time": 1581453423616, "rating": 1.0, "text": "Worst service", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "104036867922452543684", "name": "ReJeana Ugh", "time": 1543192780817, "rating": 5.0, "text": "Yummy ice cream rolls", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "110363966539297154147", "name": "Nene Anderson", "time": 1559961086232, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "106106204440137981052", "name": "Jacob Brown", "time": 1547258475790, "rating": 4.0, "text": "Delicious", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "103470783580101278945", "name": "TheRealGeoDash (Travis Silva)", "time": 1553991508389, "rating": 5.0, "text": "Amazing", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "101789127329015910349", "name": "Brittany Prophet", "time": 1524439439307, "rating": 5.0, "text": "Super good!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "109705091819800169542", "name": "Dee Dee Smith", "time": 1522511638670, "rating": 5.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "118258458297461123866", "name": "Brittni Shuttleworth", "time": 1536170002490, "rating": 5.0, "text": "So good", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "103715899566385893437", "name": "Zuhair Hasan", "time": 1517765116391, "rating": 5.0, "text": "Great place, amazing dessert", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "113133993157798626846", "name": "Amal Jan", "time": 1517695412094, "rating": 5.0, "text": "Great ice cream!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "112365381355436859122", "name": "SHERMAN SCOTT", "time": 1524273440823, "rating": 5.0, "text": "Best ice cream love the coffee", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "107266976367081966453", "name": "Wanda Chapman", "time": 1533694513577, "rating": 5.0, "text": "Friendly staff", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "115236849403731139719", "name": "Farrukh Khan", "time": 1514295140397, "rating": 5.0, "text": "Excellent", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "112923248364665697338", "name": "KYLAH’S Cooking show", "time": 1509055789569, "rating": 5.0, "text": "So awesome", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "109971475187482923382", "name": "Avery", "time": 1549679477197, "rating": 5.0, "text": "Best place i have ever been!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "114918212412640521370", "name": "Brittany Adams", "time": 1525919835834, "rating": 2.0, "text": "It was alright nothing special", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "110469441452311374490", "name": "Linda White", "time": 1537141553368, "rating": 3.0, "text": "I'd rather have scooped ice cream.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "105087372655521844161", "name": "DIANNA MOORE", "time": 1523835318214, "rating": 5.0, "text": "This place is great", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "115958981253707860963", "name": "Michelle Carlisle", "time": 1515616311321, "rating": 5.0, "text": "Great icecream, good prices,  and good vibes!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "110898223290692708271", "name": "Tracy Daniel", "time": 1520131176015, "rating": 5.0, "text": "Amazing combinations of rolled ice cream", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "109399368536124272923", "name": "Alae Ayoub", "time": 1608780527844, "rating": 5.0, "text": "(Translated by Google) Very helpful staff and the place quiet and clean.\n\n(Original)\nPersonnel très serviable et l'endroit calme et propre.", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "108927120920994981946", "name": "Elizabeth Torre", "time": 1607943575810, "rating": 3.0, "text": "(Translated by Google) Rich personalized ice creams.\nThe cleanliness of the premises looks a bit sloppy\n\n(Original)\nRicos helados personalizados.\nLa limpieza del local se ve un poco des uidada", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "110406905878151441128", "name": "SaraLynn O", "time": 1552847218254, "rating": 5.0, "text": "(Translated by Google) 10/10! Tasty tea and ice cream: 3\n\nPlus the Barista is cute owo\n\n/ A (((ρ\n(No Y \\\n| (\\ (\\ /) |)\nヽ ヽ ((゚ ∀ ゚) _ ノ /\n\\ | ⌒ Y ≠ / /\n| ヽ | ノ /\n\\ Too yee\n| Mi Ame /\n) \\ ° /\n(\\ / \\\n/ / \\ \\ \\\n/ / / \\ \\ \\\n(().)).)\n() |\n| / \\ |\nnn.). (n nm\n\n(Original)\n10/10! Tasty tea and ice cream :3\n\nPlus the Barista is cute owo\n\n／ イ  　　　(((ヽ\n(　 ﾉ　　　　 ￣Ｙ＼\n|　(＼　(\\      /)   ｜    )\nヽ　ヽ` ( ﾟ∀ﾟ ) _ノ    /\n＼ |　⌒Ｙ⌒　/  /\n｜ヽ　 ｜　 ﾉ ／\n＼トー仝ーイ\n｜ ミ土彡/\n) \\      °   /\n(     \\  /  \\\n/       /  \\ \\    \\\n/  /     /      \\ \\   \\\n( (    ).           ) ).  )\n(      ).            ( |    |\n|    /                \\    |\nnn.  ).               (  nnm", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
{"user_id": "106762679405943970265", "name": "Rosemary Mayo", "time": 1532200369607, "rating": 5.0, "text": "(Translated by Google) Yummo !!\n\n(Original)\nYummo!!", "pics": null, "resp": null, "gmap_id": "0x888ccb4afad7c3f5:0x253abde6b82578a9"}
