{"user_id": "108773033439029077277", "name": "Dsve Haynes", "time": 1548701547096, "rating": 4.0, "text": "Great guy!", "pics": null, "resp": null, "gmap_id": "0x8890babaae1f19a3:0x455d40ece039c071"}
{"user_id": "108733926407787689328", "name": "Sabrina Batchelor", "time": 1504743583988, "rating": 5.0, "text": "Just beautiful 😍💓", "pics": null, "resp": null, "gmap_id": "0x889a05381b0928db:0xcc044456fc2a5430"}
{"user_id": "108575607063031718667", "name": "Jason Morris", "time": 1598940048729, "rating": 5.0, "text": "Good customer service very helpful", "pics": null, "resp": null, "gmap_id": "0x8862838bb27bccfb:0xac40869fc3dc3bb7"}
{"user_id": "105475501484615624258", "name": "GARY Busby", "time": 1530542580523, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x8862838bb27bccfb:0xac40869fc3dc3bb7"}
{"user_id": "109182172152367097400", "name": "JoAnna Cockrell", "time": 1627142874747, "rating": 5.0, "text": "Very professional and responsive. Recommend them over anyone in town.", "pics": null, "resp": null, "gmap_id": "0x8888a96779376c6b:0x733bc8e43ce00780"}
{"user_id": "113165856053702741694", "name": "Byron Bennett", "time": 1614728383895, "rating": 5.0, "text": "Great and fast response to my drain issues. Best in town!", "pics": null, "resp": null, "gmap_id": "0x8888a96779376c6b:0x733bc8e43ce00780"}
{"user_id": "106252513038932732101", "name": "wjmoneyparham", "time": 1614527908375, "rating": 5.0, "text": "Waking up to a sewer pump issue was awful my husband said call Drain Pro and they came out within a few hours found the problem and worked with us  they were very professional, great guys and very knowledgeable. They also were very patient with him paying away from home and the price was great.Thanks for everything Drain Pro.", "pics": null, "resp": null, "gmap_id": "0x8888a96779376c6b:0x733bc8e43ce00780"}
{"user_id": "115388145690955091870", "name": "Harry Knight", "time": 1609198420037, "rating": 5.0, "text": "Great job was done to clear up my sewer line.  Nice people....", "pics": null, "resp": null, "gmap_id": "0x8888a96779376c6b:0x733bc8e43ce00780"}
{"user_id": "117222699020403664848", "name": "Dennis Brown", "time": 1601652634563, "rating": 5.0, "text": "These guys are AWESOME!  We originally hired Roto-Rooter to unclog a washing machine drain.  After 3 hours, the Roto-Rooter tech advised that we hire a camera for $450 to locate the clog, then spend another $2500 to demo the kitchen/hardwood flooring/slab, remove the pipe, unclog the line, and repair the pipe. In addition to those costs, we were looking at potentially thousands more for remodel work after the fact.  For under $100 and in less than 5 minutes, the Drain Pro guys had the water flowing like new.  I couldn't be happier and HIGHLY recommend them.", "pics": null, "resp": null, "gmap_id": "0x8888a96779376c6b:0x733bc8e43ce00780"}
{"user_id": "102733043659927519586", "name": "Tori Gleason", "time": 1603919163944, "rating": 5.0, "text": "These guys are amazing! They sleuthed out my problem...which was abnormal piping, and then thy fixed the drain clog. And they did not charge any extra for all that labor!", "pics": null, "resp": null, "gmap_id": "0x8888a96779376c6b:0x733bc8e43ce00780"}
{"user_id": "108129948554005095541", "name": "Sheila Walton", "time": 1561421405871, "rating": 5.0, "text": "These people are awesome. My plumbing problem happened over the weekend. After we did all that we could, a friend highly recommended Drain Pro. They came as promised and immediately started working on our problem. They had us fixed in less than 30-minutes and the charges were very reasonable. I like how professional they are. They answered all of our questions; and, they were diligent in working to fix the issue. I will definitely will use them again if need. We highly recommend them to our friends, family and community.   Drain Pro Sewer Service is a keeper.", "pics": null, "resp": null, "gmap_id": "0x8888a96779376c6b:0x733bc8e43ce00780"}
{"user_id": "108250525989309636291", "name": "James Crocker", "time": 1593551878259, "rating": 5.0, "text": "do a great job", "pics": null, "resp": null, "gmap_id": "0x8888a96779376c6b:0x733bc8e43ce00780"}
{"user_id": "108160028154489588917", "name": "Paigehudson Wilson", "time": 1605406170414, "rating": 5.0, "text": "U should really try them they r great! Excellent customer care and awesome work!@", "pics": null, "resp": null, "gmap_id": "0x88920fe6e0cc8e33:0xecd4004838618e8a"}
{"user_id": "104919303083111766847", "name": "Will Gray", "time": 1602991895878, "rating": 5.0, "text": "Will work on whatever", "pics": null, "resp": null, "gmap_id": "0x88920fe6e0cc8e33:0xecd4004838618e8a"}
{"user_id": "108051337680668230077", "name": "Elysia Bailey", "time": 1528823385632, "rating": 5.0, "text": "Great place. Friendly people. Love hopping here.", "pics": null, "resp": null, "gmap_id": "0x888957a51a0140d9:0x861284b2950a06f0"}
{"user_id": "115529957321885282850", "name": "Michael Bullock", "time": 1544142252236, "rating": 4.0, "text": "Found everything I needed", "pics": null, "resp": null, "gmap_id": "0x888957a51a0140d9:0x861284b2950a06f0"}
{"user_id": "102476520551396229379", "name": "Lynn Pottratz", "time": 1628698411208, "rating": 5.0, "text": "He did a good job for me. He was easy to contact and let me know when he would do the job and stuck to his word.", "pics": null, "resp": {"time": 1628699626654, "text": "Thanks ! Glad we was the business you chosen! We as a business try to meet requirements and request from our customers to make sure the job is done the right way and low prices to make customer happy! Hope to do business again soon!\nThanks! Small Time Repairs…."}, "gmap_id": "0x886285407746b809:0x92577001dc9ebaaf"}
{"user_id": "115326355108151220251", "name": "Amanda Hardy", "time": 1623561637790, "rating": 5.0, "text": "Did a great job got it done quickly and even did extra with no charge thanks I’ll always be sure to call this small business..", "pics": null, "resp": null, "gmap_id": "0x886285407746b809:0x92577001dc9ebaaf"}
{"user_id": "111463541139459886703", "name": "Megan", "time": 1625409880959, "rating": 5.0, "text": "They did a great job & my yard looks great", "pics": null, "resp": {"time": 1625671064403, "text": "Thanks glad we could make another customer happy! If you need anything else feel free to call!"}, "gmap_id": "0x886285407746b809:0x92577001dc9ebaaf"}
{"user_id": "118167002983890484543", "name": "Jon Freund", "time": 1606059985315, "rating": 5.0, "text": "They did great work building me a deck. I had them do some painting in a couple of rooms as well and they did fantastic work. They are reasonably priced and very professional. I will continue to use them and highly recommend M & J Handymen.", "pics": null, "resp": null, "gmap_id": "0x888a33d5c316823d:0x82f9339efe7f848a"}
{"user_id": "115237380820691648216", "name": "Pam Lembke", "time": 1604764172337, "rating": 5.0, "text": "Jay and Mike were great. They were very professional and did excellent work. Their prices are reasonable and a good value for the quality of work they do. They always make sure we are happy with everything before they leave. I  have used them for painting, home repairs, and they built me a deck.I highly recommend them.", "pics": null, "resp": {"time": 1604765546374, "text": "Thank you for the review it's always a pleasure doing business with you and your family. Hope all is well in these trying times. Stay safe!"}, "gmap_id": "0x888a33d5c316823d:0x82f9339efe7f848a"}
{"user_id": "114916971807718111803", "name": "Cadence Dart", "time": 1606060649373, "rating": 5.0, "text": "Jay and Mike Built me a 20x20 deck and did an excellent job. They are very informative and helpful to all questions and concerns. They really put you at ease. They are about mid range on pricing but give you high end quality. They dont leave until they make sure you are happy with their work. I definitely recommend they for any of your projects.", "pics": null, "resp": null, "gmap_id": "0x888a33d5c316823d:0x82f9339efe7f848a"}
{"user_id": "107362696215759284419", "name": "Curtis Lewis", "time": 1604742237108, "rating": 1.0, "text": "I had a less then 4x8 area of damage on my roof.  2 hrs was the max or would take to repair but they quoted me a day and a half. I  worked at home improvement centers for several years and knew their cost was ridiculous.", "pics": null, "resp": null, "gmap_id": "0x888a33d5c316823d:0x82f9339efe7f848a"}
{"user_id": "109390758289792747383", "name": "Darriusj Joseph", "time": 1624982315825, "rating": 5.0, "text": "Very responsive and good at what they do if you want a good hire this business is the one for the job!!!!!", "pics": null, "resp": null, "gmap_id": "0x456608893ea6fe0f:0x88a25ff25631529f"}
{"user_id": "106738842902275680728", "name": "Rhonda Rossman", "time": 1624981479384, "rating": 5.0, "text": "Rossman construction is very consciousness, affordable and work quality is excellent. I have hired them for several projects. Tin roof, replace and install new window, replace subfloor and put in new floor, ran all new water lines, and installed kitchen cabinets. I am very pleased with the work.", "pics": null, "resp": null, "gmap_id": "0x456608893ea6fe0f:0x88a25ff25631529f"}
{"user_id": "106611584232540896936", "name": "Johnnie Simpson", "time": 1510888374234, "rating": 5.0, "text": "I needed an estimate for my insurance and it just took a few minutes.", "pics": null, "resp": null, "gmap_id": "0x888860d0b7fa61bf:0xec07fa03bb7ff572"}
{"user_id": "108521383715339781574", "name": "Aiveen Kahalley", "time": 1615842111975, "rating": 5.0, "text": "We have been working with RD Lowes for over 10 years.  Consistent quality, timely response and all around a great company to work with.  Robert and his team do a fantastic job!", "pics": null, "resp": {"time": 1616269119560, "text": "Thank you for all of your business over the years.  We look forward to another 10 with you!"}, "gmap_id": "0x889a4d58159f75c5:0x600174ebd31f1062"}
{"user_id": "103820272252574883237", "name": "Nancy Wilson", "time": 1510691924622, "rating": 5.0, "text": "They do great painting and powerwashing.Very nice and professional work.", "pics": null, "resp": {"time": 1616269141034, "text": "Thank you!"}, "gmap_id": "0x889a4d58159f75c5:0x600174ebd31f1062"}
{"user_id": "111942317856040581894", "name": "Larry Madison", "time": 1612900305755, "rating": 5.0, "text": "Kevin and his team are very reliable and professional. I used them at my house and my daughter's  based on my mom's experience with them and am very pleased with the process and the results. The crews arrived ready to go to work and wasted no time in going about it.  All work was completed timely and as agreed.  I highly recommend them.", "pics": null, "resp": {"time": 1613013241458, "text": "Thank you sir!  We were happy to have your business and trust to get your projects done!  Can't wait to help you again in the future! Thank you!"}, "gmap_id": "0x886285a740bd0bc7:0x1dbc183161665cdb"}
{"user_id": "106906772039232966192", "name": "Angela Allred", "time": 1606165212773, "rating": 5.0, "text": "Crystal kept me up to date on everything.  Kevin was great to work with, even steered me toward a better solution and explained to me why the work I requested wasn't necessary during the quoting process.   He and his team did a great job painting, replacing a fence post, fixing a couple of ceiling fans, window and even my fence gates!  And Joseph did a wonderful job pressure washing the pack patio and gutters. Will definitely use again and refer others!", "pics": null, "resp": {"time": 1606166576236, "text": "Thank you for the kind words, ma'am. It was our pleasure to take care of your Handyman needs. We look forward to helping out with your future projects as well.   Have a great day!"}, "gmap_id": "0x886285a740bd0bc7:0x1dbc183161665cdb"}
{"user_id": "116045873964333082252", "name": "Jennifer Brasher", "time": 1607028831123, "rating": 5.0, "text": "I contacted operation handyman for some ceiling work, they were one of the lowest bidders and did an excellent job. They were very courteous and professional. Had it all done in one day and made sure i was satisfied with the job before they left and even called later to check if everything was good. I would highly recommend operation handyman, they know what their doing and will do it right.", "pics": null, "resp": {"time": 1607104926834, "text": "Thank you ma'am for your kind review.  It was our pleasure to help you with your project, and we look forward to working with you again in the future when you may need us.  Have a great day!"}, "gmap_id": "0x886285a740bd0bc7:0x1dbc183161665cdb"}
{"user_id": "116570069887996187792", "name": "David.Charlotte Grewe", "time": 1617405606357, "rating": 5.0, "text": "What a joy to be able to have someone reliable, honest and professional to call for any job.  We have had several projects done by Kevin.   All better than expected.", "pics": null, "resp": {"time": 1617411502393, "text": "Thank you Mr. & Mrs. Grewe.  We have enjoyed working for you everytime.  Can't wait for our future projects together."}, "gmap_id": "0x886285a740bd0bc7:0x1dbc183161665cdb"}
{"user_id": "107462476395324550439", "name": "Barbara Milligan", "time": 1589652764329, "rating": 5.0, "text": "I had several small jobs I did not want to burden my son with. He works hard and has his own house to maintain. I asked around if anyone knew a good, reliable handyman. So many are unprofessional, unreliable and lack integrity. I was given Kevin's name and when I researched his website, I was impressed. I will have to admit, I am not easily impressed. I thought, 'very impressive website,' but now let's meet the man. He came out to give me an estimate, on time. He was very professional, and I was again impressed. He responded in a very timely manner (again impressed), and had his quote detailed and moderately priced. He began work on the day he promised, and finished when he promised. He does good quality work, is reliable, is very intelligent, has suggestions to offer, and is respectful. If you have work to be done, he will give you a free estimate, arrive on time, give you a detailed estimate, follow up, etc., because he is ORGANIZED beyond words! He came out and completed my tasks just as he said. He will not only be respectful of you, he will respect your home as well. He will wear shoe covers when he enters your home and clean up and take the trash with him when he leaves! He replaced a door, installed extra shelving in my pantry, replaced by hot water dispenser, installed cabinets over my washer and dryer, and hung my big screen TV on the wall. You may be able to find someone less expensive, but they will also be less professional, less reliable, less experienced, and less respectful of your home. I highly recommend Kevin Kuntz, a man of integrity. To be honest, we don't find too many people these days with integrity, and do we want anything less in our home?\n\nP.S. For the record; I am not related to, a friend of, or have any other connection to Kevin Kuntz. I am strictly a satisfied client who will call on Kevin again whenever I have a job to do.", "pics": null, "resp": {"time": 1589670896818, "text": "Thank you ma'am, it has been my pleasure helping out with your projects. I appreciate the work and the kind words."}, "gmap_id": "0x886285a740bd0bc7:0x1dbc183161665cdb"}
{"user_id": "106382018876201438337", "name": "Jo-Amrah Dillingham", "time": 1580079814788, "rating": 5.0, "text": "Excellent in all respects! On time. Professional. Knowledgeable. Pleasant. Hardworking. Worked through lunch. Reasonable prices. He even cleaned up after himself. Folks like Kevin are hard to find these days!", "pics": null, "resp": {"time": 1580081696403, "text": "Thank you ma'am, it has been my pleasure working on your handyman projects."}, "gmap_id": "0x886285a740bd0bc7:0x1dbc183161665cdb"}
{"user_id": "106659807172039678119", "name": "mr boy", "time": 1580149778853, "rating": 5.0, "text": "He mounted our curved tv over a console and it looks great! Knowledge and did great work! Will def call again for future handyman needs!", "pics": null, "resp": {"time": 1580156723601, "text": "Thank you for calling Operation Handyman for your TV wall mount, I appreciate the opportunity and the work.  Have a great day!"}, "gmap_id": "0x886285a740bd0bc7:0x1dbc183161665cdb"}
{"user_id": "110892409121240547912", "name": "Lorie Crawley", "time": 1582208382874, "rating": 5.0, "text": "Kevin did great work on my fence repair! He did it sooner than I expected, did more than expected for less $ than expected! Thank you so much Operation Handyman!", "pics": null, "resp": {"time": 1583109596691, "text": "Thank you for choosing Operation Handyman for your repair project.  It has been our pleasure to serve you"}, "gmap_id": "0x886285a740bd0bc7:0x1dbc183161665cdb"}
{"user_id": "115684338898093899586", "name": "Derek Herscovici", "time": 1625097313321, "rating": 5.0, "text": "The first thing that let me know I had picked the right general contractor was Jordan Latimer’s attention to detail. Other GC’s weren’t willing to take the extra measurements, or recommend quality parts, or go the extra mile to make sure this project was done right.\nWhen the renovation process began, he communicated the process every step of the way. He let me know where there were issues and promptly set about fixing them with almost no time lost. He helped me achieve my vision for this bathroom and shower remodel and brought in a team of specialists and experts to see it through to completion. He does nothing halfway and values your input too, instead of overriding your ideas. I have gotten to know Jordan a lot during this process, and he is not only a fabulous contractor, but a man of great heart and compassion. He understands people as well as he does home remodeling and does not skimp on either. I cannot reccomend him enough. YOU WILL NEVER NEED ANOTHER CONTRACTOR AGAIN.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOdPBBaWk3njDZF003k-d9vs7pfz6PZN4_eQYGb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipODw-rGTd6-DT3DHfAMCNU1x_8hVE8s5C3MXiVY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNWwsNKZhlc4mIDi3FU1lSanRNnZlhqValPmNO_=w150-h150-k-no-p"]}], "resp": {"time": 1625100981142, "text": "Thank you Derek! That was very kind of you to say those words. I take a lot of pride in my work and I will never take a shortcut to jeopardize the integrity of a job. It has been wonderful getting to know you and I look forward to the continuing work we have going forward from here. Once again your kind words are very much appreciated."}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "113761444590318659955", "name": "Anthony Spina", "time": 1617832784974, "rating": 5.0, "text": "Jordan is a top notch contractor. He went well out of his way to make sure all of our needs were taken care of. He even fixed things we never asked him to fix at no additional cost. Jordan is a perfectionist and pays attention to every detail of his work. I would highly recommend him.", "pics": null, "resp": {"time": 1617839933202, "text": "Anthony, thank you so much for the kind words! I really enjoyed working for your great family and if you ever need us we are always here for you. Thanks again!"}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "111367446420738321926", "name": "Ben Burnett", "time": 1600099560656, "rating": 5.0, "text": "Jordan and his crew did a magnificent job.  Jordan is a honest guy, and his attention to detail in his work is second to none.  I trust him and his craftsmanship.  I knew it from the first time he came to do an estimate.  I would not want anybody else to do my work.  Our kitchen that they did is really beyond words.", "pics": null, "resp": {"time": 1600123490022, "text": "Thank you so much Ben! We are so very thrilled to know that y’all are happy with the kitchen. Looking forward to the future jobs and will get you guys some adjusted numbers just as soon as we can."}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "115787643806721794140", "name": "Tracy Witte", "time": 1620855297792, "rating": 5.0, "text": "Jordan does excellent work and really prides himself in getting a job done correctly. We have hired his company for several jobs over the past 4 years and have always been extremely pleased with his work.  Unlike many local contractors, who are hard to track down, Jordan communicates so well, which makes it easy to work with him. He is *so* responsive by phone, text, etc. We recommend him highly to all of our local friends and will hire him again in a heartbeat for any future repairs/remodeling.", "pics": null, "resp": {"time": 1620863666952, "text": "Tracy, we are so thrilled that you are happy with the outcome of your new front door. It goes so well with everything on the house and this whole project has been a major transformation. You guys are some of my favorite people to work for and thank you so much for the kind words!!"}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "102615839456427204727", "name": "Steve Sforzini", "time": 1615056897331, "rating": 5.0, "text": "Jordan recently did a countertop installation for us.  It was not a huge job but did require some creativity and ingenuity for this particular job.   Jordan came up with a way to do the job and communicated with us every step of the way.  I would describe Jordan as a very conscientious and dependable professional home remodeler.  We are ready for him to do our next job.", "pics": null, "resp": {"time": 1615057688423, "text": "Thank you Mr. Sforzini! We really appreciate the kind words and we will get you an estimate for the next job as soon as we are able."}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "106372914318406106945", "name": "Belle Winful", "time": 1613532917719, "rating": 5.0, "text": "I don' t even know where to begin with this review. I wish I could provide all pictures of our home before and after the complete renovation to see how amazing of a job that was done. JL Remodeling & Home Repair made our home more beautiful than we even envisioned. What I love most about Jordan, the owner, is that he will not improvise the integrity of work being performed by cutting corners. He Is extremely detailed and takes so much pride in his work! You will see it the moment you hire him. He is trustworthy, resourceful, and extremely professional. From how fair and detailed our estimates were in the beginning, to our home being left spotless at the very end; you can have confidence in all work that is done. This is so important because you do not want just anyone handling something as valuable as your home. We are very grateful for him and his company and we will use them for any future remodeling or home repair needs.", "pics": null, "resp": {"time": 1613585842278, "text": "Thank you Mrs. Winful. We really appreciate your kind words and enjoyed working with you guys so much during such an exciting time for your family."}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "104361709111885164596", "name": "Seth Donaldson", "time": 1596741247241, "rating": 5.0, "text": "JL remodeling was a great group of guys to work with. The flooring was done quickly, it looks incredible, and Jordan was very open and easy to communicate with. If I ever need any other repairs done, this will be the first place I go.", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "101898632317564346667", "name": "S Gitter", "time": 1592938932195, "rating": 5.0, "text": "We've had Jordan do several jobs for us. He has always done a great job. We are always more than satisfied with the work and service that he and his team provide.", "pics": null, "resp": {"time": 1592943903576, "text": "Thank you so much Mr. Gitter! It’s been a long time since we have heard from you so I hope you and the family are well! We sure have grown quite a bit since the last time we’ve done anything for you, but would be glad to help you on anything in the future no matter how big or small. Thanks again, as your review is much appreciated!"}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "106018302572371561814", "name": "Emily Joyner", "time": 1584148398225, "rating": 5.0, "text": "I highly recommend Jordan and his group. Every interaction I have had with him has been professional and he is always willing to go above and beyond to make sure I am happy with his work. I recommend him for any work you need done!", "pics": null, "resp": {"time": 1584217543885, "text": "Thank you so much for the kind words Emily! We look forward to working with you again in April!"}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "108204650543647335324", "name": "Rena Cannon", "time": 1561709640043, "rating": 5.0, "text": "Jordan prepares very detailed quotes in a very timely manner. Jordan replaced the mini gutters on my mobile home in Auburn. He did a fantastic job! He also replaced the master bath tub and surround. Again, he did an excellent job. I highly recommend Jordan and will continue to do business with him.", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "117689713259256770977", "name": "A Duke", "time": 1571010679873, "rating": 5.0, "text": "Jordan did an exceptional job remodeling our kitchen. There was an extensive mold issue when we bought our house so he basically gutted the whole area and made sure the mold was completely out.  Overall, I am very impressed with his work and absolutely love our new kitchen!! Jordan was awesome to work with, paid attention to the details, and went above and beyond to make our vision come to life. I would highly recommend him to anyone who is doing a major renovation. He is excellent!", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "105980454704524975478", "name": "Will Miller", "time": 1565570434565, "rating": 5.0, "text": "Jordan at JL Remodeling is the most honest and conscientious contractor we have ever worked with. He was thorough and always kept an open line of communication with us throughout the remodel. He does a very professional job and finished the project in a timely manner. We highly recommend Jordan and found that there's no job he can't do!", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "110141762078877313252", "name": "Margie Rush", "time": 1553558229864, "rating": 5.0, "text": "\"Thank you for helping us with our bathroom remodel. We are very pleased. Great work. Very dependable and professional. Detailed estimates and will use again if needed.\"", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "106084934866979419675", "name": "Colleen S.", "time": 1566080166947, "rating": 5.0, "text": "Replaced an existing tub/shower with a shower.  Great job, impressive work ethic, excellent value.   Highly recommend  you give them a look.", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "112241814163773453683", "name": "Pat Margreiter", "time": 1560557573199, "rating": 5.0, "text": "We have used JL Remodeling for 3 very different projects for our property in Auburn. All have been done professionally, on time and at a fair price. We highly recommend him and will most definitely use Jordan again.", "pics": null, "resp": {"time": 1560559174613, "text": "Mrs. Margreiter, you guys have been a pleasure to do business with and we will gladly take on anything you may have in the future. We’re always just a phone call away!"}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "114289751674439498901", "name": "CHERYL HALE", "time": 1546877344506, "rating": 5.0, "text": "JL Remodeling did a wonderful job on our home in Auburn, AL.\nThe mold remediation and repair of the leaky ceiling has been a success for a year now. We hired them again this week to do more renovation projects around the home. Very knowledgeable, professional, efficient, timely proposal, reasonable pricing and attention to detail. I Highly recommend this company for all of your repair/renovate needs in Auburn area.", "pics": null, "resp": {"time": 1546994962719, "text": "Mrs. Hale, you’ve been a pleasure to work with and we will gladly take on any projects you ever have."}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "117762930173050630356", "name": "Carolyn Mitchell", "time": 1556044561596, "rating": 5.0, "text": "I recently had my master bath remodeled, and the transformation is amazing.  Since I was at home during the work period, Mr. Latimer consulted me frequently about the details making sure everything was done to my satisfaction. I am very pleased with the workmanship and cost of the project -- Well Done!", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "110522838957337927003", "name": "Brenda Woods", "time": 1558796001408, "rating": 5.0, "text": "Jo remodeling & home repair did an excellent job remodeling our kitchen and bathroom. We are very pleased with the results and would recommend them highly.", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "117788803187601122003", "name": "Erik Nist", "time": 1600893421749, "rating": 5.0, "text": "We had a new condo in our rental program that needed a makeover. Candace and Gene totally came through and did an amazing job on a very short time frame. I was blown away about how great they were in all aspects of getting the job done. Timely, cost effective, thorough . . . I could go on and on. Bottom line, I'll be calling Island Services when my clients need the job done right. Thanks y'all!", "pics": null, "resp": {"time": 1596573491747, "text": "Thanks Erik! Glad we could help out. Popcorn removal is always a big improvement. 👍"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "102744480065288446463", "name": "Michael Overton", "time": 1422982208234, "rating": 5.0, "text": "I have known Gene and Candace a long time and they have always been extremely professional and just plain nice to be around.  Over the years we have both been clients of each other.  Island Services has got to be without a shadow of a doubt one of the top choices in the whole southern Baldwin County and Gulf Island Areas.\n\nYou will be happy you chose them and decided to eliminate frustration and stress.\n\nM.O. WebFocus Marketing Group", "pics": null, "resp": {"time": 1422984331881, "text": "Thank you!"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "105281299784549195965", "name": "Bellezza Photography of Alabama", "time": 1422983993172, "rating": 5.0, "text": "Great Company, Great Service, Great Results,\nThat's 3 Greats... What else do you need to know?\nHighly recommended.", "pics": null, "resp": {"time": 1422984445928, "text": "Thank you!"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "112379345089725188905", "name": "Aaron Aasen", "time": 1422982699109, "rating": 5.0, "text": "Great people who pay close attention to detail.  Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "105550016850619951416", "name": "Kaytrielle Jones", "time": 1423616403803, "rating": 5.0, "text": "Honest, good hearted people! You can count on quality service", "pics": null, "resp": {"time": 1423618188918, "text": "Thank you Kaytrielle!"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "114405505271778312721", "name": "Iris Meyer", "time": 1423583503418, "rating": 5.0, "text": "Highly satisfied with Island Services! They provide outstanding workmanship and are very professional!", "pics": null, "resp": {"time": 1423584064108, "text": "Thank you Iris!"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "115978587226826137962", "name": "Robert Schwarze", "time": 1422533529689, "rating": 5.0, "text": "Very honest and upright people.", "pics": null, "resp": {"time": 1422572928888, "text": "Thank you!"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "103220891827753950407", "name": "Joshuah Bryant", "time": 1422978466142, "rating": 5.0, "text": "Detailed oriented company. You want go wrong be choosing them for your home repair needs.", "pics": null, "resp": {"time": 1422979157623, "text": "Thank you!"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "111373025637663927012", "name": "Daniel Geary", "time": 1556173431489, "rating": 5.0, "text": "There here to serve and they will serve professionally", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNDOxjy1ONUqeOxow3nNWgqmlBYJVPDNtwyOIf1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP8ZY9y66xstZE0BN1XCyfKPAEseU4h84H38AZP=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3ccb7bc3bd0b:0x4b3ab253f0b2bd64"}
{"user_id": "109079562442020848681", "name": "Daniel Geary (JR Geary)", "time": 1550623038278, "rating": 5.0, "text": "Don't call these companies that want to charge outrageous prices just to pull up in your driveway and sit there looking pretty on their phones. I hate people like that. If I'm able to do the job then I will assure you that I am qualified and I can do it. Plus I take pride in my work. I'm here for you for all your handyman services needs, like decks, room extensions, plumbing, some electrical, cutting trees, and an overall friend to chat with if you are near me while I'm getting the job done !  Guaranteed lowest/best prices in the south. Money orders and cash only. Checks never accepted. Must pay 3/4 of my cost before the job is done and the other 1/4 upon completion", "pics": null, "resp": null, "gmap_id": "0x888a3ccb7bc3bd0b:0x4b3ab253f0b2bd64"}
{"user_id": "105548214761191126251", "name": "Bravo Chakras", "time": 1517384324240, "rating": 5.0, "text": "Very nice place here. Makes you feel right at home.", "pics": null, "resp": null, "gmap_id": "0x888a3ccb7bc3bd0b:0x4b3ab253f0b2bd64"}
{"user_id": "115750333606090908146", "name": "Anthony Geary J.R. Geary", "time": 1530966590418, "rating": 5.0, "text": "Good help plumbing paneling underpinning. My son's JC and LB do a lot things with tools", "pics": null, "resp": null, "gmap_id": "0x888a3ccb7bc3bd0b:0x4b3ab253f0b2bd64"}
{"user_id": "105451017972347526023", "name": "Angie Russell", "time": 1603393616398, "rating": 4.0, "text": "He gave me a quote", "pics": null, "resp": null, "gmap_id": "0x8888e8936d5202fb:0x5cce50511d46dc5a"}
{"user_id": "106088277691781030120", "name": "Michelle Hubbard", "time": 1523548483893, "rating": 5.0, "text": "Good hard working people they do awesome work", "pics": null, "resp": null, "gmap_id": "0x8888e8936d5202fb:0x5cce50511d46dc5a"}
{"user_id": "105353617612325403362", "name": "Bobby Canady", "time": 1533873663309, "rating": 1.0, "text": "Nothing there but private homes in suburb area", "pics": null, "resp": null, "gmap_id": "0x88897205a988547f:0x2d856fd377f71a89"}
{"user_id": "117285624028157126738", "name": "Evelyn Bates", "time": 1553695384753, "rating": 3.0, "text": "Everything I needed cheaper than a smaller chain and some really great deals", "pics": null, "resp": null, "gmap_id": "0x88626b69a7a7710b:0xe6af4a353bbf8246"}
{"user_id": "112822865322716350390", "name": "Bobbie King", "time": 1560358846413, "rating": 5.0, "text": "Always have what I need and always a pleasure!", "pics": null, "resp": null, "gmap_id": "0x88626b69a7a7710b:0xe6af4a353bbf8246"}
{"user_id": "105341569983816638981", "name": "Debra Vickers", "time": 1551350810997, "rating": 3.0, "text": "good service", "pics": null, "resp": null, "gmap_id": "0x88626b69a7a7710b:0xe6af4a353bbf8246"}
{"user_id": "105256378627230408426", "name": "Benny Manzanilla", "time": 1619792174955, "rating": 2.0, "text": "The service is terrible at the one on schillinger road can't find nothing can't find someone to assist you what you looking for", "pics": null, "resp": null, "gmap_id": "0x889bb241bc208893:0x4f57c7a95e8797a7"}
{"user_id": "111353726117834583616", "name": "Sonia S", "time": 1442415271222, "rating": 1.0, "text": "After spending thousands of dollars for countertops, carpet, backsplash, vinyl siding............they sold me a cracked kitchen sink........I had to return it............they gave me credit for the returned sink...........but forgot to charge me for the new sink that the crew had to bring from another store.  The manager Gail hounded me about coming in to have the $199 sink charged to my Home Depot account.  She even threatened to cancel the installation of my backsplash that was scheduled for the next day.  Needless to say........I did go in and pay for the sink.  Very unprofessional.............considering I have been a loyal customer for years.", "pics": null, "resp": null, "gmap_id": "0x889bb241bc208893:0x4f57c7a95e8797a7"}
{"user_id": "114277536852777010523", "name": "Wade Parnell", "time": 1572278587275, "rating": 4.0, "text": "Most helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb241bc208893:0x4f57c7a95e8797a7"}
{"user_id": "106407380444858417754", "name": "mike piliponis", "time": 1538478500676, "rating": 5.0, "text": "Quick service", "pics": null, "resp": null, "gmap_id": "0x889bb241bc208893:0x4f57c7a95e8797a7"}
{"user_id": "112941884545204046466", "name": "Jessica Svenson", "time": 1619792839454, "rating": 5.0, "text": "The experience with this company after the storm has been hands down the best around. Many contractors are gouging labor pricing because they have more work than they know what to do with. Handy Men has maintained  their labor cost but like any business materials are sky rocketing. It is refreshing to have a contractor show up and do what they say they will do and make things right when there is an issue. Do yourself a favor and call the local guy!", "pics": null, "resp": null, "gmap_id": "0x889a1aaed2713be1:0x119004f4db834db7"}
{"user_id": "104075798474066766109", "name": "Mark Thimsen", "time": 1620054307077, "rating": 5.0, "text": "Dave is very, very responsive.  We recently had a failing smoke alarm that was going off in our beach rental condo and we had guests there.  It was a Sunday morning and we live 6 hours away so we really needed to get someone quickly over there to take care of the situation.  Dave called me right back and then headed straight to the unit and installed four new smoke detectors for us, per our request.  He did a professional job, used larger cover plates where needed to avoid needing touch up paint, was pleasant to work with, kept us informed, made our guest happy, charged a very fair price and didn't mark up his materials.  Couldn't be happier!  Dave is our new go-to guy.", "pics": null, "resp": null, "gmap_id": "0x889a1aaed2713be1:0x119004f4db834db7"}
{"user_id": "105237773740591188728", "name": "David Lloyd", "time": 1604363132618, "rating": 5.0, "text": "I am a long time customer of David Stewart and his crew doing business as The Handymen LLC in Foley.  This time I used David and his company for Hurricane Sally repairs.  I was fortunate that I had minor damage to my home.  However, the fact that my damage was not major caused some of the contractors I spoke to to put me off or quote me exorbitant prices to do the work.\n\nThe Handymen came out and did roof work one weekend and then David personally came by on a Sunday afternoon and repaired a window for me.  David told me how the job was going to be done and the materials required.  Again, not a huge project but one that required skill, knowledge, and the correct tools.  Of course it turned out well.\n\nI have used this company on two other occasions for exterior work on my townhome.  I know they are licensed in Gulf Shores and have done many projects here.  I have not had to call them out to “repair” their repairs like some of the others that I have used previously.  I have no reservations in recommending The Handymen LLC of Foley to others seeking home repairs.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNhy6c11IgJed44RXw5xW9eoFXtJX6Ar0GYKZV0=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a1aaed2713be1:0x119004f4db834db7"}
{"user_id": "100279047358638285072", "name": "Marion Richardson", "time": 1621254476241, "rating": 5.0, "text": "When our central unit quit Dave was there within the hour to check for the problem and had it cleaned and running again shortly after. Professional, honest and reliable", "pics": null, "resp": null, "gmap_id": "0x889a1aaed2713be1:0x119004f4db834db7"}
{"user_id": "109914846180299769113", "name": "Travis Swanson", "time": 1616705825418, "rating": 1.0, "text": "Never got back in touch with me. He said I will let you know a time tomorrow,  that never happened.", "pics": null, "resp": {"time": 1616712081345, "text": "I’m sorry we did not get in touch with you. We have been very busy trying to get our clients fixed up from the hurricane sally. We would like the opportunity to make it up to you.\n\nI looked back & found no record of you calling?"}, "gmap_id": "0x889a1aaed2713be1:0x119004f4db834db7"}
{"user_id": "113020549252194043656", "name": "Rachel Holley", "time": 1490991622972, "rating": 5.0, "text": "I originally called Handymen, LLC to remove the carpet in my garden room and to replace it with bamboo tile...Two days before the project began, I cut the carpet and discovered old painted hardwood boards in perfect condition...I sent pictures to David Stewart, the General Contractor, and he didn't mind quickly changing plans so that we could preserve the beauty of these 74 year old floors...The before and after pictures are below...Simply amazing...David Stewart made my dreams come true...His ideas are unique and he tailors everything according to your requests...All work was impeccably done...And David had the proper permits from the City of Mobile...If you have any dreams of what you may want done, David Stewart will make it happen...And all of his work is done to code...He will keep you apprised all along the way as to true expectations in remodeling or repair and pricing...There were no surprises with invoicing...Handymen, LLC will be doing all of my future projects...They are very trustworthy and they clean up after the job is done...The Highest Quality Work I Have Ever Seen...", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPuY1GDjtm0W4itch8-JpJ90jkMCn45fBwbXzKH=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a1aaed2713be1:0x119004f4db834db7"}
{"user_id": "117290966781805461144", "name": "Shelda Deits", "time": 1592066782039, "rating": 5.0, "text": "Just got my job done 2 days ago. I am very pleased with everything. He went out of his way to help a older lady to get what needed to be done, done. Helped me out with pricing  and went beyond my request. I appreciate everything they did for me.", "pics": null, "resp": {"time": 1597930717364, "text": "Shelda thank you for all the work. If you need us we will be there 😎"}, "gmap_id": "0x889a1aaed2713be1:0x119004f4db834db7"}
{"user_id": "102432165665578392853", "name": "Jennifer Russell", "time": 1591457189901, "rating": 5.0, "text": "High quality work at an affordable price! They also arrived when they said they would and completed the job on time.", "pics": null, "resp": {"time": 1597930750967, "text": "Thank you for all the work it was a pleasure doing your job."}, "gmap_id": "0x889a1aaed2713be1:0x119004f4db834db7"}
{"user_id": "114510185499980406019", "name": "STEPHANIE HART", "time": 1527888698334, "rating": 5.0, "text": "I am very happy with David's responsiveness and the work that he and his crew have done at my condo. He came out to help me for the 1st time on a Sunday which was a life-saver. He fixed my dishwasher, painted various rooms and assisted with some pest problems for me to prepare for the on-season. He is considerate, doesn't nickel and dime you, and does great work! Couldn't be happier!", "pics": null, "resp": null, "gmap_id": "0x889a1aaed2713be1:0x119004f4db834db7"}
{"user_id": "102121579530220632657", "name": "The White Room", "time": 1548697703483, "rating": 5.0, "text": "David was so nice and went above and beyond for us. I would highly recommend this company for any HVAC, plumbing, electrical and moving services. The best!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a1aaed2713be1:0x119004f4db834db7"}
{"user_id": "110471644623143121505", "name": "Kristin Hegji", "time": 1444149868317, "rating": 5.0, "text": "Love the Handy Men!  These guys are fantastic- helpful, knowledgeable, and precise.  I left a message for David to see if he could cut some tile for us, and he called me back right away.  Not only were they able to help with the tile, but they also installed light fixtures for us throughout our house.  They completed everything quickly and did a great job. Would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a1aaed2713be1:0x119004f4db834db7"}
{"user_id": "108066103358338728922", "name": "Christ the King ECDC (CTKECDC)", "time": 1444933239731, "rating": 5.0, "text": "We had so many projects that needed to be completed - plumbing, painting, fence repair, installations - almost every area you can think of. From beginning to end, everything was great - finished quickly, professionally done, and great communication at all steps of the way. We will definitely use them again and again!", "pics": null, "resp": null, "gmap_id": "0x889a1aaed2713be1:0x119004f4db834db7"}
{"user_id": "106175460248482891840", "name": "Christy Massey", "time": 1443889702560, "rating": 5.0, "text": "Handy Men did work for me here in Peninsula and were exceptional!  They came when they said they would (amazing for around here), did the work at a reasonable rate, and then I could even pay the bill online, which is so simple!  They even came on a Sunday and fixed my surround sound and Smart TV because I could not use it.  I had 3 other people try to fix this in the past 6 months and they never got it all going.  Now I can enjoy my sound system! and new TV.  YAY!  I would recommend Handy Men for any of your project needs!  So nice to have someone down here at the beach that is reliable!!!  Thank you David and Jason.", "pics": null, "resp": null, "gmap_id": "0x889a1aaed2713be1:0x119004f4db834db7"}
{"user_id": "101570057679619499249", "name": "Sam Shorrosh", "time": 1445269203040, "rating": 5.0, "text": "These guys are great. Professional, skilled, reasonable, accurate, on time, flexible. Easy to talk to about any project. No rolling their eyes or acting like their time was wasted, they were positive and friendly. Jobs included drywall, painting, flooring, plumbing, carpentry, tile work, lighting and more. There was no delay in getting different type projects done. Will use again and again. Call them spoon because as word gets around I'm sure they will get booked up.", "pics": null, "resp": null, "gmap_id": "0x889a1aaed2713be1:0x119004f4db834db7"}
{"user_id": "103136082117496385725", "name": "Dale Rees", "time": 1518398329092, "rating": 5.0, "text": "David was very responsive and satisfactorily resolved an urgent issue with our home.", "pics": null, "resp": null, "gmap_id": "0x889a1aaed2713be1:0x119004f4db834db7"}
{"user_id": "110825189309281761332", "name": "Sam St. George", "time": 1497657400585, "rating": 1.0, "text": "Do not hire this guy, you will regret it. I have spent so much money fixing his mistakes. He remodeled my bathroom and I have had nothing but problems, my sink leaks and my bedroom wall (on the opposite side of the shower he installed caved in due to water damage. He calls himself a prpfessional, that's not the term I'd use.", "pics": null, "resp": null, "gmap_id": "0x889a1aaed2713be1:0x119004f4db834db7"}
{"user_id": "100638422263734371839", "name": "tyler johanson", "time": 1494555943884, "rating": 1.0, "text": "Horiable didn't keep his word. Had to hire another contractor to come out and fix every thing he did. Not only did I have to pay Dave but I had to pay another man more money to fix the work done wrong", "pics": null, "resp": null, "gmap_id": "0x889a1aaed2713be1:0x119004f4db834db7"}
{"user_id": "113872377365444002068", "name": "Robert Campbell", "time": 1466548812891, "rating": 1.0, "text": "I'll just say, not a satisfied customer. They do not keep their word.", "pics": null, "resp": null, "gmap_id": "0x889a1aaed2713be1:0x119004f4db834db7"}
{"user_id": "110919925934399246543", "name": "Jennifer Taylor", "time": 1623003805123, "rating": 5.0, "text": "Really nice people! So glad to have found this business. Art was flexible with my schedule to come take a look at what needed to be done. He offered great advice. Blake, Jason, and Kelvin came out to do the work. They worked fast, efficiently,  and did great work. Kelvin was able to fix some problems with my ceiling and kitchen cabinets so that they looked better than they ever had before. Thank you.", "pics": null, "resp": {"time": 1623004338755, "text": "Thank you so much! I’m glad to hear that we could help you with your handyman needs!"}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "103093715697071719176", "name": "Kellie Gilliland", "time": 1619446313015, "rating": 5.0, "text": "From the moment I reached out to Home Repair Service (HRS) I was contacted back quickly. A convenient virtual then in person estimate was given before any work was done with multiple solutions available to me depending on a price point I was comfortable with. They arrived on site earlier than anticipated and knocked my chimney repair out in record time. They didn’t make a huge mess and cleaned up everything when they were done. The workers were polite and respectful and very professional. I was terrified of home repairs due to horror stories I have heard but this was an amazing experience and so much more affordable than I thought it would be. I have several more home improvement jobs lines up and Home Repair Service will have my business. I will truly be a customer for life! What a Blessing!", "pics": null, "resp": {"time": 1619447914489, "text": "!! What a fantastic thing to hear. I know a lot of people in Birmingham need chimneys repairs and to hear that our solution and process worked so well for you is truly fulfilling! I’m looking forward to helping you with any future home repair projects!"}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "104513060789486167701", "name": "BILL SMOKE", "time": 1624281849174, "rating": 5.0, "text": "Had after-hours water leak. They took time to diagnose problem over the phone. They had crew here the next morning. Very happy with everything done. Would recommend highly.", "pics": null, "resp": {"time": 1624283997181, "text": "Thank you for using Home Repair Service for your repair project! I'm always happy to see our clients get what they need."}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "117133831306089562223", "name": "JOE RIEVES, II", "time": 1620881086156, "rating": 5.0, "text": "Both Richard & Kelvin came out the first day, on time, and did very good work. On the second day, we only had Kelvin. He did a terrific job of painting! Will use them again.", "pics": null, "resp": {"time": 1620896410016, "text": "Thank you, Joe! Thank you for using Home Repair Service for your drywall repairs. I’m always glad to see happy clients and we’re ready to help on your next handyman project when you are."}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "106231527431488551016", "name": "Steven Scrimpshire", "time": 1617214308443, "rating": 5.0, "text": "Rich came out and installed an exterior ceiling fan and light kit on our back patio and installed 3 new light fixtures inside. He was prompt, very friendly and did a great job. We even forgot to tell him about the remote that needed to be installed with the ceiling fan (it was in a separate box) and he got back up there and installed it.\nI initiated this through Timothy on his cell phone and Timothy was always a pleasure to speak with.", "pics": null, "resp": {"time": 1617218803111, "text": "Timothy Beckham here with Home Repair Service. Thank you so much for using us to install you fan and light fixtures! It was a pleasure to help you our there in Montevallo! I'm looking forward to helping you with that remodeling project when you're ready."}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "109091938489038425510", "name": "Donna Bowen", "time": 1623896736779, "rating": 5.0, "text": "The finished work was very good quality (siding on chimney and eaves repair and painting). We were pleased with the results.", "pics": null, "resp": {"time": 1623898718432, "text": "Thank you! I’m glad we were able to help you with your exterior repairs."}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "109488857831075063003", "name": "Bruce Capitell", "time": 1617734770844, "rating": 5.0, "text": "Excellent experience.  Robert was at my house as scheduled and the work was easily performed within my time frame. Money well spent. I highly recommend Home Repair Service.", "pics": null, "resp": {"time": 1617739940914, "text": "Mr Capitell! Thank you for using Home Repair Service for your chimney repair. It was a pleasure working with you and I hope to hear from you soon about your next home repair project."}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "115613644970216574177", "name": "Anita Scroggins", "time": 1619544725980, "rating": 5.0, "text": "Repaired rotten eves. Painted wood replacements. They responsed immediately to my text and a plan was made for the repairs. They actually came before I thought they were due to come. Work was really well done and the price was good as well. I have since recommended them to several people. This is a nice company and I will be using them again.", "pics": null, "resp": {"time": 1619609513129, "text": "This is fantastic to hear! I’m so glad we we’re able to repair your rotten soffits and thank you so much for referring our company to your circle. It help so much!!"}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "101282102711589590039", "name": "Kendall Simpkins", "time": 1618847012981, "rating": 5.0, "text": "Outstanding work!! I had my outdoor window shutters repaired and repainted. Quality work and nice clean up after work was completed!\nWould recommend to anyone.", "pics": null, "resp": {"time": 1618859173233, "text": "Thank you!! I'm glad we were able to help you with your honey-do list!"}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "116743807800055881700", "name": "Lucretia Perego", "time": 1619127582796, "rating": 5.0, "text": "I can't say enough about Home Repair Service. As an out of state owner, with a graduate student living in our condo we needed lots of various repairs. One being the door knob fell off the door, they were there in an hour!  I felt like they dropped everything for us. Not knowing anyone in Alabama increased my stress level. HRS  did everything they promised and did a wonderful job. Most importantly, I can now rest easy knowing if anything goes wrong they will be there to help my daughter. Thanks you Tim, we appreciate your work ethic!", "pics": null, "resp": {"time": 1619138397902, "text": "Thank you so much! When you told me you pulled the door knob off the door because it was too tight, I knew we could make your life better. I’m also glad we were able to help you patch all the holes in your drywall too. I’ll be glad to work with you on the next project."}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "108289107656570741959", "name": "E. Miskell", "time": 1620088095635, "rating": 5.0, "text": "Home Repair Service did a good job with the repairs (downspout and attic stairs) to our home. They were very detailed and responsive. The workers were also friendly.", "pics": null, "resp": {"time": 1620091144562, "text": "Thank you so much. I saw that video you sent us!! What a laugh, we all had. I’m glad you sent it to us. I’m ready to help with your next Handyman project."}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "107318774440316325551", "name": "Matchett Gunn", "time": 1613184938045, "rating": 5.0, "text": "I would recommend HRS to anyone looking to do a home remodel for three reasons. First, they do what they say and know what they’re doing. Second, they stand behind their work. Third, their commitment to customer service sets them apart from their competitors.  The HRS team designed and completed a total remodel of our master bathroom. The finish quality was excellent - even better than expected. However, with all home projects, there were some revisions and polishing touches that needed attention. TJ, David and their team were on site quickly to walk through the punch list, discuss the resolution - and they follow through. They focus on you and your project until it is complete. This isn’t the first project I’ve used them for, and definitely isn’t the last.", "pics": null, "resp": {"time": 1613185108934, "text": "Man, that’s awesome to hear!"}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "114768614106517648786", "name": "Molly Furlow", "time": 1618933941675, "rating": 5.0, "text": "I can not say thank you enough to Rich and the guys with HRS. Everything on my to do list (which was not a short/simple list) was completed efficiently in two days with no issue. I will absolutely be reaching out to TJ, Art and Rich again for any of my home related needs in the future.", "pics": null, "resp": {"time": 1618935620916, "text": "Thank you so much Molly! I’m so glad we were able to help you with your honey do list. I love it when a plan comes together!"}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "115750457915159710089", "name": "Randall- -Craig777", "time": 1606877940025, "rating": 5.0, "text": "HRS is a phenomenal company who's  owners and tradesman/craftsman truly care for their customers. The customer service this company provides is in a league of its own. It's very rare these days to receive true customer service. This is one of the few companies around who truly care for its customers and their complete satisfaction. I will highly recommend HRS to any homeowner or business owner who needs a renovation  or repair done correctly and by quality, trustworthy, clean cut professionals.", "pics": null, "resp": {"time": 1607958079335, "text": "Thank you for these very kind words."}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "115850537198752585189", "name": "Ed Graves", "time": 1619546394936, "rating": 5.0, "text": "Got a fair price and quality work on a small repair job to some siding on the house.  Will definitely use again.", "pics": null, "resp": {"time": 1619609577942, "text": "I love it when a plan comes together! Thank you for using us to repair your siding. Let us know if we can help again!"}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "110949682152460268165", "name": "Brad Cleage", "time": 1613174278556, "rating": 5.0, "text": "HRS has completed so many jobs for me over the years I can’t count.  I am a repeat customer with our property management business and they always complete the work in good order and as requested.  Highly recommend.", "pics": null, "resp": {"time": 1613176474774, "text": "Thank you, Brad! It’s always a pleasure working with y’all too."}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "106866265418475718719", "name": "Tim Yaeger", "time": 1624992799751, "rating": 5.0, "text": "Professional appearance and provides clear and accurate quotes upfront. No hidden charges!", "pics": null, "resp": {"time": 1624993538279, "text": "Thank you! We’re looking forward to starting another project with you, my friend. We’re looking forward to helping you out with your siding project."}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "108684937060667065538", "name": "Grant Cochran", "time": 1613076296972, "rating": 5.0, "text": "HRS was quick to respond for my small repair job. They were all professional, transparent about pricing, and friendly people to work with! I’ll definitely be a return customer!", "pics": null, "resp": {"time": 1613079456033, "text": "Grant, That’s an extremely nice thing to hear. I’m glad that everything worked out and I really appreciate you sharing your experience with our company."}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "108084912304975636915", "name": "Jeff C", "time": 1615825076183, "rating": 5.0, "text": "The work was performed professionally, they were upfront with the pricing (which I thought was fair for the work), and very customer friendly. Would recommend their services.", "pics": null, "resp": {"time": 1615827106428, "text": "Thank you, that's very nice to hear!"}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "106782485646410601650", "name": "Samuel Evans", "time": 1623104213044, "rating": 5.0, "text": "A Home Repair Service Technician checked and repaired my gutters following a storm.\nThe Technician arrived at our home on time,  was very compentant and professional.", "pics": null, "resp": {"time": 1623105231651, "text": "Hey, I’m glad we could help with your gutter repair! Thank you for the nice words, I’m always happy to hear when our clients get quality home repairs from us!"}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "111072902036421327373", "name": "sbarringer", "time": 1613230497373, "rating": 5.0, "text": "I’ve used HRS many times over 10 years and have been very happy with each job.  The owners, David and TJ, are very dependable and professional.", "pics": null, "resp": {"time": 1618859210582, "text": "Thank you, Scott!! It's always nice to work with you!"}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "104574248497235259298", "name": "Stephanie B", "time": 1613156043532, "rating": 5.0, "text": "Thanks for the hard work. I love my new bathroom.", "pics": null, "resp": {"time": 1613160207023, "text": "That’s very kind, Stephanie!"}, "gmap_id": "0x88892381a61363c1:0x6ebb4c91586940e0"}
{"user_id": "107509817680571874809", "name": "Maggie Wood", "time": 1615915946908, "rating": 5.0, "text": "Jose did an exceptional job! Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a10a4d62f60a1:0xf04fcb6c23291a4a"}
{"user_id": "115918503008869569140", "name": "Ann Davis", "time": 1530647370885, "rating": 5.0, "text": "Jose and his helper, Angel, did a wonderful job painting several rooms in our house, as well as doors, trim and laying a bathroom flooring. Best of all they put in pretty crown molding in a house that never had it before. Great worker, careful and a pleasure to work with.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPRKCUyVrbRbUMOz0sEP9SIk8eyHfinPb29-py3=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a10a4d62f60a1:0xf04fcb6c23291a4a"}
{"user_id": "101350800021852611430", "name": "Billy T.", "time": 1561522073784, "rating": 5.0, "text": "Jose is the best Handyman out there! Our new fence looks amazing and is build better than our neighbors. We are so lucky to have Jose as our Handyman. He is highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889a10a4d62f60a1:0xf04fcb6c23291a4a"}
{"user_id": "115949945495185661147", "name": "John Anderson", "time": 1534342953603, "rating": 5.0, "text": "I was in a bind and had a day and a half to complete a painting job I was trying to do myself. Jose came over that evening and helped finish the job. The work he did was great. He did everything I asked and completed it within the time frame. I highly recommend this company for the simple fact that Jose does what he says he's going to do and will go above and beyond for you.", "pics": null, "resp": null, "gmap_id": "0x889a10a4d62f60a1:0xf04fcb6c23291a4a"}
{"user_id": "103610796934682108290", "name": "celia delaney", "time": 1520608159587, "rating": 5.0, "text": "Family owned, honest, dependable and the hardest worker I’ve ever seen.  And very pleasant to work with!", "pics": null, "resp": null, "gmap_id": "0x889a10a4d62f60a1:0xf04fcb6c23291a4a"}
{"user_id": "104460144383766042806", "name": "Dal Mcveay", "time": 1523286259609, "rating": 5.0, "text": "jose is awesome and does a great job, and he does it with a smile on his face. Great family owned business", "pics": null, "resp": null, "gmap_id": "0x889a10a4d62f60a1:0xf04fcb6c23291a4a"}
{"user_id": "107650374789043817625", "name": "Reggie Pulliam", "time": 1520967011194, "rating": 5.0, "text": "Great young, local couple looking to build an honest and trustworthy business. Give them a call!", "pics": null, "resp": null, "gmap_id": "0x889a10a4d62f60a1:0xf04fcb6c23291a4a"}
{"user_id": "101586858188355057938", "name": "Vicky Roper", "time": 1519862331405, "rating": 5.0, "text": "I highly recommend Jose. The service is absolutely the best I ever had, courteous, hard working, polite, and very good prices.", "pics": null, "resp": null, "gmap_id": "0x889a10a4d62f60a1:0xf04fcb6c23291a4a"}
{"user_id": "115701438207958116508", "name": "Joseph Wolfe", "time": 1502556273601, "rating": 5.0, "text": "Get away", "pics": null, "resp": null, "gmap_id": "0x889a10a4d62f60a1:0xf04fcb6c23291a4a"}
{"user_id": "104378838507977027743", "name": "laurence allen", "time": 1579592606381, "rating": 1.0, "text": "Horrible experience to be professional builders", "pics": null, "resp": null, "gmap_id": "0x862831bfb7129e77:0x633afefdb0cc9cbf"}
{"user_id": "100872051604800994421", "name": "Berta Mexidor", "time": 1531252831023, "rating": 4.0, "text": "Good quality work", "pics": null, "resp": null, "gmap_id": "0x862831bfb7129e77:0x633afefdb0cc9cbf"}
{"user_id": "115121565294839873699", "name": "Thomas Clark", "time": 1604942642132, "rating": 1.0, "text": "After I was given a quote and an appointment was scheduled to start work nobody showed up. Tried to call and I was hung up on and blocked. I would love to know what the issue was. If the company felt as is they bid the job too low, I would have been receptive to another quote. I run my own company and was prepared to send a lot of work their way. I wasn't concerned about any fair price. I just wanted a reputable company that does good work to take care of my customer.", "pics": null, "resp": null, "gmap_id": "0x889bb3d596b69b9d:0x43825cdd511677d7"}
{"user_id": "104357097038280173945", "name": "lucy loo", "time": 1598806826558, "rating": 5.0, "text": "I originally called to have him fix my a/c. He did such a great job that I had him come back several more times to redo my entire bathroom and paint my house. He even fixed my refrigerator. A part needed to be welded on and he was able to do it. I will continue to use RAL. I would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x889bb3d596b69b9d:0x43825cdd511677d7"}
{"user_id": "109651801013967629666", "name": "Vince Hicks", "time": 1624572989680, "rating": 1.0, "text": "Said he would be here between 12-12:30, on his suggested time.  I texted and called at 1, no response or show!!  DO NOT USE!!", "pics": null, "resp": null, "gmap_id": "0x889bb3d596b69b9d:0x43825cdd511677d7"}
{"user_id": "101952602110142313120", "name": "Ara Finch", "time": 1598413504042, "rating": 5.0, "text": "Had two rooms painted in my house by other painters and had a horrible experience. I had then contacted R.A.L. to fix the two rooms which turned out fabulous.  His team and himself were so polite and had even taking the time to clean up which I had never experienced. I am looking forward for them to finish the other rooms in my house and any other repairs I may have . Thank you Robert and your team!", "pics": null, "resp": null, "gmap_id": "0x889bb3d596b69b9d:0x43825cdd511677d7"}
{"user_id": "108475319327522704921", "name": "Allison Fleming", "time": 1594594652027, "rating": 5.0, "text": "We called Richard with Always Trees on Tuesday, and they were able to expedite the removal of our large pine tree on Friday! We are very pleased with the professionalism of this company, and will definitely use them again for any other tree needs we have! Thank you guys!!", "pics": null, "resp": null, "gmap_id": "0x886216efbf2b6261:0x81149ab51cd6eb6c"}
{"user_id": "104193060102872611278", "name": "Eric Jackson", "time": 1576376182288, "rating": 5.0, "text": "These folks came out to remove two trees from my front yard.  They did a super job.  Quick, professional and courteous. Highly recommended", "pics": null, "resp": null, "gmap_id": "0x886216efbf2b6261:0x81149ab51cd6eb6c"}
{"user_id": "115424383536159978184", "name": "Tracy Crews", "time": 1572057545975, "rating": 5.0, "text": "I utilized Always Tree Service for removal of a splitting tree. First to call from Angies list. Good communication. Great value . Timely done. Entire process went better than expected. Give Richard a call. I'm glad I did.", "pics": null, "resp": null, "gmap_id": "0x886216efbf2b6261:0x81149ab51cd6eb6c"}
{"user_id": "108765101576396871320", "name": "Dennis Loeffelholz", "time": 1581707601894, "rating": 5.0, "text": "They responded promptly to my request for bid, came quickly for an estimate, gave a fair and competitive bid. They did a great job an I would highly recommended", "pics": null, "resp": null, "gmap_id": "0x886216efbf2b6261:0x81149ab51cd6eb6c"}
{"user_id": "108711327027266595766", "name": "Mary Lindblom", "time": 1549142606303, "rating": 5.0, "text": "Richard at Always Tree Services was great to work with- prompt communication, honest quote, quick turnaround time from quote to getting the work done. His team was on time on the day of the job (cutting down a tree, trimming some trees). They were courteous and cleaned up our yard as best they could... They even stacked our firewood up for us! I highly recommend this business! We'll definitely call them again!", "pics": null, "resp": null, "gmap_id": "0x886216efbf2b6261:0x81149ab51cd6eb6c"}
{"user_id": "112022007991916633597", "name": "Michelle Jones", "time": 1622594978257, "rating": 5.0, "text": "Schmidt Home Services was awesome to work with. Very responsive and great communication! We will definitely call them again in the future.", "pics": null, "resp": {"time": 1622597008058, "text": "Thank you.. we try our best to stay in touch with all out clients as much as possible.  I'm happy we where able to help you out. We look forward to working with you in the future."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "113373559091292995801", "name": "Annette Hardin", "time": 1614471657726, "rating": 5.0, "text": "Polite, on-time. Excellent work. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "110242958326644666701", "name": "Yingying Li", "time": 1614048480930, "rating": 5.0, "text": "very professional and helpful!", "pics": null, "resp": {"time": 1614051654942, "text": "Thank you 😊.. I'm glad we where able to figure out that headboard for you even though we where missing items for the assembly, Gotta love IKEA!😄"}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "104119765343787468314", "name": "The Diva Mrs. Ash", "time": 1619216946665, "rating": 5.0, "text": "The gentlemen at Schmidt's were very professional, prompt, & informative. They installed a lock on my shed which was a complicated process. They were very diligent and kept me informed along the way.  I will definitely recommended their services to everyone & I will be using their services again!!", "pics": null, "resp": {"time": 1619217276326, "text": "Thank you very much. We are happy to help and are glad we where able to get your lock figure out."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "103209938140064926820", "name": "Peter M. Babnis", "time": 1622342120705, "rating": 5.0, "text": "Josh and Zack were awesome to work with. Easy to get in touch with, quick scheduling, and work was done to complete satisfaction. We’re new to Birmingham and are happy to have found Schmidt’s home services. I’d 100% recommend giving them a call and letting earn your business. We’ll definitely be working with them again on some larger projects.\n\nThanks guys!", "pics": null, "resp": {"time": 1622383806643, "text": "I'm glad we where able to be of assistance.  We pride ourselves on our customer satisfaction.  We look forward to working with you again in the future.  Welcome to birmingham We hope you like it here."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "114209927779929763129", "name": "Tennille Carter", "time": 1600910557720, "rating": 5.0, "text": "Joshua did an excellent job.  Very professional and reliable.  I live in another state so it was great to find a company I could trust to work on my rental property.", "pics": null, "resp": {"time": 1600906856722, "text": "Thank you for choosing Schmidt's Home Services.  The deck turned out great and look brand new. I look forward to any future projects you may have.  Call anytime and have a great day!\nJoshua Schmidt"}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "113226486399779629131", "name": "E F", "time": 1615404106941, "rating": 5.0, "text": "Josh and everyone at Schmidts Home Services are really fast and professional. I called same day needing a door frame repaired and blinds hung and Zach came out got the job done that very day. This was very last minute and everyone was professional and thorough.\nThank you again, great service to use I highly recommend them!!!", "pics": null, "resp": {"time": 1616029727301, "text": "Thank you..I'm glad we where able to help you out with this project. Spread the word to family and friends that schmidt's Home Services can help with all your household needs."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "115378204361100570200", "name": "J Lewellyn", "time": 1625072028645, "rating": 5.0, "text": "Schmidt’s has been very easy to work with. They worked my job into their schedule quickly. As they would complete one job, I would ask if they could do another, and they got those done, too! I highly recommend!", "pics": null, "resp": {"time": 1625073276532, "text": "We were very happy to help. I'm glad everything turned out great.  If you need any help with any future projects feel free to contact us anytime. Thank you for your business."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "111977377720279409859", "name": "Gabbi Calderone", "time": 1622752158908, "rating": 5.0, "text": "Tim was prompt, efficient, responsive, and professional.  Highly recommend! Knocked out what would have taken my husband and I probably half a day or maybe a whole day in three hours! I submitted my request and received a response instantly.  Tim was out to our house the next day and completed all tasks exactly how I wanted.", "pics": null, "resp": {"time": 1622761795354, "text": "Thank you so much for the kind words and for taking the time to do this review for us! Tim is definitely an asset to our team!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "108978733634757155129", "name": "Maria Holmes", "time": 1597687539950, "rating": 5.0, "text": "I'm a little late but a huge THANK YOU to Tim Childers with Birmingham Fast Repair for putting together our patio furniture and replacing our window blinds last month. He was very professional and a great sport dealing with the complicated patio piece we asked him to put together. We look forward to using Tim again for our future projects!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOAZbeB-d86c8yt5hoRb7veaAgH-MkOUAFScsGw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMZzjOsE78SlZBmRVOzpLWuP-eQyHtSxyhxrh8R=w150-h150-k-no-p"]}], "resp": {"time": 1597692036499, "text": "Thank you so much for taking the time to do a review Maria! We are so pleased that you had such a great experience with Tim. Please let us know if we can ever help out again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "106395817116326249386", "name": "Tiara Young Hudson", "time": 1622385928176, "rating": 5.0, "text": "The entire business model is awesome. It is hard to find a knowledgeable and trustworthy handy man when you’re new to home repairs. Our assigned handyman was everything I hoped for and he didn’t loaf on the job just because he was charging me hourly.", "pics": null, "resp": {"time": 1622824959334, "text": "Very kind words. We love it when someone notices and appreciates our unique approach! Thank you!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "111071221813907073063", "name": "Mk Rashid", "time": 1563338469012, "rating": 5.0, "text": "We have to give shout outs and thumbs up to Kyle Butler! His work has been some of the best that we've seen as far as rehabs are concerned. Kyle has Rehabbed 4 of our apartment units for us and he's about to start on the 5th unit soon. We are very excited to see his Great Work and Detail during this upcoming rehab!! We have been completely satisfied with the work that he has completed for us and we intend to use him over and over when available!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN5znmV1XUxFIFJdYTBXwQpflrSmwVhwP61IzF8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOQ1QDBaszVlsN6R23dwnfS1sD7YyidIVaXFM6x=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPKRnQdiABj9mkFZ73U_F8EYU8IergV1PGYUhy6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPFiLr0ghbyfDDtH7hZ6azGl59d0CO2bY5Y7ARL=w150-h150-k-no-p"]}], "resp": {"time": 1563378330229, "text": "We will pass along the kind words. Thank you for being such a great client. If google allowed, we’d give you 5 stars right back!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "106322434717160412099", "name": "RC and MoonPie", "time": 1621360905626, "rating": 5.0, "text": "On time, worked fast. Looks fantastic, caulked, sealed, painted, cleaned up.Totally pleased. I have found my Go To home repair company!", "pics": null, "resp": {"time": 1621435286810, "text": "Thank you! Who was the handyman assigned to your project? We want to be sure to pass on the kind words!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "117617474278687131201", "name": "Steve Casey", "time": 1621710832385, "rating": 5.0, "text": "I have used Bham Fast Repair on several occasions now. They always respond quickly, show up on time, and do good work for a fair price. I’ll continue to use them and highly recommend them.", "pics": null, "resp": {"time": 1622129538557, "text": "Thank you so much for taking the time to do this review and we appreciate your business!  We look forward to working with you again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "101778923479355537513", "name": "Beverly McCutcheon", "time": 1606377530577, "rating": 5.0, "text": "TRAVIS, I got the best finally. Gave up, looked for Gutter Repair. 8 years of misery with Gutter Company that installed never could fix. Same areas. Travis has been here several times repairs and so much more. More then I can say this man has done.Truly needed him years ago. Stopped all the problems I have had for 8 years with leaking gutters, A nightmare for me. I feel rescued. Has been so great I could never say enough about him. A really nice man too I got know well as I was out there with him showing me what was wrong and needed. So where would I be now without Travis. Another person or new gutters? First day he came I was horrified what he found. Asked him do I just need new gutters again, was worried then about the whole house. He said no, he was repairing them, I needed to see what was wrong, those areas. Travis saved me a lot money and stress I have been through with the thought of new gutters and couldn’t be repaired. I will always use him.\nI see now here too maybe he can clean them. Had no\nIdea all the other things this company can do. Will be helpful for me too. All the great reviews and I have just gotten one of them, Travis. Must be just like him.", "pics": null, "resp": {"time": 1607229157855, "text": "Thank you so much for your review! We are very pleased that you were happy with Travis and will pass that along to him!!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "110925814739244530364", "name": "Devon Rankin", "time": 1622128050091, "rating": 5.0, "text": "Hired BFP to install screens for my existing back porch. Blake contacted me the day after I submitted my request to talk through it. We communicated via text and phone after as questions came up and then Blake put together a detailed scope for the work and made great suggestions for materials to use for the job. We ran into problems sourcing the materials (very high demand!), but he kept me informed of the delay along the way and was able to begin work as soon as we had what we needed. Work was performed over a 3 day period, and Blake showed up on time and worked diligently each day. He kept me updated on his progress during the day and the end product turned out great. We can't wait to start using our newly screened porch.", "pics": null, "resp": {"time": 1622129452224, "text": "Thank you so much Devon!  We are so pleased that everything went well and will happily share your kind works with Blake!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "106605411646573617746", "name": "Lawrence Sheffield", "time": 1617126064013, "rating": 5.0, "text": "BFR is the best in the business! I wish I called them sooner. Thanks Seth and Gibbs.", "pics": null, "resp": {"time": 1617806426386, "text": "Thanks so much for the review!! We are so glad you were pleased!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "105843001202051508598", "name": "Charles Simpson", "time": 1617217545692, "rating": 5.0, "text": "Can't say enough good things about this service! They showed up, on time, the day after initial call. Tim assembled our patio furniture in just over two hours. We are so pleased. We'll never use anyone else. Thanks, guys!", "pics": null, "resp": {"time": 1617806550013, "text": "We are so glad you were pleased!! Thank you so much for taking time to do the review !"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "109464509412322114225", "name": "Bryan Ramsey", "time": 1594351495597, "rating": 5.0, "text": "About a month ago I had posted a negative review about Birmingham Fast Repair, and I'm here to say that I was WRONG!!! They were quick to respond in the most professional manner to my complaint. Seth made this matter his top concern, which every customer would want. This just goes to show the quality of customer service this group has. Seth was very apologetic (which he did not need to be) and did a fantastic job on installing my french patio doors. Seth was such a pleasure to be around. Not only was he professional, but he took time to get to know me and my family, which went beyond my expectations. His work and craftsmanship were very impressive. He definitely knows his work and set the bar very high. I could write this review all day on how pleased we were to have him in our home and his work product. I feel like I have finally found a company that I can trust to do an Honest, and PROFESSIONAL job at an unbeatable price. Seth's work has transformed our home beyond what we thought it could look like. I would highly recommend SETH and Birmingham Fast Repair for all of your projects. They will definitely be my \"go-to\" company for future projects.", "pics": null, "resp": {"time": 1594404103981, "text": "Thank you so much Bryan!  We really value our customers and appreciate that you took time to write this review for us.  We are so pleased that you were happy with the work Seth did for you and very grateful that you gave us a second chance! Please call us again any time!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "112493158752831101881", "name": "Madison Williamson", "time": 1618858000085, "rating": 5.0, "text": "We have used this company twice now- for building our deck, building our fence, and staining our deck! Great value, great quality, and very friendly staff!", "pics": null, "resp": {"time": 1619037034237, "text": "Thank you so much Madison! We appreciate that you took the time to leave us this nice review. We look forward to working with you again :)"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "111089989782510075270", "name": "Michael Forester", "time": 1605211560212, "rating": 5.0, "text": "Gibbs, from bham fast repair, repaired a fence that was damaged from Zeta. I couldn’t get any companies to call back because everyone was busy because of the storm. I ended up getting in contact with bham fast repair. They put me in touch with their employee Gibbs and I dealt with him for the rest of the project. Very efficient way to handle work especially since I couldn’t even get a return call from others. We worked out the details and it was repaired within a  week or so. He saved us money on supplies and followed through on everything he said he would do. He was even early to my house to start the repairs. No surprise charges either. Very impressive individual and company. If I ever need any other odd jobs done, I’ll definitely reach out to Gibbs and Birmingham Fast Repair", "pics": null, "resp": {"time": 1605221566485, "text": "Thank you so much for your review Michael!  We are so glad that you were pleased with the way your job was handled and with Gibbs!  Please call us again for any future needs!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "103139702407368752525", "name": "Hadden Smith IV", "time": 1604520085274, "rating": 5.0, "text": "Great company. Quality of work was exceptional and the worker we had was very professional. I'd recommend them to anyone.", "pics": null, "resp": {"time": 1604521468033, "text": "Thank you so much for your review and for taking the time to post this! Please call us again for any future needs!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "109511280557242024076", "name": "Sheena W", "time": 1589994737408, "rating": 5.0, "text": "It was a pleasure working with Chris. I live out of state and own a 4 plex. One of the units were vacant and needed some paint/drywall work before being put back on the market. Chris was quick in contacting me, quick to start and complete the job and great at maintaining constant communication throughout the project. He was very willing to go above and beyond in assisting me. He provided before and after pictures and a walk through video explaining everything so I could be comfortable with his work. I can't physically be there, so he was my eyes and brought unknown issues to my attention, which he verified with pictures. I have a property management company, but their bids were high to do some of this work, which is why I shopped around and found Birmingham Fast Repair.  They also didn't catch some of the issues Chris did. My experience leads me to believe that Chris is nothing short of honest, knowledgeable, trustworthy, and hardworking. Highly recommended.", "pics": null, "resp": {"time": 1590003136760, "text": "We appreciate your business. Thank you for the generous review!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "109053634298216774423", "name": "Karen Register", "time": 1605755212719, "rating": 5.0, "text": "Mailbox uprighted & concreted into position. Gibbs did a great job! On time, professional, skilled for job, communicated well, detailed. Thank you!", "pics": null, "resp": {"time": 1605755874249, "text": "Thank you so much for that review Karen!!! We are so glad you were pleased and will pass that on to Gibbs!!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "116495181525722011731", "name": "Joe Walker", "time": 1586277680688, "rating": 5.0, "text": "I can't say enough good things about this experience. From my initial phone call with Shannon to the finish of the job, it has been such a pleasant experience. Travis is the best! He was in constant contact with me. He was able to come do my job a week earlier than scheduled, and was able to come earlier than the appointment time. Imagine that!!! And to boot, he charged $100.00 less than the quote. He was that fast! The work looks great. I told him that I will definitely use them again in the future.", "pics": null, "resp": {"time": 1590371777298, "text": "Very kind. Thank you!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "110977379092926487321", "name": "Bradford Acton", "time": 1603311164951, "rating": 5.0, "text": "Everyone should be using this business. It's not just about the cost, or the quality, or the professionalism. More than anything else, when you use BFR you know you are going to get a quality worker, an honest person, and a company that cares about those things as it grows.", "pics": null, "resp": {"time": 1603378655852, "text": "Thank you so much Bradford!! We really try to uphold those standards and care greatly about being honest with our customers and building lasting relationships! We appreciate your kind words!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "115529207962960644094", "name": "Jeri Tanner", "time": 1592600115222, "rating": 5.0, "text": "Stephen has been to our house on a couple of projects and I can’t brag enough on him. He’s got great ideas and does fast, neat work. He has a great decorator’s eye as well as the ability to do anything with tools, seemingly. So glad we found this company and that Stephen is our Fast Repair guy.", "pics": null, "resp": {"time": 1592616623750, "text": "Love that you call him “your guy”. We hope that all our customers develop a relationship such as this. Thank you for being a wonderful customer!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104157861279324833069", "name": "Bart Slawson", "time": 1588692137334, "rating": 5.0, "text": "I had a gutter that drained poorly on top of our exit stairs. Travis came on time, very polite, did a fast accurate professional job and charged half the quote. WOW that was great. This was 2nd time I used Fast Repair. 1st time a man came out and assembled my deck furniture. He did in 30 minutes for half price! Excellent", "pics": null, "resp": {"time": 1590371800192, "text": "Thank you Bart!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "107992190039947739005", "name": "Greg Eiselin", "time": 1594519602399, "rating": 5.0, "text": "Thank you Tim Childers! He worked diligently to piece together a large children’s play-set, and our children couldn’t be happier. This would have taken me entirely too long by myself. We are grateful. We are going to utilize Tim’s abilities on another project in the near future.", "pics": null, "resp": {"time": 1594738673757, "text": "That is awesome!  Thank you so much for sharing that Greg.   We are so glad that you were happy with Tim's work and will look forward to working with you again on future projects!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104207456679163686682", "name": "jeremiah alcorn", "time": 1589392049625, "rating": 5.0, "text": "SO EASY!  Emailed pics, got a quote.  When it took less time than the estimate, he charged me appropriately!  So glad to have competent, respectable workers available for any project.", "pics": null, "resp": {"time": 1589409792819, "text": "Thank you! I will be sure to pass this on to Travis!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "116331117173878022438", "name": "Debbie Medenica", "time": 1579816928660, "rating": 5.0, "text": "The repair person contacted me quickly, and was professional, yet cordial.  I had emailed photos of the damaged item, and he was able to give me an estimate of the time/cost required.  He was even early to our appointment, but he called before he came.  He was knowledgeable, meticulous, and thorough in his work, and left the work area completely clean.  He was a really nice guy, friendly and conversant, and answered any questions I had with expertise.  I will definitely use this company again, as well as recommend them to my friends!", "pics": null, "resp": {"time": 1579821838092, "text": "Thank you Debbie. What encouraging words!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "102579978873489332139", "name": "Kim Bryant", "time": 1588970662355, "rating": 5.0, "text": "Both my daughter and I have hired Birmingham Fast Repair 3 times now. Caleb Bergmann was our technician the first time. He did such a great job we requested him the next two times. I couldn’t believe how much he got  done in just an hour. Best money I’ve spent!!!", "pics": null, "resp": {"time": 1590371860194, "text": "Thank you! We love our repeat customers!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "109943955610700496942", "name": "Jenna Zoghby", "time": 1597429879219, "rating": 5.0, "text": "Tim is great! He hung 12 pictures for me in a grid format. Made my life so much easier", "pics": null, "resp": {"time": 1597433562643, "text": "Thank you for taking time to post your review Jenna! We are so glad you were pleased with Tim’s work!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "106904868610599648993", "name": "Jhavalen Brown", "time": 1590834711997, "rating": 5.0, "text": "Tim was excellent. We could not have asked for a better handyman for our job. Everything was completed to our liking and looks great.", "pics": null, "resp": {"time": 1591898287885, "text": "I'll pass the kind words on to Tim. Thank you!!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "109083394355706721538", "name": "Jillian Thomas - HHS", "time": 1585333735663, "rating": 5.0, "text": "Great experience! Easy to communicate with, quick to respond, and even quicker to complete the work. Highly recommend! Grateful to the friends who did recommend this team.", "pics": null, "resp": {"time": 1589409828363, "text": "Thank you for the kind words!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104676247163784261207", "name": "Josh Crago", "time": 1571766197351, "rating": 5.0, "text": "Birmingham Fast Repair did a fantastic job with the long list of repairs that we had.  Luis did a great job, and works very efficiently.  I am glad that I have found my go to home improvement company for any need that arises.", "pics": null, "resp": {"time": 1571771452629, "text": "Thanks Josh! We appreciate the kind words!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104953353912519219413", "name": "Yuhua Zhang", "time": 1547524593790, "rating": 5.0, "text": "We had our porch stairs down and I submitted a request online. Blake quickly responded and scheduled time. he came exactly on the time he promised and estimated the work. He made very clear estimate and explained in detail of the job. The price is fair. Blake did an excellent job replacing the stairs, much beyond what we have expected. He handled the job very professionally and efficiently. After the job was done, he cleaned the work place and hauled away the old stairs. We are very happy to the job he accomplished. We highly recommend Blake to who needs home repairs. He is great! We thank him again for making our home much better.", "pics": null, "resp": {"time": 1547554686485, "text": "Thank you! I’ll be sure to pass along the kind words to Blake."}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "110718465641180812208", "name": "Joy Phillips", "time": 1570187948283, "rating": 5.0, "text": "We had a list of mostly small repairs to get done before listing our townhouse for sale.  Birmingham Fast Repair and Kyle Butler are such a blessing!  BFR website made it easy to get started.  Kyle made it easy to get the work finished.  We had a kitchen drawer that wouldn't close properly.  Small problem but essential to get it fixed.  Contractors weren't interested in such a small project, several \"handy\" guys looked at it and couldn't fix it.  Kyle fixed it within the first 20 minutes of walking through the front door!  From there he went to the squeak in the kitchen floor.  Fixed!  We needed new lattice panels on an outside storage closet.  Done!  Life is so much easier because of  Kyle and Birmingham Fast Repair.", "pics": null, "resp": {"time": 1570193470348, "text": "Thank you for kind words! We truly appreciate the feedback!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "118279556739034945919", "name": "David Dolinger", "time": 1555417132322, "rating": 5.0, "text": "Chris Evans was my repairman and did an excellent job.  The work was paint and repair on our chimney cap so involved climbing up on the roof, screening, caulking, and rust-proof painting.  Chris arrived on time, was very nice, and worked safely and efficiently to get the job done in a timely manner.\nWe are very happy with his work and will call again when needed.", "pics": null, "resp": {"time": 1555546428523, "text": "Thank you David. We truly appreciate the business. And the feedback!!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "108622944494082475826", "name": "Jeff Iftekaruddin", "time": 1553199350440, "rating": 5.0, "text": "The Absolute BEST!  What a pleasure to find this terrific company in Birmingham.  Each step of my customer journey was EFFORTLESS.  Seth, Shannon and Chris made my life so much easier.  Chris is an expert handyman and is as professional as they come.  If you are looking for a company that is courteous, responsive and provides stellar work, call Birmingham Fast Repair.  I will be definitely be using them in the future! Thank you Seth, Shannon and Chris!", "pics": null, "resp": {"time": 1553204951503, "text": "Thank you Jeff for the kind words! A pleasure working with you as well!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "114164332930397554177", "name": "Kaitlin Brown", "time": 1573658620995, "rating": 5.0, "text": "This is a hidden gem of a home repair service. The variety of work they're able to do is so wonderful! I really appreciate their timeliness and professionalism with each repair.", "pics": null, "resp": {"time": 1573663511354, "text": "Thank you, thank you!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "115429433027910261121", "name": "Aaron Gray", "time": 1542818900236, "rating": 5.0, "text": "Luis did a great job on the handyman tasks we've given him. He started on a fence repair and has done a number of other things around the house from painting to plumbing. Seth Corbin is also a good guy. Highly recommended.", "pics": null, "resp": {"time": 1542819868502, "text": "Thank you Aaron!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "113578171023346209645", "name": "R Thompson", "time": 1593459887465, "rating": 5.0, "text": "Tim did great work cleaning and repairing our gutters, and came out within an hour of our initial phone call. Great communication and will be happy to hire again.", "pics": null, "resp": {"time": 1593466335191, "text": "Thank you! Will pass on to Tim!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104235789980065825969", "name": "John Willard", "time": 1572968619639, "rating": 5.0, "text": "Birmingham fast repair was so great to work with. Seth and his crew efficiently fixed the problems that we faced. Can’t wait to use BHM fast repair again.", "pics": null, "resp": {"time": 1572975962504, "text": "Thanks John! Always a pleasure to work with you."}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "108783105927708742265", "name": "Bryan Ramsey", "time": 1589504623053, "rating": 1.0, "text": "It took about a month for someone to come out to do measurements (started the 2nd week of March). I was told I would be contacted 2 weeks later for an install. I understand this happened at the beginning of the COVID-19 situation and is a hard time for all of us, but I had not received any other communication or follow up from anyone. I had sent text messages on 2 occassions (a month after measurments) and no response. I'm not sure what its like in this line of work, but I was willing to spend close to $3K on the project and not a peep from anyone. This may not seem like a lot of money in this line of work, but $3K for a day or two of work I would be running to complete this job. I'm  concerned about the lack of follow-thru in communication. There are plenty of people that need work and it's disappointing to see the lack of interest.", "pics": null, "resp": {"time": 1589587480444, "text": "Bryan, I appreciate the feedback. Obviously we missed the mark on this one and I sincerely apologize. I’ll certainly look into what went wrong and make the necessary adjustments to prevent this from happening again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "117002595676189867619", "name": "Grace Willis", "time": 1535143664898, "rating": 5.0, "text": "Couldn't recommend anyone better! (Ask for Ethan!)\n\nI called Birmingham Fast Repair to book a quote and possible appointment to install a pedicure chair's foot rest at my job. They were very fast and informative to book someone for us. They sent an email with a name/photo/bio/contact of who the handyman would be. He followed up the day before and day of (before the appointment).\n\nUpon arrival he was prepared and friendly. He assessed the parts/chair and confidently installed everything exactly as needed and at a timely manner -- I commend him for agreeing to fix it, especially since he had never worked on a pedi chair (who even has?) and it's fairly complex considering there are water lines and pipes involved. He communicated everything very well.\n\nThank you for everything. We will definitely be recommending you all to everyone we can!", "pics": null, "resp": {"time": 1535152105583, "text": "Thank you for the kind words! It means so much!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "112572611943784547144", "name": "Rebecca Barganier", "time": 1581447082925, "rating": 5.0, "text": "Excellent experience. 10/10, would recommend, will use again!", "pics": null, "resp": {"time": 1581452166993, "text": "You are too kind! Thank you!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "114442721499589525966", "name": "FrostByte", "time": 1580257705020, "rating": 5.0, "text": "Did a great job hanging my tv. Was on time, professionally mannered and dressed.", "pics": null, "resp": {"time": 1580317636488, "text": "Thank you for the feedback!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "107532666962236075516", "name": "Marilyn Ireland", "time": 1547832599797, "rating": 5.0, "text": "Micah did a FANTASTIC job on my 80+ year old antique dining room tabletop.  It had been ruined years ago by a felt backed tablecloth that was ironed on while sewing.  We finally got it refinished and he did a remarkable job.  Thanks so much Birmingham Fast Repair, I will be using you again.  And by the way, the PRICE was awesome!", "pics": null, "resp": {"time": 1547860265586, "text": "Thank you! I’ll make sure to share with Micah"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "105650408963731561504", "name": "Jerry Currin", "time": 1529360739649, "rating": 5.0, "text": "Seth Corbin does excellent work!  Arrives on time, professional, yet personable.  Has the skills, tools, ability to complete the work assignment.  Spent extra time, without charge, to assure the job was completed to my satisfaction.  Seth is in my phone directory as a first call for repair/installation work.", "pics": null, "resp": {"time": 1529366785507, "text": "Always great to hear when one of our guys hits the mark!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "117012867347705376602", "name": "Sharon Wix", "time": 1534945860345, "rating": 5.0, "text": "Everything about my experience with Birmingham Fast Repair was positive. Shannon took my call, determined what kind of help I needed and promptly put me in touch with Kyle Butler. Kyle arrived on time and was pleasant, professional and efficient. I will definitely be using BFR for future projects!", "pics": null, "resp": {"time": 1534953541885, "text": "Thank you Sharon!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "103807248478057509185", "name": "slimerv", "time": 1597021643179, "rating": 5.0, "text": "Doug Sands was very nice and professional.", "pics": null, "resp": {"time": 1597025681225, "text": "Thank you so much for your review! We will make sure Doug sees it and we are very glad you were happy with his service!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "108551001163451535193", "name": "Mary McC.", "time": 1502811220355, "rating": 5.0, "text": "We are thrilled with the work this company did! They gave us an accurate estimate, showed up on time, and completed the work within the estimated time frame. They were always professional and very nice. I highly recommend them!", "pics": null, "resp": {"time": 1502815453603, "text": "Thank you! Our pleasure to work with you!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "113255318136601252183", "name": "DeeDee Barnes Bruns", "time": 1511297941059, "rating": 5.0, "text": "Jim from Birmingham Fast Repair did an excellent job installing my mailbox. He picked up all the necessary supplies, dug up the existing concrete base and installed my mailbox according to postal service standards. He was quick and prompt and professional. I will use Birmingham Fast Repair again!", "pics": null, "resp": {"time": 1512933891349, "text": "Thank you! We look forward to working with you again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "105756473975385612568", "name": "Ellason Holliday", "time": 1594742878135, "rating": 5.0, "text": "Great experience and service, would highly recommend!!", "pics": null, "resp": {"time": 1594820632897, "text": "Thank you so much Ellason!  Please call us again anytime!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "113546052482717433739", "name": "Kelley Largin", "time": 1575481827061, "rating": 5.0, "text": "Quality work. Professional and reliable!!", "pics": null, "resp": {"time": 1575912345227, "text": "Thank you Kelley!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "113447356902872101594", "name": "Clay Hubbard", "time": 1504981247297, "rating": 5.0, "text": "We had our deck replaced from Blake at Birmingham Fast Repair. He did a fantastic job, was super timely with his work, and very friendly! If you are looking for a quality job, look no further! We could not have been happier with their work!", "pics": null, "resp": {"time": 1504982071688, "text": "Thank you! So glad to here it!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "105097042115684152364", "name": "Kyle Murphy", "time": 1506963040210, "rating": 5.0, "text": "I recently had some work done to my house I just bought by Micah and I am more than satisfied! The work ranged from outdoor tree work to electrical to installing shutters and house numbers and everything worked out great. The best part of using Birmingham Fast Repair is the communication and honesty you get about the service and what needs to be done. I plan on using them again for more projects around my house and recommend to anyone in the Birmingham area.", "pics": null, "resp": {"time": 1506984760659, "text": "Thank you for sharing. We look forward to the next project!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "116487728854517195490", "name": "Lisa Muncher", "time": 1556742338290, "rating": 5.0, "text": "This company did a great job for us on the deck steps we requested. The price was very reasonable, the steps look fantastic and Brent was a great person to work with. He was quick and efficient at his work and cleaned up afterwards. Will definitely use BFR again in the future. Just a note, the fact that you can pay your invoices on line, with half up front, and use any form of payment, is a huge plus!", "pics": null, "resp": {"time": 1556760193530, "text": "Thank you Lisa. We really appreciate the feedback. I’ll pass on you kind words to Brent!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "115255608470999109324", "name": "Shannon Johnston", "time": 1471548449007, "rating": 5.0, "text": "Seth did an awesome Job fixing my daughters drawer to her dresser! I would highly recommend him for anything you may need fixed in your house!", "pics": null, "resp": {"time": 1471564681183, "text": "Thank you Shannon!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "108608701853877251285", "name": "Trudy Clements", "time": 1551216637641, "rating": 5.0, "text": "Highly recommend this company. From the first minute through completion of the job, everything was first class. Kyle did a wonderful job moving the cabinet over my cooktop, replacing the range hood and SS backsplash.", "pics": null, "resp": {"time": 1551218120636, "text": "We love feedback. Thank you!!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "113558550874110777763", "name": "jacqueline smith", "time": 1473375099385, "rating": 5.0, "text": "Seth repaired and serviced our Dyson vacuum and I could not be more pleased! He picked up and delivered for a fair price and even found a better deal for replacement filters for me!! He was very quick to respond and the repair turnaround time was super fast! Seriously some of the best customer service around - I will definitely be calling him again!!!", "pics": null, "resp": {"time": 1473375874376, "text": "Thank you Jacqueline!!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "107571316991647484041", "name": "Rae", "time": 1564124442068, "rating": 5.0, "text": "Trustworthy, friendly, and knowledgeable. The whole process was stress-free.", "pics": null, "resp": {"time": 1565091906369, "text": "Great to hear! Thanks again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "100204599229098913299", "name": "Amy S", "time": 1479496388354, "rating": 5.0, "text": "Birmingham Fast Repair did a great job in stalling a small fence and gate in my backyard. A pleasure to work with - quick responses and good quality work!", "pics": null, "resp": {"time": 1479669851257, "text": "Thank you Amy!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104937908497463699385", "name": "JJ Thomas", "time": 1488905551510, "rating": 5.0, "text": "Seth and Bham Fast Repair were very responsive. They were able to perform the work timely, at a very reasonable price and, also, at a high quality. Will call on them again.", "pics": null, "resp": {"time": 1488906407534, "text": "Very kind! Our pleasure"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "115819374549422593846", "name": "Elaina Gunter", "time": 1517943254667, "rating": 5.0, "text": "Blake with Birmingham Fast Repair was amazing! He showed up on time, was respectful, and very professional. Communication can sometimes be a hassle with certain companies but not this one. Bham Fast repair always responded to my emails, calls, and even texts in a timely manner making this project a breeze. Blake came prepared and went above and beyond for our yard cleanup. Would recommended them to anyone for ANY job! Will definitely be hiring again!", "pics": null, "resp": {"time": 1517961951075, "text": "Thank you for the kind words! We look forward to working with you again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "117716242555072450979", "name": "Cathy Alexander", "time": 1471532012663, "rating": 5.0, "text": "I was very happy with the service I received from Seth Hamby.  I needed my reclining sofa repaired.  He came to the house and repaired it there so we didn't have all the hassle of having to take it somewhere (If you have ever had a reclining sofa you know how heavy and bulky and awkward it can be to move)! I would definitely recommend calling Birmingham Fast Repair if you have any type of repairs needed around the house.", "pics": null, "resp": {"time": 1471544812251, "text": "Thank you Cathy. It was a pleasure!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "102805233915725257488", "name": "courtney callis", "time": 1617244102290, "rating": 5.0, "text": "David Moss did an amazing job putting together my furniture!", "pics": null, "resp": {"time": 1541815641526, "text": "Thank you Courtney! We really appreciate that you took time to do a review for us. Please call us again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "118369324823855483078", "name": "alan dean", "time": 1550263667162, "rating": 5.0, "text": "gutter work repairing leaks, painting the gutter elbows, replacing the splash guard, and a few incidentals - reasonable pricing, on time, personable service.  Much more for him to do!", "pics": null, "resp": {"time": 1550696944364, "text": "Thanks Alan! We always appreciate the feedback!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "103443732244359694128", "name": "Corey M", "time": 1607228413873, "rating": 5.0, "text": "Treadmill assembly", "pics": null, "resp": {"time": 1607229068956, "text": "Thank you for your review!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104852949043229895286", "name": "Luke Rabun", "time": 1504719503206, "rating": 5.0, "text": "Great work", "pics": null, "resp": {"time": 1504734544772, "text": "Thank you very much!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "113471585747440688958", "name": "T V", "time": 1614120935450, "rating": 5.0, "text": "We had gutters installed recently and because of the recent rains, we can  say they perform perfectly.\nI was very impressed from the beginning by the wonderful communication, and the team was so courteous and installed the gutters so quickly.\nThe price was exactly what we were quoted, too.\nGreat company - highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "109086463784785569749", "name": "Jay Rinehart", "time": 1611768406071, "rating": 5.0, "text": "Mark was so easy to work with by emails and responded quickly to my texts.\nI recommend Mark and his team they are the best and most respectful guys you could ask to be in your home!\nThe painters done a fabulous job along with the living room carpet and tile backsplash in my kitchen.", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "108087047251188721918", "name": "Mary Macdaniel", "time": 1612650793071, "rating": 5.0, "text": "Our service experience with all around the house was the Best we’ve Ever experienced from a remodeler/contractor, From the first apt/consult with Mark to the last bit of finishing/touch ups. Everything was perfectly addressed along the way!\nThey painted the outside of our house and replaced rotten siding.", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "106890586311497132073", "name": "JIMMY DEAN", "time": 1606882745389, "rating": 5.0, "text": "If you have needs from gutters, roofing, flooring etc you definitely need to contact Mark with \"All Around the House.\" He will come and give you an estimate which can't be beat for the quality of work they provide. They work with your schedule, work in a timely manner, strive for perfection and stay in contact to make sure you are pleased. I will definitely be using them again for future work.", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "106646528585669272561", "name": "Katherin Watkins", "time": 1611256877841, "rating": 5.0, "text": "Mark was very precise and knowledgeable of our roofing and gutter issues. The guys done a magnificent job, where polite and professional!\nI will definitely use your services again.", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "104872556878519765225", "name": "Danielle Fife", "time": 1612469459507, "rating": 5.0, "text": "All around the house did a outstanding job on our gutters and downspouts they look flawless!\nMark arrived to give the estimate and it was dry that day but he was on point as he explained where we would an could have water troubles with draining issues by the layout of the landscape an he was on point as we’ve seen the same issues on rainy days.\nThe crew he sent was a pleasure to work with, hardly even knew they was outside.", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "110196134635487184845", "name": "Jacob (Jake) Wilson", "time": 1599934811262, "rating": 5.0, "text": "Quality service! We needed gutters on the back side of our house and reviews were good for All Around The House, so we decided to contact for an estimate. Mark came out while we were away and gave us an accurate estimate for lower than we were thinking, so we booked a time for him to come out and install. We only needed a small amount of gutters, but Mark and his team came out and completed the job within a couple of hours with no problem. We will definitely be using them again for any more house projects!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "102457909495327289216", "name": "Pam Jones", "time": 1598478544340, "rating": 5.0, "text": "I cannot say enough good things about All Around The House. I was in need of someone to assemble two pieces of furniture and did an internet search to find someone in my area. I found All About The House, left a voice mail, and within minutes Stephen returned my call. Luck was on my side as he had some time that same day to help me out. He and Kayla arrived on time, and they quickly got to work assembling the furniture. They worked fast but did a very thorough job, even disposing of the boxes and trash after completion. They were friendly, capable, and the price was very fair and reasonable. You never know what you are going to get when you blindly reach out to someone, and I could not be more pleased with my experience with All Around The House. I highly recommend them for your home needs!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "111801322851991882012", "name": "Paul Fife", "time": 1610826955590, "rating": 5.0, "text": "They did a beautiful job with my house I had them paint inside and outside I will have them come back and do more work for me very soon", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "104485073363229503565", "name": "Julie Evelsizer", "time": 1597167913896, "rating": 5.0, "text": "They were very responsive. They gave me a similar estimate to another company, who never bothered to come back, but with a lot more work for the same price. The crew was quick, neat, and professional. I had them screen in a small patio and paint the walls, and it looks wonderful.", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "115817870061179007976", "name": "Barry Roberts", "time": 1611270404071, "rating": 5.0, "text": "I would highly recommend All Around the House and Mark. They were incredibly responsive, professional, and completed our project in a timely manner!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "101103889866597380656", "name": "Lacie Tidwell", "time": 1607619102772, "rating": 5.0, "text": "For any type of home improvement are gutters I would definitely recommend marks all around the house business they are very much professional and do a great job without breaking your bank", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "104962958402611069146", "name": "Steve Welch", "time": 1591965162036, "rating": 5.0, "text": "I had them do 3 projects for me.  Install gutters, make a gravel bed around pool pump, and lay down new sod. Every job was done professionally and in a timely manner. The quality of their work is fantastic! Their communication is top notch as well. I will definitely use them again in the future!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "103546752686392451515", "name": "Brandon Miller", "time": 1588914638901, "rating": 5.0, "text": "I’ve been looking around for a company to put up gutters on a fraction of my house. No other company has been responsive like mark and his crew have been. Communication was great. They were able to do it next day while I was work. The gutters matched my trim perfectly and was given some advice from mark on solving water build up in the back yard. I would definitely recommend this company for gutter installs.", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "107928841594188958772", "name": "Roger Grubbs", "time": 1610826099959, "rating": 5.0, "text": "I just got a fixer upper and the guys did a wonderful job", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "118417198529158657511", "name": "Stuart Hartley", "time": 1600207219685, "rating": 5.0, "text": "They installed my gutters the day after I called them, and were very prompt and professional. They look great! Thank you for the good work!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "103177984343164499808", "name": "Lisa Parks", "time": 1611768733594, "rating": 5.0, "text": "Great job, All Around The House, I couldn’t be happier with the final results of our painting and gutter projects!\nSoon to have them do some interior painting.", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "106971741964592824904", "name": "Pam Phillips", "time": 1592602783232, "rating": 5.0, "text": "We are very pleased with having our house painted by All around the house guys.  They were very prompt and dependable and their end result of painting our house is awesome!  We highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "100304401404067811830", "name": "James Shirley", "time": 1588534958747, "rating": 5.0, "text": "Mark and his crew came to my home a couple  of weeks ago to install new gutters on my home. They did a great job in a reasonable amount of time. They were very kind and respectful. Use these guys if you need gutters , I promise you won’t regret it.", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "114024280777849276243", "name": "Charles Edwards", "time": 1604598970902, "rating": 5.0, "text": "Did an awesome job for us with maintaining landscape, yard cutting and gutter repair", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "102024531488103190487", "name": "Scott Eric", "time": 1610825724246, "rating": 5.0, "text": "These guys are amazing would highly recommend", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "112881813962884841273", "name": "Hamilton Phillips", "time": 1584561866303, "rating": 5.0, "text": "Mark and his crew were so kind and extremely fast and professional on the job. After getting the measurements and thanks needed for our job it was done extremely fast. You wouldn't have even noticed that they were there.", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "112321568542501349507", "name": "Jmea Maddox", "time": 1575921906481, "rating": 5.0, "text": "I highly recommend that you give them a call. Im not sure that there is anything they cant do . Mark has been helping with our rental property repairs,remodeling  and painting needs for roughly 18 years. Its been a pleasurable experience!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "100343268948102120439", "name": "Cedric Clancy", "time": 1583697426948, "rating": 5.0, "text": "The workers showed on time and were very professional. The quality of work was that expected from true professionals. I would definitely recommend them to anyone looking for quality gutters. Mark promised he could fix our water troubles with gutters and that he did !", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "101872328725109293590", "name": "John O'Mahoney", "time": 1584377897474, "rating": 5.0, "text": "Superb service. Excellent response to any queries. Will be using again for other services!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "112243676005529831095", "name": "Johnmesha Mayhew", "time": 1561836342901, "rating": 5.0, "text": "The crew did a fantastic job on our roofing repairs & the rotten wood around our eves. They installed new ridge caps & vents for the attic to breathe better. Hoping for lower number on the light bill 🙌😀", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "102781459439909922862", "name": "Rita Patterson", "time": 1587570372937, "rating": 5.0, "text": "I am sorry to be so late in giving this review. I called on March 2nd for someone to give us a quote on gutters. Mark called and came out and measured and gave us the estimate which was accepted.  There had been a lot of rain and thought we would have to wait. On March 9th in between rain Mark texted to say they were on there way.  Very professional.  I love my gutters.", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "102783245994113648666", "name": "Vlog Vloger", "time": 1585347566781, "rating": 5.0, "text": "The workers showed on time and were very professional. The quality of work was that expected from true professionals. I would definitely  recommend them .", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "111123190978677472638", "name": "Gillian Shapiro", "time": 1553727811915, "rating": 5.0, "text": "These guys are great- quick to start and finish a project, fair pricing and quality work.  We've used them for a number of projects and they never disappoint. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "105013206147584470932", "name": "Kristen Edmondson", "time": 1561797040392, "rating": 5.0, "text": "Highly recommend this company to anyone. Had new flooring and carpet done in our home and it was better than imagined. Job was completed on a timely manner.", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "115363923725064147869", "name": "John Wilson", "time": 1584567647880, "rating": 5.0, "text": "The job is done good from the estimate to the installation to the payment was no hassle would recommend him to anyone", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "117974052525042261041", "name": "Lana Kizziah", "time": 1583613287150, "rating": 5.0, "text": "Mark has done three jobs for me. Each situation was handled in a timely manner with utmost professionalism.", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "104468815349837969120", "name": "Kayla Hall", "time": 1562127663969, "rating": 5.0, "text": "Stephen and his guys have been servicing my yards needs for the past 8 years from landscaping, lawn care and trimming of hedges.  nice... job!!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "105105646984059388307", "name": "Alisha Clancy", "time": 1561445517357, "rating": 5.0, "text": "We are very happy with our exterior painting job, they even installed new weather stripping around both doors at no charge .", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "104293505322153482105", "name": "roxana quarles", "time": 1561447726616, "rating": 5.0, "text": "All around the house as done a lot of repairs and landscaping for us for the past 10-12 years , always reliable, quality work , will not use anyone else  !", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "112912475434877245101", "name": "Nikki Pater", "time": 1539167594717, "rating": 5.0, "text": "All around the house is a great company. They are very professional and do an amazing job with everything they do! I would highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "112131510026766995142", "name": "Silvia Repetto", "time": 1440268459277, "rating": 5.0, "text": "Very professional and reliable guys. They have been doing my yard for over 3 years and have done a wonderful job. Today they cut down 2 dead trees very neatly and skillfully. Great Job!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "109360218215908028888", "name": "Lisa Rinehart", "time": 1450632332452, "rating": 5.0, "text": "They painted the exterior of my house, replaced rotten wood around garage doors and windows, installed seamless gutters an downspout. The crew was very professional and there work ethic was exceptional!!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "112423536692798610878", "name": "Robert Hall", "time": 1562128633597, "rating": 5.0, "text": "We was thrilled to find these guys, phone call after phone call to try to get a Handyman out to look at our repair issues the crew Mark sent got everything all fixed up within a days time. Thanks guys!!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "103544769174640502965", "name": "Scotty", "time": 1552665014100, "rating": 5.0, "text": "From yardwork to roof repair, they have always done a great job and go above and beyond.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "116610523499014024623", "name": "Just KOOP", "time": 1437423480083, "rating": 5.0, "text": "Excellent company to deal with! Great work on top of a good affordable price. I know who I'll call from now on, my house looks amazing!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "100663640848953319229", "name": "Mike Swindle", "time": 1556748848043, "rating": 5.0, "text": "I’ve used them several times. The most recent job was priced with several options and once I decided on what options I wanted, they scheduled the work and was only delayed by the weather. Nice job!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "106654361499828078745", "name": "Doris Weathers", "time": 1437424469283, "rating": 5.0, "text": "I needed the exterior of my home painted badly and out of everyone I called, you guys had the best price. Would definitely deal with again, you did an amazing job. Couldn't be happier!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "102330885674279359257", "name": "Chris Hannon", "time": 1546496732937, "rating": 5.0, "text": "When I needed some new gutters on my house, I called All Around The House and, \"Wow,!\" am I glad that I did! Their entire crew was neat, skillful, and courteous - everything that you could ask for and more!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "105693254873323251256", "name": "Kathryn Edwards", "time": 1583526038904, "rating": 5.0, "text": "After one year of shopping around with one delay after another from multiple  companies to have gutters installed on our house on Livingston I called Mark. He and his crew was very professional. I would call on him again if the need arises.", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "112417134234937908530", "name": "Aleshia Mclain", "time": 1561261511792, "rating": 5.0, "text": "Mark and his crew did a FANTASTIC job!!! Love my new addition!!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "110846412834975069348", "name": "Jason Dial", "time": 1500501951115, "rating": 5.0, "text": "These guys did a spectacular job. Very satisfied. I highly recommend them for anything you need.", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "112703206592513089396", "name": "Jody Prescott", "time": 1583047841451, "rating": 5.0, "text": "Completely satisfied with our experience!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "110457152238957350145", "name": "Kristen Akins", "time": 1438795490247, "rating": 5.0, "text": "From start to finish my experience with All Around the House was excellent. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "118132910712219844166", "name": "Shaina Boo", "time": 1486427097737, "rating": 5.0, "text": "I was very pleased with my experience with Mark and the crew that he sent to our house, from start to clean up!! Excellent service!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "115937575270344792491", "name": "Jason Polancich", "time": 1523894367956, "rating": 5.0, "text": "Have had a terrible time finding quality, responsive landscaping in Tuscaloosa. These folks came right out, estimated the work and gave us a price/set a schedule before they left. Having talked with half a dozen others, I think they may be the only landscapers in town running a professional operation. Sad, but true from my experience this year.", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "103899516134736636944", "name": "Heather Duke", "time": 1435602410545, "rating": 5.0, "text": "fantastic work!! reliable and friendly!!! exceeded my expectations!! will definately use them again!!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "101172981753884811027", "name": "Bob Loblaw", "time": 1587998179109, "rating": 4.0, "text": "Good for bigger jobs.", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "112206137022382552494", "name": "Danielle Farah", "time": 1570214952309, "rating": 5.0, "text": "Great!!!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "107637275561313351174", "name": "Quistina Black", "time": 1456880692615, "rating": 5.0, "text": "Excellent coordination and communication!!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "113020428739871286896", "name": "teraka jones", "time": 1563736341644, "rating": 5.0, "text": "Excellent!!!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "117479730440345925309", "name": "Tiffany Grimes", "time": 1438359264852, "rating": 5.0, "text": "Great group to deal with!!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "105521769002311428262", "name": "Caston Griggs", "time": 1510354783797, "rating": 5.0, "text": "Very professional and great work", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "116207474322480448236", "name": "Madison Bentley", "time": 1486368333301, "rating": 5.0, "text": "Great group to deal with!!!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "111291378090080885720", "name": "Torkeisha Williams", "time": 1450479470249, "rating": 5.0, "text": "Awesome!!!", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "107991631780821927289", "name": "Jennifer Clauson", "time": 1450423922475, "rating": 5.0, "text": "Excellent workmanship!!!!!! Highly recommend", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "117658397544749790599", "name": "Crystal Harland", "time": 1439012224528, "rating": 5.0, "text": "These guys were very professional and friendly.", "pics": null, "resp": null, "gmap_id": "0x888601eaaaaaaaab:0x74e4097e1531c40b"}
{"user_id": "103405989372892064958", "name": "Blaqheart (xblaqspen)", "time": 1553798537066, "rating": 3.0, "text": "Visiting with a friend who was service shopping for best deal.", "pics": null, "resp": null, "gmap_id": "0x88861cb5dbdfe0bf:0xc4495bd10ea3248d"}
{"user_id": "103085355522535107637", "name": "Gregory Butler", "time": 1526160612187, "rating": 5.0, "text": "Goodness gracious...", "pics": null, "resp": null, "gmap_id": "0x88c2b204a8ccb179:0x4c4dcf5c50cedf59"}
{"user_id": "102888386969792037681", "name": "Nick Kuntryham", "time": 1599838256203, "rating": 5.0, "text": "Jon was very professional and helpful. His price was great for what was asked of him. Will use again.", "pics": null, "resp": null, "gmap_id": "0x888a7825cd52f7c7:0x3d711a8261039b82"}
{"user_id": "116626745452803937441", "name": "z ten", "time": 1532557234851, "rating": 5.0, "text": "He did a wonderful job and was one of the kindest people I've ever met. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888a7825cd52f7c7:0x3d711a8261039b82"}
{"user_id": "107201341493675436396", "name": "Chris S", "time": 1607894919177, "rating": 5.0, "text": "William did an awesome job painting our entire house's exterior. Even though we surprised him with a last-minute change in the main color choice, he was able to help us pick a new color that fit within the original budget and still looked great. It really changed the house's look for the better! His attention to detail and careful prep work ensured that everything came out looking as best as possible. Would definitely work with him again.", "pics": null, "resp": {"time": 1607895706673, "text": "Thanks Chris!"}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "102635029809824525762", "name": "Tajale McClam", "time": 1601429116622, "rating": 5.0, "text": "William did such a fantastic job on painting two of my bedrooms as well as my ceiling. He did an accent wall to each room and they both look absolutely amazing. He is very professional and his work is very superb. My ceiling was very hard to paint. It is a popcorn style ceiling. He really wanted to make sure it was done right and paid great attention to detail.  I was very pleased with the results. I look forward to using him again. Thank you!", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "106720207921957234165", "name": "Adrian Brown", "time": 1600623574870, "rating": 5.0, "text": "William painted our interior - in hard to reach high places, and ceilings, and some dry wall repair. He did an excellent job and cares about getting the job done right, does not cut corners. He was a great find and will use him in the future and have already recommended to others!", "pics": null, "resp": {"time": 1600627318663, "text": "Thanks Adrian! Enjoy the new colors."}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "114570658738051028416", "name": "Ming Sun", "time": 1617831523108, "rating": 5.0, "text": "Great work with very reasonable price done in 2017!", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "110066629227037526875", "name": "Kathy Gereski", "time": 1600017089963, "rating": 5.0, "text": "William did an exceptional job power washing our driveway, sidewalk, back porch and steps. He also repaired drywall in our basement and painted all of our exterior railings that were showing wear after 8 years.  I highly recommend his services.", "pics": null, "resp": {"time": 1600020767878, "text": "Thanks Kathy."}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "113717490511225147937", "name": "Avery Nagata", "time": 1601591600492, "rating": 5.0, "text": "William power washed and stained my fence. It took him less than a week to finish it. He was super responsive and very professional.", "pics": null, "resp": {"time": 1601597320549, "text": "Thanks Avery. Enjoy it"}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "107992931084418505572", "name": "Jason Freeman", "time": 1572112176197, "rating": 5.0, "text": "Performed an entire interior painting.  Excellent quality.  Great attention to detail.  Takes pride in doing it right.  I would highly recommend this company.  I would hire this company again for the same job and will consider them for more jobs in the future. Very satisfied with the finished product!", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "111295191319822859862", "name": "Susan Bachle", "time": 1566930070042, "rating": 5.0, "text": "Wonderful experience!  I had just purchased a new home and hired William to repaint the entire house.  He did a fantastic job at a very reasonable price!   Everyone that comes into my home comments on how precise the painting is - which speaks volumes!", "pics": null, "resp": {"time": 1566931460371, "text": "Thanks Susan. Glad I was able to transform your new home. Enjoy it!"}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "116968192793239162521", "name": "Jessicalynnsman Hardy", "time": 1486832210637, "rating": 5.0, "text": "This painter is HIGHLY RECOMMENDED. He truly stands behind his work and gets the job done. Very satisfied with the work he did in our house. I would definitely use his services again. I promise I will get the good paint next time though. Thank you William for a job extremely well done.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "111597922471708172223", "name": "Archella George", "time": 1463363082951, "rating": 5.0, "text": "William did an awesome job painting two rooms in our new home! We hired another painter to paint our nursery and not only was the job not satisfactory but the color was too dark for a nursery. William came in and repainted the room and we love it!! He also painted our office for us as well! He was was very detailed and clean and quick! Would definitely recommend him and work with him again!", "pics": null, "resp": {"time": 1464409535124, "text": "Thank you!"}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "100501390529140460568", "name": "Mich S", "time": 1473128750569, "rating": 5.0, "text": "William painted the inside of a house I'm putting on the market and did a fantastic job. House looks wonderful. He patched several rough spots and a crack so well that you couldn't tell they existed. He was neat while doing his work, and he cleaned up after himself when he was done. He also pressure washed my fence (looks like new and I was gobsmacked at how good it looked) and painted my front rails and back deck. I would highly recommend him and do plan on using him again.", "pics": null, "resp": {"time": 1473130846368, "text": "Thanks for the kind words and good luck with the sale!"}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "104064375591025959776", "name": "Christopher Lawson", "time": 1530976561111, "rating": 5.0, "text": "I've had my whole house painted, but the room this company did for me was superior and excellent. I wish I had hired them for the whole house and will be hiring them in the future. They were friendly, responded to my questions in a timely manner, and were reasonably priced. They worked me into the schedule in a very timely manner as well.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "104880882379355850379", "name": "Daniel Lewis", "time": 1456762148052, "rating": 5.0, "text": "William did a great job painting and pressure washing for us. The paint makes our interior look so much better! Our fence and deck look brand new! He was able to get us on the schedule quickly and went above and beyond to help us meet a deadline. I highly recommend him!", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "114786564483144362565", "name": "Emily Pauli", "time": 1483754892987, "rating": 5.0, "text": "William painted two rooms, trim, and repaired and painted what I thought was a dry wall ceiling but was the original 1946 plaster. He did an amazing job on all of it!!!  He is professional, very neat, and cleaned each evening and at the ending the job.  Even with the unexpected plaster on the ceiling, William finished on time and budget!  His skills and attention to detail are exceptional. I will use him again - the outside needs an update when the weather warms.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "108586724734828739774", "name": "RUTH RICHI", "time": 1481059211248, "rating": 5.0, "text": "Very professional, reasonably priced. Beautiful work, very neat and clean. Our home needed a lot of caulking, nothing was missed. The paint job is beautiful. I am very satisfied and will call him back the next time I need a painter.\nOz and Ruth", "pics": null, "resp": {"time": 1481064850086, "text": "Thanks for the kind words guys. I enjoyed watching your house transform.  Great customers!"}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "108736025073883773521", "name": "Belinda Wolfe", "time": 1435331559873, "rating": 5.0, "text": "I was very satisfied with the work that William of Color Life Painting provided. His work was very high quality and done with in the time frame given. He replaced and painted rotten siding, replaced and painted some eaves and built a lattice panel. He also painted windows, steps, and garage etc. His prices were very reasonable and He was very professional. I would highly recommend using his services.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "102103611698318318790", "name": "Alex Britt", "time": 1463622685082, "rating": 5.0, "text": "William was way more than impressive. He was professional, timely and his skill set really exceeded are expectations. He painted our front door, half bath and a few accent walls. He will definitely be our choice for our next project!", "pics": null, "resp": {"time": 1464409480166, "text": "Great Customers, Enjoyed the work."}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "106203523501962384497", "name": "Lisa Carter", "time": 1433116926446, "rating": 5.0, "text": "William did an outstanding job repairing my screened porch. Also he pressure washed the siding on my house for the most reasonable rate I'd found!  Excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "104637731270475855669", "name": "Arielle Cain", "time": 1484360714980, "rating": 5.0, "text": "William did a phenomenal job on our nursery. He was super polite and informative during our inital phone call. After talking about what we needed done, he accommodated our schedule by coming a day in advance and picked up the paint for us. When he showed up at our home, he was everything he portrayed via our phone calls. A very trustworthy and personal guy. And not only is he the kind of painter that you feel comfortable leaving alone to paint, he does an incredible job with his attention to detail. We recommend using William for any paint job and will be using him to finish our home in the near future!", "pics": null, "resp": {"time": 1484367899377, "text": "Thanks very much for the kind words.  Enjoyed meeting you and looking forward to the future work!"}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "102287906250692812179", "name": "John Klingel", "time": 1512932234181, "rating": 5.0, "text": "William did a fantastic job at a GREAT price and held schedule.  He worked with us and was flexible.  We would certainly recommend him for your painting needs.", "pics": null, "resp": {"time": 1512933077728, "text": "Thanks John. Enjoyed the work! Nice to meet you guys."}, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "103755464699806227776", "name": "Chris Helton", "time": 1453915608845, "rating": 5.0, "text": "William did a great job. He has a unique approach to business.... He shows up when he says, and charges the amount that he committed to. Weird concept, but worked pretty well for me!\nHe painted my deck, handrails, and concrete floor and I was very satisfied. I will use him again.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "107760606175945116091", "name": "Tom Byrne", "time": 1432936336749, "rating": 5.0, "text": "William did a GREAT job. Lots of attention to detail, very neat. Completed the job ahead of schedule. Did I say he did a GREAT job AAA++", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "111710700697882384233", "name": "Meghan Darby", "time": 1474312141886, "rating": 5.0, "text": "William painted the trim, interior walls, and ceilings of our new (older) home. He was expertly meticulous and all finishes were perfect. We could not be more pleased with the outcome. He also stuck to our timeline, budget, and was extremely trustworthy.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "111598096345510143650", "name": "Darrell Stokes", "time": 1437078637419, "rating": 5.0, "text": "William has painted a fence, bedroom and bathroom for me.  His prices and especially his quick response and flexibility has allowed me to finish some jobs around the house in a minimal amount of time and cost.  He has always been quick to give me an estimate and even quicker to get out and get the work done.  I will be using him again!", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "116993977556717171688", "name": "Matt H", "time": 1435198033505, "rating": 5.0, "text": "Great job staining my deck! Great attention to detail.  Would definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "105665867873962940163", "name": "Hal Wilson", "time": 1432939792135, "rating": 5.0, "text": "William: hard worker, and went out of his way to be helpful. The paint job on the side of the house? You've only gotta ask the neighbors. Plus, plus.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "107428630824410232121", "name": "Jerrell Reynolds", "time": 1441281384636, "rating": 5.0, "text": "Our eves on the house were peeling really bad. I called William and he was able to come out at MY convenience and take care of them. he went the extra mile by scraping off all the old paint to prevent it from peeling again. William did a great job and at a great price. No paint in places its not suppose to be and real clean lines. Rain came in but he came back out on the next day when there was no rain and finished the job. He did such a good job we had him paint our garage door while he was there. defiantly calling him back to do our fence in the near future. A+ job and very professional guy.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "111069269092817540180", "name": "Marsau Scott", "time": 1477600889546, "rating": 4.0, "text": "I have had the pleasure of dealing with the owner today. He and I didn't see eye to eye at first, we both communicated our frustration, and in the end we resolved our differences in a healthy manner. People and businesses make mistakes but the mark of a true businessman is how he/she is accepts responsibility for their actions and continues to make positive changes.\nThank you William, I look forward seeing your company progress.", "pics": null, "resp": null, "gmap_id": "0x886212ca0fc597b9:0xea585f76853866fe"}
{"user_id": "102647191455256510999", "name": "Rod Montrose", "time": 1610039643799, "rating": 5.0, "text": "Steve and his crew are great to work with. We've been trying to get our house repaired after Hurricane Sally and never could get a construction person to commit to repairing our house, 3 months after the hurricane. Steve was working next door and the homeowner was very satisfied with his work, so I contacted Steve. He gave me a date when he could start and he started on that date. His guys worked very quickly and repaired our ceilings, flooring, and drywall, along with other touch-ups after the storm. During the work, he communicated with me every day with the progress and included pictures at milestones. They completed when expected and cleaned up, and the project came in at the estimated amount. I would highly recommend Best4Less Handyman Services.", "pics": null, "resp": null, "gmap_id": "0x889a0b3668790e43:0xdfa26a8d99d44961"}
