{"user_id": "110055946275116827121", "name": "Jennie Ward", "time": 1615854710613, "rating": 1.0, "text": "I was very disappointed with the store manager’s attitude while looking at my name brand handbags that I brought in for sell. She was extremely nit picky at each one and turned them down for in store purchase. Needless to say I will not be returning for future sales of my items.", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "101015600205682096252", "name": "Kira Lunsford", "time": 1592450716845, "rating": 1.0, "text": "if i could rate this store zero stars i would.. this place is terrible do not go here the staff is mean as hell. Just a quick story so you can get an idea of how they are here.. I remember one day i went there and the store wasn't set up to close till 2 hours later and there was no sign on the door saying they were closed. So i thought it was fine to shop there.. oh but was i wrong...  so i walked up to the door and tried to open it ( mind you the lights are on and i see employees in there. As soon as i tried to open the door they hurried and turned off the lights and ducked as if i didn't see them... so unprofessional and inappropriate. When i came back a week or two later the lady at the cash register when i brought it up acted as if she didn't know what happened. what a disappointment.", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "116776078166509691263", "name": "makayla wise", "time": 1613062357492, "rating": 5.0, "text": "Great place to shop and sell clothes 10/10 recommend", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "100988314650789090882", "name": "Anna Ison", "time": 1617111783169, "rating": 1.0, "text": "The older lady is super rude! I almost walked out and said I would sell my clothes somewhere else. Shoot I’ll even spend the time to poshmark my items. I will not be back!", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "114131775860968512889", "name": "Tori O'Bryan", "time": 1594939388191, "rating": 1.0, "text": "No one greeted me when I walked in the store. The girl at the cash register seemed extremely upset that I was dropping off clothes. An older lady told me I have to come back in an hour and they will not call me to remind me. Which is totally fine, but the way she said it was rude. When I came back to receive the offer of cash or store credit the same girl at the register mumbled the offer and I couldn’t hear her. I asked her to repeat, and she said it with even more of an attitude than the first time. She told me what they didn’t accept I could pick up “over there” not giving any instruction on where that would be. My husband and I walked around the counter looking for my items and could not find them. We asked her, “where are they?” And she acted like she didn’t hear us. So we just left. Whatever they didn’t take, they can have. Extremely unprofessional and I will not be back or recommend anyone else to do business with this company.", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "107307948675437735475", "name": "Bay Wilk", "time": 1601597425704, "rating": 1.0, "text": "I went to this place today. Found a cute dress and wanted to get it,  but there was a hole in it they were unaware of. I asked if she could take less for it, she said no not without managment.  I finished shopping and was fixing to ask her is there any way she could call her manager and ask, since I live in Florida and couldn't come back if she would take extra off, and before I could finish my sentence when I was at in there any way, she cut me off abruptly and said NO MAAM I CANNOT.  I was rather shocked. She clearly was rude, didn't listen and could care less. The manager is Kim and I plan to let her know. This was about 430pm.  If you want better customer service  and cheaper prices go to the one over by walmart at the north end. It's much better.", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "103299074953498426039", "name": "Alisca Simpler", "time": 1611441312610, "rating": 5.0, "text": "Great finds for my teenage boys", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "113071255000275054105", "name": "A. H.", "time": 1568417395236, "rating": 1.0, "text": "Their name describes this company perfectly, cheapskate[s]. I understand you do not get your money back for your old clothes at places like these, but they give you $1-$3 for something they go back and sell for $12.99-$19.99. Not to mention, the rude attitudes the workers give you.", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "105092051115535936562", "name": "Madison Burlison", "time": 1574632497147, "rating": 4.0, "text": "It is a really nice place to shop for nice but not too expensive clothing. I would not recommend trying to sell your clothes to them. When I tried you could tell that the employee didn’t even bother looking in my bag to see what I had.", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "106121002086594545754", "name": "M", "time": 1579724022555, "rating": 2.0, "text": "Don't waste your time trying to sell. Perfect place to shop and the two times I've been there the ladies were friendly. But..i had a whole basket full of clothing mostly items that were given to me so not a huge deal that i have to now donate them but what frustrated me was the only 2 items she took was a North Face hoodie and a Browning hoodie...which i only got 7 something for both; that is being a cheapskate. The worst part is i live an hour away in a tiny town so this is one of my only options other than trying to sell on my own.", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "114338413670142636039", "name": "Mitch Savini", "time": 1582399679260, "rating": 5.0, "text": "Just like when I sold cars...everyone thinks that their car is valued like a Ferrari...when people say..my shirt was only used once...or my purse cost me $400...it doesn't matter...IT'S USED....no one knows whether it was used once or 100 times...and the other is I brought in items with the tags...once again it's still a USED item because UC cannot sell it as a new item...UC is one of the cleanest and well organized stores in the area and is head and shoulders above Plato's Closet", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "105420089334208906629", "name": "Coryn Turner", "time": 1584129644406, "rating": 1.0, "text": "Employee talked on the phone while checking out my clothes making it take way more time than it should have to check me out. Not to mention both the employees had bad attitude.", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "113993053330662019256", "name": "Kei Bottoms", "time": 1558268573281, "rating": 5.0, "text": "First time visiting and wish I visited sooner! Not sure why 2.5 stars? Very organized and decent size store! Will be back again before we leave the area.", "pics": null, "resp": {"time": 1560195002558, "text": "thanks"}, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "103420254019721023778", "name": "Chris Mendez", "time": 1504204648598, "rating": 5.0, "text": "Great place to shop, guys or girls. I buy a lot of my dress shirts and dress pants for work here and save a TON! My wife loves all of the name brand clothes, shoes and accessories...and yes I do love that she saves a ton as well. The staff and owner are always super sweet and helpful. SO... if you want to wear name brand without breaking the bank then Uptown Cheapskate of Dothan is your one stop shop!", "pics": null, "resp": {"time": 1504290314486, "text": "THANKS"}, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "105155927700994275483", "name": "Benjamin Garrett", "time": 1598991935016, "rating": 1.0, "text": "Overpriced average clothes, can’t even get your money back, only store credit", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "111096539563990868618", "name": "Lynda B", "time": 1565459101048, "rating": 5.0, "text": "The store really improved. Two young ladies with black and blonde hair were very helpful today. Will be bck", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "110940544931946392686", "name": "Space Navy", "time": 1576167003049, "rating": 1.0, "text": "Small, overpriced selection of average at best clothes. Extremely picky (to a fault) with purchasing clothes.\n\nDo yourself a favor and go to American Thrift across the road. They have more items for better prices.", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "106726991322666015532", "name": "Lindsey", "time": 1523745430549, "rating": 5.0, "text": "I loved the selection!! Definitely a recommended place to go! There was something for everyone. I thoroughly enjoyed shopping there. ♥️♥️", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "106726991322666015532", "name": "Lindsey", "time": 1523745430549, "rating": 5.0, "text": "I loved the selection!! Definitely a recommended place to go! There was something for everyone. I thoroughly enjoyed shopping there. ♥️♥️", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "118307439599344619200", "name": "Sidney Dockery", "time": 1530158220690, "rating": 1.0, "text": "I went in to sell my clothes only to be told that it would be hours before i could be helped because she had “other things to do”. I would think that the ONLY IN STORE customer willing to do business is more important. Employees were uninterested and unwelcoming; they seemed annoyed with every customer that came in. Definitely will not be back.", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "108001814524296906882", "name": "Kenisha b", "time": 1560022307285, "rating": 1.0, "text": "A bunch of teenage snobby girl discussing graduation photos instead of properly explaining policy. I walked away feeling ripped off.", "pics": null, "resp": {"time": 1560194975554, "text": "I'm sorry u feel that way but our employee did tell u either store credit OR cash. We couldn't give u both offers. You have 14.51 store credit good 3 years, I do hope that you give Uptown the opportunity again"}, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "101261543288026173018", "name": "Crickett Whiddon", "time": 1504218384318, "rating": 5.0, "text": "Awesome place with awesome people working there!!! They always have the best selection of the cutest clothes and accessories!! I can't say enough good things about this amazing store!! Take your clothes that you don't wear anymore and they will give you a very fair price also!!", "pics": null, "resp": {"time": 1504290259304, "text": "THANKS"}, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "105171772222703957799", "name": "Brenda Starboard", "time": 1597882707859, "rating": 5.0, "text": "Name brand clothing for the lo.lo.", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "103038202370960856330", "name": "Brittney Pettis", "time": 1507424984330, "rating": 1.0, "text": "I wanted to sell some items before leaving town, so I took a basket full of clothes over on a Thursday afternoon at 4:30 PM and the girl behind the counter told me they weren’t buying clothes anymore that day because the (1?) person that buys had left already, so I had to leave my basket until I got back into town one Saturday. When I got to the store on Saturday around 5:45 PM two girls were behind the counter. I gave them my name and they pulled two items out of a black bin and I inquired about the whereabouts of my basket and the other clothes. The girl replied, “they’re over there,” and asked the other girl behind the counter to process my buy so she could go be on her phone. Once the buy was processed and I got my money, I waited a few minutes for one of them to get my items they didn’t buy. They didn’t, so I asked if I could have my basket. The girl who was on her phone said ambiguously, “they’re over there,” and pointed haphazardly towards a wall and went back to her phone. I found my items and left. This customer service is unacceptable and disappointing. I’ll be taking my business to Plato’s.", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "108486423666839834168", "name": "jeff martin", "time": 1549754745260, "rating": 1.0, "text": "This place is a joke! I went in to sell some lightly used and some new boutique clothing and a few designer purses (one that has never been used) and left the store with nothing to show for it. The service was disgraceful, and the blonde lady said I had a lot of children's clothing and we only had 2-3 articles out of about 40. They tried to give us $5 for two designer purses (one of which are was over $100 and never been used.) Would not recommend to my worst enemy. If I could I would give below a one star.", "pics": null, "resp": {"time": 1553098371363, "text": "I do believe you are just unhappy because we  didn't offer u any money, we pulled your sheet that u fill in upon arrival , only one or two adult items, that we couldn't use, we buy all day long until 6 pm, on the things that sell in the store, sorry that u have such a bad experience in the buying process, we also have a big MOST WANTED board in the store"}, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "101621952819431588077", "name": "Jennifer Davis", "time": 1556234038743, "rating": 1.0, "text": "Came in a few minutes before 6 not greeted by the snobby girls went to fill out my paper and after fumbling around she tells me they're not buying any more i said yall said you stop at 6 I was here before 6 I don't have that much please Im a single mother just trying to get up money for bills and my sons prom tomorrow to which the blonde snickers and says what so I explain it again i said I don't have alot and they're name brand some with tags still on them please. ...still no so I asked for managers name and she said she could call her so she did or acted like she did and hung up I said I wanted to speak to her. ...oh you're not allowed to speak to her 😡😡😡😡 is she the damn queen. ...if so you suck at it and your pheasants are very snooty", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "109666157634108603113", "name": "Keegan Williamson", "time": 1550129026535, "rating": 5.0, "text": "I can't believe all the negative reviews I'm seeing. Uptown is bar none, the best place in Dothan, or the tri-county area, to buy men's clothing. When I first moved to the area I immediately went to Plato's Closet to see what the Dothan branch had to offer, the short version is, not much. After going to Plato's several times in a 90 day time period and never finding anything of merit, a co-worker took me to Uptown Cheapskate one day before work. That's when it all made sense. The reason Plato's Closet was completely barren was because everybody went to Uptown, and I'm all for it because their price is easily half of what Plato's would charge and their selection is vastly superior.\n\nI would also like to point out that the owner of Uptown has never been anything but extremely accommodating, courteous, and immensely helpful. If you don't like the value she gives you're clothing or accessories the solution is quite simple, shop elsewhere! As for me, when I'm able to not only buy two pairs of Bullhead pants(the clothing line has been discontinued since Pac-Sun went under and has become like finding a needle in a haystack) but also a beautiful yellow and blue Ralph Lauren cardigan, all for less than $30!? I know better than to look a gift horse in the mouth.\n\nTruly leagues above their so called competition.", "pics": null, "resp": {"time": 1550697670589, "text": "thanks"}, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "106850513143830144016", "name": "Brianna Adamson", "time": 1522955235078, "rating": 1.0, "text": "Showed up as soon as they opened to sell some clothes, two bags full, was told the wait would be about three hours, came back 3 hours and a few minutes later, they were STILL not done. They don’t greet you when you walk in. I had jewelry in a separate bag so it wouldn’t get damaged, when I picked up the bag the jewelry was just thrown in the bag and tangled. They seem annoyed every time someone walks in. The customer service is not great at all, will not be returning.", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "112858929877748844672", "name": "Jenna Hixson", "time": 1567892967536, "rating": 1.0, "text": "The employees that work here were rude form the moment I stepped foot in the store. This store is a joke, thanks for nothing!!", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "112586110273713338262", "name": "veronica ward", "time": 1489266375699, "rating": 1.0, "text": "Brought clothing in and wanted to wait to see if they would \"buy\" them...was told it would be awhile...no problem. Next time took stuff in prepared to Leave them...was then called back in and told to come Now to pick them up..explained that I'm 30 mins outside of Town...basically called a liar..so yea done with this snobby place..I agree with previous review. .they need to get over themselves!", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "105572483447187000491", "name": "Maci Exum", "time": 1510961017655, "rating": 1.0, "text": "Very bad service. Dropped off clothes to sale. First off no help then had the lady walk past me and rudely stated to me to fill out a for that it would be done within an hour to an hour an a half. I then asked if they would give me a call once it was done. She told me NO.they only contact via email once complete. So I left the store waited over 5 hours still no email. I then called the store. Lady who answered rude again stated they did not send emails that you had to go put the close up within the time frame. Overall very rude unprofessional people and business.  We will not be doing business there again nor recommend them to anyone", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "113690361110236786220", "name": "Kimsstang s", "time": 1485395251417, "rating": 5.0, "text": "I absolutely love this store, having two teenage daughters they can still have all the name brand clothes but for half of the price. If you haven't been here you should check it out", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "106276702774166680149", "name": "Abby McNeil", "time": 1506028057793, "rating": 1.0, "text": "Your staff are god awful. Also , little blonde manager lady picks things up by her fingertips you bring in in disgust and throws it to the side . Don't you worry. Corporate office and the bbb have been involved .", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "108541968138853555321", "name": "Kristin Ratcliffe", "time": 1458857730450, "rating": 1.0, "text": "I was referred to this store by a coworker. I needed some closet space so took my shoes here.  First and foremost the staff was very unprofessional and had an unpleasant attitude. I brought two full bags of shoes to this location. Some of the shoes had been worn and there was some that haven't been worn. According to the staff, my shoes was not able to be sold. I felt like the staff did not take the time or consideration to view my items. Some of my shoes could have been purshase if not all of them. Besides,  I browse the store as I waited, and there was shoes with scratches and clothes with stains.", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "104673711885866750786", "name": "Nikki Haire", "time": 1473710516426, "rating": 5.0, "text": "The BEST selection and REALLY good prices! Love this place!", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "114901050539794905757", "name": "Jenny Whatley", "time": 1461770991106, "rating": 1.0, "text": "Horrible. Service was slow. People were rude and clothes were in bad shape. I took my clothes in store to originally sell. My clothes were name brand and in good shape. I was in shock of how low the price they would give me for my clothes. I will not be going back.", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "107986831176197972651", "name": "Ashley Wiggins", "time": 1485701085434, "rating": 1.0, "text": "Rude employees that look down their noses upon their customers. Who wants to be a customer at an establishment that makes you feel unwelcome? No one with any dignity. Get over yourselves, please.", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "102750012890330041050", "name": "747 E", "time": 1459197979429, "rating": 1.0, "text": "Word of advice, don't sell anything to them that's worth something. \"Cheap\" is definitely their motto!!!", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "110638758622275719747", "name": "Katrina Jordan", "time": 1534375891014, "rating": 1.0, "text": "I went a few years ago to sale some clothes and hated it I had a trash bag full of name brand stuff all clean and they wanted to say they smelt like cigarette smoke mined u no one smoked in my house so they said to take them home and wash them and bring them back so I did and wasted my gas because they said that they couldn’t take them cause they were older clothes and the staff never greet you when you go in they are very rude and UNPROFESSIONAL I haven’t been back ever since and won’t be going back", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "106202684327127728460", "name": "Alexis Matthews", "time": 1493501161357, "rating": 1.0, "text": "So rude! The employees did not greet us, did not speak to us except to tell us to put down our name and number. Then continued to talk about us and give us dirty looks at we were walking out the door. It's no wonder why the store is rated 1.8.", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "109999658888910375318", "name": "Christopher Bartlett", "time": 1507430346539, "rating": 4.0, "text": "Nice resale place", "pics": null, "resp": {"time": 1507836179811, "text": "Thanks"}, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "105061878071231640425", "name": "meghan self", "time": 1517109567579, "rating": 1.0, "text": "Not impressed with the staff or the store.", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "114054337448426162401", "name": "Jacklyn Russell", "time": 1470681023632, "rating": 1.0, "text": "HORRIBLE SERVICE!!!!!", "pics": null, "resp": null, "gmap_id": "0x889292726d855771:0x4ccb8b180759a69b"}
{"user_id": "100753372836779634207", "name": "Amy Maddox Smith", "time": 1602642482210, "rating": 5.0, "text": "All the latest styles of clothes for teens to moms! Dressy clothes, casual clothes, accessories to the max, and even some makeup! You’ll be treated like family with a warm smile and help finding your size & style!", "pics": null, "resp": null, "gmap_id": "0x88895bc150fbd5a5:0x12f9ff0a82ba888d"}
{"user_id": "109209841133887625406", "name": "Gayla Earnest", "time": 1607108743938, "rating": 1.0, "text": "I was trying to ask a question on their website.  Which to my dismay i goofed up and answered a wrong answer.  But trying to ask my questions after that I was meet with rudeness.  Like you are only allowed \"1\" question.  To me this is unbusinesses like. Unappreciated, and down right freaking rude!!!", "pics": null, "resp": null, "gmap_id": "0x88895bc150fbd5a5:0x12f9ff0a82ba888d"}
{"user_id": "105497227105899590762", "name": "Linda Lively", "time": 1530055253525, "rating": 5.0, "text": "This is \"My Go To Place\" for everything. A great selection of clothes, shoes and accessories. And the SWEETEST, most helpful staff anywhere around ❤❤❤", "pics": null, "resp": null, "gmap_id": "0x88895bc150fbd5a5:0x12f9ff0a82ba888d"}
{"user_id": "102965403574363435662", "name": "Angela Trucks", "time": 1517072866593, "rating": 5.0, "text": "A beautiful store filled with beautiful pricey clothing. ❤️", "pics": null, "resp": null, "gmap_id": "0x88895bc150fbd5a5:0x12f9ff0a82ba888d"}
{"user_id": "117070031115612030383", "name": "Danny Butler", "time": 1539373720019, "rating": 5.0, "text": "High quality clothing/ great pricing", "pics": null, "resp": null, "gmap_id": "0x88895bc150fbd5a5:0x12f9ff0a82ba888d"}
{"user_id": "113795062294199003940", "name": "LeAnna Bivin", "time": 1514313635350, "rating": 5.0, "text": "The staff was very friendly and helpful!", "pics": null, "resp": null, "gmap_id": "0x88895bc150fbd5a5:0x12f9ff0a82ba888d"}
{"user_id": "110917350539359272111", "name": "Sammy Kornegay", "time": 1502740240071, "rating": 5.0, "text": "Love this place!", "pics": null, "resp": {"time": 1503454716086, "text": "Thank you Sammy for Shopping with us at That's Hot . We love to hear are customers are happy! Thank you for your kind words"}, "gmap_id": "0x88895bc150fbd5a5:0x12f9ff0a82ba888d"}
