{"user_id": "103596381864792109090", "name": "Ropa Vieja", "time": 1623789024368, "rating": 5.0, "text": "After spending a considerable amount of time shopping for a bike at various dealers I wanted to give a more concise review of my experience with this dealership.  My original review was a bit critical, due primarily to my lack of experience working with dealers when buying a new bike.   Let me elaborate:\nDealership:  Original review was that this was a typical Harley Dealership,  however after visiting a few others out of the area, I would say it is above average.  Welcoming staff with good selection of bikes and gear, an overall comfortable environment to shop.\nFinance:  They definitely did not mess around with offering a solid interest rate out of the gate.  The finance person was great, explained all the numbers and answered all my questions.  The application process was easy and overall enjoyable.\nPricing:  Spot on pricing with MSRP.  Standard doc, destination fees, however there wasn’t an additional mark up on the price.\nSales:  This is where the deal fell apart. Another dealer offered to include the new riders course ($250) and deliver the bike for free ( a little over 50 miles ).  Being my local Harley dealer and a member of the same owners group,  I thought this might be standard among the three shops. It was not.   When I asked if they would do the same, the answer was “no”.  Asked if that was a deal breaker, I replied yes and that was the end of that until I posted my review here online.\nA different sales person contacted me and tried to make the deal, unfortunately I was still annoyed and never really gave him a chance to try to work it out.\nOverall, I have no reservations giving this dealer a 5 star review after shopping around, the majority of the process was smooth and enjoyable.  After all is said and done would I go back and try again, absolutely.", "pics": null, "resp": {"time": 1621743788893, "text": "Very sorry to hear this, Ropa.  Please give our GM, Mike DeSantis, a call at 205-560-1234.  He'll make sure you are taken care of."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "114894874257570106078", "name": "Alan Farmer", "time": 1620771360029, "rating": 5.0, "text": "I've always had nothing but the best experience with this dealer over the years. I just purchased a 2021 Ultra Limited and my salesman Lee Arnold and GM Mike DeSantis went out of their way to make me happy. These guys have customer service figured out and I highly recommend them for sales, parts, or service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO0Y0arT1jXjZMZpa-fUNH_b7o9HB_di_Q38vYT=w150-h150-k-no-p"]}], "resp": {"time": 1620794231622, "text": "Thank you for the incredible review and kind words, Alan!  We're always happy to help any way we can!  Thank you for choosing Heart of Dixie H-D!  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "103540500426446422726", "name": "Andrew Parrish", "time": 1623382841587, "rating": 5.0, "text": "I purchased a 2021 Low Rider S from here and I must say, this was the best shopping experience I've ever had. Ezra was great to deal with from start to finish as was everyone else I encountered. They have definitely secured my business! If you're looking for good people and good prices, stop in and check this place out, you won't be disappointed!", "pics": null, "resp": {"time": 1623520296510, "text": "Thank you for the incredible review and kind words, Andrew!  Your business is very much appreciated!  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "102588753795927107273", "name": "Chris Williamson", "time": 1622585751689, "rating": 5.0, "text": "This place has got it all. Best bike selection, friendliest staff, knowledgeable parts and service departments all with an awesome store front and showroom! I have bought several bikes over the years and would never consider buying from another location. The GM, Mike, does a fantastic job with his team and has customer service nailed down! No matter what department of the store you are visiting, you will not be let down. If you are considering purchasing a Harley go speak with Lee and then you will be greeted with a smile from Erin, in financing.  If you need parts for your bike then Dave is very knowledgeable and will help you out. If you need service go speak with Brian or Matt. I look forward to doing business with these guys in the future. Keep up the great work!!!", "pics": null, "resp": {"time": 1622650845699, "text": "Thank you for the incredible review and years of repeat business, Chris!  Your business is very much appreciated!  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "108084270943155487677", "name": "Britt Crawford", "time": 1599490752255, "rating": 5.0, "text": "I have been around and dealing with Heart of Dixie for along time now. The experience I had with this purchase was just amazing from sales and financing to parts department and service. Getting the add on's to the freewheeler we want installed and out the door in just a few hours. Excellent job by the entire dealership. Thank You", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMcYISOd3h_i4fYua6tFSRnaBF1V_WGsvv5wciM=w150-h150-k-no-p"]}], "resp": {"time": 1599486455729, "text": "Thank you for the 5 stars, Britt!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "101915664446633936858", "name": "Joseph Morrison", "time": 1620869980123, "rating": 5.0, "text": "Very friendly staff. Right to what you need. Prices are consistent with most other Harley dealers. No complaints", "pics": null, "resp": {"time": 1620961868234, "text": "Thank you for the great review and kind words, Joseph!  Your business is very much appreciated!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "109028399728571374254", "name": "Ioannis (John) Kouvatsis", "time": 1614228825037, "rating": 5.0, "text": "Lee was amazing. He helped me feel like family. Although, I didn't buy a bike, I bought some equipment and I will definitely return for everything my bike needs even though I live in Tuscaloosa. Amazing team!", "pics": null, "resp": {"time": 1614320441253, "text": "Thank you for the awesome review and kind words!  Come see us again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "105187590643283515812", "name": "David Baker", "time": 1623817099084, "rating": 5.0, "text": "Got a really cool shirt still need a dip dot come on harley Davidson", "pics": null, "resp": {"time": 1623817912651, "text": "Thank for the great review and 5 stars, David!  Your business is very much appreciated.  Come back to see us again soon."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "108444523293906862154", "name": "Dena", "time": 1619644215934, "rating": 5.0, "text": "Clean beautiful showroom!! All employees are so helpful and friendly!! Highly recommend !!!", "pics": null, "resp": {"time": 1619710446814, "text": "Thank you for the great feedback and kind words, Dena!  Come back to see us again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "107758888913744665343", "name": "William “Chip” Herbinger", "time": 1622082962158, "rating": 5.0, "text": "My favorite motorcycle store... I've purchased 3 from them and look forward to number 4 😬", "pics": null, "resp": {"time": 1622083715583, "text": "Thanks for the awesome review and kind words, Chip!  Your repeat business is very much appreciated!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "118118728460189524864", "name": "Charlotte Blattner", "time": 1620511759034, "rating": 1.0, "text": "This is the worst place I’ve ever been to. The salesmen are unprofessional, especially Lee. Everyone just cares about an extra dollar in their pocket it seems. Will never come here again and will tell everyone I know to not give this place their business. If I could give zero stars I would.", "pics": null, "resp": {"time": 1620664912133, "text": "Hi Charlotte, we're very sorry to hear about this.  As you can see from our other reviews that is definitely not the norm here at Heart of Dixie H-D.  Please call our GM, Mike DeSantis, at 205-560-1234, as we'd like to make sure you are taken care of."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116505190110329332888", "name": "Angela Lane", "time": 1619206364208, "rating": 5.0, "text": "Great people & products!! Luv HD where we travel!", "pics": null, "resp": {"time": 1619471084893, "text": "Thank you so much for the great review and kind words, Angela!  Come back to see us again soon!  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "104254004500905361333", "name": "Charlie Dietz", "time": 1619627678034, "rating": 5.0, "text": "Great dealership.  Friendly staff, large selection.", "pics": null, "resp": {"time": 1619633127249, "text": "Thank you for the great review and kind words, Charlie!  Come back to see us again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "106341586577594824068", "name": "J Bos", "time": 1604792762000, "rating": 5.0, "text": "Haley helped me out today and was FANTASTIC! I just had surgery on my back on Thursday,  so was a little sore and slow walking around. She was extremely patient and helpful.  I hope her boss sees this and gives her a raise for her awesome customer service", "pics": null, "resp": {"time": 1611677772231, "text": "Thank you for the kind words!  Happy to help!  Come see us again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116476221830747398902", "name": "Daniel Thomas", "time": 1593899136852, "rating": 5.0, "text": "I have bought several bikes here. They treat you like family. This is also where I have my bikes serviced and purchase riding gear. They have been kind enough to give me used parts when money was tight. They go out of their way to keep me on the road. They are extremely knowledgeable. They keep all my bikes running, from the new ones to the ones I've had for years. They regularly throw in extras when I buy things. I really can't say enough good things about this store.", "pics": null, "resp": {"time": 1594052518271, "text": "Thank you so much for the incredible review and kind words, Daniel!  Your business is very much appreciated and it's always a pleasure working with you.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115896023189324146386", "name": "Chris Sledge", "time": 1599342251828, "rating": 5.0, "text": "Treated me like family. They wanted me to be as comfortable as possible when choosing my Harley. I chose what I wanted, they didn’t sell me a bike. Dave, Aaron and JD were great.  Would recommend to any and everyone", "pics": null, "resp": {"time": 1599416021399, "text": "Thank you for the kind words and for choosing Heart of Dixie H-D, Chris!  Your business is very much appreciated.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "101565326746512993207", "name": "Adam Montgomery", "time": 1616699895160, "rating": 5.0, "text": "Great customer service   really nice bikes and showroom", "pics": null, "resp": {"time": 1616783215816, "text": "Thank you for the great review and kind words, Adam!  Come see us again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "114200562668087148186", "name": "JEFF COMPTON", "time": 1622680515005, "rating": 5.0, "text": "Nice store, nice staff.", "pics": null, "resp": {"time": 1622740934229, "text": "Thank you for the great review and kind words, Jeff!  Come back to see us anytime."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "117817670879368774452", "name": "Michael Nance", "time": 1518583852386, "rating": 5.0, "text": "Had a great time here. Attended the 2018 Alabama State Arm Wrestling tournament. Was a great competition.  I hope they get to have it there again next year. If so I will defiantly be coming back. Thanks to the business and the director for putting on such a great event.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMEu6A5MCknGH9_NkjSYGIinfrnBCxAM2B6nJag=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNfTKZ7OCPDEuqZtG8RIexXbc0PDae9Bp8ZTfaQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPMc8eyktODSD3uL_lNIvp2FaUvwpW5-aJVeWEA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOPa-t5pj2NSugByD40aPaakXxMNV5Mjio2ZH6F=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMQLHEdgFvM1enHg1Y93d-6RNtjT9n5l-N5RZAZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNGyrRkmlh186tG2px37HEymu0XkmUOR_zfZSKW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMuAbURtaG8yAh1FI4dNi_9FLMmpU4t1MO71LJQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMhTf50T2gSLTq8ap2HhTg_AYoWJ_7z_4OEpx2o=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM07tzjDeL70fyhjQdjRTWYQ6MevuMe17BFITzJ=w150-h150-k-no-p"]}], "resp": {"time": 1518586475149, "text": "Thanks for the kind words, Michael!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113053844932148883339", "name": "Hoss Reyes", "time": 1603901201748, "rating": 5.0, "text": "From start to finish.  Sales, finance,  and final.  The staff is impeccable !!! I look forward to doing Future business with y’all .", "pics": null, "resp": {"time": 1603981191430, "text": "Thank you for the awesome review and kind words, Hoss!  Your business is very much appreciated!  Give us a call or come see us anytime.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "108698200496723777415", "name": "shelly hankins", "time": 1620674550103, "rating": 5.0, "text": "Nice place would visit again", "pics": null, "resp": {"time": 1620794147052, "text": "Thank you for the great review and kind words, Shelly! Come back to see us again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115876360131091092045", "name": "Robbie Dannelly", "time": 1594165185505, "rating": 5.0, "text": "Excellent sales team. Our favorite dealership for apparel by far. Just purchased an Ultra Classic that Lee showed us. JD help got us started on getting approved. We came back and Mike the GM made the deal work for us.  Highly recommend this dealership for all your Harley addictions!😎", "pics": null, "resp": {"time": 1594238918949, "text": "Thank you very much for the incredible review and kind words.  It was a pleasure working with you and we look forward to helping you with all of your future H-D needs.  Give us a call or come see us anytime.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "109400852614130044343", "name": "Eric Roper", "time": 1579553058500, "rating": 5.0, "text": "SO, I had to come back and edit my review and give Chase and the Heart of Dixie a new 5 star review.\n\nI posted a couple complaints I thought I had, about a recent purchase on a used 2016 Street bob. (That I totally love!)\n\nwell not 24 hours later. I get a text message from HOD, not only did they give me the information on something I was really agitated about. (I was mistaken by the way) they educated me and offered to assist me with any more info on my bike that they could.\nNOW, that's good service. this guy went outta his way to make sure I was informed, and felt good about the purchase of my used bike!\nI am a very skeptical person when it comes to using dealers for anything. but these guys seem to really get it, and try to do right for the customers like me that are spending hard money on even used bikes, not just the new ones!\nGET THE WARRANTY! how can you go wrong with a lifetime drive warranty? Ill trust them, cause they seem to care.\nHeart of Dixie will be my go to shop! and Ill continue to review them 5 star for all my bob's needs!\n\nTHANKS SO MUCH!", "pics": null, "resp": {"time": 1579625102223, "text": "Thank you very much for the awesome review, Eric!  Your business is greatly appreciated!  We're always happy to help any way that we can so give us a call or come by any time.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "107481937398525915424", "name": "Eric Tully", "time": 1592434747284, "rating": 5.0, "text": "Staff was awesome and made sure I got exactly what I wanted. no pressure and they worked with me for hours. Good people and great buying experience", "pics": null, "resp": {"time": 1592490189554, "text": "Thank you so much for the awesome review and kind words, Eric!  Your business is very much appreciated and we look forward to being here for you whenever you need us.  Give us a call or come by anytime.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "108445327501239738485", "name": "John White RCDD", "time": 1571532019003, "rating": 5.0, "text": "My 5k service with a few additions. If you have trepidation about this place working on your baby then allow me to help. Relax , the service department will treat your baby better than you would yourself. True professionalism top to bottom and very high quality work. I’m very, very impressed. Great job guys - thank you very much for taking great care of my 17 Low Rider. You guys earned my repeat business.", "pics": null, "resp": {"time": 1571754685678, "text": "Wow!  Thank you so much for the incredible review and kind words, John!  Your business is greatly appreciated and we look forward to serving you for many years to come.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116395291083697152679", "name": "Jimmy Dill", "time": 1595050206835, "rating": 3.0, "text": "Considering it was Friday a little after lunch the place was dead. We were greeted when we came in the door. We looked at clothes and a girl from behind a counter asked if we were finding everything ok. The same girl checked us out and barely spoke. Unlike most HD shops, the employees didn't seem to care that we were there to spend money and weren't very friendly. We were barely even noticed and there was only one other customer in the store", "pics": null, "resp": {"time": 1595100909682, "text": "Hi Jimmy, very sorry to hear this. As you can see from our other reviews this is definitely not the norm here at Heart of Dixie H-D.  Everyone that visits our dealership is important to us and your business is very much appreciated.  We'd like the opportunity to make it right so please give our GM, Mike DeSantis, a call at 205-560-1234 at your earliest convenience.  We look forward to hearing from you!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "101091289681893057742", "name": "Waltre Melton", "time": 1613988377214, "rating": 4.0, "text": "Helpful and very nice dealer.", "pics": null, "resp": {"time": 1614013321424, "text": "Thank you for the kind words, Waltre!  Sorry to see only 4 stars, though.  Please let us know what we can do to make sure your next visit is a 5-star experience."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "117377497270614836506", "name": "Greg Bach", "time": 1592425278892, "rating": 5.0, "text": "Great Dealership and had the exact 2020 Street Bob that I wanted.  I will definitely go to Heart of Dixie for my next Harley-Davidson needs.", "pics": null, "resp": {"time": 1592489902915, "text": "Thank you so much for the kind words, Greg!  Your business is very much appreciated!  Give us a call or come see us any time.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "108126389366347726320", "name": "Tandy Young", "time": 1584566235857, "rating": 4.0, "text": "Nice place. Folks not bugging the hell out of you to buy. They work on your time not theirs. No high pressure tactics.", "pics": null, "resp": {"time": 1584571683170, "text": "Thank you for the kind words and awesome feedback, Tandy!  Please let us know what we can do to make sure your next visit is a 5-star experience."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "106599538718029598811", "name": "Robert Nichols (Alex)", "time": 1508393617987, "rating": 5.0, "text": "I have recently purchased a 2017 HD Sportster XLIron883 and I had tipped it. Luckily it only scraped up the left rear blinker. Well anyways, they fixed it like new for really cheap, fast, and then they still washed it. The service ther w is second to none. Love this store, bc we are like a bog family.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPPqyaUp9R-vCPog1WPOJRUJzVeLQzb753KVhK8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPxd6NJdX3fzktDNye0s_vf6cA0-eHDfTtc0XTd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPTGHcSRzdx089_UdHaVjoLxQTCRVayrejMqkL2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMZrY6J2bLBIwmEYASg_c502RLABBxC6AqwWYVa=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN5bJGVYugQfbgYT_G3-AXMNHDiMKigOdf8fAul=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPsMx_BLmpEEp1NS1lbOKZWpyKgkMZVW-zYOfYp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOF4IMEteEh4AIVSe2oefaNQcS-CLMxCBOxImH4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNWPiP5QOgMkNS1i2hi5Ckv0vq9AnKfsAG8OOla=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP76t59IhanBJYdzEU6lXGoTEynVtXeVZ6dp2kR=w150-h150-k-no-p"]}], "resp": {"time": 1508394473993, "text": "Thanks for the awesome 5 star review, Robert!  We appreciate the kind words.  Come see us anytime.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113245999962293108794", "name": "Hank", "time": 1588902082559, "rating": 5.0, "text": "Heart of Dixie Harley Davidson is a dealership that listens to your needs with a low pressure approach to sales. Friendly staff with the knowledge to meet your needs and wants. I have purchased 3 motorcycles with them and plan to continue making Heart of Dixie my primary dealership.", "pics": null, "resp": {"time": 1588912428109, "text": "Thank you very much for the awesome review, kind words, and choosing Heart of Dixie H-D as your go-to dealership for all of your Harley-Davidson needs.  It's a pleasure doing business with you and we look forward to always being here when you need us.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "102208967138814483896", "name": "Trick Faldo", "time": 1588428509056, "rating": 5.0, "text": "Huge kudos to Tbone and his team in the service department!!! Had a blowout 40 miles away ,after exploring expensive towing options,he sent his employee with a trailer picked me up and replaced both tires while  i waited..I can't say enough about the service,kindness,and professionalism i experienced.I recommend to all of Birminghams' biker nation!!!", "pics": null, "resp": {"time": 1588567610543, "text": "Thank you so much for the kind words and awesome review!  Happy to help!  Give us a call any time and we'll make sure you're taken care of.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113704139099048653528", "name": "R", "time": 1567897226425, "rating": 5.0, "text": "Should be 10 stars.   Seen a new orange 2020 Street glide sitting on the floor.  Man. I couldn't sleep thinking about that bike.    Call Lee Arnold.   That day.  I'm rolling out on my new bike. Indianapolis Harley wanted 3000.00 more for the bike. Same one.  So all you guys oh and gals who want a new bike.  Come south. Tho the Heart of Dixie they will get you rolling with smiles that will last for miles and miles.   Randy nalley.", "pics": null, "resp": {"time": 1567901487779, "text": "Wow! Thank you very much for the incredible review and kind words, Randy!  Your business is greatly appreciated.  Give us a call or come see us any time you need anything and we'll make sure you're taken care of. Let's ride!  😎"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "114020476150064124008", "name": "Jasper Little", "time": 1598825756244, "rating": 5.0, "text": "Great place and great group of poeple very helpful and respectful", "pics": null, "resp": {"time": 1598896251095, "text": "Thank you very much for the kind words, Jasper!  Come back to see us anytime.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "101214040991855745332", "name": "Lester Ruttka", "time": 1594741970073, "rating": 5.0, "text": "Great HD dealership. Knowledgeable, friendly and will work hard to make your deal and experience doable.", "pics": null, "resp": {"time": 1594745760965, "text": "Thank you for the awesome review and kind words, Lester!  Your business is very much appreciated!  Give us a call or come see us any time.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "109861760347915876831", "name": "Darryl Perry", "time": 1596400492583, "rating": 5.0, "text": "Great people to deal with! Truly proffessional", "pics": null, "resp": {"time": 1540185230733, "text": "Thanks for the 5 stars, Darryl!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "105699003295733795924", "name": "Michael Awe", "time": 1560982321723, "rating": 5.0, "text": "I was just traveling thru Birmingham and stopped in to look around. I was assisted by Rob at the parts counter gave me great advice on suggested up grades to my bike.\n\nSince I was not familiar with the area, I asked about suggested rides in the area. Rob was more than willing to offer a suggested route. My wife and I went on this ride today and we enjoyed ourselves.\n\nThis is the kind of service that will bring people back.", "pics": null, "resp": {"time": 1561010860534, "text": "Thank you so much for the kind words, Michael!  Happy to help.  Come see us any time.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "107560503494780087540", "name": "C. M.", "time": 1587122163518, "rating": 1.0, "text": "Customer service horrible.  No greeting from the front desk, only stares.  Service in the clothing department is extremely bad. The younger lady working in the clothing department looked at me right in my face after I asked how is her day, she just turned her head. I'm absolutely sure she heard me!!", "pics": null, "resp": {"time": 1587659370175, "text": "Hi C.M., Very sorry to hear this.  As you can see by our other reviews, this is definitely not the norm here at Heart of Dixie H-D.  We apologize and would love the opportunity to make it right.  Please call our GM, Mike DeSantis, so that we can make sure this is taken care of.  (205) 560-1234"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "102208967138814483896", "name": "Trick Faldo", "time": 1588428509056, "rating": 5.0, "text": "Huge kudos to Tbone and his team in the service department!!! Had a blowout 40 miles away ,after exploring expensive towing options,he sent his employee with a trailer picked me up and replaced both tires while  i waited..I can't say enough about the service,kindness,and professionalism i experienced.I recommend to all of Birminghams' biker nation!!!", "pics": null, "resp": {"time": 1588567610543, "text": "Thank you so much for the kind words and awesome review!  Happy to help!  Give us a call any time and we'll make sure you're taken care of.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115566737369398213198", "name": "Charles Harris", "time": 1570501759661, "rating": 5.0, "text": "There for a run and had a great time", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOugZgQdOTRQ9xQhlQA7EdlkwbB7hjdd2D_tjwW=w150-h150-k-no-p"]}], "resp": {"time": 1570503017642, "text": "Thank you for the great review, Charles! Come see us any time."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "114020476150064124008", "name": "Jasper Little", "time": 1598825756244, "rating": 5.0, "text": "Great place and great group of poeple very helpful and respectful", "pics": null, "resp": {"time": 1598896251095, "text": "Thank you very much for the kind words, Jasper!  Come back to see us anytime.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "109861760347915876831", "name": "Darryl Perry", "time": 1596400492583, "rating": 5.0, "text": "Great people to deal with! Truly proffessional", "pics": null, "resp": {"time": 1540185230733, "text": "Thanks for the 5 stars, Darryl!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "105699003295733795924", "name": "Michael Awe", "time": 1560982321723, "rating": 5.0, "text": "I was just traveling thru Birmingham and stopped in to look around. I was assisted by Rob at the parts counter gave me great advice on suggested up grades to my bike.\n\nSince I was not familiar with the area, I asked about suggested rides in the area. Rob was more than willing to offer a suggested route. My wife and I went on this ride today and we enjoyed ourselves.\n\nThis is the kind of service that will bring people back.", "pics": null, "resp": {"time": 1561010860534, "text": "Thank you so much for the kind words, Michael!  Happy to help.  Come see us any time.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "112908246035676160699", "name": "Lawrence Bush", "time": 1564423714983, "rating": 5.0, "text": "Had an issue with my oil cooler coming from Las Vegas to Montgomery.  The service  writer Brandon Hoops did an outstanding job taking care of me & my bike. The service here at Heart of Dixie is above a d beyond the call off outstanding.  Keep up the great service. 👊🏿👊🏿💯💯", "pics": null, "resp": {"time": 1564841736319, "text": "Thank you very much for the kind words, Lawrence!  Happy to help!  Stop in to see us any time you're in the area.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "114995552024575212409", "name": "Amber Duke", "time": 1574949342557, "rating": 4.0, "text": "Loving this Harley Dealer! Wonderful staff very helpful! And in my opinion was worth the 3 hr ride 😁😁", "pics": null, "resp": {"time": 1575497624523, "text": "Thank you so much for the kind words, Amber!  Come see us any time. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110032140214176879696", "name": "Bernie Letofsky", "time": 1565819623934, "rating": 5.0, "text": "Had a front end slight wobble- (2019 LIMITED)- on a long road trip (I'M OUT OF STATE PLATES)- stopped into Heart of Dixie Harley-Davidson as was met by Brandon Hoops-IMMEDIATELY.... the service guys test rode the bike, bench tested it, and had me on my way in no time!  I worked for Harley-Davidson for over10 years - I know 'good ' service - Brandon and Heart of Dixie  HD ....are 'EXCELLENT'!  Brandon you're the BEST- THANKS!!!!!", "pics": null, "resp": {"time": 1565926877778, "text": "Thank you for the awesome review and kind words, Bernie!  Happy to help!  Stop in to see us whenever you're in the area.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "107560503494780087540", "name": "C. M.", "time": 1587122163518, "rating": 1.0, "text": "Customer service horrible.  No greeting from the front desk, only stares.  Service in the clothing department is extremely bad. The younger lady working in the clothing department looked at me right in my face after I asked how is her day, she just turned her head. I'm absolutely sure she heard me!!", "pics": null, "resp": {"time": 1587659370175, "text": "Hi C.M., Very sorry to hear this.  As you can see by our other reviews, this is definitely not the norm here at Heart of Dixie H-D.  We apologize and would love the opportunity to make it right.  Please call our GM, Mike DeSantis, so that we can make sure this is taken care of.  (205) 560-1234"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "109176216172523993851", "name": "darlane west", "time": 1620943524533, "rating": 5.0, "text": "Great meats", "pics": null, "resp": {"time": 1620961935219, "text": "Thank you for the 5 stars, Darlane!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115692225882699792486", "name": "Jerry Mays", "time": 1607526505315, "rating": 5.0, "text": "Friendly and helpful staff.", "pics": null, "resp": {"time": 1607531413956, "text": "Thank you for the great feedback and kind words, Jerry!  Come see us anytime."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "108498950217509969144", "name": "Larry Macon", "time": 1590782542770, "rating": 5.0, "text": "Great buying experience made easy.\nThanks to all at Heart of Dixie Harley Davidson.", "pics": null, "resp": {"time": 1590850996711, "text": "Thank you for the kind words, Larry!  Your business is very much appreciated.  Give us a call any time you need anything.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "102243542091878966282", "name": "Teresa Holliman", "time": 1594173552105, "rating": 5.0, "text": "Love it because they let you look around without bugging you!!!", "pics": null, "resp": {"time": 1594238809390, "text": "Thank you so much for the awesome review, Teresa!  Come see us anytime.  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "103119002086459418870", "name": "Milo Varnadoe", "time": 1578333568591, "rating": 5.0, "text": "Came in for the Driver-to Driver purchase program.  JD Ard is the best and handled everything effectively and efficiently.  Both the seller and I couldn't be happier!!!", "pics": null, "resp": {"time": 1578329623870, "text": "Thank you for the 5 stars, Milo!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110560458243982865552", "name": "Shay Nicosia", "time": 1564595172001, "rating": 5.0, "text": "I ABSOLUTELY LOVE the people that work here. Also, the regular visitors. My super duper cool other \"family\".", "pics": null, "resp": {"time": 1515007715153, "text": "Thanks for the 5 stars, Shay!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "108380389840128225361", "name": "Marcie Speakman Skinner", "time": 1561331143789, "rating": 5.0, "text": "My husband had new tires put on his motorcycle at the Pelham, Al location. Although he had a rather long wait time, because it is first come first serve and riders start lining up their motorcycles at 6 in the morning, he said it was worth the wait. They wash each motorcycle that they service unless the owners requests that it not be washed. Their customer service was eager to help, explain & of course selll him something, which my husband did buy an air pump. The employee that helped my husband told him a few things that my husband was unaware of about his bike, so they are very knowledgeable about different types of Harley Davidson and are eager to share that info.", "pics": null, "resp": {"time": 1561387607410, "text": "Wow! Thank you so much for the incredible review and kind words, Marcie!  We're happy to help any time you need us.  Come see us any time. Let's ride!  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "112965227552800113209", "name": "Hammer Man", "time": 1532237368792, "rating": 5.0, "text": "Here for Bike night. I love this place!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPjskcbVDhPitUIGjxM5MjVlsT8AGP5xopcTd6b=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOPfE4FwsoWsG0M1kkZiOyoXJGxJVBIoyPrlYKY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPx82OADdXv3cRYFN197B9NFtmMyQ-D97Yu-TJB=w150-h150-k-no-p"]}], "resp": {"time": 1532367301117, "text": "Thanks man!  Appreciate the kind words and 5 stars!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116605095998442847480", "name": "Shean Brown", "time": 1572019620534, "rating": 5.0, "text": "Had a Great Experience yesterday with Zack, Brian and Bill....The whole service dept was  friendly and helpful....Pulled off my Boom fairing lower job in record time....Hats off to Zack & his Crew...", "pics": null, "resp": {"time": 1572030517496, "text": "Thank you so much for the kind words and awesome review, Shean! We're happy to help.  Your business is greatly appreciated. Come see us any time.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110939240383930066753", "name": "Clan Weldon", "time": 1581278258127, "rating": 5.0, "text": "This was the largest Harley-Davidson showroom I’ve ever been in. We just purchased shirts and boots. But they had a wide selection of bikes and a very helpful staff.", "pics": null, "resp": {"time": 1581361511050, "text": "Thanks for the awesome review and kind words, Clan!  Come see us any time."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "111518411108579084343", "name": "Tracy Castaneda", "time": 1594055591789, "rating": 5.0, "text": "Heart of Dixie Harley Davidson is a wonderful place to find what you need for all thing's", "pics": null, "resp": {"time": 1594159961325, "text": "Thank you for the awesome review and kind words, Tracy!  Come see us anytime.  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115692225882699792486", "name": "Jerry Mays", "time": 1607526505315, "rating": 5.0, "text": "Friendly and helpful staff.", "pics": null, "resp": {"time": 1607531413956, "text": "Thank you for the great feedback and kind words, Jerry!  Come see us anytime."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "108380389840128225361", "name": "Marcie Speakman Skinner", "time": 1561331143789, "rating": 5.0, "text": "My husband had new tires put on his motorcycle at the Pelham, Al location. Although he had a rather long wait time, because it is first come first serve and riders start lining up their motorcycles at 6 in the morning, he said it was worth the wait. They wash each motorcycle that they service unless the owners requests that it not be washed. Their customer service was eager to help, explain & of course selll him something, which my husband did buy an air pump. The employee that helped my husband told him a few things that my husband was unaware of about his bike, so they are very knowledgeable about different types of Harley Davidson and are eager to share that info.", "pics": null, "resp": {"time": 1561387607410, "text": "Wow! Thank you so much for the incredible review and kind words, Marcie!  We're happy to help any time you need us.  Come see us any time. Let's ride!  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110560458243982865552", "name": "Shay Nicosia", "time": 1564595172001, "rating": 5.0, "text": "I ABSOLUTELY LOVE the people that work here. Also, the regular visitors. My super duper cool other \"family\".", "pics": null, "resp": {"time": 1515007715153, "text": "Thanks for the 5 stars, Shay!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "111017312238897129180", "name": "Scott Stover", "time": 1523229068847, "rating": 5.0, "text": "After year's of riding metric bikes, I had my last bike 14 years, I decided to get another bike.  On a whim i stopped by heart of Dixie Harley Davidson in Pelham Alabama from the sales staff (Terry)was very helpful to finance department (Pat) to JD and Chase in answering my questions about accessories and maintenance. Store had a great selection and plenty of merchandise.  I was treated like I was family.  My experience there was such a pleasure no pressure or gimmicks just trying to help me find the right bike I can now say I'm officially a Harley owner. I'll be back for all my future needs. Thanks guys", "pics": null, "resp": {"time": 1523288759464, "text": "Thanks for the awesome review and kind words, Scott!  Your business greatly appreciated.  You ARE family here at HOD so stop by to see us anytime.  Whenever you need anything, please don't hesitate to give us a call or come see us.  We'll make sure you're taken care of.  It was a pleasure working with you and we hope to see you again soon!  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "111518411108579084343", "name": "Tracy Castaneda", "time": 1594055591789, "rating": 5.0, "text": "Heart of Dixie Harley Davidson is a wonderful place to find what you need for all thing's", "pics": null, "resp": {"time": 1594159961325, "text": "Thank you for the awesome review and kind words, Tracy!  Come see us anytime.  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115120168177554679824", "name": "Nadine Johnson", "time": 1534816198923, "rating": 5.0, "text": "Walked in specifically looking for something. Were pointed exactly in the right direction and waited a minute for salesperson. Very promptly answered questions and given details whereas at another dealership hemmed and hawed about looking at numbers without final decision. How can one make a decision without having an idea about the numbers. Much happier here. Thanks so much.", "pics": null, "resp": {"time": 1534819459936, "text": "It was our pleasure, Nadine. Thank you so much for the kind words and for choosing Heart of Dixie H-D!  Hope to see you again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "107684270337159239893", "name": "Jai Bandit", "time": 1582603304436, "rating": 5.0, "text": "Good for now price high good quality", "pics": null, "resp": {"time": 1582664871610, "text": "Thank you for the 5 stars, Jai!  Come back to see us any time."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "109504775384412563833", "name": "4milla", "time": 1545997983894, "rating": 1.0, "text": "Love my road glide but I ended up going to another Harley dealership. I walked in and browsed around for 30 minutes , the guy at the desk looked at me and said nothing , my co worker walked in behind me and they catered to him like he was trump. No offense but I spend my money where its welcomed", "pics": null, "resp": {"time": 1546067748133, "text": "Very sorry to hear about this.  It's definitely not the norm here.  I hope you give us another chance to make your visits to our dealership a 5 star experience."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "105253031702704731224", "name": "Alan Farmer", "time": 1532739653868, "rating": 5.0, "text": "Took my bike in this week for the 10,000 mile service. As usual, the service department did a great job! But hats off for the job technician Matt Satterfield did. He not only performed the service requested, but took the time to make sure my bike was ready for a long trip I'm going on. Great dealership! I highly recommend.", "pics": null, "resp": {"time": 1532742328375, "text": "Thanks for the incredible review and kind words, Alan!  Your business is very much appreciated!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "117342541552412918280", "name": "jeanie white", "time": 1590363998228, "rating": 1.0, "text": "Rude staff. Will not go back. Only reason I even gave a star was to post review", "pics": null, "resp": {"time": 1590379315322, "text": "Hi Jeanie,  Very sorry to hear this.  As you can see from our other reviews, this is definitely not the norm here.  Please give Mike, our GM, a call as we'd like to resolve this issue and make sure you're taken care of.  (205) 560-1234"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "101058792549597821977", "name": "Charles E. DaVis", "time": 1571804294232, "rating": 5.0, "text": "Great oasis for a biker to stop by and say hello to friends not made yet.", "pics": null, "resp": {"time": 1570984998007, "text": "Thank you for the 5 stars, Charles!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "101496095516348620666", "name": "Peggy Allen", "time": 1574644197328, "rating": 5.0, "text": "Heart of Dixie Harley-Davidson Pelham Alabama use their hog house for a party. it was awesome -great facilities", "pics": null, "resp": {"time": 1574647855377, "text": "Thanks for the awesome review, Peggy!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113357364173907245119", "name": "Heather Godsey", "time": 1537288713672, "rating": 5.0, "text": "My husband needed his front tire changed out in an emergency situation, he was running on a strict timeline, and the dealership made it happen. We really enjoyed Brandon, Bill, and George at the dealership. We were met with total professionalism and the desire to help. This will be Our new home after moving closer to the area. Thank you Bill, Brandon, and George, my husband said his Daytona Street Glide rides like it did, the day it was bought new! We will definitely be back!", "pics": null, "resp": {"time": 1537289476351, "text": "You're very welcome!  Happy to help.  Thank you for the kind words and we look forward to having you guys in the HOD family.  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "105981176966635946427", "name": "kathryne mccord", "time": 1520640943902, "rating": 5.0, "text": "the employees were helpful and friendly. The store was clean,shelves were full of beautiful merchandise. And the bikes OMG the bikes! The next time you plan a shopping Excursion, put this place on your list because you don't have to ride a bike to wear the merchandise. And there were some beautiful clothes for women. Go there! You'll be glad you did!", "pics": null, "resp": {"time": 1520641646982, "text": "Wow!  Thank you so much for the incredible review and kind words!  Your business is greatly appreciated.  Come see us anytime. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "102398620979397896946", "name": "Clayton Vines", "time": 1552393057741, "rating": 4.0, "text": "Everything I've experience at the location has been great..... except for the service dept. My bike is currently there to be worked on and my experience with that has been less than stellar. This is my first Harley, but will be my last service I believe, with y'all's shop. Just not good customer service and nobody seems to know much of anything about anything as well as nobody seems to have a genuine interest in helping me get back on the road.", "pics": null, "resp": {"time": 1552370102876, "text": "Thank you for taking the time to leave us a review, Clayton!  Please let us know what we can do to make sure your next visit is a 5-star experience."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116253340903379637099", "name": "raymond ehlers", "time": 1612441526862, "rating": 5.0, "text": "Great dealership", "pics": null, "resp": {"time": 1612453556967, "text": "Thank you for the kind words, Raymond!  Come back to see us again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "104598349455747143663", "name": "Porkchopranch", "time": 1579143081641, "rating": 3.0, "text": "Nice folks and high prices", "pics": null, "resp": {"time": 1579188080993, "text": "Thank you for leaving us a review and for the kind words!  Sorry to see only 3 stars, though.  Please let us know what we can do to make sure your next visit is a 5 star experience."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "111013678068151589346", "name": "Laurie Brannen", "time": 1532098090852, "rating": 5.0, "text": "A really nice Harley shop. A huge variety of things to see and buy.\nI always have a hard time finding XL women's size shirts. They had XL in every selection!\nBeautiful Harleys on the showroom floor, and very friendly, knowledgeable staff.", "pics": null, "resp": {"time": 1532112552050, "text": "Thank you so much for the incredible review and kind words, Laurie!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "104689985377246816623", "name": "Rachel Harris", "time": 1560823184028, "rating": 5.0, "text": "My husband and myself was coming thru AL on a short road trip and noticed our front tire had a bubble and was not in good shape. We pulled up at the Pelham Harley shop on a Sunday at 3:00. The service dept closed at 5:00. There was only one technician working and we told him what our problem was and he right away said yes I can fix you up we are here for travelers. That's why we are open on Sundays. He continued to tell the service clerk that we would work past closing in order to be able to get our tire changes and to have us safe on the road again. I would recommend this shop and will be goin back! Thanks so much!!", "pics": null, "resp": {"time": 1560824339460, "text": "Thank you so much for the kind words, Rachel!  So glad the rest of your trip went well.  Come see us any time.  Let's ride! :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "101506179222641891921", "name": "Pamela Sullivan", "time": 1612046154488, "rating": 5.0, "text": "Great inventory", "pics": null, "resp": {"time": 1612105375200, "text": "Thank you for the great review, Pamela!  Come see us again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "100209113073471203711", "name": "X Smith", "time": 1566071259910, "rating": 5.0, "text": "Lee took care of us. Great deal on my FXDF. What ever you do, dont waste your time at Montgomery Harley Davidson go straight to the Heart of Dixie Harley Davidson. Thank you guys!!", "pics": null, "resp": {"time": 1566168501439, "text": "Thank you very much for the awesome review and for choosing Heart of Dixie H-D!  Your business is greatly appreciated!  Come see us any time.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "108068412933438446305", "name": "Leonard Dunaway", "time": 1555588751590, "rating": 2.0, "text": "OK store nothing stood out walked in was greeted and that was it 5 or 6 of the employees stayed in there group talking and cutting up. No help", "pics": null, "resp": {"time": 1555860482795, "text": "Hi Leonard, very sorry to hear this.  Please let us know your opinion of what we can do to stand out as a Harley-Davidson store.  Our customers are like family so it's important to us to make sure every visit is a 5-star experience.  We normally have over 20 employees working each day so, if it's ok with you, I'd like to go over your visit to see where we failed to help so that I know where to make the correction with our staff.  Please feel free to call Tue-Sat.  205-560-1234  -Mike"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "100779554295711579521", "name": "Brother Smitty", "time": 1557005499001, "rating": 4.0, "text": "Helpful staff. Huge store. Pricey like most HD stores", "pics": null, "resp": {"time": 1557025553245, "text": "Hey Kevin,  thank you for stopping in and for taking the time to leave us a great review.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "100314217621204802473", "name": "Ken Horricks", "time": 1618134549440, "rating": 5.0, "text": "Awesome", "pics": null, "resp": {"time": 1618254657642, "text": "Thank you for the 5 stars, Ken!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115619846396867091987", "name": "Rick Sheppard", "time": 1563054230881, "rating": 5.0, "text": "Snapped a clutch cable 500 miles from home, which by the way is a scary ordeal..think about it..  I called and they rescued me from the roadside, and repaired the Roadking within hrs. Awesome dealership.", "pics": null, "resp": {"time": 1563119378848, "text": "Thanks for the awesome review, Rick!  Happy to help!  Stop in to see us any time you're in the area.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "117424065347017549665", "name": "Allen Render", "time": 1509206001915, "rating": 5.0, "text": "If you are interested in an awesome upgrade and you have a 103HO Twin CAM check out the 110 stage III upgrade.  It is awsome.  If you thought you had power before for me this is a redefining upgrade.  For my Heritage \"WOW\" does not define what I think.  Check with the folks at Heart of Dixie they will get it done.", "pics": null, "resp": {"time": 1509232509581, "text": "Thanks for the incredible 5 star review and kind words!  That's a sweet ride you've got there and it's our pleasure working with you.  Any time you need anything, you know where to find us. :)  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "108723367501129219877", "name": "Wayne Williams", "time": 1485011695077, "rating": 5.0, "text": "Zach called today to inform me that while installing my new engine that my fender was chipped in the progress.  He's assured my that it will be taken care of, so I'm happy to hear that,  most would try to let it skate by. The new engine runs great and the new pipes sound awesome.  Did I tell you, when my motor blew they were kind enough to come 40 miles and pick me up off the interstate.\nTHESE GUYS KNOW WHAT CUSTOMER SERVICE MEANS!  THANKS ZACH AND THE REST OF THE STAFF AT HEART OF DIXIE HARLEY DAVIDSON!", "pics": null, "resp": {"time": 1485239627236, "text": "Thank you for the kind words and excellent review!  Your business is very much appreciated.  It was a pleasure working with you.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116967993664308330106", "name": "travis burks", "time": 1440224593020, "rating": 5.0, "text": "Bought my very first Harley At Heart of Dixie this week and they did not disappoint. The sales and finance department are amazing guys. I went to 3 Harley dealers, not one came close in price, professionalism, patience and knowledge like Heart of Dixie HD. These guys worked with me and I got the bike of my dreams and at a great price. This was a 3 week process for me making my decision and every time I went in Heart of Dixie, I was welcomed by Lee (salesman that helped me) with any questions I had and he showed me a variety of bikes til I could decide which was best for me. ROAD GLIDE! Go see Lee, he won't disappoint you! Don't waste your time at the other places.", "pics": null, "resp": {"time": 1440429463879, "text": "Thank you so much for the incredible 5-Star review Travis!  It was our pleasure.  Your business is very much appreciated and we are very happy to have you as part of the HOD family!  Always feel free to stop in with any questions, concerns, or just to hang out and chat while you're out riding.  Welcome to the family!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113885529579247942422", "name": "Will Lojuk", "time": 1600358545867, "rating": 5.0, "text": "Only place I buy my Harley's.", "pics": null, "resp": {"time": 1600362773483, "text": "Thank you for the awesome review, Will!  Your business is very much appreciated.  See you soon!  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "114220319721851099517", "name": "Carolyn Tetrault", "time": 1584053668660, "rating": 5.0, "text": "Your guys are professional and personal all together.", "pics": null, "resp": {"time": 1584057423447, "text": "Thank you so much for the kind words, Carolyn!  Come see us any time."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110541923761014595341", "name": "Tami Ray", "time": 1555868906570, "rating": 5.0, "text": "Went last night (night before easter) was free beer all you can drink and free crawfish all you can eat... they also had tents set up to buy stuff and a band...\nI'm told they do this often!!", "pics": null, "resp": {"time": 1555983011233, "text": "Thanks for the awesome review, Tami!  We do a big event once every month during the riding season (March-October).  Glad you had a great time and we hope to see you at the next one in May!  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "112490604229338319386", "name": "Joseph Dewberry", "time": 1562650621908, "rating": 5.0, "text": "Love the poker chip designs got the whole set and a couple shirts for a decent price compared to some other shops I've been to. Had some colors on bikes I hadn't seen at other dealerships.", "pics": null, "resp": {"time": 1562683323448, "text": "Thanks for the awesome review and kind words, Joseph!  Come see us any time."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "108154647219404965258", "name": "Michelle Boehme", "time": 1521067318901, "rating": 5.0, "text": "Very nice place. Amazing bike selection inside and the clothes are some of the best I've seen. They have good sales and very friendly staff as well", "pics": null, "resp": {"time": 1521137386641, "text": "Thank you so much for the kind words, Michelle!  Come see us anytime!  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113046042149906143089", "name": "Robert Tatum", "time": 1597937778715, "rating": 5.0, "text": "Go see Dave he will get you what you want", "pics": null, "resp": {"time": 1598653864822, "text": "Thank you for the awesome review, Robert!  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110569959529184876278", "name": "Pam Fair", "time": 1566262006065, "rating": 5.0, "text": "Nice place to stop out of Birmingham. Glad we saw it.", "pics": null, "resp": {"time": 1566313032744, "text": "Thanks for stopping in and for the kind words, Pam!  Hope to see you again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "103226926117846990961", "name": "Charles Bullard", "time": 1600895327744, "rating": 5.0, "text": "Very pleasant and friendly", "pics": null, "resp": {"time": 1601394162695, "text": "Thank you for the great review and kind words, Charles!  Come see us again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "101461647410044068205", "name": "Dewayne Reed", "time": 1602173652147, "rating": 5.0, "text": "Very nice place", "pics": null, "resp": {"time": 1602252958296, "text": "Thank you for the kind words, Dewayne!  Come back to see us again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "112463406526100158922", "name": "Don Logue", "time": 1562008835962, "rating": 5.0, "text": "Awesome service department. From start to finish", "pics": null, "resp": {"time": 1562170111935, "text": "Thanks for the awesome review and kind words, Don!  Happy to help.  Come see us any time!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113154173847592709635", "name": "Delena Edmondson", "time": 1548696343611, "rating": 5.0, "text": "Very nice place. Lots of motorcycle great variety of clothes and accessories", "pics": null, "resp": {"time": 1548698054221, "text": "Thank you for the awesome review and kind words, Delena!  Come see us any time. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116267252689433026650", "name": "Terra Janel", "time": 1505343489686, "rating": 5.0, "text": "Awesome service, very helpful staff!  Especially Erin.  💛", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP3qbZ3k2RZ5I0MBYMOOEgeAAy6mRj25qP08DyE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNK35JhYPFzqJbUR1DQyvc6JoRaNKbdZ5ELobRI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNGcIyonsdi9IeTmJRmroIwc8wkMfduZj6BUhGh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMmVqtcYBWBvd5_sKFNQNiCixWjxVjGcQkZTidz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO2bNrCacnNVkwd1XsKPgpfbDEi3T32WF-UKsVe=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNgyvcG3rDrfB7x04sAZWWmxyipRDTnw4ayz0lC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPiyRK-CQmKesLvqb-01KCXbdbHIIuy0fYhJo8j=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMk5V3wQX7RJGYUMpAuRy_tvENxuAh-w7X7zFtw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNJEeAWmmxRbb3yJe-q7KGbFm8bU_8YY6994Hv0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPYhFRfwqnE4--dd6d8CUkE_fea-O7tJLdPfToB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMOLaj3DhhtTFzpXQZnzXkYsfKoUEyWN20r3hMC=w150-h150-k-no-p"]}], "resp": {"time": 1505350038024, "text": "Thank you for the awesome review and 5 stars!  Come back to see us anytime. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116611573630132721978", "name": "Daniel Topping", "time": 1532652485160, "rating": 4.0, "text": "Enjoyed the custom bike show, did not enjoy the uber super loud sound system of one of the bikes. Very annoying, had to leave the showroom to protect my sanity. Thanks and kudos for the free food and drinks. Will do it again next time.", "pics": null, "resp": {"time": 1532662299115, "text": "Thanks for coming out, Daniel!  I'm sorry to hear about the sound issue.  It was part of the designer's showcase.  Hope to see you at our next event coming up in August."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "106245688793506188339", "name": "Mark Roberts", "time": 1539624200759, "rating": 5.0, "text": "Six of us from Kansas stopped in to get Poker Chips.  The dealership was very spacious.  A lot of bikes to look at. Very clean. Friendly employees.", "pics": null, "resp": {"time": 1539745901238, "text": "Thanks for the awesome review and kind words, Mark!  Come see us any time you're in the area.  Hope to see you guys again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "103226926117846990961", "name": "Charles Bullard", "time": 1600895327744, "rating": 5.0, "text": "Very pleasant and friendly", "pics": null, "resp": {"time": 1601394162695, "text": "Thank you for the great review and kind words, Charles!  Come see us again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113046042149906143089", "name": "Robert Tatum", "time": 1597937778715, "rating": 5.0, "text": "Go see Dave he will get you what you want", "pics": null, "resp": {"time": 1598653864822, "text": "Thank you for the awesome review, Robert!  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "101461647410044068205", "name": "Dewayne Reed", "time": 1602173652147, "rating": 5.0, "text": "Very nice place", "pics": null, "resp": {"time": 1602252958296, "text": "Thank you for the kind words, Dewayne!  Come back to see us again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116290827828103559616", "name": "Lynn Johnson", "time": 1533225338240, "rating": 5.0, "text": "On a road trip two weeks ago I broke a clutch cable in afternoon traffic on 280 in Birmingham. Hot as blazes,  shops closing up, I was far from home, in real trouble, with somewhere to be. Called Heart of Dixie. They had the obsolete cable in stock, but we're getting ready to close for the day. Service Manager Zack Apple went above and beyond to get me back on the road. Not only did he bring the cable to me at the point of breakdown, but he also brought a truck and trailer, and took myself and my bike to my destination so I could make the repairs I needed to continue on my way. Kudos to HOD HD for going the extra mile to see that my trip went ahead without delay.", "pics": null, "resp": {"time": 1533227784992, "text": "Thanks for the awesome review and kind words, Lynn!  It was no problem at all and we were happy to help."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113154173847592709635", "name": "Delena Edmondson", "time": 1548696343611, "rating": 5.0, "text": "Very nice place. Lots of motorcycle great variety of clothes and accessories", "pics": null, "resp": {"time": 1548698054221, "text": "Thank you for the awesome review and kind words, Delena!  Come see us any time. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110370792013696210367", "name": "Mark Payne", "time": 1560618879517, "rating": 5.0, "text": "Great service! Helpful and friendly from the first step in the door!", "pics": null, "resp": {"time": 1560619554466, "text": "Thank you so much for the awesome review, Mark!  Come see us any time.  Let's ride!  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116242744604892265957", "name": "Billy Hutchison", "time": 1506815460137, "rating": 3.0, "text": "Great store and great products, but the service is seriously lacking!  Bike has been there 4 days for a LED light and oil change. Finally changed the oil, never even ordered the part! Bike came back filthy with an oil spill on the side after I was told it was in wash! (Then told they didn't have time)", "pics": null, "resp": null, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115427627360239433940", "name": "Melissa Davis", "time": 1512586997943, "rating": 5.0, "text": "Loved the service! The cashier was very friendly, and helped me hide a Christmas purchase from my husband lol, he was there with me. I love the products they have, and there's a lot of gifts to buy for the occasion.", "pics": null, "resp": {"time": 1512588034002, "text": "Thank you for the awesome review and kind words!  Come see us anytime. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113474271831977368883", "name": "Rhonda Gerardo", "time": 1532305763438, "rating": 3.0, "text": "People are very helpful and nice. The only complaint I have is the Ladies rest room was nasty. Garbage all over floor, nasty toilets and smelled of urine", "pics": null, "resp": {"time": 1532321049168, "text": "Thank you for taking the time to leave us a review.  Sorry to hear about the ladies restroom and to see only 3 stars.  The issue with the ladies restroom is definitely not the norm here as we have cleaners take care of our dealership daily.  Not making excuses but a huge bike night with tons of people tends to make a mess that takes more time than usual to clean up.  Very sorry for the inconvenience and we hope to make your next Heart of Dixie H-D visit a 5-star experience."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "102539313491963217458", "name": "Ms NL Ellis", "time": 1542149001325, "rating": 5.0, "text": "We visit all Harley stores wherever we travel.  Love them all.", "pics": null, "resp": {"time": 1542149700074, "text": "Thank you for the kind review!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116893126018067040105", "name": "Jeff Smith", "time": 1558220817795, "rating": 5.0, "text": "Got my 1st real Harley-Davidson fat boy low rider 2016 great help with all accessories & Amazing customer service experience!! Thanks George& all who work with me!!!😎😎😎", "pics": null, "resp": {"time": 1558223793438, "text": "It's an awesome ride, too!  😎 Thank you for your business and for choosing Heart of Dixie H-D!  Come see us any time and if you ever need anything, give us a call.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115566737369398213198", "name": "Charles Harris", "time": 1570501759661, "rating": 5.0, "text": "There for a run and had a great time", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOugZgQdOTRQ9xQhlQA7EdlkwbB7hjdd2D_tjwW=w150-h150-k-no-p"]}], "resp": {"time": 1570503017642, "text": "Thank you for the great review, Charles! Come see us any time."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "106988455427873847968", "name": "Stephanie Reed", "time": 1575226290297, "rating": 2.0, "text": "First time coming in. The store had no customers, not a single person said hi to us. Walked around and walked all the way out to the car without a single “hey” didn’t even snag a poker chip. Wasn’t worth it.", "pics": null, "resp": {"time": 1575496197137, "text": "Hi Stephanie, very sorry to hear this.  As you can see from our other reviews, this is definitely not the norm here at Heart of Dixie H-D.  Every customer is very important to us.  Please give our GM, Mike DeSantis, a call at your earilest convenience to give us an opportunity to make sure you're taken care of.  (205) 560-1234"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "106849425596652867091", "name": "Austin Hodge", "time": 1566178257197, "rating": 5.0, "text": "Got a great deal love the bike definitely recommend", "pics": null, "resp": {"time": 1566184975120, "text": "Thanks for the awesome review and for choosing Heart of Dixie H-D, Austin!  Happy to help!  Come by to see us any time."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115427627360239433940", "name": "Melissa Davis", "time": 1512586997943, "rating": 5.0, "text": "Loved the service! The cashier was very friendly, and helped me hide a Christmas purchase from my husband lol, he was there with me. I love the products they have, and there's a lot of gifts to buy for the occasion.", "pics": null, "resp": {"time": 1512588034002, "text": "Thank you for the awesome review and kind words!  Come see us anytime. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "104392181794534467819", "name": "michael crowley", "time": 1524253772160, "rating": 5.0, "text": "Great selection. Knowledgable sales people. And the guy selling the hot pickled eggs is #1.", "pics": null, "resp": {"time": 1524291327716, "text": "Love it!  Thanks for the awesome review, Michael!  Come see us anytime.  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "114409072841962708292", "name": "Jr Land", "time": 1583467692777, "rating": 5.0, "text": "Great people with a great bike selection", "pics": null, "resp": {"time": 1583591662421, "text": "Thank you for the kind words!  Come see us any time."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110698751945766122877", "name": "Holly Miller", "time": 1509131592510, "rating": 3.0, "text": "Good clothing selection and lots of bikes to keep you occupied. Have many events throughout the season. Nice staff.", "pics": null, "resp": {"time": 1509132540592, "text": "Hi Holly, Thank you so much for the kind words.  Sorry to see only 3 stars, though.  Please let us know what we can do to make your Heart of Dixie H-D visits a 5 star experience."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115763890253525582670", "name": "Bob George", "time": 1457016652114, "rating": 5.0, "text": "Stan, our salesman, and Pat, the Finance Manager, made the whole experience of purchasing a new bike extremely easy.  They bent over backwards to ensure we were satisfied with our purchase and they did not disappoint.\n\nNo wonder they are the premiere HD dealership in Alabama!", "pics": null, "resp": {"time": 1457206721402, "text": "Hey Bob. Thank you very much for the incredible 5-Star rating and review!  Your business is very much appreciated and we're proud to have you in the HOD family!  Let's Ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "103501819788807110542", "name": "Marjorie Cagle", "time": 1597533372902, "rating": 5.0, "text": "Very helpful and nice", "pics": null, "resp": {"time": 1597606052881, "text": "Thank you so much for the kind words, Marjorie!  Come see us anytime.  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "111371963135725276688", "name": "michele brown", "time": 1494457514526, "rating": 5.0, "text": "Exceptional service! While on vacation, they had the part we needed and made the time to install it so we could continue on. Very much appreciated, thank you!", "pics": null, "resp": {"time": 1494458802719, "text": "Thank you for the awesome 5 star review, Michele!  We're happy to help.  Hope to see you guys again soon.  Let's Ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "107734016330883742843", "name": "Bo Andrews", "time": 1595468826291, "rating": 5.0, "text": "Outstanding Service department!!", "pics": null, "resp": {"time": 1595530078536, "text": "Thank you for the awesome review and kind words, Bo! Happy to help!  Give us a call or come by anytime.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "117822961182797580578", "name": "hvacwizard24", "time": 1542565516907, "rating": 5.0, "text": "Awesome team. Makes you feel like you are at home!", "pics": null, "resp": {"time": 1542567181661, "text": "Thank you for the awesome review and kind words!  Come see us any time."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116946448149522519518", "name": "RACHEL OWENS", "time": 1538520658341, "rating": 5.0, "text": "Great place friendly atmosphere. Reps were very nice and attentive.", "pics": null, "resp": {"time": 1538641144148, "text": "Thank you for the kind words and awesome review, Rachel!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116478335215552088634", "name": "Nicole Taylor", "time": 1523301616705, "rating": 5.0, "text": "Very knowledgeable and kind staff, you can tell that they are all one big family and they love their jobs. Also everything is so shiny!", "pics": null, "resp": {"time": 1523303222168, "text": "Thank you so much, Nicole!  Come see us anytime. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110098472133405999137", "name": "Charles Franklin", "time": 1531392524787, "rating": 1.0, "text": "I went in to buy myself, my wife, and daughter all new shirts 2 different men asked me how I was doing, NOONE asked \"may I help you\" I get up to the cash register to pay $102 for my shirts, I told the lady I was from Poplar Bluff MO and just drove 6 1/2 hours to get here, didn't interest her, told her I was just on a poker run in Illinois last Saturday with 200 bikes, didn't interest her, what did interest her was when I asked could I pay for it with rolled up coins, she was all happy to accept this till my daughter brought the money in, she then proceeded to tell me it would take about another 30-45 minutes cause she has to open every roll of coins, and count them, I asked her why do this just pick out 1-2 of them open them and count those, she informed me that if it was short just 1 coin, it would come out of her pocket, so I threw $3 on top of the change and said \"here this should cover the missed coin so instead of paying $101 and some change for 3 shirts, I ended up paying $102 in rolled change plus 3- $1 bills so $105 for 3 shirts and she didn't even give me my change. I'm going everywhere I know (Facebook,media, newspapers,etc.) Telling my story \"DO NOT SHOP HEART OF DIXIE HARLEY DAVIDSON IN PELHAM ALABAMA!!!!! )", "pics": null, "resp": null, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "104139220518372393175", "name": "Nevaeh Johnson", "time": 1517791700661, "rating": 5.0, "text": "Absolutely amazing place. Great service. Very calm environment. I love this place.", "pics": null, "resp": {"time": 1516483563832, "text": "Thanks for the 5 stars, Elizabeth!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "104706983011139602400", "name": "Robby Williams", "time": 1497756002914, "rating": 5.0, "text": "Great place to do business with. I got next day shipping on my order. Very quick service.", "pics": null, "resp": {"time": 1497887413833, "text": "Thanks for the awesome review, Robby!  Your business is very much appreciated."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "112099201804947053292", "name": "Owen Banks", "time": 1547323161792, "rating": 5.0, "text": "Great place. Huge inventory, great parts and accessories inventory.", "pics": null, "resp": {"time": 1547341730596, "text": "Thanks for the awesome review, Owen!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "109839120767505765687", "name": "Michael Nance", "time": 1518388441180, "rating": 5.0, "text": "Fantastic place.  Was there for the big Alabama State Arm Wrestling tournament.  I hope to be there again next year.", "pics": null, "resp": {"time": 1518451460270, "text": "Thanks for the kind words, Michael!  Hope to see you again soon!  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "111205181654081019166", "name": "Amanda Vickers", "time": 1616868884965, "rating": 5.0, "text": "Friendly staff", "pics": null, "resp": {"time": 1617001567324, "text": "Thank you for the kind words, Amanda! Come see us again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "117713409331265718526", "name": "Maurice Adkins", "time": 1517667140773, "rating": 5.0, "text": "Awesome place and people. Great events. Love the selection in their store.", "pics": null, "resp": {"time": 1518114344751, "text": "Thanks for the awesome review and kind words, Maury!  Come see us anytime. Let's ride! :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116012484013484701834", "name": "Donnie Cartier", "time": 1588086516595, "rating": 5.0, "text": "Great customer service.", "pics": null, "resp": {"time": 1588090199776, "text": "Thank you for the kind words, Donnie!  Your business is very much appreciated!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "107268710585634683831", "name": "Brent Coker", "time": 1485141530324, "rating": 5.0, "text": "Good selection of bikes and gear. Sales people are not over bearing. Bike nights are a blast.", "pics": null, "resp": {"time": 1485239529908, "text": "Thanks for the awesome review and 5 stars Brent!  Always great seeing you.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "107704435430790586577", "name": "Lou's Unlimited Adventures", "time": 1543867713710, "rating": 5.0, "text": "Every time we travel we had to stop by at Harley Davidson and get some shirts. Love the selection!", "pics": null, "resp": {"time": 1543868577612, "text": "Awesome! Thanks for stopping in and for the great review!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "103431109133719040163", "name": "christian ortiz", "time": 1462317524348, "rating": 5.0, "text": "Bought my first Harley at the Heart of Dixie this past weekend, service was excellent! Larry Wilson was my salesman, very patient and professional. Thanks guys, definitely going back.", "pics": null, "resp": {"time": 1462322928483, "text": "Hey Christian!  Thank you for the 5-star rating and awesome feedback!  Your business is very much appreciated!  Stop in anytime.  Welcome to the family!  Let's Ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "103107151236152529974", "name": "Richard Tasker", "time": 1526243761148, "rating": 5.0, "text": "Stopped to buy a tshirt and left with a 2007 BMW 1200RT motorcycle!  But no tshirt...  Very friendly and helpful employees.  Huge selection of Harleys and some other used cycles.  Plus lots of accessories and merchandise.", "pics": null, "resp": {"time": 1526281562666, "text": "Wow! Thanks for the awesome review, Richard!  Your business is very much appreciated.  Come see us anytime."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110253950797969469664", "name": "Chris Reeves", "time": 1486397427062, "rating": 3.0, "text": "Nice place... don't expect much in the way of help while you browse though.  I guess it's nice to not have to deal with a pushy salesperson but a greeting wouldn't hurt.", "pics": null, "resp": {"time": 1487262093415, "text": "Hey Chris,  Sorry about your recent experience at HOD.  I hate to see only 3 stars and read that you weren't helped by anyone.  That definitely doesn't sound right and I'm very sorry for that.  If you will, please give our sales manager, Chase Harris,  a call or come by anytime as we'd like to make sure you're taken care of.  205-560-1234"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115539986437311479785", "name": "Gary Harris", "time": 1472446954213, "rating": 5.0, "text": "Probably one of my favorite Harley locations. Had a seat rest installed on my bike, took all of about an hour. Great service, outstanding service manager.", "pics": null, "resp": {"time": 1472493970450, "text": "Thanks for the great review Gary!  Your business is very much appreciated.  Let's Ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "109618526724724679637", "name": "Bob Kuehner", "time": 1445346698364, "rating": 4.0, "text": "UPDATE on 10/20/2015... The GM reached out to me quickly and decisively and solved my most recent problem.  I was really impressed with what he said about his commitment to making the quality of service at Heart of Dixie as great as the quality of shopping and sales.\n\nORIGINAL POST on 10/15/2015... Loved the \"bike purchase\" part--5 stars.  Bought a brand new Vrod Muscle in 2011 and a new Road Glide Ultra in 2012.  Unfortunately, like so many other businesses out there, once you buy they forget all about you.  I'm speaking specifically about service--1 star.  The quality of service is fine--4 star, but the speed of service is what kills the rating for me--1 star.  Waiting two weeks on a regular basis to get your bike back is crazy.  That's been my experience on multiple occasions.  Counting today, five times, I've discovered problems as I'm about to go out of town on a ride.  They've been completely unwilling to work me in and help out so that I could make my trips.  Today was a little different.  I tried to get through to service and left messages beginning a 4 pm and now they've closed and still no call back.  I've had much better luck on service with Rider's Harley Davidson in Trussville.  Interesting to me that both stores are owned by the same man.  I've heard it said that the easiest customer to get is the one you already have.  In this particular case, I'll have to decide if the \"joy\" of owning a Harley is worth the aggravation of getting it taken care of!", "pics": null, "resp": {"time": 1445528061992, "text": "Hi Bob, We're very happy that we were able to get this fixed for you.  We greatly appreciate your business and strive to make your Harley-Davidson experience here at Heart of Dixie top notch.  Please don't hesitate to reach out to us in the future as we're always here to help.  Thanks again and we look forward to working with you again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "102345767723159344051", "name": "hellbilly 27527", "time": 1522706327276, "rating": 5.0, "text": "I purchased a hd recently from George who was amazing. George is extremely knowledgeable and very low pressure. Every department is amazing i recommend these guys to anyone looking for a new harley sevice and parts. Thank yall for everything!", "pics": null, "resp": {"time": 1522708829877, "text": "Wow! Thanks for the awesome 5 star review!  Your business is very much appreciated.  Please don't hesitate to reach out anytime you need anything.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113243436123187576862", "name": "Stacey Olson", "time": 1512954389026, "rating": 5.0, "text": "Great store!  Lots of bikes to choose from.  Everyone was helpful!", "pics": null, "resp": {"time": 1512956558929, "text": "Thanks for the awesome 5 star review and kind words, Stacey!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "105464582615899407537", "name": "Shane Macon", "time": 1513431177585, "rating": 5.0, "text": "Took the kids for free pics with santa and had a great time, spent a little money on chrome.", "pics": null, "resp": {"time": 1509232385305, "text": "Thanks for the 5 stars, Shane!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "107023234975229974999", "name": "Jimmy Parrish", "time": 1440339699389, "rating": 5.0, "text": "Purchase my first Harley from them great service Jacob Ellis did a wonderful job. The process was so smooth best I ever had great doing business with them.", "pics": null, "resp": {"time": 1440429601369, "text": "Hey Jimmy.  Thank you for your business and taking the time to leave us a 5-Star review!  Your business is very much appreciated and we're happy to have you in the HOD family.  Anytime you need anything let us know.  Welcome to the family!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110328803437393943785", "name": "Lisa Wilson", "time": 1500913129684, "rating": 5.0, "text": "Great selection of clothes even in the harder to find womens sizes and lots of mens clothes too. Good prices. Friendly service.", "pics": null, "resp": {"time": 1500913816076, "text": "Thank you so much for the kinds words and 5 stars, Lisa!  Your business is greatly appreciated!  Come see us anytime. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113078759911729914026", "name": "Amanda Rhodes", "time": 1595343459325, "rating": 5.0, "text": "👍", "pics": null, "resp": {"time": 1595347182655, "text": "Thank you for the 5 stars, Amanda!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "114949380991081373440", "name": "Stacey Everett", "time": 1547318957211, "rating": 5.0, "text": "Nice folks! Cool dealer t-shirts", "pics": null, "resp": {"time": 1547341752428, "text": "Thanks for the kind words and 5 stars, Stacey!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113163023772524931615", "name": "Thomas Grigsby", "time": 1555292762562, "rating": 5.0, "text": "Great place with an amazing selection of Harleys.", "pics": null, "resp": {"time": 1555391907589, "text": "Thanks for the kind words and awesome review, Thomas!  Come back to see us any time.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "112997852544940855986", "name": "patrick sullivan", "time": 1460667703991, "rating": 5.0, "text": "Awesome place to do business. People are great to work with and will help and they are friendly as well.", "pics": null, "resp": {"time": 1461079964187, "text": "Thanks for the awesome 5-Star review Patrick!  Your business is very much appreciated!  See you again soon!  Let's Ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "100339577663044292146", "name": "Misty Allison", "time": 1501014064199, "rating": 4.0, "text": "Picked up a bike I had fixed, and some parts. Always couteous, and parts guys, David and Bill are always great!", "pics": null, "resp": {"time": 1501014769090, "text": "Thanks for the awesome review, Misty!  Come see us anytime. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115104713867424917085", "name": "larry Hatchett", "time": 1534605849393, "rating": 1.0, "text": "Well once again I take my bike in for issue I couldn't find out what it was asked a friend he said could be rear bearings or neck bearings unload go in talk with guy at counter( problem, bike has a roar and vibration at 20 to 40 mph when leaning toward the left can tell sound is coming from rear has a wobble at 70 + mph to the left ) so we walk outside I explained problems and my concern about bearings was told I needed to buy a rear tire [not covered in warranty] [bike has 4500 miles] because it was cupped on left side because I was making to many lefthand turns I asked if they could be a problem with bike causing the cupping told no is was how I was riding  so I asked if I purchased rear tire and the vibration is still in bike do I have to still pay for rear tire when it was not the problem was told yes I do was also told the neck bearings wasn't covered in warranty understand this all come from just walking outside NO TEST RIDE nothing but conversation about how I need to buy stuff before they even check the bike out seams like all this service department is about is selling parts to find out problems instead of having good techs to find problems for customers just because we buy 20,30,40 thousand dollar bikes don't mean we want to spend hundreds more on hunches of what might be a problem.", "pics": null, "resp": {"time": 1534614343062, "text": "Hey Larry, I understand your frustation and I'm very sorry to hear this.  I will have this reviewed by our GM and will make sure this is taken care of for you.  Please let us know the best way to get in touch with you so we can get this fixed."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "104827607041265457239", "name": "David Moss", "time": 1560655606781, "rating": 5.0, "text": "Awesome the staff was the best thanks again Lee", "pics": null, "resp": {"time": 1560666126276, "text": "Thanks for the awesome review, David!  Stop by any time."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "118446685630028300637", "name": "Mike Johnston", "time": 1515713393331, "rating": 5.0, "text": "Friendly, Courteous, Lot's of bikes to choose from. Great HOG Chapter.", "pics": null, "resp": {"time": 1515714434820, "text": "Thanks so much for the awesome review and kind words, Mike!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115688536578191293098", "name": "Lee Lucas", "time": 1504381705054, "rating": 5.0, "text": "Very Nice dealership", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMCTXS8tclB4lyKWaGt1PTww9d5n9idR9PGeC3G=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP2fJuDGqp0EgHrzs6kW20N7nGrqGF3AYWGUhyZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMgA2COj-rux04jkt5EPA-20fJ02-OCFx4K9mC2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM3ESVyrgYMzoSJwtg2t5lW998hgJsDWh94nfVI=w150-h150-k-no-p"]}], "resp": {"time": 1504539848794, "text": "Thanks, Lee!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110524274462189814188", "name": "Cassandra Naylor", "time": 1561514018777, "rating": 5.0, "text": "The employess are very helpful.", "pics": null, "resp": {"time": 1561127330090, "text": "Thank you so much, Cassandra!  Come see us any time.  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "107807494277611172739", "name": "Joy Rodriguez", "time": 1502230648834, "rating": 5.0, "text": "Helpful staff, without being pushy. Great selection of merchandise.", "pics": null, "resp": {"time": 1502231997597, "text": "Thank you for the kind words and 5 stars!  Hope to see you again soon! :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "103654033497491496740", "name": "William Herbinger", "time": 1497724782364, "rating": 5.0, "text": "Wonderful place to shop... motorcycles... accessories... clothing... great service and a great atmosphere", "pics": null, "resp": {"time": 1497887375614, "text": "Thank you for the kind words and 5-star rating!  Come see us anytime."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "101529784954737070628", "name": "Richie C", "time": 1593904995966, "rating": 4.0, "text": "Hopefully they're open tomorrow...", "pics": null, "resp": {"time": 1593966534768, "text": "Hi Richie, sorry to see only 4 stars. We are open 7 days a week so come by anytime.  Please let us know what we can do to make sure your visit is a 5 star experience."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116362716312092561259", "name": "Martha Stark", "time": 1561955678547, "rating": 5.0, "text": "Great place. Great people.", "pics": null, "resp": {"time": 1561956973953, "text": "Thank you for the kind words, Martha!  Come see us any time!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116337481701587173327", "name": "Shane Carter", "time": 1499082005544, "rating": 5.0, "text": "Nice bikes and friendly staff to help you, what ever your need may be.", "pics": null, "resp": {"time": 1499084546142, "text": "Thank you for the awesome 5-star review, Shane!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "102101516867334033637", "name": "Frank Gothard", "time": 1498932934472, "rating": 5.0, "text": "The Team Workers Their Are Very Polite To You. Always Try To Help You When Looking For Certain Things!!! Bought Three Bikes From Them Over The Years!!!", "pics": null, "resp": {"time": 1498933551889, "text": "Always a pleasure and great to see you, Frank!  Thank you for the kind words, awesome 5-star review, and repeat business!  Let's Ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "104346534901845068851", "name": "Brian Curtis", "time": 1561102610311, "rating": 5.0, "text": "1st class act nice store", "pics": null, "resp": {"time": 1561127415456, "text": "Thank you for the kind words, Brian!  Come see us any time.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "112894365513812284181", "name": "Brian Schwarz", "time": 1517686451883, "rating": 5.0, "text": "Bought 2 bikes here. The People there are awesome!!", "pics": null, "resp": {"time": 1517852166995, "text": "Thanks for the awesome review, Brian! Your business is very much appreciated.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "105030987711070464325", "name": "James Lane", "time": 1330105688750, "rating": 5.0, "text": "Mike Desantis and Leslie Woodall ROCK!   I am a Heart of Dixie cusotmer for life!  Keep up the good work!  Thanks again for the great service!", "pics": null, "resp": null, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "107629011638201458775", "name": "Todd Smith", "time": 1475236094381, "rating": 5.0, "text": "Enormous HD dealership with big selection and welcoming staff", "pics": null, "resp": {"time": 1475606852728, "text": "Thanks for the awesome feedback Todd!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "101901193273282968332", "name": "James Drumheller", "time": 1560635865597, "rating": 5.0, "text": "Food is about to be served and the pepper jelly folks are here to serve", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPldyMOhjxYMDZLWY_DLDw6s21MhAQ1lbpbyw6A=w150-h150-k-no-p"]}], "resp": {"time": 1560636512145, "text": "Thanks for the 5 stars, James!! :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115231388785397908238", "name": "Charles Sumner", "time": 1502578898704, "rating": 5.0, "text": "No pressure Harley sales and service. Even will help you customize your bike.", "pics": null, "resp": {"time": 1502637175898, "text": "Thanks for the awesome review, Charles!  Your business is greatly appreciated.  Come see us anytime.  Let's Ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "103987647311829340231", "name": "Tom Weigand", "time": 1555272032573, "rating": 5.0, "text": "Great choice of motorcycles, great knowledgeable staff", "pics": null, "resp": {"time": 1555273173388, "text": "Thanks for the 5 stars and awesome review, Tom!  Come see us any time."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "107491454152111633228", "name": "Jimmy Chambliss", "time": 1564373516099, "rating": 5.0, "text": "Great selection, very helpful staff", "pics": null, "resp": {"time": 1564381917842, "text": "Thanks for the kind words, Jimmy!  Come see us any time."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115645405001454545860", "name": "Gerald Coon", "time": 1496513774847, "rating": 5.0, "text": "Good friendly staff, very nice selection of motorcycles, motorclothes, riding apparel and parts", "pics": null, "resp": {"time": 1496670968201, "text": "Thanks for the awesome feedback and kind words Gerald!  Stop in to see us anytime.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113604399122387329243", "name": "Janice Baker", "time": 1487261184368, "rating": 4.0, "text": "Very nice clean store friendly staff great place to visit", "pics": null, "resp": {"time": 1487261857176, "text": "Thanks for the great review Janice!  Glad you enjoyed your visit.  Stop by anytime. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115942614039092233236", "name": "Amanda Geezler", "time": 1541899234370, "rating": 5.0, "text": "I Bought my husbane a custom harley.....", "pics": null, "resp": {"time": 1541909931482, "text": "Thank you so much for your business!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "104038585796807278984", "name": "John Mitchell", "time": 1528969287948, "rating": 1.0, "text": "Terrible customer service. Even worse than Montgomery harley", "pics": null, "resp": {"time": 1528989093980, "text": "Hey John, Sorry to hear this.  As you can see by or other reviews this is not the norm here at Heart of Dixie H-D.  We'd love to get your feedback on how we can make your next visit a 5-star experience.  If you don't mind, please call our GM, Mike DeSantis, at (205) 560-1234 at your earliest convenience so we can help fix any issues.  Regards"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "103610777712575692006", "name": "Owen Stayner/ThisWorkplace360", "time": 1557972148215, "rating": 5.0, "text": "Good service plenty to look at!", "pics": null, "resp": {"time": 1557972937155, "text": "Thanks for the awesome review, Owen!  Come by any time.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115879869623050245627", "name": "Sherrell Roper", "time": 1582656014978, "rating": 5.0, "text": "Love this place.", "pics": null, "resp": {"time": 1582613843056, "text": "Thank you for the 5 stars, Sherrell!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "111090110760268053279", "name": "JEAN-CLAUDE FRYM", "time": 1547982392395, "rating": 5.0, "text": "The GM was super nice very nice place", "pics": null, "resp": {"time": 1548000417861, "text": "Thank you so much for the kind words!  Come see us again soon."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "107646443188297145480", "name": "Shelia Faulkner", "time": 1531506730081, "rating": 5.0, "text": "Everyone is very nice and speck to you as you are walking in.", "pics": null, "resp": {"time": 1531507371407, "text": "Thank you so much, Shelia!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "118366224036778841275", "name": "James Wilson", "time": 1610127840692, "rating": 5.0, "text": "Friendly staff", "pics": null, "resp": {"time": 1610157881152, "text": "Thank you for the kind words and 5 stars, James!  Come see us again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "114955125800498001058", "name": "Houston McDuffie", "time": 1492975245908, "rating": 5.0, "text": "One of my favorite harley stores in alabama", "pics": null, "resp": {"time": 1492980578936, "text": "Hey Houston,  Thank you for the 5 stars and kind words!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116545565432595140363", "name": "Melissa Triplett", "time": 1535247549864, "rating": 5.0, "text": "Friendly staff. Nice apparel", "pics": null, "resp": {"time": 1535324103153, "text": "Thank you so much, Melissa!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113576951044417441133", "name": "Kenneth “Debauchery1994” Potter", "time": 1532818333701, "rating": 5.0, "text": "Beautiful Harley store well maintained and exquisite decore", "pics": null, "resp": {"time": 1532979145780, "text": "Thanks for the awesome review, Kenneth!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "117907825725591547547", "name": "Monica Hannahs", "time": 1572453221387, "rating": 5.0, "text": "Awesome, friendly service.", "pics": null, "resp": {"time": 1572499349584, "text": "Thank you for the kind words, Monica!  Come see us again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "112442013964483519504", "name": "Cynthia Ratliff", "time": 1498513319851, "rating": 5.0, "text": "Answered all my questions. Very nice people", "pics": null, "resp": {"time": 1498515021442, "text": "It's our pleasure, Cynthia.  Thank you for the kinds words and 5-star rating.   Your business is very much appreciated.  Come see us anytime."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "102023295508275576603", "name": "Sherry Graffeo", "time": 1506327692713, "rating": 5.0, "text": "Everybody was wonderful in helping us with all our questions", "pics": null, "resp": {"time": 1506368606111, "text": "Thank you for the kind words and awesome feedback, Sherry!  Your business is very much appreciated!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "108802188278420027910", "name": "AJ Harris", "time": 1403050720500, "rating": 5.0, "text": "Awesome dealership and great people!!! Always going to buy from these guys.", "pics": null, "resp": {"time": 1404313368956, "text": "We appreciate the opportunity as always.  Customizing your 2014 Street Glide Special was a blast.  It looks and sounds incredible!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "103262428936279907309", "name": "Allen Colvert", "time": 1551898625034, "rating": 5.0, "text": "Very helpful and knoloagable staff", "pics": null, "resp": {"time": 1551935981478, "text": "Thank you so much, Allen!  Come see us anytime."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "102731832486154676667", "name": "Julie Jenkins", "time": 1497905120570, "rating": 5.0, "text": "Excellent staff, most repairs while you wait.", "pics": null, "resp": {"time": 1497906260346, "text": "Thanks for the kind words and 5-star feedback!  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "106007616145064339365", "name": "David Smith", "time": 1581631393655, "rating": 5.0, "text": "Friendly staff huge selection of bikes.", "pics": null, "resp": {"time": 1581699329701, "text": "Thank you for the awesome review, David!  Come see us any time.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "104585679852152421408", "name": "Cynthia Dillon", "time": 1578936889324, "rating": 5.0, "text": "LOOOOVE THIS PLACE!", "pics": null, "resp": {"time": 1579025163113, "text": "Thank you so much, Cynthia!  Come see us any time. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "105428370602788665428", "name": "Dan Cris", "time": 1567328427456, "rating": 5.0, "text": "Awesome", "pics": null, "resp": {"time": 1565067180733, "text": "Thank you for the 5 stars!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "117651744208634483292", "name": "Monty Wright", "time": 1546034445461, "rating": 4.0, "text": "Gotta get a chip while yer there", "pics": null, "resp": {"time": 1546038823061, "text": "Hey Monty, thanks for stopping in!  Sorry to see only 4 stars, though.  Please let us know what we can do to make your next visit a 5 star experience."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "117615268457714159703", "name": "Chase Henson", "time": 1549409387536, "rating": 5.0, "text": "Super nice dealership and helpful staff 🤘🤘🤘", "pics": null, "resp": {"time": 1549485063310, "text": "Thanks for the awesome review, Jordan!  Come see us any time."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "105699415739967407254", "name": "Sturzi1", "time": 1543440736303, "rating": 5.0, "text": "Shop until you drop!", "pics": null, "resp": {"time": 1543474481421, "text": ":)  Thank you!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "105071135387378925684", "name": "Dennis Pitts", "time": 1560655897878, "rating": 5.0, "text": "Bike nights are great", "pics": null, "resp": {"time": 1537715125161, "text": "Thanks for the 5 stars, Dennis!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "101903373032019004524", "name": "Dennis Arnold", "time": 1479475027487, "rating": 4.0, "text": "Spacious and clean. Great selection of bikes.", "pics": null, "resp": {"time": 1479487734511, "text": "Hey Dennis, Thanks for the review and feedback!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "103077968753447294605", "name": "thomas dabson", "time": 1548886726555, "rating": 5.0, "text": "Tiny place but so cool", "pics": null, "resp": {"time": 1548894125935, "text": "Thanks for stopping by, Thomas!  Come see us again soon."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "103680071141156049979", "name": "Sandy Miller", "time": 1557006322070, "rating": 5.0, "text": "Wonderful staff.", "pics": null, "resp": {"time": 1557025509743, "text": "Thank you so much, Sandy!  Come see us any time. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113042685927718944871", "name": "Austin lawrence", "time": 1525630179766, "rating": 5.0, "text": "But if you want a 150cc they don't have it", "pics": null, "resp": {"time": 1525630888953, "text": "Thanks for the 5 stars, Austin!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "104330853266844699910", "name": "Bama Boys Outdoors", "time": 1532737852025, "rating": 5.0, "text": "Awesome place!", "pics": null, "resp": {"time": 1532742353369, "text": "Thanks, Jeremiah!!!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113615503869915059509", "name": "Richard Moore", "time": 1593704560471, "rating": 5.0, "text": "Loved it", "pics": null, "resp": {"time": 1593710037008, "text": "Thank you for the 5 stars, Richard!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "102386452741097511258", "name": "Matt Holland", "time": 1518093735925, "rating": 5.0, "text": "I love dixie and the awesome staff..", "pics": null, "resp": {"time": 1514752555610, "text": "Thanks for the 5 stars, Matt!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116553853896632277662", "name": "Jason Schritter", "time": 1574527785931, "rating": 5.0, "text": "Awesome store!", "pics": null, "resp": {"time": 1574623811243, "text": "Thanks for the great review, Jason!  Come see us again any time."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113354394242603648036", "name": "H.L. Bean", "time": 1530036278608, "rating": 5.0, "text": "Well stocked and friendly staff.", "pics": null, "resp": {"time": 1530036928826, "text": "Thanks for the great review, H.L.!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "112474682119626120609", "name": "Tim Crumly", "time": 1568603753650, "rating": 5.0, "text": "Great dealership", "pics": null, "resp": {"time": 1568605462152, "text": "Thanks for the kind words, Tim!  Come see us again any time."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110005547614763903482", "name": "Phil Burrill", "time": 1523749482835, "rating": 5.0, "text": "Super friendly staff, had a great visit.", "pics": null, "resp": {"time": 1523750790476, "text": "Thanks for the stopping by, Phil!  Hope to see you again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "109742170574428845047", "name": "Billie Kline", "time": 1540089897225, "rating": 5.0, "text": "Loved it had so much fun", "pics": null, "resp": {"time": 1540185210739, "text": "Thanks, Billie!  We had a blast, too!  Looking forward to see ya again soon."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "117122423982293559000", "name": "Miss Rebel “Harley baby” davidson", "time": 1520715934039, "rating": 5.0, "text": "Great hd store", "pics": null, "resp": {"time": 1520716679677, "text": "Thanks so much!  Come see us anytime. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "105301109290243449562", "name": "Angie Spillers", "time": 1505946838845, "rating": 5.0, "text": "Clean,nice,curtious people.great rates....", "pics": null, "resp": {"time": 1505947702587, "text": "Thank you for the kind words, Angie!  Looking forward to seeing you again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116509550121337971839", "name": "Joshua Vandiver", "time": 1528458527291, "rating": 5.0, "text": "Only place I take my bike, and only guys I'll buy from.", "pics": null, "resp": {"time": 1528480489651, "text": "We appreciate that!  Thank you for choosing Heart of Dixie H-D for all your Harley needs!  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116333571079702209881", "name": "Meghan Taylor", "time": 1597173306412, "rating": 5.0, "text": "They did what they were suppose to do..... fix the bike 😀", "pics": null, "resp": {"time": 1555299256335, "text": "Thanks for the 5 star review, Meghan!  Come see us any time.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "105225860948644937531", "name": "Kathy Box", "time": 1599154154700, "rating": 5.0, "text": "Loved it!!!!", "pics": null, "resp": {"time": 1599234867590, "text": "Thank you so much, Kathy!  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "102669319634152855495", "name": "Chris Leckness", "time": 1550973424940, "rating": 5.0, "text": "Well run dealership", "pics": null, "resp": {"time": 1550981154963, "text": "Thanks for the awesome review, Chris!  Come see us anytime."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115493124233440789075", "name": "Michael Handley", "time": 1559425617546, "rating": 1.0, "text": "Everything is overpriced", "pics": null, "resp": {"time": 1559435238418, "text": "Hi Michael, very sorry to hear you feel this way.  Our pricing is in line with the Motor Company's pricing structure and we always do everything we can to make sure our customers get the best deal possible."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "109118667355293970356", "name": "Robert Sjol", "time": 1569089020611, "rating": 5.0, "text": "Visited old friends and shopping for t shirts.", "pics": null, "resp": {"time": 1569175064744, "text": "Thanks for stopping by, Robert!  Come see us any time."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "101157069131569766785", "name": "David Och", "time": 1557486503152, "rating": 4.0, "text": "Need more pocket t-shirts", "pics": null, "resp": {"time": 1557458993315, "text": "Thank you, David!  Please let us know what we can do to make sure your next visit is a 5 star experience."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "106265480632552795418", "name": "shane lyall", "time": 1539559696051, "rating": 4.0, "text": "About like all dealerships. Friendly folks.", "pics": null, "resp": {"time": 1539745957225, "text": "Thanks for the review, Shane.  Sorry to see only 4 stars, though.  Please let us know what we can do to make your next visit a 5 star experience."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "109324550694476672330", "name": "James Sims", "time": 1525362467398, "rating": 4.0, "text": "Not much for the hundred 15th anniversary", "pics": null, "resp": {"time": 1525364780962, "text": "Hey James, thanks for leaving us a review.  I'm sorry to see only 4 stars because of the 115th Anniversary models.  We'd love to hear your feedback in regards to our dealership as we strive to make your Heart of Dixie H-D visits a 5-star experience."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110044359295103851372", "name": "kurt jahnke", "time": 1499374987396, "rating": 5.0, "text": "Great, staff ready to help, direct you to what you are looking, etc !!", "pics": null, "resp": {"time": 1499404592542, "text": "Thanks for the kind words and 5-star rating, Kurt!  Your business is greatly appreciated.  Let's ride! :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113042685927718944871", "name": "Austin lawrence", "time": 1525630179766, "rating": 5.0, "text": "But if you want a 150cc they don't have it", "pics": null, "resp": {"time": 1525630888953, "text": "Thanks for the 5 stars, Austin!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "117975922625527879049", "name": "Anthony Roberts", "time": 1463490162687, "rating": 4.0, "text": "Great place to buy a motorcycle..", "pics": null, "resp": {"time": 1463501578354, "text": "Thanks Anthony!  Your business is very much appreciated!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "102669319634152855495", "name": "Chris Leckness", "time": 1550973424940, "rating": 5.0, "text": "Well run dealership", "pics": null, "resp": {"time": 1550981154963, "text": "Thanks for the awesome review, Chris!  Come see us anytime."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "102389467443920334438", "name": "Valerie White", "time": 1553798632289, "rating": 5.0, "text": "Staff was sweet and helpful", "pics": null, "resp": {"time": 1553840146237, "text": "Thank you so much, Valerie!  Come back to see us anytime. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "100920714795895371764", "name": "Donnelle White", "time": 1495482919292, "rating": 5.0, "text": "Friendly,very helpful staff,all about the customers", "pics": null, "resp": {"time": 1496157267348, "text": "Thank you so much for the kind words Donnelle!  Your business is very much appreciated.  Hope to see you again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "106798760173535221788", "name": "Buddy Hilderbrand", "time": 1590967259336, "rating": 5.0, "text": "Friendly staff.", "pics": null, "resp": {"time": 1591116412998, "text": "Thank you for the kind words, Buddy!  Come see us any time.  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110567203962955887680", "name": "James Goss", "time": 1505063344568, "rating": 4.0, "text": "Very nice building nice shop nice people", "pics": null, "resp": {"time": 1505114324287, "text": "Thanks for the kind words, James!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "117122423982293559000", "name": "Miss Rebel “Harley baby” davidson", "time": 1520715934039, "rating": 5.0, "text": "Great hd store", "pics": null, "resp": {"time": 1520716679677, "text": "Thanks so much!  Come see us anytime. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "103750346457568919078", "name": "Remy Helu", "time": 1552531004181, "rating": 5.0, "text": "Super store with the best of the best", "pics": null, "resp": {"time": 1552531713253, "text": "Thank you so much for the awesome review, Remy!  Come see us any time. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "105954784272957612842", "name": "Dwayne Thurman", "time": 1505427388501, "rating": 5.0, "text": "Extremely helpful and lots of souvenirs", "pics": null, "resp": {"time": 1505583297914, "text": "Thank you for the kind words, Dwayne!  We look forward to seeing you again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110497078608590139865", "name": "Terry Birchfield", "time": 1547362486825, "rating": 5.0, "text": "Awesome", "pics": null, "resp": {"time": 1547442052647, "text": "Thanks, Terry!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "103750346457568919078", "name": "Remy Helu", "time": 1552531004181, "rating": 5.0, "text": "Super store with the best of the best", "pics": null, "resp": {"time": 1552531713253, "text": "Thank you so much for the awesome review, Remy!  Come see us any time. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "114970437943239435336", "name": "Simona Lewis", "time": 1526350636211, "rating": 5.0, "text": "Great", "pics": null, "resp": {"time": 1506361299364, "text": "Thanks for the 5 stars, Simona!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113504496186778480214", "name": "Jared Hill Farm Life", "time": 1540681627889, "rating": 5.0, "text": "Memorable day", "pics": null, "resp": {"time": 1540875334841, "text": "Thank you, Jared!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "114358503032658374077", "name": "m chadwick", "time": 1535233775216, "rating": 5.0, "text": "Nice people", "pics": null, "resp": {"time": 1535324071225, "text": "Thanks for the awesome review, Margie!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "105848793746038546088", "name": "Chris Smith", "time": 1516580918894, "rating": 5.0, "text": "friendly and helpful", "pics": null, "resp": {"time": 1516808007411, "text": "Thanks for the great review, Chris!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116550858313924061274", "name": "Jerome Savage", "time": 1514318511905, "rating": 5.0, "text": "Nice", "pics": null, "resp": {"time": 1514319145636, "text": "Thanks, Jerome!  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "101937967675127935224", "name": "Cynthia Cook", "time": 1558635137320, "rating": 5.0, "text": "Helpful", "pics": null, "resp": {"time": 1558639009639, "text": "Thank you for the 5 stars, Cynthia!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "109510340810867433391", "name": "Ray Cameron", "time": 1530385182560, "rating": 5.0, "text": "Very helpful and courteous", "pics": null, "resp": {"time": 1530412470242, "text": "Thank for the great review, Ray!  We appreciate you choosing Heart of Dixie H-D!  Come see us anytime."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "112131981084466533700", "name": "Jenny Crawford", "time": 1513575735490, "rating": 5.0, "text": "Say hello to Bill in parts for me!!", "pics": null, "resp": {"time": 1513610352952, "text": "Thanks for the 5 stars, Jenny!  Will do. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "102039064394810134833", "name": "Laurey Wharton", "time": 1530323750430, "rating": 5.0, "text": "Best Harley store ever", "pics": null, "resp": {"time": 1530324731297, "text": "Wow! Thank you so much, Laurey!!!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "102389467443920334438", "name": "Valerie White", "time": 1553798632289, "rating": 5.0, "text": "Staff was sweet and helpful", "pics": null, "resp": {"time": 1553840146237, "text": "Thank you so much, Valerie!  Come back to see us anytime. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "101466056660691811912", "name": "carol ann mclaughlin", "time": 1511404415094, "rating": 5.0, "text": "Love it", "pics": null, "resp": {"time": 1511805432402, "text": "Thanks for the awesome review, Carol Ann!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "108395296444140638851", "name": "Joe Marc", "time": 1548091063248, "rating": 5.0, "text": "Buy one get one free.", "pics": null, "resp": {"time": 1548096632754, "text": "Thanks for the 5 stars, Joe."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "111748253322039058973", "name": "Hitman", "time": 1548952051792, "rating": 5.0, "text": "Awesome place", "pics": null, "resp": {"time": 1548976764840, "text": "Thanks for the kind words, Alan!  Come see us again soon."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "105525964749408871359", "name": "Alan Farmer", "time": 1529584663001, "rating": 5.0, "text": "Great dealership, great people!", "pics": null, "resp": {"time": 1529618802289, "text": "Thanks for the kind words, Alan!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "112183723648067392624", "name": "Paul Bekkers", "time": 1507888718904, "rating": 4.0, "text": "Cool shirt designs!", "pics": null, "resp": {"time": 1507938222970, "text": "Thanks, Paul!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "100277870410242107347", "name": "Brandon Williams", "time": 1523318425404, "rating": 5.0, "text": "The only place in Birmingham to buy motorcycles", "pics": null, "resp": {"time": 1523372980810, "text": "Thanks for the awesome review, Brandon!  Your business is greatly appreciated!  Come see us anytime.  Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110567203962955887680", "name": "James Goss", "time": 1505063344568, "rating": 4.0, "text": "Very nice building nice shop nice people", "pics": null, "resp": {"time": 1505114324287, "text": "Thanks for the kind words, James!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115140169293139559393", "name": "Clay Hasenfuss", "time": 1531313413629, "rating": 5.0, "text": "Please go check them out. Ask for Rick", "pics": null, "resp": {"time": 1531323265667, "text": "Thanks for the great review, Clay!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "104456756072904126506", "name": "Felicia Brown", "time": 1503499625935, "rating": 5.0, "text": "Great selections and great prices", "pics": null, "resp": {"time": 1503500262700, "text": "Thanks for the awesome review and 5 stars!  Come back to see us anytime. : )"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "106900851577082557616", "name": "Karen Hill", "time": 1526918366775, "rating": 5.0, "text": "Got a Do-Rag!", "pics": null, "resp": {"time": 1526919478978, "text": "Awesomeness!  Thanks for the 5 stars.  Come see us again soon! :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110152740791740987403", "name": "michael nance", "time": 1518516001353, "rating": 5.0, "text": "Fantastic place", "pics": null, "resp": {"time": 1518586494277, "text": "Thanks for the kind words and 5 stars, Michael!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "101855497522623734509", "name": "Jace Murchison", "time": 1517772121743, "rating": 1.0, "text": "Got ripped a new one at this place", "pics": null, "resp": {"time": 1517774717409, "text": "Hi Jace,\nThanks for taking the time to leave us a review.  I'm sorry to hear about your recent experience.  As you can see by other reviews this is not the norm here at Heart of Dixie H-D.  We appreciate your business and value your opinion so please give Mike, our GM, a call at your earliest convenience as we'd like to go over your visit and remedy any issues you have.  205-560-1234"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "112103590645430948969", "name": "Jaden Sharp", "time": 1527797370046, "rating": 5.0, "text": "There knifes are cool", "pics": null, "resp": {"time": 1527798580724, "text": "Thanks for the 5 stars, Justin!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113039070209138384299", "name": "Jeff Jones", "time": 1520485179296, "rating": 5.0, "text": "Great people that goes above and beyond", "pics": null, "resp": {"time": 1520485784217, "text": "Thanks for the kind words and 5 stars, Jeff!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116919938975449099710", "name": "Sandra Lyle", "time": 1497120345546, "rating": 5.0, "text": "Cool place to buy a Harley!", "pics": null, "resp": {"time": 1497251504196, "text": "Thanks, Sandra!  We appreciate your business.  Stop in to see us anytime. :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116243904543705676743", "name": "Kevin Lunsford", "time": 1513799194562, "rating": 4.0, "text": "Friendly staff in the motorcycle sales area but the motor cloths was a little off.", "pics": null, "resp": {"time": 1513799964541, "text": "Hey Kevin,\nThanks for stopping by and for taking the time to leave a review!  Sorry to see only 4 stars.  We'd love to get your opinion on how we can make your future visits a 5 star experience.  Feel free to contact us by email or by phone anytime.  http://heartofdixiehd.com"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "111406598028845262527", "name": "roger harper", "time": 1496609118128, "rating": 5.0, "text": "One of my favorite places.", "pics": null, "resp": {"time": 1496671153611, "text": "Very much appreciated, Roger!  Stop in to see us anytime."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116495100954420563628", "name": "Russell Perrin", "time": 1496590731587, "rating": 5.0, "text": "Very friendly staff!", "pics": null, "resp": {"time": 1496671056548, "text": "Thanks for the 5 stars and kind words, Daenda!  Come see us anytime.  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115128742142588061205", "name": "Donald Peachy Leach", "time": 1513272912800, "rating": 5.0, "text": "Employees very helpful", "pics": null, "resp": {"time": 1513277368374, "text": "Thank you for the 5 stars and awesome feedback, Donald!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "100920714795895371764", "name": "Donnelle White", "time": 1495482919292, "rating": 5.0, "text": "Friendly,very helpful staff,all about the customers", "pics": null, "resp": {"time": 1496157267348, "text": "Thank you so much for the kind words Donnelle!  Your business is very much appreciated.  Hope to see you again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "115610978491922256260", "name": "Brenda Haynes", "time": 1491146103339, "rating": 4.0, "text": "Nice bikes and ppl", "pics": null, "resp": {"time": 1491146766833, "text": "Thanks for the great review and kind words Brenda! :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113717354006366512255", "name": "scott moore", "time": 1489876104247, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1489877936831, "text": "Thanks for the great 5 star review!  Your business is very much appreciated! Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110142866939480551860", "name": "Jeff NBama", "time": 1489676475154, "rating": 5.0, "text": "My \"go-to\" Harley dealer.", "pics": null, "resp": {"time": 1489678702386, "text": "Thanks Jeff! Your business is very much appreciated! Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "101235662410463769110", "name": "Rob Newman", "time": 1488119793698, "rating": 4.0, "text": "The staff was nice and friendly", "pics": null, "resp": {"time": 1489592798689, "text": "Thanks for the kind words and for taking the time to leave us a review!  Stop in to see us anytime."}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "111273693739644877581", "name": "Kim Jacobs", "time": 1498348819164, "rating": 5.0, "text": "Awesome....5*", "pics": null, "resp": {"time": 1498432834254, "text": "Thank you for the 5 stars, Kim!  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "105954784272957612842", "name": "Dwayne Thurman", "time": 1505427388501, "rating": 5.0, "text": "Extremely helpful and lots of souvenirs", "pics": null, "resp": {"time": 1505583297914, "text": "Thank you for the kind words, Dwayne!  We look forward to seeing you again soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "105636484057155912191", "name": "Jonathan Edwards", "time": 1496906998987, "rating": 5.0, "text": "Place is HUGE!!!", "pics": null, "resp": {"time": 1497027448099, "text": ":)  Thanks Jonathan!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "112646666932419504353", "name": "Roy Jr", "time": 1494520025878, "rating": 1.0, "text": "Didn't get the feeling black folks were welcome...wouldn't spend a dime here.", "pics": null, "resp": {"time": 1495306940893, "text": "Hi Roys Joy,  Sorry you feel that way and I'm sad to hear about your experience at Heart of Dixie H-D.  Our dealership doors have always been open to everyone as our customers come from all walks of life.  I'd like to get your feedback regarding your experience and I invite you to give me a call at your earliest convenience.  -Mike 205-560-1234\n\n#UnitedWeRoll\nhttp://bit.ly/2qJi0So"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "106900851577082557616", "name": "Karen Hill", "time": 1526918366775, "rating": 5.0, "text": "Got a Do-Rag!", "pics": null, "resp": {"time": 1526919478978, "text": "Awesomeness!  Thanks for the 5 stars.  Come see us again soon! :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116495100954420563628", "name": "Russell Perrin", "time": 1496590731587, "rating": 5.0, "text": "Very friendly staff!", "pics": null, "resp": {"time": 1496671056548, "text": "Thanks for the 5 stars and kind words, Daenda!  Come see us anytime.  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "110142866939480551860", "name": "Jeff NBama", "time": 1489676475154, "rating": 5.0, "text": "My \"go-to\" Harley dealer.", "pics": null, "resp": {"time": 1489678702386, "text": "Thanks Jeff! Your business is very much appreciated! Let's ride!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "116550858313924061274", "name": "Jerome Savage", "time": 1514318511905, "rating": 5.0, "text": "Nice", "pics": null, "resp": {"time": 1514319145636, "text": "Thanks, Jerome!  :)"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "101466056660691811912", "name": "carol ann mclaughlin", "time": 1511404415094, "rating": 5.0, "text": "Love it", "pics": null, "resp": {"time": 1511805432402, "text": "Thanks for the awesome review, Carol Ann!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "114970437943239435336", "name": "Simona Lewis", "time": 1526350636211, "rating": 5.0, "text": "Great", "pics": null, "resp": {"time": 1506361299364, "text": "Thanks for the 5 stars, Simona!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "113117946596231168641", "name": "Michael Moore", "time": 1406077301108, "rating": 5.0, "text": "Bought my Harley here", "pics": null, "resp": {"time": 1406587871098, "text": "Hey Michael,\n\nThanks for purchasing your Harley from Heart of Dixie Harley-Davidson!  Your business is very much appreciated and it was a pleasure working with you.  We look forward to seeing you again soon.  Welcome to the family!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "100326009907244864513", "name": "Matt Hendrix", "time": 1466501519484, "rating": 5.0, "text": "Very Professional", "pics": null, "resp": {"time": 1466519095082, "text": "Thanks for the review Matt! Your business is very much appreciated!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "105636484057155912191", "name": "Jonathan Edwards", "time": 1496906998987, "rating": 5.0, "text": "Place is HUGE!!!", "pics": null, "resp": {"time": 1497027448099, "text": ":)  Thanks Jonathan!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "109257393224419095026", "name": "James Herren", "time": 1439858061483, "rating": 5.0, "text": "Customer service", "pics": null, "resp": {"time": 1439862420662, "text": "Thanks for the 5-Stars James! Your business is very much appreciated!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "104472026230621074086", "name": "gorillasgirl64", "time": 1403456913767, "rating": 5.0, "text": "The best we've been to yet!", "pics": null, "resp": {"time": 1404312693994, "text": "Thanks for stopping in and taking the time to leave us a review.  Hope to see you soon!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
{"user_id": "107238607246475361783", "name": "Sheila C", "time": 1569890206674, "rating": 5.0, "text": "(Translated by Google) Revvin 4 research!\n\n(Original)\nRevvin 4 research!", "pics": null, "resp": {"time": 1569910888996, "text": ":)   Thank you for the 5 stars, Sheila!"}, "gmap_id": "0x888923a9057cb51d:0xaf457a849502974e"}
