{"user_id": "108844997939721052921", "name": "Tarajee Sabree", "time": 1562123798704, "rating": 5.0, "text": "Very friendly owner who is very knowledgeable about what she does. Will have you looking amazing", "pics": null, "resp": null, "gmap_id": "0x889a51e5e9c4fcfb:0x33af5398e06f9543"}
{"user_id": "103748738611633118646", "name": "erin", "time": 1618246798090, "rating": 5.0, "text": "The owner of this store was so sweet and had very quality products; one being one being a facial crème my brother loves, and the other being an under eye serum being the other. I've only been using it a little less than a week and my dark circles have gotten so much better. I highly suggest her coffee serum to anyone!", "pics": null, "resp": null, "gmap_id": "0x888a3fb9f06fdcb9:0x7450eb0c0ec0e238"}
{"user_id": "109809407486735017915", "name": "Christopher Weir", "time": 1601576064796, "rating": 5.0, "text": "Tonya was extremely knowledgeable about different ways to utilize all the benefits that CBD has to offer. I felt like I gained such an education in addition to the skin creme that worked amazingly well on my painful knees. I highly recommend Dazey Hemp.", "pics": null, "resp": null, "gmap_id": "0x888a3fb9f06fdcb9:0x7450eb0c0ec0e238"}
{"user_id": "106616010307650996723", "name": "Kelly White", "time": 1602249970802, "rating": 5.0, "text": "I love Dazey Hemp products! As someone who has used Hemp/CBD off and on for many years I have never noticed much of a difference, however I do notice a big difference with these products. They are a must try for anyone with chronic pain. Tonya is extremely knowledgeable, helpful, and passionate. She will get you the help you need. Also, I love the CBD dog treats! They have really helped my dog mellow out and control himself.", "pics": null, "resp": null, "gmap_id": "0x888a3fb9f06fdcb9:0x7450eb0c0ec0e238"}
{"user_id": "117122165405805847029", "name": "Morgan Means", "time": 1595897548683, "rating": 5.0, "text": "I cannot say enough good things about this store, the owner, and most of all the amazing products! Dazey Hemp CBD has been so beneficial to me and my family. If you haven't been here, it is a MUST! You'll be amazed at what it can do for you!", "pics": null, "resp": null, "gmap_id": "0x888a3fb9f06fdcb9:0x7450eb0c0ec0e238"}
{"user_id": "102982713696275352079", "name": "Em Kuhrazee", "time": 1596209172997, "rating": 5.0, "text": "ALL Dazey products are awesome!  I have discovered a myriad of skin and health issues that Dazey Cream helps.  It’s an amazing healer.  The CBD drops are very “clean” and over the top, plus the prices are very reasonable in comparison to other brands.  #FeelTheHeal", "pics": null, "resp": null, "gmap_id": "0x888a3fb9f06fdcb9:0x7450eb0c0ec0e238"}
{"user_id": "105788974788541473466", "name": "Frances Summerlin", "time": 1595874328283, "rating": 5.0, "text": "Dazey Hemp CBD drops  have been such a help to me for sleep, anxiety, and joint pain. There is such a difference in a full spectrum CBD oil from locally sourced hemp! With Dazey Hemp you know you are getting quality and locally produced products from naturally grown local hemp.", "pics": null, "resp": null, "gmap_id": "0x888a3fb9f06fdcb9:0x7450eb0c0ec0e238"}
{"user_id": "100306982541750557973", "name": "Daniel Logan", "time": 1592355336163, "rating": 5.0, "text": "Great customer care, good quality products fun atmosphere.", "pics": null, "resp": null, "gmap_id": "0x888a3fb9f06fdcb9:0x7450eb0c0ec0e238"}
{"user_id": "104551839100727120465", "name": "Paul Dodd", "time": 1602004661241, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x888a3fb9f06fdcb9:0x7450eb0c0ec0e238"}
{"user_id": "107646763517002959182", "name": "Robert Snapp", "time": 1526068406572, "rating": 4.0, "text": "this Marathon gas station and convenience store served its purpose for fuel during my travels. The fuel pumps are updated with video screens to entertain you while you are fueling. The bathrooms were cleaner than I had expected. The convenience store provided a wide range of Beverages and snack goods.", "pics": null, "resp": null, "gmap_id": "0x888e07655b749f73:0x8addbf7d12dc113c"}
{"user_id": "101316700417225499484", "name": "Gene Pline", "time": 1591580664493, "rating": 3.0, "text": "Kinda worn looking but friendly place.", "pics": null, "resp": null, "gmap_id": "0x888e07655b749f73:0x8addbf7d12dc113c"}
{"user_id": "113579186101257326034", "name": "Austin Johnson", "time": 1535737991917, "rating": 5.0, "text": "Quick and easy in and out for fuel. Inside is clean and well maintained.", "pics": null, "resp": null, "gmap_id": "0x888e07655b749f73:0x8addbf7d12dc113c"}
{"user_id": "116787149454785246011", "name": "Terje Dokland", "time": 1535994922834, "rating": 1.0, "text": "Filthy bathrooms.", "pics": null, "resp": null, "gmap_id": "0x888e07655b749f73:0x8addbf7d12dc113c"}
{"user_id": "102998447125264630775", "name": "Celese Sanders", "time": 1627914366077, "rating": 5.0, "text": "Christine was absolutely wonderful! She took the time to really understand my pain and what would help. She is very skilled and when I left I felt like I could already tell a huge difference and the next day I felt the best I had felt in such a long time! I am so grateful I found them!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "111054961697552585248", "name": "Richard B", "time": 1620079500159, "rating": 5.0, "text": "Sarah gave a great massage! It was a good balance of full-body massage, relaxation, and addressed the trouble spots and knots. Table was very comfortable and heated. Sarah did not talk much, which I appreciated. Nice location and facility.", "pics": null, "resp": {"time": 1620082329976, "text": "So glad you enjoyed your experience at Healing Haven. Thank you for the awesome review...we look forward to seeing you again soon;-)"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "108076498528514302780", "name": "Hailee Walls", "time": 1613659980583, "rating": 5.0, "text": "Renae is an amazing massage therapist! As a massage therapist myself, it is challenging sometimes to find someone whose work you love. But Renae's myofascial work feels great, and she is very intuitive and can truly feel what is going on in the body with her hands - she's like magic! I'll definitely be back.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "115764236888935858383", "name": "Lisa Smith", "time": 1611158866209, "rating": 5.0, "text": "Visits to Healing Haven are a relaxing and serene experience. Christine is very knowledgeable in how massage therapy can help her clients and incorporates the modalities you need at each visit. The setting is peaceful and calming, it is a place to treat yourself and help keep your body in its healthiest state!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "109779573864315218151", "name": "Larry Larry", "time": 1598922195791, "rating": 5.0, "text": "This is definitely a 10/10 location. I can’t say enough about the pleasant and relaxing atmosphere as you walk-in. In the mist of COVID I recognize immediately  the care and precautions.  Mrs.Grass was awesome. Has my highest recommendations.", "pics": null, "resp": {"time": 1599156377752, "text": "Thank you Larry for your 5 star recommendation! We appreciate you and your business and look forward to seeing you again soon!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "105678908262803661626", "name": "Nancy Wesson", "time": 1589566232343, "rating": 5.0, "text": "I got a great massage here yesterday. The place I regularly go to was closed. After reading the reviews I made an appointment at Healing Heaven. I am glad I did. I would highly recommend this place.", "pics": null, "resp": {"time": 1589645779618, "text": "Thanks so much for the 5 star review! We are glad you were pleased with your service. We hope to see you again soon!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "112003168625957004548", "name": "Nick P", "time": 1566008928307, "rating": 5.0, "text": "Great deep tissue massage.  Renae was excellent.  The facility was very clean and welcoming.  The table was solid and one of the better places I have been for a massage.  I felt very comfortable and will definitely be going back in the near future.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "110344143644723717373", "name": "Raven Babineaux", "time": 1538326164654, "rating": 5.0, "text": "Best massage I've ever had, she actually used pressure that was needed as well as massaged all muscles. She worked on the knots in my back (much needed),  explained the process and discussed my intake form with me with all medical information. Oh and she actually explained the issues she discovered with me which has never occurred anywhere else I've been. Love this place they are very professional and informative.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "113934976316795121322", "name": "Adrienne Walker", "time": 1545949383146, "rating": 5.0, "text": "10/10 would recommend. Christine was just a great person and really made me feel comfortable. She was solely interested in making you and your body feel ten times better than when you walk in. Thanks!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "109360915112446349896", "name": "Ken Crowson", "time": 1573182390547, "rating": 5.0, "text": "Kinda Leary at first but once I got there very comfortable and it was great can’t wait till next session very professional and knowledgeable about the body would highly recommend Christine she was great", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "115301917910821813596", "name": "R", "time": 1492120366746, "rating": 5.0, "text": "I have gone to Christine about a half a dozen times now. She has helped me immensely. I have been to other massage therapist, to include some of the massage mills who shall remain nameless, and found Christine is very well versed in her profession. Every time I go there I learn something new. She has helped me with an alignment issue I was having by showing me a number of stretches to correct it. Christine also utilizes essential oils in her therapy and has the ability to find and release all the muscular tension build-up in my body. I sleep like a baby after one of her massage session. And above all, Christine is a lovely and caring person who believes in helping others!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "103289347542548801669", "name": "Colby Robinson", "time": 1471537436289, "rating": 5.0, "text": "I visited Christine at Healing Haven recently for my first ever massage and I had a fantastic experience. When I stepped into her office it was like I left all my stress at the door. She was excellent at making me feel comfortable and relaxed. Not only was the massage a great experience, but she used essential oils to make it even better. If you are looking to have body work done, I definitely recommend visiting Christine.", "pics": null, "resp": {"time": 1471543158993, "text": "We're so glad you had such a positive experience with us and look forward to seeing you again soon!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "118291058520299251842", "name": "Brandon Patterson", "time": 1523829114885, "rating": 5.0, "text": "Excellent service! I don't know where to start with how much their service made my weekend. Absolutely impressed with the quality and I can't wait to go again!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "115282147452439720974", "name": "Randy Lee", "time": 1529675482918, "rating": 5.0, "text": "Christine is very knowledgeable and highly skilled. Definitely one if the best massage experiences I have had. I highly recommend Healing Haven and Christine.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "107033886936537465600", "name": "Rachelle Griffin", "time": 1559253987719, "rating": 5.0, "text": "Our boss hired this place to come and give us 15 minute chair massages and it was great the lady doing the massages was really nice down to earth and generally cared about making you feel better I will be visiting the business for sure", "pics": null, "resp": {"time": 1559910878644, "text": "Hi Rachelle, thank you for the great review. It was our pleasure to come out to your place of work for your employee appreciation week to help make you feel better. We hope to be back again soon!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "101422140446244793483", "name": "Dianne Judson", "time": 1506633767795, "rating": 5.0, "text": "Amazing and serene experience!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMTBY_YVd8ulC2lNlB9hTO6CMvtOsi03sAolRKT=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "103850886278909181626", "name": "Laura Hardin", "time": 1502237622814, "rating": 5.0, "text": "Christine has been my massage therapist for three years now. Every single session has been excellent. She continues to provide fabulous service.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "102210444935224297537", "name": "Cameron Claire Starnes", "time": 1471450675033, "rating": 5.0, "text": "Christine is amazing!!  I was having a lot of pain and she helped me greatly!  I highly recommend her services.", "pics": null, "resp": {"time": 1471453295258, "text": "We appreciate your positive review Cameron and we're glad our services delivered what you needed. Cya later!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "113073317727383030511", "name": "Joey “Joejoe” Patrick", "time": 1625765898883, "rating": 4.0, "text": "First time going here. Really good shakes and teas. Helped me as far as not having a appetite for the rest of the day which is a good thing. Would recommend trying it.", "pics": null, "resp": null, "gmap_id": "0x887d59f4fd5c59eb:0xde3b91ef3159d2c3"}
{"user_id": "102189119189356206541", "name": "Kriste Harter", "time": 1602641168165, "rating": 5.0, "text": "Best healthy option for a fast shake or tea and the absolute best service with a smile!!! Can’t wait to go back and hang out. I love the Key Lime Pie shake and my friend ordered the fruity pebble shake and loved it.", "pics": null, "resp": null, "gmap_id": "0x887d59f4fd5c59eb:0xde3b91ef3159d2c3"}
{"user_id": "116811928696717311960", "name": "amber critic", "time": 1613317045396, "rating": 2.0, "text": "Never open on time. Went at 9:45 this morning and their sign says opens at 9AM but no one was there. Not the first time this has happened.", "pics": null, "resp": {"time": 1613320040479, "text": "Make sure to check our social media for any updates regarding our hours, specials, etc.!"}, "gmap_id": "0x887d59f4fd5c59eb:0xde3b91ef3159d2c3"}
{"user_id": "108315629961457477888", "name": "Pamela Garrison", "time": 1623426844359, "rating": 5.0, "text": "Great service and love there drinks", "pics": null, "resp": null, "gmap_id": "0x887d59f4fd5c59eb:0xde3b91ef3159d2c3"}
{"user_id": "117446310188514926235", "name": "Shawna G.", "time": 1603721919729, "rating": 5.0, "text": "The owners are so nice and the shakes are amazing!  The best part is they taste sooooo naughty, but the are sooooo good for you.", "pics": null, "resp": null, "gmap_id": "0x887d59f4fd5c59eb:0xde3b91ef3159d2c3"}
{"user_id": "109280935377472391035", "name": "Kwende Madu", "time": 1595880610203, "rating": 4.0, "text": "Quality product. Good service. They should post the full menu online for customer convenience.", "pics": null, "resp": null, "gmap_id": "0x887d59f4fd5c59eb:0xde3b91ef3159d2c3"}
{"user_id": "110897005017929196177", "name": "Ian Schrauth", "time": 1601085083545, "rating": 1.0, "text": "This company uses Herbalife in their products, and Herbalife is a Multi-level-marketing company that is known for Liver Damage. DO NOT BUY from here if you're don't support pyramid schemes!", "pics": null, "resp": null, "gmap_id": "0x887d59f4fd5c59eb:0xde3b91ef3159d2c3"}
{"user_id": "106394869890738538905", "name": "Crystal Jackson", "time": 1605819289056, "rating": 5.0, "text": "Where are you located at in Russellville show my name is crystal Jackson and I want to know where you are located at so I can go and get me a nutrition sakes for me and my family", "pics": null, "resp": null, "gmap_id": "0x887d59f4fd5c59eb:0xde3b91ef3159d2c3"}
{"user_id": "105897857655449840635", "name": "Audrey Grider", "time": 1525373997190, "rating": 5.0, "text": "This is my parents home. They moved in when I was 6 months old. It was where I grew up, my children spent a lot of time there, and now their children do. We all love going to mamaws. I feel at home their!", "pics": null, "resp": null, "gmap_id": "0x8861cb1642c25671:0x40058c1bca2a96dd"}
{"user_id": "102883840243802433403", "name": "Joann Brown", "time": 1626583281944, "rating": 5.0, "text": "Loved the merchandise and the staff. They were so kind and helpful. Can't wait to return home and try out our new products. I think we bought just about a little of everything lol.", "pics": null, "resp": {"time": 1626584738773, "text": "Joann, we're so glad that you had a excellent experience; and we know you're going to love all your goodies!"}, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "106939811617642956662", "name": "Marie Swendsen", "time": 1623891704457, "rating": 5.0, "text": "Super cute store. Nice family owned store. Owner was so cute with her baby in toe. Made sure we tried the products.", "pics": null, "resp": {"time": 1623892389797, "text": "Thank you for your review and we know you'll love your products!"}, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "115923194145887450994", "name": "Brandi Hutson", "time": 1612365065481, "rating": 5.0, "text": "I love FSC! Supporting a small business always feel good but this one is the best! My fave products are the detox face scrub and any of the soap bars! Everything smells so yummy you could eat it! Will go back time and time and time.", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "104943889224197337509", "name": "Raylin Spence", "time": 1612365159545, "rating": 5.0, "text": "This place is awesome!! Great customer service. LOVE the bath bombs and charcoal bar. Atmosphere is friendly and professional. Definitely check this place out and tell all of your friends and family 😁", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "116544743866676114144", "name": "Pascal Bruijn", "time": 1612134752745, "rating": 5.0, "text": "I love visiting unique, non-chain stores. My favorite Fairhope Soap Company products are the bath bombs, charcoal face scrub and the hair shampoo bar. Friendly and knowledgeable service. All products are made by the female owner who is a former laboratory chemist. Original store located in Fairhope and now also in Foley at OWA shopping and amusement park.", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "107994520461299534215", "name": "Jackie Clark", "time": 1614518896677, "rating": 5.0, "text": "I love this shop. Products are out of this world. The employees are the kindest and most helpful around. Such a sweet place.", "pics": null, "resp": {"time": 1614520658823, "text": "Thank you 💖 we appreciate all our customers that keep us going!"}, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "116357283278537747027", "name": "Jan Hilyer", "time": 1597266486501, "rating": 5.0, "text": "I just had to let everyone know how wonderful it is to do business with Fairhope Soap Company!  Not only will they ship or deliver locally, they thanked ME and included a little “happy” for me. Being unable to shop right now for gifts, they did it for me and delivered items to me in less than 24 hours!  Thank you, Fairhope Soap Company!  I encourage everyone to support this gem of a business right here in town.", "pics": null, "resp": {"time": 1597270308263, "text": "We're so glad you loved it & hope we can help you again soon!"}, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "101639680394404931663", "name": "Heidi Perdue", "time": 1591410552548, "rating": 5.0, "text": "I visited Fairhope in March and stumbled across this cute little store. I was immediately waited on and received tons of amazing product recommendations. I love all the products I’ve tried so far and am super thankful that they have online ordering as I live in South Dakota and can’t just pop in whenever I’d like. I highly recommend shopping here!", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "102621984999758508110", "name": "Graciela Blanno", "time": 1585943590699, "rating": 5.0, "text": "Very beautiful shop with amazing location . The most amazing smells and high quality products for a great price . I always shop here when we visit from atl! Super friendly staff!:)", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "117221657248292319963", "name": "A G", "time": 1529151477816, "rating": 5.0, "text": "Love this place! They make the best soaps and sudsy scrubs. They make their products in house. The staff is always willing to explain or assist with product information. Their products are definitely high quality and worth the price. Can’t say enough good things about this place!", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "114120232232478370282", "name": "Summer Day Lily", "time": 1534612317380, "rating": 5.0, "text": "When you walk into the store you immediately smell the fine scents of the handmade soaps. There are many sizes and shapes to check out for bathing and otherwise soaping up.\nThe store associate certainly liked his job. Good friendly atmosphere.", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "117261144706413820968", "name": "Betty Waldrop", "time": 1576444002190, "rating": 5.0, "text": "Family Christmas tradition is gifts from this delightful shop.  Quality products and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "105427407224053140381", "name": "Prachi Patel", "time": 1516063418829, "rating": 5.0, "text": "Huge selection of different soaps, candles, bath bombs, bath teas, essential oils, even wax melts and aromatherapy accessories! Smells amazing and there are even vegetarian soap and vegan soap options. Will definitely return and will recommend to friends and family!", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "108031704869418830124", "name": "Jennifer Mills", "time": 1552788608817, "rating": 5.0, "text": "My little girl won a “mermaid” bathbomb at the Fairehope arts and crafts festival. It was so much fun. The bath water turned dark blue and purple. Once the bomb dissolved there was a cute treasure inside the bomb. The smell was heavenly and left the skin silky smooth. Will be purchasing these for birthday gifts.", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "113397788808320543384", "name": "Kendall Sampson", "time": 1568237836507, "rating": 5.0, "text": "Georgia was very helpful in helping me find my wax melt wafer, such great costumer service.", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "107832780164867240493", "name": "Sandra Lindsey", "time": 1570557714188, "rating": 5.0, "text": "Great bath products & the little shop smells like heaven! Excellent customer service too!", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "106872084912563005699", "name": "Candise Carter", "time": 1540530745183, "rating": 5.0, "text": "Stumbled upon this place as we were shopping and dinning in fairhope. The store smelled so good I was lured in. The employee that was there Sunday was so helpful and knowledgeable! I got home with some lip balm, bath bombs, bath sea salt, milk soap bar, and a dog oatmeal soap bar. So far the lip balm, sea salt soak and milk soap bar have all been amazing. Overly infused with scent (in a very good way, no skimmpy product here), and wonderfully clean, relaxed and gentle feeling from all the products! I will absolutely have to go back during the week to see the making of these products in person.", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "109821952460366414794", "name": "J.B. Blackmon", "time": 1549052191348, "rating": 5.0, "text": "Loved this place. Firefighter owned and operated. My daughters and niece's love this place.", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "113717150072693870981", "name": "R Maurice", "time": 1564714922898, "rating": 4.0, "text": "The soap they make is pretty amazing, you won't feel a clean like that with a commercial soap. Recieved a bar as a gift now I'm hooked and don't want to use anything else. It's a little pricey that's why it isn't floating 5 stars but fear not.. one bar will last you 3 weeks if you hang it up and keep it dry. Maybe longer for some. Try it you'll be hooked too", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "107346265813565763608", "name": "Allie Cat", "time": 1560450799734, "rating": 5.0, "text": "Went to the store in Foley and the staff were super friendly and helpful. We definitely will be shopping here again if we are ever in the area.", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "108134681036468787609", "name": "Candace Powell", "time": 1579724085451, "rating": 5.0, "text": "Great shop at OWA, Foley, AL.\nWe will be back!", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "105632913307192332513", "name": "M&M Investigations", "time": 1552244034657, "rating": 5.0, "text": "Stopped here randomly - very knowledgeable staff, love the products and spent a small fortune and absolutely love everything!", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "105604485291338168777", "name": "Emily Clarrey", "time": 1567434621477, "rating": 5.0, "text": "Beautiful store! Plenty of variety and  helpful staff!", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "104520283290693159371", "name": "Ryan", "time": 1578088605365, "rating": 5.0, "text": "Great place to get gifts for the family!", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "105980853325333174730", "name": "Cynthia Katzman", "time": 1530724147834, "rating": 5.0, "text": "Beautiful little shop with handmade soaps at a reasonable price.", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "106975378848385025021", "name": "Daryl Thompson", "time": 1564607168766, "rating": 5.0, "text": "Quality soaps with a homemade feel", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "110028112256165695488", "name": "Jenny Ward", "time": 1525867522534, "rating": 5.0, "text": "Their soaps and lip balm are phenomenal!", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "111838522510759235784", "name": "Angie R", "time": 1522160958860, "rating": 4.0, "text": "I love the soap that they make", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "116580299336759332047", "name": "Ryan Breivik", "time": 1541857824604, "rating": 5.0, "text": "Staff was very friendly and very helpful", "pics": null, "resp": null, "gmap_id": "0x889a409aac73188d:0x2903a1a4afb555c3"}
{"user_id": "117347669461763948530", "name": "Danni Alisa", "time": 1600970287804, "rating": 5.0, "text": "Just  got to  say, we  visited The Hive this morning  and it was awesome!! The staff were very helpful and  friendly!  They serve shakes and leaded  tea with a healthy  kick! We had no idea  what  we wanted just  told them what we were  wanting it for and immediately  they gave us  lots of options and  got us  taken care of. Tasted  great and didn't  feel  guilty about it! It was good to me  and good for me!  Definitely need to experience the  buzz from  The Hive for yourself!  Highly recommend- will definitely be  returning!", "pics": null, "resp": null, "gmap_id": "0x888cedf772204669:0x69bdea94225d10b4"}
{"user_id": "105050841320757365343", "name": "Chris Bryan", "time": 1611594397411, "rating": 5.0, "text": "Went for the first time this morning and highly recommend trying the meal replacement shakes", "pics": null, "resp": null, "gmap_id": "0x888cedf772204669:0x69bdea94225d10b4"}
{"user_id": "112117683037823986020", "name": "Alysa Lee", "time": 1606574870362, "rating": 5.0, "text": "The people who work there are the sweetest and greet you with love and care. They are awesome and I couldn't ask for anything better!", "pics": null, "resp": null, "gmap_id": "0x888cedf772204669:0x69bdea94225d10b4"}
{"user_id": "109154704915908530096", "name": "Chase Youngblood", "time": 1603725495524, "rating": 5.0, "text": "Incredibly friendly staff and great products. Definitely check them out", "pics": null, "resp": null, "gmap_id": "0x888cedf772204669:0x69bdea94225d10b4"}
{"user_id": "113539677056773305133", "name": "rebecca smith", "time": 1621522483199, "rating": 5.0, "text": "Such a great family friendly environment. The management staff is top notch. Run here. My babies have grown up here getting their hair done. My 9 year old loves getting her nails painted as well. Ask for Olivia when you go. Best hair place in Mobile.", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "114449669656198644917", "name": "Yuliya Ugay Brown", "time": 1524785450926, "rating": 2.0, "text": "Stuff is very nice and  friendly. But I asked not to cut hair from the ears and see what happened... He had ears covered with hair.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP0hjDp5vV60rnb7Cz1Tuyd_fUPvo1ADN_mUulA=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "113082068506050346340", "name": "Shianna simpson", "time": 1621103505999, "rating": 5.0, "text": "Absolutely loved them!! Went for the first time today & i felt so welcomed & was treated GREAT!! Highly recommend them!!", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "113717139856570907466", "name": "Tamara Perry", "time": 1613175266196, "rating": 5.0, "text": "Wonderful salon for my 7 year old. It's fun and they have fun products. She loves it every time we go!", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "107659769981571190547", "name": "Katie A Barnett", "time": 1598053131422, "rating": 5.0, "text": "I just stumbled upon Knots Salon simply because I needed my haircut ASAP. I called on a Saturday and was able to get an appointment that same day!\nThe salon's setup is so chic! I immediately fell in love with the ambience. I have thick natural curly hair so I am always nervous having my haircut by someone new. When I scheduled my appointment I requested someone who has experience with cutting curly hair...and of course that's exact stylist I got! I was just a walk-in expecting to get my hair cut and go back to my original stylist after her leave, but instead Knots Salon just got another regular client!!!\nI also tell everyone about this place because I was shocked that I didn't know about it!\nI love Knots Salon for life\n...Katie Barnett", "pics": null, "resp": {"time": 1598559697249, "text": "Thank you so much for the great compliment.  We certainly appreciate your business and will always strive to give you a 5 star experience."}, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "104195866063321046220", "name": "Ashley Davis", "time": 1587297085292, "rating": 5.0, "text": "We absolutely love Knots Salon! It's so inviting for kids, which is hard to find. We took our 2 year old, who is a very busy body, to Knots Salon for his first haircut. Angela is who we chose and she did absolutely AMAZING! She listened and did exactly what we asked. She was great and oh so patient with him! There's no where else our kiddos will go for any hair needs.", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "107930203256712649393", "name": "Amanda Negri", "time": 1605540952267, "rating": 5.0, "text": "Amazing! Ms. Olivia was so great with our son and he loved it! Easy experience!", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "114092092407595514144", "name": "Raven Hamil", "time": 1586798839619, "rating": 5.0, "text": "I love taking my child to get his hair cut at Knots! The staff are so sweet and very good at what they do. Leighana is so patient and takes the time to make sure she makes my son's hair look great! Would recommend Knots Salon to everyone I know. Especially for kids haircuts.", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "114696656524118517888", "name": "Amber A", "time": 1607404539745, "rating": 5.0, "text": "Absolutely wonderful customer service! They pierced my daughter's ears, both at the same time and she got her first haircut and her very first Manicure💅", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "104330858930950612532", "name": "Mary Boice", "time": 1558962170962, "rating": 5.0, "text": "Angela is always out to give me the exact hair style I want!  She didn't cut too much hair off the way other hair dresser do.  She is very sweet!  She has lots of experience!  You definitely want to ask for Angela!  She's the best!!", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "106787739220849076278", "name": "asten hamil", "time": 1586824882801, "rating": 5.0, "text": "Knots is a really good salon especially for kids. Leighana does a really good job cutting my nephew's hair.", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "113625554068594736188", "name": "James Hudson", "time": 1590076878384, "rating": 1.0, "text": "Inexperienced people run this place . Don’t set a appointment if your hair is “to thick “ because they will turn you down after waiting a week for your appointment.. horrible service . Anyone getting hair colored would definitely not recommend this place they clearly are inexperienced", "pics": null, "resp": {"time": 1590164398852, "text": "We are so sorry you did not have a good experience at our salon! It is our goal to provide excellent service for all of our customers. Unfortunately, the appointment scheduled online did not allow enough time for us to give you the color you were looking for. We hate that we disappointed you and hope that we can make it up to you. Please call us at 251-635-1313."}, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "106034037382498833090", "name": "Reyna Coleman", "time": 1586803136663, "rating": 5.0, "text": "We absolutely adore Ms. Olivia. She’s patient, kind, & caring.", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "104078127501768326238", "name": "Kristy Dyess", "time": 1586819962957, "rating": 5.0, "text": "We love Olivia and everyone there. Michael has been going there since he was 1 and he is now 12!", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "107972241305339111179", "name": "Brittany Kimbrough", "time": 1572111760322, "rating": 5.0, "text": "This morning, I made the mistake of taking my children to another salon. My daughter’s hair was long, halfway down her back, and I wanted 3 inches trimmed off. The girl butchered it and before I knew it, my daughter had an uneven bob above her shoulders and the girl just kept cutting and cutting on top of repeatedly blaming my daughter for not sitting still and blaming another customer for talking to my daughter and making her talk while she was cutting her hair. I refused to let her touch my son’s hair, we hopped in the car, and drove to Knots Salon. By the time I got there, I was in tears. ANGELA SAVED THE DAY. She fixed my daughter’s hair and gave my son a great cut, too. I will never take my kids anywhere else! Take your kids to Knots and ask for Angela. She works miracles and is so great with the kids.", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "102427995908153783714", "name": "Jennifer Hall", "time": 1550618285979, "rating": 5.0, "text": "Great with first hair cuts and kids love to come!  They can’t wait to come back and sit in the cars. As a parent, it’s so convenient to be able to schedule appointments online.", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "109482096246916634041", "name": "Katie Ladnier", "time": 1552003489328, "rating": 5.0, "text": "Very pleased. She only cut what I asked and was very understanding and easy to talk to. Enjoyed the shop itself aswell.", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "102458470420160538790", "name": "Megan Rushing", "time": 1539470149970, "rating": 5.0, "text": "Best haircut and color I've had it years. Latisha Speese did amazing work with my long thick hair. Will return and can't wait to bring my daughter.", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "102748340427073538526", "name": "Ethan Bryant", "time": 1505944497870, "rating": 5.0, "text": "Love getting my haircut at Knots. I've gotten my haircut by several stylist and all are pretty great at men's hair. The always use a warm towel when shampooing my hair, and give a great neck shave. Highly recommend.", "pics": null, "resp": {"time": 1521224809906, "text": "We love that you enjoy our services.  Thank you so very much for the great review."}, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "103544137941383276295", "name": "Jessica Tillman", "time": 1520707216432, "rating": 5.0, "text": "Marley did a great job on my 2 year old boy. First time haircut, and she was patient and kind, and most of all fast!! I got to keep his curls! We will be back for all his cuts. Love this place", "pics": null, "resp": {"time": 1521224662223, "text": "Thank you very much for the awesome review.  We look forward to seeing you again.  Marley is great and she loves children and what she does! Can't wait to see you!"}, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "117318939715277166522", "name": "Andrea Timberlake", "time": 1551221496896, "rating": 5.0, "text": "We kids love Knots Salon! It’s a very kid friendly atmosphere, yet great for adults to relax and get chic too!", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "107340781246513178472", "name": "Grandmaster", "time": 1551918819983, "rating": 5.0, "text": "Only professionals here with positive attitude s. The owner is great and has a reflection on her employees. By appt only. Also equipped with unique powerwheels stools for kids haircuts.", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "104373638362152170266", "name": "Vanessa Madere", "time": 1580579227772, "rating": 5.0, "text": "Friendly staff and great haircuts in a cute salon", "pics": null, "resp": {"time": 1581022970632, "text": "Thank you so much for the kind review.  It really means a lot!"}, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "104242909133298497955", "name": "Holly Reynolds", "time": 1549145084074, "rating": 5.0, "text": "They always do a great job with my toddler.  He used to hate haircuts but is always so well behaved here!", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "102327144449059939880", "name": "Abigail Stjohn", "time": 1507422621784, "rating": 5.0, "text": "Very open and friendly staff. Perfect for families! Left the salon with smiles all around! Also LOVE the selection of bath bombs!", "pics": null, "resp": {"time": 1521224953779, "text": "Thank you for taking the time to give us this fabulous review. We really appreciate it!! We work really  hard to serve our guests and love to hear that we did a fantastic job."}, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "106543167200601712923", "name": "Andrew Hardin", "time": 1560893749954, "rating": 5.0, "text": "My delightful sister works here!! Great place!!", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "111395502412854788962", "name": "Will Hudson", "time": 1531934875627, "rating": 5.0, "text": "Great haircut experience. The salon was excellent and on time.", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "107360377749752026267", "name": "Audrey Wright", "time": 1520043970304, "rating": 5.0, "text": "Perfect for a birthday spa day.", "pics": null, "resp": {"time": 1521224746289, "text": "Thank you for the great review.  We love doing spa days for children and adults.  We will even open after hours if needed to fit your needs.  We love what we do!!"}, "gmap_id": "0x889bb2e6f53470f1:0x187c2b459c959c1b"}
{"user_id": "108000167801958027226", "name": "Serendipity Awaits", "time": 1517337142259, "rating": 5.0, "text": "I had the pleasure of stopping into Buff City Soap Company on my way to work today!!! The shop was very well organized and had great descriptions of every item they offer.  The employee on staff was super helpful.  Once I told him this was my 1st visit he let me look around, asking questions as I went without bombarding me with endless high pressure sales tactics.  I love that!! They were having a great sale plus they had mystery bags for $5!!! My mystery bag had 1 bar of soap and a bath bomb.  This is definitely going to be my new \"go to\" soap stop.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMckOy132IzcTG2YlxEv6L97A1ZrbmoQNA4lTLv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO9SaEmQMD3ICLJ7KV29QkE3JE-elCW2SYif2jJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNBJQkQVqyQ78oYWiCAywgOgWKxmG_nv_X69bq3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNQv_tXhmdTOkY5_gwaNYp_ediIBlejrJ0243OJ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "117646750942061866455", "name": "Katrina Gamble Parker", "time": 1612372771560, "rating": 5.0, "text": "Love their soaps! And the staff members are always so sweet and helpful!", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "111027595419266280856", "name": "Elizabeth Smith", "time": 1622913446035, "rating": 5.0, "text": "Love their bath bombs!!", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "103765115397770542401", "name": "Paisley Sellers", "time": 1611197740520, "rating": 5.0, "text": "Love the bath bombs, soap, shave bar, and shampoo bar. Those stay stocked up at my house.", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "118251774696222573822", "name": "Nekita Clark", "time": 1502396514273, "rating": 5.0, "text": "Soaps and bath products that I can use! Thank goodness! So many options! Great customer service! Gift boxes available. Generous sizes with economic prices! Must stop by and visit!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNpDd53dzGEHQzyEwv7SiPqGJ3hwmaJZM6k9VPE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNxPIHSnIdLtgVKnXktI2nG0kF2fbGO33qGTvHy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMlrfxAowJ_b99MF4UjON4BSj60aQAz2_tw6ruN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMkM5dfpu3kfs57CZJsgibCGezvQxIiPMZsnmOh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP2JiNj7fXNC8wCj87hxVAjPhp52oy5x-oQP3wy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNYq6_B1jsX6yMp3_aY5QQV0nG_29pIGrZMd23p=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMzbvjH1QOLmVnyuHIqzCm8cbgeoEXATMUCZzBw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPJwE6pbkY1NUpqgyetgTRUkM10A1CRZlh-bLLt=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "113174677694040851679", "name": "lakesha andrews", "time": 1616637964921, "rating": 5.0, "text": "Everything smells so good!", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "102613739164288571910", "name": "Maria Marin", "time": 1611066479895, "rating": 5.0, "text": "I luv this place...best soaps ever", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "118237323058936490819", "name": "Brandon V", "time": 1570549229797, "rating": 5.0, "text": "Great modern shop! The place was clean and smelled amazing. They have a very unique product line but I have to say the staff is great! They didn’t just greet me at the door, they also helped me find what I wanted and pointed me to new products they had. I was pleased with their service, I felt welcomed.", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "106653946708842498036", "name": "JenpoJenpo Jenpo", "time": 1608399040746, "rating": 4.0, "text": "Cool soaps and great atmosphere!", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "104609694790418601278", "name": "Ariel Cochran", "time": 1592450110689, "rating": 4.0, "text": "Nice quality products.  They're a little pricey, but worth it if you want to shop relatively local.", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "112494911405390828721", "name": "spoony smalls", "time": 1563908353759, "rating": 5.0, "text": "I never thought I would be upset about being out of laundry detergent. If I could make Good Morning Sunshine a seasoning, I would sprinkle it on everything. Smells so good you'll want to eat your soap, which you could do because it's all natural!", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "101385793349649629736", "name": "Mallory Henson", "time": 1557323687914, "rating": 5.0, "text": "I always love coming in here to smell the new soaps! I tend to get two bars each time I go in but I like to look at every option. The ladies that work there offer any help and even tell me their personal favorites but don't hover over you which I appreciate. There is even a reward system in place which is cool.", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "103379142126604267593", "name": "Billy Mitchell", "time": 1566531973881, "rating": 5.0, "text": "I love this place, you can tell they work as family. Kaitlyn was so helpful in making sure I found what I was looking for! Will be back :)", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "115107983095849196407", "name": "Jared Raney", "time": 1551382726560, "rating": 5.0, "text": "Went in to get my wife a surprise. I believe her name was Marian but she was absolutely amazing at helping a guy find the right thing for his wife. Y’all have earned a customer for life for sure!", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "112200756048178646924", "name": "Kathy healy-collier", "time": 1499550385398, "rating": 5.0, "text": "Best Soap Ever!   Totally natural and great selection.  New smells are made everyday because they make everything in the store!  Soap, bath bombs, body butter - you name it!  And price is WAY better than Lush!", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "111436384799540792853", "name": "OGxJORDAN", "time": 1566529449902, "rating": 5.0, "text": "Honestly one of the best places I have ever shopped! Great products and an amazing staff!", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "101171332635131112449", "name": "Sheldon Busta", "time": 1566531156544, "rating": 5.0, "text": "I got my mom a birthday gift from here and she loves it, will be returning! Love the staff", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "104674782787422072897", "name": "Craig Winn", "time": 1519182370480, "rating": 5.0, "text": "I have only shopped here once but it was a great experience. The soap I bought was a natural charcoal that I thought would be unscented but turns out it was scented with an excellent smell. My daughter was with me and she went nuts comparing this place to Lush at the Summit. I have been in Lush and this place was lush light but it was still nice.", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "117772511192636473645", "name": "Nicole", "time": 1549464479176, "rating": 5.0, "text": "love this store. smells so good! wonderful soaps and oils", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "111837361953607280139", "name": "Jai L.", "time": 1565756678500, "rating": 5.0, "text": "Amazing natural soap at a great price!! I love it.", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "103401490179920254280", "name": "Brandi Cain", "time": 1529178940295, "rating": 5.0, "text": "I love love love bar soaps, especially when they’re all natural. The quality is fantastic, and the prices are great when compared to Lush. Also, all of the products are cruelty free and mostly vegan. Buff City Soap is the best!", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "115466009496289229865", "name": "B L", "time": 1519438358566, "rating": 3.0, "text": "Prices are okay. Employees were so nice and so helpful! Unfortunately these bath products are very thick on your skin and make you feel like you have a goopy residue on your skin after bathing.", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "108375325819366323363", "name": "J&L Lombard", "time": 1549924037321, "rating": 5.0, "text": "Prices are affordable, the scents are nice and I love the text messages I receive weekly letting me know of sales and promotions.", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "103456250441241108592", "name": "Rebecca Barnett", "time": 1525811355863, "rating": 5.0, "text": "It smells really nice in there and is super clean! The employees are very helpful and really amazing! All the soaps are organic and out to see and smell.", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "108917678956288226700", "name": "P. D. King", "time": 1504758850814, "rating": 5.0, "text": "First time there. It was a great customer service experience!! I have used my shower frizz and I love it. Looking forward to using my new soap, bath frizz, and body scrub!!!", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "115053272618821384326", "name": "Amy Johnson", "time": 1560978506814, "rating": 5.0, "text": "I LOVE Buff City Soap Company!!", "pics": null, "resp": null, "gmap_id": "0x8889166daada44bb:0xa7462b4dce828b5c"}
{"user_id": "103326420613660328815", "name": "B.M. Garbager", "time": 1532186765544, "rating": 5.0, "text": "Great  Service, Top Line Prices, I will be back. Love my new hair cut. Thanks Andrea.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMfXVdpu1ucA5q5PUIWfTQfV78Cprt1H9HThYfB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPNEsCdcBZWgPed11FtI6Sayhef3v8QUIace1e4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPzePws4QzcqsOLvZNnS3fes9nUgfUXXI6-85bl=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888602d8799f7e25:0x88922425bc23988b"}
{"user_id": "112012451943823353645", "name": "Eliza Marks", "time": 1557847976144, "rating": 5.0, "text": "Excellent service - Its a fun and welcoming atmosphere. I love the decor!  People have raved about my hair cut and color- I’m so happy with it- and I tell them all to go to Katie at Encore!", "pics": null, "resp": null, "gmap_id": "0x888602d8799f7e25:0x88922425bc23988b"}
{"user_id": "110744671922039398780", "name": "Anastasia Peinitz", "time": 1527192645197, "rating": 5.0, "text": "Great customer service, great color, great pricing even great music, super relaxed, it was quick and easy. Rare find! They know what they are doing yet respect your wishes. Perfect blend.", "pics": null, "resp": null, "gmap_id": "0x888602d8799f7e25:0x88922425bc23988b"}
{"user_id": "117636872650443482780", "name": "Bruce Mullins", "time": 1502664930914, "rating": 5.0, "text": "Crystal does a great job at cutting and styling hair. I was very happy with the level of service. Everyone there is friendly and overall it was a great experience.", "pics": null, "resp": null, "gmap_id": "0x888602d8799f7e25:0x88922425bc23988b"}
{"user_id": "116085202972869191995", "name": "chris fowler", "time": 1532724106870, "rating": 5.0, "text": "The staff is so wonderful they make you feel comfortable while you're waiting to do your hair.", "pics": null, "resp": null, "gmap_id": "0x888602d8799f7e25:0x88922425bc23988b"}
{"user_id": "112563139000548462799", "name": "Chancee Terry", "time": 1556726921347, "rating": 5.0, "text": "Great place. People. And services!", "pics": null, "resp": null, "gmap_id": "0x888602d8799f7e25:0x88922425bc23988b"}
{"user_id": "116112551881168392547", "name": "Sherry Prisoc", "time": 1540419230213, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x888602d8799f7e25:0x88922425bc23988b"}
{"user_id": "110500818666655555266", "name": "Casey Bentley", "time": 1553811334713, "rating": 5.0, "text": "Tori has a passion for helping people and her products are proof of that passion!  Great products. Great scents.  I was equally impressed with the attention to detail she's put into her packaging... I loaded up on Christmas gifts from A Celebrated Mess and they were all a HUGE hit! Highly recommend!", "pics": null, "resp": {"time": 1553826140634, "text": "Thank you, Casey! I’m so glad your gifts we’re such a success! It’s my pleasure to make sure the entire experience is one of joy from the opening of a spa box to the last drop of lotion. I appreciate your business."}, "gmap_id": "0x88892d406d1f1c0f:0x8e65adf1c6e3fc89"}
{"user_id": "107794162432353861723", "name": "Amanda Davis", "time": 1558738366107, "rating": 5.0, "text": "Tori's creations are refreshingly natural with so many innovative scents! Love her natural bath bombs and lotions that really soak into your skin. She also does parties demonstrating her concoctions and they are such a blast! Can't wait to try more of her products!", "pics": null, "resp": {"time": 1562610542136, "text": "Thank you, Amanda! I had so much fun throwing that party! It's always great to get the girls together for some much needed \"me time.\" Let me know when you're running low, and I'll happily get you some more. :D"}, "gmap_id": "0x88892d406d1f1c0f:0x8e65adf1c6e3fc89"}
{"user_id": "115988020321502578480", "name": "Mallory Morrison Means", "time": 1551916921365, "rating": 5.0, "text": "I love using A Celebrated Mess Products - her products make me feel like I am getting a professional spa experience at my house! All of Tori’s products are hand made & she puts so much love into each product! I highly recommend her and her products!", "pics": null, "resp": {"time": 1562610453134, "text": "Thank you so much for your review, Mallory! My joy is to make it easy for busy people to still have time to take care of themselves. I'm so happy you enjoy your products! When you run out, let me know and I'll help you get replenished with what you need."}, "gmap_id": "0x88892d406d1f1c0f:0x8e65adf1c6e3fc89"}
{"user_id": "101211663897998044861", "name": "Paige Robinson Briggs", "time": 1550675182636, "rating": 5.0, "text": "All of Tori’s products are hand made with love and her desire to help the busy working person feel taken care of and pampered is evident in how she conducts business. Her “soothe the mess “ hand therapy seriously helped heal my parched alligator skin and create a more youthful glow. I highly recommend her and her products!", "pics": null, "resp": {"time": 1550680962310, "text": "Thank you so much, Paige! I love, love, love pampering people!"}, "gmap_id": "0x88892d406d1f1c0f:0x8e65adf1c6e3fc89"}
{"user_id": "104942055270323946103", "name": "Quentin Dunn", "time": 1550083600316, "rating": 5.0, "text": "Tori builds the perfect scents....the soaps, creams, lotions, and rubs are great!  I can get the professional spa experience in the comfort of my own home!  Thank you Tori.", "pics": null, "resp": {"time": 1551240177879, "text": "Thank you, Quentin! Taking the time to take care of yourself is SO important! Let me know when you need more soap, and I'll hook you up! :D"}, "gmap_id": "0x88892d406d1f1c0f:0x8e65adf1c6e3fc89"}
{"user_id": "102633105624105290593", "name": "Brice Jackson", "time": 1550091348197, "rating": 5.0, "text": "I love using A Celebrated Mess Products personally & professionally! As a massage therapist, I enjoy using pain cream and scrub products! Such wonderful scents!! Personally, I can’t tell you how wonderful the bath bombs are for my wife & daughter! They LOVE them! My daughter has extremely sensitive skin and cannot do typical bath bombs that have artificial ingredients. But thanks to A Celebrated Mess she can be celebrated too!", "pics": null, "resp": {"time": 1550147450206, "text": "Thank you so much, Brice! I strive to make the best products possible using natural and organic ingredients and a lot of love. Let me know when you run out, and I’ll get you replenished!"}, "gmap_id": "0x88892d406d1f1c0f:0x8e65adf1c6e3fc89"}
{"user_id": "113560491846670341424", "name": "Teresa White", "time": 1562728091369, "rating": 5.0, "text": "I LOVE ❤️  my skin care and spa products made by Tori at A Celebrated Mess!!!", "pics": null, "resp": null, "gmap_id": "0x88892d406d1f1c0f:0x8e65adf1c6e3fc89"}
