{"user_id": "113255891038668824937", "name": "KAREN Davis", "time": 1628468452392, "rating": 5.0, "text": "Everyone is professional and very pleasant. In and out in no time at all. I enjoy going here.", "pics": null, "resp": null, "gmap_id": "0x88628b246b3d7b39:0x666ee66b0b181715"}
{"user_id": "117301029356773724754", "name": "Janey Motes", "time": 1455985420877, "rating": 5.0, "text": "Always friendly service, and you always greet a smiling face with miss Kari and Ashley that are there. Love knowing I can rely on their help!", "pics": null, "resp": null, "gmap_id": "0x88628b246b3d7b39:0x666ee66b0b181715"}
{"user_id": "105833438379014760935", "name": "Ce Cei hill", "time": 1611251152307, "rating": 1.0, "text": "I called to go over a plan I found online. He didn’t answer my questions and was rude. Also, he got mad and hung up on me because I wouldn’t take the plan he offered.", "pics": null, "resp": null, "gmap_id": "0x88626bfb791216db:0x63a4fb590aeb4f2b"}
{"user_id": "117318246130151718516", "name": "Jake Smith", "time": 1602540626152, "rating": 1.0, "text": "Called them because I wanted a list of dentists in Huntsville that they'd cover. Outright refused to give me any answers.", "pics": null, "resp": null, "gmap_id": "0x88626bfb791216db:0x63a4fb590aeb4f2b"}
{"user_id": "104798787522501295960", "name": "Cindy Shrader", "time": 1590176821917, "rating": 1.0, "text": "We called, trying to get insurance. We were assured that we were getting health, vision, and dental coverage. We were assured that our wellness visits were covered, that we had 2 covered dental exams per year. We were assured that our co-pays were $10. After reviewing our policy immediately, it was all lies. We purchased a discount plan. I asked to make sure that that was not the case. They assured me that this was a nationwide PPO Plan. Lies. Then when trying to cancel, we couldn't get through. They hit the credit card immediately. Coverage was to not start for 7 days. This is a scam. DO NOT FALL VICTIM TO MULTIPLAN PPO.", "pics": null, "resp": null, "gmap_id": "0x88626bfb791216db:0x63a4fb590aeb4f2b"}
{"user_id": "115592783789283725785", "name": "fax 3891", "time": 1573145901004, "rating": 1.0, "text": "This was the worst phone service i have ever experienced everyone i talked to blatantly hung up In my face and the last woman i talked to said this is no notwhat you're looking forand hung up before she even had me a chance to explain what i needed i have never spoke with such rude people in my whole life who would just hang up on you while i was being courteous and respectful as possible thesepeople all need to be retrained on customer service.absolutely unacceptable!!!", "pics": null, "resp": null, "gmap_id": "0x88626bfb791216db:0x63a4fb590aeb4f2b"}
{"user_id": "108546585274656035824", "name": "Roni MacAndrew", "time": 1528997790313, "rating": 4.0, "text": "Great health insurance", "pics": null, "resp": null, "gmap_id": "0x88626bfb791216db:0x63a4fb590aeb4f2b"}
{"user_id": "108092536784205277650", "name": "Zigi Onye", "time": 1548451051201, "rating": 5.0, "text": "This is a very good agency I will recommend to everyone.", "pics": null, "resp": null, "gmap_id": "0x88626c8e02d0fd45:0x8f416b3cf2a383f8"}
{"user_id": "101350491487595414085", "name": "Sandy Melton", "time": 1619736538270, "rating": 5.0, "text": "Hilda & Charles Gough saved us money on our policies & we sincerely appreciate their expertise & professionalism. And they are always courteous & are able to help us & give us wise advise! A million thx! Bill & Sandy Melton We appreciate Donna, too, always a blessing! Great team!", "pics": null, "resp": {"time": 1619800617470, "text": "Thank you Sandy! You and Bill are highly valued customers and we are always here to assist you moving forward!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "108186112157889389961", "name": "Valarie Hudson", "time": 1623758242622, "rating": 5.0, "text": "My family has always loved Charles and his staff. They are friendly and easy to deal with. We have had no problems with claims.", "pics": null, "resp": {"time": 1623791197514, "text": "Thank you Valarie! We missed you for your short time away, and welcome you back home!! Thank you so much!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "117096412302315971858", "name": "Alexis Harrelson", "time": 1619730861603, "rating": 5.0, "text": "I recently purchased a Gift of Life Insurance Policy. They took the time to explain everything to me. Who knew buying Life Insurance could be so simple?\nThank you!!\nAlexis Harrelson", "pics": null, "resp": {"time": 1619733706772, "text": "Alexis,\nThank you for being a valued client and trusting us the protect you and your family with State Farm Life Insurance!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "118373862254634215103", "name": "Britton Morgan", "time": 1611239991816, "rating": 5.0, "text": "We have been clients of Charles' since I was still living with my parents. We now hold our own accounts and would not change a thing. Always super friendly and eager to help in any way they can. Would highly recommend Charles and his team for all of your insurance needs.", "pics": null, "resp": {"time": 1611340819494, "text": "Thank you Britton! We love serving you and your family!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "112688051717234572474", "name": "Kaye Heard", "time": 1615478264928, "rating": 5.0, "text": "I was involved in an accident that was not my fault and was very frustrated dealing with the other person’s insurance representative.  Hilda was very helpful in assisting me and resolving issues. She was very professional, supportive and prompt.", "pics": null, "resp": {"time": 1615568560737, "text": "Kaye , thank you for your kind words and allowing us to assist you ! We are here for you whenever you need us! We appreciate you!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "104008897009846047296", "name": "Hilda Gray", "time": 1619636262763, "rating": 5.0, "text": "Great Agent and Staff helped planning our Life Insurance needs.  Very pleased with service and are always friendly and caring.\n\nOscar Gray", "pics": null, "resp": {"time": 1619642370386, "text": "Love having you and service your life insurance program!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "103786793708718143100", "name": "Cindy Simonetti", "time": 1612999934420, "rating": 5.0, "text": "I called State Farm because of the quality and value they are known for. But these days it is sometimes such pleasant surprise when folks are actually nice, professional, and knew how to answer my questions right then. Thanks for making something easy today!", "pics": null, "resp": {"time": 1613000170099, "text": "Thank you Cindy for allowing us the privilege to serve you! We are always happy to help!!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "115032665923319444351", "name": "Kirk Agosto", "time": 1611156847138, "rating": 5.0, "text": "Charles and his team have always served me very well as an insurance group.  I have moved around the state and still continue to use their service because they feel like family dealing with them.  They are very responsive and work with me to help me have the best options.  I will continue my service with them as long as I am able to.", "pics": null, "resp": {"time": 1611340898701, "text": "Thank you so much! We always love helping you and really enjoy our relationship with you and your family!!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "117770196685737109192", "name": "Eric Collins", "time": 1612993793538, "rating": 5.0, "text": "Fantastic Insurance Agent! Charles has always been so friendly and helpful and represents the best of State Farm. I'd definitely recommend him for car insurance, life insurance or homeowners insurance needs!", "pics": null, "resp": {"time": 1613000079604, "text": "Thank you Eric! It’s always a pleasure serving our great customers!!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "117538326483263526728", "name": "Slade Kilgo", "time": 1608483251975, "rating": 5.0, "text": "Charles is a great guy to do business with. Donna is always very helpful and great to work with. If I could rate higher than a five star I would!!!", "pics": null, "resp": {"time": 1610504419794, "text": "Thank you Slade! We appreciate your business and our relationship with you!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "105897378919065888110", "name": "Kevin Boyd", "time": 1611338557501, "rating": 5.0, "text": "We love Charles Gough and his staff. Always friendly and helpful with all our insurance needs. Family!!", "pics": null, "resp": {"time": 1611340763669, "text": "We love the Boyd’s! Thank you for allowing us the honor to serve your family!!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "110980282505936237653", "name": "Tommy Wiemann", "time": 1611842820796, "rating": 5.0, "text": "I have been with Charles for over 20+ years you can’t beat State Farm’s rates wonderful response times would not go anywhere else. Charles and Hilda are the best friendly service and make you feel important love y’all", "pics": null, "resp": {"time": 1611845734525, "text": "Thank you Tommy! We appreciate you and your family so much!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "102495653269545506525", "name": "Savannah Waddell", "time": 1619148597579, "rating": 5.0, "text": "I love my State Farm !!\nThank you for helping me with my Life Insurance needs.", "pics": null, "resp": {"time": 1619150936196, "text": "We love you back Savannah! Thank you!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "103013428327346658473", "name": "Michael Garmon", "time": 1616167153145, "rating": 5.0, "text": "Great Insurance Agency!!!!! Always been there for me and my Family. Thank you for all the help over the years!!!", "pics": null, "resp": {"time": 1616168236960, "text": "Thank you for allowing us to serve you and your family Michael! We truly love our great customers!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "114150077106206470671", "name": "True southern Accent", "time": 1584130792458, "rating": 4.0, "text": "My Daddy Jerry Garrison has been a customer with State Farm Insurance for years. My Daddy said Charles Gough and his office is the most caring people that he knows. He went every month and they were so nice.  Thank You Charles Gough and his office for being like family to my Daddy and Ollie Garrison. Daddy is doing great.\nIt is great to have his payment set up to be paid automatically now. He does miss seeing all y’all.", "pics": null, "resp": {"time": 1619116256392, "text": "We always love on your Dad! Great customers and great people!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "103932189806248587762", "name": "Haley Morgan", "time": 1505384688779, "rating": 5.0, "text": "I love working with State Farm ! The customers are outstanding at our office. My favorite part most of all is helping customers understand what they are paying for and they are properly covered . I have worked with State Farm almost 7 years and have more happy claim testimonies than any other company around here where State Farm showed up and found ways to pay . State Farm is quality insurance you will get my full attention and leave there with a peace of mind you and your family are taken care of. Our Life Insurance is my favorite product because we are the strongest company,local, and easiest for the family that is left behind after a tragic life experience to come to and let us handle it for them during their time of grieving.  I , myself have been the one to deliver the life checks to the family. My co worker Shay has a love for people as well. It isn't a job or a paycheck to us! God has given us a passion and ability to serve others here.", "pics": null, "resp": {"time": 1623792305526, "text": "!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "116657902405499163835", "name": "Sue Doss", "time": 1616928956349, "rating": 5.0, "text": "Very friendly, and helpful", "pics": null, "resp": {"time": 1616935085103, "text": "Thank you Sue! We appreciate you very much!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "102888321544529381533", "name": "victoria martin", "time": 1505329400373, "rating": 5.0, "text": "I have been with State Farm Insurance for 31years, Haley Morgan is always friendly and willing to help me with my never ending issues whether it be adding a new car to my insurance, a home owners claim or helping me up my life insurance so that my children are taken care of after I am gone. Its great to know I can pick up the phone and say Haley handle this for me.  Let her help you with all of your insurance needs.", "pics": null, "resp": {"time": 1610505245836, "text": "Thank you Victoria! We appreciate you!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "116948825234890490774", "name": "Valarie Hudson", "time": 1385564042805, "rating": 5.0, "text": "We have had insurance with Charles Gough's office for several years now. We have never had any problems with claims that we had. The claims were processed promptly. They are very friendly and they know what they are doing. They also try and get you the best deal on your insurance. We love them.", "pics": null, "resp": {"time": 1610505385283, "text": "Thank you Valarie! We appreciate you!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "105134545141064541391", "name": "Allan Cushing", "time": 1505327672127, "rating": 5.0, "text": "Haley is an awesome person to deal with. She always has a smile and will make you happy to choose this agent over all others. Give them a chance to help you.", "pics": null, "resp": {"time": 1610505304638, "text": "Thank you Allan! We appreciate you!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "110377324065485237884", "name": "Kinsleigh Hamrick", "time": 1602690587836, "rating": 5.0, "text": "Very helpful nice people!", "pics": null, "resp": {"time": 1610504616005, "text": "Thank you Kinsleigh! We appreciate you!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "100657393598815760056", "name": "Tonya Cate", "time": 1505329574064, "rating": 5.0, "text": "Haley has helped me before and was friendly, professional and great to work with. She always greets you with a smile and is willing to help in anyway she can.", "pics": null, "resp": {"time": 1610505206746, "text": "Thank you Tonya! We appreciate you!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "115533088849620582896", "name": "Joann Dailey", "time": 1487366852415, "rating": 5.0, "text": "Excellent people to work with. Shay Bolding was a great help and went above and beyond to help me. I'm moving all my business there.", "pics": null, "resp": {"time": 1610505334175, "text": "Thank you Joann! We appreciate you!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "114697350535269842707", "name": "Jerolyn Davis", "time": 1565016425690, "rating": 5.0, "text": "Great service and good info on what to insure and for how much", "pics": null, "resp": {"time": 1610504807449, "text": "Thank you Jerolyn! We appreciate you and wish you much success in 2021!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "102251375044499805980", "name": "Dale Garrard", "time": 1505328799943, "rating": 5.0, "text": "Haley Morgan at State Farm made my switching a very nice and comfortable visit and my 2 year old granddaughter loves going the office . Everybody in the office are friendly and pays Everly a lot of attention.  Thank you Haley and Sha for making us feel welcome", "pics": null, "resp": {"time": 1610505278919, "text": "Thank you Dale! We appreciate you very much!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "101326095499642895752", "name": "Gregory McDonald", "time": 1505336737011, "rating": 5.0, "text": "Always great dealing with Haley Morgan. She knows the business inside and out, and she's got the type of personality you hope to encounter when you walk into an insurance office to deal with the big issues of life and property.", "pics": null, "resp": {"time": 1610505146849, "text": "Thank you Gregory! We appreciate you!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "106651743342064666561", "name": "Ashley Lowery", "time": 1505385840346, "rating": 5.0, "text": "Haley Morgan is a great help when needing advice and knowledge on insurance and what is best for my family. She always makes time to help any way she can.", "pics": null, "resp": {"time": 1610505108796, "text": "Thank you very much Ashley! We appreciate you!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "111608282716472421734", "name": "Ken Brown", "time": 1537132477472, "rating": 5.0, "text": "Great for all your insurance needs , great agency.", "pics": null, "resp": {"time": 1610504989980, "text": "Thank you Ken! We appreciate you so much!!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "111499059919578565744", "name": "Kimberly Bailey", "time": 1505389564481, "rating": 5.0, "text": "Awesome staff.......Haley Morgan is amazing", "pics": null, "resp": {"time": 1610505020423, "text": "Thank you Kimberly! We appreciate you!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "113951594757912881984", "name": "Margie Hamby", "time": 1548364286389, "rating": 5.0, "text": "Good to get help from.", "pics": null, "resp": {"time": 1610504886588, "text": "Thank you Margie! We appreciate you very much!"}, "gmap_id": "0x888a3a4c7c18300f:0x7060bd12695a00cd"}
{"user_id": "111808094991275648324", "name": "Jamie Hudson", "time": 1626202616469, "rating": 1.0, "text": "Don't waste your time or money here! There are much more valuable options for your insurance needs from other providers. ALFA is horrible!", "pics": null, "resp": null, "gmap_id": "0x8889cbbdee5e9ca5:0x45725fc3422c3a0f"}
{"user_id": "102755576709956134879", "name": "Justin Floyd", "time": 1593632253258, "rating": 2.0, "text": "Very rude front desk workers that were\nnot interested at all in seeing me.", "pics": null, "resp": null, "gmap_id": "0x8889cbbdee5e9ca5:0x45725fc3422c3a0f"}
{"user_id": "116205855454198303897", "name": "Jill Herring", "time": 1518732771373, "rating": 5.0, "text": "Buddy, Kristen and staff has always bent over backwards to help answer questions and take care of our home and auto insurance needs. Thank you Buddy!!", "pics": null, "resp": null, "gmap_id": "0x8889cbbdee5e9ca5:0x45725fc3422c3a0f"}
{"user_id": "112653080769808270384", "name": "Sean", "time": 1623849232443, "rating": 5.0, "text": "I'm a 3rd generation Alfa customer.  I've been working with Tyler Ross for some years now.  It's easy to take him for granted.  I'm used to quick friendly responses as my insurance needs evolve over the years.  It's a good feeling knowing that if something ill occurred, Tyler would personally be on the other side of our phone call, watching out for my best interests.  That's just not something you get with most insurance companies.", "pics": null, "resp": null, "gmap_id": "0x88620d585864162f:0x9c833d18b0a92a7a"}
{"user_id": "116434852083388879342", "name": "Ruth Hearne", "time": 1560438192169, "rating": 1.0, "text": "All three women that work there have dismissed all my questions and requests and I've been made to feel it's because I'm a young adult, despite it being my money that I'm using to pay for my car insurance for my own car, that I also bought with my money. However, as soon as my mom goes there for me to ask questions about my account, they answer every questions perfectly with excellent explanations. This has been going on for the past two years I've been with them and has happened twice in the past four weeks. I also don't understand why they keep telling me they're not capable of printing out a breakdown of my accounts and also keep telling me that they have no explanation for changes made to my account. I'm also told that they are incapable of notifying me of any changes made to my account. So I keep finding out that they're overcharging me after the fact. They are very short and rude with me but as soon as my mother steps in they are polite and give her all the answers I have been trying to ask. I have tried to resolve these issues with them multiple times but they refuse to talk to me. They shut down and just keep repeating \"I can't do that it's out of my hands\" to every single question I have about my account, but they give all answers and explanations to my mom.\n\nUpdate: I called headquarters today and who I spoke with said \"if she can pull up your breakdown on her computer and tell you what's going on with your account there's no reason she cant give that to you.\" The person at headquarters i spoke with immediately emailed me my breakdown and reviewed it with me in real time. I was also told I should be getting letters in the mail with updates on any and all changes (which i never have gotten and I've been asking this office to fix) so the lady at headquarters made a note on my account for that to be fixed.", "pics": null, "resp": null, "gmap_id": "0x88620d585864162f:0x9c833d18b0a92a7a"}
{"user_id": "115977458552717310182", "name": "Justin Young", "time": 1568838213207, "rating": 5.0, "text": "Tyler Ross is an exceptional person. He is very thorough, caring, and driven to serve to his customers. If you live in the South Huntsville Area, and are needing professional insurance advice and service, he's your guy.", "pics": null, "resp": null, "gmap_id": "0x88620d585864162f:0x9c833d18b0a92a7a"}
{"user_id": "113291594850599514913", "name": "Rob Austin", "time": 1597943448096, "rating": 5.0, "text": "Tyler provides excellent service for his clients!", "pics": null, "resp": null, "gmap_id": "0x88620d585864162f:0x9c833d18b0a92a7a"}
{"user_id": "118005019822138114336", "name": "Tyler Ross", "time": 1568731374866, "rating": 5.0, "text": "Wonderful ladies out front, great service. Trusted claims service. I was a customer before I was an agent!", "pics": null, "resp": null, "gmap_id": "0x88620d585864162f:0x9c833d18b0a92a7a"}
{"user_id": "103100108075498210856", "name": "Linda Edwards", "time": 1530306608069, "rating": 5.0, "text": "The employees are so friendly and always try to help in any way they can. Even 30 minutes before closing the office they took my call and helped me!", "pics": null, "resp": null, "gmap_id": "0x88620d585864162f:0x9c833d18b0a92a7a"}
{"user_id": "107664738144158443415", "name": "Leon Coyner", "time": 1533680282323, "rating": 1.0, "text": "Had a break in 2 months ago still waiting  on adjuster to send paperwork.", "pics": null, "resp": null, "gmap_id": "0x88620d585864162f:0x9c833d18b0a92a7a"}
{"user_id": "110173963842502647556", "name": "Michael Beasley", "time": 1532990155387, "rating": 5.0, "text": "All I can say is thank you Mario Williams you went above and beyond and saved the day", "pics": null, "resp": null, "gmap_id": "0x88620d585864162f:0x9c833d18b0a92a7a"}
{"user_id": "117800999328705908307", "name": "Wally W", "time": 1576346569118, "rating": 5.0, "text": "Great insurance been with them 20 years never had a issue with claims they have always been there.", "pics": null, "resp": null, "gmap_id": "0x88928eee09c951a1:0x2780a3f46e75dd5"}
{"user_id": "107227098665924559172", "name": "Don Hand", "time": 1502412133458, "rating": 4.0, "text": "Good experience with this office.", "pics": null, "resp": null, "gmap_id": "0x88928eee09c951a1:0x2780a3f46e75dd5"}
{"user_id": "100620675969196989201", "name": "Christine Bartels", "time": 1617399191016, "rating": 5.0, "text": "I'd like to extend my gratitude to Mr. Rowan and his staff. He personally met with my mother, Anna, and corrected a life insurance policy from a previous agent. He and his staff continue to set her mind ease. 👍", "pics": null, "resp": {"time": 1624017100905, "text": "Christine,your parents are such sweet folks! We sure appreciate you allowing us to serve their life insurance needs along with home insurance and car insurance here in Huntsville Alabama."}, "gmap_id": "0x88621332bdee0865:0x60cdf6bfef04e6e7"}
{"user_id": "116948791376746852989", "name": "Mary Dudley", "time": 1619109975614, "rating": 5.0, "text": "Ben with this agent since the 70's. Love state farm.", "pics": null, "resp": {"time": 1624017215373, "text": "Mary we sure appreciate you and your family and look forward to serve you and all your needs for your home and auto insurance in the future."}, "gmap_id": "0x88621332bdee0865:0x60cdf6bfef04e6e7"}
{"user_id": "113286449185528527424", "name": "Charlotte Taylor", "time": 1600868107242, "rating": 5.0, "text": "I have been with Robby every since he's been an agent, he and the office staff have always been  very courteous and always ready to help in any way.", "pics": null, "resp": {"time": 1600862524644, "text": "Charlotte, thanks for being such a great customer!"}, "gmap_id": "0x88621332bdee0865:0x60cdf6bfef04e6e7"}
{"user_id": "106989413441949372972", "name": "Aaron Thomas", "time": 1580268133267, "rating": 5.0, "text": "Robbie and his team are amazing. I had a complex commercial insurance requirement that was constantly evolving. They were prompt, professional, and went the extra mile on a daily basis. When I wasn't able to talk to Robbie directly, (which was rarely) Adam took care of everything. I wish they had an option with more stars. Thanks State Farm!", "pics": null, "resp": {"time": 1612628092112, "text": "Aaron, we appreciate you allowing us to serve you and trust us with any complex questions for us to gain the best outcome.  We enjoy assisting great businesses and families in Huntsville and Madison, Alabama!"}, "gmap_id": "0x88621332bdee0865:0x60cdf6bfef04e6e7"}
{"user_id": "109590719899354767354", "name": "Susan Duthie", "time": 1533266635843, "rating": 5.0, "text": "I am treated great by Mr. Rowan, along with his staff via Chris and Laura. They are so patient, kind, professional and in their willingness to help give my family the best possible coverage, along with helping us stay within budget, too. They are conveniently located, also.  Thank you for all your help, attention to detail, patience, knowledge, and sincere kindness.  I will continue to do business with Robby Rowan-State Farm, along with continuing to recommend their agency and services to others.", "pics": null, "resp": {"time": 1600862744580, "text": "Susan, we appreciate you and look forward to assisting you.  Thanks so much for the kind words!"}, "gmap_id": "0x88621332bdee0865:0x60cdf6bfef04e6e7"}
{"user_id": "117789082181176784297", "name": "Carlotta Howard", "time": 1612373959456, "rating": 5.0, "text": "Very good and reliable insurance", "pics": null, "resp": {"time": 1612562814869, "text": "We sure appreciate you Carlotta, always thanks for allowing us to serve you!"}, "gmap_id": "0x88621332bdee0865:0x60cdf6bfef04e6e7"}
{"user_id": "113460990073926794895", "name": "Connie Carter", "time": 1600978124133, "rating": 5.0, "text": "Fantastic agent and team members are the Best ❣", "pics": null, "resp": {"time": 1612562876216, "text": "Connie we sure appreciate you and we look forward to serving you!"}, "gmap_id": "0x88621332bdee0865:0x60cdf6bfef04e6e7"}
{"user_id": "100156349172618182696", "name": "Nichole Bee", "time": 1595193548580, "rating": 5.0, "text": "Been amazing for years and exceptional service.", "pics": null, "resp": {"time": 1600862447299, "text": "Nichole, Thank you for the kind words we always look forward to serving you!"}, "gmap_id": "0x88621332bdee0865:0x60cdf6bfef04e6e7"}
{"user_id": "106741270653134453184", "name": "Scott Plagmann", "time": 1496615887841, "rating": 5.0, "text": "Great experience!", "pics": null, "resp": null, "gmap_id": "0x8889046c4dc2a7b7:0xd9b1998d45410ddb"}
{"user_id": "100967576557464760561", "name": "Tina Williams", "time": 1610738931854, "rating": 1.0, "text": "I bought insurance from them two years ago.  They did not give me a competitive rate, charged me $35 cash for their services, and the owner, Paul Roberts, was very rude, but the other guy in the office was helpful, (although he could do nothing without asking Paul).  I went back to ask for flood insurance after Hurricane Sally (September 2020) because FEMA deemed my property to be in a flood zone.  Waited a month.  Called again and left a message.  Talked to Paul himself this time, who said he'd check and call me back. Waited another month and nothing.  I risked just showing up at their office next. I spoke to the other guy who said he'd tell Paul to call me.  It's now January 2021 and I'm still waiting.  The Insurance agency they set me up with won't deal with me directly.  They have to hear from Paul, and Paul couldn't possibly care less!  So unprofessional!", "pics": null, "resp": null, "gmap_id": "0x889a4d8597d299e9:0xb004b544a5ea2d48"}
{"user_id": "100864651910214263867", "name": "Nate Crabtree", "time": 1552743075872, "rating": 5.0, "text": "Great service, affordable insurance", "pics": null, "resp": null, "gmap_id": "0x889a4d8597d299e9:0xb004b544a5ea2d48"}
{"user_id": "106574148164203850254", "name": "Paul Roberts", "time": 1595700895864, "rating": 5.0, "text": "Great!", "pics": null, "resp": null, "gmap_id": "0x889a4d8597d299e9:0xb004b544a5ea2d48"}
{"user_id": "105608238318526412839", "name": "alexander woodard", "time": 1520373219675, "rating": 1.0, "text": "IF YOU WANT NONSTOP PROBLEMS.... THIS IS THE PLACE!!!!  BEWARE!!! SHOP SOMEWHERE ELSE!!!! YOU'VE BEEN WARNED!!!", "pics": null, "resp": {"time": 1520388610018, "text": "So sorry that you feel that way Mr. Woodard. We tried to do what you requested in a timely way. I'm sorry that following your instructions wasn't what you really wanted."}, "gmap_id": "0x889a4d8597d299e9:0xb004b544a5ea2d48"}
{"user_id": "115874563116520773011", "name": "Jill Ainsworth", "time": 1566466714086, "rating": 5.0, "text": "My husband and I recently purchased our first home and in trying to find the best rates for homeowners insurance we were referred to Gabe Martin.  Hands down  the best possible choice for our family! Not only did he give us a much cheaper rate on homeowners insurance he was also able to get us a better rate on car insurance and point out some changes we needed to make to be sure if we were in a accident we were completely covered. Gabe took the extra time to sit down with us and explain every question we had in regards to homeowners, vehicle and life insurance. I am so very glad we were steered in his direction! He was a blessing to our family in what can be a very stressful time and we are forever thankful for his guidance and look forward to doing business with him for many years to come!!", "pics": null, "resp": null, "gmap_id": "0x88926eb102cb9f25:0xa08cd89fd8078a60"}
{"user_id": "104313680687472899875", "name": "stephanie ziglar", "time": 1569071810918, "rating": 5.0, "text": "Gabe & His Staff have went above & beyond for my family!!!!  We could not be happier with how easy it was to transfer our insurance to him.   Super Fast, Exceptional Customer Service, & rates that were saving my family money!!  It was a Win Win!!! Thanks Gabe!!!", "pics": null, "resp": null, "gmap_id": "0x88926eb102cb9f25:0xa08cd89fd8078a60"}
{"user_id": "100643199118892719993", "name": "Tony T", "time": 1610045760329, "rating": 1.0, "text": "Absolutely terrible should just close this location down", "pics": null, "resp": null, "gmap_id": "0x88926eb102cb9f25:0xa08cd89fd8078a60"}
{"user_id": "112129277729705995189", "name": "Christin Moore", "time": 1513737268132, "rating": 5.0, "text": "My husband and I have life insurance through Alfa and our agent is Gabe Martin.  Any time that we have questions about our policies, he is very quick to respond and willing to advise us on which policies are most appropriate for us. He truly cares about his customers and will do whatever he can to provide exceptional service. There is honestly no one I would feel more comfortable entrusting with our insurance needs.", "pics": null, "resp": null, "gmap_id": "0x88926eb102cb9f25:0xa08cd89fd8078a60"}
{"user_id": "115467300363797450132", "name": "Sandy Love", "time": 1513741858300, "rating": 5.0, "text": "I've known Gabe for years! The first time I insured anything with him, I bought a car toward the end of the work day on a Friday (I believe) and he agreed to insure! That was in 2007! Since then, I've gotten married and we ended up moving all our insurance to Gabe! He has always been helpful - through 3 totaled vehicles😱! He is dedicated and truly cares about his clients.\nFor each accident, Gabe made sure I knew each step to take (although unfortunately by the 3rd I was starting to feel like a pro😞). He worked to make sure everything was in order and handled so the claim was paid quickly... Even when we were hit by an uninsured driver. Even though our vehicle insurance was dropped (because of Alfa regulations about total loss - NOT GABE), we have our other insurance with Gabe still - with no plans of changing! He was extremely helpful when we recently bought a home. (*and btw, Gabe made several phone calls with me sitting in his office trying to get the auto insurance reinstated).\nGabe is a hard-working, trustworthy, community-minded man that I would recommend to anyone looking for insurance!", "pics": null, "resp": null, "gmap_id": "0x88926eb102cb9f25:0xa08cd89fd8078a60"}
{"user_id": "102040461105288587049", "name": "John Cole II", "time": 1550856144215, "rating": 5.0, "text": "Best agents in town! Great customer service!", "pics": null, "resp": null, "gmap_id": "0x88926eb102cb9f25:0xa08cd89fd8078a60"}
{"user_id": "111114512807709466408", "name": "Abby Fry", "time": 1513978253668, "rating": 1.0, "text": "I feel the need to warn people of getting ripped off by a local insurance agent Gabe Martin with Alfa insurance. My husband and I began looking for our home to purchase in August 2017. After we decided on a home and were under contract I contacted Gabe for a quote. My husband and I decided that since we will be moving in a few years it was best to keep our current insurance-- we've never had any issues with them. We closed on our home on Oct 24th 2017. I noticed in November that our homeowners insurance never got paid (the seller paid 1 year at closing). I contacted both my insurance company and our mortgage company. The mortgage company had the incorrect insurance information and the two exchange information. In the meanwhile, Gabe showed up to my home and told my husband that I had contacted him to change insurance companies and had him sign an application--3 weeks AFTER we closed on our home. Now, why would an insurance agent that I contacted be going behind my back and having my husband sign paperwork? My husband trusts what he said and signs the paper, we just wrote it off as just for it was for quotes or something and never thought of it again. A couple of weeks later, I get a letter from our mortgage company stating that we had previously had Alfa insurance and that it was our responsibility to cancel our policy. Now, I never received a single letter from them-- I had no idea what my policy number even was. They had received a check and cashed it WITHOUT ANY KIND OF PERMISSION. I called Veterans United to find out that Gabe took it upon himself to get my PERSONAL loan information from my lender and added Alfa insurance to our loan-- we never signed any kind of paperwork when did this. I called Gabes office-- who could not care less about the issues I was having. The secretaries were VERY disrespectful and nasty. Then Gabe called me and was even worse. He was saying that he had text messages saying I wanted insurance-- which was not true. And said that this was my fault and that I had contacted him and I must have forgotten. I had to take this all the way up to the district manager and it took 2 months and I'm currently waiting on my refund check. Remember how I said the seller paid at closing? Well, that amount was less than what our current insurance is-- and since we've closed there is no way to get the hundreds of dollars difference back from the old seller so we are out this money because of Gabes actions. We never received any kind of apology and they take no responsibility. I would steer clear of Alfa insurance-- especially Gabe Martin.\n\n**** there one only one review of Gabe Martin-- from himself. Since I've given this very honest review magically there are multiple positive reviews. FAKE!", "pics": null, "resp": null, "gmap_id": "0x88926eb102cb9f25:0xa08cd89fd8078a60"}
{"user_id": "112646355693632748268", "name": "Stephanie Van Zante", "time": 1531945933655, "rating": 5.0, "text": "Friendly staff, great service", "pics": null, "resp": null, "gmap_id": "0x88926eb102cb9f25:0xa08cd89fd8078a60"}
{"user_id": "110616671367226506577", "name": "Carolyn Lossing", "time": 1582929367832, "rating": 5.0, "text": "Me. Ken, Miss. Sandy, and Miss. Brenda are so sweet and helpful! I love this office they are like family!", "pics": null, "resp": null, "gmap_id": "0x8892f5ad3b762a75:0x2017ccf0bcf755a0"}
{"user_id": "111502932820682492969", "name": "Patricia Owen", "time": 1604953842310, "rating": 5.0, "text": "This is a people friendly company and very helpful in working with you about the insurance you need.", "pics": null, "resp": null, "gmap_id": "0x888917645a99bdc1:0xa4acb3a120d17254"}
{"user_id": "107143192680574166023", "name": "Justin Hardy", "time": 1553009870841, "rating": 5.0, "text": "Best experience with my business insurance. Great rates but even better customer service. We’re able  to adjust my insurance quickly based on my business needs. Thanks, Adam!", "pics": null, "resp": null, "gmap_id": "0x888917645a99bdc1:0xa4acb3a120d17254"}
{"user_id": "110424879307982338450", "name": "Cheryl Watson", "time": 1552428689960, "rating": 5.0, "text": "William Phillips is the best commercial agent I have ever met. He, and the entire agency, run it like in the good old days. Customer service is their priority. I would highly recommend them for any insurance needs.", "pics": null, "resp": null, "gmap_id": "0x888917645a99bdc1:0xa4acb3a120d17254"}
{"user_id": "102192888301997086424", "name": "Celena Miller", "time": 1552503927748, "rating": 5.0, "text": "I appreciate William Phillips for helping me with E&O insurance. I now have a great coverage and his service was fantastic.", "pics": null, "resp": null, "gmap_id": "0x888917645a99bdc1:0xa4acb3a120d17254"}
{"user_id": "116729827139356290878", "name": "Jason Stringer", "time": 1612919794901, "rating": 1.0, "text": "I have been with Blue Cross Blue Shield of Alabama For years (2012)\nMy premium started then $170.00  (2021 is $645.00)\nI tried to add the wife in the enrollment time only to find out that she was not added.  Blue Cross stated that the mistake was on their end that the issue would be resolved and my wife would be added to the policy.  The policy would be backdated to reflect the correct enrollment time.  A week later after talking to several different agents and \"supervisors\" the issue is still not resolved.  I was to be contacted and updated at the beginning of the following week of the issue by agent Daryl Martin whom was working closely with his supervisor, Michelle.  I contacted Blue Cross on Tuesday after no follow ups were made.  Only to my disappointment to hear that the issue is still not resolved and no updates to report.  So, my wife is still without insurance coverage after I followed all the guidelines mandated by open enrollment.  As of today a week later after discussing the matter with Blue Cross another agent by the name of Tom (ext. 51492) stated that no movement has progressed beyond last week.  I find this very frustrating and after the years of customer loyalty consider this to be an insult.  I would state buyer beware on purchasing any policies from Blue Cross.  Premiums continually rise while customer service continues to decline!!  At this point I am hoping Blue Cross will take the necessary steps to keep my business and make the issue correct.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "105598836978113696343", "name": "Julio Jones Kia Mazda", "time": 1619282012075, "rating": 1.0, "text": "I just got this insurance through my employer and paid 3 weekly premiums of $144 thus far. However, I have yet to receive my medical cards through the mail and none of my doctors can confirm my membership in the system. This despite the fact that I have received my dental cards already. This does not make any sense! I have to call them to request my ID cards. REALLY???", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "111868305807570226817", "name": "Rachael Wilson", "time": 1617112706524, "rating": 1.0, "text": "After having surgery and being prescribed a simple cream for pain relief, BCBS of AL refused to cover it. You DO NOT cover what matters so stop advertising that slogan. You should be ashamed of yourselves.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "105112250417956539690", "name": "Jimmy Evans", "time": 1620216325388, "rating": 5.0, "text": "Beautiful facility very large I was only here to deliver flowers", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "115364404756932775883", "name": "Hey Em", "time": 1609269939054, "rating": 1.0, "text": "I’ve never had so many issues with an insurance company until they were my only option for mine and my husband’s place of work. This was also such a terrible year to have this insurance company as we had a baby. We are up to our heads in medical bills because they magically can’t cover them. It’s hard enough caring for an infant without all of this added stress. They clearly don’t care for their clients. I’m tempted just to not even have insurance. It would actually be cheaper.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "117629756667718528408", "name": "Stephen Atkinson", "time": 1614693531537, "rating": 1.0, "text": "I had a year and a half of horrible experiences with BCBS. After 26 months of arguing about a doctor's visit I was told I was covered for, one of the managers finally pulled the recording of the phone call and is getting it taken care of. It has taken me a hundred hours of calls to get what I needed done, and I dropped their coverage after a year and a half. After dropping coverage, they continued to charge me for my monthly premiums. I went months after surgeries without meds, because even though I was covered for the meds their incompetent staff couldn't file the paperwork correctly. It took dozens of phone calls between them and my pain clinic for them to realize the difference between two drugs that started with the letter t. No two people who field phone calls are trained to do the same work. \"I don't have an answer for that,\" is the most common response. Horrible stuff.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "118122662407267677584", "name": "Adam Evans", "time": 1623691380686, "rating": 1.0, "text": "Shady company refuses to pay on the flimsiest pretense at every opportunity.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "109622063872276870427", "name": "GKM Remote", "time": 1603482814701, "rating": 1.0, "text": "Good luck getting a person on the phone. I have been trying to do a preauthorization for one of my patients for TWO DAYS and have gotten the run around with no answers.  Absolutely UNACCEPTABLE.  This company makes it so difficult to use the benefits that the patient pays for.  They should be ashamed of themselves!!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "108920699388441319230", "name": "Kyle Wingfield", "time": 1606317051423, "rating": 4.0, "text": "I had the pleasure of working with Barbra on the phone and she was EXTREMELY  helpful and an absolute pleasure to deal with (the most pleasant person I have dealt with in Customer Service)!! More companies could use people like her. she was very attentive and made a crazy amount of effort to take care of the issue I was having. Even the medical office called me to update me and express their satisfaction with Barbra at BCBS. I have had MANY rather dull experiences with BCBS, and my wife has had a tough time dealing with BCBS at times... that is the only reason they aren't 5 stars. Barbra single handedly took you from a 2 star in my opinion to a 4 star!\n\nCoverage is what you choose I guess. I have have very little issues with their coverage.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "118230499288951397754", "name": "Morion Siler", "time": 1602778191173, "rating": 1.0, "text": "As a customer who values his health, it is hard to believe that a insurance company does not have the best interest for its clients. The insurance company is nothing, but a business taking money out of our pockets. To make matters worst, they hire so many unprofessional individuals who have no knowledge of their services. I have been communicating with this insurance company for two weeks regarding a claim their pharmacy department processed incorrectly. Pretty much, I have been given the run around, told someone will contact me, told I am not able to speak with a supervisor, told the matter will be resolved and as of today , going on two weeks nothing. My out of pocket deductible is 400 for the year which should have been met. However, Bluecross is saying that I have not met my deductible as of yet. I plan to have a medical procedure done soon which was scheduled because my benefits would cover over 80%. This is a prime example of how bluecross is trying to save their company and employees money by not  processing claims like they should which means my benefits would not kick in, due to my deductible not being met. I really do wish and hope officials could look at the way the insurance company's are not for the citizens.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "116134297143211063579", "name": "Cathy Peoples", "time": 1605625412769, "rating": 1.0, "text": "BCBS have been my insurance provider for years and I have never had any problems but let me say I have never had any major needs. In August of this year I had my first major surgery which was a total knee replacement. Based on the information received  I was only given 20 therapy visits to recooperate. Both my Doctor and the therapist stated that 20 visits were not nearly enough for me to properly recover. I contacted BCBS to see if I could get an extension and was told that 20 visits is all I could get and I could not appeal but the therapist could. I thought this was upsurd because I am the customer who is paying the bill not the therapist but I can't appeal.  So now I am limping around and forced to pay out of pocket for additional therapy,  something that I pay for monthly. If I wasn't going to get the services I need to recover I would have much rather the surgery be declined. Everyone knows that therapy is the key to a successful total knee surgery.\n\nMy neighbor has BCBS also but I undoubtedly she has a different plan because she received 60 therapy visits for the same total knee replacement 2 weeks after mine. If 60 visits are necessary for some why not all? For years I have heard about what a great company BCBS is but as a so called valued customer I am very disappointed with the quality of service I have received and I definitely don't feel valued.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "105094306791211358908", "name": "Blake Felts", "time": 1603483308470, "rating": 1.0, "text": "My ent doctor recommends balloon sinus surgery which has been around for years.  Bcbs of Al, told my Drs office the procedure isn’t covered because it is “not medically necessary”.  Who are you to say it isn’t medically necessary?  My doctor and I think it is. Other BCBS like NC covers the procedure.  I have file an appeal but have yet to here anything from them.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "100288851330142185541", "name": "Dan Harper", "time": 1604933343675, "rating": 5.0, "text": "have had the C-Plus for 10yrs for self/wife.  between both of us, 4 joint replacement and normal dr visits for retired seniors.  have not had any claims denied or delayed and have not had any out of pocket $$$$.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "106182065583125407850", "name": "Tingy Chen", "time": 1587049985222, "rating": 1.0, "text": "I am a dental provider and was asking dental breakdown for my patient to provide correct estimate. I've requested fax for breakdown twice but I did not receive it before our patient's appointment. Therefore, I called for a verbal quote but their policy is different than most of insurance company. As a dental provider, we want to offer the most correct price estimate so I call again to do the final verify. Then the girl working there told me they are only allowed to give me verbal quote ONCE! She refused to tell me the breakdown on the phone... and their fax machine does not work. So how am i going to provide estimate to our patients? This is ridiculous! Please, do not buy their insurance because the custom service sucks!!", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "113785608922205624981", "name": "Huey Harris", "time": 1613755693477, "rating": 1.0, "text": "Adona was very rude and not professional I am feeling this is the norm for Alabama out of the 10 people I spoke to only 2 was nice", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "112316313251224271769", "name": "ChefB", "time": 1596053746852, "rating": 1.0, "text": "Do not get the short term policy. It doesn’t cover anything. You’ll be left paying a tremendous amount on top of a doctors bill. A waste of money.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "118031768246344712903", "name": "Jamie Pugh", "time": 1597162785304, "rating": 1.0, "text": "I have a torn Labrium cartilage and rotator cup and neck injury and i have numbness down my left arm and pain constantly and they will not approve a MRI to see how bad it has gotten from 3 years ago. But the operator on th ephone says that blue cross and blue shield cares for there customer and here is a customer that they don't care about because i cant get an MRI done. So what is the use of having bcbs if they dont help customer", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "103281821118490150390", "name": "Island Love", "time": 1588008844584, "rating": 1.0, "text": "I wonder when google will allow zero or negative star rating. This company should be ashamed of themselves. They coverage is nothing. I never paid for annual check lab until this year. BCBS of AL claimed they only cover certain blood test and none of my test is covered under their policy. Unfortunately, I have to stick with them because my employer [EMERSON] will not offer any other provider.  I think is a disgrace in this country to pay $850.00 a month for health insurance when a simple blood test is not cover.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "107512621865577185609", "name": "Karen H Harrison", "time": 1597600712177, "rating": 1.0, "text": "Even though you pay this company many dollars beware.... they do not represent you, they represent the hospitals that they pay.  Recently had a dispute of a charge that was done for the benefit of the hospital.  I was shown by another facility how it could be done differently and BC/BS said they can't help with that, the hospital can bill however they want to.  They straight up said they do not have an advocate for the patient, only for the hospital.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "105802386040078403026", "name": "Lauren Bresnahan", "time": 1595551879494, "rating": 1.0, "text": "So far this year my Blue Cross of Alabama insurance has refused to pay for labwork (CMP, which is very routine, and TSH) my primary MD deemed necessary at my annual visit and my annual pap-smear at my OBGYN. I pay for this insurance every month and only use the coverage for preventive care, and they won't even cover that. If Blue Cross was smart, they would encourage and cover preventive care, both to reduce the costs of chronic health conditions down the road and to improve the health and wellbeing of Alabamians overall. It's no wonder we rank near the very bottom of the country in our health rankings! Blue Cross, this is unacceptable.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "112736625908591751529", "name": "Kimberly Bowen", "time": 1592404383083, "rating": 1.0, "text": "They give wrong information about their own policies and where to get medical equipment from. I’ve called them about twice a week for the las six weeks trying to figure out who is in network to order pump supplies from, and everytime they give me an authorized provider, I call the provider and they say they don’t work with BCBS of Alabama.\n\nThe providers they supposedly work with are just as bad, taking forever to get back to you: and will overcharge you for supplies.\nM", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "113289036411750238937", "name": "Shelia Forrester", "time": 1584048673041, "rating": 1.0, "text": "This is the worst insurance company with the worst employees ever. They are very rude and do not care at all about their customers. With BCBS of Al, they are all about lobbying and raking in the money at the customers expense. I wish I could give them a negative number or at least a zero. With them, you pay a fortune for your insurance and then when you go to the doctor, most of the expense is still yours to pay. They always find a way to get out of paying things that they should. It is a shame that Alabama has allowed them to have a monopoly on health insurance in this state.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "110964310909098494125", "name": "Justin S", "time": 1590001042622, "rating": 1.0, "text": "Worst customer service phone line I have ever experienced. The robot is glitched and bugged, nearly impossible to talk to an actual person.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "115181236831765039243", "name": "Michelle Spann", "time": 1591981258414, "rating": 1.0, "text": "If I had the opportunity to choose other health insurance I would. This company does not follow through with their promises, and they do not have good customer service.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "111738338659751052807", "name": "Jessica Ellis", "time": 1611252073035, "rating": 1.0, "text": "Con-artists.......Poor customer service I was forgot on hold while an at home worker was dealing with her infant child just to call back and get talked down to by another lady like I was ignorant.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "105485892594894190489", "name": "Corey Morgan", "time": 1572829502615, "rating": 5.0, "text": "Excellent customer service. I wish everybody could use another insurance company before they review these guys. No comparison.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "101386708552895634216", "name": "Kevin McPherson", "time": 1520372037152, "rating": 1.0, "text": "BCBS used to be the best.  They now abuse many of their customers and patients. I am on the Gold plan and can't even get the Insulin I need because it works the best for me.  Now I am taking almost twice as many shots and my blood sugar is much more out of control.  Not to mention, I can't get the most accurate test strips, which reduces my control even more.  I have had diabetes for 35 yrs, have used nearly every type of insulin ever created.  They have never seen me or prescribed me medication, even when I asked them to.  How do they know which is best for me?  They don't care.  They need to approve all legitimate medication, with a varying copay, instead of telling patients that won't cover it at all, or not telling anything and just not covering. They say their plan does not mean to dictate what doctors prescribe, and it doesn't as long as you are okay with paying full price at your expense.  I am disgusted and know that one day they will be where they deserve!!", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "106845086800153132052", "name": "Cathy Garza", "time": 1581697629343, "rating": 1.0, "text": "Worst customer experience EVER.. DDON'T TALK TO A DEBBIE", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "108659432113082811921", "name": "Wise Queen", "time": 1572182010304, "rating": 5.0, "text": "I’m a current BCBS of Anthem healthcare insurance carrier (gold plan). With my job switching to the healthcare insurance most widely used in the state during our next open enrollment period coming up Nov 1st which will be BCBS of Alabama these reviews have me seriously second guessing if this is a good move or not. Hopefully I don’t have any issues and I can come back and give BCBS of Alabama a positive review but for right now these stars are solely based off of BLUE CROSS BLUE SHIELD OF ANTHEM (and plus that’s the only way I could post a review/comment).", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "103873697122756802845", "name": "Rajendra Shetty", "time": 1597684988265, "rating": 1.0, "text": "Hope I could give negative rating .Worst Policy ever .Does not cover anything though we are are on high premium", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "100896506525192234050", "name": "Zachary", "time": 1537503534308, "rating": 3.0, "text": "Over further use they have changed my views a bit. Although the hoops you have to jump through are a bit much and annoying at times, their coverage does seem to be better than first experienced. I had to change from CVS as they didn't use them in their network but being forced to move to a friendly pharmacy was a breath of fresh air.  No company is perfect and everyone has to make a profit but they have helped me in my time of need. Will that change and will my feelings change? Quite possibly but for now I am content in my short time experience.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "104882763428357725187", "name": "Presh B", "time": 1553104493965, "rating": 1.0, "text": "You really dont even deserve the one star, truth be told, but I couldn't leave a review with out a star. The customer service is terrible. I am not sure if it's all new agents or what but instead of helping the situation to make things better or get them fixed, the agents I had to interact with acted as if I was bothering them with my problem.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "105816513904358739341", "name": "Elizabeth Del-Rio", "time": 1556800848779, "rating": 1.0, "text": "Run for this Health Isurance. Customer Service is\nhorrible and racist. WORST insurance in the world expensive copay even with premiums the copay is 80/20 and for some reason they never want to pay providers and you get hang with  ridiculous  charge  of money.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "105942425761147220623", "name": "Renae McKinzie", "time": 1592438595755, "rating": 1.0, "text": "Not worth the money. Don't cover anything.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "104471520327884064487", "name": "Nick Hayes", "time": 1559640399972, "rating": 2.0, "text": "We had good service for a while, then a routine procedure was denied.  We attempted to appeal the denial only to be rejected.  Their “guidelines” said that the lab procedure was investigational and that they wouldn’t cover it.  Every lab is investigational and they cover most of them! They cherry pick what they will pay for and leave you with a big bill when they, out of the blue, deny to help you.  Even a letter from the Doctor holds no sway over them, as they, obviously, believe themselves more knowledgeable than a medical specialist.  I guess it’s better than having no insurance, but at least then you know you are going to have to pay.  BCBS instead likes to blindside you with a large medical bill.  No care for their clients, it’s obviously all about the money to these people.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "101523126564113069394", "name": "Sam Bone", "time": 1521136951106, "rating": 1.0, "text": "Put you on hold and let you talk to a computer. Can't get in touch with an actual human. Just want to find out where to get something filled but can't get in touch with a real human to find out my eligibility.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "100640583969966337181", "name": "Cheri Reid", "time": 1521907896861, "rating": 1.0, "text": "BCBS, Health and Dental plans 2018 suck!! We have had for over 25 years. Since Obama Care, premiums for customers have doubled, doesn’t pay hardly anything for prescription drugs!!! Ridiculous and horrible for what you pay in monthly premiums. In Alabama they rule the markets! It’s a shame... they used to be the best!! NOT ANYMORE 😡", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "102347572926648101311", "name": "LexeyMak Mo", "time": 1603233706759, "rating": 1.0, "text": "Their slogan, \"We cover what matters,\" is a lie", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "103590089265447681907", "name": "Dagmara Frankowska", "time": 1582667672418, "rating": 1.0, "text": "Every other BCBS comes allergy treatment but Alabama. It is the worst plan I ever had.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "106634412158565540864", "name": "Deborah Trammell", "time": 1555626610294, "rating": 1.0, "text": "I dont even think they deserve a 1. Years ago was excellent . Presently very sorry ,very disorganized.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "113873635151522764301", "name": "avcallins cdbassociates", "time": 1537685383103, "rating": 5.0, "text": "I have NO COMPLAINTS about the Treatment that I've received over the last few years from BC/BS of Alabama.  I'm a participant through the MarketPlace and I've received quality, vital medical treatment and am AWARE of no problems with coverages...eventhough I, at times, wondered if there might be.  A few challenges and changes have popped up.  However, the end result didn't hurt too much.  I'M VERY GRATEFUL for the coverages I've received under BC/BS.  I'm glad that they've associated with VSP to offer assistance w/Vision Insurance, which I'll be taking advantage of shortly.  Thanks BC/BS!", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "118023098638472928735", "name": "Jade Nguyen", "time": 1553180620972, "rating": 1.0, "text": "If I can give it 0 star, I would. It would be better to not have insurance than have insurance when you have to pay out of pocket no matter the what.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "114349704626552946703", "name": "Mary Brown", "time": 1468247033065, "rating": 5.0, "text": "I called in this morning for assistance (Birmingham, AL).  Daniel R. provided excellent service and explained what I did not understand.  Now I have to get with the doctor's office and the pharmacy.  Knowledge is everything.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "108203003773942342572", "name": "Gail McLaughlin", "time": 1462540241043, "rating": 1.0, "text": "This company is getting richer every day on tax payer money. They use and abuse their power making clients jump through hoops just to get medical care.  They have used the \"Obama Care\" as an excuse to not pay claims and/or charge twice as much for premiums but they get paid regardless of where the money comes from. Just more abuse from Corporate America.\n\nI would not give a one star, however, you can't post unless you do.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "115829740102465307735", "name": "Jonathon Passero", "time": 1591044366360, "rating": 1.0, "text": "Terrible coverage for what you pay....extremely bad", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "113631864651412361655", "name": "Aisha Paige", "time": 1454946929015, "rating": 1.0, "text": "I experience fraudulent activity. Blue Cross charged my account for consecutive months for someone else insurance. They refused to refund the money after 2 months of consistently calling them. I do not recommend giving any of your information to this company because it will not be protected. I am a hurt former customer. A company steals my hard earned money and nothing is done about it.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "109229831319827520969", "name": "Chris", "time": 1512683114629, "rating": 1.0, "text": "Customer Service is unresponsive, but they are more than willing to put you on hold for 2 hours.  If you have another option select that it.  BC/BS used to be unbeatable, now they are unacceptable.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "100800331254048914469", "name": "mia fiterman", "time": 1569356730988, "rating": 2.0, "text": "We need choices Alabama! Blue Cross is completely arbitrary in what it applies and when to deductible and out of pocket... I don't like playing these games...", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "112344014805847679517", "name": "Armus Skinofevil", "time": 1522677187290, "rating": 1.0, "text": "They lie. Simple as that. Don't trust them.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "108497414711840383000", "name": "k wright", "time": 1507136237301, "rating": 1.0, "text": "I sadly was forced to take out the stupid aca insurance so I went with BC/BS of Alabama. Bad choice! They denied my diabetes medication that I have been taking for year! Thanks to our crappy government for coming up with such a crappy insurance program!!! I will NOT be recommending BC/BS  to anyone! I wish there was a lower rating than one!", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "117966614769501115932", "name": "E. M.", "time": 1478539654412, "rating": 1.0, "text": "Ever since Obamacare BCBS has done nothing but go down hill. Our price continues to go up, however; our coverage continues to go down. I received a bill from a medical collections agency charging me the full amount of my yearly doctors visit that is REQUIRED by Blue Cross. I have been using the same doctor for years and ordinarily only have to pay a copay for my yearly exam, so I was sure there was a mistake when I received a bill for the full amount. I called BCBS of Alabama and they informed me that their policies had changed YET AGAIN and they no longer cover the lab that my doctor sent my lab work to. Blue Cross never sent out a notice of these policy changes and my doctor did not inform me that BC does not cover their lab. This is not my fault however it has become my problem because BC refuses to pay and I am stuck with the bill. I love living in a country where you get less when you are a hard working citizen and more when you take from society without contributing at all. To those who \"live off the government\" the government is not supporting you, hard working people like me are, so I hope you enjoy the advantages of medicare. I'm glad to know my money can pay YOUR medical bills because it sure doesn't pay mine.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "101878745489918221358", "name": "Patricia Goldsmith", "time": 1459887040242, "rating": 1.0, "text": "After having been a customer for years,  can't wait to get free of this company after this year.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "106423102782982029861", "name": "Amber Piersol", "time": 1464199715104, "rating": 1.0, "text": "You know there are somethings Blue Cross is great at and there are some that they really need to work on.... For example I have a child that sees a psychiatrist regularly and most all the doctors with in a 100 miles of us have stopped taking our type of BCBS or quit taking patients. We have had to change doctors 4x or more in the last couple of years because of this. You know it's important for this type of doctor to build a relationship with there patient and also know what kind of testing has been done and make sure its all up to date. It's hard if your constantly hopping from one doctor to the other. All I want is a doctor with in 10 miles of my home and accept my insurance and I've combed there doctor search porthole and talked to customer service and every other 1800# they have is it to much to ask to work with these doctors so they can get paid and they will start seeing our type of insurance again!!!!!!!!!!!!!  BLUE CROSS I AM BEGGING YOU TO FIX YOUR EPS SERVICES FOR THE SAKE OF THE CHILDREN/PARENTS THAT PAY TO HAVE YOU AND NOT HAVE TO PAY OUT OF POCKET!!!! We pay for your insurance can you please negotiate with the doctors to use it. \"EPS\" \"PPO\" Preferred Provider\"\nThere is nothing preferred about this service !!!!!\n\nPS >> There customer svc is unpleasant and not helpful! That goes for all the 1800#'s I have called them all! No one seems to really want to be help for they all might hate there jobs too.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "106226142196711685271", "name": "Linda Curtis", "time": 1548270650484, "rating": 1.0, "text": "Worst customer service ever. Just keep sending you to different numbers and then don’t give you choices to talk to a person. Tells you you can do stuff online and then will not let you!!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "101266091119504011984", "name": "Jessikat 83", "time": 1511190054602, "rating": 5.0, "text": "Nice, large, clean facility with security at all times.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "107263303657136254839", "name": "Joe", "time": 1582581932724, "rating": 1.0, "text": "Terrible insurance company to deal with.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "103584887615328253798", "name": "Pam Dabbs", "time": 1474038064486, "rating": 1.0, "text": "Due to continual nerve pain in lower back & down left leg I decided to go to chiropractic service. My bc/bs gave 15 visits   Due to high deductible my visits were up before they paid a penny. Your visits should start after you meet your deductible not before.  This was the policy in days gone by I'm afraid", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "111961594193557430888", "name": "Alan Swindall", "time": 1490132792793, "rating": 1.0, "text": "Premiums are outrageously high as are co-pays. They squeeze providers' compensation. Plus I have a high ethical problem with the immoral multi-million dollar bonuses paid executives with money that policy holders pay for health care. Perhaps we should look here first for the problem with health care costs.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "105595102794302438479", "name": "Eric Bigelow", "time": 1455811342183, "rating": 1.0, "text": "Paying premiums of $1200 for spouse & myself. Coverage denied due to physicians mistake in not placing referral. Now out-of-pocket additional $3000. BC trying to make up 2015 losses. BC ONLY covers what matters!", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "104987930906784392175", "name": "K Toon", "time": 1524202059093, "rating": 1.0, "text": "if I could give zero stars", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "109773895576796777348", "name": "Nunyo Bidness", "time": 1365340710886, "rating": 2.0, "text": "This company is despicable.  I have never reached a person on the phone who was friendly or willing to help or think outside the box.  Run do not walk FAR AWAY from this place!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "102019706463818644781", "name": "Van Langford", "time": 1468527002244, "rating": 5.0, "text": "Blue Cross And Blue Sheld Is A Liife Saver", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "102246885248293612928", "name": "Lance McKinley", "time": 1508864588078, "rating": 1.0, "text": "Not worth the trouble of having insurance, outrageous fee's associated with everything.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "116320843708268004870", "name": "Lalo Silva", "time": 1495120460258, "rating": 1.0, "text": "Literally the worst, I thought they were supposed to help us out not make things more difficult for us.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "106222331299238926616", "name": "Fawn Freis", "time": 1457328407401, "rating": 1.0, "text": "Had the misfortune of dealing with Dee Clark. She was both unprofessional and rude. I will never use BCBS In the future.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "114148808492918441197", "name": "john david simmons", "time": 1524021365451, "rating": 5.0, "text": "I could not be more pleased the experiences I have had Blue Cross Blue Shield of Alabama", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "117223924943465999910", "name": "Matt Cross", "time": 1538735524490, "rating": 1.0, "text": "Overpriced, poor value for services rendered, inflexible.", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "110680323250850595824", "name": "Torrey Jimerson", "time": 1518186734473, "rating": 1.0, "text": "I can't get to primary care doctor. Other places won't see me until they get a referral. Blue cross doesn't care about no body but themselves", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "112439074065538567652", "name": "Chad Harbin", "time": 1502552492045, "rating": 1.0, "text": "garbage. avoid!!", "pics": null, "resp": null, "gmap_id": "0x888c2af2119f0913:0xe8d72b4f13802907"}
{"user_id": "117518399236300237160", "name": "Gail Harrison", "time": 1411389432650, "rating": 5.0, "text": "Staff is very helpful and always go the extra mile to find me answers and help me with what I need to know. I can just stop by and the staff is always cheerful and very helpful...Also have called with questions and its never a problem... Staff is always helpful and making the experience of medicare  changes a lot easier...Glad they are there for me!", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x75b0bb3ca3acf39"}
{"user_id": "104911281542232877883", "name": "Chuck Neese", "time": 1603752437251, "rating": 1.0, "text": "When they sold me my plan, they did not cover many items I found afterwards. They were only concerned about selling the plan!!! It costs a lot more than I was told!!!", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x75b0bb3ca3acf39"}
{"user_id": "116402087850417809492", "name": "Ricky Guthrie", "time": 1518314262811, "rating": 5.0, "text": "Never had a problem best insurance ever", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x75b0bb3ca3acf39"}
{"user_id": "116920446551228316831", "name": "Shawn Barrett", "time": 1498060115408, "rating": 3.0, "text": "Questions are sometimes directly answered, but you are just as likely to be directed to their toll free number.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x75b0bb3ca3acf39"}
{"user_id": "104401226830785865479", "name": "Valerie J. Yelk", "time": 1609167859772, "rating": 5.0, "text": "They work hard at trying to find the right plan for your needs. This is my second year for my Dental and Eye Insurance plan. Very satisfied. They are also part of Dave Ramsey's ELP's.", "pics": null, "resp": null, "gmap_id": "0x888c2c7a8f13e07d:0x8bd5fa688f80fd7e"}
{"user_id": "117780508154548232203", "name": "Ben Russell", "time": 1600378627437, "rating": 5.0, "text": "I had been dreading applying for health insurance but the team here made the process to easy. Will be sure to recommend!", "pics": null, "resp": null, "gmap_id": "0x888c2c7a8f13e07d:0x8bd5fa688f80fd7e"}
{"user_id": "106249460166620741977", "name": "Kristina Lorrain", "time": 1573321618136, "rating": 1.0, "text": "This company is a joke, was signed up for a plan I did not want to be signed up for, zero follow up so I didn’t even know. Very little clarity or transparency with this company. Would steer clear at all costs.", "pics": null, "resp": null, "gmap_id": "0x888c2c7a8f13e07d:0x8bd5fa688f80fd7e"}
{"user_id": "102658363037220551206", "name": "billie Summerlin", "time": 1576799493973, "rating": 5.0, "text": "Great team of professionals. They met all of my expectations and then some.", "pics": null, "resp": null, "gmap_id": "0x888c2c7a8f13e07d:0x8bd5fa688f80fd7e"}
{"user_id": "107628427476767005529", "name": "Demetrius Kimbrough", "time": 1594662957604, "rating": 1.0, "text": "I would not recommend anybody to this company.  They will give you the run around and will not call you back about anything.", "pics": null, "resp": {"time": 1594743823990, "text": "Hi Demetrius, thank you for your honest feedback. We take these reviews seriously and would like to discuss further with you. Please email your contact information to BLReviews@bankerslife.com so we can address your concerns and answer any other questions you may have."}, "gmap_id": "0x888922409bee898d:0x9912c5babb129aa9"}
{"user_id": "101537438223938514886", "name": "Shari S", "time": 1571415605553, "rating": 1.0, "text": "I had an interview scheduled. I tried to cancel, but there wasn’t a second time available to fit my schedule. I tried to call, to tell them I was running late, but the line was busy. When I came in the recuites, Leah, was holding up the line with a personal call! I was unable to get the group interview because of her! If they treat possible employees this way, I wonder how they treat clients? Avoid the company and try someone with integrity like Fidelity.", "pics": null, "resp": null, "gmap_id": "0x888922409bee898d:0x9912c5babb129aa9"}
{"user_id": "104445009545839152632", "name": "linda lewis", "time": 1605304762331, "rating": 2.0, "text": "I CALL YOUR OFFICE AND GET NO ONE! I ONLY NEEDED YOUR FAX NUMBER! NO HELP NO CUSTOMER SERVICE FOR THIS OFFICE! NOT HAPPY POLICY OWNER!/", "pics": null, "resp": {"time": 1605621627065, "text": "Hi Linda, thank you for your review. We're sorry to hear of your experience. Please email your contact information to BLReviews@bankerslife.com and we'll have a team member reach out to you directly to assist."}, "gmap_id": "0x888922409bee898d:0x9912c5babb129aa9"}
{"user_id": "104078294945571303833", "name": "Tambatha Sias", "time": 1583960723826, "rating": 5.0, "text": "She was polite and got everything sorted out for me that was needed", "pics": null, "resp": null, "gmap_id": "0x888922409bee898d:0x9912c5babb129aa9"}
{"user_id": "110654451134519798791", "name": "Sabrina Montgomery", "time": 1528121726152, "rating": 1.0, "text": "Horrible stay away from the snake oil salesmen", "pics": null, "resp": null, "gmap_id": "0x888922409bee898d:0x9912c5babb129aa9"}
{"user_id": "103810348722060945059", "name": "Denise Marsh", "time": 1613508100170, "rating": 1.0, "text": "I am not personally still a client. After the 2011 tornadoes and us not having a claim at all, our premiums went up dramatically. So, I chose State Farm. My mom recently had a pretty severe accident with a family member. My mom's policy states that medical-wise, she was paying the premium that included $300,000 per accident, per person. My family member was in the hospital for a couple of months. ALFA refuses to pay no more than $5000 for our family member's medical bills. What is the purpose of paying premiums for well over 25 years, only for it to be absolutely misleading when it actually came to a claim being filed. I highly suggest doing research before going with ALFA. AND you have to pay $135 annual fee JUST to be a member? No thanks. My mom's car she bought to replace her totaled one was quoted at DOUBLE what the same policy State Farm quoted. So, needless to say, she's with State Farm now.", "pics": null, "resp": null, "gmap_id": "0x886238ae31b72639:0xc1cd235494377e07"}
{"user_id": "102413442602877426720", "name": "Steven Hyden", "time": 1546623279552, "rating": 5.0, "text": "I haven't had a claim yet thankfully, but they have the friendliest staff I've ever seen. They are always helpful and pleasent. Very happy with them so far!!", "pics": null, "resp": null, "gmap_id": "0x886238ae31b72639:0xc1cd235494377e07"}
{"user_id": "103495421355917146770", "name": "harry cook", "time": 1499228660221, "rating": 4.0, "text": "Hibachi styled food (without the show). I got a Big Bang bowl (hibachi chicken, rice, veggies in a bowl) and I liked the casual, mellow atmosphere of the place. I don't understand why people think it's ok to condescend to businesses who don't do \"authentic\" as if that qualifies as something lesser. I think the Japanese-fusion tag is in this case tongue in cheek for Americanized Asian food- which is authentic in itself so I have no complaints. Yay, street cafe!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOrUV3T95_ysWOL1z_cKqCPmG023wNibrc_kOAF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPIUt5lNJnqKfQpPhCZN-cA0NE0k1sYjaN53A1B=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2a53bc6a4c33:0xd67822e2fb2c951e"}
{"user_id": "116250376930609402716", "name": "Ker Talbot", "time": 1579013712369, "rating": 5.0, "text": "I had a pourover and it was a little weak, but otherwise, i have no complaints!Awesome local coffee shop in Huntsville, Alabama. Freshly roasted beans, great company, nicely decorated, great music, and great customer service. Definitely better than Starbucks too!", "pics": null, "resp": null, "gmap_id": "0x888c2a53bc6a4c33:0xd67822e2fb2c951e"}
{"user_id": "105946262325231529260", "name": "venus9 Cotton", "time": 1592319189796, "rating": 5.0, "text": "I never been can't wait to visit", "pics": null, "resp": null, "gmap_id": "0x888c2a53bc6a4c33:0xd67822e2fb2c951e"}
{"user_id": "103398542410154283293", "name": "Cathleen Griffeth", "time": 1599844557115, "rating": 5.0, "text": "Rich was super responsive!  He was able to help me on the same day i inquired into health insurance.  The process was faster than I would have imagined and, what is most important, Rich was very patient with all my questions, as well as open and honest with respect to what exactly the different options offered.", "pics": null, "resp": null, "gmap_id": "0x88fb91d787df5ba7:0xf41f94dbee246580"}
{"user_id": "104397500620573683826", "name": "whitney lipe", "time": 1580354579805, "rating": 5.0, "text": "Awesome service! Very knowledgeable about informative! Explained everything and broke it down for me to understand. Would definitely recommend him to anyone for their health care needs!", "pics": null, "resp": null, "gmap_id": "0x88fb91d787df5ba7:0xf41f94dbee246580"}
{"user_id": "107217109090194821969", "name": "ELVIN JIMENEZ", "time": 1583858397252, "rating": 5.0, "text": "Great service and I 100% recommend him! He explained everything to me with great details, and he responded all of my questions that I had! Thank you!  10/10!", "pics": null, "resp": null, "gmap_id": "0x88fb91d787df5ba7:0xf41f94dbee246580"}
{"user_id": "117923596905674914393", "name": "Emily Sommers", "time": 1580235659711, "rating": 5.0, "text": "Rich has great service skills and got me my health insurance for a decent price, hes honest with you and available to answer any questions you may have as accurately as possible. I recommend to those trying to find first time health insurance.", "pics": null, "resp": null, "gmap_id": "0x88fb91d787df5ba7:0xf41f94dbee246580"}
{"user_id": "114889539072963090821", "name": "Cory Archer", "time": 1568732734522, "rating": 5.0, "text": "Rich has been an amazing person to work with.  I personally use his insurance offerings and I couldn't be happier with the value I get as a client. A+ service all the way!!!", "pics": null, "resp": null, "gmap_id": "0x88fb91d787df5ba7:0xf41f94dbee246580"}
{"user_id": "110604825363309694373", "name": "Tommy Danos", "time": 1580230879463, "rating": 5.0, "text": "Rich, thanks for helping us with our health insurance needs. Great job!", "pics": null, "resp": null, "gmap_id": "0x88fb91d787df5ba7:0xf41f94dbee246580"}
{"user_id": "107898243580797495226", "name": "James Grusheski", "time": 1533056091529, "rating": 5.0, "text": "Rich is one of the hardest working guys I know.  He offers affordable health insurance that is hard to find today.  Plus, being able to sit down with someone who can explain all the nuances of health insurance is hard to find today.  Most of the time, if you have questions about your plan, your only option is an 800# to some call center.  Rich gives you the personalized service we should all expect.", "pics": null, "resp": null, "gmap_id": "0x88fb91d787df5ba7:0xf41f94dbee246580"}
{"user_id": "100990952348720313923", "name": "Deborah Warren", "time": 1568731126123, "rating": 5.0, "text": "I have been very pleased with Mr Kaponer’s knowledge of the products and services of US Health. As a small business owner, I did not think I could afford insurance. I not only have insurance now, but I am happy with it.", "pics": null, "resp": null, "gmap_id": "0x88fb91d787df5ba7:0xf41f94dbee246580"}
{"user_id": "110854299656033283928", "name": "Justin Marr", "time": 1595630641335, "rating": 5.0, "text": "Zac is not your typical insurance agent. He goes the extra mile to be sure you have the right amount of coverage for your situation at an affordable price. He is very professional and knowledgeable. He is always available to answer any questions and has a wonderful personality. You could not find a better agent I highly recommend him. He is fantastic! Our insurance needs were very unique, but he was able to get everything covered! Give him a call for a quote!", "pics": null, "resp": null, "gmap_id": "0x889bb2e6c0d5e40b:0xe81a0bea18adb9e9"}
{"user_id": "115230406252358551426", "name": "Laura Price", "time": 1597456858845, "rating": 5.0, "text": "My husband and I looked into adding our 16 year old son to our car insurance policy with another insurance company. We were faithful customers with this company for many years and we were absolutely shocked when our rate increased by more than $350 per month! Even after having the same policy for many years, they would not work with us to find a rate we could afford. We started shopping around, and quickly found that Zac Stokes was able to give us the lower rate we were looking for. We are so thankful for all his help! His costumer service was top notch. We are even talking with him about switching our homeowners and life insurance. You will not regret working with Zac for any insurance needs you have.", "pics": null, "resp": null, "gmap_id": "0x889bb2e6c0d5e40b:0xe81a0bea18adb9e9"}
{"user_id": "115831920679422057663", "name": "Ricky Doyal", "time": 1592619154958, "rating": 5.0, "text": "New Agent in the office, Zac, was very informative. He took time to explain my options and answered all my insurance questions and concerns. Plus showed me how I could increase my coverages without braking the bank, actually saved me some money annually.", "pics": null, "resp": null, "gmap_id": "0x889bb2e6c0d5e40b:0xe81a0bea18adb9e9"}
{"user_id": "117780145703181759343", "name": "Steve Webber", "time": 1507084152597, "rating": 1.0, "text": "No complaint about this office in general but more the company as a whole. Terrible customer service and even worse customer loyalty. They have no regard for their customers. Buyer beware. They do not stand up for you even after being a customer for 20+ years with only filing claims 3 times are n that span.", "pics": null, "resp": {"time": 1532357155177, "text": "Steve, I am very sorry that you have been so displeased with our company.  Perhaps if you gave our specific location a try we could try and earn your business.  Reach out to me at 251-661-9957"}, "gmap_id": "0x889bb2e6c0d5e40b:0xe81a0bea18adb9e9"}
{"user_id": "110977361075062353679", "name": "Noah Crossfield", "time": 1527910003220, "rating": 1.0, "text": "I spoke to Kelly Deford about insurance, and it was a bad experience. My parents have used ALFA for years, so I sought them out. It seemed as though the insurance premiums were significantly higher than other so I asked about changing the coverage amounts. (I certainly do not have over $150,000 of possessions in my house). I was given fairly ambiguous answers and felt as though I was being told simplified versions of the policies. It was not sufficient. Every time I told Kelly that I was looking at other companies, she would find another discount that was miraculously available despite the fact that the last three quotes I got were \"the lowest quote I could have gotten.\" I was not pleased, so I tried to work through a different ALFA agent. Kelly called me to let me know that she was watching her system, and that I had to work with her if I wanted to go through ALFA. Regardless of her intent, it came across as incredibly manipulative and threatening. I will never use ALFA, but if you want to I encourage you to pick very carefully who you get your initial quote from because it is apparently not an option to change if you are not content.", "pics": null, "resp": {"time": 1532356841861, "text": "Hi Noah! I am sorry to hear that you had such a bad experience. I am normally known for my exceptional personalized service and attention to detail, and regret that I did not deliver that to you.  I am available to discuss this problem further and rectify any concerns that you may have had 251-661-9957. I look forward to speaking with you and earning your business back."}, "gmap_id": "0x889bb2e6c0d5e40b:0xe81a0bea18adb9e9"}
{"user_id": "110754710922066890541", "name": "Annette Lundy", "time": 1593140897468, "rating": 5.0, "text": "Very knowledgeable!", "pics": null, "resp": null, "gmap_id": "0x889bb2e6c0d5e40b:0xe81a0bea18adb9e9"}
{"user_id": "107562939036068414398", "name": "David Jackson", "time": 1532715670280, "rating": 1.0, "text": "Customer service is terrible the guy in charge is never there and they were extremely rude if I could give them no Stars I would", "pics": null, "resp": null, "gmap_id": "0x889bb2e6c0d5e40b:0xe81a0bea18adb9e9"}
{"user_id": "112874030379735311242", "name": "Jade Skye", "time": 1557495477294, "rating": 1.0, "text": "I dont know why they feel the need to give out personal information to family members. They have never called us directly to handle anything instead calling a family member they know to do business for them? Very unprofessional.  Everytime we did try to get some info on when our bill was due or how much they could not seem to find the answer? Pointless and ignorant agents to work with. Oh and they called our family member to tell them we were cancelled!", "pics": null, "resp": null, "gmap_id": "0x8888c8c654865663:0x6975165964f09d40"}
{"user_id": "102993565637065628945", "name": "Supa CG", "time": 1489432130255, "rating": 1.0, "text": "I would give this location 0 stars if I could. Rhonda at this location was beyond rude to my mother for absolutely no reason. Myself, my mother, my little brother and my aunt and my father all have insurance with Alfa and we will all be cancelling our auto insurance and our life insurance policies this next month because of her. We have a total of eleven policies with them between all of my family members. This is our local office and I refuse to pay someone who talks down to my family. I have been with this company for 7 years, my brother has been with them 5 years and my mother has been with them for 20+ years and we have never had a single problem with them until now but the bullying that she did to my mother is just intolerable. Furthermore I intend to use all of the resources at my disposal to let everyone I know of my experience with her. I could go on and on but the point is that she has been inexcusably rude and it is because of her that Alfa will lose a total of eleven policies.", "pics": null, "resp": null, "gmap_id": "0x8888c8c654865663:0x6975165964f09d40"}
{"user_id": "115833354626560237882", "name": "Julie Fulmer", "time": 1526867190375, "rating": 5.0, "text": "Go see Rhonda!", "pics": null, "resp": null, "gmap_id": "0x8888c8c654865663:0x6975165964f09d40"}
