{"user_id": "114749075745481045817", "name": "James Hall", "time": 1605234018587, "rating": 5.0, "text": "Dr. Jain and his wonderful nurse Keysha are the very best medical team I have ever been to see.  They are very caring, supportive, and of course knowledgeable.  They inspire and motivate me to try hard and live a healthy life style.", "pics": null, "resp": {"time": 1611256304984, "text": "Hello, Mr. Hall. Thank you so much for your review and for taking the time to share your experience! We work hard at Huntsville Hospital Heart Center to exceed expectations and are happy to hear we hit the mark. We will make sure that Dr. Jain and nurse Keysha see your nice comments."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "107244352355207326625", "name": "Rosemary O Gracia", "time": 1623851764285, "rating": 1.0, "text": "Dr. Green is terrific and the scheduling is terrible I called the nurse twice and she assured me that the department will call me back she said that department was full she assured me that I have the stress test so I can have my revision knee replacement it's painful everytime I walk it's painful ice pack can only do so much as soon the stress test is done I have my surgery", "pics": null, "resp": {"time": 1623869235308, "text": "Hello, Rosemary. We are very sorry to hear that you have had trouble scheduling an appointment with Dr. Green. Please call (256) 801-6804 so our Service Excellence Coordinator can assist you."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "112792796621473737833", "name": "Brandy Thomas", "time": 1600472299227, "rating": 5.0, "text": "Absolute LOVE Dr Kanitkar!   He goes above and beyond and he found a congenital Heart defect after my first visit,  that no other cardiologist had found and I had gone to the other cardiologist for years! He has shown he genuinely cares about my overall health!", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "100214528143883045960", "name": "Vickie Simmons", "time": 1613598822733, "rating": 5.0, "text": "Very nice clean place employees great helpful caring", "pics": null, "resp": {"time": 1613659523913, "text": "Hello, Ms. Simmons. Our team strives to be helpful and caring, and we are glad to know we hit the mark during your visit. Thank you for allowing us to care for you."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "103119265035026812389", "name": "Melissa Hardenbrook", "time": 1604948711825, "rating": 1.0, "text": "I had to take m 87 year old grandmother to see Dr. Kahn today (11/9/20)@1pm. Me and my uncle are my grandmothers caretakers. Dr. Kahn’s nurse called us last week to make sure that she brought family members  with her cause she was getting some results that weren’t good. The nurse that took our temp on 1st floor was super nice. But the nurse that was by elevators on the 2nd floor was really rude and she cussed at me and my daughter. There was no sense in her behavior. So you need to check your nurses attitude toward ppl. I have already contacted higher management. I know this COVID is really really serious but that’s no reason to be so rude and disrespectful. I work on the frontline too during this pandemic. Get your ppl in check!!!", "pics": null, "resp": {"time": 1611256130881, "text": "Hello, Ms. Hardenbrook. We are so sorry to hear that one of our nurses acted unprofessionally. We expect our staff to treat patients and family members with respect at all times and will share your comments with our leadership. If you would like to talk about this further, please call the Patient Advocate at (256) 265-9449."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "106961502216609819265", "name": "Carolyn Taranto", "time": 1600453711584, "rating": 5.0, "text": "Moving to Huntsville,Alabama and needed to get a heart doctor for my husband and Susan was so kind to me on phone...\nHelping me set up an appointment and she got his information and gave me the fax number to give to his heart office so they can get his information to her ..\nThank you,", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "100378358238515040887", "name": "Sadie Lynch", "time": 1603122523578, "rating": 5.0, "text": "Had a appointment with dr Mann today from the moment I walked in to temperature check and check in upstairs everyone was so welcoming the nurse who did my ekg was wonderful the nurse who assist dr Mann she was wonderful and also save the best for last dr Mann was fantastic she explained everything so that I could understand definitely deserve 5 stars", "pics": null, "resp": {"time": 1611249867771, "text": "Hi, Ms. Lynch. Thank you very much for such a great review! We work hard to make sure that we are offering the best patient experience. So happy to hear that our commitment was clear with you! We'll make sure Dr. Mann sees your wonderful comments."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "103447123858050165479", "name": "Barbara Watson", "time": 1597678075577, "rating": 5.0, "text": "I had Hiatal Hernia surgery. My doctor was Dr. Speicher. He's the best. I would highly recommend him to anyone.", "pics": null, "resp": {"time": 1597854969747, "text": "That's great to hear, Ms. Watson! We appreciate the great review and will make sure Dr. Speicher knows how pleased you are with your surgery outcome."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "113287989392336901469", "name": "Rick Barger", "time": 1614011663250, "rating": 1.0, "text": "1 week to get a refill on Coumadin this is unacceptable", "pics": null, "resp": {"time": 1614117490375, "text": "Hello, Mr. Barger. We apologize for the delay and want to make sure you have the medications you need. Please call our administrative office at your earliest convenience, (256) 801-6804."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "114144310138776799172", "name": "Alan Montgomery", "time": 1565727959441, "rating": 5.0, "text": "Caring and attentive, very well run and maintained facility.  Excel medical staff.  Very happy with the.  They LISTENED to my concerns, addressed them in a manner I could understand.  Overall a great experience", "pics": null, "resp": {"time": 1565980336858, "text": "We're glad to hear that you had a five-star experience, Mr. Montgomery. Thank you for taking the time to leave a review. We'll make sure our staff sees your comments."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "118251920215843217847", "name": "Amy Smith", "time": 1556289298787, "rating": 5.0, "text": "Registration and check in were fast and timely.  I didn't have to wait very long at all for my appointment.  The tech who did my EKG was efficient, kind,  and competent.   Dr. Mann was thoughtful - she took the time to listen to my questions and answered them all.  Her nurse made sure that I understood follow up instructions and was clear that I could call if I needed more information.", "pics": null, "resp": {"time": 1556546191197, "text": "Thank you for taking the time to let others know about your visit, Ms. Smith. We're so pleased to hear that you had a five-star experience -- that's our goal for every patient. We'll make sure Dr. Mann and the rest of the team see your very sweet comments."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "107908817226408029282", "name": "Janette Perry", "time": 1549297798572, "rating": 3.0, "text": "The doctor we see is wonderful. But this is the poorest run Dr. Office we go to. My aged Mother has had cancer and has heart problems so we see several Doctors. This office will tell us that they will contact us when it is closer to time for the next visit. This visit is due in Feb. and it is now Feb. I have called for an apt. I have not heard back. She is now running out of her medication and again I have called for it but have not gotten a call back. In the past I have had to call several times with no return calls. I would just expect that a office connected to Huntsville Hospital would be better run. The last time after several calls I finally went in and parked myself in their office until I could get confirmation that her medication would be called in. It took over an hour of waiting.  Another thing I have had problems with in the past was getting in when my Mother felt her heart was again out of rhythm. I know they are busy but you hate to go to the hospital to find out if she is in trouble. This Heart center has people that run a heart Cardiogram every time we go in so why can't they have a room set up for people that just need to make sure they are ok if they feel they are having problem? Most people would rather have a Doctor visit bill as apposed to a hospital bill just to get a Cardiogram run. There are a lot of people out there that can't afford the hospital bill, but with insurance could get to the Doctor.\nAgain we love the Doctor we see but feel the heart center needs better management.", "pics": null, "resp": {"time": 1549475511718, "text": "Thank you for taking the time to bring this to our attention, Ms. Perry. We're very sorry that you have had trouble getting your mother's appointments scheduled. We have shared your comments with our practice administrator, and she is more than happy to discuss this with you. Please call (256) 801-6804 at your convenience."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "114418940694340652947", "name": "jacqueline so sad to hear this patterson", "time": 1594315484580, "rating": 5.0, "text": "Dr Thomas Wright has been an amazing  Dr for us", "pics": null, "resp": {"time": 1594659299446, "text": "Thank you for the 5-star review! We appreciate your continued trust in Dr. Wright and the rest of our Heart Center team."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "111183495630817208317", "name": "Addie Sanderson", "time": 1601652339749, "rating": 5.0, "text": "Dr. Mann is one of the best of the best.", "pics": null, "resp": {"time": 1611248610094, "text": "Hi, Ms. Sanderson. Thank you so much for the positive rating and for taking the time to post. We truly appreciate our patients and work hard to earn positive feedback from great folks like you!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "107600049092636768387", "name": "Ray Claborn", "time": 1504114499760, "rating": 5.0, "text": "I was with my wife yesterday while she visited Dr. Mann. I was highly impressed and amazed at the efficiency from the time we walked in the door. From sign-in to heading toward the examining rooms took about 3 minutes, the nurses doing the test while another was taking more information, followed immediately by Dr. Mann coming in. She quickly and completely\ninformed my wife of test results, sat on a stool and within minutes  sat a date and time for an out-patient procedure, followed by check-out. Just fantastic.", "pics": null, "resp": {"time": 1504215838483, "text": "Thank you for contacting us, Mr. Claborn. It’s our pleasure to care for your wife. We will be sure to pass along your kind words to Heart Center leadership."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "109985196974167968210", "name": "Sherry Lathan", "time": 1578152324763, "rating": 5.0, "text": "I had 2 stints placed yesterday by Dr. Ridner at the cath lab. From the moment I was taken thru that door I was made to feel cared about.  Every nurse and patient care tech that came in contact with us made sure I understood and was ok with everything they did. No one was rushing thru their jobs and everyone was helping each other learn their way of doing things. I have had multiple surgeries at different places such as MMCS, MMCN, UAB and Huntsville Hospital but the care not only me but also my husband received yesterday went way above any other place we have ever been. I would recomend the Heart Center cath lab staff and Dr. Ridner to anyone! Thank y'all for making my procedure not so scary and for taking care of me!", "pics": null, "resp": {"time": 1578324772910, "text": "Wow, what a fantastic testimonial! Thank you, Ms. Lathan, for taking the time to let others know about your experience with Dr. Ridner and the rest of our Cath Lab team. We're so pleased to know that your visit met and perhaps even exceeded your expectations. That is our goal for every patient."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "115131734841478230625", "name": "khris anderson", "time": 1514913002679, "rating": 1.0, "text": "My son was asked to wear the heart- monitor.  It broke within the first couple of days and  he returned it,  Although he had never worn it - he received a letter saying that his test was complete and showed not issues.  The doctor he had seen a few years earlier hadn't bothered to read his chart before our visit.  If you go to any doctor in Huntsville Hospital's system you take your very life in your hands.  They are NOT patient-centered, but are focused ONLY on the bottom line.", "pics": null, "resp": {"time": 1515004757722, "text": "Hello, Mr. Anderson. We strive to provide quality care and service to every patient, and when we fall short we want to hear about it. To ensure proper follow up, please ask your son to follow up with our Customer Service Representative at (256) 801-6682."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "101727864550161963403", "name": "Lana Dempsey", "time": 1488812602021, "rating": 5.0, "text": "The Heart Center was a life saving experience for our dad. He received treatment for over 5 years from St. Thomas hospital in Nashville & we never saw positive results. Numerous times we asked why a certain treatment wasn't used and were given bogus answers. Dad's first visit to the Heart Center & being under the care of Dr. Cash was truly a blessing. Dr. Cash immediately identified dad's need to have a pacemaker. Surgery was scheduled, completed, and sucessful. Sadly, several years after receiving his pacemaker dad was diagnosed with Stage IV metastasized lung cancer. Dad had issues of panic/anxiety attacks which were originally thought to have been heart related. After visits and test with Dr. Cash, he diagnosed him with anxiety attacks, just from the shear stress of being a cancer patient. Dr. Cash went above and beyond to care and treat our dad. He prayed with our family and was genuinely concerned for dad as well as our family. We are very grateful to Dr. Cash and his office.\nWe HIGHLY recommend The Heart Center.", "pics": null, "resp": {"time": 1488821750280, "text": "Hello Mrs. Dempsey. We really appreciate your heartfelt review and will be sure to share it with Dr. Cash."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "116520667598806409384", "name": "Steven Holliday", "time": 1449723838811, "rating": 5.0, "text": "I have been a patient of Heart Center Inc for over a year now and every experience I have had has been excellent. My first time there I was having problems and the doctor got me in right away and ended up admitting me to the hospital to run test so that he could find out what was causing my symptoms. I have never had to wait very long to get an appointment scheduled, nor have I had to wait very long in the lobby or exam room. This is one of the most efficient and smooth running office I have been in. Every staff I have come in contact with, whether it was the front desk, scheduling, techs, nurses, or doctors, they have been extremely friendly and courteous. I would highly recommend anyone that needs to see a cardiologist to use this office, you won’t be disappointed", "pics": null, "resp": {"time": 1449763590498, "text": "Thank you for sharing your experience. We appreciate the feedback."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "117383354075285854391", "name": "Mary Holliday", "time": 1449695102456, "rating": 5.0, "text": "My Grandfather was a patient of Heart Center Inc before he passed away. He had been treated by another cardiologist office prior to changing to Heart Center Inc. His experience with HCI was a much better, more enjoyable experience than what he had experienced at the other office. All the staff are very courteous and professional. It is a well organized and managed office. I would highly recommend all my friends and family to use Heart Center Inc.", "pics": null, "resp": {"time": 1449698570151, "text": "Thank you for taking the time to review the Heart Center. We appreciate your feedback."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "102194964391544037331", "name": "Tricia Eakes", "time": 1449723274946, "rating": 5.0, "text": "Much appreciation and gratitude to the Physicians, Nurses and staff. There is always a helping hand no matter where you are in this facility. Everyone is very helpful and understanding from registration to point of care. It's really nice to know we have such a great facility in our home town!", "pics": null, "resp": {"time": 1449763545864, "text": "Thank you for the kind words."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "112712146897383160237", "name": "Sadie Mae", "time": 1557273225813, "rating": 5.0, "text": "I come here to the coumadin clinic on the top floor. This is the NICEST group of people I've ever encountered in the medical field. From the ladies to the desks to the nurses to the NPs. They're so helpful and concerned about my health. I don't feel rushed at all. They really helped me ease through my transition onto coumadin and calmed my fears a lot.", "pics": null, "resp": {"time": 1557419938283, "text": "Hi, Sadie! Thank you for taking the time to share your impressions of our clinic. We're glad to hear that our staff is giving you such great care -- and doing it in a way that's helped ease your fears. We will make sure the entire Coumadin Clinic team sees your sweet message."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "118064058086264183761", "name": "Regina Mcgee", "time": 1449694679952, "rating": 5.0, "text": "I have been a or at the heart center for over a decade.  I Have always had phenomenal care!   Both my parents are patients as well.  We are VERY fortunate to have this level of care right here at home.", "pics": null, "resp": {"time": 1449698523271, "text": "Hi Regina,\n\nThank you for your feedback."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "115771906824899048318", "name": "Edna Neisler", "time": 1478287281458, "rating": 5.0, "text": "I have been a patient of the heart center since 2002. I have a wonderful doctor,his name is Philip Laney. He is a doctor that I can trust. He has saved my life more than once. Every person in the practice is so good to me and my husband. I also am a patient of Dr Jennings. He put a CRT-D device in my chest. A difulater/pacemaker device. He is a great surgeon who took time with myself and my husband. I highly recommend the Heart Center to any one who has heart problems.", "pics": null, "resp": {"time": 1478295192797, "text": "Thank you for your feedback. It's a privilege to care for you and your family. Your kind comments will be shared with the appropriate staff and Heart Center leadership."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "112088480529644877118", "name": "Union Grove Veterans Thrift Store", "time": 1570812435524, "rating": 5.0, "text": "They real have great doctors.", "pics": null, "resp": {"time": 1571068629025, "text": "Thank you for the five-star review!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "110027092306180186089", "name": "Marc Lewis", "time": 1515343167812, "rating": 5.0, "text": "This is one of the best cardiology teams in the southern United States. Up-to-date facility.", "pics": null, "resp": {"time": 1515685651435, "text": "We appreciate the rating and your nice comments Mr. Lewis!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "100949081674993101622", "name": "Nicole Weston", "time": 1466110310081, "rating": 5.0, "text": "Hi my name is sherry Baez I have been a pt. At the heart center since 2006.that is ten years.I have always need treated great.when ever I have a question they are always happy to answer or find the answer for me.I love my Dr.there. he is always making jokes. I love my pace maker Dr too and now the vein drs.I thank gods everyday for the special hands he gave the drs at the heart center...", "pics": null, "resp": {"time": 1466456292146, "text": "Thank you for your kind words Sherry. We appreciate you taking time to review our practice and provide feedback."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "115338680088504229959", "name": "Barbara Peeler", "time": 1521484135892, "rating": 5.0, "text": "The heart center is a very nice place they make you feel so comfortable I love Dr McGraw and his staff", "pics": null, "resp": {"time": 1522156333036, "text": "Thank you for your kind words, Ms. Peeler. We appreciate you taking the time to leave a review for us!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "116763624525163633749", "name": "Matthew Goodwin", "time": 1549296104733, "rating": 4.0, "text": "Dr.Valtose is a very good down to earth Cardiologist that I Trust", "pics": null, "resp": {"time": 1549310872380, "text": "Thank you for taking the time to leave a review, Mr. Goodwin. Dr. Valtos has certainly been a great addition to our practice and to the community. We will make sure he sees your very nice comments."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "110201958691129601342", "name": "paw waw", "time": 1517972144776, "rating": 1.0, "text": "My mom just left this place in tears. She was told by her primary that she needed to have a stress test and echogram done. This is why he was sending her here. Dr. valtos didn't do any of this. Instead he took the results of some tests she had 3 months ago and, decided she needed to be on 3 different medications. She's done everything she could these last 3 months to avoid taking medications and, she was hoping these test results would reflect that. However THERE WERE NO TESTS done by Dr Valtos! This blows my mind. We just wasted money for him to tell her what she already knew? Not to mention the way he treated her was ridiculous. He didn't believe anything she told him. It seems to me that he was just to quick to judge and wanted nothing more than to push pills down her throat. Literally. I'm very disgusted with the way she was treated and, I will definitely make sure everyone I know knows how she was treated.", "pics": null, "resp": {"time": 1518473570010, "text": "Hello, Ms. Malenfant. We are sorry to hear that your mom's visit left you both upset. To help us further address your concerns, please reach out to our Customer Service Representative at (256) 801-6682."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "105469224814122336222", "name": "Charles Wildman", "time": 1450693790414, "rating": 5.0, "text": "Dr. Ridner has been my Cardiologist for more than 10 years. The more compliant I am with his advise the better my health is. Dr. Soliman installed my stint in 2005 and it has done very well for me. I couldn't ask for a better group of people to look after me from the schedulers to the nursing staff and of course the Physicians.", "pics": null, "resp": {"time": 1450711142189, "text": "Thank you for your feedback Charles!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "106201192621476795619", "name": "cheryl strickland", "time": 1435168154264, "rating": 2.0, "text": "Huntsville Hospital is a FOR PROFIT, PRIVATELY OWNED hospital who has to answer to stock holders. Therefore their profit margin is much more important than patient care and treatment.  Some of their policies reflect that also. For instance, if you go to the ER needing surgery, if there is not a DR. to do that surgery on duty, you will have to wait until one is scheduled if it \"probably\" won't kill you to wait.  My husband waited 3 days for an orthopedic surgeon for a spiral break in his femur, which is a very dangerous bone to break. It's where our blood supply is made and when broken, releases air bubbles and clots into the blood stream so he was kept on blood thinners for 3 days before major surgery.  Now, not only did the hospital get to charge us for those 3 extra days and all his normal medications, because you are NOT allowed to take your own from home, but they did NOT have to pay a surgeon overtime or vacation pay to come in when off duty, so we are cash cows to that hospital.  The nurses are horribly underpaid and badly treated, but with Huntsville Hosp. owning all hospitals for 8 counties, they really don't have a lot of choices. Most of the nurses were wonderful, however the Dr.'s, especially Dr. Wright, made us feel like our health was secondary to profit, pushing hard for procedures we are very hesitant about and offering no real evidence they would even help. In fact he told us straight out that it probably would not help, but it just might.  Just be aware the Dr.'s are Huntsville Hospitals life blood money and do your research, ask lots of questions, ask about safety and recalls for any hardware they want to implant. In our case the Defibrillator manufacturer was being sued in a class action suit because the leads were corroding and impaling the arteries, but they were still using these defibs and when we asked about them Dr. Wright's answer was, and I quote \"they all have problems\". Now that's not exactly comforting.  We told him we wanted to do some research and think about it, but that did not stop his office from calling us EVERYDAY for 3 weeks until I asked them not to call us ever again, we would call them if we changed our minds. Then we were told it was their job to \"recruit 12 to 18 surgeries PER DAY\".  Yes after 35 years of marriage, it is an \"us\" decision.  We both feel very uncomfortable with it all. We are going for a second opinion at Vanderbilt. I'll update and post what they tell us.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "107721292155397117795", "name": "Sky Queen Ce", "time": 1517958574402, "rating": 1.0, "text": "Jeanna in Scheduling needs a different departments other answering the phones. I called for help several times and she just sends me on a run around. To the last time I told her that I really needed help about getting my appointment schedule. She sends me to a dead end then I can't call back cuz it's after 5. Of course all this is because she just want to go home. Started this process today at 2 p.m. I call back at 4:30 only to get basically get the run around for 30 mins and hung up on.  Please pull the tapes. February 6th 2018. Not happy.", "pics": null, "resp": {"time": 1518473526085, "text": "We'd like to offer our apologizes that you didn't get the help you were seeking. If you need further assistance or would like to speak with someone about your experience our Customer Service Representative is available at (256) 801-6682 or customerservice@theheartcenter.md."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "107274309179293285132", "name": "Jim Gordon", "time": 1450020134482, "rating": 5.0, "text": "The Heart Center (THC) is responsible for some of the highest-quality medical care I've ever had.  From the scheduling, to the support staff, to the physicians, their care and professionalism have been uniformly excellent.  A few years ago, after experiencing \"the bends\" on a scuba trip to the Caribbean, I was tested at THC the day after returning to Huntsville.  After an ultrasound test, I was diagnosed with a \"patent foramen ovale\", or a hole in my heart.  Within a few days, surgery was scheduled, the hole was repaired, and I was home, feeling great.  I've had several other tests at THC, including a very successful cardiac catheterization.  I would heartily recommend THC to anyone who has, or suspects any cardiac issues.", "pics": null, "resp": {"time": 1450105223384, "text": "Hi Jim,\nThank you so much for sharing your experience. We appreciate your kind words."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "111386931083582009127", "name": "Juzt Kandi", "time": 1471537172541, "rating": 1.0, "text": "I called to schedule an appointment however once i got someone on the line she was clueless so she transferred to someone else ( FINE UNDERSTANDABLE ) Once i was transferred the lady answered my questions but she had an attitude then transferred me back to scheduling to make the appointment...As im in mid statement i just hear music playing the lady obviously didnt care i was talking so she transferred me to someone else...Needless to say i told the person how i had just been treated and i would be taking my money else where. Just plain RUDE !! Hope thats not an indication on their usual  behavior !! Would never ever ever go to this place !!", "pics": null, "resp": {"time": 1471546719177, "text": "We sincerely apologize that you were unhappy with your experience. Thank you for contacting us. The information you shared above will be passed along to our Customer Service Representative and management team. If you prefer to contact Heart Center Customer Service yourself, you may call (256) 508-5711 or email customerservice@theheartcenter.md."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "117360967572212065566", "name": "Lindsey Frost", "time": 1403034880182, "rating": 1.0, "text": "I was told that I would have to wait 2 and a half weeks for an appointment for a pulse that was above 120 for 2 days straight and horrible chest pains. I had called at noon and was told I just needed to wait and got called back at 4:56 and was told there was nothing they could do cause they were about to close. They said they would call me the next day, 5 days later still have not heard anything. I found another cardiologist at another facility that worked me in immediately given my symptoms and age. I got my meds changed and got a heart monitor. I was more than disappointed in the staff at The Heart Center, and will tell everyone I know. I was only given attitude when I stressed how important this was, like they could care less if I had a heart attack or not. And when I said I may just have to go back to the hospital they said \"well then you just do that then\", which needless to say did not help my pulse rate problem at all.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "111317365255479011101", "name": "Ashley Drewes", "time": 1449602655499, "rating": 1.0, "text": "STAY AWAY! The heart center is full of racist employees. I witnessed the white workers in this place mistreat their non-white employees using racial slurs and making verbally abusive comments to the employees. I should note I am considered \"white\" myself and found this very tacky and unprofessional behavior. I especially noticed one person, by the name of Tiffany,  making condescending remarks to one employee in particular who was not of the white race. Very disappointed in what I witnessed and would advise all to not do business here. I got up and left and never returned after that.", "pics": null, "resp": {"time": 1449604799769, "text": "Thank you for bringing this to our attention. The Heart Center's Customer Service Representative has requested that you call at your earliest convenience to ensure proper follow up: (256) 508-5711. For reference you may also email customerservice@theheartcenter.md."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "118006053628201249416", "name": "Kathy Sanders", "time": 1393964969787, "rating": 2.0, "text": "My Mother is a patience at the heart center and to date it has been a very unpleasant experience.  I am sure that the doctors there are great at their job.  I think Mother has had ok care.\nAfter several calls and no return calls back, we have managed to get the job done.  My Mother was in the hospital in January and ended up on a ventilator, the day she was released from the hospital the heart center was to come down and review her medication.  Never showed, but we had an appointment with her Doctor in a week so thought all would be good, but that appointment was changed, and then changed again.  Yesterday she went into see the dr and he had no idea what meds she was taking and what milligrams, are you kidding me, your nurse practitioner never showed up to review medications.  She is on coreg which needs to be taken two times a day, but the orders said one.  They changed her meds to hydralazine along with the coreg, the hydralazine is to be taken three times a day, but again the orders said once a day. Yesterday they took her blood pressure in the office and said it was 120/70, and my sister said that is strange. It has been running high, and she snapped back well not today.  Then the dr took it and it was 200/94, really.  On the way home from work last night my sister stopped to pick up meds and only one was there, a water pill, not the increased dosage of coreg or hydralazine.  Either this office is very incompetent or they have way to many patience.  Our Mother is very precious to us, and she has been through hell and back.  She deserves better treatment than this .", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "104257493432478120295", "name": "Tracy Schloss", "time": 1449682955264, "rating": 5.0, "text": "All of my experiences have been outstanding.", "pics": null, "resp": {"time": 1449698420198, "text": "Thank you for reviewing the Heart Center!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "104038490408778865800", "name": "Charli Hillis", "time": 1449682420577, "rating": 5.0, "text": "Dr. Allison always takes time and listens to me. Will definately be back!", "pics": null, "resp": {"time": 1449698389309, "text": "Thank you for the rating!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "114005382676703010048", "name": "James Gray", "time": 1511658343735, "rating": 5.0, "text": "A place where the staff actually CARE about the patients more than the almighty dollar!", "pics": null, "resp": {"time": 1511798128134, "text": "Hello, Mr. Gray. Thank you for the compliment and the great rating! We appreciate the opportunity to care for those in our community."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "111972857104421072908", "name": "C Witty", "time": 1507040038273, "rating": 5.0, "text": "Great doctor! Great staff!  Best I've ever been too in Alabama!!!!!!!!!!!!", "pics": null, "resp": {"time": 1507125331451, "text": "Thank you for choosing the Heart Center to care for you. We appreciate your kind words!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "107321204915505753498", "name": "David Milhollin", "time": 1428418473568, "rating": 4.0, "text": "These guys found a problem in my stress test - got me through some additional tests and then over to the hospital for a heart stint -- thank you", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
