{"user_id": "111192995897987862802", "name": "Ace Wolf", "time": 1569764158033, "rating": 5.0, "text": "We had a a splendid 1st visit. I purchased some oil for my mother. The staff was very informative and helpful.", "pics": null, "resp": null, "gmap_id": "0x88927c2e385ebee7:0x871df3c62d3d2bdf"}
{"user_id": "102370179105147355822", "name": "Allison R. Widener", "time": 1550200360124, "rating": 5.0, "text": "I called to ask about CBD oil for my pup who has cancer. The owner called me back quickly and gave detailed instructions on the products she has and advise on how to use them.\nI can tell she takes pride in what she has in the store, and carries top quality product.\nHer husband was in the shop when I arrived and was very kind and sympathetic to my situation.\n\nI don't know how much time I have with my furbaby, but if she is still with me in a couple months when the oil runs out, I will definitely return here for more.\n\nThank you Herbal Toad for all your kindness, and for taking time to explain everything to me.", "pics": null, "resp": null, "gmap_id": "0x88927c2e385ebee7:0x871df3c62d3d2bdf"}
{"user_id": "109054689234414425192", "name": "Cathy Green", "time": 1535829170065, "rating": 5.0, "text": "Great customer service!  They helped me track down a stylist from salon who had cut my hair while I was in town for a funeral several years ago.  They walked a couple stores down to their new neighbor, Salon 126, to get me the name and number.  You really went above and beyond!", "pics": null, "resp": null, "gmap_id": "0x88927c2e385ebee7:0x871df3c62d3d2bdf"}
{"user_id": "100154477607449101529", "name": "Stephanie Moore", "time": 1565383364307, "rating": 4.0, "text": "It's a awesome place. And you can tell they know what they are talking about.", "pics": null, "resp": null, "gmap_id": "0x88927c2e385ebee7:0x871df3c62d3d2bdf"}
{"user_id": "106388703325706809540", "name": "Samuel Coleridge", "time": 1577121321122, "rating": 5.0, "text": "Great assortment of herbs and soaps! Great class!", "pics": null, "resp": null, "gmap_id": "0x88927c2e385ebee7:0x871df3c62d3d2bdf"}
{"user_id": "105529480271340399864", "name": "Emily Pritchett", "time": 1499980564083, "rating": 5.0, "text": "What a great shop for our town! Stephenie is an educated aromatherapist and is more than willing to provide individualized advice for whatever issue you have. This is a wonderful asset to Ozark.", "pics": null, "resp": {"time": 1500041284997, "text": "Thank you. We appreciate your business and you taking time to leave a review."}, "gmap_id": "0x88927c2e385ebee7:0x871df3c62d3d2bdf"}
{"user_id": "107689232717177830817", "name": "Shirley Beasley", "time": 1535846827385, "rating": 5.0, "text": "The staff was very knowledgeable and they had exactly what I was looking for", "pics": null, "resp": null, "gmap_id": "0x88927c2e385ebee7:0x871df3c62d3d2bdf"}
{"user_id": "110901133964325111967", "name": "Justin Dugans", "time": 1502042942014, "rating": 5.0, "text": "Great place to shop and receive knowledge on essential oils, Stephanie is very helpful and honest along with the prices being great for the items.", "pics": null, "resp": null, "gmap_id": "0x88927c2e385ebee7:0x871df3c62d3d2bdf"}
{"user_id": "114274628175538390915", "name": "Chris Hall", "time": 1549229654841, "rating": 5.0, "text": "Love the soaps", "pics": null, "resp": null, "gmap_id": "0x88927c2e385ebee7:0x871df3c62d3d2bdf"}
{"user_id": "106139554248991936651", "name": "Karla Wright", "time": 1595351564687, "rating": 5.0, "text": "I’ve had a lot of trainers in my past. But Adam has honestly been the best. He caters your meals to suit you. I’ve lost more weight and gained more muscle using his suggestions as I have with any plan, including a physician monitored diet plan. The workouts aren’t easy, but they’re effective. Workouts never get easier, you just get stronger.", "pics": null, "resp": null, "gmap_id": "0x8889194ea6df3575:0xabbf58ad002bfee2"}
{"user_id": "105287993655874360494", "name": "valerie jones", "time": 1595976134756, "rating": 5.0, "text": "Adam is very knowledgeable and passionate about his craft. He has dedicated much time into research, training and education to become a holistic nutritiinal guru who happens to train also. His self made supplements are great and actually help you achieve your goals. He's almost made me give up breads however I won't give him that satisfaction because he'll think he all that😁😁 You will enjoy the short workouts and the comraderie with the others. 530 am is awesome.", "pics": null, "resp": null, "gmap_id": "0x8889194ea6df3575:0xabbf58ad002bfee2"}
{"user_id": "118168684134946676314", "name": "Victoria Williams", "time": 1595200672546, "rating": 5.0, "text": "Adam at Burton Training is amazing. He created a meal and exercise plan that help me get my thyroid under control as well as increase energy. I have multiple chronic conditions and no one has been able to get them under control until I met Adam. Very thankful for his services.", "pics": null, "resp": null, "gmap_id": "0x8889194ea6df3575:0xabbf58ad002bfee2"}
{"user_id": "110025046459727115963", "name": "Healing Waters", "time": 1595602489179, "rating": 5.0, "text": "Burton Training is a place where you will get sound nutritional advice/coaching along with a workout plan tailored to help you achieve your wellness goals.  :)", "pics": null, "resp": null, "gmap_id": "0x8889194ea6df3575:0xabbf58ad002bfee2"}
{"user_id": "104471590948630174289", "name": "Chancee Fancee Christian", "time": 1567393641430, "rating": 5.0, "text": "I love the head trainer because not only is he trustworthy and honest! He is also knowledgeable, professional and knows his stuff!! I’ve used the fat burner and the detox tea ! The tea is like no other and I felt amazing while drinking it... forever customer!", "pics": null, "resp": null, "gmap_id": "0x8889194ea6df3575:0xabbf58ad002bfee2"}
{"user_id": "108280479879398791051", "name": "Lauren Fant", "time": 1577401385675, "rating": 5.0, "text": "I participated in the online training program. The program was so easy to use and I loved the length of each workout. The videos helped a lot when I was unsure of how to do a certain move.", "pics": null, "resp": null, "gmap_id": "0x8889194ea6df3575:0xabbf58ad002bfee2"}
{"user_id": "117220048528416134494", "name": "LB Bunting", "time": 1506866262975, "rating": 5.0, "text": "The team at Burton Training are very knowledgeable and really work with you personally to set you on your path to success. Whether it's better eating habits, getting rid of unwanted inches or what helped me; gain strength in my body. With Adams in studio workouts - emails - home training videos--- it's worth every penny. Speaking of pennies, you're not going to be spending the overwhelming prices of a regular trainer. These guys are amazing!!!\n\nGive them a try!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889194ea6df3575:0xabbf58ad002bfee2"}
{"user_id": "110363873701129005119", "name": "Kineshia Bolden", "time": 1544750671062, "rating": 5.0, "text": "Intense! yet, satisfying! Adam is very professional and knowledgeable. He not only wanted to help me reach my weight loss goals but change my mindset as well, to begin my journey of a new happy, healthier way of living.", "pics": null, "resp": null, "gmap_id": "0x8889194ea6df3575:0xabbf58ad002bfee2"}
{"user_id": "105202938278263634032", "name": "Davida Holiday", "time": 1626370881217, "rating": 5.0, "text": "Great products, great price!", "pics": null, "resp": {"time": 1627760721793, "text": "Thank you! See you again soon."}, "gmap_id": "0x88626518d255be9f:0x4a57e1db8c2fd57d"}
{"user_id": "109677625110350513984", "name": "Matthew Conner", "time": 1627759380776, "rating": 5.0, "text": "Just left store great experience. Knowable staff no pressure sales. Go by in check it out you’ll be glad you did!", "pics": null, "resp": null, "gmap_id": "0x88626518d255be9f:0x4a57e1db8c2fd57d"}
{"user_id": "117870050165038607081", "name": "Alisha Miles", "time": 1618604985135, "rating": 5.0, "text": "Delicious doesn't begin to describe the food. We ordered lunch and dinner to-go as we were passing through the town. The Kale wrap and Jack fruit BBQ sandwich are our top picks. Not only does this place offer amazing food, they are in this specific location to give back to their home community by offering healthy food. A great mission accompanied by delicious food and awesome service. I will be back soon even if I have to drive out of the way.... I may even plan a trip just to eat here again!", "pics": null, "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "113235901185324224809", "name": "Duzle", "time": 1621627894437, "rating": 5.0, "text": "The café itself is quaint and chill, and the lady who runs it is charming and lively! Street parking. The location is within their home community, to which they wish to give back by providing a healthy alternative such as this. I had the \"millionaire 'burger'\" along with sweet potato fries - quite tasty! It was piled high with veggies, avocado, and other add-ons. The burger look and texture was great. As usual with meat substitutes, you must treat it as a new kind of \"meat\" rather than compare it to actual beef. If you do this and let it stand on its own, this burger (along with other substitutes) tastes great. Next time I'm here, I want to try the jackfruit \"pulled pork\" and possibly a smoothie. This was my first vegan restaurant experience and it was quite lovely! Highly recommended for those hesitant on exploring this new type of cuisine.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNVaNHp7Dt0nDMEvvBlQtwu6aOBk9NkhEpBxNyC=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "104391304561185456431", "name": "Raisa Long", "time": 1613413296995, "rating": 5.0, "text": "I've been here twice and each time was a pleasant experience. If you are in a rush, call in your order. The Happy Feelings Tropical Good Smoothie is the best. I've also tried the pulled pork sandwich which was surprisingly good if you're not vegan. Check them out for good healthy food.", "pics": null, "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "117864557072002083785", "name": "Ellis", "time": 1620354174288, "rating": 5.0, "text": "Very nice and welcoming people! Ordered previously through Grubhub and decided to go in store this time to order. Went to order cookies and left out with cookies and some cupcakes. I HIGHLY recommend!", "pics": null, "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "115602497104316520811", "name": "Xena Saunders", "time": 1612902637685, "rating": 5.0, "text": "It’s hard finding vegan food that’s well seasoned and flavorful, but by God this food was amazing. Seasoned perfectly- THE FLAVOR WAS IMMACULATE!! Not only was the food delicious, but the owner was such a sweet heart when we went to grab our food. We will definitely be back!!! Thank you so much!!!", "pics": null, "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "114375920168652890928", "name": "Isabel Chen", "time": 1599762777389, "rating": 5.0, "text": "My husband and I aren't vegan, but when we feel like our bodies need a \"reset\" we seek out vegan, vegetarian, or raw food. This place is a wonderful. Food was fresh and flavorful. We will be back for more.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP6DmpKjIgWLF0jwiQH99IZ-X3vJOojMYSwYA0o=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMiXFtIlbprBxiUk-3RmEacQ0rNniFAS6Cvwibh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOaLFvZsOO8ZjZyJvrp2wHKDNt5IqTeUd40eXJ1=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "102738810115330698707", "name": "Eddie Marroquin", "time": 1615053323632, "rating": 5.0, "text": "Friendly atmosphere. Zen burger was epic! Never had anything like it. Jackfruit burrito was tasty. Kids chicken strips were delicious. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "109158231406051553657", "name": "Yakwanza Bantu", "time": 1615657759869, "rating": 5.0, "text": "Ate there one time...and kept going back, just being there makes you want to eat healthy....the environment is soothing, relaxing ,while you wait there's  great music playing  and the services is top shelf...wow.\nKeep up the great work.", "pics": null, "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "111218518514507151149", "name": "Sophia S", "time": 1603231171459, "rating": 5.0, "text": "An amazing meal that will leave you smiling inside and out. We loved the fully loaded garden brat and whose health wouldn’t feel enriched while eating the millionaire’s burger! Great find and a very thoughtful and kind owner!", "pics": null, "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "116325624032971538921", "name": "Theresa B Thomas", "time": 1617487997020, "rating": 5.0, "text": "Great Service and Uniquely Delicious Meals and Healthy Drinks⭐💕", "pics": null, "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "115461946737772481917", "name": "Carla Fergusson", "time": 1593055971445, "rating": 5.0, "text": "Delicious food! I got the jackfruit sandwich and sweet potato fries. And chocolate chip cookies. The sauce that came with the fries was amazing! Good variety of menu options, really nice owner. Delicious cookies, I wish I’d bought more :) Thanks for a delicious meal!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO9YPuT7_H3KJW6mouDZDkU2K0_xYA3KPIKpBNI=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "104990046106228199661", "name": "Hot Damn", "time": 1610236412937, "rating": 5.0, "text": "This was my first time trying them and everything was great! Love the BLT!", "pics": null, "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "102566749575094660377", "name": "Julia H (Jules)", "time": 1601127099320, "rating": 5.0, "text": "Love this place! Really good food! I got the jackfruit bbq sandwich! It was amazing and my friend got the millionaire burger and loved it! We’re going back ASAP!", "pics": null, "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "113133897304480976453", "name": "Alexandra Shepherd", "time": 1603474571331, "rating": 4.0, "text": "\"Great food great deals awesome staff I love this place.", "pics": null, "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "101679450248008704035", "name": "Kenneth R. Huff", "time": 1577687064735, "rating": 5.0, "text": "After learning about this place from a friend, I had to try it out. I had the black bean burger and I have to say. It was the best burger I've had in a long time. The taste was out of this world! Also, the service was superb. I will be returning and I definitely recommend!", "pics": null, "resp": {"time": 1577718943464, "text": "Liberty Black Bean or Purple Black Bean are definitely to be considered!"}, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "117855892399379289843", "name": "Erika M", "time": 1569004983953, "rating": 5.0, "text": "The food was very good! He was very nice and helpful while I was deciding what to order. I went with the burger and it was delicious! The food exceeded expectations and I will undoubtedly be returning. We're going to link back up and develop a meal plan and I'm going to eat Good Food To Be Hail for a week!", "pics": null, "resp": {"time": 1577719153587, "text": "Burgers are good, meals for a week engage the palate!"}, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "107293990677454280287", "name": "Timothy Casey", "time": 1573074213016, "rating": 5.0, "text": "I cut meat out of my diet 7 days ago and never had a veggie burger before but I ordered the millionaire combo and it was fantastic! I know now that this will be a lot easier. David was very nice and helped me out on what to order knowing I was a beginner.", "pics": null, "resp": {"time": 1577719062624, "text": "Millionaires and Zen burgers are dynamic opportunities!"}, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "108555783003642108934", "name": "Aiden Shannon", "time": 1577398454245, "rating": 5.0, "text": "Tried this spot already with a friend and I am hooked since then. I love the great vibes and delicious dishes and beverages. Keep up the good work.", "pics": null, "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "102845337347769036913", "name": "Michael Busbin", "time": 1582137079587, "rating": 5.0, "text": "It was an amazing burger.  The fries were out of this world.  Will be going here often!", "pics": null, "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "117375646141363039427", "name": "Rachel Williams", "time": 1605729436411, "rating": 5.0, "text": "We tried this at Vegan Fest in Avondale, so good definitely worth the trip. We tried 4 different menu options and had a pleasant experience beginning to end, furthered by how good we feel after eating! Owner was extremely nice and welcoming. Feels like your chilling at home while someone who loves you cooks. 110%", "pics": null, "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "100696667045737407283", "name": "Kelli Vila-Rosa", "time": 1559167327841, "rating": 5.0, "text": "Now I really should’ve taken a picture of my burger first, but I was so ready to give this burger a try I ate it! However I did share it with my niece, my mom, and my daughter as I’m trying to get our family on a better way of eating, a lifestyle change. I was so surprised and thrilled that they all said they liked it!! So from now on, well for now anyways, I’m going to treat myself to a different item once a week until I’ve tried everything on the menu and I will keep all of Bessemer posted.", "pics": null, "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "110727654775874212674", "name": "Donreco Glaze", "time": 1574446875151, "rating": 5.0, "text": "The Customer service was Great.. This Was By Far the Best Vegan Food I've Ever tasted in my Life...", "pics": null, "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "102005353154817109330", "name": "Roderick Harris", "time": 1555351000847, "rating": 5.0, "text": "My first was today, and it was awesome. I had the berry smoothies and kale veggie wrap that was oh soooo good!!!. Lots of healthy options and a lot of information if needed. I will definitely be going back ASAP!!!", "pics": null, "resp": {"time": 1559084660117, "text": "We have added some more healthy options, come see what we have to offer now!"}, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "102181278474442591943", "name": "KAMULAH KITT", "time": 1557964721382, "rating": 4.0, "text": "Pleasantly surprised how good the healthy food was. Will definitely be coming back.", "pics": null, "resp": {"time": 1559084589305, "text": "We look forward to serving you the next time as well, thanks."}, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "111844150563244814346", "name": "Batista ESDRAS", "time": 1544279730250, "rating": 5.0, "text": "Excellent place good health results nice smoothies I would definitely send a friend there", "pics": null, "resp": {"time": 1559084782746, "text": "Appreciate your response and please do send your friends that are looking for healthy smoothies, thanks."}, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "114536119320502253394", "name": "XclusivelyDoneEnt", "time": 1581708312526, "rating": 5.0, "text": "Great place to enjoy REAL foood", "pics": null, "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "104063984200718223620", "name": "Chef TréJ", "time": 1541107551854, "rating": 5.0, "text": "Family owned business that is all about health! Had a fantastic vegan smoothie! Great place for Vegans!", "pics": null, "resp": {"time": 1559084964187, "text": "It truly is a great place for Vegan and for those that desire to just increase more raw plants in their diet, thanks."}, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "113084913465219059667", "name": "Williamina Feagin", "time": 1548953510628, "rating": 4.0, "text": "waited on quick. I found what I needed. A restaurant is inside this place", "pics": null, "resp": {"time": 1559084709211, "text": "We look forward to serving you in the future, thanks."}, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "105624048130781855000", "name": "Vincent Flanagan", "time": 1542283040518, "rating": 5.0, "text": "Very good and healthy food.Highly recommend.I will definitely be returning", "pics": null, "resp": {"time": 1559084875799, "text": "Good Health is in our name, it's our mission.  We look forward to serving you and others next time, thanks."}, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
{"user_id": "117459859870288951999", "name": "Scott Scroggins", "time": 1578951941926, "rating": 5.0, "text": "Great food!  Delicious!", "pics": null, "resp": null, "gmap_id": "0x8888e099329268b5:0x4dd55dbc73530bf1"}
