{"user_id": "111187317702529258585", "name": "Johnny Saylor", "time": 1591283828490, "rating": 5.0, "text": "If you have a commercial or residential AV project this company needs to be at the top of your consideration list. They are incredibly knowledgeable and have insane amounts of experience. I’ve worked with them (independently) on challenging AV projects from churches to schools.  Most companies make these AV solutions ridiculously complicated. These guys put in tons of work on the backend so operation and management of the system is simple for volunteer operators like myself. My only con... the founders claim to have been skilled at volleyball. I’m not too sure about that part. But AV wise... There is no one better.", "pics": null, "resp": null, "gmap_id": "0x888cecb7ceec43c3:0x591a1c27123a8503"}
{"user_id": "108398876307646707783", "name": "dontavious moore", "time": 1629254794790, "rating": 5.0, "text": "Great company!!!", "pics": null, "resp": null, "gmap_id": "0x888cecb7ceec43c3:0x591a1c27123a8503"}
{"user_id": "108814023554019492815", "name": "Mike Socha", "time": 1546897688373, "rating": 5.0, "text": "Great Experience with this group! Everyone was professional ,very friendly and knowledgeable. Will be using them again for another project at my home.", "pics": null, "resp": null, "gmap_id": "0x888cecb7ceec43c3:0x591a1c27123a8503"}
{"user_id": "103347607352048226027", "name": "William Paleveda", "time": 1480952647804, "rating": 5.0, "text": "Great company to work with! Everyone is very knowledgeable, friendly and professional!", "pics": null, "resp": null, "gmap_id": "0x888cecb7ceec43c3:0x591a1c27123a8503"}
{"user_id": "110688171375616329575", "name": "Drake", "time": 1468983453072, "rating": 5.0, "text": "I called them at 1 pm about installing speakers I bought at bestbuy they were ready too install two hours later. I had to go to work, but they installed everything and then drove my car back to work and it sounds great. They beat best buys prices by almost 200 dollars and if you have to get speakers installed I would go to them as they have the best prices and really good customer service.", "pics": null, "resp": null, "gmap_id": "0x8862159f1a5a04e1:0x42754bb3730a974a"}
{"user_id": "106901702081802817472", "name": "Cindy Hosea", "time": 1460589471652, "rating": 5.0, "text": "As of today I would not recommend them.  Two weeks ago I went in to get a new radio for my car.  They promised the one they put in with all the bells and whistles would be\nperfect.  Well the radio came in with wrong parts as they had reorder that was fine.  Finally they had all they needed although they kept calling saying you need this and that we said ok.  We took my car to them and they had it 4 days.  Finally after a lot of phone calls they said it was done.  It tried to sync my phone and it did but no sound out of the speakers.  They couldn't figure out the problem so the installer promised he'd call the manufacturer Monday morning and call me.  No phone call.  I called him and got his voice mail.  No return call.  I called the shop and was told they would call as soon as he got in .  No call.  I also called Sirus to have that transferred from my other radio but they didn't hook it up.  So here I sit with a very expensive radio and CD player.  At this point the ball is in their court and I'm waiting to see what they do. Until then I would no recommend them to anyone.\nI now will give them 5 stars.  They have fixed my problems and everything works perfect.\n\nI would go to them again.", "pics": null, "resp": null, "gmap_id": "0x8862159f1a5a04e1:0x42754bb3730a974a"}
{"user_id": "113513323082880009789", "name": "Jason Smith", "time": 1468931601921, "rating": 1.0, "text": "I ordered 1500.00 worth of stuff and was told it would take 3 days but it took over 30 days and everyday I called I they got smart with me and gave me excuse after excuse of why it wouldn't come I am now a dealer for scar audio and many other products and when I order something it never takes over three days it is obvious that he spent the money on something else and had to try to get it back before he can order my stuff", "pics": null, "resp": null, "gmap_id": "0x8862159f1a5a04e1:0x42754bb3730a974a"}
{"user_id": "103696025419201686866", "name": "erika smalley", "time": 1474155131543, "rating": 1.0, "text": "Save your time. This place is absolutely ridiculous. My husband went for his appointment at 6pm and didn't get home until 10pm and they still didn't have the rca wires to hook his speakers up. We are now on day two, so far three hours into it and no speakers hooked up.", "pics": null, "resp": null, "gmap_id": "0x8862159f1a5a04e1:0x42754bb3730a974a"}
{"user_id": "102998610696906351731", "name": "Brent Smalley", "time": 1474769300638, "rating": 1.0, "text": "Got speakers set up---took over 7 hours and 2 days. Nothing was bolted down and wires were loosely ran. Now my speakers are completely out. Don't recommend!!!", "pics": null, "resp": null, "gmap_id": "0x8862159f1a5a04e1:0x42754bb3730a974a"}
{"user_id": "117945846625069676819", "name": "Charles Garrett", "time": 1474783531751, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x8862159f1a5a04e1:0x42754bb3730a974a"}
{"user_id": "106759163216007233170", "name": "Zach Varcoe", "time": 1564523356948, "rating": 5.0, "text": "The best of the best! Family owned and operated for 20+ years. During that time Shaffer Security has advanced with the latest technology and you're not going to find a better price for their guaranteed quality.", "pics": null, "resp": null, "gmap_id": "0x886267e51912a7a1:0xe7827321ff0d40a0"}
{"user_id": "117833960309698806626", "name": "Phyllis Roberts", "time": 1498603338732, "rating": 5.0, "text": "This is a top rated veteran-owned small family business.  The owner and his wife are very professional, responsive to customers' needs and very reasonable compared to the larger companies.  We like the fact they there is no monthly monitoring fee like some of the other security camera companies.  You monitor your security cameras on your smart phones 24/7.   If there is a problem, they come to investigate and repair it as soon as possible.  I recommend this company highly.", "pics": null, "resp": null, "gmap_id": "0x886267e51912a7a1:0xe7827321ff0d40a0"}
{"user_id": "113045164966950707298", "name": "Ron_Sheena Hicks", "time": 1521514973833, "rating": 5.0, "text": "Extensive audio/video and alarm knowledge.  Family veteran owned small business, always willing to offer a variety of solutions to meet your project goals and budget.", "pics": null, "resp": null, "gmap_id": "0x886267e51912a7a1:0xe7827321ff0d40a0"}
{"user_id": "114985177765500171422", "name": "art miney", "time": 1495058462479, "rating": 5.0, "text": "Great locally Veterain Family owned and operated company", "pics": null, "resp": null, "gmap_id": "0x886267e51912a7a1:0xe7827321ff0d40a0"}
{"user_id": "107121080743649456801", "name": "kitty cahoon", "time": 1580418528287, "rating": 5.0, "text": "Nice,knowledgeable, courteous&friendly.\nDavid & his son installed my new Sony 4k projector today. Could not be happier. They shared in my excitement. Great to have local people you can trust  for a quality job at a fair price.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNwt_tAhAsjer91a7uyei4rqh9HY22MzK_7VHBJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNRXeFnAQkKfcebk3mkp5JQlMV_Vx8t3izyw_jl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNRwTH72b08lRqjdfygO5NU8k5MzZzvN0DZe-ty=w150-h150-k-no-p"]}], "resp": {"time": 1580871272575, "text": "Thank you very much for the opportunity !"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "101914758652946555433", "name": "wanda biggs", "time": 1624897858494, "rating": 5.0, "text": "We were nervous about hanging our TV.  David answered all our concerns. David did an excellent job for us.  He really is a pro.", "pics": null, "resp": {"time": 1625244872694, "text": "Thank you very much for the opportunity!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "101381505408651060501", "name": "Chris Parker", "time": 1576532749573, "rating": 5.0, "text": "David and Chase did a wonderful job mounting our 82\" Tv in the living room.  They were professional, detail-oriented and took the time to answer ALL of our questions (we had a lot).  I greatly appreciate their service and would advise anyone mounting a Tv to call them.  They are worth every penny!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPZek-Vjyw1L_NWBElNO7wkPp9oF_4HLPN_WTvL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNdSSRFtkMuFSj_BPdnSa4QoGVLC5Zazd1pKD-R=w150-h150-k-no-p"]}], "resp": {"time": 1580871348547, "text": "Thank you very much for the opportunity and the return business Sir!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "113719265905684050951", "name": "Lila Brand", "time": 1584118140884, "rating": 5.0, "text": "WOW! I cannot say enough positive things about TV Installation Pros. As usual, I was panicking last minute, and they came and mounted two tv's the same day! They were incredibly professional, quick, and did a FABULOUS job. TV Installation Pros did a fantastic job!! You won't be disappointed.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOccyKH2n6B466om_G_QLc_mkvpO5X6fk-2NYLo=w150-h150-k-no-p"]}], "resp": {"time": 1584126087511, "text": "Thank you  very much for the opportunity!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "111142845602527024010", "name": "Steve McLain", "time": 1614995299468, "rating": 5.0, "text": "David is a true professional and a very knowledgeable installer.  I knew David was the man for the job when he not only answered my call but he also followed up with his quote a promised.  He arrived early to my home and after a few minutes getting my input on what I wanted to see, he went to work.\n\nI could not be happier with the outcome!  He mounted my 55” Samsung Frame with a flush mount and even programmed it for me in just over an hour.  He cleaned up the job and made sure I was completely satisfied.  It looks awesome!\n\nSmart TV’s today are not like the TV’s of old days and I would highly recommend you call David to do it right.", "pics": null, "resp": {"time": 1625244968024, "text": "Thank you very much for the opportunity!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "105528524374680267837", "name": "Leigh Hawkins", "time": 1597282871533, "rating": 5.0, "text": "I want to thank David for mounting my 50 inch smart tv!  He takes time to explain and demonstrate how to navigate around the TV with all the new technical features.  David is very informed and very pleasant!  I would definitely recommend this company and will not hesitate to call them again.  I will also talk up this business to all of my friends here in Foley!  5 star for sure!!!", "pics": null, "resp": {"time": 1597332111876, "text": "Thank you very much for the opportunity!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "105845607368029783253", "name": "Cherie Jones", "time": 1594948535173, "rating": 5.0, "text": "Mr. David is amazing!! I call him yesterday afternoon and he worked us in today. He put up two TV for us he did great work. He is very friendly and does a great job. This is the second time we called him as he was here a few months ago to put our 65” up above the fireplace. Recommend this company.", "pics": null, "resp": {"time": 1582868462210, "text": "Thank you!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "106856570614683492199", "name": "Paul Gilmore Sr", "time": 1584130367603, "rating": 5.0, "text": "Super good job mounting our 3 tvs and soundbars!...We lost the cables to our living room soundbar but these guys had the cables we needed on the truck and was able to finish the work! Forever gracious guys, thanks again!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMUZDX-IjNkUZS8WRymL4c9VOHPqT3C-dL-i4N5=w150-h150-k-no-p"]}], "resp": {"time": 1590612605573, "text": "Thank you for the opportunity Sir!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "118308521084310932899", "name": "Chris Matthews", "time": 1590363052587, "rating": 5.0, "text": "Incredible service! Very friendly and responsive, and was willing to walk me through step by step of mounting my tv so I could learn to do it myself. Great guy!", "pics": null, "resp": {"time": 1590612555943, "text": "Thank you for the opportunity Sir!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "109004076993149577579", "name": "Patricia Brooks", "time": 1581710083663, "rating": 5.0, "text": "I called this guy up had a couple questions about my TV he was very very helpful. I will definitely be calling him back .You don’t find too many people like that who would help you over the phone and solve your problem for you over the phone without a dime. Thank u so much.", "pics": null, "resp": {"time": 1583082087385, "text": "Thank you for the opportunity!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "112841720368997794279", "name": "Kelly Cramer", "time": 1582662744275, "rating": 5.0, "text": "Highly recommended! We needed our T.V. mounted on our uneven rock fireplace. They were very professional, responsive, and did a fantastic job. They were able to meet my time frame and were very neat and tidy.", "pics": null, "resp": {"time": 1582868424083, "text": "Thank you very much for the opportunity!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "103070323609472807362", "name": "Stacy Preadmore", "time": 1588460227039, "rating": 5.0, "text": "David was very professional from the first time I contacted him. Our 40 foot motorhome outside TV broke and we were unable to replace it ourselves because we could not purchase the exact same TV. He showed up within 2 days of contacting him and was able to give us something even better than before. We always wished we had a swivels TV outside on the RV and with a little ingenuity he made that happen. Now I can sit outside with the fire and watch TV and I am so happy. I highly reccomend their services,  they are also very reasonably priced.", "pics": null, "resp": {"time": 1588572609614, "text": "Thank you very much for the opportunity!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "117862542136595315298", "name": "Davidd3 Dial", "time": 1584133544285, "rating": 5.0, "text": "David and team installed TVs , when mine was purchased a year ago .. excellent job, very professional.. i have called back twice for additional services and response time is awesome..\nThanks", "pics": null, "resp": {"time": 1588578495524, "text": "Thank you for the opportunities Sir!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "117250875925541472018", "name": "Chuck Welsh", "time": 1592935417924, "rating": 1.0, "text": "Be very careful using these people..installation went ok, but removal of old tv was disaster..were told old tv was heavy and to bring two people..only.one showed.\nResulting on severely damaging my stairs..not only refused to fix but installer upon dropping the tv down the stairs injured his toe..he should have requested help..owner blamed me and threatened to sue...multiple curse words thrown at me..very, very unerving experience..", "pics": null, "resp": {"time": 1595360217413, "text": "Chuck Welsh calls on a Saturday begging for help on a Sunday to remove an old TV out of a credenza and install a new one. We ask him to verify it is a 32in TV which is easily manageable by one technician and size of tv is how we charged...Chuck the liar had a huge almost 50\" tv. Not only did Chuck Welsh lie about the size of his TV but no mention he needed it moved down a flight of very steep stairs which would require a dolly and could have been dispatched with the technician.... as usual we find a way to accommodate our customers even on emergency calls, after removal and installation of new TV,  Chuck the liar hands the technician a white bed sheet to wrap around TV to maneuver TV down the stairs. Technician did as asked, lost control of TV smashed his foot and broke 5 step boards..... Chuck the liar then called seven times before 7 a.m. the next morning leaving messages on our phone for us too come repair his rotten steps. Then sends numerous text messages to harass our dispatcher. I would love nothing more than to meet Chuck the Liar behind the wood shed for tea and cookies ."}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "102746663165543067409", "name": "Marlon Jenkins", "time": 1580239186337, "rating": 5.0, "text": "Very helpful in explaining things. Very honest and truthful about everything. Takes the time to talk and not rush off the phone like so many others do. I highly recommend.", "pics": null, "resp": {"time": 1580871294442, "text": "Thank you very much for the opportunity!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "117742692208587640148", "name": "Austin Thompson", "time": 1568701106812, "rating": 5.0, "text": "These guys are professionals and worth every penny of their work! Got us set up no problem. Great guys and I would highly recommend their service.", "pics": null, "resp": {"time": 1568738835135, "text": "Thank you Sir!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "109817512959472441408", "name": "Brandi Brasher", "time": 1588772542006, "rating": 5.0, "text": "TV Installation Pros were prompt and thorough!  TV's and soundbars all in and looking good!!  thank you!", "pics": null, "resp": {"time": 1588777308828, "text": "Thank you  Ma'am very much for the opportunity!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "100760560523090780458", "name": "Benjamin Morrison", "time": 1577902330022, "rating": 5.0, "text": "Showed up on time, extremely profesional, and knowledgeable.  Cleaned up after they finished.  Would highly recommend for anyone looking to mount TV in the future.", "pics": null, "resp": {"time": 1595970983976, "text": "Thank you for the opportunity Sir!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "116262841808043394432", "name": "Domelyn Garibaldi", "time": 1580266336898, "rating": 1.0, "text": "I texted David to install a simple VHF/UHF antenna on my roof and hook up to two TV’s. He took his sweet time getting back to me with a “quote.” In between, this guy quizzed me about whether or not the antenna needs to be assembled, the splitter, coaxial line, etc. I continued to wait and wait for a response. Finally, David comes up with a “ball park” figure: $400. + $75 “travel fee,” which is a $51.5 mile drive from his place of business to my house. Previous to this, I received another quote for $150. total install, and he didn’t nitpick about whether or not the antenna out of the box was assembled or not...and NO “TRAVEL FEE!” Needless to say, I did not hire David @ TV Install Pros to di any work whatsoever, nor will I be recommending them to any of my friends in the future.  When a company is more interested in the almighty dollar then fair prices,  that company doesn’t deserve any business whatsoever!", "pics": null, "resp": {"time": 1580871080864, "text": "{1} Not a Customer {2} We are a very busy company who responds ASAP-   {3} Entity was furious over $75 \"trip charge\":The cost to transport a Van, tools, 2 techs, fuel cost, insurance, maintenance, etc  on a round trip from Foley, Alabama to Navarre Florida 3.2 hours in \"great traffic\"...{4} Entity responded\" because of $75 trip charge\"  I Quote \" what a rip off artist\" {5} Next message I Quote \" Read my masterpiece review\" \"Your a scumbag\"   ...............Never once have we had someone so rude! ....And if they didn't agree with the cost ,\"why not just move on like evryone else !!!!.Instead of harass a company with multiple follow-up messages!........Obviously this person doesn't understand the cost associated with In-Home Service businesses!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "113520639577911484274", "name": "Grover Hart", "time": 1554519372302, "rating": 5.0, "text": "These guys do excellent work and very easy to work with! They have mounted multiple Tvs in both of our condos in Orange Beach! Every one picture perfect! Highly recommend!", "pics": null, "resp": {"time": 1580871373349, "text": "Thank you very much for the opportunity Sir!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "113470059198530484935", "name": "Lady Miller", "time": 1580578375093, "rating": 5.0, "text": "Called for info about my broken tv. The guy was super helpful and gave me the info I needed to fix my tv in time for the superbowl!", "pics": null, "resp": {"time": 1580869782598, "text": "We pride ourselves in solving customers issues over the phone if possible. Thanks for the review!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "108864818190249113785", "name": "Brooks Hubbard", "time": 1557505399634, "rating": 5.0, "text": "Great guys! Great Prices! Highly skilled at what they do!", "pics": null, "resp": {"time": 1580871416273, "text": "Thank you for the opportunity Sir!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "103328993958031678149", "name": "James Urrutia", "time": 1589082758071, "rating": 1.0, "text": "Horrible experience. The guy showed up high as a kite. Rude and obnoxious. Never again will contact these people.", "pics": null, "resp": {"time": 1589091697596, "text": "FAKE REVIEW!  FAKE NAME!   Obvious Competitor! We have no record of this person on our past schedule. Online search by Google and Facebook has zero findings for the fake name!....Not the 1st attack by competitors in the last year. They have also attacked our Yelp listing and managed to make our Google listing disappear for 2 months.  Most of our work comes from repeat customer referrals, Condo Owners, Management Companies, Interior Designers & Interior Decorators in the Orange Beach, Gulf Shores, Fort Morgan , And Perdido Key areas, therefore only a small amount comes from Google or other online sources, therefore their attacks don't hurt us as much as it would other businesses. If your looking for references before having your job done, we would be happy to provide you with many & their telephone numbers !  This review has been reported to Google but  our experience with google , they will do nothing nor do they ever reply back!......Welcome to doing business in the digital global world!  Tv Installation Pros provides perfect precision tv installation jobs only!!!! GUARANTEED!\n\n#1 in Tv-Audio-Visual  Services on the Gulf Coast"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "100645700535190834309", "name": "Theresa Taylor", "time": 1554579189716, "rating": 5.0, "text": "We had 3 flat screen tv's  mounted by these guys! Not only were they very respectful and did exceptional work, they cleaned up after themselves.......After dealing with many contractors remodeling our home that was HUGE! Thank you guys!", "pics": null, "resp": {"time": 1580871459060, "text": "Thank you very much for the opportunity Ma'am!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "105187561325397388476", "name": "Mike Tillman", "time": 1554962062456, "rating": 5.0, "text": "Excellent job  mounting and installing our 4  Samsung tvs!  Very skilled in what they do! Was also able to mount our soundbars to the tvs  , much better than  mounted on the wall! Looks much better as well.....   will recommend to all!    Mike T", "pics": null, "resp": {"time": 1580871435232, "text": "Thank you very much for the opportunity Sir!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "113083819626901283171", "name": "Ben Redmond", "time": 1536597848036, "rating": 5.0, "text": "Excellent work! Very professional and made sure everything was cleaned up! Mounted all of our TVs at the condo.....Thanks again!", "pics": null, "resp": {"time": 1537716939988, "text": "Thank you for the opportunity!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "103493082111541219047", "name": "Charlie Miller", "time": 1542338675020, "rating": 5.0, "text": "Came Wright away very professional put up TV and  mount hooked up internet did a great job very neat and friendly he is definitely a 5* rating", "pics": null, "resp": {"time": 1580871392394, "text": "Thank you very much for the opportunity Sir!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "108535427598376243410", "name": "Tom Stanford", "time": 1537213671045, "rating": 5.0, "text": "Showed up on time!!!!!!Thats big! Did professional work and cleaned up after......5 out 5", "pics": null, "resp": {"time": 1537716917001, "text": "Thanks for the opportunity!"}, "gmap_id": "0x889a0e11def6a87b:0xad7ca92ee1d2c58d"}
{"user_id": "103835170865665748635", "name": "Benjamin Pugh", "time": 1536871286507, "rating": 5.0, "text": "I've had Swift Installs put in security systems at my business, and a home theater at my house. Each experience went smooth, and all the equipment is still going strong.", "pics": null, "resp": null, "gmap_id": "0x887f93a20b68eb2d:0x988e5283bd747139"}
{"user_id": "108140466990421739248", "name": "Robyn Wright", "time": 1515816606749, "rating": 5.0, "text": "Great service Tech's and great customer service overall!! Will be recommending these guys!! Excellent work!!", "pics": null, "resp": null, "gmap_id": "0x887f93a20b68eb2d:0x988e5283bd747139"}
{"user_id": "105170047286336556950", "name": "Walt Harris", "time": 1608868612730, "rating": 5.0, "text": "Great place with fantastic service... great pricing", "pics": null, "resp": null, "gmap_id": "0x8861ef7f49946011:0x5220c410ba88df8e"}
{"user_id": "116237161323527799024", "name": "Scotty Arredondo", "time": 1538928778355, "rating": 5.0, "text": "Great work", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPZl7j6q02R1NszonLpYtYc7NK1h57YukNH6fLb=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8861ef7f49946011:0x5220c410ba88df8e"}
{"user_id": "110003617047260625963", "name": "Aaron Olinger", "time": 1586040413643, "rating": 5.0, "text": "Spending quarantine in Scottsboro, decided to get a much needed tint job on my 2000 Grand Marquis. After sorting through reviews of places I decided on going with T&A customs. After getting the tint and having waited the 3 days for the tint to fully dry I can honestly say I'm blown away by both the service AND the results that I got. Pricing is more than fair and the feeling that my vehicle was in the hands of experienced pros was present during the whole process. Any future tint work on my baby will be done by T&A Customs as well as any stereo work I might need. If you value getting unbeatable prices, amazing service, and second-to-none results done by people who know what they're doing I suggest you make a similar call 👍", "pics": null, "resp": null, "gmap_id": "0x8861ef7f49946011:0x5220c410ba88df8e"}
{"user_id": "105422913146922497324", "name": "BassheadRhino", "time": 1594617360537, "rating": 1.0, "text": "The guy is very rude and opinionated. Asked him a simple question and called me names. Very unprofessional and wouldn't recommend.", "pics": null, "resp": {"time": 1594644527643, "text": "Im sorry if there was a  misunderstanding we get a very high amount of calls every day , sometimes the most busy time of the day and lately from people who are just killing time at our expense we are a small business and its very hard to complete our work with so many calls trying to help everyone get what they need"}, "gmap_id": "0x8861ef7f49946011:0x5220c410ba88df8e"}
{"user_id": "116260532746446376879", "name": "Andrea T", "time": 1544692019076, "rating": 5.0, "text": "Thank y'all so much for setting my radio up today! It's been 2 years since I've had one in my car, and it sounds and looks amazing! Great job!!!!", "pics": null, "resp": {"time": 1544746770239, "text": "Your very welcome"}, "gmap_id": "0x8861ef7f49946011:0x5220c410ba88df8e"}
{"user_id": "103128309187718744516", "name": "Darryl Bailey", "time": 1580668495710, "rating": 5.0, "text": "Good prices and great people.", "pics": null, "resp": {"time": 1580684550581, "text": "Darryl thank you for the great review we looked forward to working with you in the future"}, "gmap_id": "0x8861ef7f49946011:0x5220c410ba88df8e"}
{"user_id": "108798791739643915578", "name": "Wayne Judd", "time": 1530381476357, "rating": 5.0, "text": "Very knowledgeable friendly service easy to deal with", "pics": null, "resp": {"time": 1530388435182, "text": "Thank you for the great review we look forward to doing some more work for you in the future"}, "gmap_id": "0x8861ef7f49946011:0x5220c410ba88df8e"}
{"user_id": "111183495630817208317", "name": "Addie Sanderson", "time": 1579555792585, "rating": 2.0, "text": "Fair prices", "pics": null, "resp": {"time": 1579560536830, "text": "Addie have you even been in my store how can you leave a 2 star review if you've never even been to my shop"}, "gmap_id": "0x8861ef7f49946011:0x5220c410ba88df8e"}
{"user_id": "115249260438557101933", "name": "Allison Phillips", "time": 1580852912193, "rating": 5.0, "text": "Sometimes you need an honest answer about what you think you need and what you actually can have. Andy Evans was totally honest with us about this very idea. He didn't try to up sale us but instead he educated us about what was realistic and a more practical approach with our project. Really refreshing and well received. Thank you Andy!!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "116751464109888572228", "name": "Darrel Arnold", "time": 1580859361514, "rating": 5.0, "text": "AVX is a great company with excellent customer service. Any issues that you might have would be addressed promptly and in a timely manner. I would highly recommend using them. They do what they say they are going.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "104053829378433359763", "name": "Lynn Ray", "time": 1580996883469, "rating": 5.0, "text": "Brenda does an excellent job of working with her clients to make sure that everything meets their requests, their expectations and that they are completely satisfied with the work. of the AVX technicians.  She is available to take your call and cheerfully makes sure it is exactly what you ordered.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "110257042736645519063", "name": "Alex Casey", "time": 1580874858379, "rating": 5.0, "text": "Andy Evans is a man of his word. It shows in his work ethic. He and his team are very honest with their clients. Highly recommend AVX for all audio and visual projects!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "110933419211731821061", "name": "Guy Rosenstiel DMD", "time": 1580906713015, "rating": 5.0, "text": "Thank you for an excellent system with fabulous sound! And Andy Evans coordinated a team that was fast, clean and friendly! Could have had a better experience!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "105767417209614742420", "name": "Rab Stewart", "time": 1574287527369, "rating": 5.0, "text": "Andy Evans and the crew at AVX are the best in the business. They are extremely knowledgeable when it comes to AV. They have helped me in both my home and office. I can't thank these people enough for giving me top notch service and products.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "101140300628780553552", "name": "Bryant Miles", "time": 1581538787218, "rating": 5.0, "text": "Working on projects Andy Evans and his team at AVX has been outstanding. They are very professional, know the market better than any other company we have worked with and are very upfront on the scope of the project. I can't say enough good things about him and his team.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "107908422285805830817", "name": "Josh Smitherins", "time": 1574710023214, "rating": 5.0, "text": "I dealt with Beau while searching for a pair of JBL Synthesis speakers.  We didn't end up making a deal, only because the speaker I was looking for was a closeout and they didn't have any in stock, but he contacted the manufacturer twice to find out information for me.  Great customer service.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "114396426399822584072", "name": "Joe Daniel", "time": 1580921002286, "rating": 5.0, "text": "Great advice, great products, awesome and timely service.  Will definitely continue working with Andy and the folks at AVX.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "100125509814179742954", "name": "Hank Spencer", "time": 1580855533156, "rating": 5.0, "text": "Andy Evans and the crew at AVX are the best in the business. They are extremely knowledgeable when it comes to AV", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "102084078621205624586", "name": "Kimberly Arnwine", "time": 1580872420066, "rating": 5.0, "text": "If you want to work with someone awesome, Contact Andy. He will take care your needs!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "105335899150915787817", "name": "Howard Whatley", "time": 1580854773826, "rating": 5.0, "text": "Excellent Company, Excellent service.  Andy Evans is first class all the way", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "102633105624105290593", "name": "Brice Jackson", "time": 1580910668596, "rating": 5.0, "text": "I’ve know the leadership at AVX for a long time! Quility team, quality experience!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "109714369762860128484", "name": "Britton Eveland", "time": 1580850273536, "rating": 5.0, "text": "The team at AVX are knowledgeable, and professional in the service they provides my family, I would recommend them to friends and family!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "109924224506168108751", "name": "Ryan Mays Young", "time": 1518220323117, "rating": 5.0, "text": "This friendly group of people delivers the best audio and video experience in Alabama. Not only do they install high-quality equipment but they make it look amazing. If you're looking to upgrade your house this is the way to go.", "pics": null, "resp": {"time": 1519247636643, "text": "Thank you Ryan! Please let us know if you need anything further!"}, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "101301489770735942522", "name": "Wes Cline", "time": 1580855608129, "rating": 4.0, "text": "Andy Evan's and his team are passionate about customer service.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "107873574863274697927", "name": "phil white", "time": 1446143218399, "rating": 5.0, "text": "Dan worked at our home and awesome.  Very knowledgeable,courteous and professional.\n\nWe had some minor issues after installation was complete that were quickly taken care of.\n\nDan will be the first person I call when I need this type of service again.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "115650444634794719679", "name": "James Kerr", "time": 1580852066501, "rating": 5.0, "text": "Andrew Evans is a true professional.  I trust him and AVX will all of my AV needs.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "105441075203208225875", "name": "Harvey Trueblood", "time": 1580851511024, "rating": 5.0, "text": "Andy is always on top of his game with all of his customers all the time. Would never hesitate to use him and his services or refer him and his team .", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "112903902272691164009", "name": "austin johnson", "time": 1580850562586, "rating": 5.0, "text": "Extremely knowledgeable  and can do any job", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "105788749855785766504", "name": "Michael Joffrion", "time": 1542964206932, "rating": 5.0, "text": "AVX has come through od=enc aa=gain with my specia reweuet. I recenty came down with the very serious case of upgradeitis; Bo Lamar, of their first salesman listened patiently to what I WANTED and got back t o my in a few days of with 3 plans. The Caddy Plan The GMC Plan and The Honda plan for caatch strapped fella and strella couple. Bo knew my personal listendng habits, so he had no problem with findig a few spakers o fit my needs. Several week past and we went throught pairs or loudspeaers: REeve, and Focal. While undert warranty of coursel.\n\nI hahad  helped creat the new line s pw,, it' ;ike athe  cash show at ther moment. B%. W's Nuatilus 802'a for nearly 20 years and thy outperform pretty mudh efvery speaker rhat was been put against it.Imto;u recemt;u.. Kurt got a little bit crazy souding ad it\n\nAmuwau, I think the jJet hae a distinctive of the gams arpmg on what out us I feel like we appropriate  They took athe bades to actually check the ad,\n\nSo,given,r test and speakers + suboofers, what are you thourhgts compared to Billie Joel?\n\nOve rthe weekend, I am being met wit h the worden about this issue.  aim setting 804'sin order and going to give top them 804's om a jhabisuas\n\nThanks for Yout Time Sirl,", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "116891609575461291674", "name": "ralph quinn", "time": 1483465769108, "rating": 1.0, "text": "Great folks if you never have an equipment issue.  Apparently they really aren't intrerested in retaining you as a customer after the sale is made.I'm in the process of looking for a different company who will stand behind their product line. Do not let them sell you any Integra equipment.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "100452914277292530367", "name": "Ivy Stokes", "time": 1440945254646, "rating": 5.0, "text": "Had a good install with no major issues.  I like the Sonos system AVX installed better than the Control4 system I used to have.  I would use them again.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "100234670222462545800", "name": "David Gibson", "time": 1472418665788, "rating": 5.0, "text": "These guys are at the top of their game for new technology and cool solutions for home and work!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "100497151587034212548", "name": "Kevin Barber", "time": 1580849987344, "rating": 5.0, "text": "Great company to work with.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "113290823247246074100", "name": "dave Chapman", "time": 1506542136677, "rating": 5.0, "text": "Quality product and excellent service", "pics": null, "resp": {"time": 1507057416368, "text": "Thank you so much! Let us know if we can help you any further."}, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "107013176019786573708", "name": "Jack Belew", "time": 1421810122343, "rating": 1.0, "text": "Absolute rip off. Paid 5x what my neighbor paid for a system that has twice the issues.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
