{"user_id": "104397303214698464562", "name": "Doris Bell", "time": 1628543550654, "rating": 5.0, "text": "This is in response to my son, David Bell's review.  He was upset when I told him that after Answered Prayer finished their service in my home I found several items missing.  Several months later, the missing items were returned to me by someone that I knew and not connected to Answered Prayer.  It was then that I realized that  Answered Prayer had nothing to do with the missing items.  I have apologized to Answered Prayer.  They have responded in a most gracious way and accepted my apology.\n\nDear      :\n\nI am writing this letter in regards to accusing your employees of theft last year.  I apologize for my mistake.  The items I accused them of taking have been returned to me.\n\nOnce again, I apologize to Answered Prayers and these employees for my wrongful accusation and pray that you will forgive me.\nSincerely,\n\nDoris Bell\n\nI had accused back in 2020", "pics": null, "resp": {"time": 1628544002684, "text": "Thank You So much"}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "110377771715057782703", "name": "Susan Stringer", "time": 1615484621358, "rating": 5.0, "text": "Knowing that this home care service is owned locally makes a big difference.  Not only am I happy to support a locally owned agency they are extremely professional and do an amazing job caring for their clients.  The owners are a big part of our community and are real fine folks.  I highly recommend Answered Prayer Home Care.", "pics": null, "resp": {"time": 1615558214500, "text": "Thank you for the review. We sure do appreciate hearing this feedback."}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "100764745517782410757", "name": "Arla Chandler", "time": 1615484353389, "rating": 5.0, "text": "Once again Answered Prayer was a fantastic referral for a family friend. They visited once a week to give the family some time away from the home knowing their loved one was well cared for.  Thank you so much Answered Prayer team for always being the best!", "pics": null, "resp": {"time": 1615558223010, "text": "Thank you for the review. We sure do appreciate hearing this feedback."}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "105282582359851685951", "name": "Brittany Willis", "time": 1615403617064, "rating": 5.0, "text": "Can not say enough great things about Answered Prayer! The staff is helpful, professional, and companionate. Would highly recommend this company to anyone looking for in-home care!", "pics": null, "resp": {"time": 1615404047734, "text": "Thank you for the 5 star review. We sure do appreciate hearing this feedback."}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "104045705994923551345", "name": "joan williams", "time": 1604496725823, "rating": 1.0, "text": "In a time when we need consistency for our loved one, this agency has failed to deliver. Workers have no training on the basics from using wheelchairs to attending to basic needs. Workers report late and leave early...even asking to bring their kids along to a work location.  There is a different worker each day which does not give an opportunity for a relationship to develop between client and worker. They take advantage of elderly and/or sick clients if there is no one to advocate for them. I am disappointed. We have been patient, however, our needs have not been met.", "pics": null, "resp": {"time": 1604519114280, "text": "Thank you for providing constructive feedback that we can share with our team. It is our utmost priority to accommodate  families providing comfort, relief, and reassurance during a challenging time. Our goal is to work with families to create a constructive relationship meant to serve and provide care when families need it most. A member of our management team will be in contact to resolve any communication or service issues that may have occurred.  Thank you again for bringing this matter to our attention. Our management team is available to meet and revise a plan of care always. Please don't hesitate to reach out."}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "101670901803394577584", "name": "David Bell", "time": 1612816753937, "rating": 1.0, "text": "Do not use this company;  we had several items stolen and the company said they would follow up and then stopped responding.  Terrible experience at the worst time possible.  Follow up - I was contacted about the review and Answered Prayer did not wish to make it right (without proof through a police conviction).  If you hire them, make sure your valuables are locked up.", "pics": null, "resp": {"time": 1612897254961, "text": "Answered Prayer Home Care is a locally owned highly reputable and trusted home care service in the River Region. We thank you for bringing your concerns to our attention. As a leader in home care we are bound to a high standard of ethical and moral integrity, prideful of our outstanding caregivers who have been employed without incident for many years.  We place high standards on following protocols at all times.  It is our hope in the future when you or a loved one requires in home care you will consider choosing the integrity of Answered Prayer Home Care Services."}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "105558754163707568233", "name": "Charlotte Cearley", "time": 1544135163761, "rating": 5.0, "text": "So very thankful for Answered Prayer, and Irene.  This group has sent us very qualified and caring folks.  When S had to leave, we were immediately blessed by another caring person, Irene.  So many days, she lifts all our spirits as she lovingly cares for our mom.  Meghann, too, has been invaluable in helping us think things through.  Very grateful for the hard work of this group!", "pics": null, "resp": {"time": 1544186001012, "text": "Thank you!  We are always trying to do our absolute best.  I will share this with our team.  They will appreciate your kind words."}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "113282249556822425934", "name": "Mandy Beeson", "time": 1516040854802, "rating": 1.0, "text": "Would not recommend! I used this service for less than a year and had to request new caregivers multiple times because of issues with each one. The first one asked to buy all kinds of things from my home, as well as wanting to bring her Internet boyfriend over to meet my mom. Not ok. I don’t think their staff is trained to deal with Alzheimer’s patients and I had one “caregiver” who constantly argued with and agitated my mother. I finally decided that I was done with this company. I paid my last bill and they deposited the check, then tried to send my bill to a collection lawyer! Steer clear of this service!", "pics": null, "resp": null, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "102693880535757385584", "name": "Richard Crabtree", "time": 1574963956683, "rating": 5.0, "text": "Thank you for everything. You guys were great", "pics": null, "resp": {"time": 1578059504356, "text": "Thank you Richard. We always strive to do our best.  Appreciate your feedback!"}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "108699333513666355151", "name": "Del Chick", "time": 1533828640165, "rating": 5.0, "text": "I retracted my negative statement because John White, the owner of the company took care of the situation and was very apologetic, and he will handle the problem for my mother. He said it was a major miscommunication and I’ve accepted  that. You just have to reach out until you get the owner of a company and explain it to them, they’re usually more than helpful, as he has now been.   He Immediately went right out to see my mother! And we have a resolution worked out. Thank you very much John ! 👍", "pics": null, "resp": {"time": 1533783576364, "text": "UPDATE Hi Del!  We so appreciate working with you and appreciate you reaching out to us.  Have a super day!"}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "100027781594474476954", "name": "Peggy Johnson", "time": 1511912874339, "rating": 5.0, "text": "Very comforting to my family.  Was also very professional and companionate in caring to my daughter during the final time of her life.", "pics": null, "resp": null, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "113282249556822425934", "name": "Mandy Beeson", "time": 1516040854802, "rating": 1.0, "text": "Would not recommend! I used this service for less than a year and had to request new caregivers multiple times because of issues with each one. The first one asked to buy all kinds of things from my home, as well as wanting to bring her Internet boyfriend over to meet my mom. Not ok. I don’t think their staff is trained to deal with Alzheimer’s patients and I had one “caregiver” who constantly argued with and agitated my mother. I finally decided that I was done with this company. I paid my last bill and they deposited the check, then tried to send my bill to a collection lawyer! Steer clear of this service!", "pics": null, "resp": null, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "104100827503178628899", "name": "Morgan A", "time": 1531862418782, "rating": 1.0, "text": "I would not recommend anyone to use this company to help their loved ones. AnswerPrayer is the most disloyal, unprofessional, and unorganized home health company in Alabama.\nThey also dont give frequent drug screenings to their employees who's out there making mistakes on the job.\nMegan Wikof is NOT to be trusted, don't let her poker face fool you!!!", "pics": null, "resp": {"time": 1531944934015, "text": "Hi Morgan. We are very disappointed to learn of your dissatisfaction with our service provider.  Trust that we are evaluating any dissatisfied feedback that results from interacting with our company.  We will throughly research the comments above and will be sure to handle this with care, accuracy and professionalism.  We strive to always improve and your feedback will be evaluated constructively.  If you have an opportunity to review us again and can improve our rating we would appreciate the evaluation."}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "102032324944818337779", "name": "Bruce Trowbridge", "time": 1628343803976, "rating": 5.0, "text": "My 94 year old mom fell and fractured her L1 vertebra the day after Christmas.  She was bed ridden for a couple of months due to the pain, and after the fracture healed remained bed ridden and on oxygen due to progressing congestive heart failure.  This lasted almost 6 months until she passed, with the last 4 months under in-home hospice care.  My mom lived with me, since she (and the rest of the family) did not want her last days to be in a nursing home.  I am a single man and with the constant care my mom required, I could not handle it on my own, I needed caregiving help.  I contracted out 60 hours every week for caregiving and I took the other 128 hours myself.\n\nI contracted with BrightStar based on recommendations from friends, and I was not disappointed.   BrightStar provided qualified care givers, and if mom and/or did not relate well with a particular care giver, BrightStar would provide a different one.  We eventually evolved to a core set of 2 regular care givers, loved by my mom and I,  covering all 60 hours per week.  I don’t know if other companies would be this flexible and supportive.  If a regular caregiver could not come, BrightStar would notify me and fill the gap, so that I could always count on a caregiver at my home at the planned schedule.  Knowing that a caregiver will be there, rain or shine, is a major consideration when determining if you want to hire a known private individual or a company with lots of caregivers.  Additionally, BrightStar schedulers, nurse, business office personnel were always a pleasure to work with and very supportive of mom and I during these trying time.  BrightStar may not be the cheapest, but you can count on them, so you just set your hours to what you can afford.  I highly recommend BrightStar, and if the need for caregiving arises for me in the future, I will be calling them.", "pics": null, "resp": null, "gmap_id": "0x8862691000000001:0x6ce406a91cbe1e64"}
{"user_id": "115435683279121778426", "name": "Mary Cashulette", "time": 1605815190430, "rating": 5.0, "text": "I had a horrible infection. This group is unbelievably professional and caring. Christy Jones came up with the idea of using a vac. My surgeon didn’t think about that. I trusted Brightstar more than him and was able to heal well. Thank you so much! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8862691000000001:0x6ce406a91cbe1e64"}
{"user_id": "101067890724144030572", "name": "Anna Elizabeth Jones", "time": 1454361694232, "rating": 1.0, "text": "100% client oriented.", "pics": null, "resp": null, "gmap_id": "0x8862691000000001:0x6ce406a91cbe1e64"}
{"user_id": "115534002393895043325", "name": "Tati Monű", "time": 1517447395292, "rating": 5.0, "text": "Great place great staff and caregivers", "pics": null, "resp": {"time": 1517540339926, "text": "Thank you!  We are pleased to be able to provide our services to the local, Huntsville community!"}, "gmap_id": "0x8862691000000001:0x6ce406a91cbe1e64"}
{"user_id": "103912504287981860413", "name": "Matt Morris", "time": 1626911054911, "rating": 5.0, "text": "Incredible installation of crawlspace encapsulation, however our factory new sump pump had a faulty switch. Aqua-Guard responded the next day and replaced the entire pump. I never write reviews but felt i should for these guys. They really helped us out with our flood water issues.", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "110921839422540022534", "name": "Brook Armistead", "time": 1623434626912, "rating": 1.0, "text": "We had them scheduled for our waterproofing and we had a contractor come in and do the demolition in our main bathroom. We tried to contact them multiple times over the course of two weeks and never got a response. By the time we finally heard back from them it was the day before our scheduled appointment to have them come in and do the waterproofing and they said there was more our contractor needed to do. They had to push out our date and put us at the back of the line even though they are the ones that did not respond to our multiple calls. Therefore we have decided to go with Bdry instead. Mike NEVER returned our calls once he sold the job!!", "pics": null, "resp": {"time": 1623459029156, "text": "We respectfully disagree with this complaint.  I met with Mr. Patel (I have never met Brook Armistead and she was not present) on 4-9-2021 to provide him with a quote (approximately 8 weeks prior to installation date).  It is my understanding that Brook Armistead is Mr. Patel's wife.  At that time, I went over in detail what prep work would need to be done in order for us to install our waterproofing system.  I informed Mr. Patel that I would be glad to provide him with a contractor that could do the prep work properly, he chose to use his own contractor.  Mr. Patel and I had several conversations leading up to the date of the installation about specifics of the job.  The statement that I never returned phone calls is patently false.  Mr. Patel has had several conversations with our office as well, to which his phone calls were always answered or returned (records to prove it).  Our office called to confirm the installation date on June 3rd, at which time Tina went over everything that needed to be moved again.  I spoke with Mr. Patel on Monday, June 7, TWO days prior to installation date of June 9. It was at this time I discovered Mr. Patel had been misinformed by his contractor about what needed and didn't need to be removed.  Aqua-Guard only removed Mr. Patel from the schedule when he wanted us to postpone his job.  In that conversation our office manager explained to him that if he postponed the job that we are booked out and couldn't guarantee when he could be worked back into the schedule.  He called us back on June 10 to get back on the schedule and we were unable to give him an immediate schedule date. We were in the process of shuffling our schedule to work him back in when Mr. Patel called our office today upset and cancelled the project all together.  We were not going to put him at the back of the line.  We regret the homeowner feels this way but we feel we did everything we could to accommodate them."}, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "109866016377922468362", "name": "Laine White", "time": 1609375434831, "rating": 5.0, "text": "Emmanuel was so wonderful and we had the best experience with him! It’s so hard to find people who are wonderful to work with these days, and he helped us with our water issue and was a pleasure to do business with. Cant recommend him enough!", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "100785999023450152734", "name": "Kreg Newman", "time": 1605298716367, "rating": 5.0, "text": "They did a phenomenal job waterproofing my basement.  The employees were all courteous, professional and on time.  The work was perfect and is functioning as advertised.  Would absolutely recommend them!", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "110666855323476051642", "name": "Dylan Scroggins", "time": 1598023604582, "rating": 5.0, "text": "I think I earned a Masters degree in encapsulation/water-proofing due to all the research I put into the job I needed and who to go with. After having AquaGuard complete our crawlspace I can assure you that they are the best in the business. I was VERY impressed with the professionalism and quality of their work from every member of their team. From the front office to the front lines they are good people that do great work. Highly suggest!", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "103592159295412001813", "name": "Mick McGrath", "time": 1618449524339, "rating": 5.0, "text": "They were very accommodating,  and do great work!", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "112819553469295622911", "name": "Jill Rogers", "time": 1611624585451, "rating": 5.0, "text": "2nd Update -\nAquaGuard returned to make repairs as needed and did an excellent job. They were very apologetic for the issues we experienced and did everything they could to make up for it. Because of this, I cannot recommend them enough, they were extremely professional and handled the situation with ease. They came out immediately to fix the issues and I wouldn't hesitate to hire them again if we ever need to. Very grateful to Manny and Tina for their help!\n\nThey installed a sump pump and an excellent waterproofing system in our basement for the previous owners who lived here. We contacted AquaGuard to redirect one of the discharge lines and they quoted us a reasonable price, so we decided to have them do it. It took several calls to get them to come out, and they finally came out about 4 months later. The guys who did the work didn’t cap the sewage line, so I called them and asked if they could come back as it should only take a few minutes. Well I wasn’t surprised when they didn’t so I just went to Home Depot and purchased what I needed. Overall, quality of work was good (besides not capping the sewage pipe back).\n1st Update: Went to the basement this morning to discover that the guys working had broken the drainage pipe for our bathroom sink and they used a Romex power wire we have running in the basement to hang their new pipe on. Will update review if AquaGuard returns to fix the issue.", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "107853669284686176828", "name": "Robert Carver", "time": 1566476883458, "rating": 5.0, "text": "Very pleased with Aqua-Guard's work. Mike was good to work with, and the installation team did a great job. Because of my general interest in the approach I observed the entire process. The install team clearly knew what they were doing, and functioned together like a well-oiled machine. In some areas they exceeded my expectations. Good estimation process, good installation, and good price. I recommend without hesitation.", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "101595782316904029128", "name": "Ryan H", "time": 1522787436479, "rating": 5.0, "text": "Aquaguard was fantastic throughout the entire process. Mike was very easy to work with and did a great job addressing all concerns. We had several companies come out and quote the job and as it so rarely turns out these guys had the lowest price as well as the most intelligent solution. One of the other companies wanted to sell us a similar system with an unnecessary pump system for almost twice the price of AG. Due to our property being on a heavy slope it made more sense to have the water gravity fed from the basement to have one less thing to worry about maintaining. Mike saw the reason in this approach and explained while some applications do require a pump ours did not and so was able to design the system to accommodate our individual situation as opposed to saying “This is our system. It’s the same for everyone”. On the day of the job the crew showed up on time with a supervisor to address any concerns before starting the job. Everything was completed and cleaned up in a matter of hours. They didn’t leave a mess and did exactly what they said they would. Tough to find these days, especially at a reasonable price!!  I would highly recommend this company. Not only did they knock it out of the park installing a water proofing system that is working like a champ but also offer a warranty for the life of the structure which is as good or better than anything else I was able to find while researching how to solve the water issue. Thanks guys for a great experience well worth the money!!!", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "118092222995476068444", "name": "Jodie Mote", "time": 1525886719416, "rating": 5.0, "text": "Mike/Aqua Guard was great to work with and did a great job with our crawl space encapsulation.  It immediately helped with our temperature issues and gave us a ton of additional storage.  They recommended an option much cheaper than another company who appeared to be trying to sell me a lot of stuff I didn't need for my intended use.", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "113913719516589910888", "name": "Farrah Mote", "time": 1525893959218, "rating": 5.0, "text": "Aqua-Guard was highly recommended to me by numerous people. They lived up to their recommendation with their quality of work, quick turnaround and professionalism. Mike provided the perfect solution for our crawl space and a quote that was much less than others. I highly recommend Aqua-Guard for your waterproofing needs.", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "108911313234557897795", "name": "Scott McGriff", "time": 1551206922992, "rating": 5.0, "text": "We used Aquaguard 3 years ago (2016) to waterproof a finished room on the lower level of our home.  The process they use has kept us from having any water intrusions since and we no longer have even a hint of the musty smell that we had been dealing with for years.\n\nI would definitely recommend their product/service.", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "107157016317205184807", "name": "Marion Yester", "time": 1519829373980, "rating": 5.0, "text": "In 2011 we moved into an older home on a beautiful small lake.\nIn 2012 our area experienced an unprecedented amount of rain and we were surprised to find that water was accumulating along the back wall of the workshop. We called several companies in Birmingham and got their suggestions as well as estimates.  Aqua-Guard impressed us with their range of options, their patience and a more reasonable price.  They came out and put in one of their systems and we have had no trouble in that area since.\nIn 2016 we again had a tremendous amount of rain and this time, water came in on the other side of the house.  We, of course called Aqua-Guard and were pleased to find out that they could extend the system to include the new section.  They even let us do some of the prep work and saved us money!\nIn 2018, again a lot of rain and water was coming in near the corner of the workshop door.  We worked with Aqua-Guard to do some problem solving.  For a few weeks it was a mystery.  They never gave up. But then Mike Shofner and my husband came up with a very creative solution.  We could not be happier.\nIf any other water problem should arise, we would never consider calling anyone other than Mike and Aqua-Guard.  They get our strongest recommendation and would encourage others to give them a call!", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "106356060838636314254", "name": "Andrew Golson", "time": 1524065007434, "rating": 5.0, "text": "Very professional.  Their quote was $5k+ less than their competitor and significantly less invasive.  The system works perfectly and their team was fast and efficient.  Lifetime guarantee on their work as well.  Brett their sales manager came back out personally and adjusted something to my liking.  Would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "104805819854497959953", "name": "harrykat 0ne", "time": 1532641861789, "rating": 5.0, "text": "This is one great company, they did the work promptly and the quality of their work is way above average! Very trained and professional crew who did an outstanding job! No complaints at all, would highly recommend!\nJeff Rominger..Hoover", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMh29xKzDiWs2-WyHUOeaiH-EefPqG8_w24Yqb2=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "116314521108084891329", "name": "trevor lundstrom", "time": 1525220193571, "rating": 5.0, "text": "We dealt with Mike the owner of Aquaguard.  I had a quote from a competitor that was several thousand dollars more expensive.  Mike looked at their quote said he would do same thing for considerably less, roughly half price.  He was also more professional and was present during the start of the job unlike the other company who schedules subcontractors to install their product.  I always prefer to deal with family owned companies for better customer service and pricing.\n\nHe supervised the job and coordinated an inexpensive electrician to remove the fuse box from the garage wall, and install outlet.  The entire job was finished in a half day and they cleaned up after themselves.  The lifetime warranty is another added benefit.  You will not go wrong with Aquaguard.  Get their free estimate and see for yourself.", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "105291220545788737070", "name": "Thomas Glover", "time": 1523920179548, "rating": 5.0, "text": "Just had our first big rain of the year. Normally, we would water leaking through the walks but we had aqua guard come out and put in a system to keep the water out of the garage and basement. Hard working crew. Very professional and lowest price.", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "117904993489971874178", "name": "Chris Williams", "time": 1519688930594, "rating": 1.0, "text": "Misrepresentation of the scope of the job.  Bad communication from the get go.Didn’t call just showed up when they wanted.  Customer service didn’t  mind the crew cutting an electrical cord in my wall and then just swiping electrical tape over it( very dangerous). Overall did not come out to understand my concerns or care about them at all. Poor poor poor customer service and communication.", "pics": null, "resp": {"time": 1519939782809, "text": "I am very sorry you feel this way, but I would like to address the issues listed.  I communicated with you about the wall clearance and what needed to be done prior to us doing the work. A copy of the contract was left with you on the day of the estimate that listed the work that needed to be done in order for us to waterproof your basement. This quote was given 4 months before you called to schedule the project.  Our office called you the week before your scheduled project to confirm the appointment and an approximate time the crew would arrive.  Our communication is the same with all of our customers.  On the day of the appointment you signed the contract that listed prep work that needed to be done and it was explained to you again on the day of the job.  Our crew did the prep work for you, which was your responsibility, at no additional cost to you. It is extremely important to me to keep our reputation and customer satisfaction at the highest level possible. I am not sure what we could have done differently to communicate to you about your project and what needed to be done.  I have reached out to you with no response.  I am not sure what more I can do to help you."}, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "103940543923507405481", "name": "David Shaw", "time": 1518122145050, "rating": 5.0, "text": "Mike and his crew did an amazing job waterproofing our basement.  Very professional, great price and done on time.", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "101175926679554444772", "name": "Ken", "time": 1523410611596, "rating": 5.0, "text": "The Aqua-Guard Team was on time, efficient, and hard-working.  Thanks to Mike, Tina, Brett, and the Installation Techs for the value add to our home!!", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "101900216514701553240", "name": "The Aubins", "time": 1542247906214, "rating": 2.0, "text": "Aquaguard installed a waterproofing in my basement and encapsulation in my crawl space 2.5 years ago. The GOOD: The price was very competitive, Mike (owner) seemed very honest detailing the work to be performed, the crew completed the job quickly, and I haven’t had any water intrusion issues since. THE BAD: following the completion of the job I noticed several items that looked suspect - caulking around door, window, fireplace, and at end of wall sheets was missing or poorly done, sump basin cover had a large cutout and therefore not well sealed, encapsulation in crawl space was made up of what looked like a lot of scrap peices haphazardly taped together and noticeable creases in the tape joints. I didn’t call Mike to come back out because I figured they were the pros and the installation methods were acceptable and/or industry standard - i.e not items I should be concern about. Well... 2.5 yrs later, I’m having issues with the tape joints separating and releasing moisture and foul odors from the soil gases escaping the encapsulation in my crawl space that are coming up into our main level. I contacted Aquaguard and was told that it’s been too long since the install for them to correct the problem free of charge. the customer service representative basically stated that “if the waterproofing system isn’t leaking then it doesn’t fall under their warranty.” So much for standing behind your work. If the encapsulation membrane would have been taped correctly we would not be having this issue. Note* I have already addressed the poor caulking and sump basin lid on my own as to not be a “needy customer”.\n\nInteresting bit of info... I called BDry about this as I thought they had done the waterproofing. They sent a rep out the next day, he checked the encapsulated crawl space, agreed it was not installed acceptably, and said they would be sending someone out to correct the problem before end of week. Unfortunately, I’ve realized they didn’t perform the work originally so I called them off.", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "114777278285012624608", "name": "Tracy Thornton", "time": 1533949407180, "rating": 5.0, "text": "Awesome company!!! Would recommend to anyone!!!", "pics": null, "resp": null, "gmap_id": "0x8889185828db1a29:0x9999084413a45e1d"}
{"user_id": "105366377189058722485", "name": "Burchfield lc", "time": 1524006642343, "rating": 5.0, "text": "Great and very helpful! Highly recommend", "pics": null, "resp": null, "gmap_id": "0x889bb31f66646b65:0xb9c65cfbc2dfef14"}
{"user_id": "116776467660633840740", "name": "Steve Howe", "time": 1623540502726, "rating": 5.0, "text": "It’s rare to have a company who does what they say they are going to do, but we sure did with this company. When they said they would send someone out to get a new caregiver started and trained, they did. When a regular caregiver couldn’t come in they made sure a trained caregiver was there even if it was office professionals (who were former caregivers). They made sure we liked our caregiver and if we had complaints they would take care of it. George (the owner) was so personable and spent a lot of time with us explaining his philosophy on running the most honest, best caregiving experience.  We also enjoyed and appreciated our caregivers for my parents. They worked hard and loved them like their own. If we are ever in the position to need a caregiving service in the future, there will be no doubt who we will use, Your Choice Senior Care.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "105521311697546769366", "name": "Heather Steel", "time": 1616790156292, "rating": 5.0, "text": "I'm very pleased with the service given by Your Choice Senior Care. George and his team are great, and have helped my dad so much. And they have brought me incredible peace-of-mind.  Not only do they bring him breakfast in the morning (he's at Somerby) but they make sure he gets his medicine 3x a day, talk with him (this has helped his speech tremendously) and help him keep up with some of his light chores and ADLs on the days he needs it. We have found them to be super accommodating with last minute changes and requests, and overall very responsive and caring. Thank you!", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "111765452972684313246", "name": "Catherine Hales", "time": 1611770989868, "rating": 5.0, "text": "This team is always very responsive in helping our seniors. George and Christina are extremely helpful in making sure prompt and quality care is always available. They are one of the few home care companies that require extended training for those with memory loss. A much needed training in this field!", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "113963477862069589286", "name": "Debbie Leirer", "time": 1576790533076, "rating": 5.0, "text": "I cannot say enough good things about \"Your Choice Senior Care\" and I highly recommend them to anyone that needs senior care assistance.  They have been a godsent for my father.  They are very kind, caring and patient as well as very professional.  They were always on-time for their appointments with my father.  They assisted and trained my father with taking his blood sugar readings and insulin injections.  They offer a variety of services and you can pick the service(s) that best suits your needs.  Their prices are very reasonable.  If you need a senior care professional for your elderly parent, \"Your Choice Senior Care\" is the first call you should make.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "118158288105220348482", "name": "Richard Davidson", "time": 1559942863931, "rating": 5.0, "text": "I highly recommend Your Choice Senior Care for anyone needed help caring for somebody. We’ve relied on Your Choice for well over a year to help care for my 97 year old mother. The company’s owners/managers are conscientious, hard-working, and responsive to our concerns.\n\nOne caveat: the quality of individual caregivers varies considerably, from excellent too awful. The best are more than caregivers; they are friends, both with my mom and my wife and myself. A rare few were bad enough I ordered them to leave and not return. The owners and managers are careful with who they hire, and pass on our instructions for what is expected from the caregivers, but they cannot monitor everything happening in your home.  In the end, it is up to you to determine which caregivers meets your needs and which have to go.\n\nThat said, anytime there has been problem with a caregiver—no matter the time, day or night—the owners/managers have acted *immediately* to correct the problem, including personally caring for my mom until a replacement caregiver was found.  They strive to provide excellent care to the elderly, and their efforts have made it possible for my mom to continue living with us long after she surpassed our ability to care for her by ourselves.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "111173524491269581553", "name": "Yvonne Simmons", "time": 1560870714991, "rating": 5.0, "text": "I am helping a friend who lives out of town with his 94 year old Dad.   We chose Your Choice Senior Care about 2 and a half months ago.  Best decision we have made so far.   He has needed 24/7 care up till about a week ago and we cut back to about 10 hrs and the owners helped us figure best times to have the care givers there.\nWe were so lost when we first realized we needed this type care and they took care of everything even down to picking up supplies.  They are so hands on and involved.\nI can go on and on about this being an A+ company!!!!\n\nYvonne", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "117492082925712874149", "name": "Valeria Farmer", "time": 1564659882538, "rating": 1.0, "text": "The 18 yr old they sent to help with my mother wanted to do nothing but sit there and watch tv.  We stopped using them and they keep sending invoices to be paid that we're already paid.  It's been months since we used them, but keep getting invoices each month.  The last conversation i had with them, i was informed they owe me money but here it is the next month and they want me to pay them again!  They owe us no money and we sure don't owe them!", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "118162148206786564250", "name": "Vanessa", "time": 1490797029286, "rating": 5.0, "text": "The care and compassion my mother received from Your Choice Senior care made me want to write a review to tell others. I have a busy life and wanted her to be taken care of by professional and caring people during the day and while I was on vacation. If you're looking for help, give them a call and they can do many things to make your life easier.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOeXsdy8J5-W-2vFBZfPMRJDQllN3twMGr_jj5X=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMDKYKgUni8xI-nT_9kqojytoFJu-n9ScAgZEZC=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "106762902737563814340", "name": "Jevon smith", "time": 1489425220646, "rating": 1.0, "text": "They sent me out 45 miles..an the facility dint allow male caregivers there to sit with woman...they promise me i would still get my 9 hours on my check..THEY SENT ME 16$..please. Stay away from them", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "113695462545965873732", "name": "Leigh Wright", "time": 1490880344064, "rating": 5.0, "text": "They were polite and professional. Definitely made a difficult time easier.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "100271443291519475830", "name": "Leigh Wright", "time": 1490794533900, "rating": 5.0, "text": "They were friendly and professional. Made caring for my grandmother much easier.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "103574179415098269771", "name": "Valerie Chavez", "time": 1553548248356, "rating": 5.0, "text": "Such great people!", "pics": null, "resp": {"time": 1553548502503, "text": "Thank you so much for your kind words! Look forward to seeing Mrs. Chavez next week!"}, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
