{"user_id": "117636192197730020286", "name": "Tammy Watley", "time": 1625495208815, "rating": 5.0, "text": "I've used TSI's home security services for over a decade and have always been satisfied. I recently upgraded my system and can't begin to express what a game changer this was! I love being able to arm and disarm my phone with a single touch on me cell phone, as well as see what's happening at my home anytime. This was well worth the investment and I wish I'd done this year's ago!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "114863772217753431186", "name": "Terri Chiang", "time": 1591308873199, "rating": 5.0, "text": "We just had the most pleasant experience with TSI Alarms. Everything went smooth from the very first call and speaking with Jackie to schedule the installation all the way until today where we met the most pleasant young man, David Madison, he made one of the most efficient installations we have ever seen, and then patiently took the time to explain everything about how this incredible new smart home system works. We cannot thank you enough David, you deserve great praise for a job well done!!", "pics": null, "resp": {"time": 1591372000723, "text": "Thank you very much. This means a lot to us. We appreciate your business!\nSincerely,\nTSI Alarms & Audio"}, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "107533026856757918003", "name": "Steve Preskill", "time": 1602114106224, "rating": 1.0, "text": "Never use these people, they have a contract. Which I get. But won't even release military family members who are PCSing.\n\nThey absolutely do not support the military", "pics": null, "resp": {"time": 1602172408170, "text": "Steve,\n\nWe at TSI take our reviews very seriously. You signed the contract so you know there was one & they are very standard in our industry. TSI does support the military & we even offer a military discount. If you can provide documentation that you are being transferred outside of our service area then we would relieve you of the contract.\n\nWe also do not show you as a customer. Is your account in another name or are you speaking on the behalf of another customer? Or are you a competitor speaking on the behalf of a customer?\n\nSincerely,\nTSI Alarms & Audio"}, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "108322631501804138626", "name": "Matt S", "time": 1590424684683, "rating": 1.0, "text": "Shady company ran by dishonest owners that will lie to you in order to keep your business.\n\nTSI Alarms also lied to me multiple times by saying that equipment installed by them (Qolsys IQ Panel 2) can ONLY work with TSI Alarms, and that if I cancel my account with them the panel will become useless. I was told that this info came directly from the TSI owners. They also said my doorbell video and other automations (lights, etc.) will not work if I canceled with them. They say that no other company will be able to use the equipment and it will only work with TSI since it was \"theirs\". They say that you cannot buy the Qolsys IQ Panel 2 online, because it comes from their dealer. This is all false.\n\nThey will also tell you that they don't know if they are allowed to cancel your account and that they don't know how to cancel accounts (and you have to call alarm.com to cancel). After multiple times calling alarm.com, I found out that you do in fact cancel with the dealer (TSI), not with them (they are just a third party software company). The lady at TSI needed to speak to her supervisor (but they were conveniently gone for the day), and she would call me first thing in the morning about if they can cancel/how to cancel my account (wouldn't you know, they never called back, I had to call them). The next morning, my call was passed around to 3 individuals until I spoke to somebody who wanted to make sure I 100% wanted to cancel my account (for all the reasons above). My alarm.com account was gone less than 5 minutes after I hung up. It was a fun few days of conversations.\n\nEdit: Thanks for responding M. Moore. I WAS a customer of yours, so I CAN leave a review on your company (I went to a different company because TSI is dishonest). Everything I've posted is 100% truth. You need to check your employees training if what you've read above is not how you want them interacting with customers. Shady.", "pics": null, "resp": {"time": 1590418768651, "text": "Matt,\n\nYou have over complicated this entire situation. It is actually very simple. The cellular device that is built into the Qolsys panel is registered to our company, TSI. You would need another company to replace that device. Of course the Qolsys panel is available online to anyone that would want to purchase it at a retail price. All the other automation devices that were installed in the home are also universal and can be used with any other company. You were not told that. That was your misunderstanding. You were actually told that the automation devices would no longer be free because TSI would no longer be providing that service. That is an agreement between TSI, DR Horton & the Alarm.com builder program. You can’t just have some random company give you a free Alarm.com account. I would think this would clear up any confusion you have. Like I said it’s very simple. You would need another company to replace the device.\n\nAlso please do not reach out to TSI to assist or help you for any other reason. We take our reputation and reviews very serious. We also do not appreciate you, who is not a customer going online as you if you are and giving our company a 1 star review. You are not a customer & do not reserve that right. We have been in business for 21 years. I can also tell you that during that time I have never been accused of being shady. That is slander! You need to be very careful with your words. We are upfront and honest to a fault. We did not tell people what they want to hear in order to make a sale. We have lost many opportunities & sales over the years for that reason. The other company was willing to tell them what they wanted to here even though it was false and we were not.\n\nSincerely,\nM. Moore\nVice President"}, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "104376188590895126320", "name": "Kimberly Brooks", "time": 1554341944788, "rating": 5.0, "text": "TSI is the best security system hands down. The whole team from owner Scott Moore to the receptionist is first rate. Questions are handled efficiently and effectively from first contact. My office (Farmers Insurance in midtown) has relied on the alarm systems provided by TSI for years.\nThey are my go to for recommendations to my clients.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "102491150141737937796", "name": "Mary Ann Fye", "time": 1554937925121, "rating": 3.0, "text": "Monthly fee is a little high but the company is willing to work with you on technical issues. This is a new account so I am hopefull it will be a good experience. I have heard they are better than some of the other companies out there. I love the sky bell! What a great feature and the app is easy to use.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "100165791896940350211", "name": "Victoria Schumann", "time": 1554508197630, "rating": 5.0, "text": "TSI is the best security system you can get. I’ve had TSI for years and have never been disappointed. The staff are some of the most friendly people I’ve met. I wish I could give them more than 5 stars!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "106961497047936210003", "name": "Lana Mosley", "time": 1554491870193, "rating": 5.0, "text": "I do not personally have an alarm with TSI but can attest to the owners of the business. They are good people who will provide excellent customer service and quality workmanship. They are compassionate, caring and concerned with doing the best job possible to meet your needs. If seeking an honest company to do business with select TSI.\n\nLana Mosley", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "116532744192439286818", "name": "Ricki Roberts", "time": 1554347370546, "rating": 5.0, "text": "TSI is a great alarm service! Ms. Jackie is wonderful, she is always so helpful! If we have ever had a problem she has always made it same day service. I highly recommend this company!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "115961513458937791331", "name": "patrick Hardy", "time": 1564674113890, "rating": 5.0, "text": "I highlighly recommend TSI Alarms & Audio for ALL of & Your home automation, residential and commercial security needs. TSI is a locally owned private company with operating principles that include acting with integrity, establishing and maintaining win-win relationships, and owning the results. TSI is a company that I trust with rates that never increase.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "112618889902735374581", "name": "Audra Warren", "time": 1554407330626, "rating": 5.0, "text": "TSI is a wonderful family owned security company. I’ve had great service with them for over 3 years now. It’s very easy to use; and the best part is I feel safe, and protected in my home, and comfortable leaving town.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "113492092689991053375", "name": "Corporate Square 1079", "time": 1535656994340, "rating": 1.0, "text": "Probably the worst customer service I have ever experienced.  I purchased a business that already had their system installed.  I tried to cancel and go to a new local company, however they told me the contract was valid for another year and I had to stick with them or pay a penalty.  Ok, I'll do that.  Then I needed some service work done.  Forget it.  They take your information and it goes into a black hole.  Apparently your are required to follow up with them.  And you have to do it over and over again until you are lucky enough to get someone that can (help).  They will never call you.  After a few months of trying to get my problem resolved, they sent another company to come out and look at my equipment.  They tried to repair, but determined I need a replacement part.  I sent in the part, because it was under warranty a couple of months ago.  I still know nothing on whats going on with it.  The only person that knows anything is always out.  Buyers beware with this company.", "pics": null, "resp": {"time": 1536250140523, "text": "Can you please provide us with some more details so we can help resolve your issues. What name is account listed under?"}, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "106278925241284652487", "name": "Donald Smith", "time": 1539270834405, "rating": 5.0, "text": "My security system was 10 years old and in need of updating. I called Mark w TSI and he and Brandon did a really good job of installing me four new cameras w DVR and screen and reworking my outdated security pads. Great job, great communication and fair price. I trust these guys.We were rarely at home when they were there.\nGreat Company", "pics": null, "resp": {"time": 1539277297567, "text": "We appreciate the opportunity!"}, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "100743726927035566715", "name": "Larinda Moore", "time": 1536249259347, "rating": 5.0, "text": "TSI is a wonderful locally owned company that has not raised their monitoring fees in 20 years. Their camera systems and home theater and audio are top notch as well! I would highly recommend them to anyone. They also don’t do high pressure sale tactics or door to door soliciting.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "106016187240139687001", "name": "gaye mayo", "time": 1474315667964, "rating": 5.0, "text": "I would like to thank Mark, Jackie and the TSI Alarms crew for answering all my questions regarding my new alarm system as well as my new thermostats - it's awesome that I can do everything from my phone and especially when I am out of town.\n\nThe road techs have always been prompt and courteous and even came out to Orange Beach to check on the thermostats and after all that  it turned out to be the actual air conditioning unit -\n\nWould highly recommend them to anyone looking for home security and trying to figure out what I can do next to make my home more automated.\n\nThanks again!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "100560924522286433799", "name": "Tony Hines", "time": 1554379999821, "rating": 5.0, "text": "Scott Moore and his team are top notch. They have the traditional security knowledge along with the leading edge technology. No DIY solution is going to bring you the peace of mind and real security that TSI and their team brings.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "112879152481913365661", "name": "C Pace", "time": 1464292457194, "rating": 5.0, "text": "After having TSI Alarms (previously DRC Security) at my former residence for over 6 years, it was a no-brainier to have them at the home I recently purchased.  I called and was able to easily select and setup the equipment I wanted to install with their billing manager Rachel.\n\nRachel was beyond helpful in working with me to find a package of equipment that met my needs and my budget.  She ensured that I would have enough equipment to cover all of the home and to provide the wireless option I was looking for (so I do not have to have a land-line).  She scheduled a prompt installation that met our schedule with no problem.\n\nOn installation day two technicians Chris and Tony were sent to my home to install the system.  My husband was there to oversee the project and said they were both professional and courteous.  The techs cleaned up after themselves and ensured they discussed placement of all equipment with my husband so the alarm operated at its best performance.\n\nIf you are thinking of purchasing an alarm for your home I highly recommend TSI Alarms for their service.  Shop Local!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "111403578810851678430", "name": "Pratt Team", "time": 1554347081860, "rating": 5.0, "text": "The TSI staff was very helpful and patient. They fully explained what equipment I would need to handle the system I wanted to install and the different pricing options I could choose. I would highly recommend them to family and friends.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "114606020448567061618", "name": "Gary Hand", "time": 1554385392006, "rating": 5.0, "text": "Great company and an amazing value. The entire staff are always on top of things, any questions I've asked they were able to answer quickly.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "108322529972136239573", "name": "Shana Jordan", "time": 1554407163342, "rating": 5.0, "text": "My family loves being able to use a locally owned company to secure our home.  TSI is always quick to respond and extremely friendly!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "103972592489045427401", "name": "Mark Minnaert", "time": 1554346842427, "rating": 5.0, "text": "Great company to work with  Very knowledgeable  Was able to access my current system and give me the upgrades I wanted with no fuss  Highly recommend", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "114763892991296370552", "name": "marcia Martin", "time": 1554346272118, "rating": 4.0, "text": "Tsi did a wonderful job on my new security system. Im am very happy with the service i received", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "115404959388497920167", "name": "Glenn Ramskog", "time": 1554342883206, "rating": 5.0, "text": "I could not be happier with TSI. Thier expertise with them helps life not have to be complicated with thier equipment", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "107240439515708948865", "name": "Cathy Matter", "time": 1554344974409, "rating": 5.0, "text": "5 stars! This is a fantastic company! The people are fantastic to work with!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "118041631592110418599", "name": "Shelli Bell", "time": 1554345273723, "rating": 5.0, "text": "TSI is family owned and operated and it shows in the attention to quality customer service. You want them to be in charge of your security!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "115883297159765837720", "name": "Derek Brignac", "time": 1454535213482, "rating": 1.0, "text": "I used TSI alarms for my home security system after being contacted by one of their sales reps. 1 month into their service after installation the system quit working. Took approximately 1 month to get a tech to my house to fix the issue. System shorted out. The tech fixed the problem, but after another month the system quit working once again. Called multiple times to get it worked on again, but they could never come at a reasonable time. Ex. TSI tech would call me on a Wednesday at 3pm and tell me they would be at my house the following day at 11am to work on it. I do not know about them but my job does not allow me to take off work like that. After that we were never able to get them to come even though I was still being charge monthly for the monitoring service that I was not getting due to the system not working. Now I owe them for several months of service that I never received. My advice is to stay away from TSI and use ADT or other top carriers.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "110966405331533482638", "name": "Michelle Watts", "time": 1554479635085, "rating": 5.0, "text": "We have enjoyed our service, our sales rep and the installers.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "110350270320215858782", "name": "David Langham", "time": 1554346133583, "rating": 5.0, "text": "A+. Would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "101532534466319494221", "name": "Chase Connell", "time": 1474302105657, "rating": 4.0, "text": "After having several issues with our Security cameras,  they are fully functional and working properly. TSI Alarms came and fixed all of our problems without charging me.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "107619511985136155196", "name": "Janice Files", "time": 1593616875451, "rating": 3.0, "text": "One month after having this system installed my panel goes off every 60 seconds at 9 pm. Customer service says I have to call back in the morning; the office is closed.\n\n** yes, I am a new customer of only one month and just got off the phone with your office. **  update -   I had faulty equipment - tech repaired and so far it is working again", "pics": null, "resp": {"time": 1550593209091, "text": "We cannot find you in our database as a customer? Can you please give us more information? We want to make sure you have the right company.\n\nThanks,\nTSI Alarms & Audio"}, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "109096199441659883314", "name": "Steve Lewis", "time": 1532587697787, "rating": 5.0, "text": "I have had TSI for 20 years & I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "108535427598376243410", "name": "Tom Stanford", "time": 1550909922944, "rating": 1.0, "text": "Not trustworthy! You have been warned!", "pics": null, "resp": {"time": 1550941120073, "text": "Mr. Hillman,\n\nWe need some more information. We have gone through all our databases and cannot find you as a customer. Would your account be associated with another name? Can you please provide us some more information so we can figure out what your issue is? We also want to verify that you have the right company.\n\nSincerely,\nTSI Alarms & Audio\n\nMr. Hillman,\n\nWe are still awaiting your response. We will assume at this point you have no business or association with TSI. Please enlighten us otherwise.\n\nSincerely,\nTSI Alarms & Audio"}, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "108105323381413306804", "name": "rachel cauldwell", "time": 1532103870857, "rating": 5.0, "text": "Great customer service and staff!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "111478802473306752626", "name": "Elaine Taylor", "time": 1539279333544, "rating": 5.0, "text": "Great company to work with!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "114039439658035553509", "name": "Tranay Tanner", "time": 1557784859272, "rating": 1.0, "text": "Customer Service support is Terrible with this company.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "108101021089654391498", "name": "Ma'at Dei", "time": 1620812389820, "rating": 5.0, "text": "Professional and fast. This is a great company and I would recommend them for any home or business.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "111650325185761495626", "name": "Robert Chappell", "time": 1614914408593, "rating": 5.0, "text": "I am very pleased with my ADT security system! The techs are very professional and exhibit extreme concern that you are completely satisfied with their work before they leave. Excellent customer service!", "pics": null, "resp": {"time": 1614952011011, "text": "Hi Robert. Thank you for the 5 Star Review :-)"}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "113223786916724216152", "name": "Jay Starling", "time": 1614113761147, "rating": 5.0, "text": "Our sales representative, David Jackson, quickly responded to the request to review our current system and provided several system upgrade options.  Our installer, Jeff, arrived on time and did an outstanding job.", "pics": null, "resp": {"time": 1614130980565, "text": "This is great news, Jay. We appreciate the love ♥️ 💕 💞"}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "111973787564470105759", "name": "Joyce Boigenzahn", "time": 1607606719142, "rating": 5.0, "text": "Thank you Scott for upgrading our home security system with ADT. We have used ADT for over 10 years and we have never had a problem. The tech, Scott was professional, polite, and very knowledgeable. He worked effectively and efficiently, answering all of my questions (I had alot) and even taking extra time to explain future upgrades. Thank you ADT and Scott.", "pics": null, "resp": {"time": 1607626861556, "text": "Thank you for being a member of the ADT family, Joyce, and for taking the time to share your awesome experience."}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "113289572783623439442", "name": "jeffery davis", "time": 1624657138607, "rating": 1.0, "text": "No stars, I would not reccomend ADT anyone.   Worst customer service ever!", "pics": null, "resp": {"time": 1624712492892, "text": "Hello Jeffrey- We are so sorry to hear about your experience. We would love to help you. Please reach out to us at alwaysthere@adt.com for further assistance."}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "104998227444322801517", "name": "Shellie Weaver", "time": 1600906606475, "rating": 5.0, "text": "Michael had exceptional customer service. He was efficient and attentive to all of our needs. When it came to providing an experience for us he went above and beyond. We would highly recommend him to anyone!! Job well done!!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "102094764118638861613", "name": "Monica", "time": 1620728364176, "rating": 2.0, "text": "My ADT representative did an outstanding job. He went over several packages to ensure I knew my options. Working with David, I feel safe and secure. He answered all the questions I had and walked me through everything I needed. I will recommend Mr. Jackson's services to others.\n\nUpdate: I gave Mr. Jackson a referral to one of my friends and he criticized him on his credit without knowing if he was a victim of identity theft. Change the rating from 5 stars to 2 stars", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "115841425118961113086", "name": "L Craig", "time": 1589242898781, "rating": 5.0, "text": "Excellent service, quick install and has been a positive experience so far. My account representative took the time to make sure I had all that I needed and that I understood all of my equipment. I feel secure and I am very happy with ADT. Highly recommend their service and my representative David.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "107027554629984533229", "name": "Jan Kimble", "time": 1596399260966, "rating": 5.0, "text": "David Jackson was the sales representative from ADT. Mr. Jackson is very knowledgeable about the service I requested . He was highly efficient, arrived promptly for each scheduled visit and answered all of my questions. Very professional.\n\n.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "108576332391737540210", "name": "Joyce SIMMONS", "time": 1562443743868, "rating": 5.0, "text": "I am absolutely satisfied with the services I received from ADT Sales Representative David Jackson.  From the beginning till completion of installation.  David was thorough as well as PATIENT with me.  I had many questions but he answered them all.  I felt safe and comfortable with David.  He was extremely professional and knows his products well.  I will without hesitation recommend him to others.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "110643657650802303377", "name": "Carolyn Howze", "time": 1560377110353, "rating": 5.0, "text": "We've had ADT since becoming homeowners 5 years ago. Jonathan Givens is our awesome technician! He is very knowledgeable and we have had all positive experiences with his services. We are blessed to have him servicing our system and answering any questions we might have.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "106685406444347128393", "name": "Matt Campbell", "time": 1560015187858, "rating": 5.0, "text": "David Jackson, I greatly appreciate you sitting down with me and discussing the different types of products that ADT has to offer.  Purchasing something significant can be a very hard decision for most people, but having a professional like Mr. Jackson there to  assess the situation accurately is very helpful. Thank you for helping get my set up done as soon as possible. I do not know what kind of wand Mr. Jackson has under his sleeve, but it must be  really good because he was able to get me on the install schedule extremely fast. I recently had an issue so I wanted to secure my property and feel safe at home once again. ADT has an excellent set of products, many cameras and motion sensors, window monitors, temp controls, etc. What I like so far about the set up is that I can view all of the security on my phone and also on any computer.  I am looking forward to hearing from Mr. Jackson in the future and I hope to have a fantastic relationship with ADT. Thank you", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "114065927104297974792", "name": "J Renzenburger", "time": 1569958957165, "rating": 5.0, "text": "ADT Technician Jacob Bohannon was extremely quick and efficient. He had our system installed in no time and was very helpful explaining the features. Please be sure he is recognized for his outstanding attitude and great customer service, he is a real asset for ADT.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "107469307136677580990", "name": "Thaddeus Porter", "time": 1594120430628, "rating": 5.0, "text": "Fantastic customer service.  Very fast, very professional, and very knowledgeable!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "103036244481624794110", "name": "Lisa Nicholas", "time": 1593713138735, "rating": 5.0, "text": "It was shared to me the system and how it work. The agent was understanding and gave details of the system.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "115380444109926682098", "name": "Sharity Scott", "time": 1559315685672, "rating": 5.0, "text": "You can't go wrong with Scott Chamblin! He updated our ADT system flawlessly. He was a true professional, very competent and proficient at his job. Once installs were complete, he was very patient with us while ensuring we could work the new system. We were very satisfied with the results. Will request him by name for any future services. Thanks Scott!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "108469196919106911691", "name": "Sherrie Shown", "time": 1592274633676, "rating": 5.0, "text": "ADT has kept me feeling safe and secure for over 11 years.  The company is very customer oriented and will go above and beyond to see that everything is exactly to your liking.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "106111375037217473704", "name": "Tamara Myers", "time": 1594422383958, "rating": 5.0, "text": "Thank you David for all your help. You made sure to explain to me about ADT and what services they provided.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "106386327206677447903", "name": "Andrea Bach", "time": 1597015848238, "rating": 5.0, "text": "Great customer service always there for any questions.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "110309128180798684181", "name": "Linda Barsczewski", "time": 1564155023521, "rating": 5.0, "text": "We recently had an ADT tech, Jonathan Givens, at the house to assist us with an issue regarding our exterior security camera. Jonathan immediately knew what was causing the problem and was able to resolve it. He was professional, courteous and very knowledgeable. We sincerely hope that all ADT techs are like Jonathan... Thank you ADT and Jonathan!!! Job well done!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "107962327280009634421", "name": "Bobby Ford", "time": 1556823573719, "rating": 5.0, "text": "My experience with ADT was outstanding.  I have nothing but great things to say about the service that I received from both the service agent (Ms Morgan Hamel), and the technician that installed the ADT system.  Accolades to both of your employees for outstanding service.  I end with big thank you to Ms Morgan for taking time to explain the different options and to help me select the best package to fit my requirements. The technician was great and he took the time to go over and familiarize me with each component on the system.   Thanks again and may God Bless....\nBobby L  Ford", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "104292460319233025104", "name": "Chip Westberry", "time": 1560602916300, "rating": 5.0, "text": "We have been using ADT security services for many years.  We recently completed an addition to our home and needed additional equipment.  David Jackson drove down from Montgomery to help us determine what equipment would best cover our needs.  He and James House were very knowledgeable and helpful.  We are very pleased with the results.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "113832712423835446145", "name": "Thomas Susi", "time": 1565040259896, "rating": 5.0, "text": "Service technician Jonathan Givens did a great job. Took his time and explained the system to this elderly couple. We are not that computer savvy so he was patient with us. Kind, polite and was on time.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "114583852960009506397", "name": "James M. Levy", "time": 1556636256867, "rating": 5.0, "text": "David did an exceptional job. He is friendly, professional and answered every question I had. Additionally, he cleaned up any mess made. I strongly and happily give him and ADT 5 stars!!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "100513523916139289490", "name": "Wendy Gay", "time": 1563630031884, "rating": 5.0, "text": "We've had ADT for many, many years and David in Montgomery was by far one of our best reps.  He is very detailed and customer focused.  And wants only the best for me (customer).", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "107311463253930933763", "name": "Michelle S", "time": 1562354028244, "rating": 5.0, "text": "Jonathan Givens was my technician today, he was very prompt and was able to address my issue and get me back up and running in minutes.  He was excellent with my rescue dogs and explained what was going on along with the fix.  Only thing ADT needs to work on it length it takes to get a technician when a customer has a problem.  Waited about 2 weeks for appointment and in and out in like 30 minutes.  Jonathan Givens is a huge asset to your company and I tell all my friends about ADT and Jonathon.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "103199474430465666255", "name": "Francine Anderson", "time": 1563651944403, "rating": 5.0, "text": "I am so very happy I chose ADT for my home security. ADT Technician Scott Chamblin was the individual who came out to my home and he was so very informative and knowledgeable about the  company’s products and services.   Before leaving, Scott made sure that my new system was properly working and that I knew how to operate it along with the new features.  ADT, thank you for your protection and for sending such an outstanding technician to initiate your services.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "110573600556821866373", "name": "Gina Griffin", "time": 1560399893434, "rating": 5.0, "text": "Jonathan Givens was amazing.. i was initially told my appointment would be Friday but Jonathan saw that he was within 10 miles of my house and called me to see if he could come a few days early. This was such a blessing because i live alone and i depend on my security system. Thank you Jonathan", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "110360478281608214349", "name": "Joshua Carlson", "time": 1562100539407, "rating": 5.0, "text": "Got Jacob to set up our ADT alarm - he was exceptionally helpful and quick. Would definitely request him by name if we got more work done.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "117140979462627658534", "name": "Kathy Perreault", "time": 1562261563432, "rating": 5.0, "text": "Jonathan Givens, the technician who installed our ADT security system, was very knowledge and helpful. He was very patient as he guided us through the operation of the system. We were glad to hear that we can contact him directly if we have a question or a problem in the future.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "102784525424289572507", "name": "Yvette Esteves", "time": 1564602833120, "rating": 5.0, "text": "Mr. Givens arrived on time like always. He was on task right away. Mr. Givens updated our cel unit and successfully fixed ALL our Z-Wave switches. We appreciate his professionalism.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "106244995566605395594", "name": "Phillipian 4:10", "time": 1559340586721, "rating": 5.0, "text": "Scott Chamblin was perfect. He came in to upgrade our system and was professional and efficient.  He reviewed the entire system with our family, he was patient and thorough. Grateful for this type of customer service experience.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "103301205605834290249", "name": "Taye moore", "time": 1578101864388, "rating": 1.0, "text": "Terrible. They will give you a 5 hour window and be a no show.  say they tried to call and reschedule you for 2 weeks later.  Try another company.", "pics": null, "resp": {"time": 1578498691594, "text": "Hello Tay- We are disappointed to hear of your experience. We are happy to help you. Please reach out to us at alwaysthere@adt.com. Please provide us with your phone number, address and please reference your post."}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "112259115655072385278", "name": "Leslie Strappy", "time": 1559055860889, "rating": 4.0, "text": "David has been awesome getting everything ready for me and also instrumental and helping me getting personal specifications set up on my new system.  This has been a smooth transition because of David.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "104386188900761439219", "name": "Anthony Barnes", "time": 1589336227649, "rating": 5.0, "text": "Mr. David Jackson was very nice and informative,  great job", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "102763548873064390826", "name": "Samantha Podloski", "time": 1553205635706, "rating": 5.0, "text": "Chris King was awesome. I love our system and he explained everything to me. He was very patient and helpful and answered all of my questions.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "113023382180283749032", "name": "Edie Butler", "time": 1567618019307, "rating": 5.0, "text": "Jonathon Givens has serviced our home issues several times and each time he has been professional, courteous, and genuinely interested in correcting all issues with excellent care.  We LOVE our ADT.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "110796622449800635390", "name": "Yvonne McBeth", "time": 1572040898061, "rating": 5.0, "text": "ADT, I had the pleasure of meeting Dakoda Blietz today.  He had come to installed additional equipment in my home.  I just wanted to thank and praise him for a job well done. His excellent customer service skills, his professionalism,  his patience and his thoroughness was 5 Star.  He answered my questions, asked again if I had any more question.  What  really impressed me,  was how he communicated back to the  ADT.  He repeated back to the office what he understood them say during the conversation for clarity.  I am retired 30 years in the utility industry  in customer service.  I rarely hear or see such committed service to ensure the customer is taken care the first time.\n\nPlease thank Dakoda for me again!!!!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "108032616730463248098", "name": "MIKE COSBY", "time": 1558382905637, "rating": 5.0, "text": "Scott Chamblin was awesome! He was very Professional and on time. He made sure he answered all my questions and walked me through the ADT app, and made sure i had a full understanding of how you use my app. Thanks Scott!!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "102543843397394672565", "name": "Kyle Nichols", "time": 1559426884866, "rating": 5.0, "text": "Scott Chamblin was very helpful with our out of date system. Fixed us up with a new system and made our home protected. He was professional and personable. Overall, very pleased with our ADT service.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "111111360918290092058", "name": "Anthony Channell", "time": 1563539270753, "rating": 5.0, "text": "I have had my ADT system for 90 days.  My Security Specialist, David Jackson, regularly checks with me on my system to make sure everything is going well.  He is most courteous and anxious to make sure I love and understand my security system.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "118383871042527160593", "name": "Robert Marshaljr", "time": 1564796941297, "rating": 5.0, "text": "Joanthan Givens repaired my ADT Security system at 2452 County Road 112, Dothan, Al in a very professional matter.  He is a great person to work with  and makes sure your system working right.  He is very hard worker.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "116800409984556398479", "name": "Vic Harris", "time": 1561047349708, "rating": 5.0, "text": "David Jackson helped my mother Dr. Ella Bolling Harris, yesterday on June 19th 2019. My mother had been given the run around byanother representative in a different state and due to that was planning on leaving ADT. But thanks to Mr. Jackson's knowledge, personable attitude and professionalism my mother continues to be a customer and a deal was made that accommodated her needs.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "114964724235281021300", "name": "Cyndi Harrell", "time": 1562696761005, "rating": 5.0, "text": "Mr. Givens was an excellent ADT Tech. He answered all our question made sure we knew how to work the system. Great job", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "103592236348967611146", "name": "Stephen M. Wright", "time": 1553454220922, "rating": 5.0, "text": "Scott Shamblin was a total professional.  He explained the tasks completed and answered all my questions.  His professionalism was evident from the time he arrived until the job was complete. Kudos to him.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "108831394462764944954", "name": "Mary Evans", "time": 1557428704266, "rating": 5.0, "text": "David, sales representative, is personable and kind. Set us up for ADT and technicians sent did a great job!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "100021371062785215119", "name": "Ginger Hicks", "time": 1560293452421, "rating": 5.0, "text": "Jonathan Givens was very professional, knowledgeable and helpful to me.  He answered all my questions and was very nice", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "104626306103436017264", "name": "Lynn Hale", "time": 1552510364943, "rating": 5.0, "text": "David diagnosed the problem correctly, had the gear and hardware to fix it, and completed it without any fuss. Took the time to go over everything with me, and answered all my questions. Well done, David - Thank you", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "111075086510352649116", "name": "Mark K.", "time": 1563985208149, "rating": 2.0, "text": "I called ADT to request service/repair of 3 year old system, which was installed by ADT. Telephone Representative very helpful in setting up appt. She told me that there would be no charge for the service call as our monthly charge includes the warranty. Service appt. was for the next day - very quick in getting an appt. Service tech - Jonathon Givens - had to replace two door sensors. He then proceeded to tell my wife that our system was outdated and needed to be updated. He offered to update it for a $100 fee. My wife told him she would have to speak with me first before we agreed to anything resulting in a charge. Jonathon then asked my wife how long had we had our system. She told him three years in our current home and approximately seven years in our previous house (total of approximately ten years with ADT.)  He then said he'd go ahead and update our system for no charge, which he did. What was that about??  Offer to update the system for $100?  Would that be considered fleecing a client? And if he was going to update the system for $100, does he pocket the amount, since he updated the system anyway. Kind of \"sketch\" as the kids say these days.  I have not been impressed with ADT monitoring services in the past, and only continued service with them after the 2 year contract (at which time they were going to increase my monitoring price $10/month.) They agreed to keep it at the same rate as long as I agreed to another 2 years.  When the 2 years are over, I'm finished with ADT.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "112781402512861625953", "name": "Charles Hill", "time": 1560896187543, "rating": 5.0, "text": "ADT was here on time.  Tech ( Dakoda Blietz) was outstanding.  Very Polite, nice & professional young man.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "107476254934977971428", "name": "OLUSINA AKINDURO", "time": 1560023112026, "rating": 5.0, "text": "Jonathan Givens was very professional, courteous and did an exceptional job in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "106798747892668822121", "name": "Adnan Sabir", "time": 1607793168931, "rating": 1.0, "text": "Extremely dissatisfied.", "pics": null, "resp": {"time": 1607862328989, "text": "Yikes Adnan!- We're very sorry to learn of your unsatisfactory experience as an ADT family member! Please email our team directly at Alwaysthere@adt.com with more info in regard to your issue and the full address in which the services are located, so we may help you further. ~ Thank you"}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "108378543961214611521", "name": "Jay Williams", "time": 1541472952780, "rating": 1.0, "text": "I was an 11 year customer of ADT. I was excited to move to a new home and take ADT with me. Unfortunately my mom passed away the day before ADT was set to install. Even under all that pressure I remembered to call and cancel the install while I was out of town. I've been out of pocket for weeks trying to handle mom's business, grieve, and still live so I haven't had a chance to reschedule. ADT proceeded to still charge me two months of service at my old location even though they knew I had cancelled the service at my old house. When I caught it, the call center manager told me that they still bill you 30 days after you cancel. I asked about the other month and she said \"oh we prorated that and took it out of your installation fee.\" So I prepaid $100 for an install that I didn't get. And they took money out of my installation fee for two more months before I caught it. All this while they say sorry for your loss but...at least we gave you back the second month. So instead of $100 back I got about $50. Even during our time with them we were paying several months during one of their glitches and they weren't even monitoring my home.\n\nNo more ADT for me. EVER. And I'll let everyone I know not to get ADT. There are other options now.", "pics": null, "resp": {"time": 1541529605945, "text": "Hello Jay. Our condolences for your recent loss! We'd like to look into your concerns further to help. Could you please email us the phone number and address associated with your account to AlwaysThere@adt.com? Thank you. -Andrew"}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "109513736843071221838", "name": "Katie Roby", "time": 1558118059831, "rating": 5.0, "text": "Scott Chamblin updated my security system today. He did a fantastic job of installation and instructing on the usage of the updated technology", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "106983195951972019318", "name": "Michael Washington", "time": 1553081702383, "rating": 5.0, "text": "David was professional and helpful !", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "100694931449489644383", "name": "Alberta Giles", "time": 1542728105897, "rating": 5.0, "text": "Excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "100647945657002988611", "name": "Joann Wiggins", "time": 1623348841564, "rating": 5.0, "text": "Got my air and heat working great. To hot for no air.  Very nice gentleman. Thanks", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100481246216082589612", "name": "Nancy Owen", "time": 1508210728286, "rating": 5.0, "text": "All I can say is Autumn Air was professional, trustworthy, economical and exceeded all my expectations. There is nothing more aggravating than to have your air conditioning unit quit. Although it is mid-October we needed our air conditioning fixed ASAP. Our unit was 17 years old and I knew we needed to replace it if not immediately, within the very near future. I emailed a few companies Saturday night asking for estimates and to please contact me Monday morning. Only Autumn Air and one other company returned my call today. Autumn Air was very pleasant and offered to have someone come out to price the unit immediately. Since I knew I did not want to start throwing money away repairing such an old unit I asked for a quote for a new unit (with and without the furnace). Skip came out and priced the unit with three options and it was clear if I wanted more options he would give them to me. He did not acted putout or frustrated with my request. He did not pressure me to make a decision nor did he push me to buy the most expensive product. Without me asking, he let me know the specials that were being offered. I asked how soon they could install the unit and he said either this afternoon or in the morning. I called my husband and sent him the estimates. My husband was impressed and even showed his fellow employees who were also impressed with the prices. After weighing the pros and cons we decided to replace the entire unit (with furnace). I called Skip back about 2:30 saying we did want to go ahead and replace the unit, he said he would call me right back, that it would be either this afternoon or in the morning. I was floored when he called me back shortly afterwards and asked if it was okay with me if they could install it today. Skip and two other gentlemen came and installed the unit working hard until close to 9:00 pm. We were all extremely grateful to the diligence of these men. In addition, Autumn Air included a 2-year service plan where they will come out to service/clean the unit twice a year. They have earned my trust. I am very thankful to Autumn Air.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMSUL9QRFJSPykXqDzrNKpCip6nXxO_y7dxFY68=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN2RdAWKk5TI7OZtRl8wgn94aokdQNwgFcu2UXt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOEyoCn2esr-2rrYIf35lCntXDGlIln-damn4kj=w150-h150-k-no-p"]}], "resp": {"time": 1593532696719, "text": "Thank you!!!!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103401569640005628420", "name": "Raymond Gerard", "time": 1622583769528, "rating": 1.0, "text": "Well this guy trys telling us that we needed a WHOLE new unit when in actuality we need 1 part and to find where the freon is leaking. He says it's holding freon when I know for a FACT it's empty. He did not go into the crawl space of where part of the unit is located. This guy is trying to sell us something we don't need. Reason being,  our 18 yr.old son was the one home who doesn't know any better than to just let him in. Didn't talk to my wife or me about anything. Very unsatisfied with this company. We have 5 properties and while our normal ac guy was servicing our rentals(while we waited days for the first company you sent) looked at it and told us exactly what was wrong.... NOTHING MORE THAN REGULAR WEAR AND TEAR.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109506686763532008347", "name": "Tory Shannon", "time": 1616790769309, "rating": 1.0, "text": "Very unprofessional. When asked if I could get number to Corporate office, I was told no the general manager and customer service rep handles all complaints. Customer service only reached out AFTER she seen the review I left on their website. Before the review no one called to apologize or even keep us updated on when our new unit would be in. All this could of been avoided if they would simply offered a simple SORRY. But no one wants to take ownership of their actions. Then Hannah in customer service asked me to stop yelling at her while I was having a conversation , with phone on speaker, haven’t disrespected her nothing and she stops me to tell me stop yelling. Instead of trying to understand the message I’m trying to get her to understand , she is asking me to lower my tune when it wasn’t in a disrespectful manner and I told her that several times.  It’s not like they are doing us a favor, WE ARE PAYING CUSTOMERS. I would not recommend. Spread the word", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "117764367263681419355", "name": "John Hosmer", "time": 1505317915712, "rating": 5.0, "text": "For a long while there have been atmosphere issues in our basement where the previous home owners had never taken care of sealing up the rooms and keeping temps and humidity in check. We had addressed those issues and we had tried using good filters at the returns to prevent as much of any dust, mold spores, etc. from recirculating and spreading, but it ended up being a losing battle for both comfort and our family's health.  Finally, about a month ago I disconnected one of the flexpipes at the end of the trunk run to see just how bad it was and found almost 100% coverage of dust, mold, and nastiness throughout the system. It was in every bit of the trunk, and every flexpipe throughout the house (See pictures). Even a few of the vent registers had started harboring mold growth which was a really bad sign as well.\n\nSo, I did what any good panicking homeowner would do at that point. Went to Google, pulled up nearby HVAC companies with good reviews that could do duct replacement, and called for appointments for onsite inspections. Out of the four highly reviewed and reputable companies (minus individual contractors) in the Pelham area that actually showed up for their appointment, Autumn Air's rep Baker was the only one who showed up on time, actually visually inspected inside the ductwork even after I showed him the initial pictures I took, and then spent a solid amount of time explaining to me options for replacing the entire ductwork system so we could see about what would be right for our budget. In the end, the price that Autumn Air was able to provide for an upgrade to a new round smooth metal interior and outside insulated wrapped system, including new boots and registers, throughout the entire house, plus a new central AprilAire Space Guard filtration and iWave-R GPS ionization system upgrade (per my request) beat out the one other company who actually sent me a quote by almost half. Let me say that again differently...TWO of the four companies NEVER sent back a quote. This told me that two of the highly reputable companies in the Pelham area that have a high amount of favorable reviews simply did not want a job. Pitiful for them.\n\nFast forward to the install a week later...Led by two guys named Javy and Charles, they took care of making sure everything was treated with care when taking out the old ductwork so as to minimize spreading of dirt and mold as much as could be. Then, they proceeded to assemble and install all of the new system on site for custom fitting plus making sure all seams were taped properly and coated with mastic so that the chances of air leaks past the coils is forever kept at a minimum. They arrived early in the morning, and worked until the job was finished that evening (on the day of Harvey storms coming through too!).  Any questions I had concerning anything with the job was answered and explained with no hesitation on their part.  They went beyond expectations with accommodations and I just can't be any happier.\n\nI can't say it enough in this entire description here how great Autumn Air is for an HVAC company. They want someone's business in the best way because they give the work the best service they can at reasonable prices, and offer great financing options too if needed. They understand how to go the extra mile to make sure the customer is being taken care of in the end as well. I can say I have also had the pleasure of meeting Jeff, the owner, later when he came back to look at a minor issue that crept up post install, and he is just as awesome about discussing more than the \"here's what we'll do\". He takes the time to explain the why and how's (if you are interested to know and ask) and will work with you as a customer to do everything he can within reason to make sure you are satisfied with him and his company. Because of all of these things described about everyone at that company and how we were treated, we now not only have clean, sanitized fresh air, but the confidence to know it will stay that way due to the complete service and professionalism we got from Autumn Air.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMabAWy162GH96gyl3m37sUEbn3lZkhH_QMnw5p=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN_X0ScvBCZDov4a77tJ8--jNZxa4SLKPRwf7ZQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP2_SRCsbshQYMwunCW_Svt09o-TDruxZ8tozW8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOKpjJ6ZJSD3l76fC4DaZ5moDrfqENk5DrC3V5m=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPVryaFeSx9Ipmsmn5UNXwMOBC9HZqnM-6Io7MO=w150-h150-k-no-p"]}], "resp": {"time": 1593532681755, "text": "Thank you for sharing your review of our company!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113162987701025102692", "name": "Sunshyne", "time": 1623944314501, "rating": 5.0, "text": "He was on time, respectful, knowledgeable, - though nothing needed to be done at this time. He was great", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110730328967933181341", "name": "W. F. C.", "time": 1616104464426, "rating": 5.0, "text": "Chase is the best, very polite, knowledgeable and explains everything that he finds. Autumn Air is the only Company that will Ever service or replace my unit. Use them, they are honest and trustworthy!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103425132335858219412", "name": "Somer Moseley", "time": 1614285221470, "rating": 5.0, "text": "Chase was super knowledgeable and friendly. He came in completed his specific job task, informed me ways to ensure better quality air in the future by mentioning other services. Thanks for helping me out!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100533506413399443599", "name": "Randolph Pettway", "time": 1616688316435, "rating": 5.0, "text": "Autumn Air is always a pleasure to work with, and I have continued to trust them for years now. I highly recommend their services!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "107147218979368692212", "name": "Harry Daniel Lacey Sr.", "time": 1615490520506, "rating": 5.0, "text": "The Technician did a good job as best as I can tell. Very kind and conciderent and explained it all in a manner that I could understand.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110002014121439675641", "name": "Tony Russo", "time": 1610729473962, "rating": 5.0, "text": "I am extremely impressed with the service I received. My technician, Michael Bowers, was very professional, knowledgeable and personable! Michael took his time to answer all of my questions. I will definitely be using Autumn Air in the future for all of my HVAC needs!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102561326419733360511", "name": "Jim Evans", "time": 1615934985291, "rating": 5.0, "text": "Our upstairs HVAC began putting out 96 degree air when changing from Heat Mode to Cool Mode.   Ambient temp went as high as 96 degrees in our upstairs.   Nick Long was our service tech and we could not have been more pleased!   He quickly & efficiently checked out our entire heat pump system and accurately diagnosed the problem as a malfunctioning thermostat (Trane).   He is very nice and knowledgeable and is an asset to Autumn Air.   I will ask for him by name if I have any HVAC issues in the future.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113114829122449982754", "name": "Nicole Fenderson", "time": 1611692892690, "rating": 5.0, "text": "Mike is the best. Personalble and knowledgeable. Very friendly and never seems to amaze me. If I need service, Mike is who I will always call first!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "108685184292838776791", "name": "Jonathan Freeman", "time": 1615016408204, "rating": 5.0, "text": "Everyone at Autumn Air is extremely professional & always courteous. Pricing is ALWAYS fair, and the work they do is 1st rate...and they STAND BEHIND EVERY SINGLE JOB THEY DO!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "108398441528294797699", "name": "Emily Reach", "time": 1610734504987, "rating": 5.0, "text": "Autumn Air is quick and efficient, I’ve used them a few times now and am really pleased. Nick was very communicative and answered all of my questions!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102161020794102323718", "name": "Cole Betts", "time": 1610997771878, "rating": 5.0, "text": "Michael did a fantastic job, has a great personality and is very transparent with issues and how to repair them. I highly recommend Autumn Air and Mr. Bowers!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110575630665682997196", "name": "sean Peoples", "time": 1618438540382, "rating": 5.0, "text": "Did a great job. Very professional and informative.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109547182390159187729", "name": "kory Nicholas", "time": 1611011206637, "rating": 5.0, "text": "Michael bowers was on time, very professional, friendly, extremely helpful in explaining what was wrong, what we could do to fix it and very good at explaining the process in a way my wife and I could understand.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103384395127531396997", "name": "YVONNE DOUGLAS", "time": 1613754375752, "rating": 5.0, "text": "Technician was early, well informed and honest. Would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114159692413035258158", "name": "Mickey Turner", "time": 1619742270067, "rating": 5.0, "text": "Great folks who consistently do a good job.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113391602552456852453", "name": "carolyn mayfield", "time": 1594762716246, "rating": 5.0, "text": "They installed a hybrid unit for me about a year ago. It has been a fantastic system and has dramatically cut my utility bills. Today they performed a checkup on my unit and did a very thorough job. I trust this company to keep my system running smoothly and I can call them at any time with questions and they are always more than happy to help. Prices are fare also.", "pics": null, "resp": {"time": 1595602446936, "text": "Thank you for sharing your experience with our team!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "117807557896104808508", "name": "Jason Kelly", "time": 1591809242937, "rating": 5.0, "text": "Autumn Air has bailed me out of hot summers a couple of times now. Their whole team is very thorough and professional, and provide you with the best options available. I highly recommend using Autumn Air to anyone that asks me, and to some that don’t even know me! Great company!", "pics": null, "resp": {"time": 1593531082088, "text": "Awesome, Thank you for sharing your experience"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "107427457336929308856", "name": "Julio Duran", "time": 1618424342620, "rating": 5.0, "text": "Great quality work and very professional!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114618588369212031369", "name": "Phyllis Latham", "time": 1623957040596, "rating": 5.0, "text": "Very prompt, professional friendly", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110843563195835919953", "name": "James Hearon", "time": 1619803161967, "rating": 5.0, "text": "They showed up early and their tech Chase knocked it out in 20 minutes.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100120621459124845227", "name": "Robert Gardner", "time": 1592500331094, "rating": 5.0, "text": "Great customer service. Skip is the best of the litter! Knowledgeable, professional and trustworthy. Give him a raise!\n\nAlso, Jason came today for a quick repair. Very courteous and professional . Give him a raise too! Thanks to AA and Jason!", "pics": null, "resp": {"time": 1593531265613, "text": "Thanks you!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103054386620686500178", "name": "Debbie dale", "time": 1592925612024, "rating": 5.0, "text": "Charles did an excellent job. Found issue immediately and replaced the part at no charge as the previous tech missed it twice. He is on longer with the company. Prior service before the tech that missed the  issue was also great. That’s why I bought a new unit to replace mine if 15years.", "pics": null, "resp": {"time": 1593531230935, "text": "Thanks for sharing your experience!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113640397191517381282", "name": "Carol Gancayco", "time": 1592418429515, "rating": 5.0, "text": "Jason showed up earlier than original appointment which was great! He checked my A/C and checked other things to make sure whole system is at 100%. He discovered other things that could have caused the problem and it helped! All repair to be done is still under warranty but labor! Very satisfied with all the work Jason did...super satisfied!", "pics": null, "resp": {"time": 1593531289374, "text": "Thanks you for your review!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116518256012150633364", "name": "Virginia McNamee", "time": 1590784652880, "rating": 5.0, "text": "They have been absolutely incredible. Our tech was Skip Walker and he was so kind and informative. Usually finding out your unit needs to be replaced is a very stressful ordeal. But him and his boss were so nice and explained all possible choices. We laughed and talked and found a plan that will work for us. I will definitely be using them again for any and all my air needs and I would highly recommend them to anyone else who needs air work.", "pics": null, "resp": {"time": 1593531566695, "text": "Thank you for your experience!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114902317468347593965", "name": "Deana Raymond", "time": 1594744254356, "rating": 5.0, "text": "Skip did a remarkable job! Love that he was very thorough and explained everything in detail. Such a great guy! I will definitely be referring you to others!!!", "pics": null, "resp": {"time": 1595602607205, "text": "Thank you for the kind words.Skip will be happy to hear that you have shared the experience you had with his customer service! If you need anything else you let us know!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "106043305844210609872", "name": "Vicki Williams", "time": 1611353418301, "rating": 5.0, "text": "I received a call to inform me that Nick, the tech, was in route to my home. He arrived and entered with his mask on. He checked the fuse box and observed the smoke detectors. I was informed on what needed to be installed to meet  with the  code. He was very polite and knowledgeable.\n\nVicki Williams", "pics": null, "resp": {"time": 1593531619083, "text": "Thank you for the review!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112661279927520948883", "name": "Carolyn Cole", "time": 1589997476224, "rating": 5.0, "text": "Jason and the rest of the technician is very friendly, knowledgeable, also answer any questions. Autumn Air is the best air & heat company through out Alabama. I highly recommended them and any of their staff members.", "pics": null, "resp": {"time": 1593531641016, "text": "Thank you for being such a great customer!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105086827455922328401", "name": "Raymond Perkins", "time": 1594225149916, "rating": 5.0, "text": "Charles was very professional and did an awesome job fixing my unit. I will definitely use them again!", "pics": null, "resp": {"time": 1594650460641, "text": "Thank you for sharing your experience with us!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "107379191817136928937", "name": "Chandra Rodivich", "time": 1582682692917, "rating": 5.0, "text": "This is the second time I have used this company and I have been more than pleased both times!  They replaced one unit last March and my other unit today.  They are the most courteous and down to earth people.   Beyond helpful and efficient.", "pics": null, "resp": {"time": 1593532761721, "text": "Thank you!!!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "115897267392632269641", "name": "Chris Skipper", "time": 1588107493398, "rating": 5.0, "text": "Skip was my technician and nice and very informative and professional. I feel real comfortable and proud of using your service and recommend you to my fellow employees. Thanks\nChris Skipper", "pics": null, "resp": {"time": 1593532603727, "text": "Thank you for sharing your Experience!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "107983273760513076651", "name": "Carolyn Keeton", "time": 1624028088563, "rating": 5.0, "text": "Skip at Autumn Air came out today and did an excellent job! He is very professional and gave me free money saving advice. Autumn Air initially installed my system and ductwork. They have always done excellent work!", "pics": null, "resp": {"time": 1593531796779, "text": "Thank you for sharing your experience!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110701001869854636922", "name": "Kenneth Beavers", "time": 1612543303079, "rating": 5.0, "text": "Nick was very nice , respectful and professional!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112603866575261776033", "name": "Emily Dixon", "time": 1598282882722, "rating": 5.0, "text": "Great service! Great people that do their job on time and are super pet friendly!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109403182270109585505", "name": "Elizabeth Keener", "time": 1613841786386, "rating": 5.0, "text": "Our bathroom fan went kaput and it will be getting replaced! Thanks!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116605020743394734563", "name": "Sabrina Love", "time": 1591908619023, "rating": 5.0, "text": "Skip was nicely professional. I was totally pleased with his visit and his work on my AC. Thank you, Glenda", "pics": null, "resp": {"time": 1593531445637, "text": "Thank you!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111706703248644506608", "name": "Tiffany Kaydim", "time": 1587059707271, "rating": 5.0, "text": "We have had both our A/C units replaced and maintained by Autumn Air and we have been so pleased by their professionalism and friendliness. They also have very competitive pricing.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103756241247715732158", "name": "Guywithaguitar", "time": 1558376052604, "rating": 5.0, "text": "Could not be happier with the service we received from Autumn Air, they were honest and upfront with me from start to finish. Our salesman Corey was very insightful and upfront, our   techs Collin and Jesse did a great job and were very professional and treated the job as if they were installing it in there own home. The owner Jeff even came by a couple of time to make sure everything was going smoothly and that we were happy with what was going on. He even polished up the new ceiling cassette after the job was complete. I feel how reasonable and honest this company treated me was top notch and you can’t go  wrong using them!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102557518549272894558", "name": "Randy K", "time": 1592509302453, "rating": 5.0, "text": "Great company with fast and on time service. Very professional from customer service to their technician. Would recommend them for all your heat and air needs.", "pics": null, "resp": {"time": 1593531255302, "text": "Thank you for sharing your experience!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109321372411691062389", "name": "Amanda Doaty", "time": 1564511195408, "rating": 5.0, "text": "Called Autumn Air this morning and the technician Corey arrived earlier than promised. The service he provided was great!  Corey was pleasantly friendly, knowledgeable, professional, and respectful.  We felt like we’d known him all our lives.  He fixed the problem in no time at all and gave us options without making us feel pressured.  We were so pleased that we ended up signing up for the yearly maintenance plan on the spot which was a great value for the price.  Thanks Autumn and Corey!!!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111226289786748259078", "name": "Michelle Largen", "time": 1562891167157, "rating": 5.0, "text": "Autumn Air was able to send a technician, Corey,  to service our AC unit the same day. He was very thorough and quickly diagnosed our issue. Corey was knowledgeable and went over every detail to make sure we fully understood the problem and the cost for the repair. We are back up and running in a short amount of time. I highly recommend this company.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116920841655864280786", "name": "Rena Payne", "time": 1575348662178, "rating": 5.0, "text": "Edited 12/02/19: As of 12/02, we are still waiting for the final items to be installed. This is 6 weeks after the initial work was done. DO NOT call Autumn Air for services. This company was called 8 times today without an answer and switched over to a fax.  Original post; Corey and the team did a fantastic job making our repairs! Everyone was polite and professional.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100491656115628054150", "name": "Jason Junkins", "time": 1598282597495, "rating": 5.0, "text": "Had a problem with my HVAC and they jumped in and fixed it and held up their promise.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "106025301808347547497", "name": "Analyn Blair", "time": 1558661441476, "rating": 5.0, "text": "Autumn Air was FANTASTIC!!! They came out VERY quickly & gave us a free quote, which was less than several other companies we had come out. They were very professional & knowledgeable. We decided to go with them at 6pm one day & they replaced our AC the very next day! The owner was so pleasant to deal with-would recommend this company to anyone & everyone!!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105028044583035898335", "name": "Brian Shonesy", "time": 1592010709159, "rating": 1.0, "text": "My fault for using them twice but never again. First time was when we had our furnaces installed by them, one was leaking gas into our home because they didn’t install it correctly, the other one wasn’t wired properly and they had to come back out twice to fix it. Second time we had an AC unit replaced and the next day there was water pouring out of the unit all over the floor in our basement. So out of three units I’ve had 0 installed properly the first time, two of the times were catastrophes.", "pics": null, "resp": {"time": 1592229745448, "text": "Mr Shonesy,\n\nWe are extremely sorry for you experience with our company. To my knowledge we have rectified the situations immediately upon learning of your issues. Please let us know if there is anything else that we can do to serve you, or your family. Once again we are very sorry that this has been your experience with our company."}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "108363784288086336028", "name": "RA Litaker", "time": 1619119730426, "rating": 5.0, "text": "Outstanding service!!! Thank you!!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "108495573167216847918", "name": "Will Geiger", "time": 1573750550352, "rating": 5.0, "text": "There isn’t a single company in the Birmingham area that I would call before Autumn Air. They show up on the front end of the time frame that they tell you they’ll be there. They do a great job of diagnosing problems and clearly explaining any needed repair options and the costs involved. I can’t recommend them enough.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102326536040185999037", "name": "Timmonthy Griffin", "time": 1622833534423, "rating": 5.0, "text": "Nice respectable people\nDo what they say and keep informed of anything wrong. 👍🏼", "pics": null, "resp": {"time": 1595602421402, "text": "Thank you for your review"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "108431142599509439340", "name": "Karen Lee", "time": 1554822314474, "rating": 5.0, "text": "This company is outstanding! Very thorough and they take the time to explain everything in detail. They don't try to sell you things you don't need like the last company I used. Their first visit was for a second opinion and they didn't charge anything. Skip was our tech and he's great! Very resonably priced too. I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111290346752313238974", "name": "Randolph Pettway", "time": 1566526993041, "rating": 5.0, "text": "I had Autumn Air come out to my house today, and Corey was everything anyone would want in a representative of a company: knowledgeable, professional, friendly, and understanding of various circumstances. He is a very valuable asset to this company, and I would highly recommend him and Autumn Air to anyone needing inspections or work done to their HVAC unit. He laid out the full diagnosis in an understandable way, and my options were clear. I signed up for the maintenance plan on the spot with Corey, and I am looking forward to working with them in the future!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112288422199347983398", "name": "Dawn Stephenson", "time": 1554844760051, "rating": 5.0, "text": "We just had the unit replaced and Jesse did a great job. He was courteous, professional and we are very pleased. He left the area spotless and made sure I understood about the system before he left. Would recommend!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112804220111058408856", "name": "Pa", "time": 1564842250168, "rating": 5.0, "text": "Cory the technician, was polite, patient, and definitely an expert in HVAC systems!  Great company to work with. Fast, very efficient at my sons house in Helena. Staff at Autumn Air was professional, extremely knowledgeable,  very courteous. I highly recommend Autumn Air & Mr. Cory the technician!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100039228198717962753", "name": "Kalico Gecko", "time": 1574376824901, "rating": 5.0, "text": "Highly Recommended. I was impressed by their punctuality and professionalism. The job was done right the first time. They are our go to when it comes to Electrical work and Hvac. Thanks again!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116708209195288603287", "name": "josh wright", "time": 1561826514151, "rating": 5.0, "text": "Called on a Friday night at 7PM; they were out the next day at 10:30 as promised. Fixed the issue in less than a hour. I thought I was going to need to replace the entire unit since it was over 10 years old but they didn't try to upsell me on anything. He fixed the issue, explained the cost before he even got started and was one of the nicest people I have ever met. Thank you Autumn Air for your EXPERT service and AMAZING customer service! HIGHLY Recommend!!!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "115977777642550027826", "name": "Angela Segars", "time": 1591714436490, "rating": 5.0, "text": "Great customer service. Kind and caring people.", "pics": null, "resp": {"time": 1593531530392, "text": "Thank you for sharing your experience!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113705940308669449120", "name": "Tanya Brown", "time": 1587504891779, "rating": 5.0, "text": "Jason was extremely professional and knowledgeable. I would definitely recommend them and call them again.", "pics": null, "resp": {"time": 1593532632688, "text": "Thank you very much!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113733355024893947453", "name": "Linda Bartlett", "time": 1538908331382, "rating": 5.0, "text": "All my expectations were exceeded by this company. Richard was extremely polite & offered options with no pressure. They arrived right on time. Jesse & Colin were professional, knowledgeable & worked diligently assuring me they would not leave until the job was complete. They were there til almost 9:00 on a Friday night. Exceptional service. Won’t use anyone else for future AC & Heating.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105190172877643297295", "name": "Thomas Lyles", "time": 1595981182686, "rating": 5.0, "text": "Nick's service was timely to avoid probable other problems.  Professional work ethic and result.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "106141364701292346280", "name": "Scott Burnett", "time": 1615829028574, "rating": 5.0, "text": "Skip is the best! Never tries to upsell you!", "pics": null, "resp": {"time": 1593531385003, "text": "Thank you!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101696011925553841660", "name": "Virginia Wimberley", "time": 1590174915433, "rating": 5.0, "text": "Jason is a great air conditioning technician and does great thorough job.", "pics": null, "resp": {"time": 1593531605388, "text": "Thank you for sharing your Experience"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105162284388289528033", "name": "Steve Callahan", "time": 1561083641767, "rating": 5.0, "text": "Wow ! Just found this company 1  day ago . They are awesome. Corey is a rock star !! He came out and spent a lot of time going over all the details when diagnosing my AC and thermostat which got waxed by a lightning storm 2 nights ago. Not knowing much at all about electrical and AC, he had every opportunity to \"create\" broken parts , etc. Nope,  not Corey and Autumn Air. I arm impressed with their work, knowledge, professionalism and honesty. Prices are most fair and they come out when they say they will come out.  Thanks to Corey, we now have AC again less than 36 hours after going down. Oh, and their preventive maintenance plan? Heck, you better jump  all over that, $10 a month auto draft to come out 4x yearly and clean and do PM check is unbeatable. Then when you join, no diagnostic charges when you  call them out, but wait, there's more ! You get a discount on all service  after you sign up !\nReally, $120 a year for the PM plan  ?? i thought he misquoted so I jumped on it but its for real ! Great service, great guy. You rock Corey ! They get 6 stars from me, not 5 .", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "104435242701371483903", "name": "j c", "time": 1546815757344, "rating": 5.0, "text": "Our heat pump died on us and our daughter called. Baker came out and gave us an estimate he was extremely helpful and gave us an extremely\ngood price.The next morning on Saturday Colin and Jesse came out and\ninstalled the new system, both were extremely polite did a very good job\nand even put a cover back on a panel that was not part of the system.\nThey also cleaned up completely. We are very pleased and happy to\nrecommend Autumn Heating and Air to anyone.\n\nir to anyone.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112237714381551895570", "name": "Brian DiRusso", "time": 1546557096423, "rating": 5.0, "text": "Fast, excellent service by knowledgeable people. My heat pump died and I called Autumn Air. They replaced it at a very fair price before the end of the day. Jesse and Colin installed the system and did a neat and thorough job.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "117809989337415255978", "name": "Bob P", "time": 1564003083030, "rating": 5.0, "text": "Corey did a great job! He assessed my unit and made a recommendation based on the condition of the part instead of going for the sale! Loving Autumn so far!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "117809989337415255978", "name": "Bob P", "time": 1564003083030, "rating": 5.0, "text": "Corey did a great job! He assessed my unit and made a recommendation based on the condition of the part instead of going for the sale! Loving Autumn so far!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111191500555175086005", "name": "Tony Bruno", "time": 1538171438464, "rating": 5.0, "text": "Javier, Collin, and Jesse did a great job. Had my new ac unit and water heater installed within a few hours of signing proposal. The new unit is quiet and seems to be of good quality. I would highly recommend Autumn Heating and Cooling to friends and family.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102215771277802367740", "name": "Erin Richardson", "time": 1562957856424, "rating": 5.0, "text": "Great experience with Corey from Autumn Air! He was very thorough in explaining the issues with our machine and spent the time needed to figure out what was wrong. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113104230959085533376", "name": "Jonathan Berry", "time": 1548120133406, "rating": 5.0, "text": "My elderly mother's heat went KaPut on her the other day. She didn't know what to do. I found this Autumn Air company local to her and gave them a ring. This feller named John Orange came out and fixed her heat pump jiffy quick like. He even took the time to compliment her on her fantastic sweet tea and fresh homemade bagels. Thanks guys.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114624028536945268351", "name": "Cheryl Cornelius", "time": 1560264798204, "rating": 5.0, "text": "I had Corey to come out and he was wonderful! Friendly, knowledgeable, very nice young man. I highly recommend this company.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "117196753277352681637", "name": "John Merriman", "time": 1548109767616, "rating": 5.0, "text": "Called with completely dead central air system, and weather headed below freezing. Mr. John Orange gave me a few tips on what to check, and was able to restore system. Saved me a bunch of money, didn't ask for a dime. Will definitely call next time I need service.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112741700873326303531", "name": "Shea Monroe", "time": 1533519865887, "rating": 5.0, "text": "Very professional service and very friendly service. Came out the SAME day and installed a BRAND NEW UNIT for less than we were quoted locally. Jeff and his team do an AMAZING JOB, would highly recommend to anyone in Alabama", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114117559407792423802", "name": "Robert Radice", "time": 1531058348954, "rating": 5.0, "text": "Called for service.  Casey was great and gave me same day appointment.  Charles, the professional who serviced my AC, arrived early and finished in an hour.  Great service by Charles, great attitude by Charles and a very reasonable price.  No doubt I will recommend Autumn Air!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114890766535244651729", "name": "Luke Cox", "time": 1555105685444, "rating": 5.0, "text": "Had Jessie come out today and give my AC unit a good spring cleaning!  He did a great job and I will be using Autumn Air for all my future heating and cooling system needs!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116284625515351441910", "name": "Robert Darling", "time": 1551719587171, "rating": 5.0, "text": "03-04-19.  Worked everything out on discount for new AC unit as their goodwill gesture from something in the past.  Jesse and Colin their service techs did a great job with removal of the old 10 seer unit putting in a new shiny Amana 14 seer unit.  While here Charles replaced blower motor on furnace that was giving an issue.  Great company!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112741700873326303531", "name": "Shea Monroe", "time": 1533519865887, "rating": 5.0, "text": "Very professional service and very friendly service. Came out the SAME day and installed a BRAND NEW UNIT for less than we were quoted locally. Jeff and his team do an AMAZING JOB, would highly recommend to anyone in Alabama", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "115148435656681996048", "name": "Alyce White", "time": 1597422040928, "rating": 5.0, "text": "Very thorough, knowledgeable, it shows he cares about his customers and is not just trying to sell a product. Can’t say enough about Autumn Air!!!", "pics": null, "resp": {"time": 1593532507617, "text": "Thank you for your kind words, and your review!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113672382212353983993", "name": "Debra Birchfield", "time": 1587586270934, "rating": 5.0, "text": "Tech was very thorough and explained everything to me.", "pics": null, "resp": {"time": 1593532620502, "text": "Thank you!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110228227924185488884", "name": "Brian Miller", "time": 1558836350695, "rating": 5.0, "text": "These folks really know what they're doing. How can I say that? Science and logic. Cory, the tech dispatched to our house, was top notch. Personable, thorough, and intelligent. He took the time to answer all my questions and was happy to discuss refrigeration cycles and psychrometrics in technical detail. I even learned a thing or two!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "108119197838129195172", "name": "Stanley Mink", "time": 1548172720129, "rating": 5.0, "text": "I call Autumn Air for all my heating and air needs I take care of several properties and they heave always been professional and gotten our tenants up and running. Call and ask for Casey and he can take care of you.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114117559407792423802", "name": "Robert Radice", "time": 1531058348954, "rating": 5.0, "text": "Called for service.  Casey was great and gave me same day appointment.  Charles, the professional who serviced my AC, arrived early and finished in an hour.  Great service by Charles, great attitude by Charles and a very reasonable price.  No doubt I will recommend Autumn Air!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114895349834457342453", "name": "Chris Glaze", "time": 1554230677793, "rating": 5.0, "text": "I can’t recommend Autumn Air enough. The guys were very professional and did a great job on our install. I would definitely recommend them to anybody needing heating and air work and will be using them again if any issues ever come up.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "104805819854497959953", "name": "harrykat 0ne", "time": 1532983969388, "rating": 5.0, "text": "A great experience from a very good company. I picked Autumn due to their high ratings when I googled them, and was not disappointed. A/C went out late Friday evening and called about 6pm, very friendly salesperson set up call for Saturday morning...needed a new compressor, so the owner got his supplier to open his warehouse and picked up the new compressor himself. A top notch installation crew met him at my house and they had everything done, cleaned up and cold air flowing by Saturday afternoon! Would highly recommend this company, great service especially on a hot weekend!  Jeff R, Ballantrae", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103018758182628438247", "name": "David Campbell", "time": 1582647476813, "rating": 5.0, "text": "They were great. They did a great job.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "117548018755012137008", "name": "Allison Coggin", "time": 1558642255995, "rating": 5.0, "text": "Highly recommend! Corey was my technician and he was so knowledgeable and did great work! I will always use this company!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112788418577795117047", "name": "Jonathan Smith", "time": 1548168817065, "rating": 5.0, "text": "Jessie and Collin are very professional and knowledgeable. I would highly recommend asking for them to do your service! You guys are AWESOME!!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116279014701009247631", "name": "Victoria Woods", "time": 1548168219251, "rating": 5.0, "text": "Jessie and Collin are very professional and  knowledgeable. I would highly recommend asking for them to do your service!  You guys are AWESOME!!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102264312963762140030", "name": "Dwight Tuggle II", "time": 1563024447117, "rating": 5.0, "text": "Autumn Air is an amazing company to use if you're having a/c problems. Corey was my technician, and he was friendly, knowledgeable, on time, and explained what my a/c problems. I would highly recommend using Autumn Air.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116751019085368863532", "name": "Brandon Tisdale", "time": 1537557593803, "rating": 5.0, "text": "I have used this company for AC needs in Birmingham and at Lake Martin. They sent a repairman down to Lake Martin on a day’s notice just to repair my unit..they do great work and can be trusted. They also cleaned up their job site prior to leaving. Nothing negative to say and would definitely recommend for any heating or cooling needs..in Birmingham and at the lake!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110272785520915971841", "name": "Bryan Pope", "time": 1503757633988, "rating": 5.0, "text": "So thankful for Jeff and his team. So professional, helpful, informative, and efficient. We called the night our air conditioner went out, Jeff came that night to offer options and quotes, then they arrived and installed the very next morning. They had the air on by lunch and completed modifications by dinner. Jeff considered our concerns and needs, then offered multiple options to meet both. Leaps and bounds above the competition. They made sure everything was properly set up and running as efficiently as possible before leaving. They even cleaned up after themselves. I highly recommend, especially if you have an out of date unit and and want to reduce your power bill. Fresh, Clean, Crisp Air all thanks to Jeff and his team.\n\nDescription of work:\nHeat Pump and Air Handler Replacement - increased from 4ton unit to 5ton unit - duct work modifications to accommodate increase. Original construction of our home, 12 years ago, was  rushed and the a/c and duct work was thrown together quickly and in a sloppy manner. Our duct work was constricting air flow and in need of modifications. Our power bill was astronomical. So we called Autumn Air.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116375683304923776054", "name": "Max Levi", "time": 1511898129933, "rating": 5.0, "text": "Autumn Air (Charles in particular), have been absolutely incredible!  My existing furnace kept cutting off in the mornings, but then it ran fine for most of the day.  It was a difficult thing to track down, and they never quit troubleshooting to get to the root of the issue so they could fix it the right way.\n\nThis took several trips, they tried several things, one at a time, to narrow it down.  Instead of changing a bunch of things or applying \"band-aids\", they worked hard to pinpoint the true issue.  It ended up being a piece of metal (limit) that was popping and shutting it off prematurely (before the heat limit actually occurred).  So a tiny faulty limit had to be found, and they found it.\n\nIt took a lot of patience and tedious work at times.  They just had the attitude of \"I'll find the root cause no matter what it takes, and I won't stop until I find and fix it.\"  I truly believe others would have given up or chalked it up to an issue with my new thermostat.\n\nI really appreciate the time and effort that was put into troubleshooting, not giving up, and finding the real issue, and fixing it the right way!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100520966996309775722", "name": "Deidre Stone", "time": 1501341069103, "rating": 5.0, "text": "We built our house just 3 Summers ago. During that 3 years it seems like either 1 unit or the other was in a struggle and the builder's installer was at my house at least every 6 months. It just never did heat or cool correctly and ran what seemed like constantly. You can imagine my frustration in a new home. This spring we called Autumn Air. They came right out and checked everything. They even went into the attic and found an issue with a clogged drain. (which the other guys never did) The air has been so cold all Summer that we can't set it under 74 without getting a chill and my power bill is HALF of what it has been in the past! Here we are 4 months later and my technician, Baker, gives me a courtesy call to just see how things are going since the service. I can't say enough good about these guys! Affordable, professional, and quick! I won t call or recommend  anyone but Autumn Air going forward!!Thanks for taking the stress out of my Summer!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114188369110825370019", "name": "Jamie Russi", "time": 1561738480868, "rating": 5.0, "text": "Very well pleased with autumn air and the service technician Jason was outstanding and very trustworthy!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113958667329379467599", "name": "Benjamin L", "time": 1525439349734, "rating": 5.0, "text": "Great Customer service and very fast installation. Called them to come service my AC unit and it was determined it was time to replace. They had it installed and working great that same afternoon. They are very good at what they do.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109546278756591612918", "name": "Jerrad Brooks", "time": 1554326303901, "rating": 5.0, "text": "Awesome and efficient service. Highly recommended. Corey was awesome, courteous, and professional.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101030663773875407706", "name": "LaShonda Burr", "time": 1552353295568, "rating": 5.0, "text": "I love this company!!! My dog was choking and this man stopped work on my heat pump and saved him! Thank the good lord for autumn air for saving my dog and installing my new heat pump! I want to tell the world!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "118437196139932817972", "name": "Jeanmarie McLemore", "time": 1589401329567, "rating": 5.0, "text": "Skip came to my home and repaired my a/c in one trip, had parts and equipment needed for the job.", "pics": null, "resp": {"time": 1593532473486, "text": "Thank you for your review!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "117879435719519621690", "name": "Michael Hull", "time": 1534122787647, "rating": 5.0, "text": "Great company with great leadership. Honest fair price with the most professional service. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101063794845626508126", "name": "Leroy Varner", "time": 1548108114337, "rating": 5.0, "text": "Jesse at autumn air is the best most respectful tech I have ever seen. Highly recommend this company", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112288604134238077576", "name": "Joe Waller", "time": 1510073452576, "rating": 5.0, "text": "If you need help with a broken AC like I did, call Autumn heating and cooling. Great company dealing with HVAC installs and repairs. Friendly, professional service at a good price. Thanks!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100252893685993779623", "name": "don't fuck w/my shit kat", "time": 1510031543658, "rating": 5.0, "text": "Autumn Air Heating & Cooling,\nAre very professional, coutisus, & respectful. They arrive on time and they work extremely efficiently, they had to come inside my home once or twice. They knocked each time to get permission but other than that I didn't even know they were working inside my home unlike other companies that I've done business with in the past.\nThen when it come time to explain my new digital thermostat, my installer explained how to program & work the thermostat. Then he walked me through step by step, having me doing the programming, which made it so much easier to learn & understand.\nI couldn't be more happier with my experience with Autumn Air Heating & Cooling, I'll never use another heating & cooling company ever again. And since the moment they left I've been telling everyone I know about Autumn Air Heating & Cooling, and I plan to continue to tell as many people as I can about, how great Autumn Air is.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100420289009299089025", "name": "jeremy shepherd", "time": 1562794351187, "rating": 5.0, "text": "They were great came out and fixed my unit same day.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116567772930354561213", "name": "Laura Edwards", "time": 1499627856656, "rating": 1.0, "text": "We were charged $625 for work that didn't solve the problem for which we called. After multiple attempts they continually didn't solve the problem despite overpaying for services we didn't need. They have refused to refund any money and offered insulting proposals.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114389590910567860951", "name": "Jordan Kinard", "time": 1510098673038, "rating": 5.0, "text": "I had my A/C unit replaced by Baker Orange and the guys at Autumn Air Heating and Cooling. They were very professional and completed the job in a timely manner. I highly recommend Baker for any heating and cooling job.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110986212795698008924", "name": "Tammy Fitzpatrick", "time": 1541515284243, "rating": 5.0, "text": "Looking for great professional service. Look no further call Autumn Air today. Very please with their work. On time clean and organized. And experience is a plus. They are looking to expand to Millbrook , Prattvillle and Montgomery. Call them today for your Heating and Air conditioning needs.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116720391855917823716", "name": "jerry bailey", "time": 1537974116011, "rating": 5.0, "text": "Jesse and Colin did great job.  Gave free furnace check.   New flue looks great.    Will call again", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100525699462639505126", "name": "Matt Zartuche", "time": 1510072340061, "rating": 5.0, "text": "Great service! The folks are super friendly and they have very good pricing. They made us a priority and didnt push us off till the next day even though it was late. Super professional and I would recommend them to anyone in need of service.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105006786104892154583", "name": "Hank Powers", "time": 1508515490964, "rating": 5.0, "text": "I highly recommend Jeff Franklin and his team! Good pricing, GREAT service and 100% professional. Thank you for taking such good care of us.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101595782316904029128", "name": "Ryan H", "time": 1567449281755, "rating": 5.0, "text": "Ac went out on Labor Day. Autumn air was at my house within 30 mins of placing the service call and Cory had me back up and running within the hour. Amazing service and super nice people to do business with. Thank you!!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111897549068658941741", "name": "Wanda Short", "time": 1548172313349, "rating": 5.0, "text": "Called Autumn Air and spoke with Casey and he got some one out to my home quick and got my heat back running.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102856811430667952176", "name": "Cyndi Johnson", "time": 1504735100271, "rating": 5.0, "text": "Charles Alexander came to clean & inspect our AC & heating systems. He was punctual, very professional, knowledgeable, and courteous. I highly recommend this company and will be using their services in the future.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "118178402987989382465", "name": "Woody Armstrong", "time": 1511880140824, "rating": 5.0, "text": "I have been with a different local HVAC company for the past 4 years. I had been content with them and their service until I had a repair. I had a capacitor go out and I was charged over $300 to replace it. I didn't think much about it until I shared my story with a few people who know what they are talking about. Turns out it was a steep price! I lost TRUST and confidence with them for work. I heard Autumn advertising on WDJC and thought I would check them out. Their monthly maintenance program is very reasonably priced and I even quizzed them on how much a capacitor replacement would run...much more reasonable! So I made the switch and scheduled my first maintenance visit...next day I might add and not in 6 weeks like the other. I was once again shocked at how bad my other service companies quality of work was for maintenance as Charlie showed me all of the stuff that wasn't being done! So, I am very happy I made the switch and hopeful that I have a company I can trust!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112967518708912016715", "name": "Steven Harris", "time": 1563819216569, "rating": 5.0, "text": "Corey was our technician and he was great! Got us fixed in no time.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "118306722754339770519", "name": "Jesse Deloney", "time": 1536846761836, "rating": 5.0, "text": "It's a great work place and the work we do is outstanding if anyone needs a new a.c. or anything serviced y'all won't regret it at all give us a call", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114385542479519258526", "name": "JD Chainsaw", "time": 1527211599996, "rating": 5.0, "text": "Autumn Air Pelham staff were all extremely courteous and professional.  They arrived early and answered all our questions.  AC they recommended works great and they installed it quickly, just in time for a hot AL summer.  Great people.  If you're anywhere in Bham use these guys!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "117171866839634721722", "name": "Jayda Shafer", "time": 1537810199530, "rating": 5.0, "text": "Jesse and Colin did a fantastic job! Quick, curteous, and cleaned up quickly! Will definitely be using them again!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "108391917073431941023", "name": "Mike Brunetti", "time": 1530910464941, "rating": 5.0, "text": "Quick service and exactly what the problem was after I explained what happened.\nFriendly and quick to repair - even cane earlier than scheduled", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "107399572662075931564", "name": "MadcityStudios and PacilloWild", "time": 1510070475983, "rating": 5.0, "text": "Great family owned business.  Saved me about $120 dollars a month with the new unit installed.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112451417478434948884", "name": "Benjamin Wildman", "time": 1552965009128, "rating": 5.0, "text": "Thanks to collin and jesse for the install.  Everything looks good, friendly, helpful, and cleaned up after themselves. Time will tell how quality the install was.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109910395971090812768", "name": "Chris Watts", "time": 1534433073880, "rating": 5.0, "text": "Jesse and Charles did a fantastic job and stayed late to make sure I had air conditioning before they left and they cleaned up very good and god it done in a orderly fashion I would highly recommend autumn air", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105198682712639553074", "name": "Joel White", "time": 1595457023658, "rating": 5.0, "text": "Very courteous and professional", "pics": null, "resp": {"time": 1595602403234, "text": "Thank you!"}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "115461121364613262538", "name": "Lee McCarty", "time": 1469153449402, "rating": 5.0, "text": "Our air conditioner decided to break down late Friday night, so I found myself in the position of trying to find someone to come out on Saturday to fix it. After calling numerous other companies that were in my area, each time just being told they had no available service time except later in the week, (none of them even asked exactly what the unit was doing, or what was wrong). I found Autumn Air online, and even though they weren't in my area, I figured I had nothing to lose trying them. My call was answered professionally, and he took my info and told me that they were pretty full for the day, but that they would try to fit me in. He asked me for details on what was wrong. After about 10 minutes, he called me back saying that they had a cancellation and a tech could be. at the house in about an hour. An hour later the tech was here and within 30 minutes we had cool air!!! I want to thank Autumn Air for taking the time to talk to me and for fitting me into their busy schedule on such a hot Saturday. The price was VERY reasonable, especially considering that it was a Saturday in the busy Summer season. I would recommend this company to everyone I know!", "pics": null, "resp": {"time": 1469300580118, "text": "Lee thanks so much for the recommendation.  Please let us know if we can help you in the future."}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102472723042847874856", "name": "Alex Symonds", "time": 1510341984344, "rating": 5.0, "text": "What a fantastic service from start to finish! They made the whole process so easy. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116818064743500135921", "name": "Brad (MrAdventure89)", "time": 1558124068520, "rating": 5.0, "text": "Corry was great! Very transparent and helpful!!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111976200416729627755", "name": "David Thebigguy", "time": 1510084056386, "rating": 5.0, "text": "Great guys, great work. Honest and straightforward.  Another company said I needed a new compressor, John and his crew found a minor problem, and fixed my existing unit.  They were conscientious of my personal space. They were clean, well mannered. And not at all judgemental. I will definitely be a repeat customer if I need any HVAC work in the future.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101518584955887691180", "name": "Darlene Franklin", "time": 1464451551823, "rating": 5.0, "text": "Awesome company! reliable and honest!  Nice people to do business with.  Would recommend!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103629218486334923927", "name": "Polly Oneal", "time": 1539803377413, "rating": 5.0, "text": "Polite, prompt. Thank you for such a great job!!! Great communication!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110115573415183766979", "name": "Justin Moore", "time": 1510083311085, "rating": 5.0, "text": "John is a big strong man who knows his HVAC and does good work! Definitely recommend them.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102858653165732446529", "name": "ashley mccarty", "time": 1532381732180, "rating": 5.0, "text": "Autumn air are friendly and great people! Cant beat Autumn Air prices! Thanks Guys!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100624183962005477146", "name": "Lisa Cahela", "time": 1510086357068, "rating": 5.0, "text": "Baker Orange is very professional and highly skilled. I definitely recommend him and Autumn Air for any A/C and heating needs.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109784538526059509211", "name": "pete files", "time": 1530735012398, "rating": 5.0, "text": "Techs are very thorough and answer all my questions. Great prices", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102131249923942309585", "name": "Fred Cross", "time": 1464187167626, "rating": 5.0, "text": "It’s hard to find a service company you can trust, and when you do you want to let others know! Autumn Air Heating and Cooling of Pelham Alabama is a company you can trust to arrive on time, do the work right the first time, charge a reasonable price and not try to sell you something you don’t need.  My wife and I have recommended them to all our friends and family.  We would not use anyone else!!", "pics": null, "resp": {"time": 1464262467217, "text": "Fred thank you for your business, please let us know if we can help you out again."}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111860706399687589229", "name": "Jonathan Ray", "time": 1510296457991, "rating": 5.0, "text": "The best HVAC company around...and I’ve had to use several different ones over the years. So glad to have found Autumn Air.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102448096004942461313", "name": "William Burch", "time": 1469503004954, "rating": 5.0, "text": "The absolute best experience I've ever had with a heating and air company hands down. They were on time, extremely knowledgeable , and had the best price of the three quotes I got. When installing my equipment they were quick without the loss of quality workmanship. This Amana equipment is the quietest ac I've ever heard, and my house is cooler than it has ever been due to their focus on air flow. Without Autumn Air I would have spent more money on lesser equipment. They are a wonderful group of guys that can make you happy  just by doing their job. Looks like I'm going to have to take them deep sea fishing on my boat real soon because I still feel like I should owe them something extra for a job well done. Keep up the good work guys!!!!", "pics": null, "resp": {"time": 1469701719024, "text": "William thanks for being such a good customer, please let us know if we can help you out with any of your heating and air needs in the future."}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113824937279567605277", "name": "Derrick Defoor", "time": 1510080147087, "rating": 5.0, "text": "Great work at great prices. Professionally ran business and I will use them again.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102718257279127607467", "name": "William Carlton", "time": 1510027191715, "rating": 5.0, "text": "Installed my system two years ago. Great company to work with. Very professional.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101651340216399204594", "name": "Fun Fidgets And Toys", "time": 1530406333966, "rating": 5.0, "text": "Awesome prices quick to answer any questions and get the job done right the first time.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105393348306687452042", "name": "Dan Rogers", "time": 1510103545523, "rating": 5.0, "text": "Very professional, fast service and very knowledgeable. Plus he's a bit of eye candy.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109313898868877781439", "name": "Vikki Grodner", "time": 1551677211444, "rating": 5.0, "text": "Always quick to respond, reasonable and hard working", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "117680239016305752665", "name": "daniel ortega", "time": 1510112020225, "rating": 5.0, "text": "Super professional, very reliable and great pricing!! Service guys were very respectful and helpful and it was a great first time experience!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100167017797865903774", "name": "Training", "time": 1554331196010, "rating": 1.0, "text": "The most misinformed, mismanaged business I have ever dealt with. If you have unlimited time and a gullible ear, this place is for you. Fool me once, shame on you; fool me twice...never again! Save your time and your sanity, choose someone else.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109250225149120538485", "name": "spiral out keep going", "time": 1530406120398, "rating": 5.0, "text": "They have awesome prices and are very quick to get things done.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101920081161297320890", "name": "jb", "time": 1471283639320, "rating": 5.0, "text": "The Autumn Air specialist was on time, courteous, and knowledgeable.  I would highly recommend this company!", "pics": null, "resp": {"time": 1471284624798, "text": "Thanks for letting us know, we really appreciate your business.  Let us know if we can help in any of your heat and air needs in the future."}, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102066023796612612944", "name": "Ryan Carr", "time": 1531875830018, "rating": 5.0, "text": "Jesse, Javi, and Colin did a great job and got the job done quickly. Great company!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "107791395701616844824", "name": "patrick hyatt", "time": 1510070374600, "rating": 5.0, "text": "Friendly, knowledgeable and a no nonsense approach to repairing our system. Thank you.\n\nSincerely,\nPatrick", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111000664038507744596", "name": "Lila Love", "time": 1530850839711, "rating": 5.0, "text": "Awesome company honest people best prices around and great technicians.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105692188664609044783", "name": "Amy Mansell", "time": 1510101069716, "rating": 5.0, "text": "Ahh-mazing company! Very professional and great at what they do! I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112582794471331261046", "name": "Erin Olivia", "time": 1548107223446, "rating": 5.0, "text": "Very friendly staff and great work. Thank you Baker Orange!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112313344070345813674", "name": "Ronnie Aldrich", "time": 1510168215941, "rating": 5.0, "text": "Dependable, honest and do what they say they will do.  I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101723803963117757805", "name": "Sandra Mays", "time": 1530735616399, "rating": 5.0, "text": "Unbeatable prices and all of my questions were answered.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111069873407952342824", "name": "Keith Bates", "time": 1563224794755, "rating": 5.0, "text": "Prompt! Courteous! Affordable!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103708172616100717808", "name": "Josh Sasser", "time": 1510077426168, "rating": 5.0, "text": "Great company. John was helpful in resolving my A/C issues and was persistent in finding the problem.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114668563718108993918", "name": "Barbara Jackson", "time": 1504711510075, "rating": 5.0, "text": "Thank you for the very informative service.  We learned something very important about our heating unit that needs attention before cold weather is here.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109743695222806516621", "name": "Virginia Crawford", "time": 1487355865268, "rating": 5.0, "text": "Great experience! Friendly and professional and great value!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110867211508870012096", "name": "Kristi Kinard", "time": 1501090420503, "rating": 5.0, "text": "Amazing service! Super quick to have repairs completed! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109743695222806516621", "name": "Virginia Crawford", "time": 1487355865268, "rating": 5.0, "text": "Great experience! Friendly and professional and great value!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102450548500126610366", "name": "Samantha Sams", "time": 1548173589982, "rating": 5.0, "text": "My heat went out, and I called and spoke with Casey. He got a tech out to fix my heat quick.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103362678538109683628", "name": "debra perry", "time": 1620244342278, "rating": 5.0, "text": "Nick was Awesome. Great job.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100592353513098366069", "name": "Brittany Day", "time": 1510162608147, "rating": 5.0, "text": "Jeff and his team are the best! They have done a great job for everyone I have talked to, and they are the only ones I trust to come to my house.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "112639984367843769359", "name": "Serenity Mays", "time": 1530460712438, "rating": 5.0, "text": "Awesome service answered all my questions", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "110023066720912830661", "name": "amanda stephens", "time": 1510191870381, "rating": 5.0, "text": "Highly recommend this company - amazing employees .", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102626244933016082531", "name": "Will Eaton", "time": 1510084964078, "rating": 5.0, "text": "Great people, great service, quality products", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116320296543595768595", "name": "Kyle Morgan", "time": 1510079472614, "rating": 5.0, "text": "Great service! Defiantly recommend!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101217092177140535570", "name": "Ray Thompson", "time": 1548112888031, "rating": 5.0, "text": "heat stopped working and i was out of town working...friend told me to call John orange and I'm glad i did turned out to be a bad thermostat and he took care of it quickly so my kiddos had heat while i was so far from home...thanks again John!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114357373615491629573", "name": "Shukeedria Mclin", "time": 1510071088941, "rating": 5.0, "text": "Awesome Customer Service and Quality Work.....", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "101217092177140535570", "name": "Ray Thompson", "time": 1548112888031, "rating": 5.0, "text": "heat stopped working and i was out of town working...friend told me to call John orange and I'm glad i did turned out to be a bad thermostat and he took care of it quickly so my kiddos had heat while i was so far from home...thanks again John!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "109294538302316588906", "name": "Khali Pegues", "time": 1510186982707, "rating": 5.0, "text": "Great shop, great work, and better business!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "114145757039327224826", "name": "Ramey Akerman", "time": 1510104998954, "rating": 5.0, "text": "Very professional and reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100909525615382186151", "name": "Joseph Cater", "time": 1530735536482, "rating": 5.0, "text": "Awesome people and great prices", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "107142640019315733917", "name": "Michael Damsky", "time": 1614024381696, "rating": 5.0, "text": "Professional", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111752797277201356504", "name": "Cheryl Stevens", "time": 1548177158440, "rating": 5.0, "text": "I called last week when my heat went out in the middle of the night. I talked to Casey and told him my issue and he got a dispatched a technician and they got my heat working for me. Thanks for everything.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113700947581853710266", "name": "Craig Cosper", "time": 1510338338604, "rating": 5.0, "text": "Very thorough service.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105289101991491726318", "name": "Michael Stewart", "time": 1510072750825, "rating": 5.0, "text": "Great family business.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "115889425150488751002", "name": "Riley Carroll", "time": 1530850955351, "rating": 5.0, "text": "Good honest workers and prices", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "100786131223871409377", "name": "Marc Wendorf", "time": 1541649552572, "rating": 5.0, "text": "Good people to work with", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "106585216560761685800", "name": "Skylo Bones", "time": 1530465274437, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105740150225271206576", "name": "jonna franklin", "time": 1535130167657, "rating": 5.0, "text": "love this company", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "104300002733378250971", "name": "Hunter Files", "time": 1530734725716, "rating": 5.0, "text": "Great prices!", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116890901819497206165", "name": "Sarah Posey", "time": 1530465435986, "rating": 5.0, "text": "Awesome business", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "111808122049063317706", "name": "Sonya Mays", "time": 1530465209589, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "116476266576241868633", "name": "I dont knoww", "time": 1530241783128, "rating": 5.0, "text": "great staff", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "113700947581853710266", "name": "Craig Cosper", "time": 1510338338604, "rating": 5.0, "text": "Very thorough service.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "103045002817864560781", "name": "Johnny Holley", "time": 1510105700697, "rating": 5.0, "text": "Stand up company.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "118125066236925089957", "name": "justin pattillo", "time": 1510082195744, "rating": 5.0, "text": "Professional, on time, and trustworthy.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "102728788011595288870", "name": "Zach Burchfield", "time": 1510070697130, "rating": 5.0, "text": "Great company", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "115889425150488751002", "name": "Riley Carroll", "time": 1530850955351, "rating": 5.0, "text": "Good honest workers and prices", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "105289101991491726318", "name": "Michael Stewart", "time": 1510072750825, "rating": 5.0, "text": "Great family business.", "pics": null, "resp": null, "gmap_id": "0x888924e52224bd39:0x2e611205e661f050"}
{"user_id": "115249260438557101933", "name": "Allison Phillips", "time": 1580852912193, "rating": 5.0, "text": "Sometimes you need an honest answer about what you think you need and what you actually can have. Andy Evans was totally honest with us about this very idea. He didn't try to up sale us but instead he educated us about what was realistic and a more practical approach with our project. Really refreshing and well received. Thank you Andy!!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "116751464109888572228", "name": "Darrel Arnold", "time": 1580859361514, "rating": 5.0, "text": "AVX is a great company with excellent customer service. Any issues that you might have would be addressed promptly and in a timely manner. I would highly recommend using them. They do what they say they are going.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "104053829378433359763", "name": "Lynn Ray", "time": 1580996883469, "rating": 5.0, "text": "Brenda does an excellent job of working with her clients to make sure that everything meets their requests, their expectations and that they are completely satisfied with the work. of the AVX technicians.  She is available to take your call and cheerfully makes sure it is exactly what you ordered.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "110257042736645519063", "name": "Alex Casey", "time": 1580874858379, "rating": 5.0, "text": "Andy Evans is a man of his word. It shows in his work ethic. He and his team are very honest with their clients. Highly recommend AVX for all audio and visual projects!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "110933419211731821061", "name": "Guy Rosenstiel DMD", "time": 1580906713015, "rating": 5.0, "text": "Thank you for an excellent system with fabulous sound! And Andy Evans coordinated a team that was fast, clean and friendly! Could have had a better experience!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "105767417209614742420", "name": "Rab Stewart", "time": 1574287527369, "rating": 5.0, "text": "Andy Evans and the crew at AVX are the best in the business. They are extremely knowledgeable when it comes to AV. They have helped me in both my home and office. I can't thank these people enough for giving me top notch service and products.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "101140300628780553552", "name": "Bryant Miles", "time": 1581538787218, "rating": 5.0, "text": "Working on projects Andy Evans and his team at AVX has been outstanding. They are very professional, know the market better than any other company we have worked with and are very upfront on the scope of the project. I can't say enough good things about him and his team.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "107908422285805830817", "name": "Josh Smitherins", "time": 1574710023214, "rating": 5.0, "text": "I dealt with Beau while searching for a pair of JBL Synthesis speakers.  We didn't end up making a deal, only because the speaker I was looking for was a closeout and they didn't have any in stock, but he contacted the manufacturer twice to find out information for me.  Great customer service.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "114396426399822584072", "name": "Joe Daniel", "time": 1580921002286, "rating": 5.0, "text": "Great advice, great products, awesome and timely service.  Will definitely continue working with Andy and the folks at AVX.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "100125509814179742954", "name": "Hank Spencer", "time": 1580855533156, "rating": 5.0, "text": "Andy Evans and the crew at AVX are the best in the business. They are extremely knowledgeable when it comes to AV", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "102084078621205624586", "name": "Kimberly Arnwine", "time": 1580872420066, "rating": 5.0, "text": "If you want to work with someone awesome, Contact Andy. He will take care your needs!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "105335899150915787817", "name": "Howard Whatley", "time": 1580854773826, "rating": 5.0, "text": "Excellent Company, Excellent service.  Andy Evans is first class all the way", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "102633105624105290593", "name": "Brice Jackson", "time": 1580910668596, "rating": 5.0, "text": "I’ve know the leadership at AVX for a long time! Quility team, quality experience!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "109714369762860128484", "name": "Britton Eveland", "time": 1580850273536, "rating": 5.0, "text": "The team at AVX are knowledgeable, and professional in the service they provides my family, I would recommend them to friends and family!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "109924224506168108751", "name": "Ryan Mays Young", "time": 1518220323117, "rating": 5.0, "text": "This friendly group of people delivers the best audio and video experience in Alabama. Not only do they install high-quality equipment but they make it look amazing. If you're looking to upgrade your house this is the way to go.", "pics": null, "resp": {"time": 1519247636643, "text": "Thank you Ryan! Please let us know if you need anything further!"}, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "101301489770735942522", "name": "Wes Cline", "time": 1580855608129, "rating": 4.0, "text": "Andy Evan's and his team are passionate about customer service.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "107873574863274697927", "name": "phil white", "time": 1446143218399, "rating": 5.0, "text": "Dan worked at our home and awesome.  Very knowledgeable,courteous and professional.\n\nWe had some minor issues after installation was complete that were quickly taken care of.\n\nDan will be the first person I call when I need this type of service again.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "115650444634794719679", "name": "James Kerr", "time": 1580852066501, "rating": 5.0, "text": "Andrew Evans is a true professional.  I trust him and AVX will all of my AV needs.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "105441075203208225875", "name": "Harvey Trueblood", "time": 1580851511024, "rating": 5.0, "text": "Andy is always on top of his game with all of his customers all the time. Would never hesitate to use him and his services or refer him and his team .", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "112903902272691164009", "name": "austin johnson", "time": 1580850562586, "rating": 5.0, "text": "Extremely knowledgeable  and can do any job", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "105788749855785766504", "name": "Michael Joffrion", "time": 1542964206932, "rating": 5.0, "text": "AVX has come through od=enc aa=gain with my specia reweuet. I recenty came down with the very serious case of upgradeitis; Bo Lamar, of their first salesman listened patiently to what I WANTED and got back t o my in a few days of with 3 plans. The Caddy Plan The GMC Plan and The Honda plan for caatch strapped fella and strella couple. Bo knew my personal listendng habits, so he had no problem with findig a few spakers o fit my needs. Several week past and we went throught pairs or loudspeaers: REeve, and Focal. While undert warranty of coursel.\n\nI hahad  helped creat the new line s pw,, it' ;ike athe  cash show at ther moment. B%. W's Nuatilus 802'a for nearly 20 years and thy outperform pretty mudh efvery speaker rhat was been put against it.Imto;u recemt;u.. Kurt got a little bit crazy souding ad it\n\nAmuwau, I think the jJet hae a distinctive of the gams arpmg on what out us I feel like we appropriate  They took athe bades to actually check the ad,\n\nSo,given,r test and speakers + suboofers, what are you thourhgts compared to Billie Joel?\n\nOve rthe weekend, I am being met wit h the worden about this issue.  aim setting 804'sin order and going to give top them 804's om a jhabisuas\n\nThanks for Yout Time Sirl,", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "116891609575461291674", "name": "ralph quinn", "time": 1483465769108, "rating": 1.0, "text": "Great folks if you never have an equipment issue.  Apparently they really aren't intrerested in retaining you as a customer after the sale is made.I'm in the process of looking for a different company who will stand behind their product line. Do not let them sell you any Integra equipment.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "100452914277292530367", "name": "Ivy Stokes", "time": 1440945254646, "rating": 5.0, "text": "Had a good install with no major issues.  I like the Sonos system AVX installed better than the Control4 system I used to have.  I would use them again.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "100234670222462545800", "name": "David Gibson", "time": 1472418665788, "rating": 5.0, "text": "These guys are at the top of their game for new technology and cool solutions for home and work!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "100497151587034212548", "name": "Kevin Barber", "time": 1580849987344, "rating": 5.0, "text": "Great company to work with.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "113290823247246074100", "name": "dave Chapman", "time": 1506542136677, "rating": 5.0, "text": "Quality product and excellent service", "pics": null, "resp": {"time": 1507057416368, "text": "Thank you so much! Let us know if we can help you any further."}, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "107013176019786573708", "name": "Jack Belew", "time": 1421810122343, "rating": 1.0, "text": "Absolute rip off. Paid 5x what my neighbor paid for a system that has twice the issues.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
