{"user_id": "112326536404329635585", "name": "Megan Rogers", "time": 1630163917369, "rating": 1.0, "text": "If I could give them zero stars, I would. We bought a house in Camden Lake last year. First time being under an HOA. I’m still trying to figure out what I pay over $300 a year for? There’s no playground, no “hangout” area, half of the street lights don’t even work, and the “lake” doesn’t have a sidewalk to go around it for safely walking. They are definitely pocketing money from everyone. They have all kinds of rules that you must follow but yet offer nothing enticing to even care to follow the rules. The board members, what a joke! Plenty of people are moving out and we are one of them! No surprise their ratings are awful! Good riddance!", "pics": null, "resp": {"time": 1630332102642, "text": "We are sorry you do not like the benefits of living in a covenant protected community. The covenants were written when the neighborhood was developed, and are now a requirement by most municipalities before they will allow a new development. We did not write them, but they do create a fiduciary responsibility for the Board to make sure they are enforced, which is one of the tasks that we are hired to do.  It is the Buyers responsibility to obtain a copy of the covenants for a neighborhood and to understand them before purchasing.  The Realtor typically provides these to the Buyer.  Once we are made aware of the purchase and the new owners contact information, we send a welcome packet in the mail that includes the covenants.  We also provide an Owner Portal that has all of the Association documents for owner to access.  Spaces is not \"pocketing money from everyone\".  Spaces is paid a set Management Fee by the Association to handle all of the management and administrative tasks for the Association to operate.  This includes paying all Association bills, working with and overseeing vendors, answering Owner, Realtor, lender, and closing attorney questions, creating financials statements, reconciling the bank accounts, administering quarterly and annual meetings, etc.  The annual budget is set by the Board of Directors and is then presented to all Owners to vote to ratify at the Annual Members Meeting.  Spaces then operates the Association within that budget for the year.  Spaces provides regular financial statements to the Board, and approved financial statements are available to all Owners.  We understand that some people do not value the benefits of having restrictive covenants and a managed community, but most people do. For those who do not want restrictive covenants where they live, we recommend looking for homes located in the county or finding a neighborhood that does not have restrictive covenants."}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "115083624120656234959", "name": "Clay Williams", "time": 1628812493471, "rating": 1.0, "text": "Seems as if the turnover is too high here within the management staff. I was talking with Heather about purchasing a place a few weeks ago, only to find out she wasn't there anymore when I called today with my final decision. She was very knowledgeable about everything with the process and had me at ease with my decision to buy. I'll keep looking, thanks for letting the bright spot in the office get away.", "pics": null, "resp": {"time": 1628883959324, "text": "We have a great team of managers at our corporate office and on-site at our communities that have been team members for many years and provide excellent service.  The goal of everyone at Spaces is to provide a great customer experience, and beautiful communities for all of our residents to enjoy.  We constantly work to improve and have the right people in the right positions to deliver on this goal."}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "101943777121202868830", "name": "LaMesha Hale", "time": 1630078810389, "rating": 1.0, "text": "If I can give a negative star I would. This is the absolute worst HOA in the world!!! If you purchase a home & Spaces are over the HOA, RUN THE OTHER WAY!!! We have been here about 10 years & after they took over it has been HORRIBLE!! We cannot wait to sale our home to get away. The neighborhood is Maxwell Manor.", "pics": null, "resp": {"time": 1630332786636, "text": "We are sorry you do not like the benefits of living in a covenant protected community.  The covenants were written when the neighborhood was developed, and are now a requirement by most municipalities before they will allow a new development.  We did not write them, but they do create a fiduciary responsibility for the Board to make sure they are enforced, which is what we are hired to do.  We cannot speak to how the Association was operated previously, but a primary reason we are hired is to provide covenant enforcement for Associations.  If someone is considering purchasing a home in an Association we manage, they can expect an Association that operates within the budget set by the Board of Directors and ratified by the Members.  They can also expect the restrictive covenants to be enforced in a fair and compassionate way.  We always send a friendly letter for each first time violation to make the owner aware of the covenant violation and provide a timeframe to correct the violation.  This friendly letter results in 95 percent of the violations being corrected.  In the cases where the violation is not corrected, we do have a set policy that is equally enforced to bring the property into compliance.  The majority of violation letters we send are a result of a neighbor reporting the violation to us for enforcement.  By having a set system, it allows neighbors to be neighbors without having to get into demanding compliance with restrictive covenants.  We facilitate that process for the Board and neighbors.  We understand that some people do not value the benefits of having restrictive covenants, but most people do.  For those who do not want restrictive covenants where they live, we recommend looking for homes located in the county or finding a neighborhood that does not have restrictive covenants."}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "115426992376195615735", "name": "Cathrine Barnett", "time": 1628193107680, "rating": 5.0, "text": "Great staff, great service. The managers are super helpful and professional.", "pics": null, "resp": {"time": 1628250765767, "text": "Thank you Cathrine!"}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "105496119223877078019", "name": "Kristine Fitts", "time": 1614790289904, "rating": 5.0, "text": "I first hand know what an outstanding company Spaces Management is. I have had two children graduate from The University of Alabama and while attending school in Tuscaloosa they lived in several of the properties they manage. Excellent communication, quality maintenance department and super smooth and easy move-ins. I highly recommend any of their properties.", "pics": null, "resp": {"time": 1614875470935, "text": "We are thrilled that you had a great experience!  Thanks for the great review!"}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "117804121655117573900", "name": "Matt S", "time": 1609370135877, "rating": 1.0, "text": "Our neighborhood found out they were coming here. Everyone except (appointed, not elected board members) casted a vote to deny them the opportunity to manage anything.\nThis company is corrupt along with the people who planned this surprise HOA", "pics": null, "resp": {"time": 1609428798763, "text": "Matt, We have very recently been hired by the HOA Board to assist in managing the needs of the homeowners in the neighborhood but there has not been a meeting nor a vote by the membership for anything related to HOA business so I am unsure how you can adequately review our services at this time.  We look forward to meeting you at the upcoming neighborhood meeting where we are sure we can answer any questions related to the homeowners association.  If you have an immediate need please feel free to call us."}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "110049348933103863664", "name": "Travis McAtee", "time": 1578606411155, "rating": 5.0, "text": "I rented a condo/apartment through Spaces Management and the whole process was smooth and handled quickly. Specifically, Pamela and Faith were very helpful with all of my questions, quick to get everything looked over and returned to me, and have made me very confident in the management team of Midtown. I have dealt with some bad management teams in the past and am super grateful that this is not the case here!", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "112590960648656610045", "name": "Jennifer Bryant", "time": 1596583915563, "rating": 1.0, "text": "The WORST property management company ever. I pay $115 a month in HOA for absolutely nothing. I have dead trees falling on my property that are past my property line. But spaces management is telling me its my responsibility to cut down a tree that's behind the fence of my townhouse. Then when they call & tell you that & leave a number if you have any questions they don't even leave a number that is theirs. If at all cost avoid this company.", "pics": null, "resp": {"time": 1596655243611, "text": "Ms. Bryant, As a new homeowner, I encourage you to attend neighborhood meetings as soon as we are able to have them again, due to COVID, to meet your Board members and discuss any concerns with them.  As we discussed previously, this item needs further review from the Board.  If you were not given a budget for the HOA, I will be glad to send you one that shows where the funds are spent- which includes mowing the lawn and insurance on the buildings.   We provided the budget as well as the covenants and restrictions to the closing attorney to include in your closing packet."}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "106674111650316057356", "name": "Kristina Hales", "time": 1601734128076, "rating": 3.0, "text": "Twyla is awesome they have been very helpful with dealing with repairs. Never had a problem in our 3rd year! Though I love TWYLA... Spaces has reached out to solve problems - as with all contracts keep your \"receipts\" and constant communication is key --- Five Oaks is still very old and the owner not SPACES refuses to repair it. Probably will be a tear down soon just like everything around UA.", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "110655302643324782913", "name": "Amanda", "time": 1567032949910, "rating": 1.0, "text": "I will NEVER own another home under this management . They will give you a notice for any and everything possible. They do NOT address real issues within subdivisions. Please do your research before purchasing a home under their management!", "pics": null, "resp": {"time": 1567183997872, "text": "We are sorry to hear that you have had a less than 5 star experience with Spaces managing your HOA.  We assist the Board with all the issues possible with the HOA.  I'm not sure what you are referring to, but there are some outside the HOA jurisdiction, such as parking and road maintenance, that are ongoing problems.  Please reach out to us or a board member directly with your particular issue and see if it has been addressed."}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "117644622120504447751", "name": "Eman Smith", "time": 1586904096102, "rating": 1.0, "text": "If I could give this housing authority zero stars I would. They are unprofessional, don’t abide by the HOA bylaws and don’t hold to their promises of the amenities in the newer subdivisions. People in my community are unhappy about the lies that were told by Brock Corder. We have a nice neighborhood but low quality management. HOA Fees go up every year without warning. It’s just RIDICULOUS", "pics": null, "resp": {"time": 1596655892295, "text": "Eman, there are several different issues that should be addressed separately in this review.  We are not affiliated with the Builder, however we have always found this company to go above and beyond in the neighborhoods they develop and homes that they build.  I cannot find a homeowner in our system by your name so I am unable to determine what neighborhood you live in to further address your issues.  If you would contact me personally at reception@spacesmanagement.com I will be glad to discuss them with you further.  If you do not have a copy of the HOA budget I will be glad to provide you one as well."}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "117602472194568613809", "name": "Michella Carter", "time": 1541538183039, "rating": 1.0, "text": "I have never written a bad complaint about anyone in my life.But this was a lesson.Please be aware that these condos are individually owned by different people and managed by spaces management.If something goes wrong ,you report to a third party that has to get in touch with the owner before the issue is handled.Which determines how fast your situation is handled and the proper up keep of the apartment determines your owner financial stability.They will do everything in their power to not give you your deposit back.I have never in life had a deposit deferred for any reason.Its not enough money to sue but it’s my hard working money.Just be careful.", "pics": null, "resp": {"time": 1541688667521, "text": "Hi Michella, Thank you for taking the time to provide feedback. Spaces Management is a third party manager for the individually owned units at Midtown. Our goal is to provide the upmost customer service and respond in a timely manner to all requests. All units are inspected and photographed prior to move in to document the condition of the unit before occupancy. A second inspection is conducted during the residents tenancy to document the condition of the unit in preparation for the upcoming move out. The final and third inspection/walk through takes place to document the condition of the unit once the resident has vacated the unit. The security deposit is refunded less any damages, financial or physical property damages, to the forwarding address on file within 60-days of the lease end date. If you would like to speak about this further, please feel free to contact me at 205-342-3220. Best, Midtown Village Condominium Manager"}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "107322472735776669873", "name": "Krystina Adams", "time": 1540242385250, "rating": 1.0, "text": "If I could give them a 0 I would. They manage our neighborhood HOA and we literally pay almost $200 A YEAR for nothing. We FINALLY get a playground and it is a joke. No benches to sit on no trees around it. No pool. The front entrance road has been crappy and half finished for at least a year now probably longer. All they do is ride around and nit pick to fine you  then send you pictures of the minute things they consider not attractive. Hello... the unfinished road is unattractive. I cannot wait to move out of this neighborhood and get away from these”Nazi’s”.", "pics": null, "resp": {"time": 1540829567777, "text": "Krystina, Thank you for taking the time to voice your concerns.  The Board is diligent in keeping dues as low as possible while maintaining the common areas and adding improvements to the neighborhood as funds allow. Most recently the improvements included additional lighting and security cameras. The Board has also addressed the condition of the roads with the City and they have promised they will be repaired very soon.  This has been an ongoing issue with the original developer and the City of Northport and the Board has been communicating with them continuously regarding the conditions.    Spaces works with the Board to make sure that the neighborhood is the best that it can be.  Should you ever receive communication from us that you are unsure about, please do not hesitate to reach out to us so that we can help address the situation."}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "110455985110557678003", "name": "Melissa Spencer", "time": 1526788034436, "rating": 1.0, "text": "Unethical company. We lived at Traditions Condominiums from February 2016 to February 2017. We were told in December 2016 that we have to sign a lease for fall 2017-2018. If we did not sign it by the end of December, they would start showing the apartment in January. Not sure what we wanted to do, we signed the lease. The apartment was small, no light, smelled horrible from old carpet as well as being a family with 2 teenagers, we were cramped and decided to look for a house to rent until we were ready to build. We found someone to take over the current lease as well as the next years lease. They were not subleasing, rather they were signing a new lease. Spaces Management charged us a fee for breaking the lease as well as a fee for each month. We tried finding this in the contract that we signed and did not find anything. When we called them about it, they told us that we had to submit it all in writing in email format. Even though we had an attorney, they threatened us to pay the fees or they would reassign the tenants that we found to a different apartment and not rent our apartment out. We would be financially responsible each month until our contract ended on their term. Just be careful who you rent with.", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "103434683503367700814", "name": "Arrow Xia", "time": 1571113985387, "rating": 1.0, "text": "One star for the never answered phone call and email. Whenever I was in town or moved out and tried to call them, they never pick up the phone!!! I moved out of town in July then received a bill in September, with a service that I never used. I tried to call several times, never get answered. I also emailed, no answer as well. They are doing a fair job at maintenance.\nAnother thing that happened when I moved out was all the UHauls were gone during that week, so I asked the main office if I could have a grace period for one day. The premise for me to ask this was my roommate is still leasing the apartment, and she has not found the new roommate yet. I assumed, if she agrees, then I should be good. I went to talk to the main office, the front desk told me to talk to the office at the Midtown apartment. I went there, the lady rejected my proposal and said they will have vendors checking my room right on the day I moved out and through my stuff out even if I have my roommate's permission to place them in the living room. So, I ran crazy for that week looking for moving trucks and finally moved out on time (actually two days in advance). I returned the keys and everything to the main office and told my story. Another lady, seems like the manager or some management-level person told me a totally different answer. She said if my roommate is keeping renting the apartment and agree to let me put my stuff in there, I could have the grace period!!! This is nuts! I was so upset for that day but decided to not give a bad review on Google review. This time, I really cannot. It is not about money, it is their attitude.\n\nUpdated\n\nAround an hour than I left the one star review, they responded and someone finally answered the call. The answer I got for the charge is because of the wreath we had on the door🙄️so I told them that is not trash, that is what we used to place outside as decoration. Since my roommate is still living in there, it should not count as something I left not as trash. The new manager of the office said she had no other answer for my question other than I have to pay the “reasonable” charge. Oh, the most incredible thing for this management company is they will change the detail of the lease without notifying. Since I am moving out of the town and my roommate will stay, she renewed the lease. When we started to lease the apartment, we get told that we are only leasing our own room (we were paired up by the management company), which means we do not have to lease the whole apartment if we cannot find a roommate. After two years of leasing, our contract have never changed. However, they changed it this year without any notification, and my roommate did not look through carefully so she rent the whole apartment. This is the reason why I thought I should be ok to leave my stuff in the apartment with my roommate’s permission. Based on my roommate’s feedback, their maintainance worked as well as the office does. It took them over a month to get the sink fixed.", "pics": null, "resp": {"time": 1569606837169, "text": "We are sorry that you did not have a good move-out experience.  You can call our office at 205-750-2260 and we will be glad to assist you with any questions you have in regard to your security deposit statement.  The answer you received to move out by the end of your lease term was correct.  The unit has to be inspected and room made ready for the next resident.  It is not up to your past roommate to allow you to store your items in the common area that the new resident will also be using.  We understand that the move-out time is very hectic as a large number of residents move out at the same time each year.  We cannot allow residents to keep their items in a unit past the term of their lease as we have to have it ready for the new resident."}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "102007508364287952683", "name": "Scout Gage", "time": 1502750591439, "rating": 5.0, "text": "Super helpful! The guy that help me put up my tv was super nice and extremely helpful! And he actually saved me over $100 by recommending something other than what I already had in terms of how to put up my tv. His suggestion worked even better than my original plan and saved me a lot of money. Highly recommend! Great service, super helpful, very nice.", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "117824288826637829210", "name": "Wayne Parker", "time": 1508945876112, "rating": 5.0, "text": "Great management company. Everyone was very helpful and always professional. I was helped at every step of the process. I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "104251199614807026056", "name": "Malaysia Ford", "time": 1500307837789, "rating": 5.0, "text": "I am a future resident of The Nine at Tuscaloosa owned by Spaces Management. Spaces has done a great job with the leasing staff at this property, they are super friendly and extrememly professional/knowledgeable. I am so excited to be apart of this community.", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "108771737108170687983", "name": "Brenan Hester", "time": 1557870852894, "rating": 1.0, "text": "Have been in a Neighborhood since 2014 and done everything according to the original HOA. Spaces takes over it in 2019 and now I have violations that have never been before! Also there are different HOA for different sections of this 1 neighborhood! Absolutely a joke as my 2 violations are a new , Christmas gift, Basketball goal and my garbage can beside my garage!! Seriously nearly every home in America has this and they are saying it’s devaluing a neighborhood! Would give them a 0 if possible and just to note their not BB accredited!", "pics": null, "resp": {"time": 1557873507040, "text": "Mr. Hester, As we have discussed, Spaces does not make the rules or create the covenants, we are hired to assist the Board or Developer in managing the neighborhood which includes collecting the dues, paying the bills and enforcing the covenants as they are recorded in the Probate office.    Although we are not BBB accredited we do have an A+ rating.  Thank you for taking the time to give us your feedback."}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "100984095720987770519", "name": "Danielle Festino", "time": 1565315087767, "rating": 1.0, "text": "Day 2 of no air conditioning. Put in a maintenance order yesterday. Then called 3 times today. Tomorrow will be day 3 of no sleep because of 80+ degree apartment.", "pics": null, "resp": {"time": 1565355523813, "text": "We are very sorry for We are checking into this with our vendor.  It was assigned to them shortly after you made the request.  A lot of vendors are backed up because of all of the apartment turns throughout town.  We are following up with the vendor this morning.  Again we apologize for the delay."}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "107815655644444302231", "name": "R Entsmingr", "time": 1523661520056, "rating": 1.0, "text": "Andy and Spaces Management take no responsibility for Two Maids and NOT the highest rated and reviewed Trainwreck.  The maids are awful and Andy's latest errand girl does nothing to help resolve my complaint.\n\nDon't go near this company.  They falsely advertise and send you lazy maids that smoke more then clean. Andy Turner and Spaces Management, I'm calling you out.\n\nIf anybody has had a bad experience with two sad maids like I have post your complaints on spaces management.  Also call spaces management and don't hang up until you get hold of Andy.  ;)", "pics": null, "resp": {"time": 1524577522693, "text": "We apologize if you did not have a positive experience with Two Maids and a Mop, but it is a separate company from Spaces Management.  Spaces Management strives to provide excellent customer service.  We reached out to the Manager of Two Maids and a Mop, and they do not have a record of R Entsmingr as a customer.  The manager reinforced that they have a \"pay for performance plan\" and if a customer is not satisfied, they return to address any areas that are unsatisfactory to the customer at no additional charge.  After looking into this issue further, both Spaces and Two Maids are working with Google to address what appears to be fake accounts created under the names of R Entsminger and Laura Smith as neither person has ever been customers of Spaces or Two Maids.  If either R or Laura would like to meet with the owner of Spaces to discuss their issue, he is glad to meet with them.  To schedule a meeting simply email reception@spacesmanagement.com with a few dates and times and a meeting will be set to resolve any issues."}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "109691303711006343573", "name": "Nicholas Ellis", "time": 1516736618221, "rating": 2.0, "text": "The properties are nice and well maintained, but management is rude and mostly unresponsive. The company uses predatory business practices to relentlessly gouge university students. These practices are unethical, and I cannot recommend anyone to do business here. Another thing to note: as I have scrolled through the reviews for Spaces Management here, I have noticed a few 5 star reviews from people that I know to be Spaces employees. So, they are artificially inflating their rating.", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "106384320349847072175", "name": "Get Hauled", "time": 1508384251008, "rating": 5.0, "text": "The best property management company in the business. Highly recommended. A+", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "116163200803977665116", "name": "Carolyn Roberson", "time": 1474936461413, "rating": 1.0, "text": "I can't rate a zero but I would if I could. River point apartments are horrible. Bugs are everywhere and I don't mean a few, it is CRAWLING. We've begged for pest control to no avail.\n\nWhen my son first moved in a downstairs unit the bathroom had worms coming up from the shower drain. And he went ALL winter with NO heat. They kept saying the heater was fine. So he moved upstairs and the new tenant downstairs left because of that every reason.\n\nUpstairs the AC never worked. It was always hot and water leaked continually out of that unit. He kept a gallon pickle jar under it to catch the water and emptied it daily. Maintenance \"fixed it\" (haha) but it never worked.\n\nThe bathroom sink NEVER drained correctly and even backed up with fecal material. He constantly poured drain cleaner down it. And management NEVER did anything about it.\n\nRoaches were crawling everywhere, in the fridge, from the ceiling where some wall was tearing away. Gnawing through food wrappers. It was disgusting. Colonies were behind the fire extinguisher. He left a month early because he was staying sick.\n\nThe owner showed the unit to a potential buyer and my son told him about the bugs and it embarrassed him in front of the potential buyer.\n\nNow they are billing him for a BRAND NEW AC and NEW BATHROOM SINK. and want him to pay for the damage maintenance did changing out a ceiling fan.  $3000.00!!!!\n\nStay VERY FAR AWAY from Spaces Management and River Point Apts!!!", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "111557186423720210254", "name": "Meredith Simmons", "time": 1508944589765, "rating": 5.0, "text": "Spaces management is great to work with! They care about each individual tenant, and want you to have the best experience while living in their properties!", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "109357758764120677477", "name": "Kristen Osborne", "time": 1515604496907, "rating": 5.0, "text": "The people are fantastic and will go above and beyond to help you any way they can!", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "106758895459527241722", "name": "Eric Levitt", "time": 1469152758566, "rating": 1.0, "text": "Let me tell you about my experience with these guys. My daughter is renting and overpaying for her unit at the UofA off campus. Her AC has had problems before but none like this. Keep in mind this is a brand new renovated apartment that we rented. When the AC unit again had a problem we were told, sorry it cant be fixed as the unit is out of warranty and we need Matt to okay the repair. Well at 830 at night there is nobody to sign off on the service with the temperature in the apt now at 82 boiling degrees. We had to move her and her dog into a hotel to beat the heat while nobody answers the after hours phone.", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "102631663648365172349", "name": "Carlie Chapman", "time": 1508955157804, "rating": 5.0, "text": "Great company to work with! They made the transition to my new apartment so easy!", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "118172658698325206834", "name": "The RC1", "time": 1442846350423, "rating": 1.0, "text": "I currently live at river pointe apartments, one of the properties spaces management manages. Let me tell you about my experience.  There was a leak in the wall of my bathroom last year right after i moved in.  I was displaced from my apartment for a little over a week while they completely ripped apart my entire bathroom to fix the leak and redo the bathroom.  I let them get started right away and found myself somewhere else to stay.  Well after they finished fixing the leak and redoing the bathroom they just left without cleaning up my apartment.  There was dust EVERYWHERE covering everything in my apartment with a layer of it.  I cleaned all of the furniture myself but the dust was embedded in the carpet and it took almost 2 MONTHS of me calling to finally get them to send carpet cleaners out to clean the carpets.  I'm a little concerned about the health effects of breathing that in for so long.  But the whole ordeal was awful and the worst part is they didn't even offer to take anything off of my rent for me being displaced for over a week and having to live in that dust for 2 months.  I would caution anyone moving into these apartments or any apartments that spaces management manages.", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "102059080107736603903", "name": "Land For Sale", "time": 1529528063876, "rating": 1.0, "text": "Tried to buy a condo that was being managed by Spaces. We offered to let the tenants out of the lease as part of the sale but Spaces refused to terminate the contract. They keep 10% of the monthly rental fee which I offered to give them and they refused. They are pain in the butt just out of spite.", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "103993692976773512078", "name": "Jameson Hughston", "time": 1508945959445, "rating": 5.0, "text": "Excellent company.  The staff is very professional, easy to work with, helpful, and accommodating.", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "113639232999678791017", "name": "Morris SMITH", "time": 1564315136451, "rating": 1.0, "text": "They are all about the money! I receive fines every month without warning. Oh and don't have a Tenant in your home, you will be targeted.", "pics": null, "resp": {"time": 1564605825790, "text": "Mr. Smith, thank you for leaving a review for Spaces.  Unfortunately, tenants can be difficult to get to follow the rules.  We will continue to work with you to make ensure that they properly keep up your property and protect your investment."}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "112029276240255527996", "name": "Kelly South", "time": 1508964035619, "rating": 5.0, "text": "Great management company!  I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "107682744134955909489", "name": "David Kimani", "time": 1565016605095, "rating": 1.0, "text": "Management is EXTREMELY rude. They will tell you something over the phone and once you bring it up at a later date, they act as if nothing was said. The management will also hang up in your face. Very unprofessional.", "pics": null, "resp": {"time": 1565027427962, "text": "We want all of our customers to have a great experience, and we tried to assist you with options to resolve your problem of moving out in accordance with the lease agreement at the end of your lease term.  In this case, our team advised that all items in the unit had to be removed at the end of the lease term.  We offered to have the items removed and stored, but you refused. You stated you would have someone remove the items.  We began the clean up of the unit after your lease expired, and the items that remained in the unit were considered abandoned.  No one hung up on you, but rather it was you who hung up when this was being discussed."}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "118363565420388434049", "name": "Jasmine Hughes", "time": 1529635320467, "rating": 1.0, "text": "The Association Management is racist, trash, and discriminates. They also are uneducated with basic property laws. Avoid anything dealing with them.", "pics": null, "resp": {"time": 1557873530000, "text": "This review has been reported to Google as inappropriate."}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "116657103467300329429", "name": "Heather Mitchell", "time": 1508944756028, "rating": 5.0, "text": "Helpful staff!  A great company to work with!", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "108205623236229217291", "name": "Jason Gray", "time": 1508961257267, "rating": 5.0, "text": "Great management company with some great properties to lease.", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "102988543740888409008", "name": "Brian Randolph", "time": 1516416617991, "rating": 1.0, "text": "Beware this management company. My son signed a lease only to find a week later he had lost his scholarship and would not be returning. We continued to pay the rent thinking they were trying to help sublease only to find they were turning people away. When confronted, they agreed to sublease to someone WE FOUND. Now to avoid returning our security deposit they have created damage that did not exist when we left but they are trying to get us to pay additional money. The initial conditions were terrible to start with. Think twice before renting any apartment they manage.", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "117705007959775419370", "name": "Spencer Wise", "time": 1508963838516, "rating": 5.0, "text": "Great management and people.  Above and beyond service", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "107636959829823909161", "name": "Akia Austin", "time": 1508738985830, "rating": 2.0, "text": "This whole company is awful. Lived in Capstone Quarters for 3 years and it gets worse every year. The management is unprofessional and the maintenance is unreliable.", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "106529875669191408262", "name": "Garret Leopard", "time": 1500331313398, "rating": 5.0, "text": "Very Helpful staff, and beautiful and well kept properties!", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "116232432036962670351", "name": "Sven S", "time": 1566600737424, "rating": 1.0, "text": "Not providing any service to the neighborhood. Instead they’re making up new rules just so and then have their agents solicit for any possibility to charge the residents!", "pics": null, "resp": {"time": 1566828117139, "text": "Thank you for leaving a rating for Spaces.   I understand that your landlord has provided you with a copy of the covenants that are recorded in the Tuscaloosa Probate office.  Spaces does not create these, they are developed at the time the neighborhood is planned.   If at any time, you feel that you are receiving a notice for something that is not set out in the covenants, please contact us so that we can discuss it further.  Our goal is to have zero violations noted for our neighborhoods.  We understand that there are always extenuating circumstances and will be glad to help resolve those if we are aware."}, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "114417706193036823319", "name": "TJ Ward", "time": 1482348554050, "rating": 1.0, "text": "They hardly ever answer the phones, and they never call you back when you leave a message. This place has some shady business practices. Avoid this entire company while looking for a place to live in Tuscaloosa. They charged me $895 when I moved out for having a pet, but I never had a pet when I lived in Tuscaloosa. After confronting them about it, they changed it to a charge for not moving out in time. They were unable to tell me what day they had me moving out in their records. Their Facebook reviews show other people having the same issues as me. Please save yourself some trouble by not renting from them.", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "115418003192894517727", "name": "Christopher Long", "time": 1499441311052, "rating": 1.0, "text": "Extremely unprofessional and dishonest. Do not rent from this company.", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "118241571055762168612", "name": "Katlyn Caldwell", "time": 1508945993079, "rating": 4.0, "text": "Great company!", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "107947780596908931997", "name": "Grayson Garrett", "time": 1500308449677, "rating": 5.0, "text": "Fabulous", "pics": null, "resp": null, "gmap_id": "0x8888a83230c148df:0xaac2293f184926e6"}
{"user_id": "114239998614249715158", "name": "Jeanna Forte", "time": 1624735799021, "rating": 5.0, "text": "This is an excellent condo, if you are going to vacation in Orange Beach, AL definitely get your condo at Romar House", "pics": null, "resp": null, "gmap_id": "0x889a069abd905c01:0x385859fbea929315"}
{"user_id": "105603282197656011001", "name": "courtney hamby", "time": 1599406316645, "rating": 5.0, "text": "We booked at beach front penthouse two weeks ago and was double booked, so day of we were blessed to find Romar House  #pleasantly surprised#awesome stay", "pics": null, "resp": null, "gmap_id": "0x889a069abd905c01:0x385859fbea929315"}
{"user_id": "108949211524868411919", "name": "Pal Wal", "time": 1595363760358, "rating": 5.0, "text": "We have stayed in many places along the coast.Romar House is the best by far.To many good things to say about it.Ill just leave it with the 5 stars.", "pics": null, "resp": null, "gmap_id": "0x889a069abd905c01:0x385859fbea929315"}
{"user_id": "108519602879820186677", "name": "Kate Baldwin", "time": 1595698593081, "rating": 5.0, "text": "Great condos, good location right on the beach with two swimming pools. Beach chairs and umbrellas are available to rent daily or seasonally", "pics": null, "resp": null, "gmap_id": "0x889a069abd905c01:0x385859fbea929315"}
{"user_id": "108990408593758316631", "name": "No", "time": 1593301924177, "rating": 1.0, "text": "The ocean didn't drown me so you get a 1 star", "pics": null, "resp": null, "gmap_id": "0x889a069abd905c01:0x385859fbea929315"}
{"user_id": "104186404723222266670", "name": "eddie jussely", "time": 1545967284474, "rating": 5.0, "text": "Great place for the family!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNd7pmW83FTP3g-ygDpTbn5aQ3gnb8XMjCewfpn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPpXKHXwjvgEHLXtJGwUgK1o3g9BwccZnLRuFxt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMFu-0ZrL6sRKlTqqFhT5HgRmslYy_aBqRH0E2u=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a069abd905c01:0x385859fbea929315"}
{"user_id": "104963462979384357582", "name": "Stacey Willis", "time": 1617202528699, "rating": 2.0, "text": "Not a very clean place.", "pics": null, "resp": null, "gmap_id": "0x889a069abd905c01:0x385859fbea929315"}
{"user_id": "113780114697706106238", "name": "Melissa Williamson", "time": 1535228927328, "rating": 5.0, "text": "Amazing views the condo is Beyond what I expected if you get a chance to come I highly recommended very relaxing clean I could say so much more I have enjoyed my stay here I am dreading to leave this place", "pics": null, "resp": null, "gmap_id": "0x889a069abd905c01:0x385859fbea929315"}
{"user_id": "100797898071881455046", "name": "Neal Martin", "time": 1599760633407, "rating": 5.0, "text": "Great getaway", "pics": null, "resp": null, "gmap_id": "0x889a069abd905c01:0x385859fbea929315"}
{"user_id": "112024312331970628382", "name": "Mary McTie", "time": 1491021287709, "rating": 5.0, "text": "All 3 bedroom and 2 bath condos, very spacious, upscale, with great views of the beach.", "pics": null, "resp": null, "gmap_id": "0x889a069abd905c01:0x385859fbea929315"}
{"user_id": "112429726365282877657", "name": "Gary Stogner", "time": 1525430004949, "rating": 4.0, "text": "Beautiful location with great views of the Gulf of Mexico.", "pics": null, "resp": null, "gmap_id": "0x889a069abd905c01:0x385859fbea929315"}
{"user_id": "106313899631588321690", "name": "Michael Thomas", "time": 1502297800590, "rating": 5.0, "text": "Awesome complex , my friends from Birmingham stayed and it was super nice .", "pics": null, "resp": null, "gmap_id": "0x889a069abd905c01:0x385859fbea929315"}
{"user_id": "100929355381766634629", "name": "Johnny Holifield", "time": 1462147178592, "rating": 5.0, "text": "No problem.  Would stay from now on", "pics": null, "resp": null, "gmap_id": "0x889a069abd905c01:0x385859fbea929315"}
{"user_id": "117853319923911268790", "name": "Lila Taylor", "time": 1505755273960, "rating": 5.0, "text": "Wonderful place, great views of the gulf!!", "pics": null, "resp": null, "gmap_id": "0x889a069abd905c01:0x385859fbea929315"}
{"user_id": "106318994179113659526", "name": "N McD", "time": 1461077131464, "rating": 5.0, "text": "Great Condos, very nice updates.", "pics": null, "resp": null, "gmap_id": "0x889a069abd905c01:0x385859fbea929315"}
{"user_id": "101267131690446926059", "name": "LEIGH ANN COSBY", "time": 1524797037362, "rating": 5.0, "text": "Very Nice Penthouse", "pics": null, "resp": null, "gmap_id": "0x889a069abd905c01:0x385859fbea929315"}
{"user_id": "110278911174030117644", "name": "Mike Weldy", "time": 1512922360706, "rating": 5.0, "text": "Amazing place to stay", "pics": null, "resp": null, "gmap_id": "0x889a069abd905c01:0x385859fbea929315"}
{"user_id": "114185552311310778927", "name": "Kaleb Chapin", "time": 1502118871403, "rating": 5.0, "text": "Sales office for Liberty Park community. Everyone there is kind and helpful.", "pics": null, "resp": null, "gmap_id": "0x888916b6f8876e8f:0xda286897377ca01b"}
{"user_id": "104129624779482776157", "name": "Nicholas Nicholas", "time": 1600362898556, "rating": 5.0, "text": "GREAT Association. Well maintained and well managed. The HOA is Federally certified which is rare for many condos.", "pics": null, "resp": null, "gmap_id": "0x8862695bc3b21d67:0x2982c00aeedeb727"}
{"user_id": "112587228096856716452", "name": "Anthony Meeks", "time": 1619441116335, "rating": 3.0, "text": "Nice people. A little slow to respond to questions. Had to call them three times to get an answer.", "pics": null, "resp": {"time": 1619443525051, "text": "Thank you for bringing this to our attention we’re sorry to hear that your experience was not up to standards. Would you mind calling our office to discuss more about your experience? Thank you."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "110197836712977589313", "name": "Jamie Mathewson", "time": 1623184276862, "rating": 4.0, "text": "Bre and Ronette were amazing!! took 3 weeks to approve the fence but the responses on emails were friendly and very professional", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "113543118362288436856", "name": "renee Kelly", "time": 1608059892323, "rating": 5.0, "text": "Ms. Ronette was very professional, courteous and prompt.  She ensured my ARC request was staffed and walked me through the portal with ease.  She's the best and very user friendly.", "pics": null, "resp": {"time": 1609790379244, "text": "Renee, what a kind thing to say! Ronette really is a rock star! We are glad you were well taken care of."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "103842694057972466454", "name": "ASHLEE ADKINS", "time": 1605208447670, "rating": 5.0, "text": "For the first time since moving into our new home in March of 2018, we received a violation notice. Oops! So, I made a call to find out more details on what was wrong with said violation. My call was answered on our first try.\n\nAfter explaining what was in the picture, I’m happy to say Ronette was very quick (in less than 48 hours) in helping get us “legal” again.\n\nThanks again for all the help!!", "pics": null, "resp": {"time": 1605212620037, "text": "Ashlee, we are so glad to hear that we were able to assist and help you get back in compliance quickly and easily. Thank you for the great review!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "106143326838567020006", "name": "Billy Brizendine`", "time": 1609879035716, "rating": 5.0, "text": "Ms Ronette was very responsive, quick, and friendly! She helped me through the entire process and answered all my questions with ease. Thanks!", "pics": null, "resp": {"time": 1610385255014, "text": "Billy, we appreciate your feedback! We will pass along the praise to Ronette!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "115280833291958983693", "name": "Rachael Glass", "time": 1603676765866, "rating": 4.0, "text": "As an experienced retired property manager and having served on HOA boards I give Elite A lot of credit for what they do in my community I now live in.  Management is a juggling act because you have so many things to try and satisfy.   They are pleasant to talk to and are always open to resolving things when it is brought to their attention.", "pics": null, "resp": {"time": 1604327271154, "text": "Rachael, we so appreciate your kind remarks! You are right in that this industry can be very difficult, but we love what we do and the wonderful people we get to work for/with so it makes it all worth while!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "109616081294034997810", "name": "Lara Gilbert", "time": 1600276297716, "rating": 5.0, "text": "Ronette Harwell was amazing to work with! She was extremely helpful in guiding us through the ARC application process. She was quick to respond and had such a sweet demeanor. She truly made it easy to ask questions.", "pics": null, "resp": {"time": 1600366524487, "text": "Lara, thank you for letting us know of the great job Ronette is doing! We will pass on the praise!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "112859916613237310457", "name": "Howard Fry", "time": 1599150299960, "rating": 5.0, "text": "I had to obtain approval from my HOA to have work done on the exterior of my home.  Elite is our HOA property manager.  I was able to download the appropriate pdf from Elite's website and enter the data directly on the form.  I appreciate being able to enter the data directly.  I had to submit other files regarding the dimensions and colors.  Elite received my application and files then forwarded them to our HOA ARC that performs the review.  The ARC reviews the plans then sends their recommendation to the HOA Board who then notifies Elite.  That requires emails, downloads, review, communications, and postings.  I submitted my request on August 28 and was approved on September 3 and that is less than one week.  That turnaround time is what I call responsive.  The instructions were clear and the forms user friendly; that is a relecton of their professionalism.", "pics": null, "resp": {"time": 1599170217337, "text": "Howard, we greatly appreciate your feedback! You are so right, this IS a very involved process and we are happy to hear that you had a great experience!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "116478479815378142128", "name": "melanie aldridge", "time": 1609786651695, "rating": 5.0, "text": "Great to work with...issues are addressed quickly and professionally.  Communications are always pleasant.", "pics": null, "resp": {"time": 1609790306021, "text": "Melanie, Thank you for your 5 Star Review! Happy New Year to you and yours."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "100579179155027796623", "name": "Mark Hopper", "time": 1583267951163, "rating": 5.0, "text": "My subdivision is managed by Elite Housing Management. We have had a shuffle of management companies over the last 8 years. It was not until ELITE came aboard 2 years ago, that the property began to take a positive turn. The grounds improved. The amenities- pool, lakes, grounds, all improved.  ELITE  HOUSING'S visibility inside the subdivision improved,too. ELITE initiated an overnight patrol to assist in community presence proving to be a deterrent to vehicle break ins. My wife and I have been pleased with the service of ELITE HOUSING MANAGEMENT!", "pics": null, "resp": {"time": 1619444094827, "text": "We are incredibly grateful that you took the time out to leave us this note. Our company values put customer satisfaction as top priority and we are committed to our customers. Its customers like you that make our job wonderful. We look forward to serving you again."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "104394707320649308060", "name": "Tina Littleson", "time": 1607360693368, "rating": 5.0, "text": "Ronette was Wonderful!\nVery responsive and informative.\nGreat personality and fun to work with.\n\nThank you Ronette!", "pics": null, "resp": {"time": 1607371329173, "text": "Tina, your review is so appreciated! We will pass along the praise to Ronette!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "116970696438600698720", "name": "Katy", "time": 1601482212397, "rating": 5.0, "text": "These are some of the nicest and most patient people I have ever had the pleasure of interacting with. No matter how many questions you have you can rely on them to answer you or send you in the right direction. Michelle, Linsey, and Rhonette (I'm so sorry for the spelling as we've only talked on the phone) thank you so much for being there and doing such great jobs.", "pics": null, "resp": {"time": 1601488462227, "text": "Katy, wow! Thank you very much for your kind words. We have a wonderful team here and are so glad to hear that they are taking care of our homeowners! We will pass along the praise."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "105669448563038146787", "name": "dylan dwyer", "time": 1603119411746, "rating": 5.0, "text": "We are moving into our home and needed to get a fence installed. We had to get approval through our HOA first. Ronette helped me through the whole process. She was lightning fast in her responses and was very helpful! Thankful for making this an easy process!", "pics": null, "resp": {"time": 1603121886191, "text": "Dylan, we are so pleased to hear that Ronette was able to assist you with getting your fence installed easily and quickly! Welcome to your new neighborhood!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "114563910190198243049", "name": "Sruthi Krishnan", "time": 1605540492810, "rating": 5.0, "text": "Ally, at the Elite Housing Management was Awesome!!! :) She was helpful and very quick in providing answers to my questions.", "pics": null, "resp": {"time": 1605639905577, "text": "Sruthi, thank you for letting us know of the great work Ally is doing! Don't hesitate to contact us for any questions you have in the future."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "105068499892634920067", "name": "Emmett Moore", "time": 1602536903788, "rating": 5.0, "text": "The staff is very pleasant, friendly and professional.  Almost all of them are very organized, responsive and take care of issues expediently.", "pics": null, "resp": {"time": 1602538923866, "text": "Emmett, thank you for the kind review. We love working with you and your community and will continue to serve at the best of our ability!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "105247263215155623960", "name": "War Eagle20", "time": 1604044879469, "rating": 1.0, "text": "Think twice before allowing this company to manage your HOA property.\nThey have illegally OVER STEPPED THEIR BOUNDARIES countless times in my neighborhood with threats of inflicting unwarranted fines and even threats of coming to your property IN WHICH YOU OWN and dismantling or tearing down things such as flags, political banners, etc that DO NOT GO AGAINST OUR HOA COVENANT or BYLAWS.\nThis company is a walking lawsuit waiting to happen!\nI didn’t want to give this company even one star. Unfortunately, I had to in order to post my review.", "pics": null, "resp": {"time": 1604090304261, "text": "Hello War Eagle20. Please understand that we were hired by the Board of Directors of your HOA to uphold the covenant and bylaws of your HOA. We have not overstepped these boundaries within your community. We would never threaten anyone in the communities we manage. Our job is to ensure that the HOA covenant and bylaws are being upheld by members of the community and to provide a variety of services to maintain your and your neighbors’ property value and safety. Hopefully you will come to see this after you review your HOA’s covenant and bylaws again. If you would like us to review these with you or show you the portion that refers to political signs and displays in your yard we would be happy to assist."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "104236439345458550496", "name": "Undrea Randolph II", "time": 1592507282801, "rating": 5.0, "text": "I don't typically leave reviews for anything but Ally was AMAZING. First time homeowner and very new to HOA stuff and she was able to not only answer all my questions but follow up where needed. Greatly appreciated and an excelled asset. Glad to know she will be there when i call!", "pics": null, "resp": {"time": 1592512818884, "text": "Undrea, thank you for sharing about your great experience with Ally! We will pass along the praise!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "114116253433656230430", "name": "Allison Hunt", "time": 1583856054661, "rating": 5.0, "text": "The Staff truly cares about the homeowners, and making the community and the value of your home grow! It is a company that cares, and they show that through their hard-work. It is a small company that manages a rather large number of communities in the up and coming Huntsville/Madison area. AWESOME COMPANY!", "pics": null, "resp": {"time": 1619443822643, "text": "Thank you for taking the time to leave us such a nice review!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "114840113472528183295", "name": "Willie Brazile", "time": 1592842354658, "rating": 1.0, "text": "I think this company has been basically useless in my community.  We have yet to meet anyone associated with this company nor have seen any proof our dues are going towards anything substantial in our neighborhood.  We don't have any speed bumps to detract speeding, the community spaces outside our lots are not cut frequently, and we do not even have a clubhouse.  With well over 100 homes in the community, there should be funds available to have a nice area for the community.  Also on multiple occasions,  there has been no public declaration on dogs policy.  There are people who willingly have their dogs with no leash in the street and other yards and the HOA has done nothing about it.", "pics": null, "resp": {"time": 1592853253243, "text": "Willie, we understand your concerns however it is important to note that Elite Housing Management is not the HOA for your community: we are the management agency your HOA has elected to handle the day to day tasks necessary to keep your community in proper running order. The ultimate decisions on what can/will be done with your community rests with your Declarant/Board of Directors."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "100357085788571952358", "name": "Kim", "time": 1597327207436, "rating": 5.0, "text": "Thanks Tami w/ Elite Housing for trusting our company Stephens Electric co.,Inc to do work  on your properties it is such a joy to work with Tami and Elite Housing on many project she is very professional and always on top of the work they are needing done Wonderful company !!!", "pics": null, "resp": {"time": 1597331074204, "text": "Kim, we really appreciate your kind words! Tami is wonderful and we will pass along the praise! Thank you for your hard work!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "116108155268393387870", "name": "Donna Saunders", "time": 1596542692135, "rating": 5.0, "text": "Elite Housing Management replaced a previous company and walked into a difficult situation.  Our fountain barely worked, the pool construction had been delayed several times and a host of other neighborhood complaints.  Elite stepped up to the plate.  The fountain has been running.  The pool had a \"Grand Opening\" with food trucks.  The food trucks were invited into the neighborhood especially when we under severe lockdown from the pandemic.  I have to give a special shout out to Ronette Harwell for being patient with us and our Architectural Applications.  Her response to our questions was immediate and she asked the right questions to get our applications approved quickly.  Elite Team keep up the good work especially as the neighborhood continues to grow and change.", "pics": null, "resp": {"time": 1596563651657, "text": "Donna, thank you so much for the rave review! We love working with your community. We will share your praises to Ronette!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "114134953853593288585", "name": "Battlefield Alpacas", "time": 1600554456005, "rating": 1.0, "text": "I’m not sure they have even read our new community’s covenants.   We pay $75 a month, zero amenities.   Every other home has a violation.", "pics": null, "resp": {"time": 1600694966125, "text": "We would like to learn more about the issues you are experiencing within your community, and see how we can be of assistance. Please give us a call at 256-808-8719 to discuss your concerns with a valued member of our staff."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "103235675765160271984", "name": "Greg Hurley", "time": 1598630959416, "rating": 5.0, "text": "Ronette Harwell was a joy to talk to. She's super responsive and always willing to help. I think she deserves a raise.", "pics": null, "resp": {"time": 1598877837408, "text": "Greg, we appreciate you taking the time to go out of your way to let us know about the great job Ronette is doing! We will all give her a pat on the back!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "116843498555280846837", "name": "Buzz Killington", "time": 1592420631875, "rating": 1.0, "text": "We will always get letters to pay your dues but when we call about any issues it's a pain to get through. When we finally get through to complain about a dog that is always off it's leash, the said call animal control.  We don't have speed bumps or a rec center. What am i paying for?", "pics": null, "resp": {"time": 1592515597934, "text": "Thank you for your feedback, as it helps us get better. As an HOA Management firm, our responsibility is to help keep your community safe and to optimize and maintain the value of your property. Unfortunately, there are some things that are out of our hands and best left up to the professionals who deal with specialized things, such as a loose dog."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "101956734892180280834", "name": "Don Shield", "time": 1593474262709, "rating": 5.0, "text": "Management is very responsive and their professionalism is outstanding. Elite’s system tool is easy to navigate and track the total life cycle of our HOA.", "pics": null, "resp": {"time": 1593531518679, "text": "Don, thank you so much for the compliment! We love working with your community!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "112443656954273739317", "name": "Annette Akers", "time": 1590085233660, "rating": 5.0, "text": "My recent experience with Elite Housing Management was with Ronette Harwell in particular. I submitted an application to build a fence. As I'm not an experienced homeowner, I was unsure of how to layout the fence on my plot plan. Ronette was wonderful and explained how to read a plot plan very patiently and helped me understand. She responded to any question almost instantly and I had my approval within a day. Wonderful experience! Thank you.", "pics": null, "resp": {"time": 1590090361895, "text": "Annette, we're glad to be of assistance! We will absolutely pass along the praise to Ronette!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "109294407368812421053", "name": "Will Mahle", "time": 1597335116524, "rating": 1.0, "text": "They seem to take credit for good reviews here, then when there is a bad review, they blame the HOA Board of Directors.\nThey fined me daily for a moving pod that was in my driveway even after I explained to them that I had lost the contractor working on the house I had purchased due to Covid.\nIt is all about the Benjamins with Elite Housing.", "pics": null, "resp": {"time": 1597348490860, "text": "Will, as an HOA management agency working on behalf of the HOA, we do as the board of each community directs us to do. We are hired to enforce the covenants and rules of the community, while remaining strictly objective. Please give us a call so we can discuss this issue and work towards reaching a resolution."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "105109397557154377765", "name": "Donna Boyett", "time": 1593713537993, "rating": 5.0, "text": "I had an issue that they addressed very quickly and efficiently. They were very professional. Much appreciated.", "pics": null, "resp": {"time": 1593720558855, "text": "Donna, thank you for your feedback! We are here to help!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "116066710819130843048", "name": "jamie prince", "time": 1591109217343, "rating": 5.0, "text": "Elite has made an incredible difference in our community and I could not be happier. I was skeptical when they first came in to the community due to some of the reviews I saw but in less than a years time they have taken all of that skepticism and worry away. The Elite staff lives up to their name with their swift responses and resolutions to any and all issues we have had!", "pics": null, "resp": {"time": 1591110150688, "text": "Jamie, thank you for your review! We are glad to know that we have gained your trust and that you are happy with our company!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "116146792816410274700", "name": "Lizabeth Payer", "time": 1583870573835, "rating": 5.0, "text": "I would give Elite 10 stars if I could. They literally saved our Association from a previous crooked and corrupt property management company. Thank God for Chad, Crystal, Tammy and Ally - the office staff I have the most interaction with. Especially Chad and Crystal - our Hero's for sure. Always there to help, quick to respond, and they calmed all of our fears regarding maintenance issues, property struggles, and getting things back on track which was not easy. I don't know what the other haters are talking about - without a doubt they are the best in their field. Our Association is very grateful to Elite - a huge thank you for all your hard work.", "pics": null, "resp": {"time": 1590091526760, "text": "Lizabeth, thank you so much for your raving review and for trusting Elite Housing Management to care for your Association! We love working with your community!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "108664136639959221048", "name": "Josh Cook", "time": 1592445206359, "rating": 1.0, "text": "Elite is a Joke!!!! seriously the worst excuse for a HOA myself and a lot of others have ever seen before in our neighborhood. They literally take all of this money from the neighborhood to cut a little patch of grass. I could understand if we had a playground or pool in the neighborhood but we don't. We just got our yearly budget report which just shows they don't do anything. If you are looking to buy a house DO NOT buy a house that has Elite Housing Management for the HOA they are complete Trash.", "pics": null, "resp": {"time": 1592514708329, "text": "Josh, we hate to hear that you are displeased with how Elite is caring for your community. However, we feel it is important to note that Elite is not your HOA... we are the management agency appointed by your Home Owners Association Board of Directors for your community. We do not make the calls for what happens in your community."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "111311615621446510193", "name": "Aline Kuntze", "time": 1590771228476, "rating": 5.0, "text": "I had a great experience with the agent which helped me in my neighborhood, Ronette Harwell. She was pretty considerate and quick to help!", "pics": null, "resp": {"time": 1591107371192, "text": "Aline, thank you for sharing your great experience with Ronette and Elite Housing Management!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "111168224272105895948", "name": "Robert Lamb", "time": 1582554093977, "rating": 1.0, "text": "Horrible staff. \"Elite\" is nothing but a scam. They take tens of thousands of dollars from each community every year with nothing in return. The grass around the lake in our neighborhood stays overgrown. People constantly park on the street while also having cars parked in yards and on the side walk. No playground for the kids to stay off the street. They never run a street sweeper to clean up all of the trash that people create in the neighborhood. We have only had ONE meeting in the four years we have lived in Bermuda Lakes.  I can't believe this company is allowed to steal peoples money the way they do!", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "102007237479688656139", "name": "Ana McCormick", "time": 1593469505257, "rating": 5.0, "text": "Every time I call, Ally is always there to help with my day to day questions. Ronette has been phenonmenal! We have only had to make request twice now but both times, she has always responded quickly if I needed to add or make changes to our forms. (even my cartoon drawling lol).  I have been pleasantly surprised and happy with this HOA management company!", "pics": null, "resp": {"time": 1593531421102, "text": "Ana, thank you so much for your review! We love patting our teammates on the back for a job well done!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "101082784287487185017", "name": "Joanne Hunt", "time": 1590007458616, "rating": 1.0, "text": "Not impressed at all!!!!  This company sent me a warning letter based on a drive by weeks prior...my trust level in this company is extremely low at this point.  The employee I spoke with did not seem confident in her responses...she was making it up as she was going along.  When I responded logically, she seemed intimidated.  I am seriously considering selling my house to rid my self of Elite Housing!!!  By the way, I rate Elite Housing 0 stars!!!", "pics": null, "resp": {"time": 1590507249869, "text": "Joanne, we hate to hear that you are not happy with our company. We do our best to help the communities we represent by enforcing the covenants that each HOA has set in place. Our management team would like to speak with you to discuss your grievances; please give us a call at your earliest convince. Thank you."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "102854263922990519961", "name": "Trey Dyer", "time": 1592326678028, "rating": 5.0, "text": "The Bridges on The River HOA\n\nI feel it necessary to share my very positive thoughts and interactions with Elite Housing Management Company, and most importantly the Staff!  Amazing folks at EHM, from Chad, Tami, Crystal, Ronette, Ally and anybody else that works at EHM that I haven’t had the pleasure to meet.\n\nAfter reading most all of the reviews, believe me as a current HOA board member, this company is top notch!  Many of the negative reviews have nothing really to do with EHM.  They only enforce the covenants that we as a community have in place.  As another HOA board member noted, the board members and homeowners are the responsible party’s.  Our last Management company was impossible to reach by phone!  Absolutely not the case with Elite, as I have yet to receive a voicemail box during work hours.\n\nThere app is very helpful.  I have not encountered another company using one.  I am sure some do but I am just saying it is a plus.  Email responses are super fast.\n\nFor the reviewer that complained of Elite not keeping streets cleaned/street swept!!!  Really??  Just Really??  Address that with your HOA board members and have them allocate funds to have it done.  Elite will then ensure it is handled, I can assure you of the latter.  I can’t speak for your board members however.  End rant.\n\nKeep up the GREAT work EHM!!!!", "pics": null, "resp": {"time": 1592342763463, "text": "Trey, thank you so much for the raving review! We really appreciate you taking the time to share what you love about our company and to address our wonderful staff. We love working with your community and look forward to the future!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "101390257905957208402", "name": "Dave Miller", "time": 1580090671921, "rating": 1.0, "text": "My latest experience, I called in reference to a warning I received in the mail which did not pertain to our residence.  Was left on hold.  I am still waiting for the first satisfactory experience with this office.  Deserves a zero star rating.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "116443464162593393767", "name": "Robin Mitchell", "time": 1564409293493, "rating": 5.0, "text": "I reached out to them recently and received an immediate response from both James and Kelly!! They were both extremely helpful and very nice!   I truly believe they care about the value of our property and want to help us!", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "116443464162593393767", "name": "Robin Mitchell", "time": 1564409293493, "rating": 5.0, "text": "I reached out to them recently and received an immediate response from both James and Kelly!! They were both extremely helpful and very nice!   I truly believe they care about the value of our property and want to help us!", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "101390257905957208402", "name": "Dave Miller", "time": 1580090671921, "rating": 1.0, "text": "My latest experience, I called in reference to a warning I received in the mail which did not pertain to our residence.  Was left on hold.  I am still waiting for the first satisfactory experience with this office.  Deserves a zero star rating.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "101945965333167642099", "name": "Demetria Braudaway", "time": 1589912759350, "rating": 5.0, "text": "Elite Housing Managment is the HOA for my community.  I have been working on getting a pool and stained fence approved per our covenant.  It has been a delite to work with Ronette Harwell at Elite.  She has guided me through the whole process to approval.  I sent many emails and phone calls throughout the process and she was so responsive and attentive.  She went over and beyond to help me with my plot plan for the pool.  I could have never gotten this done without Ronette.  5 STARS all the way!!!!!!\n\nThanks, Demetria", "pics": null, "resp": {"time": 1590090539154, "text": "Demetria, we are so glad you had a great experience! We will pass along the praise to Ronette!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "114828635203903089547", "name": "Sondra Williamson", "time": 1591191606986, "rating": 5.0, "text": "Very nice people to work with. Fast and professional.", "pics": null, "resp": {"time": 1591626410618, "text": "Sondra, you for the 5 Star Review! We are glad to hear you are happy with our services."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "116938637124452834970", "name": "Danielle Jefferson", "time": 1583510692523, "rating": 1.0, "text": "Elite doesn't even deserve this one star. ELITE IS THE WORST MANAGEMENT COMPANY!! Poor customer service is the number one issue with them. Also, poor management with keeping our streets cleaned as well. Elite should be known as a SCAM. They are money hungry individuals who thrive off giving fines! They care nothing about the residents!", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "108634015255610182155", "name": "Matthew Pugh", "time": 1580129833224, "rating": 1.0, "text": "Very poor customer service. I have asked for a simple document for over 2 weeks and they claim to be too busy to take 30 seconds to email it to a customer.", "pics": null, "resp": {"time": 1619443980624, "text": "Thank you for your review. I’m sorry to hear you had such a frustrating experience, but I really appreciate you bringing this issue to my attention. Please reach out to our office to discuss your concerns."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "106442516294531775915", "name": "Allen Krasner", "time": 1583768774993, "rating": 1.0, "text": "Stay far away from this company and do not use them. They are horrible and do not care for anything other than getting HOA dues. They have only driven through our neighborhood once and ignored a multitude of violations per the community rules. We followed up with them about a complaints a neighbor leaving 4 trash can bins in then street for a week, and there respond was “ we will try to reach the owner again and has anything changed”. If they actually monitored the neighborhood, they would know! They are slow to respond, if they respond at all.", "pics": null, "resp": {"time": 1619443875718, "text": "Thank you for posting a review and we’re sorry to hear that your experience was not up to standards. We would like the opportunity to talk and investigate your feedback further."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "107702911486358411082", "name": "Teresa Christian", "time": 1563464411106, "rating": 1.0, "text": "My review, from over a year ago, was just answered. Why now? It's really futile at this point. Also, of course, I have the correct phone number. I don't know why I was even asked this silly question. We were first to move-in, so I can speak of turnover.\nCommunication has become better with Elite and my household over the past few months.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "106712140368274383416", "name": "Amy Donlin", "time": 1588791990830, "rating": 5.0, "text": "Very responsive.  Helpful and they care about the community!", "pics": null, "resp": {"time": 1590090610127, "text": "Amy, thank you so much for the compliment! We love our communities!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "107559176893986881934", "name": "Maygin Wheat", "time": 1575753838162, "rating": 5.0, "text": "Crystal and Tammy get stuff done. Always kind, courteous and effectively communicate.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "106712140368274383416", "name": "Amy Donlin", "time": 1588791990830, "rating": 5.0, "text": "Very responsive.  Helpful and they care about the community!", "pics": null, "resp": {"time": 1590090610127, "text": "Amy, thank you so much for the compliment! We love our communities!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "106966820874435813574", "name": "Ryan Hicks", "time": 1598492690972, "rating": 1.0, "text": "This is the biggest joke of property management/HOA management company I have ever had to deal with.", "pics": null, "resp": {"time": 1598547615494, "text": "Ryan, we hate to hear that you are not pleased with our management agency. Would you please reach out to us via phone so we can learn more about this issue and see if we can find a resolution? We look forward to speaking with you."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "108863387897977873261", "name": "Cheryl A Robbins", "time": 1567136117758, "rating": 1.0, "text": "If I could I would give this company NO stars. I have had people parking next to my home and dumping trash in my yard. When I asked why they were there they told me that the homeowners were given permission. I have NEVER had a good experience with this company. They are suppose to ENFORCE the no parking on the street bylaw but instead they let it pass. Most days I have to be hyperviligent when driving since there are cars parked on both sides of the street. I have never seen them do anything for the neighborhood and have never been told of any meetings. I see no purpose for an HOA if they do nothing but harass and belittle the people who are paying them for who knows what!", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "117754865191287794333", "name": "Bryan Goldsby", "time": 1617594289755, "rating": 5.0, "text": "They handle it all...", "pics": null, "resp": {"time": 1619443751859, "text": "Thank you Bryan! We at Elite Housing Management are incredibly grateful that you took the time out to leave us this note and value your loyalty and relationship."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "113858197244389809969", "name": "Kathy Smith", "time": 1579281838567, "rating": 5.0, "text": "Our community picked them up in July to manage our community HOA and they have been outstanding to work with.\n\nThank you for your patience and understanding and relentless questions through our transition between builder controlled HOA to owner controlled.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "101104221390346757169", "name": "David Isbell", "time": 1574033236256, "rating": 5.0, "text": "Highly recommend Elite Housing Management. Great office staff!", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "117447015708343382341", "name": "Fred RN", "time": 1590614057170, "rating": 5.0, "text": "There is a lady named Ronette, she will take care of you. See her first!", "pics": null, "resp": {"time": 1590694201616, "text": "Fred, we are so glad that Ronette has taken great care of you! Thank you for the great review!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "106245935505705844657", "name": "Judah Frank", "time": 1544306587479, "rating": 1.0, "text": "Don’t see the point in our HOA. We live in a neighborhood with no community pool and very minimal landscaping, yet we pay hundreds of dollars per year. I did visit their office once and took note of the nice Mac computers they use, so that told me all I needed to know.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "102518528700582152220", "name": "David Hood", "time": 1570471870534, "rating": 2.0, "text": "Cost: 4/5\nEffectiveness: 1/5\nCommunication: 2/5\n\nTo preface this review, I live in the Burwell Gardens subdivision.\n\nOur covenant very specifically states (Section 4, Page 9) you may not park your cars on the street regularly. It is immediately evident that this is not adhered to. Pick any time of the day to drive down the neighborhood street, and you are forced to zig-zag through a labyrinth of cars.\n\nThe HOA did send out a notation about 6 months ago advising the neighborhood there would be fines for cars regularly parking on the street. Traffic cleared up for ~1 week, then promptly resumed with the parking habits. It is clear that the fines are either not happening, or are being ignored completely without any consequence.\n\nI'm not sure why this HOA is permitted to continue doing business in our neighborhood.\n\nPictures can be made available upon request... but as you cannot swing a dead cat without hitting someone's car on the street in our neighborhood, this is unnecessary.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "114361267075829124081", "name": "Michael Walker", "time": 1592414582116, "rating": 5.0, "text": "Everybody at Elite is a absolute pleasure to work with!! Very professional company!", "pics": null, "resp": {"time": 1592514744998, "text": "Michael, thank you so much! We have come a long way and are excited for our continued growth!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "103380890730769577454", "name": "Emily Little", "time": 1564510713034, "rating": 5.0, "text": "A very responsive and great team! Would HIGHLY recommend!", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "102131961207277935418", "name": "Lawrence Whisenant", "time": 1558119156591, "rating": 1.0, "text": "Very poor customer service. Very poor resident support. Provides very little in terms of useful services to the residents of the community.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "103133007757067972151", "name": "Aaron Hearne", "time": 1535302751953, "rating": 1.0, "text": "I have never had someone answer the phone when I call. The fees are way too high for a neighborhood without a pool because there's no return on the investment. The common areas get covered in weeds and dead trees get left standing. The common areas are only partially mowed. They pick and choose when to enforce the neighborhood bylaws, possibly only when the building company calls them.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "107492314666221778513", "name": "Bronson Smith", "time": 1582138617401, "rating": 5.0, "text": "They have really turned my neighborhood around and even helped me increase the value of my property", "pics": null, "resp": {"time": 1619443995136, "text": "Thank you Bronson for your review!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "105934677781709060515", "name": "Shannon Newby", "time": 1525121736783, "rating": 5.0, "text": "Return call within hours. Professional and very efficient with what was requested. Very impressed with office staff!", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "101521681063030864712", "name": "Crystal League", "time": 1515512937970, "rating": 5.0, "text": "I truly love the team here at Elite; working hard every day to help our local communities and those who live within is our passion.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "117123280224222875836", "name": "Greg Sexton", "time": 1515469916382, "rating": 5.0, "text": "Great team! The staff is very friendly and efficient, and will go the extra mile for their clients.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "109027106989730497744", "name": "David Isbell", "time": 1591193019958, "rating": 5.0, "text": "Great company!", "pics": null, "resp": {"time": 1591626426432, "text": "David, thank you so much for the kind words and 5 Star Review!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "113367449539994867095", "name": "Teresa Christian", "time": 1522265324038, "rating": 1.0, "text": "Can never reach staff for help and a lot of turnover.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "117628814064609603215", "name": "David Speedy", "time": 1535154496681, "rating": 1.0, "text": "They don’t do their job.  No accountability of our dues and no disclosure of expenditures.  They are crooked and unethical.  They don’t deserve 1 star.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "110808925002810894031", "name": "Kurt Sitler", "time": 1624221744982, "rating": 1.0, "text": "Elite Housing manages our neighborhood HOA. They have ignored several emails. Look elsewhere for a company to manage your HOA.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "110393086302972242511", "name": "Manny O", "time": 1615488232276, "rating": 1.0, "text": "Completely ignored for a month and a half after waiting about four or five months for a neighbor to comply with standards. Feels like day light robbery. -5 rating if could. STEER CLEAR if you can. Tenuous or non-existent enforcement even after repeatedly being told there were strict guidelines on surrounding new homes under construction near my property. Never before have I seen such a complete abdication of duty. By far, one of the worst experiences I have had with a company.", "pics": null, "resp": null, "gmap_id": "0x8889240fb82c4721:0xb6cd079fc512fe96"}
{"user_id": "117589729900158337306", "name": "Bill Thompson", "time": 1623349667822, "rating": 1.0, "text": "Park Side Circle View Park is A DISASTER!!\n\nPool is barely half done with upgrades you committed….YET YOU DEMAND TO TAKE MY $$$\n\nPATHETIC!!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889240fb82c4721:0xb6cd079fc512fe96"}
{"user_id": "100252147868143603408", "name": "A Gamel", "time": 1622047028882, "rating": 2.0, "text": "So far.. we are not too happy. I have made repeated calls to our neighborhood manager, regarding the upkeep of common areas, homes that are not in compliance, and our need for the ARC to recommend windows for us. Nothing happening after many months.", "pics": null, "resp": {"time": 1622048086953, "text": "Thank you for taking the time to leave a review.  To better assist you, can you please provide us with which community you live in?"}, "gmap_id": "0x8889240fb82c4721:0xb6cd079fc512fe96"}
{"user_id": "108385393486866239046", "name": "Mikayla Reese", "time": 1623102095903, "rating": 1.0, "text": "Absolutely terrible customer service!! I have dealt with multiple HOA's in the past and none have been this unresponsive. I have been trying to get in contact with them for over a month via phone, email, and website and have not received any response at all. If anyone who has had better luck with them has any tips on how to get in contact with someone from this agency please let me know!", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "105107009731689772272", "name": "Mete Kamil", "time": 1600444988997, "rating": 1.0, "text": "Staring at 3 foot grass every morning for the past 6 weeks.  Reported it several times even though they are allegedly monitoring the neighborhood for violations. They never return calls. Always goes to voicemail, which is fine if they would return the calls in a timely manner or at least provide a time frame for when to expect a call back! Totally worthless at this point.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNKIphckp0QBAYr3uNKC3cOxX8LMJRAFFJ8jZFf=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "111258945728009414468", "name": "Martin Blanco", "time": 1608252333880, "rating": 1.0, "text": "From all the places I've rented this one was the best house because of the layout and location. Unfortunately it was the first I did not get my deposit back. It was not because it was left in bad conditions or for lack of taking care of the place, it was due to the biggest ripoff I've been involved in.\nThe manager created false companies that provided services to repair and clean the place up.\nThe house was being sold as is with buyers ready as we moved out.\nI could go on and share our complete experience which was not great but it would be a waste of my time.\nI wonder how this person can sleep at night?", "pics": null, "resp": {"time": 1498502987478, "text": "Thank you for your review."}, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "112003982180362622191", "name": "Latasha Maull", "time": 1619795545338, "rating": 1.0, "text": "I have been trying to get things fixed in my place for months and nothing  happens and I pay my rent on time and I have a broke front door and a stove that doesn't sit right", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "105747864260822040138", "name": "Robert Jeans", "time": 1604415237975, "rating": 1.0, "text": "So these guys supposedly help my neighborhood out by letting people just have trash everywhere and charge us all 400+ a year for no reason at all. I keep calling them over 50 times since the last time I got in touch with anyone there. My fees were paid when I bought my home they say they weren’t. I paid it again. Now being told I need to pay for something else again after being told the fees would be waved the one time that I did speak to someone. So they lied on that. What’s the point of a HOA that doesn’t keep members responsible for their stuff and just make you pay for no freaking reason??", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "114470736595923645702", "name": "Beth Condit", "time": 1607058194064, "rating": 1.0, "text": "We bought a new home with APEX as the manager of our HOA. It has been a terrible experience for us and most of our neighbors. The company doesn't ensure the landscaping is quality or the grass gets mowed as needed. When contacted we couldn't get issues resolved. Would not recommend this company.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "112109982327740256915", "name": "Jimmy Cai", "time": 1596763028843, "rating": 1.0, "text": "if you own property you will be certain almost not to hear from them.  not to mention they charge 10 percent if you have a work to do on your home.  emailed and called them several times before they get back with you.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "103112541872169820665", "name": "Hannah Pirtle", "time": 1603737599529, "rating": 1.0, "text": "The absolute worst HOA management company we have ever dealt with. If I could give the company no stars I would. Extremely unresponsive to email as well as phone calls. Do not do anything to keep up the community that they are being paid to take care of. When you actually do get a hold of them it is excuse after excuse as to why they can't do their jobs.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "107842805600961849826", "name": "Eric Graham", "time": 1597109682572, "rating": 1.0, "text": "So slow to respond. Last year took three weeks to have AC fixed. Year before that a week. This year it has been off and on repairs for almost a month. Never answers the phone, doesn't respond to service orders on their site, ignores messages on social media.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "117498870074648954650", "name": "Erin Wright", "time": 1503098052655, "rating": 1.0, "text": "If I could give ZERO stars I would! I helped my mother rent a home that Management Apex managed. Upon move in, it was filthy and things were broken and in disrepair. I have many photos and videos. These items were all eventually repaired or we were reimbursed because we had to pay for them ourselves but it took months to actually resolve. The WORST is my mother is a military widow on a fixed income and does have some health issues. The A/C unit went out in her rental home and she has been without A/C for 16 days thus far while temperatures are in the high 80s-90s. Management Apex solution? Send a small portable unit that is only meant to cool a 12X12 space and consistently tell us that, \"our hands are tied\" or \"we must use the owner's warranty company\". SO, in the meantime, my mom is just supposed to endure 80-90 degree heat in her home that she PAID for. Take our advice DO NOT do business with this company. Hire an attorney, report to the Alabama General Attorney's Office, report to the Better Business Bureau and the local news stations. Treating people like this will put you out of business.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "113228875620605441334", "name": "Ant Singleton", "time": 1529981675838, "rating": 5.0, "text": "Once again TEAM Apex is on point with me on handling a small problem. I just want to thank them and thank my landlord again for BLESSING me and family on a place to call home for a LONG time, while we grow.\n\nI have been utilizing the service of APEX Management for almost 5 years now. Shawn, Laura and Alicia are like family to me on supporting and making sure i find the right place for me to make a home for a extended amount of time. They ask what i want and they found it!! I have had troubled times before, but they want to make sure i am happy, and I AM HAPPY!! The personnel at APEX Team are down to earth folks that are professional,  good work ethic\n\nAlicia, thank you for being you!\nShawn, High Five on being there for me!\nMy current landlord, Thank you for my new chapter!!!\n\nI am loving my life!\n\nAnt", "pics": null, "resp": {"time": 1504972362271, "text": "Thank you for taking your time to share your experience. We are very happy that our paths crossed. Hope things are well with you and your family."}, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "107020378425761464176", "name": "Travis Howard", "time": 1508331159500, "rating": 5.0, "text": "I have been working with Shawn, Laura, and Alicia for over 4 years and appreciate the professional and systematic approach. They manage all of my residential properties and do a great job keeping me abreast of repairs needed or tenant issues. I would recommend them to anyone that needs a professional property management company.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "109126462050442898032", "name": "Chris Cureton", "time": 1467139054406, "rating": 5.0, "text": "My wife and I have been tenants with Management Apex after our move to Huntsville last year. We could not ask for a better property management team that worked with us, giving 5 star professional service, from moving in to renewing another year lease through them. Laura Clemons & Shawn Kent have been spectacular to work with. Laura is exemplary in her email response. They are a small office and you always know they are working hard for their owners and tenants. Shawn did our move in inspection and later met with us to make sure things were going fine at our rental property a few months after moving in. As a homeowner of a house out of state, we wish Management Apex was our Property Management company! Homeowners have peace of mind that they are protecting their financial investment but also making sure the tenants are taken care of and ensuring the entire process meets all needs.  So whether you are looking to rent your home or need a place to rent, you can have complete confidence in Management Apex, their services, and especially their outstanding team of professionals! They have helped secure companies to cut our grass, weed & pest control, and pointing us in the right direction with any questions- being new to the area-that has made our experience second to none! Welcome home to Management Apex!\n\nMany Thanks,\nChris & Amanda Cureton", "pics": null, "resp": {"time": 1467150878535, "text": "Chris,\nA big thank you for taking the time to write such a positive and sincere review.  It means so much to hear you are happy with the customer service you have experienced with Management Apex!"}, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "110935299110107619730", "name": "techie stephie", "time": 1507219901696, "rating": 5.0, "text": "I will definitely be using this company again. They have the best service around and Jessie Bush was EXTREMELY helpful. He went above and beyond to help me with all of my office space needs and answered all of my questions in a professional manner. 10 out of 10!", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "110492361774834326771", "name": "Derrick Watson", "time": 1581345857161, "rating": 1.0, "text": "These people never answer their phones an they can never able to get ahold of anyone for anything worst company ever", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "113819443147140972850", "name": "Shanika Lavender", "time": 1510073876373, "rating": 5.0, "text": "I was recently contacted by Ms. Alicia Jackson about a home I was inquiring about for my mother since shes moving from Georgia.\nShe was very helpful and took time out of her day to show me the property. This a great management company to work with Thanks Apex", "pics": null, "resp": {"time": 1510112969614, "text": "Thank you for taking the time to write us a review. It is always nice to receive good feedback about our Team members. You comments are greatly appreciated."}, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "104367204456635091728", "name": "oleeta hays", "time": 1454649494606, "rating": 5.0, "text": "Alica delivers! She provided the requested service promptly and professionally. She treated me with the care she would have given a friend. This woman is no fluff; she's got \"the right stuff!\"", "pics": null, "resp": {"time": 1456968821774, "text": "Thank you for your support. We agree Alicia is awesome!"}, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "106833844733484620409", "name": "Diedra Waddington", "time": 1508971528161, "rating": 5.0, "text": "I must commend the patience and understanding offered to me by Jessie Bush at Management Apex.  My dues check was never delivered by the post office and I was deeply concerned about the late fees.  Jessie was able to assist me in correcting the situation and assured me that the late fees would be removed once I confirmed that the check had been mailed on time.  The post office then messed up my certified letter but Jessie calmly reassured me not to worry.  Thankfully it was finally delivered.  The concern and care is not something usually experienced in these situations.  I am grateful for kindness shown to me.", "pics": null, "resp": {"time": 1510117917256, "text": "Thank you for your review. We greatly appreciate the time you took to write the kind words about one of our Team members."}, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "110758873415351092394", "name": "Thomas Staub", "time": 1544324279936, "rating": 5.0, "text": "As a client of many properties and transitioning from another in the area, Alicia was awesome, honest and prompt. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "105870231008217970288", "name": "Deron Anthony", "time": 1545035022451, "rating": 5.0, "text": "The joy of the season is awesome and we pray it remains with us through the New Year. My HEART swells with deepest gratitude for the spirit of sharing, caring and happiness that I received from my landlord Mr. and Mrs. Levert and APEX. Much respect for TEAM APEX.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "100842869319397366718", "name": "Nova wright", "time": 1591223615621, "rating": 1.0, "text": "Never answer or return calls.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "116740666011614322290", "name": "Mr Hawthorne", "time": 1451495049086, "rating": 4.0, "text": "This company is very military friendly and they took great care of us with hunting for our rental property. There are other companies that will treat you like a criminal and only care about your application fee. Management Apex is very professional and Companies like this don't strive on bullying potential renters. I HIGHLY RECOMMEND THIS TEAM OF PROFESSIONAL REALTORS!\n\nVH", "pics": null, "resp": {"time": 1451496180751, "text": "Thank you so much for your review."}, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "111403733204668721797", "name": "Brian Pirkle", "time": 1539868093484, "rating": 1.0, "text": "I am so dis-satisfied. Impossible to reach by phone. This company loves to charge bogus unnecessary fees! HOA Apex Huntsville Hates to actually lend their help. Most unprofessional company I have ever used. Never again will I make this mistake.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "106329258092693156124", "name": "Kandi Wright", "time": 1508343683066, "rating": 5.0, "text": "The team at Management Apex is courteous and always has the client's best interest in mind.  They work hard to handle their volume of business providing a sense of urgency and creating a win-win for all parties.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "113472985322614714441", "name": "John Green", "time": 1519786844837, "rating": 5.0, "text": "When I relocated, Management Apex managed my property.  The communication with Laura, Shawn and Alicia was flawless. They did an excellent job managing my home. Thank you all again.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "107415059568457717576", "name": "Amanda Howard", "time": 1508339328743, "rating": 5.0, "text": "Finally a Property Management company that actually MANAGES our properties properly! This is the company I have turned all of our rentals over to. I know its more common to only want to vent and share the negative reviews, but thought it was about time someone actually share their positive experiences as well.  Sure human errors happen, but as a professional group, this one has been top notch of the 3 companies in the past I have gone through! I have seen a serious desire to commit to always improving and being better, and end result, I have my properties full, well managed, and my monthly investments met. Thanks Management Apex! Especially Alicia, Laura, and Shawn!", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "107065611249511162914", "name": "Tyler Nau", "time": 1531618105946, "rating": 1.0, "text": "This has been the worst HOA company in Alabama. Avoid doing any business with them. This company was a huge waste of our time and money. Please do your research before using them.\n\nThere are so many other successful competitors in this market. Why waste your time an money here? Pay that little bit extra, for a professional company with proven results. It’s going to take several days before they even return your call. They are best known for adding unnecessary fees etc. to your bill. I should have charged them a “$100” fee each time they wasted my valuable time. Instead they will create ways to overcharge you with fines and fees.\n\nThe current field inspector Sam Benefield, is a total joke. Hopefully this company has set up some additional training programs for him to be successful in the future. He has a long way to go, to be considered a seasoned field inspector. However, Jesse is a good guy. Jesse is just trying to keep this failing company afloat. I will try to attach/share some photos and emails of our conversations in the comments below. This should help you make a smart informed decision, before getting into a contract with this failed part-time business. Please feel free to reach out to me for any additional personal feedback.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "100594302044467282572", "name": "HJ Sullivan", "time": 1469328672927, "rating": 2.0, "text": "I have not rented from them, but my experience was NOT good with this company. I scheduled an appointment to view the property and the person responsible for showing me the property did not show. The worst of it was that I traveled from Birmingham, AL and my time was wasted. I will definitely NOT be a customer nor a tenant of this company.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "103678933911497493903", "name": "Katie Milliken", "time": 1511982388957, "rating": 1.0, "text": "If I could give them 0 stars I would. I've owned a home for a little over a year now, and they never sent me information in the first place on where to pay my HOA fees. Then I got a message from my real estate agent that they were sending my fees to collections. If I had the information on where to pay or who the company was, I would have gladly done it. Instead I had to hunt them down myself. Come to find out, you can never get a hold of anyone in the office anyway. I left several messages and never gotten a call back,  Thankfully, my subdivision was recently taken over by a new management company, and I have had ZERO problems from them.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "114581771570731930793", "name": "Barry Bryan", "time": 1504891101213, "rating": 5.0, "text": "The company has assisted me in the purchase and sale of two single family properties and AJ went above and beyond on the last purchase due to delays from HomeTelos. She is current on market rents and knowledgeable of the sub markets. I intend to use her services for many more purchases, sales and rental of properties. Extremely pleased with the service.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "110875815909364695473", "name": "Andrea Crowder", "time": 1498147968680, "rating": 1.0, "text": "Interestingly, you will find almost all the top reviews are written by people who don't actually work with Management Apex - just hang out with them and \"watch\" from the sidelines.\n\nWe rented through Management Apex for two years. They were AWFUL! We had much better management through other companies - who would send someone to fix problems when there were issues. For the last couple months of our time there, the hot water heater was broken. It was leaking out horrible, nasty water (I'd be glad to share a picture here if there is any question on that). I was in touch with them and eventually heard back from an email that the owner didn't seem to want to fix it, so we're left with that. My whole family was sick during this time.\n\nWe were amazing renters. During our two years there we replaced all three toilets (that were stained beyond repair and had flushing issues) with high end TOTO toilets, replaced the dishwasher (that was spitting out black stuff and hair into our dishes and then into empty loads right after we got there), replaced a bench out front (that was broken wood with exposed, rusted screws), put protective doorstops behind each door (where they had gone through the walls behind them before we moved in), and repaired a rotting fence on multiple occasions. Once, and entire chunk of the fence fell down exposing the back yard to a busy road. We repaired that too.\n\nAt the end of our lease they did not return any money, or contact us, within the 60 day timeline. Because nobody would answer our calls or emails, we ended up going into the office after that time. We were first told that they weren't in the office (after the receptionist went down the hall to talk to them) and then she ended up finding someone for us - who told us that he hadn't gotten around to it. We waited. Eventually he came out with a partial check. Apparently after we moved out the owner had the rotten fence ripped down and a new fence installed - and they decided to charge us money for new gates (new double gate is what was circled on the invoice). We never had a double gate while living there. It would have been nice because we would have then been able to take our riding lawnmower into both yards rather than have a separate mower for each yard.\n\nAnd while we have never met the owner - I am inclined to believe that they have just as crappy of service on that side as well. Hence the reason he pulled his properties from them and had them listed with a new company the day after we were gone. Even though our checks were always in before the first of the month, if they had to wait for a check from them like we did, I don't blame him one bit!\n\nIf you want a decent company, whether as owner or tenant, I suggest you look elsewhere. One star is 20%. Management Apex does not deserve 20%.\n\nAny questions? I'd be glad to share more.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "115516739885902334851", "name": "Brittany Watkins", "time": 1489525885701, "rating": 1.0, "text": "Here is a tip for you...  Have all the homeowners, who use you as a rental property management company, write down in the paperwork they give to you ALL of the appliances they include in their rental property along with make and model.  I say this because NO TENANT should have to take off work to get this information for you or the repairmen.  It would be already done it would reduce the time GREATLY. I understand you want to save money and so does the homeowner, but it is unacceptable and poor service to have the TENANT do this for you.  TENANTS should not have to take off work because of your poor management skills. A LACK OF PLANNING ON YOUR PART DOESN’T CONSTITUTE AN EMERGENCY ON MINE", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "112529681421408166813", "name": "Brittne Parsons", "time": 1465396473274, "rating": 2.0, "text": "One of the main issues I have is the pool. We were promised a pass code to open the gate, but instead were told to just reach around and turn the nob. I know people use our pool who do not live in our neighborhood. Also, the bathrooms are dirty and is usually out of toilet paper.  I really do not feel like I get what I pay for.", "pics": null, "resp": {"time": 1465402844533, "text": "Your concerns are important to us, and we will be addressing them immediately."}, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "112138625646084682086", "name": "Abigail Tucker", "time": 1489510598315, "rating": 1.0, "text": "I have been trying for a year and seven months to get Management Apex to do what's in our Covenant and they finally began to deal with it this year but still have not resolved this ongoing Major problem. They do NOT respond to emails. I've had one email from Jesse and one phone call.  I'd Never recommend this company.\n\ngiven them a consequence for violations.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "103906960314980093802", "name": "Vivian Nau", "time": 1531623413262, "rating": 1.0, "text": "Imposible to reach by phone, they don’t take\nresponsibility for their own mistakes and lie about it, they look for any reason to sneak unnecessary fees, rude to their customers, unwilling to truly investigate issues brought to their attention, and turns a blind eye to the important ones. Poor customer service for sure.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "117938007546711004747", "name": "cj heartsill", "time": 1508360861472, "rating": 1.0, "text": "if it were possible to give negative stars i would give a -5. this is the worst management company i have ever dealt with. period. i moved out of my unit in June and have yet to receive a final inspection report or my security deposit. i have emailed, called ect.. to no avail with no response. i bet if i owed them 1,120 dollars i would have been in collections months ago. if you are reading these reviews to get an idea of how they do business, steer clear of these crooks!!", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "100599121376079264052", "name": "Nick Lioce", "time": 1459982613094, "rating": 5.0, "text": "From a business to business view, Apex runs a top notch operation.  The think I like the most, however, is that everyone seems happy.", "pics": null, "resp": {"time": 1459995439483, "text": "Thank you for your review Nick."}, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "110343290373117559454", "name": "Daniel Miller", "time": 1503436073083, "rating": 5.0, "text": "We are new residents to the Villas and appreciated the quick response from the management (Jessie) to our questions and a couple of concerns.  We are new to the HoA world and community living.  Jessie has worked to get us answers quickly and attended to a couple of community maintenance concerns we had in a timely manny.\n\nWe are expecting to have a great experience at the Villas at Jones Valley and expect our retirement years not to be disrupted with the normal hassles of homeownership.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "101732140435819282611", "name": "Ace Barnes", "time": 1468270529616, "rating": 1.0, "text": "You have a better chance winning the lottery than getting a person on the phone the first time you call...", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "103906960314980093802", "name": "Vivian Nau", "time": 1531623413262, "rating": 1.0, "text": "Imposible to reach by phone, they don’t take\nresponsibility for their own mistakes and lie about it, they look for any reason to sneak unnecessary fees, rude to their customers, unwilling to truly investigate issues brought to their attention, and turns a blind eye to the important ones. Poor customer service for sure.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "106229109254176960092", "name": "Angela Amos", "time": 1464021481717, "rating": 1.0, "text": "I have called several times and had to leave a message because no one ever answers the phone. I  call them about an issue, the same issue everytime, and not once has anyone called me back.  They haven't taken care of the problem because of course I had to call and leave a message again this morning,  so they haven't taken care of it.  It is very frustrating to me to pay them their fee every year and get nothing in return. I'm sure they would call non stop if I  didn't pay them.  Yet they get paid and can't answer the phone or deal with problems that we have. Very disappointed!", "pics": null, "resp": {"time": 1464040676615, "text": "The team member who fields HOA calls is typically out of the office between 10:00 - 3:00 each day performing community tours and home inspections. Calls are returned either when they return to the office in the afternoon, or the following morning.\n\nSpecifically related to this Resident, our Team member has spoken with them on the phone. Additionally, our Team member has shared this Resident's concern with the Board for their community. The challenge at hand has been approached from a few angles, including notification letters and calls to the police.\n\nPlease understand that the issue we are dealing with here is a difficult one, and we have made numerous attempts to resolve. The violation we are dealing with goes beyond the authority of an HOA manager, and should be reported by this Resident and other Resident's of this community to the local authorities."}, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "113556118498448644123", "name": "Valerie Johnson", "time": 1504790300204, "rating": 5.0, "text": "Management Apex is a reliable property management company with great people to work with!", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "112722149717862097464", "name": "margaret lessa", "time": 1554746533703, "rating": 1.0, "text": "Terrible company, You can never get a hold of a live person on the phone ever. Tried to rent several properties and tried to contact someone for over a week, couldn't even get back to me at all.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "106187157693007810234", "name": "Bubba Stallings", "time": 1456935531189, "rating": 1.0, "text": "Terrible service for HOA.  Never answer the phone, never respond to emails, never actually provide any type of tangible service.\n\nThey are contracted by builders to run an HOA and never give homeowners the opportunity to actually have a voice on the HOA board.\n\nWe have had them as our HOA manager and have wanted to discontinue service the entire time, but the builder in our community has constantly renewed their contract.  The builder is another story but I won't include the discrepancies of Hunter/American Homes on this page.\n\nFor some reason, they can't even get their act together to even receive payment for services, then they charge you a late fee because they don't put enough effort into their payment process.\n\nThey say that they have yearly HOA meetings - I have only been to one that was actually told to the community.  There were nothing but complaints in the meeting from the entire group, and nothing was resolved.\n\nI would not be surprised if other communities are not having the same problem.  I would be really surprised in no legal actions have been taken against this company.", "pics": null, "resp": {"time": 1456969282950, "text": "We surely don't like hearing of dis-satisfied residents, and are willing to listen to your concerns. Please feel free to contact us at 256-704-2112 so we can address any specific concerns within our contractual obligations. Respectfully."}, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "107312898871977736000", "name": "Kathleen Dunseith", "time": 1436112807643, "rating": 1.0, "text": "I have been dealing with Amanda Howard Reality/Management Apex for over a year. When I purchased my home I was not notified there was an HOA and remained unaware for 4 YEARS. I was notified there was an HOA and tried to find a way to be exempt (considering that I would not have bought the home had I known) to no avail. I called multiple times with no returned calls. The only way I ever spoke with someone was by showing up at the office. I kept getting the run around and \"I will have to get back to you on that\" - which they never did. Last year I spoke with someone and thought we had settled it that I would pay the dues owed since finding out we had an HOA (starting in 2014) and I have done this. This year, I get a notification that they are still trying to collect on the previous years and when I brought up the arrangement I was told \"Sorry for the miscommunication.\"\nThey are trying to charge me HOA dues for the 4 years I owned my home but did not know there was an HOA. They didn't even manage the HOA at that time.\nI would not use this company or Amanda Howard's if they were the last ones on Earth.", "pics": null, "resp": {"time": 1437534692893, "text": "Disclosing that a buyer is purchasing a home in a covenant restricted community is not the responsibility of a HOA management company. A HOA manager does not even have the buyer's information until this information is sent by the closing attorney. A HOA manager is however responsible for collecting annual dues. A HOA manager also does not have the authority to waive charges, this can only be approved by the Association's Board. In this particular matter, our company was provided with financial records from the previous HOA manager. These records indicated that this Resident had an outstanding balance. We are attempting to collect on delinquent accounts to better the financial situation for the association. In an effort to avoid the lien process, we have offered installment plans to assist Residents in bringing their accounts current."}, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "101567208920504492894", "name": "Beth Riggs", "time": 1508423248524, "rating": 5.0, "text": "Management Apex did a great job renting our property!", "pics": null, "resp": {"time": 1465402969817, "text": "Thank you for your support."}, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "100662325917720928143", "name": "Tamara Smith", "time": 1485971703821, "rating": 1.0, "text": "Terrible HOA service. Charges fees to do absolutely NOTHING, and IMPOSSIBLE to get in touch with.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "104519024122438773980", "name": "Erika John", "time": 1470677651442, "rating": 1.0, "text": "This company doesn't return phone calls and/or email or follow ups. Beware they don't return secruity deposits within 30 days per the lease agreements.", "pics": null, "resp": {"time": 1471362474103, "text": "We apologize for any misunderstanding with regard to the time period defined for returning deposit funds. We ask that you please review your lease, as the defined period for returning deposit funds is 60 days."}, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "111834509939001401749", "name": "Julio Ramos", "time": 1488832794628, "rating": 1.0, "text": "They are managing our HOA and I am unable to get anyone on the phone or respond to emails.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "109712630795709126186", "name": "Crystal Golden", "time": 1531892310655, "rating": 1.0, "text": "This company is a thief. They make up bogus charges and steal your money!!!!", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "117133042423852658584", "name": "Mid30sDad", "time": 1513604440119, "rating": 1.0, "text": "Another company bought our contract now I'm getting a $630 past due bill from where Apex never showed I paid my yearly fee. $120 a year for nothing. Terrible management company.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "105786135262227831589", "name": "Adam Stults", "time": 1508342907902, "rating": 5.0, "text": "Great property management company!!", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "117751411200781649151", "name": "Micah Baker", "time": 1543441368249, "rating": 1.0, "text": "No wonder this company has such low reviews so far, seeing as they never answer their phones.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "111485944082615535525", "name": "Casey Wheat", "time": 1494512397907, "rating": 1.0, "text": "Horrible NEVER answers calls or returns them.", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "107687514788547305648", "name": "rodney staggs", "time": 1486060882584, "rating": 3.0, "text": "Very slow and low staffed", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "107760044364761451446", "name": "Jennifer Stovall", "time": 1487008105142, "rating": 1.0, "text": "They claim to have a board for our HOA that reviews things I have written to the \"board\" every year since this company took over and I have never received a response", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
{"user_id": "110757784477588623476", "name": "Matt Adams", "time": 1483128267585, "rating": 1.0, "text": "The absolute worst...THE WORST management company around!", "pics": null, "resp": null, "gmap_id": "0x88626b5691bb8583:0x6cf227058ea80758"}
