{"user_id": "104397303214698464562", "name": "Doris Bell", "time": 1628543550654, "rating": 5.0, "text": "This is in response to my son, David Bell's review.  He was upset when I told him that after Answered Prayer finished their service in my home I found several items missing.  Several months later, the missing items were returned to me by someone that I knew and not connected to Answered Prayer.  It was then that I realized that  Answered Prayer had nothing to do with the missing items.  I have apologized to Answered Prayer.  They have responded in a most gracious way and accepted my apology.\n\nDear      :\n\nI am writing this letter in regards to accusing your employees of theft last year.  I apologize for my mistake.  The items I accused them of taking have been returned to me.\n\nOnce again, I apologize to Answered Prayers and these employees for my wrongful accusation and pray that you will forgive me.\nSincerely,\n\nDoris Bell\n\nI had accused back in 2020", "pics": null, "resp": {"time": 1628544002684, "text": "Thank You So much"}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "110377771715057782703", "name": "Susan Stringer", "time": 1615484621358, "rating": 5.0, "text": "Knowing that this home care service is owned locally makes a big difference.  Not only am I happy to support a locally owned agency they are extremely professional and do an amazing job caring for their clients.  The owners are a big part of our community and are real fine folks.  I highly recommend Answered Prayer Home Care.", "pics": null, "resp": {"time": 1615558214500, "text": "Thank you for the review. We sure do appreciate hearing this feedback."}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "100764745517782410757", "name": "Arla Chandler", "time": 1615484353389, "rating": 5.0, "text": "Once again Answered Prayer was a fantastic referral for a family friend. They visited once a week to give the family some time away from the home knowing their loved one was well cared for.  Thank you so much Answered Prayer team for always being the best!", "pics": null, "resp": {"time": 1615558223010, "text": "Thank you for the review. We sure do appreciate hearing this feedback."}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "105282582359851685951", "name": "Brittany Willis", "time": 1615403617064, "rating": 5.0, "text": "Can not say enough great things about Answered Prayer! The staff is helpful, professional, and companionate. Would highly recommend this company to anyone looking for in-home care!", "pics": null, "resp": {"time": 1615404047734, "text": "Thank you for the 5 star review. We sure do appreciate hearing this feedback."}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "104045705994923551345", "name": "joan williams", "time": 1604496725823, "rating": 1.0, "text": "In a time when we need consistency for our loved one, this agency has failed to deliver. Workers have no training on the basics from using wheelchairs to attending to basic needs. Workers report late and leave early...even asking to bring their kids along to a work location.  There is a different worker each day which does not give an opportunity for a relationship to develop between client and worker. They take advantage of elderly and/or sick clients if there is no one to advocate for them. I am disappointed. We have been patient, however, our needs have not been met.", "pics": null, "resp": {"time": 1604519114280, "text": "Thank you for providing constructive feedback that we can share with our team. It is our utmost priority to accommodate  families providing comfort, relief, and reassurance during a challenging time. Our goal is to work with families to create a constructive relationship meant to serve and provide care when families need it most. A member of our management team will be in contact to resolve any communication or service issues that may have occurred.  Thank you again for bringing this matter to our attention. Our management team is available to meet and revise a plan of care always. Please don't hesitate to reach out."}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "101670901803394577584", "name": "David Bell", "time": 1612816753937, "rating": 1.0, "text": "Do not use this company;  we had several items stolen and the company said they would follow up and then stopped responding.  Terrible experience at the worst time possible.  Follow up - I was contacted about the review and Answered Prayer did not wish to make it right (without proof through a police conviction).  If you hire them, make sure your valuables are locked up.", "pics": null, "resp": {"time": 1612897254961, "text": "Answered Prayer Home Care is a locally owned highly reputable and trusted home care service in the River Region. We thank you for bringing your concerns to our attention. As a leader in home care we are bound to a high standard of ethical and moral integrity, prideful of our outstanding caregivers who have been employed without incident for many years.  We place high standards on following protocols at all times.  It is our hope in the future when you or a loved one requires in home care you will consider choosing the integrity of Answered Prayer Home Care Services."}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "105558754163707568233", "name": "Charlotte Cearley", "time": 1544135163761, "rating": 5.0, "text": "So very thankful for Answered Prayer, and Irene.  This group has sent us very qualified and caring folks.  When S had to leave, we were immediately blessed by another caring person, Irene.  So many days, she lifts all our spirits as she lovingly cares for our mom.  Meghann, too, has been invaluable in helping us think things through.  Very grateful for the hard work of this group!", "pics": null, "resp": {"time": 1544186001012, "text": "Thank you!  We are always trying to do our absolute best.  I will share this with our team.  They will appreciate your kind words."}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "113282249556822425934", "name": "Mandy Beeson", "time": 1516040854802, "rating": 1.0, "text": "Would not recommend! I used this service for less than a year and had to request new caregivers multiple times because of issues with each one. The first one asked to buy all kinds of things from my home, as well as wanting to bring her Internet boyfriend over to meet my mom. Not ok. I don’t think their staff is trained to deal with Alzheimer’s patients and I had one “caregiver” who constantly argued with and agitated my mother. I finally decided that I was done with this company. I paid my last bill and they deposited the check, then tried to send my bill to a collection lawyer! Steer clear of this service!", "pics": null, "resp": null, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "102693880535757385584", "name": "Richard Crabtree", "time": 1574963956683, "rating": 5.0, "text": "Thank you for everything. You guys were great", "pics": null, "resp": {"time": 1578059504356, "text": "Thank you Richard. We always strive to do our best.  Appreciate your feedback!"}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "108699333513666355151", "name": "Del Chick", "time": 1533828640165, "rating": 5.0, "text": "I retracted my negative statement because John White, the owner of the company took care of the situation and was very apologetic, and he will handle the problem for my mother. He said it was a major miscommunication and I’ve accepted  that. You just have to reach out until you get the owner of a company and explain it to them, they’re usually more than helpful, as he has now been.   He Immediately went right out to see my mother! And we have a resolution worked out. Thank you very much John ! 👍", "pics": null, "resp": {"time": 1533783576364, "text": "UPDATE Hi Del!  We so appreciate working with you and appreciate you reaching out to us.  Have a super day!"}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "100027781594474476954", "name": "Peggy Johnson", "time": 1511912874339, "rating": 5.0, "text": "Very comforting to my family.  Was also very professional and companionate in caring to my daughter during the final time of her life.", "pics": null, "resp": null, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "113282249556822425934", "name": "Mandy Beeson", "time": 1516040854802, "rating": 1.0, "text": "Would not recommend! I used this service for less than a year and had to request new caregivers multiple times because of issues with each one. The first one asked to buy all kinds of things from my home, as well as wanting to bring her Internet boyfriend over to meet my mom. Not ok. I don’t think their staff is trained to deal with Alzheimer’s patients and I had one “caregiver” who constantly argued with and agitated my mother. I finally decided that I was done with this company. I paid my last bill and they deposited the check, then tried to send my bill to a collection lawyer! Steer clear of this service!", "pics": null, "resp": null, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "104100827503178628899", "name": "Morgan A", "time": 1531862418782, "rating": 1.0, "text": "I would not recommend anyone to use this company to help their loved ones. AnswerPrayer is the most disloyal, unprofessional, and unorganized home health company in Alabama.\nThey also dont give frequent drug screenings to their employees who's out there making mistakes on the job.\nMegan Wikof is NOT to be trusted, don't let her poker face fool you!!!", "pics": null, "resp": {"time": 1531944934015, "text": "Hi Morgan. We are very disappointed to learn of your dissatisfaction with our service provider.  Trust that we are evaluating any dissatisfied feedback that results from interacting with our company.  We will throughly research the comments above and will be sure to handle this with care, accuracy and professionalism.  We strive to always improve and your feedback will be evaluated constructively.  If you have an opportunity to review us again and can improve our rating we would appreciate the evaluation."}, "gmap_id": "0x888c2a6ea70bc0e1:0x8d5520b20d208ce2"}
{"user_id": "106871101799430229684", "name": "Carol-Ann Stewart", "time": 1616286244221, "rating": 5.0, "text": "Synergy Homecare was the perfect agency to support my dad’s stroke recovery. I needed a little extra help each weekday morning while my dad was on home health and his care giver (Brandon) really helped him gain his strength back.\n\nSynergy was very responsive and very easy to work with, I highly recommend this company.", "pics": null, "resp": {"time": 1617285655380, "text": "Thank you Carol-Ann it was an honor to provide care for your dad."}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "102407641770590147367", "name": "Delaris Juitt", "time": 1630341899390, "rating": 5.0, "text": "The office staff and caregiver are excellent Connie makes sure to provide the right caregiver to their patients.  Also counsel the caregiver on what the patients need.", "pics": null, "resp": {"time": 1630443795197, "text": "Thank you Ms. Juitt. We appreciate you!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "105152836720160835427", "name": "Jan D", "time": 1610993364460, "rating": 5.0, "text": "The caregivers we had were compassionate and loving. Helpful and caring. They took a load off our minds for sure. Synergy was easy to work with, as well. Thank you so much.", "pics": null, "resp": {"time": 1611160937729, "text": "Thank you Jan."}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "100953268878880699199", "name": "Tracey Sheets", "time": 1600803322962, "rating": 5.0, "text": "I continue to be impressed by all the staff at Synergy Home Health. Especially Mrs Keisha. I feel like they really care about the patient and as my husband’s caregiver, I feel very supported by Synergy. Everyone has been so nice and helpful. I’m extremely grateful I connected with Synergy.", "pics": null, "resp": {"time": 1600807057799, "text": "Thank you Tracey for your kind words!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "112357443399142504759", "name": "Aleshia Walker", "time": 1571425543312, "rating": 5.0, "text": "Working for SYNERGY has been an extremely positive experience.  The whole organization truly cares about providing quality care and support to each client, and is in this business for all of the right reasons.  They are available 24/7 and work hard to accommodate their clients' scheduling needs.  The office staff truly cares for each client like family and we have wonderful caregivers.  I'm excited to see what the future holds for Synergy HomeCare!", "pics": null, "resp": {"time": 1571428429210, "text": "Thanks Aleshia, we are blesses to have you on our team."}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "109757023190937385623", "name": "Jenny Hallyburton", "time": 1596589434418, "rating": 5.0, "text": "Synergy has great customer service and the management team has always been helpful. Scott and Lynn are always willing to meet families and answer any questions they may have. I highly recommend this sitter service.", "pics": null, "resp": {"time": 1596650962123, "text": "Thanks Jenny!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "111854529968598824500", "name": "Amy Whittenburg", "time": 1572538859541, "rating": 5.0, "text": "My mother is in late stage Alzheimer's and the caregivers have been wonderful with her.  They are very skilled and have the knowledge to deal with my mom on a daily basis.  They bathe, feed, keep her engaged and love on her.  Could not ask for a better company to take care of my mom.", "pics": null, "resp": {"time": 1572539905188, "text": "Thank you Amy!  We love working with your mom!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "102790628163316545891", "name": "Lady Te", "time": 1579859234962, "rating": 4.0, "text": "I will not be with this company much longer due to low pay, plus I found a wonderful family that I will be working for with much better pay. I love what I do and plan on staying in this line of work but love doesn’t pay the bills or put food on the table and clothe my children. I loathe being forced to work overtime just to make ends meet which takes time away from my family. I really do wish things were different because I absolutely love the company and some of the management. I just wish they paid based on experience but they don’t. If you are experienced you will be making the same as someone who has never done this before and are afraid of the elderly. They really do there best to show appreciation for there caregivers and cna’s but trust me, the best thing to do is pay your experienced employees a decent livable wage.\n\nYou can bet that whenever you see “competitive wages” on the job application just know that means you will be paid little to nothing and a decent check depends on how desperate you are for the money and if you aren’t desperate enough to do a boat load of overtime then don’t waste your time.\n\nI will say that Scott and Lynn are wonderful people and they are flexible with your shifts so you’ll be able to work what fits you best. Keisha, Kathleen and Santrece are so warm and wonderful to work with.\n\nI’d say this job is great for beginners and students who plan on going into medical. Although we do not provide skilled nursing like a Ltcf it is the basics and allows you to get your feet wet. I love the company but I’ve outgrown it and just because it’s no longer a good fit for me, doesn’t mean I will not recommend this company to reliable people who need work. I’ve already sent some people Synergys’ way.", "pics": null, "resp": null, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "101382569584896141318", "name": "T0785", "time": 1596580342498, "rating": 5.0, "text": "Thank you so much for your great care for our patients and staff at Arbor Springs!", "pics": null, "resp": {"time": 1596651018835, "text": "Thank you Taresa!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "101637236862186019155", "name": "Nicole Gachett", "time": 1597238908358, "rating": 5.0, "text": "Awesome staff and great welcoming atmosphere upon entry of the office.", "pics": null, "resp": {"time": 1597244129981, "text": "Thanks Nicole, you're awsome!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "108371891602155134744", "name": "Dwayne Long", "time": 1579543108674, "rating": 5.0, "text": "These are some truly amazing people who take  very good measures to insure that you are receiving the best possible care for what is going on and helps you understand all aspects of your care. And it helps that they have a great  attitude and outlook for helping people to understand.", "pics": null, "resp": {"time": 1596651070015, "text": "Thanks Dwayne!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "109195218335298633090", "name": "Janine Rumker", "time": 1542733229753, "rating": 5.0, "text": "Right from the very beginning, Shasta from Synergy made us feel welcome and cared for. She was patient and kind with my mother, who recently had a heart attack and had a stent put in. My mother is a caregiver, not used to accepting help and certainly a very proud and private person. She did NOT want any help, certainly not with bathing. Shasta knew just whom to send...Michelle. What a blessing! My mom went from not wanting any help, to wanting to take Michelle with her to her home in Florida! Michelle was so kind and understanding. She did things without being told, was efficient and sweet. I can't say enough good things about our first experience with home care. Thank you so much Synergy!", "pics": null, "resp": {"time": 1542753539473, "text": "Janine,\nTaking care of your mother was such a blessing. Michelle told us many times how much she enjoyed their time together. We wish the best for your mother in Florida and we will miss her.\nThank you again,\nShasta Kromer"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "105946262325231529260", "name": "venus9 Cotton", "time": 1584158205763, "rating": 4.0, "text": "I have never work there but I heard some good thing's", "pics": null, "resp": null, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "102790628163316545891", "name": "Lady Te", "time": 1579859234962, "rating": 4.0, "text": "I will not be with this company much longer due to low pay, plus I found a wonderful family that I will be working for with much better pay. I love what I do and plan on staying in this line of work but love doesn’t pay the bills or put food on the table and clothe my children. I loathe being forced to work overtime just to make ends meet which takes time away from my family. I really do wish things were different because I absolutely love the company and some of the management. I just wish they paid based on experience but they don’t. If you are experienced you will be making the same as someone who has never done this before and are afraid of the elderly. They really do there best to show appreciation for there caregivers and cna’s but trust me, the best thing to do is pay your experienced employees a decent livable wage.\n\nYou can bet that whenever you see “competitive wages” on the job application just know that means you will be paid little to nothing and a decent check depends on how desperate you are for the money and if you aren’t desperate enough to do a boat load of overtime then don’t waste your time.\n\nI will say that Scott and Lynn are wonderful people and they are flexible with your shifts so you’ll be able to work what fits you best. Keisha, Kathleen and Santrece are so warm and wonderful to work with.\n\nI’d say this job is great for beginners and students who plan on going into medical. Although we do not provide skilled nursing like a Ltcf it is the basics and allows you to get your feet wet. I love the company but I’ve outgrown it and just because it’s no longer a good fit for me, doesn’t mean I will not recommend this company to reliable people who need work. I’ve already sent some people Synergys’ way.", "pics": null, "resp": null, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "110463180510508467113", "name": "Urica Summers", "time": 1571426576882, "rating": 5.0, "text": "I started with Synergy last year it's a great place to work and the staff is very friendly and the schedules are flexible 😊", "pics": null, "resp": {"time": 1571428245321, "text": "Thanks, Urica!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "105536607524898326678", "name": "Gretchen McKenzie", "time": 1565981358160, "rating": 5.0, "text": "I have been working for synergy for two years and I love my job and they’re great people to work with.I give five stars to this awesome company!", "pics": null, "resp": {"time": 1565984793343, "text": "Thank you Gretchen!  We appreciate you so much!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "117152289914272617284", "name": "Erin Carter", "time": 1595974644799, "rating": 5.0, "text": "Great staff and so compassionate!", "pics": null, "resp": {"time": 1596026201190, "text": "Thanks Erin!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "115359726514514132019", "name": "Santrice McClure", "time": 1571425170185, "rating": 5.0, "text": "I start as a caregiver in 2015 when they first open up. I work in the field i absolutely love working for Synergy Home Care and the owners a very understand and i love working with them.", "pics": null, "resp": {"time": 1571428108107, "text": "You are an awesome caregiver."}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "102032324944818337779", "name": "Bruce Trowbridge", "time": 1628343803976, "rating": 5.0, "text": "My 94 year old mom fell and fractured her L1 vertebra the day after Christmas.  She was bed ridden for a couple of months due to the pain, and after the fracture healed remained bed ridden and on oxygen due to progressing congestive heart failure.  This lasted almost 6 months until she passed, with the last 4 months under in-home hospice care.  My mom lived with me, since she (and the rest of the family) did not want her last days to be in a nursing home.  I am a single man and with the constant care my mom required, I could not handle it on my own, I needed caregiving help.  I contracted out 60 hours every week for caregiving and I took the other 128 hours myself.\n\nI contracted with BrightStar based on recommendations from friends, and I was not disappointed.   BrightStar provided qualified care givers, and if mom and/or did not relate well with a particular care giver, BrightStar would provide a different one.  We eventually evolved to a core set of 2 regular care givers, loved by my mom and I,  covering all 60 hours per week.  I don’t know if other companies would be this flexible and supportive.  If a regular caregiver could not come, BrightStar would notify me and fill the gap, so that I could always count on a caregiver at my home at the planned schedule.  Knowing that a caregiver will be there, rain or shine, is a major consideration when determining if you want to hire a known private individual or a company with lots of caregivers.  Additionally, BrightStar schedulers, nurse, business office personnel were always a pleasure to work with and very supportive of mom and I during these trying time.  BrightStar may not be the cheapest, but you can count on them, so you just set your hours to what you can afford.  I highly recommend BrightStar, and if the need for caregiving arises for me in the future, I will be calling them.", "pics": null, "resp": null, "gmap_id": "0x8862691000000001:0x6ce406a91cbe1e64"}
{"user_id": "115435683279121778426", "name": "Mary Cashulette", "time": 1605815190430, "rating": 5.0, "text": "I had a horrible infection. This group is unbelievably professional and caring. Christy Jones came up with the idea of using a vac. My surgeon didn’t think about that. I trusted Brightstar more than him and was able to heal well. Thank you so much! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8862691000000001:0x6ce406a91cbe1e64"}
{"user_id": "101067890724144030572", "name": "Anna Elizabeth Jones", "time": 1454361694232, "rating": 1.0, "text": "100% client oriented.", "pics": null, "resp": null, "gmap_id": "0x8862691000000001:0x6ce406a91cbe1e64"}
{"user_id": "115534002393895043325", "name": "Tati Monű", "time": 1517447395292, "rating": 5.0, "text": "Great place great staff and caregivers", "pics": null, "resp": {"time": 1517540339926, "text": "Thank you!  We are pleased to be able to provide our services to the local, Huntsville community!"}, "gmap_id": "0x8862691000000001:0x6ce406a91cbe1e64"}
{"user_id": "108016584629829902208", "name": "Tiffany Walker", "time": 1614900384675, "rating": 5.0, "text": "I used this company for their tanning membership. They do home care but offer tannin beds in their office. I called first to ask info and they was very polite and knowledgeable about their services. I went today and it was clean and neat inside. Great beds, great friendly service. Thankyou", "pics": null, "resp": null, "gmap_id": "0x888d4782fd035ae9:0xd491eec3021f0153"}
{"user_id": "107035032176069261390", "name": "Karen Canary", "time": 1614793971816, "rating": 1.0, "text": "DO NOT TAKE YOUR LOVED ONE HERE. My father was in horrific shape when we took him home from this facility! He had a terrible rash from being left in soiled clothing for hours on end. He seemed to have lost his ability to speak until about a week after he came back home. It was like they gave him a lobotomy! He went in because he was having issues walking and came out unable to STAND, or COMMUNICATE! It took about two weeks for him to RECOVER from being at Encompass! Now he is back to his normal self, but still can't walk. How sad is that? He was treated more as an inconvenience rather than a human being! NEVER AGAIN!", "pics": null, "resp": {"time": 1614886149243, "text": "Hi Karen, we’re sorry to hear about your father's experience and would like to learn more about the situation. Can you please email HHH.Contact@encompasshealth.com with additional details?"}, "gmap_id": "0x88926dd3a53a7b1f:0xad96253e25bf621b"}
{"user_id": "107989794007856183536", "name": "Lisa Feher", "time": 1616156603187, "rating": 5.0, "text": "I want to thank Joy Valentino\n.for bringing a ray of sunshine into my life and recovery from knee replacement!She is indeed a treasure....i will miss her greatly!Anyone lucky enough to.have her come to their home will benefit!God bless u honey..ur so missed😥😍\n.", "pics": null, "resp": {"time": 1616266290536, "text": "Thank you for sharing, Lisa!"}, "gmap_id": "0x88926dd3a53a7b1f:0xad96253e25bf621b"}
{"user_id": "113410238153571785082", "name": "Regina Carnley", "time": 1596165265534, "rating": 5.0, "text": "My mother in law loves her nurse from Encompass and also loves her Physical Therapist. She is doing so much better now.", "pics": null, "resp": {"time": 1596198456130, "text": "Thank you for sharing and for entrusting us with your mother-in-law's care, Regina!"}, "gmap_id": "0x88926dd3a53a7b1f:0xad96253e25bf621b"}
{"user_id": "102362729356029701133", "name": "Billy S.", "time": 1551558022991, "rating": 1.0, "text": "Disappointed. Encompass was caring for my dad. He started coughing up blood and bits of tissue, and when this was brought to the attention of the nurse,  she claimed it was normal in COPD patients. They released him from they're care very shortly after, stating he's getting better. Less than a month has passed, and were here at enterprise medical center because of pneumonia. It was found out he has a tumor in each lung, one the size of a tennis ball. Hows this getting better??", "pics": null, "resp": {"time": 1565890337499, "text": "Billy, we apologize for the delay in our response and have forwarded this information to the appropriate contacts. If you’d like to share additional details, please email us directly at HHH.Contact@encompasshealth.com."}, "gmap_id": "0x88926dd3a53a7b1f:0xad96253e25bf621b"}
{"user_id": "110517755252872337692", "name": "Jeffery Tatum", "time": 1556071267029, "rating": 5.0, "text": "My father was recently discharged and is doing great now! Great job!", "pics": null, "resp": {"time": 1565890282386, "text": "So glad to hear your experience with Encompass Health was great! Thanks for sharing, Jeffery."}, "gmap_id": "0x88926dd3a53a7b1f:0xad96253e25bf621b"}
{"user_id": "108103515259737504254", "name": "James Barley", "time": 1539364923544, "rating": 5.0, "text": "Best home health agency! Staff is very caring and attentive. Would highly recommend them to anyone!", "pics": null, "resp": {"time": 1565890300875, "text": "We agree, James! Our Encompass Health employees are the best. Thanks for sharing."}, "gmap_id": "0x88926dd3a53a7b1f:0xad96253e25bf621b"}
{"user_id": "105040614970322723215", "name": "Jasmine Tierra", "time": 1625257563702, "rating": 5.0, "text": "I came here from Montgomery to earn my CNA license and I had an offer for a job interview back home in one of the local hospital’s emergency  departments before I even finished the program! Totally worth it as opposed to other programs that take up to 18+ weeks. My instructor Natasha was the bomb! She really wants her students to succeed and fully equips you for the field. I miss it there!", "pics": null, "resp": {"time": 1625319803659, "text": "Jasmine you were a great student and person and we wish you nothing but success in life. Thank you for taking the time to review our program."}, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "116182182075752727487", "name": "Savanna Upshaw", "time": 1625249015632, "rating": 5.0, "text": "I took the MA program at saads and everybody there are absolutely amazing", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "110388887821605397135", "name": "Deirdre Snyder", "time": 1611347103584, "rating": 1.0, "text": "Rude, rude, staff. No professionalism whatsoever. The staff could not care any less about helping you or being even the least bit friendly or polite. I wanted to do business with a local company instead of ordering online, but they’ve made it impossible. This is my second visit and the last time I will shop with them.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "103436375027839050242", "name": "Krystal Littrell", "time": 1611939749308, "rating": 5.0, "text": "We use SAAD for my mother who is on Home Health Care and they are wonderful. They work around your schedule and it's a wonderful relief for me to have nurses and CNA'S come out to help woth her care.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "111343532482788391659", "name": "Lannie Shearls", "time": 1620733573339, "rating": 3.0, "text": "The staff that came to my home was very attentive and did their job but management was uncooperative and rude and did not give our doctor the correct information.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "102589736285448526851", "name": "Kurstin Nicole", "time": 1579306115405, "rating": 1.0, "text": "I Do Not Recommend! I took the MA Course in Aug 2018 & I still haven’t landed a job. Nonetheless an interview. Some of my fellow classmates also haven’t had any luck. Don’t get me wrong the MA instructor was excellent. I have no complaints about her. I just feel that for the price you’re paying they should have a job placement program after finishing the course to help their students land a job. I wrote them asking about if they had a job placement program like the other Technical schools just to have my message left on read. Very unprofessional. It took for me to message them a second time just for them to respond. They don’t care about their students & their life after the program. All they care about is the money. Don’t do it. Go somewhere else.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "107435373335659462815", "name": "Kay Bradley", "time": 1581704477899, "rating": 5.0, "text": "The Staff is beyond amazing. I’ve used them for years for my Parents Homehealth needs and now for my Husband’s Hospice service. I haven’t encountered one member from this awesome team yet that don’t exceed all expectations. Truly an amazing group. From the store to the Nurses, Aides, Social Workers, even just someone that answers the phone. You can feel their genuine love and compassion for everyone.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "117629804098008598422", "name": "Jessica Deese", "time": 1596292457360, "rating": 5.0, "text": "Katlyn and Courtney found 24/7 in home health care workers in record time. They were relentless in their pursuit of getting the help\nWe needed in an incredibly short time frame. So grateful for their help!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "100552586008493434991", "name": "Diane Faris", "time": 1591198849754, "rating": 5.0, "text": "We have been using Saads for years as a source for in home care. I have been very happy with the nurses and aids that have cared for me as well as the physical therapists that have helped me. Sometimes one has to be patient with the logistics of appointments for in home care but other than that I would recommend this company whole\nheartedly. Recently my husband went under Hospice care in our home. One aid Erica was so outstanding  in her care for my husband that she was a true blessing. He had a wonderful nurse, Latoya, who went above and beyond the call of duty . She is an outstanding nurse who truly cares for her patience’s needs and those of the family.", "pics": null, "resp": {"time": 1591370041095, "text": "Mrs Faris, we are very thankful for your kind words and recognition of two outstanding employees. We will work to continue to improve the logistics of delivering care in the homes of our community and believe the time is coming when patience is always appreciated but only needed for special circumstances. We plan to provide a gift to the two employees mentioned as a way of thanking them for making a difference in the life and care of your husband. You have our gratitude and love."}, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "103451236787718480584", "name": "Hannah Derouen", "time": 1588952082535, "rating": 5.0, "text": "Would highly recommend SAAD’s. I personally know a lot of the staff and they are incredible people that truly care about their patients. They have cared for my grandparents as well.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "107089769266925254823", "name": "lcp191", "time": 1576121714212, "rating": 3.0, "text": "Don’t get me wrong, the hospice facility is absolutely beautiful, and the nurses are very friendly, but the way my family member was treated after they passed was very disrespectful.\n\nThey had passed early in the morning, and I was reassured they would call to have his body transported ASAP. They covered his body with a sheet, left him in the room, and there he sat from 5:30 AM until 6:00 at night. At noon, I asked what was taking so long, and was reassured they would be here shortly. I asked again at 2:30, and was told the same. Finally at 4 I went to the admin office, and they forgot to call. After they finally called, they were picking up his body within 2 hours.\n\nThey were very apologetic, but they need to improve on communication.\n\nAnd although this did occur, I still wouldn’t hesitate to recommend someone to this facility if they needed it, it is definitely the best in the area. I visited probably 5-6, and the others had as much as 20:1 patient to nurse ratio, while this was 6:1 I believe. Food was good, and for the most part the nurses were all friendly.", "pics": null, "resp": {"time": 1576171844319, "text": "Lcp191, I appreciate your kind words about our care but I am deeply saddened with your report as nothing short of five star experience is acceptable to us.  It is an honor to care for patients and family members during this time. We respect this time very much and would never want a family to feel we are rushing to get their loved one out of our hospice retreat. Also, we are very much aware of when a patient has passed and work with our local funeral homes to make sure transport is arranged promptly. I am unable to determine what loved one you are referencing with this experience after passing and I ask that you call us and reference your review to speak with either our program director or with our Vice President. They are both hoping to hear from you so we can learn from your experience and make sure we deliver tremendous love and dignity for all patients and families we have the honor to care for.  251.380.3810"}, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "100691518852368159494", "name": "Robyn Danielle", "time": 1579880072925, "rating": 5.0, "text": "I took the Phlebotomy course. The instructor was knowledgeable and made the class fun. I would recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "112855492369501846261", "name": "JahMyiah Pollock", "time": 1521734986225, "rating": 5.0, "text": "I took the phlebotomy class and the instructor, Vic Walton, was AMAZING! Vic is the funniest man i know but he is also the best teacher i ever had! It’s a great learning experience; he will teach you everything you need to know and the second week you’ll be sticking patients at the hospital. It is a GREAT experience and it is definitely worth the money!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "115661041174065718004", "name": "Kim", "time": 1589896886560, "rating": 1.0, "text": "This place is EXACTLY what is says SAAD as hell!!! Do not use this company!!!! Especially Ms. Fulghum! This woman has no manners and is mean as a snake! STAY AWAY!!!!!", "pics": null, "resp": {"time": 1591370979311, "text": "Kim, your post unfortunately doesn't offer much in the way for us to improve. Saad is an arabic name as John E. Saad was the founder. His parents immigrated to this area from Lebanon and Mr Saad was very proud of his heritage and therefore named the company Saad Healthcare. Saad in Arabic actually means happiness, prosperity, success and good luck. Although you may have not had that kind of experience with our company, we do wish you happiness, prosperity and good luck in life. Your one other review on google seemed to indicate you have had other experiences where you reference someone you did not like and I hope you will post some reviews of places that bring you more happiness than the two you have chosen to review."}, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "106410530640102199650", "name": "Kayla Robinson", "time": 1534146438302, "rating": 5.0, "text": "I give Saad healthcare training and education service a 5 star! I had a great experience and received a lot of support to succeed in obtaining my phlebotomy certification. I was referred to this school from a local relative and I live out of town, coming from Massachusetts.I highly recommend coming to this school! My classmates and instructor were phenomenal. I gained so much knowledge about phlebotomy while attending. Thank you!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "112403386819159253369", "name": "Tye Roberson", "time": 1545093809919, "rating": 5.0, "text": "The Phlebotomy class was all I expected it to be, I really enjoyed the clinical portion and the hands on training. Our instructor Vic was AWESOME... a very knowledgeable patient individual who knows his craft. Hats off to Saad Heathcare for having such a well rounded instructor to teach. I'd refer anyone to take this class under Vic's leadership.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "100289629727852263591", "name": "Suzanne Karam", "time": 1576169420466, "rating": 5.0, "text": "The best constructed wheelchair I have had. The Saad's courier delivered my wheelchair to me at the hospital because I was being discharged on Sunday afternoon. Excellent quality in the equipment, and excellent quality of service from Saad's---the Patient Care Specialist, working in concert with the hospital staff, pursued my needs very efficiently and with precision. The physical therapists and nurses have been delightful!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "100593738433812147668", "name": "Elizabeth Peterson", "time": 1579644849999, "rating": 5.0, "text": "Saad has great customer service and if you have an order paid for by insurance that needs a pickup and advise what time you will arrive they have it ready at that time for you. Or just as you arrive so you will not have to wait at all.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "114929886995964051466", "name": "Shantrel Patrick", "time": 1520292115130, "rating": 5.0, "text": "My personal experience has been a wonderful one. The staff at Saad are both professional and efficient. I recently received my certification in phlebotomy and my instructor, Mr. Vic, was amazing. In just 3 weeks, he managed to teach everything we needed to know, to CONFIDENTLY & SUCCESSFULLY perform a phlebotomy in any arena, all while giving a good laugh.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "118381645402261227347", "name": "Dylan Clayton", "time": 1575813155014, "rating": 5.0, "text": "The nurse's are nice and the man cooking food is 11/10. Food is good did not expect that.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "107835493611532435555", "name": "K B", "time": 1563923443271, "rating": 5.0, "text": "I just finished the phlebotomy course and Vic is one of the best instructors I have ever been given the opportunity to learn from! Vic makes the class fun all while learning what you need to know to become a great phlebotomist. The hours may seem long but with such an amazing instructor that goes out of his way to make sure each individual learns and goes on to succeed in this job field the time fly's by. I would recommend Saad and Vic Walton 100 percent.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "115044511985254598818", "name": "Heather Board", "time": 1579880182645, "rating": 4.0, "text": "Took the phlebotomy course with Vic Walton, 100% would recommend anyone wanting to take this course to make sure he is the instructor. Our class of 3 weeks was well informative and we all passed the class and medca exam with A's. Vic trys his hardest to get you a job afterwards and makes sure you get the best out of your money.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "103737676487661534961", "name": "Ashley Burke", "time": 1520019715716, "rating": 5.0, "text": "I just graduated from the phlebotamy program and it has been one of the best decisions I have ever made! I wasn't confident at first, but with my instructor, Vic Walton, I became extremely confident in my abilities very quickly! He's a great teacher and full of a lot of knowledge. 10/10 would recommend this class to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "103238149531223491429", "name": "Kayla Porter", "time": 1555013193443, "rating": 5.0, "text": "I took the phlebotomy course in October, Vic Walton was my instructor. I couldn't be more pleased with my time there. Vic was more than helpful and did everything in his power to make sure that we were on track, no one was ever left behind. Honestly I would recommend this course to anyone who's looking for a change and who is looking to be certified. All of the instructors are wonderful and it was an experience that I will keep with me forever.\n\n2 months after I finished the classes and relocated to Florida, I was employed with lifesouth and every day I go to work and enjoy what I do.\nI appreciate my time at SAAD more than you know and I hope that anyone who is considering taking this opportunity decides to give it a shot because you won't regret it.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "117224497552447609984", "name": "Milissa Ziegler", "time": 1585924866842, "rating": 1.0, "text": "I tried to have a prescription for medical equipment approved through this company and every time I call they gave me a different excuse as to why it’s was not processed and said they needed more information from my doctor. My doctors office gave them more information and there would be another excuse. This was for a nebulizer which I needed. I also try to use them two years ago when I had knee surgery and I had the same issue. I would not recommend this company to anyone", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "104824697732381539608", "name": "Frankie Henry", "time": 1529682483761, "rating": 5.0, "text": "I’ve just completed the Certified Medical Assistant program and we could not have had a better instructor! She made everything easy to understand and stressed the importance of making sure we did everything correctly!! I recommend everyone who is interested to sign up!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "104164672565451965845", "name": "Shirley Stallworth", "time": 1576262909941, "rating": 5.0, "text": "I always have a good experience when I’m shopping at SaadHealth.  The staff are knowledgeable, and pleasant.\n\nS. Stallworth", "pics": null, "resp": {"time": 1576268698527, "text": "We are very thankful for you and appreciate your kind words."}, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "105531683509141889547", "name": "Erin Galey", "time": 1579881258342, "rating": 5.0, "text": "I have completed the certified phlebotomy technician program through Saad health care. I can honestly say their teaching programs are by far the most professional, organized, and innovative facility.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "104036838626785980890", "name": "Russell Perkins", "time": 1576200374855, "rating": 5.0, "text": "Very quick service from 2 friendly staff members.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "114481963440300789140", "name": "Sarah Jernigan", "time": 1516112434059, "rating": 5.0, "text": "I absolutely love this course and my instructor. I’ve learned a lot, and I honestly wish the course was longer because we have such a great time and Vic’s teaching methods are amazing. I highly recommend taking this class.", "pics": null, "resp": {"time": 1516114413796, "text": "Sarah, thanks for your review. We love Vic too and are so thankful to have great instructors. Thank you for choosing our program and we wish you the very best."}, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "114811735846599365758", "name": "Deborah Williams", "time": 1574865752311, "rating": 1.0, "text": "As Thanksgiving fastly approach, my heart gets heavier & heavier my first holiday season wthout my mother. Although she was never was allowed to be off to celebrate & create memorable moments wth her family, jus to pick up the phone & hear her voice say “hav a Blessed Thanksgiving I love you” 😭 made my day! She was working serving the Saad family creating memorable moments for their family on every holiday. For over 50 yrs she did this & shared many stories of how they treated her & the things she would suffer if she did try to take off. What a very heartless family! I would always tell her mama please let me say something to them this is not right! They are violating labor laws & your civil rights, she would say “no this is not the time” me being an obedient child would always obey my mother wishes. They stood up @ her funeral and spoke on how much they loved their dear Marybelle which was a lie, they loved what Marybelle could do for their family. FOR GOD SO LOVED THE WORLD THAT HE GAVE!!! GOD GAVE, HE ADDED VALUE NOT TAKE IT AWAY!!! That’s what love does!!! My mother is gone to her Heavenly Home, now it’s time to tell the story. The true story!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "105937809863153740488", "name": "Brandy Bumpers", "time": 1521923074454, "rating": 5.0, "text": "I currently completed the Phlebotomy class, and I loved it. Vic(Instructor) was terrific. He made the class very interesting. He was so helpful.  The class was very hands on. You actually get to perform  phlebotomies and not jus READ about them. I feel very confident in my skills and I'm ready to search for a job. This class was MONEY well spent!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "112843770104391580201", "name": "Kristin Brantley", "time": 1518279386829, "rating": 5.0, "text": "I just finished the phlebotomy course with Vic Walton and it was a wonderful experience. He made sure we knew our stuff. He was very helpful and forthcoming with information. He made the class fun and enjoyable. I feel very confident and comfortable with sticking people and look forward to a career that I will enjoy. This course fully prepares you for the real world. I met some wonderful people during clincals and I feel this is the right place for me. If you are considering this course or any of the other courses SAADs offers, they are very forthcoming with information about them.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "106469005556727229807", "name": "Orion Savoy", "time": 1516026510874, "rating": 5.0, "text": "The phlebotomy class has been a blast! I feel equipped to join the work force! I would reccomend this to anyone trying to get into the medical field. Vic ,the instructor, is a nice, funny guy. Good comic relief.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "111956575317290893383", "name": "Shyaunna Echoles", "time": 1568744510827, "rating": 5.0, "text": "I took the phlebotomy course almost a month ago and had a very good experience. Vic is an awesome teacher and helped in every way he could!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "117176364859831372836", "name": "Dr.David Callaway", "time": 1556508809555, "rating": 5.0, "text": "Great place for  your medical needs.They have great customer service.", "pics": null, "resp": {"time": 1553890601399, "text": "Hey David, we are very sorry to hear about your experience.  Our owner was made aware of your complaint would like to assist you personally.  Her phone number is 2512878889.  We apologize again and will take actions to prevent this in the future."}, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "113870546230787053740", "name": "Veronica Livingston", "time": 1521734439920, "rating": 5.0, "text": "In three weeks I feel that I have learned everything that I need to be able to perform in the real world. The second week of class we did clinicals at Providence hospital. Everyone has been very nice and made sure that we knew what we were doing. I highly recommend taking this class with the instructor Vic Walton.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "110541610668385812464", "name": "Uncle Jimmy", "time": 1545745535815, "rating": 1.0, "text": "AVOID this company at all costs! Aide was not ethical. Took advantage of my family member, an elderly man who is very sick. Police report made. Investigation unway while Owner of this company admitted her Aide’s actions but said her employee did nothing wrong! But take note, she terminated the Aide immedtely. As a result of this company, it has affected our entire family coast to coast with stress. We want to keep others from enduring the Dane if not worse. Do your due diligence first.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "109609613835616135007", "name": "Paige Bryan", "time": 1515949763219, "rating": 5.0, "text": "The phlebotomy class has been the most fun experience! 10/10 recommend for anyone looking for a career!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "118223952195832767229", "name": "kathleen woodruff", "time": 1557535703910, "rating": 4.0, "text": "I just completed the phlebotomy and the teacher Vic was great he made learning fun and made sure we knew how to be a great phlebotomist", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "108118177965588951142", "name": "Herman cobb", "time": 1558551482171, "rating": 5.0, "text": "I give sadd nurses a 5 star they are the best", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "113690855683728642641", "name": "Honestly Loyal", "time": 1515623450478, "rating": 1.0, "text": "I paid $800 for a phlebotomy class and did not receive the correct amount of clinical training hours. Throughout the 3wks.we were there, we only received 4 clinical hours in 1 day on a Saturday at a hospital in which our classes nor training were scheduled to take on weekends. Therefore only 5 of my classmates came and unfortunately the other ones could not because it was a Saturday. In which means they were not able to do any clinical hours. Unfortunately that was the ONLY 4 clinical hours for the entire complete 3wk.program. My classmates and I were cheated out of $800. Not a place to go for a phlebotomy training class. Don't waste your money. Go somewhere else and get the proper amount of training and clinical hours for your money's worth.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "112361321735294789974", "name": "Olivia Turner u", "time": 1533880900572, "rating": 5.0, "text": "Education department is wonderful and the phlebotomy teacher was excellent and knowledgeable", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "104259058254191468788", "name": "Brandi Murdaugh", "time": 1520029572928, "rating": 5.0, "text": "I finished the Phlebotomy class today and completely loved my experience at Saad's!! I had the best instructor. Vic Walton is an amazing teacher!! He made my learning experience a success. I was nervous and unsure of myself, but he taught me how to become a confident phlebotomist. I'm now on my way to a bright future as a phlebotomist thanks to my instructor Vic and education opportunity Saad's provided. I highly recommend this course!!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "101750578675502308346", "name": "takira baxter", "time": 1516206344033, "rating": 1.0, "text": "I attended a college where we received 160 clinical hours and up to 150 pokes in our phlebotomy course program. The phlebotomy program at Saad's no where near provided this to their students. My friend's instructor stayed texting and looking at the phone a lot while trying to teach them.  Clinical hours are the entire main key to having the knowledge, skills, and abilities to drawing blood. Saad's did not provide them or give them any clinical hours at all so they were lacking terrible skills and abilities of drawing blood because of the no clinical hours and lack of training. All the students complained and felt like the only thing they paid for was a phlebotomy button Saad's gave them after they were finished with the program. A hope to get job in the med.field but not a living off of job. Plus it's a very challenging job to get because too many people are trying to get a license for it so it is too much competition. Majority of jobs only hire experienced workers with 2+years of experience because they are afraid that you may cause a patient to have a permanently injured arm (hematoma) so they do not take risk. A permanent injury can cause the patient to sue the hospital. Volunteer programs do not offer many openings either because they are also afraid that you may cause an injury to a patient's arm so they do not take a risk on non experience phlebotomy technicians either. So be careful with this chose of career because it is no where near guaranteed to get a job for a while. And hospitals are starting to let RN nurses do more drawing blood than phlebotomist. So it makes it even harder to get a phlebotomy job. I also recommend and advise you to attend a college that offers the same cost for this program, more training, clinical hours, and you may have a better chance of getting a job. Because jobs trust colleges way more than a student who attended a healthcare place offering a program. Especially not Saad's due to their lack of non clinical hours and training.Take my advice seriously.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "109266193797410791492", "name": "John rohman", "time": 1498214119661, "rating": 5.0, "text": "To the saad's family, the Rohman family has been using saad's home healthcare services for nearly four years, we have had numerous visits from physical therapist, nurses and and home health aides all considerate  and very professional. There is one who stands out above all nurse Kerry Y she recognized the need of her patients share her ideas and techniques displays harmonious and  cooperative spirit, always conducts herself in a professional manner and was an important contributor to speedy recovery from a installation of ankle fixator. I'm certain. other patients benefit from nurse Kerry loving care it's been a real pleasure to have her in our home. Sincerely John Rohman chief engineer unlimited (ret)", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "112914118622779802302", "name": "Woody Yonts", "time": 1491241892546, "rating": 1.0, "text": "Upon the advice of my orthopaedic surgeon that SAAD was a top performing equipment provider I  bought a rubberized leg cast cover that the saleslady had a very hard time fitting, even after putting it on over a plastic bag.  It was more difficult to remove.   After taking the cast cover home, my wife and I struggled with the cover especially having a difficult time removing it.  I used the device one time and it is too hard to use.  I tried to return the clean and undamaged item to the store approximately 14 days after the purchase.  The salesman declined to return the item and his manager backed him up.  The sales receipt does state they have a 7 day return window but in my case I was unable to return the item in the stated time period.  Although there are several more expensive items that SAAD carries that I need to purchase,  I will take my business to a SAAD competitor.  Potential SAAD customers beware of purchasing an item that is extremely hard to use and beware of the lack of flexibility in the SAAD item return policy. SO SAAD.", "pics": null, "resp": {"time": 1491856726654, "text": "Mr. Yonts, we are very sorry about your experience at Saad Medical.  We would like to fully refund you and hope that you would trust us in helping with any future purchases. Please contact David Parnell our store manager at (251) 287-8933 or stop by our location on University BLVD.  We take pride in our customer service and look forward to assisting you in any way possible.\n\n-Saad Ownership"}, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "109300289197021295448", "name": "Passion Martin", "time": 1495720303045, "rating": 1.0, "text": "Cna education department never answer they phone. Every time I call to register for the Cna program, it seems like I could never do so bc I can't seem to get in contact with anyone. I leave voicemails never a call back.", "pics": null, "resp": {"time": 1495733212950, "text": "Thank you for bringing this to our attention. We are very sorry about the inconvenience.  Please call (251) 343-9600 and ask for Barbara Fulgham. She is will assist you with registration.\n\n-Saad Management."}, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "104334190412356343353", "name": "Maddi Owens", "time": 1520117444892, "rating": 5.0, "text": "I learned more in 3 weeks than I ever thought was possible! My instructor was Vic Walton & i fully recommend taking this course with him.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "109126253863898395616", "name": "Bea Phillips", "time": 1540468663500, "rating": 1.0, "text": "I have never worked with a company that demanded my SS card when equipment is approved by insurance with 0.0 copay. After approval, this company had my doctor's request for equipment, and still would not deliver without further paperwork from my doctor.\nAfter a month of poor service, I had to go elsewhere. Please shop around before crashing into Saad's.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "109396910537942618601", "name": "vanessa brown", "time": 1542262126393, "rating": 3.0, "text": "My Dad considered this facility. We chose a different one. He needed more care than this one provided. This facility is more for seniors who are able to prepare their own meals and don't need as much support. The facility doesn't provide 3 meals per day and does not have an RN for every shift. IMO, if the senior is in reasonably good health and just needs an occasional \"look in\", then it could be fine. I felt as the seniors needed more help with daily living activities then that's when the facility really makes their money. I will be honest and say these are my opinions and everyone knows what that means. The 2 bedroom apartment was nice esthetically,  the staff seemed nice. It just wasn't a fit for my parent. My objective in this post was the photos of the apartment. Hopefully it helps someone.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPmN4GyAdHKnj1ZdMzAvbrvxNotws0ICVoAuD4s=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMMQuu16wJsnqYWVfb0rOT4J1aZTXrBAJwt3lcx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM-YIhdP4mdxOrL5D_faigvKHR2upfkHib40qvS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO6VbMZ-Qv2z92wLacs3XBzgm2tkeK3-c9ck8Q3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOPEvoB0RorVysmA7VzhspeaBrQahgweZlzVTVn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOdcIAo5fkZkuevUa67fJa4q5eQBDfAWx-sZfpt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO79tzSS_-vKEcCBq4D4nwc0RM0-yGSM4CcHwES=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMAASjgqwBDWddbhiZC2i2RRBObex9wST-wwzYj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN90S9rVfS6lKUtcbyz-ohwS-vAoZXF3pRyHXAc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPncoewE0lSYfLSsE0FR7kfEby28l_kO_9uKmFM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPDabNfkj1awVkG0jSfAJ9oo2i5EpDc-aSmnhyW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMVbu1E-6S0hHSugbA-mIykxp5HC36Wsk2lZJao=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "111030873461850762635", "name": "Anthony Bowen Sr.", "time": 1590526970541, "rating": 5.0, "text": "I have been living here since August 16, 2019 and I find this is like my best place to reside and it’s a great place to live. I plan to be here for a long time.", "pics": null, "resp": null, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "103973485537537315420", "name": "Cynthia Lee", "time": 1541785818819, "rating": 1.0, "text": "BEWARE OF THIS PLACE!! My father lived here and do to health reasons needed to be transferred to a nursing home. We gave the notice to Brookdale and moved him out. Two months later they drafted 1640.00 from his bank account!!!! AFTER he was no longer a resident for two solid months!! Now they are refusing to give his money back and we can't afford to pay his nursing home for the month. They are shady and all about money. They are not honest and will take advantage once they have your bank account information. I recommend going somewhere else to a place that has integrity. BEWARE OF THIS PLACE!!!!", "pics": null, "resp": {"time": 1542231781083, "text": "Cynthia,\n\nWe are aware you have spoken to the executive director regarding this matter. Our district director of operations also left a message for you, and we encourage you to call her back if you wish to further discuss."}, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "106889816728629286135", "name": "Laron Hardy", "time": 1574281326361, "rating": 5.0, "text": "My mother has been at Brookdale Cedar Springs for almost a year, and we couldn't be happier.  I would highly recommend Cedar Springs.", "pics": null, "resp": null, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "116233651757463573141", "name": "Doug Tucker", "time": 1544677761719, "rating": 5.0, "text": "My mother in-law was a resident here. I visited many times. Nice place.", "pics": null, "resp": null, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "115188021648706631673", "name": "Gail pollard", "time": 1579658119182, "rating": 5.0, "text": "I have been working there almost 4 years. Kim is very good to work for-compassionate, kind , firm, but will always treat you fair. My job makes me feel needed, wanted, appreciated! Love my fellow workers, because Kim hires good people", "pics": null, "resp": {"time": 1579713384335, "text": "Thank you Gail!  We love having you on our team!"}, "gmap_id": "0x888a520bfc719ea5:0x4ea03854aa04db0d"}
{"user_id": "111791023650472946921", "name": "Sharon Chandler", "time": 1579647093523, "rating": 5.0, "text": "Friendly service, friendly office personal, all around great people. Couldn't ask for better.", "pics": null, "resp": {"time": 1579656534897, "text": "Thank you Sharon!"}, "gmap_id": "0x888a520bfc719ea5:0x4ea03854aa04db0d"}
{"user_id": "116180243978874518131", "name": "Tami Hayes", "time": 1620763693296, "rating": 1.0, "text": "Place was a nightmare for my mom. Wrongfully diagnosed her and almost lost my mother.", "pics": null, "resp": null, "gmap_id": "0x888f949d36424003:0x58ea8a50517b4e1"}
{"user_id": "100279942018704890942", "name": "ur_local_dum_gurl", "time": 1618731329248, "rating": 1.0, "text": "nurses are rude the doctors are slow and dont know anything", "pics": null, "resp": null, "gmap_id": "0x888f949d36424003:0x58ea8a50517b4e1"}
{"user_id": "118009806210121412050", "name": "Jessica M", "time": 1569414018307, "rating": 1.0, "text": "To call this building a hospital is an insult to hospitals. It's honestly a pit stop before you can get to a real hospital . Doc mcstuffins would do a better job than these people and she has a better bedside manner. Just put the gas in your car and go elsewhere. #thankmelater", "pics": null, "resp": null, "gmap_id": "0x888f949d36424003:0x58ea8a50517b4e1"}
{"user_id": "107940863255834833375", "name": "john hulstrunk", "time": 1597838470575, "rating": 5.0, "text": "Kind caring staff and doctors.", "pics": null, "resp": null, "gmap_id": "0x888f949d36424003:0x58ea8a50517b4e1"}
{"user_id": "101098688309592072276", "name": "Lasandra Jones", "time": 1570060465991, "rating": 1.0, "text": "Wouldn't take my wounded pet here", "pics": null, "resp": null, "gmap_id": "0x888f949d36424003:0x58ea8a50517b4e1"}
{"user_id": "108860901039845660642", "name": "Mary Hicks", "time": 1519579307127, "rating": 4.0, "text": "A very important part of the community.  They have helped our family on more than one occasion.", "pics": null, "resp": null, "gmap_id": "0x888f949d36424003:0x58ea8a50517b4e1"}
{"user_id": "110775477906069903485", "name": "James matthews", "time": 1552691730017, "rating": 1.0, "text": "Worse hospital ever the treatment is horrible,lack of technology,lack of education on medicine, misdiagnose my father almost lost him.", "pics": null, "resp": null, "gmap_id": "0x888f949d36424003:0x58ea8a50517b4e1"}
{"user_id": "114060693269077622084", "name": "Landria Butler", "time": 1447037893436, "rating": 1.0, "text": "Because  they  be trying to keep people and there  over  night", "pics": null, "resp": null, "gmap_id": "0x888f949d36424003:0x58ea8a50517b4e1"}
{"user_id": "106732304407467933113", "name": "Lyman Holland", "time": 1613854838902, "rating": 1.0, "text": "Workers have not shown up two Saturdays in a row. No calls from company. I have called them, they promised me they would call back in 15 minutes. It has been 45 minutes and they have not called back. They will not answer their phone when I try to call them. My father is bed bound. Due to health issues I can’t change his diaper. Very frustrating I wouldn’t waste your time and money. They really don’t care! Last Saturday the excuse was snow and ice. This is Mobile we didn’t get any snow or ice.", "pics": null, "resp": null, "gmap_id": "0x889a4d1526c7e5cd:0x63f50e0167e05eb8"}
{"user_id": "111370876698018911290", "name": "Cota", "time": 1602867506998, "rating": 5.0, "text": "Great company with great service.  Would highly recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a4d1526c7e5cd:0x63f50e0167e05eb8"}
{"user_id": "106570938823520019133", "name": "William McHenry", "time": 1514520260003, "rating": 5.0, "text": "Very grateful for these people.", "pics": null, "resp": null, "gmap_id": "0x889a4d1526c7e5cd:0x63f50e0167e05eb8"}
{"user_id": "106420673457863890117", "name": "Brandy Hicks", "time": 1524105419666, "rating": 5.0, "text": "Amazing customer service, good quality products, and reasonable prices. Thankful that they not only take regular insurance, but my kid's Medicaid as well! Will definitely be coming back to them in the future!", "pics": null, "resp": null, "gmap_id": "0x88626caeb1a15a8f:0x43ba823f3940686e"}
{"user_id": "106253745927494872815", "name": "Hannah Boon", "time": 1544293165725, "rating": 5.0, "text": "Great customer service from Greg and Propst Home Health Care.  He actively listens to his customers’ needs, and he goes to extra lengths to ensure satisfaction.  He is knowledgeable about his products and always friendly and kind.", "pics": null, "resp": null, "gmap_id": "0x88626caeb1a15a8f:0x43ba823f3940686e"}
{"user_id": "107500030211989555065", "name": "Diane Duncan", "time": 1491270976034, "rating": 5.0, "text": "The service has always been quick, polite, and extremely useful. No problems with returns or pushy sales. Reasonable prices and they deal with the insurance for you.", "pics": null, "resp": null, "gmap_id": "0x88626caeb1a15a8f:0x43ba823f3940686e"}
{"user_id": "107029634163127871772", "name": "Scott Renner", "time": 1487774535500, "rating": 5.0, "text": "Caring Hands of Auburn is a very professional and caring company.  When proving me with quality care they make me feel very comfortable, which is very important to me.  I highly recommend caring Hands of Auburn to help you or a family member to receive quality care in your home.", "pics": null, "resp": null, "gmap_id": "0x888cf33a0e14d533:0x1152791a563fa524"}
{"user_id": "108159931063614943991", "name": "Kashonna Surge", "time": 1485025700557, "rating": 5.0, "text": "I really do love this company! They are so hands on ! They don't make it feel like an employee-client relationship, more so as an additional family member . I will continue to use them and recommend anyone to their services !", "pics": null, "resp": null, "gmap_id": "0x888cf33a0e14d533:0x1152791a563fa524"}
{"user_id": "109684046658640388608", "name": "Aredale Huguley", "time": 1485908049103, "rating": 5.0, "text": "Caring Hands is the closest you can get to a real family. The staff takes the necessary steps to make sure you feel like more than a client.", "pics": null, "resp": null, "gmap_id": "0x888cf33a0e14d533:0x1152791a563fa524"}
{"user_id": "109060030492990996224", "name": "Deezy Beats", "time": 1484765444492, "rating": 5.0, "text": "They have the best caregivers by far. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888cf33a0e14d533:0x1152791a563fa524"}
{"user_id": "108231907958373846572", "name": "April Rowell", "time": 1484870578899, "rating": 5.0, "text": "Very Professional and Affordable....", "pics": null, "resp": null, "gmap_id": "0x888cf33a0e14d533:0x1152791a563fa524"}
{"user_id": "100103321540704933721", "name": "Shanesia Burden", "time": 1484234586984, "rating": 5.0, "text": "Love this company!!!!", "pics": null, "resp": null, "gmap_id": "0x888cf33a0e14d533:0x1152791a563fa524"}
{"user_id": "117425569940566225770", "name": "Cyndy Dowling", "time": 1473018957878, "rating": 2.0, "text": "I was pretty much directed to this merchant by my MD. I had a broken bone in my foot. A friend drove me from my MD visit over to this merchant  and I hobbled inside.  I knew I would need to present my insurance information cards and make a payment.\n\nThe employee desks are situated at the very back of the room beyond the product displays. \"For sale\" reclining and lift chairs are located to the left,  then there is a huge group of walkers, wheel chairs, bathing safety seats etc located in the middle section of the store. Neither employee visible got up when we entered the store.\n\nAn employee called out something to us from the desk area.\n\nMy friend encouraged me to sit in the first reclining chair but as it was a floor product I hesitated to do this and  continued towards the back of the store towards the employees.  One of the employees finally said, \"you can sit in one of those chairs\".\n\nI AM trying to make a long story short.\n\nI ended up buying a cast boot, but they informed me that they did not take my insurance so I paid out of pocket for the item.\n\nThe first boot they tried on me was way too big and they quoted me a price of $89.00 for the item.\n\nIn the end they sold me a higher valued, smaller product at close to the price they originally quoted, so I will give them credit for honoring the price they quoted. That is why 2 stars rather than 1 star. (I think the real reason I got the lower price was because my friend advocated for me regarding the price. I could not hear what was said,  because I was still sitting over against the wall in a recliner,  and my friend was over at one of the staff desks.)\n\nThe staff did not appear to know or understand their products very well and did not really explain much about the boot I bought. They were not gentle or accommodating of my injured foot which was covered in a sock, but swollen and quite painful. The boot was not put on my foot/leg correctly. The tops of the two rigid metal posts that are covered in a hard, rough, scratchy Velcro product were up above the padding of the boot.  After a bit of struggling by the employees, I really just wanted to finish the process and get out of the store. My foot hurt and nothing they were doing was helping at all.  Later, after I got home,  my husband and I looked at the picture on the cast boot box.  The picture clearly showed the boot padding extending up above the two rigid metal posts.\n\nThe posts had already sanded away the skin on both sides of my calf/shin. My husband reassembled the boot correctly and put it back on my foot after putting bandages on the two sores on my calf.\n\nThis store needs to rethink the showroom set up. The employees and their desks should be located near the door.  I realize that their product storage and office space are located at the back of the store but they ARE selling medical devices for customers who probably have some kind of limitation. The employees are the ones who should be making the trek across the store. It might also be a good idea for them to have a wheelchair available just inside the door that they could direct a customer to, if needed,  as soon as they entered.  This would be another advantage to the employees being stationed near the door.\n\nLet me be clear. No one was rude to us, but, no one seemed very concerned either. The first girl who tried to help us must have been new and was not familiar with the  boot products.\n\nThis necessitated a second, presumably more experienced staff member also assisting us. The second staff member was pretty obviously not pleased that she had to become involved and was very abrupt with the first staff member.\n\nAll in all it is not an experience I would repeat.\n\nAfter I got home and was finally comfortable with the cast boot, I looked up cast boots on Amazon and I could have gotten a comparable or even better product at half the price. And, Amazon has great customer service.", "pics": null, "resp": null, "gmap_id": "0x886266179711a56d:0x909b87d6f07bead6"}
{"user_id": "112427367387044258202", "name": "Ivan W", "time": 1512756017403, "rating": 5.0, "text": "Needed a wheel chair and a knee cart for a friend who broke her ankle. All Star personnel were friendly, competent, and helpful, and the equipment was like new. I recommend All Star to others.", "pics": null, "resp": null, "gmap_id": "0x886266179711a56d:0x909b87d6f07bead6"}
{"user_id": "105124345556377776363", "name": "Aaron Page", "time": 1508880473931, "rating": 1.0, "text": "I would give them a negative star but that is not an option.  I actually called down to see if they took Tricare Reserve Select, for CPAP supplies, before driving by.  I was told that they do and I just needed to drop by and pick up my supplies.  Once I got there I am sent to the back to talk to a lady where I am informed that I need to produce a great deal of paperwork besides just the prescription.  I explained that all the other times I have done this, in over 3 other locations in 2 other states, that I never had to go through this.  I was told that I was wrong.  So, I can only assume the that prior times, for over 3 years, has caused for those businesses to eat the cost.  Somehow I am just going to go with these guys have zero clue.", "pics": null, "resp": null, "gmap_id": "0x886266179711a56d:0x909b87d6f07bead6"}
{"user_id": "112100658644692013988", "name": "Peggy Cobb", "time": 1551982387731, "rating": 1.0, "text": "Went today to get a new cpap mask. Sign on the door says “closed until further notice “. I asked someone in the store next door and she said that they have been closed for nine weeks.", "pics": null, "resp": null, "gmap_id": "0x886266179711a56d:0x909b87d6f07bead6"}
{"user_id": "101450159794462300011", "name": "Rick Wienczkowski", "time": 1535141770075, "rating": 2.0, "text": "It was a Friday afternoon the young lady on the phone was very rude I just asked her to check to see if my insurance would cover.... she knew it all ....told me to write a check for $20,000.she was wrong.... Please pray for her", "pics": null, "resp": null, "gmap_id": "0x886266179711a56d:0x909b87d6f07bead6"}
{"user_id": "111724559403476337420", "name": "Catherine Walker", "time": 1577540004744, "rating": 5.0, "text": "Ariel has been my caregiver since May 2019. She is a blessing to me since  having 2 strokes.\nWithout her coming and caring for me I would of ended back in a nursing home. Ariel treats me like her mother. I truly love her with all my heart. She's the best caregiver my daughter could of found. I recommend her for all your caregiver needs.", "pics": null, "resp": null, "gmap_id": "0x8889056785763c75:0x24b91e62c47f05ce"}
{"user_id": "109698911587785874755", "name": "Tashara Johnson", "time": 1577539122206, "rating": 5.0, "text": "I will recommend this company she has been taking care of my grandmother for over six months and it has been such a blessing.. she is so professional that you are able to let her handle everything about the patient... She loves the patient like family...", "pics": null, "resp": null, "gmap_id": "0x8889056785763c75:0x24b91e62c47f05ce"}
{"user_id": "105072278345839320561", "name": "LaSandra McKinzie", "time": 1562507443564, "rating": 5.0, "text": "I recommend Ariel's Helping Hands. She's a blessing to my mother. I needed someone that had a calling for this ministry.  She loves and take care my mother who had 2 strokes in least than a year.  We recently had a health challenge. She stay with her the entire time even through the urgent care and ED. My brother and sisters  appreciate her been their with them. And I didn't have to take off work at usual. Because of her quick and CNA background this episode went very smoothly and the same night. I was able to take my mother home and she's doing great.\nThanks Ariel for loving and caring for my mother like she was your parent.", "pics": null, "resp": null, "gmap_id": "0x8889056785763c75:0x24b91e62c47f05ce"}
{"user_id": "118446212892897058903", "name": "Kesha Wiggins", "time": 1577539305123, "rating": 5.0, "text": "Ariel have been a blessing to my Mother she loves and treat my mom like that is her Mother!! Words can not express how grateful we are for Ariel!! She is honest, dependable, loving and caring!! I would reccomend Ariel's Helping Hands LLC to anyone that needs a Excellent sitter company!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889056785763c75:0x24b91e62c47f05ce"}
{"user_id": "116069190484065959143", "name": "Latonya Johnson", "time": 1558371657547, "rating": 5.0, "text": "I've worked with Ariel at a nursing home facility. She has a passion for others, especially those who are incapable of doing for themselves. She's very hard working and takes her job seriously.", "pics": null, "resp": null, "gmap_id": "0x8889056785763c75:0x24b91e62c47f05ce"}
{"user_id": "105830367783405767525", "name": "Rosetta Pritchett", "time": 1574386798566, "rating": 1.0, "text": "I will Not recommend Ariels Helping hands LLC\nIn Birmingham Alabama. Not a professional company\nat all!", "pics": null, "resp": null, "gmap_id": "0x8889056785763c75:0x24b91e62c47f05ce"}
{"user_id": "116829659951305707361", "name": "Alvin Ellerby", "time": 1565710069959, "rating": 5.0, "text": "The Dr and staff were extremely attentive and capable in my treatment. They were able to give me both sound and effective medical counsel and showed both true compassion and concern for me.", "pics": null, "resp": null, "gmap_id": "0x889a4e1b5c10ae89:0xfa0318533be281a7"}
{"user_id": "103984421904479323260", "name": "artgirl", "time": 1543102311994, "rating": 1.0, "text": "the check in is friendly...the nurses are friendly and efficient...dr. bobby wrights is friendly but i dont think he is competent...my husband was under his care for close to a year for a wound caused by orthopedic dr, rachel...who is a horror...on mike's last visit with dr wrights..he pointed out to dr. w. that his pinkie had shrunk...the one that he was under care for..dr. w. looked at it but not closely...didn't say anything...with his trail of students behind him...a couple of weeks later mike wasin mi and they drew some blood and found out that mikes shrunken finger was caused by mrsa...it had dissolved the bone in his finger...the finger was amputated...i believe that this was one of the causes to cause mike's eventual death...i found out from his autopsy report that he had 2 bone marrow embolisms possibly from the finger dissolving...and ground glass       marrow and fragments too in his lungs...sadly dr w was mikes primary too,,,i found out that this doctor knew that mike had an abnormal liver test  and never told us anything...he helped to kill my husband...he was my primary too...he misdiagnosed my skin cancer as a fungal infection...i didn't believe it so i went to a dermatologist dr bender who told me it was a precancerous squamous cell...i had mol surgery  to remove it...i now have  a new primary...dr wrights is friendly but he is dangerously incompetent...", "pics": null, "resp": null, "gmap_id": "0x889a4e1b5c10ae89:0xfa0318533be281a7"}
{"user_id": "105016768690061776514", "name": "Brenda Sheppard", "time": 1550519776285, "rating": 1.0, "text": "The Dr walk in stop at the door turn around and left.no concern at all.l got more out of the nurse then any body else", "pics": null, "resp": null, "gmap_id": "0x889a4e1b5c10ae89:0xfa0318533be281a7"}
{"user_id": "116711167937315682574", "name": "Amalia Craciunescu", "time": 1594861930727, "rating": 1.0, "text": "I would give it zero stars if I could. Requested same day delivery for oxygen at 2:30p. Was told it could be done. Had some technical difficulties from dr office to fax over order but they were aware of the need for delivery today. Fax finally went through and then they decide to charge $100 for after hours delivery. Disgusting business practice to take advantage of a patient who needs their oxygen as they were being discharged. Will never recommend them. Cold and heartless.", "pics": null, "resp": null, "gmap_id": "0x88891b5f6ed00d19:0x8dab6fb5710c6a43"}
{"user_id": "104911281542232877883", "name": "Chuck Neese", "time": 1567801830929, "rating": 1.0, "text": "My doctor wrote a prescription for a new mask. I took them the prescription and was told they didn't have it but would ship it to me and it would be covered by insurance. I went out of town for a funeral and when I returned they sent me a bill for $108. I called and talked to Kim the manager and she said, honey that's been over a month you can not return it. I will NOT be using them again. VERY BAD AND DECEPTIVE SERVICE", "pics": null, "resp": null, "gmap_id": "0x88891b5f6ed00d19:0x8dab6fb5710c6a43"}
{"user_id": "116100669083031150200", "name": "Zina H", "time": 1599116685820, "rating": 1.0, "text": "They Charged Me $65.00 For My Breaks On My Rotator Chair ??", "pics": null, "resp": null, "gmap_id": "0x88891b5f6ed00d19:0x8dab6fb5710c6a43"}
{"user_id": "109501325729459548836", "name": "Dearilo Arnold", "time": 1561483772549, "rating": 1.0, "text": "Worst service ever. They cant seem to ever get my supplies to me at a reasonable time limit. Theres always a pr3with sendi g my supplies.", "pics": null, "resp": null, "gmap_id": "0x88891b5f6ed00d19:0x8dab6fb5710c6a43"}
{"user_id": "101132252592013253674", "name": "Brad Green", "time": 1566931446322, "rating": 1.0, "text": "Terrible customer service!  They take advantage of people who are sick and have no understanding of insurance coverage.  AVOID this company.  If your doctor orders a medical device you need, go elsewhere", "pics": null, "resp": null, "gmap_id": "0x88891b5f6ed00d19:0x8dab6fb5710c6a43"}
{"user_id": "104423268978930948998", "name": "Julia D", "time": 1623166335959, "rating": 5.0, "text": "I previously used a Touch of Love in 2018 when my father experienced some health setbacks.  Following an illness and surgery, he was not able to fully take care of himself.  The companion that A Touch of Love sent was compassionate, laid back, and she was able to navigate a file line of providing services and not bruising my father's sensitive ego.  He was a businessman for many years and had a hard time accepting that he needed help.  We were so happy with the situation as it freed up time for his children to do what was needed for our own families and did not have to worry about it him.  We used A Touch of Love for nearly 4 months then my father improved. Recently, he had a short illness and we decided that we needed some care again to help him stay in his home and out the nursing home.  We immediately considered A Touch of Love.  I am so grateful for these services.", "pics": null, "resp": {"time": 1623181780534, "text": "Julia, thank you for your wonderful comment. We truly appreciate your business, and we are very grateful for the trust you've placed in us. We promise to always provide our customers with the excellent service that they deserve. Thank you again for choosing us, and for being a repeat customer."}, "gmap_id": "0x8888a903568fa3a9:0x789564adfdf4aee1"}
{"user_id": "103046453099116757179", "name": "Stacy Ingram", "time": 1625157584656, "rating": 5.0, "text": "From the top down, owner/administartor, nurse in the field and actual caregiver we have been more than satisfied with Gracepoint. Communication is excellent and very well received. Nursing assessments are  thorough and complete. The nurse communicates with other agencies, Hospice,  to ensure they are on top of their job. Finally, I can't say enough about the service provided by the caregiver, Dianna. She goes above and beyond what is required of her to provide care for our father. He states that he \"can't imagine his life without her in it\". We certainly agree.", "pics": null, "resp": null, "gmap_id": "0x889a4da933900511:0x1f0d5cb5a4527218"}
{"user_id": "110964756238983467160", "name": "paul fluck", "time": 1623949319727, "rating": 5.0, "text": "Gracepoint HC provided great service to meet my brother-in-law's special requirements. They worked hard to ensure coverage and were very responsive to late requests and changes in schedules. Caregivers Candace, Carol and Diana are superb.", "pics": null, "resp": null, "gmap_id": "0x889a4da933900511:0x1f0d5cb5a4527218"}
{"user_id": "116706048690163478367", "name": "Cindy and David Bailey", "time": 1611003837826, "rating": 5.0, "text": "Gracepoint looked after my parents for a over a year prior to my father's passing.  Now they are attending to my mother. I cannot be more grateful to them for how they cared for Daddy in his last days.  I have confidence that they will continue to care for Mom.", "pics": null, "resp": null, "gmap_id": "0x889a4da933900511:0x1f0d5cb5a4527218"}
{"user_id": "112825982629549006048", "name": "Charles Jackson", "time": 1602791785420, "rating": 5.0, "text": "Gracepoint was there for my grandfather during his final stage in life. The caregivers gave him the care and attention he needed and made us feel comfortable that he was in outstanding hands. We could not recommend them enough for their services!", "pics": null, "resp": null, "gmap_id": "0x889a4da933900511:0x1f0d5cb5a4527218"}
{"user_id": "113511719231615826424", "name": "Kristal Burke", "time": 1601313948437, "rating": 2.0, "text": "The hiring process was relatively fast. My first day 9/24 was not a success. I did not have access to the plan of care, they did not provide me with PPE, and I had no knowledge of what to expect. I was unaware that I would be working in the dark in 60 degree weather inside and outside of the home. After, I was told to leave early it took me 3 hrs to come back around to room temperature. The next day my nose was running, throat sore, and I felt horrible. Not to mention the clients was coughing horribly. I just feel as if management is not at all concerned about the workers. They are only concerned about the clients. Of course the clients matter but so does the caregivers. Without caregivers the company is doomed. I went to work healthy and well and left with a runny nose and sore throat...", "pics": null, "resp": null, "gmap_id": "0x889a4da933900511:0x1f0d5cb5a4527218"}
{"user_id": "114216763489399041842", "name": "Mullet Point", "time": 1611072488246, "rating": 5.0, "text": "Gracepoint HC has provided consistent, professional and compassionate care to our parents.  Thank you for being there.", "pics": null, "resp": null, "gmap_id": "0x889a4da933900511:0x1f0d5cb5a4527218"}
{"user_id": "100971927341472067806", "name": "Jonathan McCardle", "time": 1602870284452, "rating": 5.0, "text": "Professional and top quality care. Cannot speak highly enough about the staff!! Was in immediate need and the results were exactly what we needed and more! Thank you!", "pics": null, "resp": null, "gmap_id": "0x889a4da933900511:0x1f0d5cb5a4527218"}
{"user_id": "108421400252707945451", "name": "Pauline Mckean", "time": 1601686458258, "rating": 5.0, "text": "Dylan and his staff have been awesome to help me find the perfect person to care for my mother! I would highly recommend this company!", "pics": null, "resp": null, "gmap_id": "0x889a4da933900511:0x1f0d5cb5a4527218"}
{"user_id": "104264968025730014917", "name": "Jowairiyya Abdollah", "time": 1553999424539, "rating": 5.0, "text": "They are extremely helpful to caregivers and their clients", "pics": null, "resp": {"time": 1569942776211, "text": "Thanks for sharing, Jowairiyya! Our goal is to continue this positive service now as Encompass Health."}, "gmap_id": "0x888ced3a7848bb2d:0x36ad2d889f126b42"}
{"user_id": "104248126637153268070", "name": "Jeremy Patton", "time": 1508356233285, "rating": 5.0, "text": "Very well ran company.  Will treat you right in what is usually a tough time.", "pics": null, "resp": null, "gmap_id": "0x886265f5723aa417:0xc3fd7799b10e618b"}
{"user_id": "101869493395321811863", "name": "Paul Flynn", "time": 1559594009335, "rating": 5.0, "text": "Visiting  Angels has been nothing short of amazing! The owners are wonderful. I had the opportunity to meet both Amy & Jeremy. Amy runs the Florence office while her husband operates Huntsville. They both really take the time to match the client with the best caregiver to not only meet their needs but personality too. Amy strives to make sure her employees can reach her anytime day/night, holidays, weekends etc. Everyone is very helpful & easy to work with. Taking time off is never an issue. Everyone works together to ensure coverage is met. I had an unexpected hospital admission at 3 in the morning & calling in to find coverage at that hour wasn't an issue. I was hospitalized for nearly a week. Amy was so supportive. Never had I had such an attentive boss. I can say for my part that I view her as not only my employer but also a friend.", "pics": null, "resp": null, "gmap_id": "0x887d493c39927ddf:0xd5aaa5fa60c354"}
{"user_id": "107004041051645397964", "name": "Debbie Garrett", "time": 1558024215967, "rating": 5.0, "text": "I’ve been a caregiver for many years.   When we moved to Athens a couple months ago I felt it time to get back to what I love...caring for the elderly!\nWorking with Amy and Jeremy has been a very nice experience!!!   They are kind and understanding of scheduling issues we as caregivers may have.   While I’ve only been with Visiting Angels of Florence for a short time,  I already feel blessed to be part of the team to provide the best care to our elderly clients as possible!!!", "pics": null, "resp": null, "gmap_id": "0x887d493c39927ddf:0xd5aaa5fa60c354"}
{"user_id": "107596517876735472310", "name": "Lindsey Watford", "time": 1559595538683, "rating": 5.0, "text": "The owners, Amy and Jeremy, really go above and beyond to make sure their clients have all of their needs covered. I have personally witnessed them both take time away from their own families and personal lives to put the needs of the client first. You couldn’t ask for a better company to take care of your loved one.", "pics": null, "resp": null, "gmap_id": "0x887d493c39927ddf:0xd5aaa5fa60c354"}
{"user_id": "111446168741683968421", "name": "Stacey Ronillo", "time": 1559931305620, "rating": 5.0, "text": "The caregivers and office staff at Visiting Angels were amazing to my mother(and helped us as well really).  We are so please to have used such a wonderful, caring and compassionate company when mom needed a little extra help.  Thank you!", "pics": null, "resp": {"time": 1617031638416, "text": "It was our pleasure!  Thank you for choosing Visiting Angels and writing such a nice review!"}, "gmap_id": "0x887d493c39927ddf:0xd5aaa5fa60c354"}
{"user_id": "104144378418079452571", "name": "Michael Hamilton", "time": 1598115287700, "rating": 5.0, "text": "It's centrally located on 6th. North. The staff is friendly and helpful and great job. If your looking for a career,  here it is.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP-468iYuWCpsAixLxHT2OXzqKindOe20boDY1v=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNTiCvOexRdU-kp7odCAZ04PghCqkcXe7P4fYwr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP3jVq7rz166G9QJQW8Dg8BitwItH7qZzY9dyou=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886287e64ec9c359:0x7abfa41e29e45d90"}
{"user_id": "101474158120553730244", "name": "Kat Neal", "time": 1533767628688, "rating": 5.0, "text": "Used this company recently. AMAZING!! Would recommend. Staff was extremely helpful and attentive to my dad's needs. Affordable pricing in comparison to others in area.", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0x7d368cd3dd6503a3"}
{"user_id": "114229795429988427369", "name": "Sarah M", "time": 1539435846139, "rating": 5.0, "text": "Always There has been a blessing for both my family and families that we have referred. From the first call we knew we chose the right company. The nurses that came into our home were wonderful and the office staff was always available if we needed to make a change or ask questions. Thank you Always There for all you do!", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0x7d368cd3dd6503a3"}
{"user_id": "103884597612795845922", "name": "Ann Whitaker", "time": 1538011763050, "rating": 4.0, "text": "It has been a good experience except for a few care givers. I will say that if you are leaving your love ones in the care of strangers. Have some form of in home cameras. Protect them", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0x7d368cd3dd6503a3"}
{"user_id": "112005740317895420720", "name": "Caroline Laird", "time": 1539636169270, "rating": 5.0, "text": "Always There is a wonderful in-home care company. The staff and nurses genuinely care for their patients and strive to meet each individual’s needs. They have made a huge impact on my family and we are forever thankful for their service and care.", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0x7d368cd3dd6503a3"}
{"user_id": "103840286103841543441", "name": "Evan B", "time": 1539636069670, "rating": 5.0, "text": "Always There went the extra mile to make sure my grandfather was taken care of, and that he was comfortable with the people in his home. My family was so nervous to start a service like this, knowing that my grandfather can be somewhat particular when it comes to his care and schedule. Always There found us caregivers that became family. Whenever there was a call off, they immediately called to let us know they would have it restaffed ASAP. The owner herself was even involved in my grandfather's care.I do not know what we would have done with out them!", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0x7d368cd3dd6503a3"}
{"user_id": "113216745009178385724", "name": "Yolanda Williams", "time": 1527048955658, "rating": 5.0, "text": "I have been an employee for Always There for a while.  My experience  there has been fulfilling.  The Staffing and HR Departments are always eager to listen to my dilemmas and offer feedback.  This is a key factor in retaining \"good employees\".", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0x7d368cd3dd6503a3"}
{"user_id": "107956110902423320041", "name": "Jenna Ferrara", "time": 1539635599013, "rating": 5.0, "text": "Amazing company that goes above and beyond! They really care about their customers and always do the right thing. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0x7d368cd3dd6503a3"}
{"user_id": "116739704763597536506", "name": "Kaitlin Holley", "time": 1539434356968, "rating": 5.0, "text": "Always There Home Care has been a blessing in my life! They go the extra mile and always take care of my needs!!! Such a great staff!!!! Love this company !", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0x7d368cd3dd6503a3"}
{"user_id": "106905385843584702615", "name": "Vincent Nelson", "time": 1539640921300, "rating": 5.0, "text": "The service and staff are first-class, when my grandmother was sick they stepped in and supported her and our family like no one else had. I recommend them highly.", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0x7d368cd3dd6503a3"}
{"user_id": "103468009345583476672", "name": "Amia Loubser", "time": 1539635832198, "rating": 5.0, "text": "Great company to work for! Excellent training and will to work with schedule.", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0x7d368cd3dd6503a3"}
{"user_id": "111393472582038386846", "name": "kandi lykes", "time": 1485117883236, "rating": 1.0, "text": "I wish I could give them no stars horrible service!!!! They never tell you when someone calls out, and when they do they tell you about 10 mins before its time to be there, staffing people do not care anything about your love one and when you do call for the answering service they never call back!!!!! I would not recommend a dog come here, dont waster you money or your time!!!!", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0x7d368cd3dd6503a3"}
{"user_id": "109202606859959052954", "name": "Lillie Novak", "time": 1539643817945, "rating": 5.0, "text": "Above and beyond care from all the staff! They really are “Always there” for you and your loved ones.", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0x7d368cd3dd6503a3"}
{"user_id": "116117528059483522753", "name": "Tammy Holley", "time": 1539715353316, "rating": 5.0, "text": "Very pleased with the dependable and professional service!", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0x7d368cd3dd6503a3"}
{"user_id": "107176864525057980867", "name": "Jenna Stalica", "time": 1539635890891, "rating": 5.0, "text": "Thankful for companies like \"Always There!\" FANTASTIC!", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0x7d368cd3dd6503a3"}
{"user_id": "105396739285382300254", "name": "Joseph Graham", "time": 1539655432334, "rating": 1.0, "text": "This place is a terrible place to eat. It was disgusting.", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0x7d368cd3dd6503a3"}
{"user_id": "105639338356079192669", "name": "Debbie Young", "time": 1526523820112, "rating": 1.0, "text": "Terrible. If I could give zero stars, I would.", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0x7d368cd3dd6503a3"}
{"user_id": "116605469393188128810", "name": "Candice Purkey", "time": 1518816799155, "rating": 5.0, "text": "Excellent team!!", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0x7d368cd3dd6503a3"}
{"user_id": "114528439794937102728", "name": "Frank Giardina", "time": 1500086612266, "rating": 1.0, "text": "Tried to charge me twice, over a year later!", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0x7d368cd3dd6503a3"}
{"user_id": "116776467660633840740", "name": "Steve Howe", "time": 1623540502726, "rating": 5.0, "text": "It’s rare to have a company who does what they say they are going to do, but we sure did with this company. When they said they would send someone out to get a new caregiver started and trained, they did. When a regular caregiver couldn’t come in they made sure a trained caregiver was there even if it was office professionals (who were former caregivers). They made sure we liked our caregiver and if we had complaints they would take care of it. George (the owner) was so personable and spent a lot of time with us explaining his philosophy on running the most honest, best caregiving experience.  We also enjoyed and appreciated our caregivers for my parents. They worked hard and loved them like their own. If we are ever in the position to need a caregiving service in the future, there will be no doubt who we will use, Your Choice Senior Care.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "105521311697546769366", "name": "Heather Steel", "time": 1616790156292, "rating": 5.0, "text": "I'm very pleased with the service given by Your Choice Senior Care. George and his team are great, and have helped my dad so much. And they have brought me incredible peace-of-mind.  Not only do they bring him breakfast in the morning (he's at Somerby) but they make sure he gets his medicine 3x a day, talk with him (this has helped his speech tremendously) and help him keep up with some of his light chores and ADLs on the days he needs it. We have found them to be super accommodating with last minute changes and requests, and overall very responsive and caring. Thank you!", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "111765452972684313246", "name": "Catherine Hales", "time": 1611770989868, "rating": 5.0, "text": "This team is always very responsive in helping our seniors. George and Christina are extremely helpful in making sure prompt and quality care is always available. They are one of the few home care companies that require extended training for those with memory loss. A much needed training in this field!", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "113963477862069589286", "name": "Debbie Leirer", "time": 1576790533076, "rating": 5.0, "text": "I cannot say enough good things about \"Your Choice Senior Care\" and I highly recommend them to anyone that needs senior care assistance.  They have been a godsent for my father.  They are very kind, caring and patient as well as very professional.  They were always on-time for their appointments with my father.  They assisted and trained my father with taking his blood sugar readings and insulin injections.  They offer a variety of services and you can pick the service(s) that best suits your needs.  Their prices are very reasonable.  If you need a senior care professional for your elderly parent, \"Your Choice Senior Care\" is the first call you should make.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "118158288105220348482", "name": "Richard Davidson", "time": 1559942863931, "rating": 5.0, "text": "I highly recommend Your Choice Senior Care for anyone needed help caring for somebody. We’ve relied on Your Choice for well over a year to help care for my 97 year old mother. The company’s owners/managers are conscientious, hard-working, and responsive to our concerns.\n\nOne caveat: the quality of individual caregivers varies considerably, from excellent too awful. The best are more than caregivers; they are friends, both with my mom and my wife and myself. A rare few were bad enough I ordered them to leave and not return. The owners and managers are careful with who they hire, and pass on our instructions for what is expected from the caregivers, but they cannot monitor everything happening in your home.  In the end, it is up to you to determine which caregivers meets your needs and which have to go.\n\nThat said, anytime there has been problem with a caregiver—no matter the time, day or night—the owners/managers have acted *immediately* to correct the problem, including personally caring for my mom until a replacement caregiver was found.  They strive to provide excellent care to the elderly, and their efforts have made it possible for my mom to continue living with us long after she surpassed our ability to care for her by ourselves.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "111173524491269581553", "name": "Yvonne Simmons", "time": 1560870714991, "rating": 5.0, "text": "I am helping a friend who lives out of town with his 94 year old Dad.   We chose Your Choice Senior Care about 2 and a half months ago.  Best decision we have made so far.   He has needed 24/7 care up till about a week ago and we cut back to about 10 hrs and the owners helped us figure best times to have the care givers there.\nWe were so lost when we first realized we needed this type care and they took care of everything even down to picking up supplies.  They are so hands on and involved.\nI can go on and on about this being an A+ company!!!!\n\nYvonne", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "117492082925712874149", "name": "Valeria Farmer", "time": 1564659882538, "rating": 1.0, "text": "The 18 yr old they sent to help with my mother wanted to do nothing but sit there and watch tv.  We stopped using them and they keep sending invoices to be paid that we're already paid.  It's been months since we used them, but keep getting invoices each month.  The last conversation i had with them, i was informed they owe me money but here it is the next month and they want me to pay them again!  They owe us no money and we sure don't owe them!", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "118162148206786564250", "name": "Vanessa", "time": 1490797029286, "rating": 5.0, "text": "The care and compassion my mother received from Your Choice Senior care made me want to write a review to tell others. I have a busy life and wanted her to be taken care of by professional and caring people during the day and while I was on vacation. If you're looking for help, give them a call and they can do many things to make your life easier.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOeXsdy8J5-W-2vFBZfPMRJDQllN3twMGr_jj5X=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMDKYKgUni8xI-nT_9kqojytoFJu-n9ScAgZEZC=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "106762902737563814340", "name": "Jevon smith", "time": 1489425220646, "rating": 1.0, "text": "They sent me out 45 miles..an the facility dint allow male caregivers there to sit with woman...they promise me i would still get my 9 hours on my check..THEY SENT ME 16$..please. Stay away from them", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "113695462545965873732", "name": "Leigh Wright", "time": 1490880344064, "rating": 5.0, "text": "They were polite and professional. Definitely made a difficult time easier.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "100271443291519475830", "name": "Leigh Wright", "time": 1490794533900, "rating": 5.0, "text": "They were friendly and professional. Made caring for my grandmother much easier.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "103574179415098269771", "name": "Valerie Chavez", "time": 1553548248356, "rating": 5.0, "text": "Such great people!", "pics": null, "resp": {"time": 1553548502503, "text": "Thank you so much for your kind words! Look forward to seeing Mrs. Chavez next week!"}, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "117277869473223978921", "name": "Kaylee Mendyke", "time": 1603311625590, "rating": 5.0, "text": "The owner of this Senior Helpers, Mrs. Mary, is the most caring and compassionate person I know and truly does so much for her employees and clients. I've been working here at Senior Helpers for about a year and a half and it has been an incredible experience to build a relationship with all of the employees and the clients. I love getting the opportunity to make a positive impact on our client's lives each and every day by keeping them strong, happy, and independent.", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "115145217700726132663", "name": "keshia Robinson", "time": 1600429573154, "rating": 1.0, "text": "Well, I enjoyed working for Senior Helpers at the beginning. You get to pick your schedule but the pay is only 8 dollars which is below minimum wage. Im a retired Air Force cop, so the pay wasnt really an issue for me. I wanted the experience since I am majoring in Nursing and I wanted to get a start in the healthcare career field. During my time, the clients were all sweethearts and I enjoyed them. They were the best part of my day. It really hurt quitting because I just love the clients and that is why I stayed. Well, some improvements for the company is as follows: better training, pay for the training, and raise the pay. When I first got to my orientation I asked how many employees they have? I was told over 100, but looking at their open shifts this company turn over rate is high and they dont have enough employees that care. They would send out available shifts but on the app employees had to use for myself  it wouldn't  show that I had available open shifts. The time off that I requested was always for VA (veterans affairs) appointments so my call in's where emergency only. I was always on time with all clients and I gave every client the best treatment, companion care, and respect.\nI dislike the company policies with COVID.  I was schedule to go into the office to do some training. I schedule this on my own because I knew that youtube videos couldnt get me by. I needed hands on training. They lack training. When I confirmed with my boss the time to come in for training I was told by my boss that they are not allowing people to come to the office. She sounded really sick on the phone so I couldnt give you a honest reason why they told employees to stay away. If i had to guess covid. I had called into work last minute for a car issue which i got reprimanded and the second issue was because i needed to make sure a relative didnt have covid because i was around them. I got written up and they told me they would fire me if I called in again. Well. I had to call in again because of covid symptoms. I told the boss if covid symptoms is not a valid excuse for calling into work, then i cant work there. I care about the clients health and if it takes me quitting to protect them I had to. You should not send employees to work or threatened them with termination. Im a hard worker so its really sad to see great people like myself to quit. Lastly, is the driving. I would drive about an 1 hour to get to a clients house. Like i said before I loved the job and I know some caregivers dont do right. They dont clean or take care of the clients like they should. So I stayed because there is not enough good in this work place. All in all it was the company saying I have one more call in and they have to fire me. If im sick i cant be around the elderly. They are vulnerable. They need to rethink their procedures.\n\nNow i dont get unemployment, i cant qualify because i receive the Post 9/11 bill money for school. I cant receive unemployment because i am in school and veterans are not allowed to double dip. Meaning i cant get free money from the Post 9/11 bill and money from unemployment. Like i said before i work because I care.\n\nOn a positive these are quotes I picked up:\n\nThe price you pay for the job you have\n\nCold hands, warm heart, dirty sweetheart\n\nKeshia", "pics": null, "resp": {"time": 1603139866776, "text": "Keshia, we also enjoyed you working for Senior Helpers. We were very proud to have a veteran join our team. The Federal minimum wage is $7.25 an hour. We do pay our employees this for training pay ONLY but once you complete the hiring process and start working with our clients you receive the wage that was discussed during your interview. We do not have a single employee that is working for less than $8.50 an hour. I pulled your check stubs to make sure we did not make a mistake on your pay while you were employed with Senior Helpers and we did not, if you would like  confirmation on your check stubs we would be happy to provide that information to you please just give us a call at our Senior Helpers office (256)650-2982.\nWhen you started working with Senior Helpers we were shorter staffed due to the pandemic and caregivers quitting without notice or calling in for shifts last minute (without COVID-19 symptoms or being in contact with someone who had COVID-19).\nI am sorry you felt we lacked training. We have an entire room in our office dedicated to hands on training that you sat in during our orientation. This training room includes: a medical manikin, hospital bed, shower, shower chair, walker, wheel chair, cane, gait belt, slide board, Hoyer lift, a change of sheets to learn to change an occupied bed, ‘depends’ to practice changing and bathing clients, bed side commode to practice safely transferring clients and more are available to any caregiver who would like additional training to come and schedule a time to practice. We just ask you schedule your time in advance to ensure we have sanitized all materials and your supervisor is available to assist you.\nAs for our COVID-19 policy that you signed and received a copy of in orientation; we ask if you have been exposed or have any COVID-19 symptoms to call the office and we will send you to the nearest clinic to get tested immediately. Your supervisor actually responded to you when you called out with COVID-19 symptoms, “Of course COVID is an acceptable excuse. And are you going to get tested today? If so just send me the paperwork and it will excuse you.” You told us you were going to get tested but you were going to pass on coming back to work for Senior Helpers because you did not like the call-in policy. We respected your decision and removed you from the schedule and just asked as a courtesy for our clients to let us know your COVID-19 test results so we can update them if they need to be tested in the event you tested positive. You responded stating you do not have COVID-19 and have not been exposed therefore they do not need to be tested.\nDuring your interview you agreed to drive up to 30 miles to a client’s home. The furthest you were asked to drive to a client was 25.7 miles and this was not your regular client.\nWe thought you were a great a caregiver to our clients in the short time you worked for Senior Helpers and you are right, you did truly care for your clients which we greatly appreciated. I am sorry you felt the need to quit from a misunderstanding you may have had with the attendance policy. We wish you nothing but the best in the future for your nursing career. And if you have any other concerns, we hope you will please call us at our office (256)650-2982 and we will be happy to address this with you."}, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "106780272926457222795", "name": "Lydia Avery", "time": 1562115265666, "rating": 5.0, "text": "Every care giver that has come to care for my grandmother has been wonderful! She raves about how much she liked everyone that has come from your company! Which isn't always the case with others who have cared for her in the past. I especially appreciate how flexible Senior Helpers has been with being able to find us last minute care when we unexpectedly needed someone. I am SO GLAD we tried Senior Helpers!! You guys are a major blessing to our lives! Finding quality care is not longer difficult or stressful thanks to Senior Helpers!", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "114867182327395685485", "name": "april Taylor", "time": 1563572166722, "rating": 1.0, "text": "BEWARE!! I would not recommend getting a job here! I was not able to complete orientation due to family issues. Ended up not taking the job. They refused to pay for that one day and was very ugly over the phone. Hung up on me twice! Not professional at all!!! So glad I did not take the job. Their true colors definitely came out! Reporting issue to labor and board first thing Monday morning!", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "103111198269063149400", "name": "Shannon Oakley", "time": 1559845368186, "rating": 5.0, "text": "Senior Helpers has always been so wonderful and easy to work with.  All of their staff is so kind and thoughtful and do a great job every time.  You can always count on them to take care of your loved one and be there for them at all times.", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "101393242242184866680", "name": "Crystal Copney", "time": 1560969423663, "rating": 5.0, "text": "I have been employed with Senior Helpers for 6 years now. I really enjoy the company and my coworkers. They are caring and compassionate.  Mrs. Mary is awesome and goes above and beyond for her employees and clients.", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "107949723278601060878", "name": "Janet Bentley", "time": 1528002033772, "rating": 5.0, "text": "I am very grateful that a good friend recommended Senior Helpers to me.  They stay in touch with me each week and visit quite often to be sure I am happy with the care I receive.  I do not know what we would have done without their excellent service.", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "103352267172707152175", "name": "Kimberly Kennedy", "time": 1614312264948, "rating": 5.0, "text": "Great company 👍", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "101287508364030747557", "name": "Cathy Dianne", "time": 1518382646216, "rating": 5.0, "text": "Nothing but high praise for Mary, Julie and this wonderful team of caring people.  They helped my family through many tough times over the past many years.  Friendly care and multiple services were provided to my mom and we are forever grateful. FIVE* * * * * STARS!!!!", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "106259063835944157730", "name": "Aubrey Smith", "time": 1510624791588, "rating": 5.0, "text": "Senior Helpers is the best home care company out there! Definitely would recommend to everyone!!", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "111795879941166937980", "name": "James Bodie", "time": 1560544814425, "rating": 1.0, "text": "Habitual tardiness, a lack of professionalism, and failure to follow through on timely and important scheduled client care matters makes Senior Helpers a very poor choice for home health care.", "pics": null, "resp": {"time": 1561124839163, "text": "So sorry that we did not meet your expected criteria. We wish you and your family the best of luck in the future. Mary Jackson/Owner"}, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "103505482398548873642", "name": "Janet Lammers", "time": 1525110700890, "rating": 1.0, "text": "Very disappointing company. If I could give no stars that would be better. 😕", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "100934591549850106119", "name": "Peter Rinaldi", "time": 1532449752636, "rating": 5.0, "text": "I highly recommend the services at Home Care Assistance in Birmingham. They were able assist my family in caring for my mother with short notice.  The caregivers who came to our home and cared for my mother while she was on hospice care were very knowledgeable and compassionate.  My mother was very happy with them as well as the family.", "pics": null, "resp": null, "gmap_id": "0x88891634efc48a7b:0x821b56e12699158e"}
{"user_id": "111176046017378158073", "name": "Melanie Edmondson", "time": 1537545438894, "rating": 5.0, "text": "I cannot say enough about how much stress that Debbie and her team took off of me.  My parents and I were separated by a few states, so it was not possible for me to be on hand to coordinate their care.  Her team worked day and night to take care of their needs.", "pics": null, "resp": null, "gmap_id": "0x88891634efc48a7b:0x821b56e12699158e"}
{"user_id": "103298949738277945268", "name": "Gary", "time": 1496948729554, "rating": 5.0, "text": "Debbi and her team really work hard to make sure that not only are their Clients satisfied and thriving, but so are their employees. They take great interest in the satisfaction of everyone they work with. It is very obvious that their goal really is to \"Change The Way The World Ages\". I thought that sounded so silly at first, but when you see the difference that they are making in people's lives, you realize how true it really is. I would gladly use Home Care Assistance to help with the care of myself and my loved ones for just about anything. ❤️", "pics": null, "resp": null, "gmap_id": "0x88891634efc48a7b:0x821b56e12699158e"}
{"user_id": "112412632639364782707", "name": "James Patchett", "time": 1494362679103, "rating": 5.0, "text": "I have been working with Debbie and her team for nearly 6 months now and could not be happier with her team and their dedication.  I am thankful every day that I found such a great team to provide care. Thank you for all that you do!", "pics": null, "resp": null, "gmap_id": "0x88891634efc48a7b:0x821b56e12699158e"}
{"user_id": "117335565844781722715", "name": "cherry johnson", "time": 1515553499702, "rating": 5.0, "text": "This organization is amazing,  they have been that bridge needed to help care for our mother. Debra has been a needed ear for my many frantic late calls, helping to work through the red tape of relocating an elderly parent to a new city, and when you just have no one else. I have moved my mother into an assistant living facility, and no longer use her services, but that has not stopped her from calling to check on my mother.   If you need a trusted agency this is the place to go.", "pics": null, "resp": null, "gmap_id": "0x88891634efc48a7b:0x821b56e12699158e"}
{"user_id": "114532376292748821621", "name": "Kerry Cavaliere", "time": 1497630280050, "rating": 5.0, "text": "Debra and her staff are always very helpful and attentive. I would not hesitate to recommend their services.", "pics": null, "resp": null, "gmap_id": "0x88891634efc48a7b:0x821b56e12699158e"}
{"user_id": "106768947114252959328", "name": "Tiffony Coleman", "time": 1497369641207, "rating": 5.0, "text": "There loving, caring, and very compassionate with you and your love one's, they also have the most wonderful staff with big hearts :-) :-) :-)", "pics": null, "resp": null, "gmap_id": "0x88891634efc48a7b:0x821b56e12699158e"}
{"user_id": "105639338356079192669", "name": "Debbie Young", "time": 1512128024164, "rating": 1.0, "text": "Extremely disappointment. The care provided for my sister was not even close to what we expected. I left and went to Always There In Home care and we will never look back.", "pics": null, "resp": {"time": 1515435503383, "text": "Hi Debbie,\n\nThough we appreciate you taking the time to leave our business a review, we believe you may have accidentally picked the wrong Home Care Company to review. To our knowledge, we do not have record of the situation that you have stated in your review. If you will, please give us a call at your convenience. We would like to make sure we better understand what happened and that we do whatever we can to correct any possible errors of ours. We can be reached directly at 205-308-1144 or 205-438-6925. We look forward to hearing from you and apologize for any inconvenience, thank you.\n\nBest Regards,\n\n-The Home Care Assistance Team"}, "gmap_id": "0x88891634efc48a7b:0x821b56e12699158e"}
{"user_id": "109884129232655117446", "name": "Tony", "time": 1583906705530, "rating": 5.0, "text": "They took great care of my dad and never failed to come when we needed them.. I highly recommend them.", "pics": null, "resp": {"time": 1583928337382, "text": "So glad to hear your experience with Encompass Health was great! Thanks for sharing, Tony."}, "gmap_id": "0x888990f8efdfa863:0x731d6dcaf4a006d6"}
{"user_id": "110593532366276801183", "name": "michael allison", "time": 1560885676580, "rating": 5.0, "text": "Ala Care has been the defining factor in my Mothers Hospice care. The nursing staff are professional, caring, compassionate, to my Mothers needs. They are truly Angels of Mercy, sent from above.Ala Care is outstanding in  the performance of their care and mission, also I would like to thank Dr. David Bryant an outstanding and compassionate physician for his unwavering leadership and direction that he carries Ala Care.", "pics": null, "resp": {"time": 1569949085886, "text": "Thank you for entrusting us with the care of your loved one, Michael! Our goal is to continue this positive service now as Encompass Health."}, "gmap_id": "0x888990f8efdfa863:0x731d6dcaf4a006d6"}
{"user_id": "103267918890608179063", "name": "Hal Scoggins", "time": 1577236988762, "rating": 5.0, "text": "They do a great job taking care of people who need a little help", "pics": null, "resp": {"time": 1577460664204, "text": "Thank you for entrusting us with your care, Hal! We’re happy that you had such a good experience!"}, "gmap_id": "0x888990f8efdfa863:0x731d6dcaf4a006d6"}
{"user_id": "101676465514958629510", "name": "Mary Headley", "time": 1551923129206, "rating": 5.0, "text": "All of the staff was helpful and knowledgeable. I highly recommend for quality health care for you or your loved one.", "pics": null, "resp": {"time": 1569949097364, "text": "Thanks for sharing, Mary! Our goal is to continue this positive service now as Encompass Health."}, "gmap_id": "0x888990f8efdfa863:0x731d6dcaf4a006d6"}
{"user_id": "116245283511296792930", "name": "Kathy Russell", "time": 1518036777355, "rating": 5.0, "text": "The help I'm receiving from Alacare in Oneonta so far Wonderful. They are going to help with education on diabetes. Which I am so Thankful for. And I want to say Hi to Mrs. McPherson.  She took care of me 3 years ago and she was Magnificent, I just think the world of her and love her so much!  She is Da Bomb!", "pics": null, "resp": {"time": 1569949124975, "text": "Thanks for entrusting us with your care, Kathy! Our goal is to continue this positive service now as Encompass Health."}, "gmap_id": "0x888990f8efdfa863:0x731d6dcaf4a006d6"}
{"user_id": "107373092112583743091", "name": "Amanda Cottingham", "time": 1618454877325, "rating": 1.0, "text": "Unprofessional, promised caregivers would show up and they didn’t, overpriced", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "104231151786036000478", "name": "Carleatha Cunningham", "time": 1586641493889, "rating": 5.0, "text": "Visiting Angels is great place to work for. They are very friendly staff and supervisors. I have been with them over 3 years. I wouldn’t trade my job for anything. Best place to work. We also provide the best care your love ones need. We treat them as they are family to us.", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "111725954257914046370", "name": "Stephanie Bennett", "time": 1586653030483, "rating": 5.0, "text": "I've used Visiting Angel's in the care of my 81 year old dad. There was so much genuine care given. I  was glad to see this in this day and age. They were not just there because it was their job but they truly cared about the patient,  the family as well as their duties.  I would recommend  Visiting Angel's to others.", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "108815118350255098371", "name": "Amy Self", "time": 1586641395099, "rating": 5.0, "text": "I started working with visiting Angel's a few weeks ago. The application was easy yet thorough. They try to match caregivers and clients so there is a seamless relationship. I love the company.", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "108173745048498664522", "name": "Elizabeth Boyd", "time": 1586640915093, "rating": 5.0, "text": "Visiting Angels is a wonderful company to work for! Russell is an amazing employer and puts his heart into his company. His compassion and love for our elderly shows in how he runs his company from day to day! He is an advocate for his caregivers that work for him as well as the clients we assist! I have worked for multiple companies in the same capacity in the past but Visiting Angels in Trussville is a step above the rest!", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "103601637782308160725", "name": "David Jones", "time": 1589481756416, "rating": 5.0, "text": "Visiting Angles has been a lifesaver! They have provided great caregivers for my mom and helped us through a difficult time. Special thanks to Russell and Tosha for their great work. They have always been there when we needed them.", "pics": null, "resp": {"time": 1589562415082, "text": "Thank you so much David! We appreciate you taking the time to leave us this 5 star review! We love serving your family!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "115695062083607979183", "name": "Adrian Wilson", "time": 1586645400358, "rating": 5.0, "text": "This company definitely has your best interest at heart. They care about their employees as much as they care about their clients. I have enjoyed working for this company so far.", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "108388417865099477412", "name": "Matt Johnson", "time": 1591141521003, "rating": 5.0, "text": "Visiting Angels is best provider in the Birmingham area. Russell and his team are true Angels. They have an outstanding team in place to take care of our loved ones.", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "116627560202828199088", "name": "Carolyn Foster", "time": 1586478415688, "rating": 5.0, "text": "Great place to work. I have worked 4 years for them. They are awesome. Office Staff is great.", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "111846307544741383544", "name": "Amy Patton", "time": 1559680786928, "rating": 5.0, "text": "Russell and the staff at Visiting Angels are nothing short of amazing! We personally used Visiting Angels when my mother in law had a brain aneurysm and stroke. The caregivers worked so well with her, encouraged her to complete her physical therapy and were able to take her to doctors appointments and errands around town. They did a great job of matching caregivers that had similar interests. I would recommend Visiting Angels, they are the reason that she has made a full recovery!", "pics": null, "resp": {"time": 1573145881111, "text": "Thank you for taking the time to leave such a wonderful review! We loved serving your mother-in-law during her physical therapy!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "104326453712244781163", "name": "Michelle Ryder", "time": 1589421416544, "rating": 5.0, "text": "Great company.  Caring loving employees that are dedicated to taking the best care of your loved ones.", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "108490534437085708053", "name": "brenda varnado", "time": 1586644801065, "rating": 5.0, "text": "The angel taking care of my mom  andwas gentle understanding. My mom had Alzheimer's it's a very tough desase. she was there for my mom she was there for moms animals and she was there for us. If I had to do it again I would want an angel to come stay with our family", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "104405772251198497437", "name": "James Church Nicholas", "time": 1589418651353, "rating": 5.0, "text": "Very capable staff and very courteous.  They do fantastic work.", "pics": null, "resp": {"time": 1589464676260, "text": "Thank you so much James! We appreciate you!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "103125990681787915424", "name": "Susan Humphreys", "time": 1573075479915, "rating": 5.0, "text": "Great place to work. Very rewarding  placing caregivers in client's home that have a passion to work with geriatrics and hearing how pleased the clients are when we take care of their loved ones.", "pics": null, "resp": {"time": 1573145301091, "text": "Thank you very much Susan! We appreciate you taking the time to leave us a 5-star review!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "104867617895483229284", "name": "Logan Deen", "time": 1583183931324, "rating": 5.0, "text": "I personally know Russell, who is the owner of Visiting Angels. The passion he has for his business rivals none, and he truly cares about his clients! I highly recommend Visiting Angels!", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "115458503395768024366", "name": "Brent Nail", "time": 1586382001560, "rating": 5.0, "text": "Visiting Angels is a great and trustworthy company. I highly recommend them for any home hospice or bedside caregiver needs.", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "110226495917680018206", "name": "Robert Mills", "time": 1573086931999, "rating": 5.0, "text": "Russell and his team are top notch. If you’re looking for honesty and caring people, look no further than Visiting Angels.", "pics": null, "resp": {"time": 1573145336562, "text": "Thank you very much!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "108137301706479743421", "name": "Pat Boyd", "time": 1589419786070, "rating": 5.0, "text": "I personally know some of the staff and they go above and beyond taking care of their clients. Great place!", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "103347049886603142800", "name": "Bridget Baughan", "time": 1573145364996, "rating": 5.0, "text": "I know Russell personally and have no hesitation recommending him or his company Visiting Angels.  He is a very honest, sincere individual and you can't go wrong using his services.", "pics": null, "resp": {"time": 1573149818458, "text": "Thank you Bridget! We are so grateful you would take the time to write us a review!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "102633105624105290593", "name": "Brice Jackson", "time": 1573075094432, "rating": 5.0, "text": "I cannot day enough about Visiting Angels! Top top senior care! Great staff! Highly professional! Glad Visiting Angels is in our area of Alabama!", "pics": null, "resp": {"time": 1573079038006, "text": "Thank you very much Brice! We appreciate you!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "114980489499108088531", "name": "Tosha Pritt", "time": 1580926912223, "rating": 5.0, "text": "Wonderful place to work!!! Amazing compassionate caregivers and office staff  always willing to go the extra mile for the families we serve!!", "pics": null, "resp": {"time": 1580937909853, "text": "Thank you very much for taking the time to leave us this wonderful review! We really appreciate you sharing your experience with others!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "110609466684367432364", "name": "Tmya Cunningham", "time": 1586653394705, "rating": 5.0, "text": "Thanks for taking great care of me and my newborn.", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "103965646714963555201", "name": "Sandra Shaw", "time": 1559853593181, "rating": 5.0, "text": "Great company to work for with very flexible hours to fit any schedule. Phenomenal boss that helps make working for his company pleasant!", "pics": null, "resp": {"time": 1573145843849, "text": "Thank you, Sandra!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "114051331414799956789", "name": "lester barnes", "time": 1561786072903, "rating": 5.0, "text": "The caregivers at Visiting Angels Trussville give the agency its name for sure.  Could not ask for better care giving for my mother and father.", "pics": null, "resp": {"time": 1573145835402, "text": "Thank you very much Lester!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "100732410138354627708", "name": "Keondra Cunningham", "time": 1586644086496, "rating": 5.0, "text": "Great experience and amazing staff", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "117516424883176765311", "name": "Devon Payne", "time": 1586641161557, "rating": 5.0, "text": "Great Service and friendly staff", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "104248126637153268070", "name": "Jeremy Patton", "time": 1492276314390, "rating": 5.0, "text": "Took care of my mother. Very professional and friendly. The whole experience was great.", "pics": null, "resp": {"time": 1573145929600, "text": "Thank you Mr. Patton! We appreciate you!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "104942055270323946103", "name": "Quentin Dunn", "time": 1573134102324, "rating": 5.0, "text": "Russel goes above and beyond for his client.", "pics": null, "resp": {"time": 1573145628793, "text": "Thank you, Quentin!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "107962992332172116908", "name": "_KHLOE BOYD_", "time": 1507049167317, "rating": 5.0, "text": "LOVE MY JOB ITS AWESOME!!!", "pics": null, "resp": {"time": 1573145897381, "text": "Thank you Ebony :)"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "116954182961211101854", "name": "Jacob Buffington", "time": 1521139678002, "rating": 5.0, "text": "Great office!", "pics": null, "resp": {"time": 1573145888358, "text": "Thank you Jacob!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "115445645137246527741", "name": "Andrea Benes", "time": 1569105357371, "rating": 5.0, "text": "Amazing company and staff.  They truely care and go the extra mile.", "pics": null, "resp": null, "gmap_id": "0x888922c04b40a471:0xafec576299d87a5c"}
{"user_id": "109664649145193557880", "name": "Tim Hatchett", "time": 1350613965929, "rating": 5.0, "text": "Words cannot express the valuable and professional services provided to my family during this time of need. I will not attempt to single out any on individual, because all the caregivers were dedicated, courteous, and professional, and performed their duties with diligence, patience, sincerity, and perseverance. I highly recommend the Hospice Services of Alabama staff to anyone in need of hospice care.", "pics": null, "resp": null, "gmap_id": "0x888922c04b40a471:0xafec576299d87a5c"}
{"user_id": "109597428741632184143", "name": "Mark McMillan", "time": 1527096175480, "rating": 5.0, "text": "Although we only used them for a few days before mom passed, they were great and professional in every way.  Would recommend them without hesitation.", "pics": null, "resp": null, "gmap_id": "0x888922c04b40a471:0xafec576299d87a5c"}
{"user_id": "100797197793850253161", "name": "Trey Horton", "time": 1426695099846, "rating": 1.0, "text": "My family's experience was far from great. The lied. They told us the were good Christians and they never did anything they said they would. They caused my family great discomfort. So not so good Christians..  I can't believe they are in business with such bad leadership. I DO NOT RECOMMEND ANYONE TO THIS COMPANY!", "pics": null, "resp": null, "gmap_id": "0x888922c04b40a471:0xafec576299d87a5c"}
