{"user_id": "107627878756140138694", "name": "Pamela H", "time": 1558733892031, "rating": 5.0, "text": "Absolutely delicious raw honey. Love the variety of types and taste. Will purchase again soon!", "pics": null, "resp": null, "gmap_id": "0x889a3d861154bf33:0x4d5136346cd8e04f"}
{"user_id": "116480246057402247615", "name": "jody thompson", "time": 1628173468056, "rating": 5.0, "text": "I have been in the industry for over a decade as a manufacture of fragrance.  This company has an excellent product, integrity in their business practices,\nand uses the wonderful by-product of his own bees to produce this product.\nDo not miss the opportunity to fill your home with these fragrances and enjoy a wonderful product that partners with Creation.", "pics": null, "resp": {"time": 1628215729057, "text": "Thank you so much Jody Thompson for taking the time to give such an excellent review of our products! It mean so much to my family and myself when our high quality standards are noticed. The candles are the best we could produce with the highest quality possible and we use our own beeswax in each of them. Thank you again and have a wonderful and blessed day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "105780873597848090418", "name": "Anna Lettieri", "time": 1616106908916, "rating": 5.0, "text": "I ordered the Olive Tea Tree candle. I was very anxious to smell it. I hopped it would be somewhat close to the original. But to my surprise it is just like stepping into my mother in law’s back yard in Georgia.\nMike even sent us a personalized note and a free sample of his honey. I can’t wait to try it.\nThank you for your prompt delivery\nI will be ordering again", "pics": null, "resp": {"time": 1616119249611, "text": "Thank you so much Anna for taking the time and sharing such a great review and for the 5 star rating. Your comments mean so much to our southern sweet bee family and your support of our honeybee farm! I am glad our candles brought back such great memories and I hope you enjoy our Southern Sweet Bee honey. Have a fantastic and blessed day! Mike"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "101457389872013047784", "name": "Kelly Glass", "time": 1620908384302, "rating": 5.0, "text": "Hands down best candles. Amazing scents, clean and even burning. Cotton and honeysuckle are a must try . Wildflower  Honey is amazing!", "pics": null, "resp": {"time": 1620921251689, "text": "Thank you so much Kelly for taking the time in sharing such great compliments on our Southern Sweet Bee candles and honey!  It mean so much to us to get such awesome feedback from customers like yourself! Have a wonderful day from Southern Sweet Bee!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "107185645550608691174", "name": "blacky", "time": 1617834242035, "rating": 5.0, "text": "Outstanding honey. Sold in Winn Dixie and Piggly wiggly.  Free bee removal service. The owner came out in 1 hour after I called and removed the bees for free.  Very professional and knowledgeable.  I learned something new about honey bees. Since we caught them early, this prevented them from making a hive inside my house. Highly recommended.", "pics": null, "resp": {"time": 1617894386597, "text": "Thank you so much D Smith for such great compliments on our products and services. If any one is interested in any of our products just visit www.southernsweetbee.com and check them out. We are also in many stores in the Montgomery and Birmingham area such as Whole Foods and Fresh Market stores. Have a wonderful day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "109003618083021184066", "name": "Manard Glass", "time": 1621283877116, "rating": 5.0, "text": "Best honey around. When you stop by and get your honey you have to buy their candles the cotton scent is absolutely wonderful.", "pics": null, "resp": {"time": 1628216043610, "text": "Thank you so much Manard Glass for your great compliments on our Southern Sweet Bee honey and candles. Reviews like yours are special to our little honeybee farm and we just love getting such nice compliments on our products. Today was our last honey harvesting day and I am just now catching up on reviews. Thank you again and have a wonderful and blessed day! Mike"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "118048305108120047180", "name": "Lisa McNelis", "time": 1611340363806, "rating": 5.0, "text": "I bought the Pumpkin Spice candles months ago, and LOVED the scent so much that I ordered more!  This second order, however, due to Covid and the holidays, was held up at USPS.  Mike called me personally and said I should not have to wait over a month for my candles, so he sent me another shipment that same day!  I have never experienced such PHENOMENAL Customer service like this before.  I will keep shopping for a long time to come!  Thanks for all your help Mike!!", "pics": null, "resp": {"time": 1611346098305, "text": "Thank you so much Lisa for taking the time to reflect such great compliments on our products and service! It has been a rough 2020 year for us all due to Covid -19 and my passion hasn't stopped in making sure our Quality stays high and most of all our customers are satisfied with our friendly customer service. Getting this type of feedback makes our day here at Southern Sweet Bee and we thank you! Have a wonderful and blessed day! Mike"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "102069621337969183701", "name": "David J", "time": 1621096587208, "rating": 5.0, "text": "I got the peach orchards candle smells great.....now  my cleaning lady wants some. Thanks", "pics": null, "resp": {"time": 1628216460276, "text": "The Peach Orchard candle was my oldest daughters project and it is very nice. She did an excellent job on it and I am glad you and your cleaning lady are enjoying it. Today was our last honey harvesting day and I am finally able to catch up on these reviews. Thank you so much for the great review because hearing positive feedback like yours mean so much to our family. Take care and have a wonderful and blessed day! Mike"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "100122158047069302548", "name": "Katie Parker", "time": 1608769644443, "rating": 5.0, "text": "The best honey on the planet! We also love the candles (love the scents and they burn all the way down) and just placed an order for 4 on Sunday, received it Wednesday - super fast shipping and wonderful customer service! I cannot recommend them enough!", "pics": null, "resp": {"time": 1608836986971, "text": "Thank you so much Katie! You words means a lot to us and it let's us know that our hard work and quality is appreciated! Thank you for taking the time in sharing such great compliments on our products and services. Thank you also for being such a valued customer and supporter of our mission to save our much needed honeybees. Take care and have a wonderful and blessed day Katie! Mike"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "108050561398178239517", "name": "Dee Ann Greene", "time": 1605613462849, "rating": 5.0, "text": "I recently purchased a Tea Olive candle. Although it was packaged very well, the glass container was all cracked and broken.  I let Mike know, and he immediately responded with a sincere apology and a new ( in perfect condition) Tea Olive candle!  I could never have expected or experienced better customer service!  Thank you, Mike!!\n\nDee Ann", "pics": null, "resp": {"time": 1605618612501, "text": "Dee Ann Greene you are so welcome!  Thank you for your patience as we corrected the shipping damaged item and also for taking the time to give us so a great compliment on our response to the issue. Thank you for choosing Southern Sweet Bee products! Have a wonderful and blessed day! Mike"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "113946732728148827987", "name": "Destiny Madder", "time": 1612143159169, "rating": 5.0, "text": "Lovely honey and the candles smell fantastic. The farm is located on a small, gravel road that's on the roundabout. Google doesn't take you right to it.", "pics": null, "resp": {"time": 1612392669556, "text": "Thank you so much Destiny for such a great review of our products and the 5 star rating! I hope you enjoyed the tour of our facility and thank you for choosing Southern Sweet Bee products! When you are back in our area stop by and until then safe travels and enjoy your vacation and travel destinations! Mike"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "102116230818019736871", "name": "The Mix By Tina Shockley", "time": 1605369732487, "rating": 5.0, "text": "Their tea olive candles smell as good as my actual tea olive trees.  They are as sweet as their honey.  Great customer service too!", "pics": null, "resp": {"time": 1605620587698, "text": "Thank you so much Tina for taking the time in sharing such great compliments on our tea olive candles and our Southern Sweet Bee honey. Our tea olive candle idea came about due always finding my wife standing next to our tea olive plants during their bloom cycle to smell their lovely fragrance. One day I caught her standing in a drizzling rain to smell the flowers which gave me the idea to surprise her with a candle that she could burn inside year round. As the tea olives flowers season started to end she asked me if I could make a tea olive candle for her and it became my number one project to get completed. Don't forget to try our other scents because they just might impress you too! Our Southern Sweet Bee honey was chosen for the taste of the black belt region in Alabama. Thank you again and have a wonderful and blessed day! Mike"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "116429617139146941906", "name": "Lade B Sanders", "time": 1600971902746, "rating": 5.0, "text": "Southern Sweet bee candles and honey are AMAZING! The candles smell and longevity are A1‼️ I would HIGHLY recommend recommend both,the candle and honey! VERY PLEASED‼️", "pics": null, "resp": {"time": 1605619310648, "text": "Thank you so much Lade Sanders for taking the time to share such great compliments for our Southern Sweet Bee honey and scented candles! Your words of satisfaction of our products means a lot to our family honeybee farm as we do focus on producing top quality products. I hope you have a wonderful and blessed day! Mike"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "106254083854552961168", "name": "Rashad Alzuhairi", "time": 1598995988126, "rating": 5.0, "text": "My brother brought me some of their honey from Alabama and after having it I drove all the way down from Atlanta to buy their honey.\n\nit is truly a top quality product that is worth the drive...Highly Recommended", "pics": null, "resp": {"time": 1599003601588, "text": "Thank you so much Rashad Alzuhairi for taking the time to share such great compliments on our Southern Sweet Bee honey. Knowing you were willing to travel from Atlanta Georgia to Montgomery Alabama to purchase our product speaks volumes of our quality alone. Thank you again and have a wonderful and blessed day! Mike"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "110077572740685154648", "name": "Receptionist", "time": 1596489629801, "rating": 5.0, "text": "Best candles around. The cleanest, brightest, and longest burning candles. The fragrance(s) are wonderful and not over bearing. Prefer Southern Sweet Bee candles over aerosols in the office any day.", "pics": null, "resp": {"time": 1596498790263, "text": "Thank you so much Carrie for taking the time to leave such a great review on our Southern Sweet Bee scented candles! It makes our Southern Sweet Bee family excited to hear such great compliments on our products! Take care and have a wonderful and blessed day! Mike"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "102094910955056387919", "name": "Robert Hill", "time": 1617801838394, "rating": 5.0, "text": "Great service, very fast and professional and free.", "pics": null, "resp": {"time": 1617895203542, "text": "Thank you so much Robert Hill for such great compliments and the outstanding 5 start rating! Thank you for taking the time in sharing this so that we can hopefully save more honeybees from being destroyed with poisonous sprays while being charged to kill them. We relocate swarms FREE."}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "103193770062064505889", "name": "Melody Noble", "time": 1607815932268, "rating": 5.0, "text": "Delicious honey! You will love it!😋", "pics": null, "resp": {"time": 1607820328070, "text": "Thank you Melody for taking the time to share such a great compliment! Have a wonderful and blessed day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "100977456506080965023", "name": "Joshua Deason", "time": 1524264498270, "rating": 5.0, "text": "I had a really good experience with Mr. Mike at Southern Sweet Bee. He has great products and a passion for bees. I was even able to get a tour of his facility. He has top notch equipment. I was also able to spend the day working with him and his bees. I got to catch a swarm, split a hive, re-queen 5 hives, and look for queens. He took the time to explain everything to me. He even sent me home with one of the best smelling candles I have ever had. It was an awesome experience.", "pics": null, "resp": {"time": 1524278060475, "text": "I'm glad that you had a great day Joshua and I had a great time myself! It was nice to meet you and you did an excellent job today! I was really impressed that you were so comfortable around the bees.  Well it turned out to be a great day to be able to learn and experience a lot  .Thank you also for the great compliments on our equipment and Southern Sweet Bee Candles and I'm glad you were impressed! Have a fabulous day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "114983721014598459269", "name": "Laura Miller", "time": 1600969233301, "rating": 5.0, "text": "The best honey and candles I ever purchased.", "pics": null, "resp": {"time": 1605618893399, "text": "Thank you so much Laura for taking the time to give us such a awesome compliment on our honey and candles and for supporting our honeybee farm! It means a lot to us here at Southern Sweet Bee. Have a wonderful and blessed day! Mike"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "117081236463176556489", "name": "Chang Lee", "time": 1524234247787, "rating": 5.0, "text": "Owner, Mike has a strong business and customer(consumer) oriented mind with continuing study for environment and people's health.\nHis products of honey, fragrant candle from bee wax and lip balm are all organic and environment friendly products.\n\nI'm very much happy to know this Southern Sweet Bee LLC for keeping my family health....\nI strongly wish a sustainable growth of Mike business for keeping environment and peoples' health.", "pics": null, "resp": {"time": 1524276975947, "text": "Thank you Mr. Lee for sharing such nice comments about Southern Sweet Bee and our products! We are very excited that you and your family are enjoying them! We hope that you and your family have a fantastic day and thanks so much again for the great compliments!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "101068503211788868339", "name": "Wood Recycled", "time": 1523483309807, "rating": 5.0, "text": "I met Mike today and checked out his bee keeping operation and couldn't have been more impressed. I needed his help with bee swarm removal and relocation and he was very nice and helpful. He removed the bee swarm on my property for free and even gave me a beeswax candle! You could sense his passion for working with and saving the bees. This is the type of business that you can feel great about supporting. Thanks again Mike!", "pics": null, "resp": {"time": 1523487473177, "text": "Thank you Jeff for such great compliments that you are sharing about myself and Southern Sweet Bee. It has been a passion of mine going back to 1982 when I built my 1st bee hive which I still have the top half of as a reminder of my excitement I had and continue with today! I know you said that you learned a lot today and I'm glad! I'm also glad that the Southern Sweet Bee facility impressed you. I hope you enjoy that scented Southern Sweet Bee candle and you have a fabulous day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "115820220528452183557", "name": "Ian Bailey", "time": 1526162270086, "rating": 5.0, "text": "BEST HONEY I HAVE EVER HAD!!! I have been having trouble with pollen allergies and someone told me to try honey. So I tried a few different brands and nothing doing. Got some Southern Sweet Bee honey at Whole Foods and THIS STUFF WORKS!!! I don't know if they are singing to these bees or what but this stuff is great! 10/10 the only honey I will ever buy!", "pics": null, "resp": {"time": 1526508042992, "text": "Thank you so much Ian for taking the time and giving such great compliments for our Southern Sweet Bee honey! As the Southern Sweet Bee family reads such compliments it gives us all such inspiration and encouragement. Thank you again and I am so glad our honey is helping your allergies. Also Ian, thank you for the great rating too! Take care and have a fantastic day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "106547798899546873365", "name": "CatScratch Cabinets", "time": 1523111840498, "rating": 5.0, "text": "If you are looking for excellent honey, great candles, or swarm removal, call Southern Sweet Bee. This is a local man that understands why we need honey bees. He cares about the bees and all the good they do for the environment. He will come and remove honey bees and give them a safe home instead of killing them. And the honey is amazing!!", "pics": null, "resp": {"time": 1523117222584, "text": "Thank you so much for sharing such great compliments on our products as well as our honeybee swarm relocation services. We are trying our best to save as many honeybees as possible, however there are those who have no idea how important bees are to our survival as the bees pollinate to create our food supplies and cotton for our cloths. The more people like yourself that like our page hopefully the more it will move our page up to where more people will see that we save bee swarms for free instead of charging to kill them. Again thank you so much and you have a bless day from Southern Sweet Bee!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "100760438260699610330", "name": "Kristin Smith", "time": 1528476051790, "rating": 5.0, "text": "Mike with Southern Sweet Bee came out to our house because we had a swarm of honey bees on the side of the house.  For no charge he was able to capture the bees.  He did a great job and was very friendly and helpful!  I highly recommend calling him, and am going to try some of his honey as well!", "pics": null, "resp": {"time": 1528553452736, "text": "Thank you Kristin for taking the time and giving me such a great compliment on my services of saving that swarm of bees and relocating them. They already have a new home and are going to do well! I also thank you for giving Southern Sweet Bee such a great rating! You and your family have a wonderful weekend and when you get some of our Southern Sweet Bee honey remember that, not only can you have it with pancakes and sausage in the morning but you can use it to make your own honey mustard, honey butter and also add a touch a cinnamon. You can also add it to your favorite barbecue sauce or mix it with Heinz 57 original 50/50 to your grilled meat like chicken and ribs for a wonderful flavor!  Again Thank you so much for allowing me to save them and have a great day from Southern Sweet Bee!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "107369146047124680149", "name": "Jen Graham", "time": 1523196563611, "rating": 5.0, "text": "Safe, reliable & caring honey supplier, candle maker and beekeeper who  is dedicated to educating others about life without bees. If we didn’t have bees we wouldn’t have the flowers & crops to that we have today.  If you have a BEE problem, call Southern Sweet Bee before you consider calling a pest control person!! Allow him to relocate the bees and save our planet at the same time! I love his products and it’s nice to burn candles that  don’t have all the toxins  in them.  I hear eating  local honey  can help with allergies !", "pics": null, "resp": {"time": 1523197258106, "text": "Thank you Jen for taking the time and giving such great compliments on our Southern Sweet bee honey and scented candles and sharing the importance of honeybees in our environment! Thank you also for understanding our role here at Southern Sweet Bee of saving the endangered honeybees that are so needed to ensure our food sources and cotton for our clothing that we count on having everyday! Thanks again and have an outstanding day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "107352905825396016272", "name": "Jan Jones", "time": 1525966172303, "rating": 5.0, "text": "The Apple Cinnamon candle is awesome! You can smell it even before you light it. And Mike’s honey is the best out there. And Mike is passionate about saving honey bees. Don’t kill them...call a beekeeper!", "pics": null, "resp": {"time": 1525966642276, "text": "Thanks Jan for taking the time to share such great compliments about our Southern Sweet Bee Candles and Honey! Also thanks for reminding others to save the bees because we all need our pollinators doing their jobs in our environment to provide the food it takes with our growing population. Thank you too for the great rating on our company! Take care a have a wonderful day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "117480158223775081169", "name": "sylvia wright", "time": 1523117100716, "rating": 5.0, "text": "Came home only to find that \"New Friends\" had taken up residence at the upper left roof line.  Called with a request during late evening hours for removal which occurred early the next morning (4/7/18).  Mr. Keller removed the swarm of \"friends\" without harm.  Very appreciative of the prompt response and care used to remove the bees without chemicals.  I will recommend the services to others, Great Job!!!", "pics": null, "resp": {"time": 1523118150208, "text": "Thank you so much for taking the time to share such great compliments on my performance of saving those honeybees this morning. it was a pleasure and they have already been given a new home. I also thank you for sharing this with others to where it may lead me to being able to save more bees. We all need them to survive in our world so that they can continue to provide our food and cotton fabrics though their pollinating abilities. Again, Thank you so much from Southern Sweet Bee and have a bless day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "102240320726266254849", "name": "Dustin Nelson", "time": 1521635823189, "rating": 5.0, "text": "The products and services provided by Southern Sweet Bee are truly one of a kind. Their commitment to providing quality products is unmatched. The completely organic honey proudced is by far an away the best I have ever tasted, and their candles certainly produce an aroma that will delight your senses. Southern Sweet Bee has also made a great commitment to the conservation of the honey bee itself a creature so vital to the natural equilibrium of our ecosystem.", "pics": null, "resp": {"time": 1521720423676, "text": "Thanks Dustin for taking the time to comment and share such great admiration on the quality of our products. We at Southern Sweet Be are committed to impress our customers in all aspects of our products and are glad that you took the time to share your approval with our performance. We are also committed to the survival of the well needed honeybee which I'm glad you understand their vital role in our ecosystem. Thank you again Dustin and have a wonderful day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "113763368230250589262", "name": "Catscratch Farms", "time": 1523112592251, "rating": 5.0, "text": "I absolutely love this honey.  It is by far my favorite honey.  We use it in our cooking, just as a treat, for our allergies, and I also use it in my goat milk soaps!  He is also making candles and they are wonderful!", "pics": null, "resp": {"time": 1523116466944, "text": "Thank you so much for taking the time and sharing such great compliments on our honey and our honeycomb wax scented candles! Also it is neat that you are using our honey in your goat milk soaps at Catscratch Farms, that is awesome and we will check that out and order some! Thanks again and you have a fantastic day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "116702982696148156918", "name": "Jawaun Webster", "time": 1521503285794, "rating": 5.0, "text": "Hello everyone, Southern Sweet Bee truly is a Alabama secret of the South. The standard of the Honey and it's taste are the sweetest you will find. The Knew Candle line is another example of the companies passion to produce great products that make sense.", "pics": null, "resp": {"time": 1521504642049, "text": "Thank you Jawaun for taking the time to share such great comments about our Southern Sweet Bee honey and scented candles. Thank you for such a great rating too! Have a wonderful day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "104697705526143864756", "name": "Phila Blaylock", "time": 1521166836167, "rating": 5.0, "text": "If you have a bee problem call them! Mike is very knowledgeable in bee removal! He will have your bees removed in short order without killing the bees. Excellent service!", "pics": null, "resp": {"time": 1521203751687, "text": "Thanks Phila for your recommendations for our honey bee removal service. If not me please contact a beekeeper in order to save them because they need our help. Too many people are killing them not knowing their importance in our ecosystem."}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "100963400851503226015", "name": "Soohong Kim", "time": 1599001186112, "rating": 5.0, "text": "Hands down the Best honey in the world! Love their candle too! Smells so wonderful and lasts a long time! Keep up the great work!", "pics": null, "resp": {"time": 1524615242814, "text": "Thank you so much Soohong Kim for taking the time and sharing such great compliments about our products. We at Southern Sweet Bee maintain the highest Quality possible and we are glad you noticed and are enjoying our Honey and Candles. Have a wonderful day and thanks again from Southern Sweet Bee!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "113848602064522687169", "name": "Katie Hargrove", "time": 1523035239665, "rating": 5.0, "text": "We enjoy this delicious local honey year round. In cold and flu season I use it in my elderberry syrup recipe and in allergy season we eat it daily and it helps tremendously! Not to mention it is some of the best tasting honey I’ve ever had", "pics": null, "resp": {"time": 1523068345000, "text": "Thank you Katie for taking the time to give such a great compliment on our honey and too for giving Southern Sweet Bee such an awesome rating. We at Southern Sweet Bee are glad you are enjoying it and you have a wonderful day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "109810358024426298584", "name": "Daryl Sanders", "time": 1521511640329, "rating": 5.0, "text": "Southern SweetBee has consistently produced top quality honey year end, year out. I looking forward to purchasing a couple cases every year. The best local honey money can buy.", "pics": null, "resp": {"time": 1521602227526, "text": "Thank you Daryl for taking the time in giving Southern Sweet Bee such a great compliment on our honey quality and also giving our company such a great rating. Have a great day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "104849064623264769985", "name": "Joey Williamson", "time": 1523276876031, "rating": 5.0, "text": "The best honey around!! The best smelling candles, high quality!! Mike will also come collect bee swarms from your home or business.  You will also help save the honey bee by buying SSB products!!", "pics": null, "resp": {"time": 1523286561625, "text": "Thank you Joey for taking the time to share this information with others and giving Southern Sweet Bee such great compliments on our honey , scented candles and our continued efforts in saving the honeybees. Thank you for giving Southern Sweet Bee such a great rating too! Have a fantastic day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "110216436169161043859", "name": "Regina Ford", "time": 1522353816762, "rating": 5.0, "text": "Great taste!!! Awesome product... can't wait until the candles hit the shelves in all the local stores..", "pics": null, "resp": {"time": 1522360641459, "text": "Thank you Regina for taking the time to convey such great compliments about our products. Just so you will know you can find our honey and candles at Woods Pecans and Casey Feed stores at this time in the Montgomery area. Have a wonderful day and Thanks again!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "115023996580731511563", "name": "Willie Taylor", "time": 1522278018789, "rating": 5.0, "text": "Truly , the best organic honey that the south has to offer. I had a chance visted this  place.  Locally owned. He  and his wife,  are very good people.  Very professional!! Cant wait until the candles hits selfs", "pics": null, "resp": {"time": 1522279692731, "text": "Thank you Willie for taking the time and sharing such great comments about about my wife and myself and also our products. I was glad you had a chance to visit our facility due to most of the time we are in a bee yard making sure they are all doing OK. Our candles are in a few stores and have been cleared to go in a few more here soon. It want be long until you can get our Southern Sweet Bee honey and candles off the same cedar displays which look awesome together! Thanks again! and Willie you have a wonderful day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "100639467619438008457", "name": "Ron Bass", "time": 1523300176484, "rating": 5.0, "text": "Mike knows his business and produces very good quality products , I would recommend  to everyone and made/produced in Alabama can't get no better than that , highly recommend I'll keep buying", "pics": null, "resp": {"time": 1523364936546, "text": "Thank you Ron so much for taking the time and sharing such great compliments on our products and supporting the Southern Sweet Bee family!  I also thank you for giving Southern Sweet Bee such a great rating and recommending us to others! Again, I thank you and you have yourself a wonderful day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "108351060878220251099", "name": "Raquel Gildersleeve", "time": 1521465547250, "rating": 5.0, "text": "MR. MIKE IS THE BEST!!!! EVERY TIME WE CALL HE COMES RIGHT OUT! HE WORKS VERY FAST AND ITS FREE!!! DON'T FORGET TO TRY HIS HONEY TOO!!!!!", "pics": null, "resp": {"time": 1521481148610, "text": "Thanks Raquel for taking the time to give Southern Sweet Bee such a great rating, I have already put the swarm in a new home and thanks again for calling on me to save them. Don't forget to checkout our Facebook page and see our honey process. Have a fabulous day and call me back out if you get anymore honeybee issues."}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "109111622322020155832", "name": "Gerald Ledbetter", "time": 1522508224729, "rating": 5.0, "text": "Best honey I’ve found. The scented candles they make are great!", "pics": null, "resp": {"time": 1522717423657, "text": "Thank you so much Gerald for the great rating and compliments on our products! Have a wonderful day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "101572806480519971726", "name": "Brock Dennis", "time": 1523130767640, "rating": 5.0, "text": "Excellent and professional staff from their products to honeybee removal services, southern sweet bee is the way to go!", "pics": null, "resp": {"time": 1523152539388, "text": "Thank you Brock for the great compliment on our staff at Southern Sweet Bee and also for such a great rating. Have a wonderful day from Southern Sweet Bee!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "108333430574927360351", "name": "Williemae Anderson", "time": 1521853489493, "rating": 5.0, "text": "Great honey! This is a professional. He knows about the bee's.", "pics": null, "resp": {"time": 1522028974056, "text": "Thank you Mae for such great comments on our honey and my knowledge concerning honeybees. I started working with honeybees back in 1982 and have learned a lot about them throughout the years and I'm always learning more and still improving in all areas. Again, thanks for the great compliments and have a wonderful day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "103328988391612763142", "name": "Tony Coggins", "time": 1521207924736, "rating": 5.0, "text": "Amazing products, loaclly family owned.  I see their products starting to show up in stores for national  retailers . Quality that is seen long before tasting or lighting . I'm a fan of all SSB  llc products from honey to candles!", "pics": null, "resp": {"time": 1521255350511, "text": "Thanks Tony for taking the time for sharing great comments on our quality and great rating.  I am so glad your enjoying our products. Have a fantastic day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "112458478031580376752", "name": "Julie Varner", "time": 1523142760478, "rating": 5.0, "text": "Best local honey around and the family owners are honest and kind ❤️", "pics": null, "resp": {"time": 1523152871060, "text": "Thank you Julie for great compliment on our Southern Sweet Bee honey and thank you also for such kind words that you shared about our Team here at Southern Sweet Bee! You have a blessed day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "105067594334097078922", "name": "Z Perdue", "time": 1522780045860, "rating": 5.0, "text": "Excellent products and definitely a favorite in my house!", "pics": null, "resp": {"time": 1522830898727, "text": "Thank you so much for the great rating and compliments on our products, years of experience and a lot of hard work goes into achieving this quality  and just hearing these great compliments means a lot to us at Southern Sweet Bee! I'm so glad that you are enjoying them! You have a wonderful day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "101178246458683554076", "name": "John Varner", "time": 1523143070699, "rating": 5.0, "text": "Honey was great and helps with my allergies!!!", "pics": null, "resp": {"time": 1523153051249, "text": "Thank you John for the great compliment on our Southern Sweet Bee honey and I'm glad it is helping you with your allergies! Thank you for the great rating and again thanks and have a wonderful day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "117930754562125123590", "name": "Diane Ritchie", "time": 1523122306883, "rating": 5.0, "text": "Love their honey!  Buy local!", "pics": null, "resp": {"time": 1523152400243, "text": "Thank you Diane for taking the time and giving Southern Sweet Bee such a great compliment and great rating! Have a wonderful day from Southern Sweet Bee!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "100420592623503310500", "name": "Darryl Page", "time": 1523229106969, "rating": 5.0, "text": "Southern Sweet Bee is a great company trying to improve the environment", "pics": null, "resp": {"time": 1523236162619, "text": "Thank you Darryl for understanding and sharing our mission to help the environment by insuring the survival of one of our best pollinators, the faithful honeybee! Thank you also for the great rating. Have a fabulous day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "110242865443039931182", "name": "Aynsley Wright", "time": 1523729606136, "rating": 5.0, "text": "Best honey!", "pics": null, "resp": {"time": 1523760326745, "text": "Thank you Aynsley for taking the time to give Southern Sweet Bee honey such a great compliment and also for the great rating! Have a spectacular day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "110383664927474230316", "name": "Cresheva Davis", "time": 1523415014602, "rating": 5.0, "text": "Delicious honey", "pics": null, "resp": {"time": 1523486699678, "text": "Thank you Cresheva for taking the time and sharing such a great compliment on our Southern Sweet Bee honey! You have a wonderful day!"}, "gmap_id": "0x888e7c03d50cdac7:0xb91381e6a5b36b9b"}
{"user_id": "100163563544870173001", "name": "Jessica Henry", "time": 1619397723595, "rating": 5.0, "text": "We had the best experience ever. We are green and he has went above and beyond teaching and showing us the hives, explaining what we need to know. If I could recommend this with a 10 star I would! Amazing business and extremely knowledgeable! Thank you so much for the help. We will be buying everything we need from here out!", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "109480720721579624466", "name": "Dawn Lucas", "time": 1619393079893, "rating": 5.0, "text": "My son and I attended a hands-on workshop at Lookout Mountain Honey Bees this spring. It was very educational and David and his wife, the owners, were knowledgeable and accommodating.  They are passionate about beekeeping and go the extra mile to help anyone get started on beekeeping.  Their products are of very good quality.and it's worth the drive.", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "118348637130149293657", "name": "Kar Mc", "time": 1623426443489, "rating": 5.0, "text": "Great people. They are very knowledgeable. They also answer all my questions about beekeeping.", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "113310015486101534777", "name": "Chase Ragan", "time": 1619792031076, "rating": 5.0, "text": "The couple who runs this place are absolutely full of knowledge on bees and beekeeping and the store has plenty of supplies you may need. I recommend this place for anyone interested in beekeeping.", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "106746975387296167192", "name": "Scott Lucas", "time": 1619574152854, "rating": 5.0, "text": "I was in need of 10 deep Langstroth frames with wax foundations installed and shipped to me. They arrived the next day. Couldn't be happier. Thank you so much!", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "107632642386521716158", "name": "russ green", "time": 1619277191791, "rating": 1.0, "text": "Very insulting and rude.  Tried to sell me equipment I didn’t want or need.  I went back to get my hives and he changed my international standard made boxes to the way he thought it should be after I explicitly conveyed that he not change anything to my hives.  So I had to buy new bottom boards because his bottom boards are made at a different height and you have to buy his entrance reducer.  He kept my tops and enter cover.  And stuck me with his cheap made junk.  And was rude and insulting the whole time.  I wouldn’t recommend this bee yard to anyone for anything.", "pics": null, "resp": {"time": 1619294619381, "text": "Me Green got standard new equipment for rotted bottom boards and tops. We use the same specifications and materials that all the company’s use   Mr Green did get new frames (Mann Lake)  bottom boards, and tops   His were eat up by wax moths and the tops and bottom boards were not usable to put bees in.  He got about $400 of free equipment. He didn’t pay for anything but the bees he also came with an attitude when he brought his worn out or used up equipment and that being said I should have refused to put bees in his hives but instead we fixed them so that the bees would survive.  Sorry for the inconvenience for doing it RIGHT"}, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "102039771627925730217", "name": "J Chappell", "time": 1621894893739, "rating": 5.0, "text": "Great prices and staff is very helpful and knowledgeable", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "112200101182362652907", "name": "Tasha McClellan", "time": 1622572998072, "rating": 5.0, "text": "Very knowledgeable and very friendly and helpful. Knows their bees.", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "118358543088990776002", "name": "Bertie Woody", "time": 1543173488706, "rating": 5.0, "text": "We would like to thank you for all your help. We purchased 2 packages of bees in April and put them in our hives, We fed them like you said and added honey supers and in June we processed 6 gallons of honey and left a full super on each hive. We had a swarm and lost it high in a tree. We then got 2 queens from you and did walk away splits. We had one full super on 2 of the hives and the bees worked until Oct 20th.  One hive did not have enough honey, one hive had a full super, the other two hives had two full supers. We took one to process and got 2 gallons of honey, the other we put on the hive that did not have enough honey. We now have 4 hives with 4 full supers. We did our first mite treatment today with the equipment we got from you. Still feel like we don't know much and have a lot to learn. But it is nice to have someone to teach us in a way we understand. Hope the hives make it through the winter. Will keep you posted. Thank again for all your help.\nRob and Bertie Woody\nWill keep you", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "115918130127621274839", "name": "Angie Perkins", "time": 1590784628030, "rating": 5.0, "text": "Always great honey! Great service as well!", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "116589820607183684991", "name": "Jonathan Doss", "time": 1572738688817, "rating": 5.0, "text": "Very helpful. Owner is packed with helpful information", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "103466081772194302333", "name": "Kimberly Bearden", "time": 1491311367421, "rating": 5.0, "text": "Mr. Kelton is great!  He has everything you need to start beekeeping.  Loved visiting his property to pick up our hives.  He's a wealth of information and knowledge to tap into.", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "106392720840891651830", "name": "Larry Huff", "time": 1495047472631, "rating": 5.0, "text": "A good place for all bee related stuff.  Knowledgeable, friendly folks.  Classes for beginners and seasoned bee keepers.", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "100577123577841524213", "name": "David Register", "time": 1525568420204, "rating": 5.0, "text": "Was in despite need of two mated queens but could not make it there till Saturday. David wasn't going to be there but arranged to have someone meet me there.  Top customer service!", "pics": null, "resp": {"time": 1525569397569, "text": "We try to cover everyone’s needs. Thanks for the great review. If you need anymore help, call us. We always try to please our customers.\nThanks, For Better Beekeeping,\nDavid, Lynne and Lane"}, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "116427864890443032636", "name": "Jacob millican", "time": 1500512036721, "rating": 5.0, "text": "Very knowledgeable about all things bees and reasonably priced. David and Lynn are wonderful at helping new and old bee keepers alike.", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "101629363216877886302", "name": "Matthew Holbrooks", "time": 1499887666929, "rating": 5.0, "text": "Great place. And they have a great staff.", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "118119015387336317539", "name": "John smith", "time": 1567518562538, "rating": 5.0, "text": "Good people great place", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "102136520646113363453", "name": "Kevin Harris", "time": 1491093193329, "rating": 4.0, "text": "Very helpful if you are a new beekeeper.", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "107294648700969090712", "name": "Alan Bagwell", "time": 1492345149685, "rating": 5.0, "text": "Helpful people who are passionate about bees.", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "117406093540706235385", "name": "Denniss Cavanagh", "time": 1506114048078, "rating": 5.0, "text": "Always shop here. Number 1 in our book", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "110103199006527033028", "name": "Amel Drake", "time": 1520997371479, "rating": 5.0, "text": "Great bee store", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "105834142402121951764", "name": "Angie tidmore", "time": 1494013180211, "rating": 4.0, "text": "Friendly", "pics": null, "resp": null, "gmap_id": "0x888a6b3e1c0e5bef:0x3130c4d4879244e1"}
{"user_id": "105286370803620266774", "name": "Amy Johnson", "time": 1563382580212, "rating": 5.0, "text": "Great folks and good honey", "pics": null, "resp": {"time": 1563404633367, "text": "Thank you, Amy!"}, "gmap_id": "0x889baf3eab3119b9:0xa9c740a4ce45240"}
{"user_id": "102034923070514338174", "name": "Jeff Stone", "time": 1621547807872, "rating": 5.0, "text": "Ted was great to work with. Love my Bee's from T&A!", "pics": null, "resp": {"time": 1621556623370, "text": "Thanks Jeff!! Always a pleasure."}, "gmap_id": "0x888789e1243c41cf:0x362eccb3a8aa4806"}
{"user_id": "104862777150637397181", "name": "Tasha “Twamarie”", "time": 1590269108646, "rating": 5.0, "text": "Ted was very helpful and full of knowledge. He answered all of our questions and gave us some good tips. I inspected the bees and the frames as I moved them into my hive and they looked GREAT . They were active and all looked like they were healthy. No sign of deformed wings or mites. I found the queen on the first frame that I pulled (luck of the draw) and saw that the queen is in fact laying based on the size and positioning of the larva in the cells. He had a great instructional video on how to install a Nuc on their Facebook page.", "pics": null, "resp": {"time": 1590372130058, "text": "Thanks Tasha, Great customers!!"}, "gmap_id": "0x888789e1243c41cf:0x362eccb3a8aa4806"}
{"user_id": "104895635918136520704", "name": "Charles Boring", "time": 1617843737275, "rating": 5.0, "text": "Very nice people", "pics": null, "resp": {"time": 1621556684475, "text": "Thanks Charles! A pleasure doing business with you!"}, "gmap_id": "0x888789e1243c41cf:0x362eccb3a8aa4806"}
{"user_id": "108634400782009961035", "name": "CA Jones (CA)", "time": 1588288223042, "rating": 5.0, "text": "Ted and Angie were so helpful and easy to work with. Thanks T&A", "pics": null, "resp": {"time": 1590247829063, "text": "Thanks so much Carol Ann!!"}, "gmap_id": "0x888789e1243c41cf:0x362eccb3a8aa4806"}
{"user_id": "118443055088062388465", "name": "Gregory Brecht", "time": 1590197806869, "rating": 5.0, "text": "Lovely people! Very helpful!", "pics": null, "resp": {"time": 1590247755231, "text": "Thanks so much!!"}, "gmap_id": "0x888789e1243c41cf:0x362eccb3a8aa4806"}
{"user_id": "104759822870630001751", "name": "Andrew Fisher", "time": 1618924516303, "rating": 5.0, "text": "Great people to deal with! Wish you and your apiary the best. Hope yall have a great 1st \"Doge Day\" 2021!!", "pics": null, "resp": null, "gmap_id": "0x8888e8bb9c67bab3:0x1150340c29b88ec1"}
