{"user_id": "116808770302609833273", "name": "kim szczepanski", "time": 1622086718217, "rating": 5.0, "text": "Highly recommend Dixie horse and mule! They have great customer service! We bought a trailer from them 5 years ago,  unfortunately that one recently got totaled and we needed a new one. So we ended up buying from them again! Great service both times and very good people.", "pics": null, "resp": null, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "114300432556561808212", "name": "Cody Lane", "time": 1621200201388, "rating": 5.0, "text": "Love this store the friendliest folks and the best customer service you'll ever recieve. Don't matter if your buying a tractor or some gear oil you will be treated as thier most valuable customer. Will definitely be buying from here for all my tractor needs.", "pics": null, "resp": {"time": 1621201313218, "text": "Thanks Cody!!  We really appreciate you!!  Thx Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "109350081006556187307", "name": "Tracy Boykin", "time": 1616203076594, "rating": 5.0, "text": "Great customer service!! The whole process went smooth, service guys made sure everything was good and did minors repairs to fix a few things as we inspected trailer. Highly recommend if you're looking for a horse trailer!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPDEnGYNSrr9wX7EMNmxk_hqMgjz1mxzC8Kb_N1=w150-h150-k-no-p"]}], "resp": {"time": 1617148608760, "text": "Thanks Tracey!!  Really appreciate you!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "116138898068428398546", "name": "Josh Warnken", "time": 1621899303722, "rating": 5.0, "text": "The best place in the country to buy a trailer from, drove from Texas to pick one up from there just because their customer service, from owner to finance, and even service managers and techs. I will drive there no matter where I live to buy from there. Thanks Dixie Horse and Mule Co.", "pics": null, "resp": null, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "113997326769671152402", "name": "Jessica Lias", "time": 1618707470634, "rating": 5.0, "text": "Amazing Customer Service!!\nWent over everything. Highly recommend and we'll.worth the 15 Hour Drive to purchase from!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM4gfC0scv2cf0Ohjawy7NiwyYKpIxgTkbEmLGH=w150-h150-k-no-p"]}], "resp": {"time": 1619656964599, "text": "Thank you Jessica!  Really appreciate you!  Thx Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "108468674143566104838", "name": "Alexander Baker", "time": 1619655948679, "rating": 5.0, "text": "They did an awesome job getting me financed and delivering my tractor. Whole process less than a week thanks Don and staff.", "pics": null, "resp": {"time": 1619656902678, "text": "Thank you Mr Baker!  We really appreciate you folks!!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "116797248513542808210", "name": "P Carlyle", "time": 1596382277657, "rating": 5.0, "text": "Dixie Horse & Mule Company is the best!   It’s a very well managed dealership that doesn’t make excuses and they have built a great business on integrity and reputation.  We were delighted with this easy up-trade. They gave us full wholesale value for our trade-in and gave us great deal on a larger trailer.  Promises made, promises kept!   It’s not about the money, it’s about the kind of people you do business with.", "pics": null, "resp": {"time": 1596452787875, "text": "Mr Carlyle, thank you so much!  We really appreciate you folks!!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "103481755289886916916", "name": "Allison Morgan", "time": 1604251554431, "rating": 5.0, "text": "Great to work with...that means everyone...from Mike in sales to Cynthia in the office to all the guys in the shop. I've bought a lot of horse trailers from a lot of different dealers over the years, and this was my best experience ever. Great job, y'all...keep up the good work!", "pics": null, "resp": {"time": 1617148692166, "text": "Thanks Allison!  Really appreciate you!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "118046770741479489393", "name": "Kayla Blan", "time": 1585146988269, "rating": 5.0, "text": "The Dixie Horse and Mule Company are the best.  We have purchased a couple trailers from them and will only buy from them.  Their sales team, customer service and repair shop are fantastic!  They go far and beyond what you expect.\nMichael is absolutely the best.  We have worked with him on several occasions and he exceeds our expectations!\nIf you are looking for a horse trailer, you have to check these folks out.  You will be very satisfied!\nJr and Rhonda Dale", "pics": null, "resp": {"time": 1594139584139, "text": "Thanks Kayla!  Really appreciate you!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "108396363606797342145", "name": "Sophia Cork", "time": 1594855162093, "rating": 5.0, "text": "After driving 3 hours, we were very pleased with how things went today! The rain did not stop TJ from showing us all the trailers we were interested in. I was very impressed with how honest they run their business. I’m happy to know that when we hit the road our trailer has been fully inspected! Thank you DH&MC👍🏼", "pics": null, "resp": {"time": 1594861616547, "text": "Thanks Sophia!!  We really appreciate you folks!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "101166407484800113665", "name": "jenna griggs", "time": 1598121898734, "rating": 5.0, "text": "We had a great experience with your company. Dan was our salesman. He was super friendly, and he answered all the questions that we had. We bought a smc living quarters and a bee 2 horse pull behind. Service Manager and Service Techs were very detailed and knowledgeable. We highly recommend!\n-Marty and Jenna Griggs", "pics": null, "resp": {"time": 1598132060264, "text": "Hi folks!  Thanks for the very nice review, and thank you for your business!  We really appreciate you folks!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "113567608303257184068", "name": "Daniel Jacobs", "time": 1559601781755, "rating": 5.0, "text": "Bought my Lakota living quarters horse trailer here awhile back and have enjoyed our immensely. Wt had a bad experience on the phone prior to purchase but once we showed up and Dan got involved to help us out, everything went smoothly and very fast. I've been back for service now twice and the team in the back is great. The only negative i could offer is they don't do appointments so you're going to need to drop off your trailer for a week or three.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPIHgUBQ0_c7cQSxjbeas3SEuZ9MUGcd9y2K8IK=w150-h150-k-no-p"]}], "resp": {"time": 1559656709784, "text": "Thanks Daniel!  We really appreciate you folks!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "108509162025893846211", "name": "Nathan Wilson", "time": 1576541997019, "rating": 5.0, "text": "THANK YOU!  Dixie Horse & Mule Co. is simply the \"best-in-the-business.\"  From the moment we walked onto you lot (3-years ago) looking to purchase a new trailer, all the way to our recent service/repair job, your team consistently exceeds expectations.  In particular, we like to say a special THANK YOU to Michael and his service team.  Recently, we found ourselves in the unfortunate position of needing \"repairs-2-repairs.\"  While we attempted to get satisfaction from the original service location, after a week of frustration & negotiation ... we just picked-up the phone and told Michael we were having the trailer transferred to him.  Michael simply said, \"we'll take care of it.\"  And boy did they!  Michael's team went through our trailer like they were prepping for a military-style white glove inspection.  When they found something not right ... they fixed it!!!  Best of all, they got us \"back on the road\" 14-days ahead of schedule.  Simply Put:  Unbelievable Customer Service and Craftsmanship on all fronts!", "pics": null, "resp": {"time": 1579739710766, "text": "Nathan, thank you so much!  We really appreciate you folks!  I will pass this on to Michael and crew!!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "105060545836115758427", "name": "Brad Howard", "time": 1512596664791, "rating": 5.0, "text": "Updated review...Mike, Dan, and Mrs. Cynthia were great. After showing up last week on my way home from out of town, the folks here really showed what customer service looks like. Once again they proved why they have the great reputation they've earned. Even though I lost out on a good deal for the first trailer I wanted, they more than made up for it with helping me find a trailer that suited our needs and within our budget. It was one of the easiest transaction I've ever done. The drive was worth it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPA6ALDst4cUPZe_nmLGUHYRlT7tx24hY0FE5ut=w150-h150-k-no-p"]}], "resp": {"time": 1512138211795, "text": "Brad, I am very sorry you missed out on the trailer, and I'm sorry we missed your business.  You had not bought the trailer.  Dan, your salesman, called you once, and text you twice over a two day period advising you were approved and tried to close the deal.  You were busy and did not advise him you actually wanted the trailer until late yesterday.  In the interim we sold the trailer.  That is how business operates.  If you do not commit to buy, its always for sale to a customer that will.  Again, I'm very sorry you missed it but every trailer here is for sale to the first customer that commits.  THX  DON SMITH, OWNER, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "112655385755598915550", "name": "Andrew Allen III", "time": 1592851326635, "rating": 5.0, "text": "Only contacted them by email, but sales rep JT been very responsive and helpful.  We are still researching the options. Maybe we will make a trip to Alabama soon.  The negative reviews don’t bother me. I read them. Any company that has as many customers are always going to have few that can’t be be made happy. I can tell this is a good company.", "pics": null, "resp": {"time": 1592876531801, "text": "Thanks Andrew!  Really appreciate that!  We are ready to earn your business!  Thx Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "114737850816706719824", "name": "Luke Thurman", "time": 1622935004902, "rating": 5.0, "text": "Great people who work there", "pics": null, "resp": null, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "115950300370676201735", "name": "Tyler Reed", "time": 1610658097988, "rating": 1.0, "text": "False information. For anyone wanting to know go to Facebook page.", "pics": null, "resp": {"time": 1610654925597, "text": "Tyler, can you be specific please?  Thx Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "112578653179841028220", "name": "Ashley Brishke", "time": 1593190341478, "rating": 5.0, "text": "Purchased a new tractor from Dixie today and couldn’t be more satisfied in the customer service and how easy and fast Don and his team made the transaction happen! We will recommend Dixie Horse and Mule to everyone for tractor and trailer needs! Thanks again guys!", "pics": null, "resp": {"time": 1593194463327, "text": "Thank you Ms Ashley!  We really appreciate you folks!!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "117007075863222068803", "name": "Evan Smith", "time": 1597702792860, "rating": 5.0, "text": "Drove from Michigan to get a trailer made 100 miles away in Indiana. Hmmm. Still saved about $6000. Mike and Dan were very helpful so was the \"Big Man\" who walked down the Bison Trail Boss trailer with us (sorry never got his name). Great place todo business  with.", "pics": null, "resp": {"time": 1617148758554, "text": "Thank you Evan!!  Appreciate you!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "100807167007877559763", "name": "Mark Doyle", "time": 1596307610329, "rating": 4.0, "text": "The purchase was great! They did a fantastic job, and offers great service after the sale! Definitely Recommend!", "pics": null, "resp": {"time": 1596322550701, "text": "Thanks Mark!  Really appreciate you!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "106229190062688577858", "name": "Mule Skinner", "time": 1519166618153, "rating": 5.0, "text": "Great hassle free trailer purchase. Really liked the services they provide.  Can't wait to hit the trails again 😁🐴", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO3i6Q65ufnc8kzgbasM_UmWB7ya8fI7jM76A-z=w150-h150-k-no-p"]}], "resp": {"time": 1519170045208, "text": "Thanks Mr Mule Skinner!!  We really appreciate you and will be here if needed!  Don Smith Owner DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "115894799621159826644", "name": "Heather Harvey", "time": 1558379091363, "rating": 5.0, "text": "I would highly recommend this place to anyone!! Did the whole credit app and negotiating over the phone and had paperwork sent to me via email that way when we got there we saved a lot of time. Was highly impressed with how thorough they were with walking you through the trailer and making sure everything worked (even replaced a light bulb on the spot while were were there cause it blew when turned on). really liked the fact that they gave me plenty of cards for points of contact if we ever had any questions. (even had a question on Saturday night at about 7 o'clock and the service manager answered and was very helpful).. over all an AMAZING experience and would most definitely do business here again.", "pics": null, "resp": {"time": 1558447280159, "text": "Thanks Heather!!  We really appreciate you folks!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "111960173800698440478", "name": "Abby Lehman", "time": 1575392463672, "rating": 5.0, "text": "I have not been there. I am not a customer.  This is an edit to my previous review. I remarked on an incorrect ad feature which has been corrected in regard to Big Foot Levelers. My thanks to Don, the owner, who responded so quickly and kindly in resolving this issue.", "pics": null, "resp": {"time": 1575395816319, "text": "Thanks Abby!  Really appreciate it!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "102719359111825795484", "name": "James Dannelly", "time": 1582754872613, "rating": 5.0, "text": "Outstanding people to do business with.  Top notch attention to detail and service is at the top of their priority list", "pics": null, "resp": {"time": 1582812916899, "text": "Thank you James!!  We really appreciate you folks!!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "104392607463305478796", "name": "Ginny Craver", "time": 1563905480831, "rating": 5.0, "text": "I live in NC.  I drove to AL to pick up my trailer almost two years ago. I have not been sorry of that choice.  I love my trailer, bought really sight unseen, pictures only.   I have had very few issues, all easy to fix, simple adjustments.  A year later I asked if they had a blanket rack and a halter/bridle rack that would work in my trailer that my local trailer shop could install.  They got both right out to me.  My shop was not sure how they were to be installed so they called Michael, in service, and he walked them through the process.  I arrived at the National Barrel Horse Association world champion races Friday, July 10, 2019.  My blade valve for my grey water will not open.  I take it apart hoping I could fix it, nope.  I could do a temp fix but I would need the part.  I call Michael first thing Saturday.  He asks me to get him an address where he can send the part and he will get it right out.  By the time I got my answer it was after hours.  I sent Michael an email with all the information he needed.  I got the part early Tuesday morning.  Talk about great service!!!  I just wish they were closer so they were doing the service on my trailer. Thank you Michael and the whole team at Dixie.  They know what customer service is.", "pics": null, "resp": {"time": 1563914220644, "text": "Ginny, thank you so much!!  We really appreciate you, and will be here if needed!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "116079684670178568797", "name": "Blake Smith", "time": 1554556466479, "rating": 5.0, "text": "I picked up my trailer yesterday and I can say without a doubt that it was the most pleasant experience that I've ever had buying a vehicle or piece of equipment. I bought a used 2 horse \"as is\" over the phone without having seen it. When I got there to pick it up they had put 5 brand new tires on it and a new jack because they didn't like the way the tires looked and the jack was hard to crank. They didn't have to do that. Anyway everyone there from Dan the salesman to the guys in the shop who fixed me up when I didn't have the right plug on my truck went out of their way to make the experience pleasant. To top it off I left there with a sack full of goodies, caps, tshirts, pens, fans etc. I guarantee you that the next time I'm in the market for a horse trailer Dixie Horse And Mule will be my first stop.", "pics": null, "resp": {"time": 1554727978928, "text": "Thanks Blake!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "102407347196439918619", "name": "Robyn Johnson", "time": 1541780936333, "rating": 5.0, "text": "Ordered a new trailer to our specifications. Best price I could find after months of shopping all Southeastern trailer lots and private owners. Knowledge able staff. Easy to work with. Gave us a complete walk through before we left with trailer.", "pics": null, "resp": {"time": 1541863736842, "text": "Thanks Robyn!  We really appreciate you folks!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "105363673525447858030", "name": "Danna McFarland", "time": 1601580016122, "rating": 5.0, "text": "Cindy is more than great to work with.", "pics": null, "resp": {"time": 1617148720886, "text": "Donna, thank you!  You were too!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "105446439091513613300", "name": "Nate Montgomery", "time": 1594137301968, "rating": 1.0, "text": "Trailer was a trailer.    Don who owns the place though is nobody to be associated with.    Hateful man.", "pics": null, "resp": {"time": 1594139398133, "text": "Typical antifa tactics. Do as I say or you are a racist!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "116816047588862670158", "name": "Kevin Shelton", "time": 1542730333770, "rating": 5.0, "text": "The whole staff was very helpful. The whole process was very easy and no pressure!  Love our new trailer! Keaton was pleasant, Mike's crew explained everything on delivery, and the ladies in the office are awesome. Thank you again!", "pics": null, "resp": {"time": 1542833827872, "text": "Thanks Kevin!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "104473188683446021196", "name": "Amy B", "time": 1524845480913, "rating": 1.0, "text": "We were very disappointed. The salesman seemed willing to work with us, but the big boss only offered $50 off of a used trailer, when the salesman had already offered lower than that. We have great credit and were willing to buy today. Dan was very nice, but we will keep looking. Thank you. If they had even honored the price that the salesman offered, we would have bought it. The price was never an issue and we wound up spending $3,000 more at another dealer for exactly what I truly wanted, but the attitude of the owner and way they renigged on the original offer they made us while trying to make it sound like we \"turned down\" the offer--no thanks! Making an offer or saying \"would you take $200 less\" is not turning down anything. I will never recommend this dealer, especially with so many other great places around.  I am glad I was able to see the owners attitude up front and was able to find a truly fantastic dealer I am happy to send friends to.", "pics": null, "resp": {"time": 1518895104107, "text": "Amy, I’m sorry I could not reduce the trailer price to suit you. I promise I will not be mad with you because you would not pay what I am asking for it. I do appreciate the opportunity, and I wish you the very best in finding the right one for you!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "105187337705970655991", "name": "Jen Spencer", "time": 1585764564550, "rating": 1.0, "text": "The owner of this business is an unapologetic racist. Avoid buying here if you have a shred of dignity.", "pics": null, "resp": {"time": 1592695671532, "text": "Typical antifa tactic. “Do as I say or you are a racist”."}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "116338352764648799277", "name": "Bill Cook", "time": 1541288208718, "rating": 5.0, "text": "If you need a horse trailer, this is definitely the place to come. Their prices seem to be very good and they have a wonderful selection. I will probably end up buying a trailer from them in the near future.", "pics": null, "resp": {"time": 1541375930760, "text": "Thanks Bill!  We really appreciate the opportunity!  DON SMITH, OWNER, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "104207715189738326956", "name": "suzanne Craig", "time": 1556599056997, "rating": 5.0, "text": "We had a great buying experience with Dixie Horse and Mule Co.! We will purchase another horse trailer from them! And will recommend them to my friends! Salesman, JT and delivery driver, Carolyn was very nice, helpful and knowledgeable! Service Mgr, Mike was very, very helpful in educating us on our first LQ trailer and handling a few issues on the trailer! Thank you for making it a pleasant buying experience!", "pics": null, "resp": {"time": 1556628111008, "text": "Thanks Suzanne!!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "105958285479105296868", "name": "Timothy Hazard", "time": 1551569305361, "rating": 5.0, "text": "Everyone is always professional & knowledgeable.  They listen & customize your experience.  You will be thankful to have done business with them.", "pics": null, "resp": {"time": 1551707885262, "text": "Thanks Timothy!!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "101814263002963049761", "name": "amy parr", "time": 1498911925479, "rating": 5.0, "text": "I thoroughly enjoyed my experience working with Keaton at Dixie horse and mule. As someone who can find big purchases a stressful process, I found there staff very knowledgeable, helpful, and willing to please. Keaton was very easy to work with and did everything that was asked of him in a polite manner. I had to consider several trailers to find what was best for me and he just rolled with the punches. My experience with other places don't compare to the quality of service Dixie horse and mule provided me. I will definitely be a repeat customer in the future and was well worth the 6 hour drive. Thanks again!", "pics": null, "resp": {"time": 1509368027110, "text": "Thanks Amy!!  We really appreciate you folks!  DON SMITH, OWNER, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "101352154023683174167", "name": "Jeff Dillard", "time": 1562878327391, "rating": 5.0, "text": "This is the company that you want to buy from. I initially purchased a Branson 4815 Tractor with a 3rd valve function and a Grapple. I then went back and purchased a 62\" finish mower. I have had my tractor serviced as well. I have a Branson dealer 4 miles from my house but opted to drive 30 miles due to the excellence in customer service and price. I met the owner (Don) personally upon arrival, and Rodney who handles the Branson side of the business. This company and the employees genuinely care about their customers, which you do not see much these days. I cannot say enough great things about them. Drive the extra miles and be confident you are getting a great deal from someone who stands behind their products!! Thank You, and I wish you continued success!", "pics": null, "resp": {"time": 1562937134187, "text": "Thanks Jeff!  We really appreciate you, and we appreciate your service to our great country!!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "107629915213468237875", "name": "Freakinthestix", "time": 1594138803702, "rating": 1.0, "text": "Garbage human being.. spend your money elsewhere.", "pics": null, "resp": {"time": 1594208998045, "text": "Typical antifa tactic. Do as I say or you are a racist!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "107629915213468237875", "name": "Freakinthestix", "time": 1594138803702, "rating": 1.0, "text": "Garbage human being.. spend your money elsewhere.", "pics": null, "resp": {"time": 1594208998045, "text": "Typical antifa tactic. Do as I say or you are a racist!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "106847015544563563326", "name": "Pattie Bozeman", "time": 1605298506297, "rating": 5.0, "text": "Awesome place.", "pics": null, "resp": {"time": 1617148652287, "text": "Thanks Pattie!  Really appreciate you!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "116309060516266500284", "name": "Alicia Wills", "time": 1518647273572, "rating": 5.0, "text": "Staff is very friendly and knowledgeable. Got an awesome trailer at a great price. Highly recommend!!", "pics": null, "resp": {"time": 1575395891181, "text": "Thanks Alicia!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "110920918205965330091", "name": "Sue Holland", "time": 1555169058062, "rating": 5.0, "text": "Very pleasant place to deal with. We'll be back when we want a new one. Thank you for your help", "pics": null, "resp": {"time": 1555334287992, "text": "Thanks Sue!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "102110884401898509743", "name": "Scott Willis", "time": 1436379565196, "rating": 5.0, "text": "These folks have kept customer service a priority!  Both Sean and Don went out of their way to make certain that we purchased the right trailer.  We had many questions, and thought we needed something completely different from what we ended up getting.  We are so happy, they answered every question we asked with a solid answer, then backed it up with evidence.  The customer service here was impressive, the prices were fantastic, there is no other place you'll ever need to shop to find the right hauler!!!  These guys are the largest in the Country for obvious reasons!!!", "pics": null, "resp": {"time": 1436668274470, "text": "Scott, thank you for your kind words!  We hope you enjoy your new trailer for years to come!  We look forward to earning your business again in the future!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "109583487086388505788", "name": "Cicada Rose", "time": 1594134245293, "rating": 1.0, "text": "Don Smith uses racial slurs on his website and when he was asked about this, he was nasty, explosive and unprofessional.", "pics": null, "resp": {"time": 1594139265186, "text": "Typical antifa tactics!  Do as I say or you are a racist!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "103250680034094547301", "name": "Amber Wilson", "time": 1532970182613, "rating": 1.0, "text": "I will looking for a stock trailer.  I found one here we could afford.  I tried to get financing and  I already did my application last week. I got a email today saying they had more questions so I called them up and instead of answering any questions they may have I get informed they sold the trailer I was trying to get. I wouldn't recommend anyone here", "pics": null, "resp": {"time": 1533042723024, "text": "Amber, I am so sorry you missed the trailer.  All trailers are for sale until we actually have an approved application in hand or unless we have a non refundable deposit in hand.  Your application was declined by the bank, than a note was sent to you asking if you possibly had a co signer.  Before you responded back, another customer came in with cash and bought the trailer.  At any one time, we have around 10 or 12 credit applications pending on different trailers.  At times we have more than one application on the same trailer.  Again, I'm sorry you missed it, and we really appreciate the opportunity!  Thanks DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "102215841457255248404", "name": "Barbara Vizzi", "time": 1530375860554, "rating": 1.0, "text": "Owner, Don, is unprofessional and hung up on me. when I spoke to another employee, he tried to intimidate me, then he hung up on me as well. If you want to be treated with respect and curtousy as a customer, don't go to this place! I was shocked!\nUPDATE: I edited this review after reading the owner's totally untrue response. I never asked that my trailer be repaired to \"perfect\" condition, as he says. Also, it took over two weeks JUST to get a response from him about my repairs. I had to call to even get him to respond to my first email. Also, NOTHING in his response explained why he and another employee so rudely hung up on me. I guess you can read all his other responses and see for yourself that he takes zero responsibility for his own actions and blames the customer when they have a terrible experience.", "pics": null, "resp": {"time": 1530374753012, "text": "Ms Barbara, I'm sorry you feel this way.  After many days here with my service manager trying to help you out with your repairs, and having made many calls on your behalf, and agreeing to work your trailer in to do the repairs, it became evident to us, through our communications with you via email, that we were not going to be able to meet your demands as to restoring your trailer to perfect condition, nor are we able to keep your trailer under shelter while in our possession, so I decided it would be best if we did not do the repairs.  I politely advised you of this today, and recommended you locate a shop that could do these things for you.  There are times and circumstances in which it's best not to do business.  This is one of those times.  I certainly hold no animosity toward you, but it's evident you do toward us, and are seeking a pound of flesh.  There is no call for rudeness on your part, and there certainly won't be any on mine.  You are free to do business with whom you choose, as am I.  DON SMITH, OWNER, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "114590875337935361607", "name": "Lisa Wishon", "time": 1556823094781, "rating": 5.0, "text": "Great place to shop for horse trailers and great people working there", "pics": null, "resp": {"time": 1556887612277, "text": "Thanks Lisa!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "107868032458166266652", "name": "Doug Smith", "time": 1552071220446, "rating": 5.0, "text": "Great folks to deal with. Large inventory to select your new trailer from.", "pics": null, "resp": {"time": 1552145797899, "text": "Thanks Doug!!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "118083373087478245770", "name": "Kyle Nichols", "time": 1556375495713, "rating": 5.0, "text": "Nice people an trailers very happy with our interaction here", "pics": null, "resp": {"time": 1556547114562, "text": "Thanks Kyle!!  We really appreciate you!!   DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "107868032458166266652", "name": "Doug Smith", "time": 1552071220446, "rating": 5.0, "text": "Great folks to deal with. Large inventory to select your new trailer from.", "pics": null, "resp": {"time": 1552145797899, "text": "Thanks Doug!!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "109138011948017701786", "name": "Daniel Rodriguez", "time": 1598364201343, "rating": 5.0, "text": "Easy going folks", "pics": null, "resp": {"time": 1598371899666, "text": "Thanks Daniel!  We really appreciate you!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "107653669994842677342", "name": "Anthony", "time": 1479710546876, "rating": 5.0, "text": "My family has watched the company grow over the years.  The folks at Dixie have a great reputation of treating people right.  Great selection.", "pics": null, "resp": {"time": 1479751939809, "text": "Thank you, Anthony!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "101446461187286099467", "name": "Natalie Cox", "time": 1546869247573, "rating": 5.0, "text": "We purchased a new SMC LQ from DH&M and we couldn’t be happier with the entire experience! Literally every single person we dealt with from sales to finance to service was extremely helpful and kind!\nI would 1,000% recommend Dixe Horse & Mule Co to anyone looking to purchase a trailer! I was dealing with another large company in Ocala, FL who also sells the SMCs and the customer service was night and day difference!! The Ocala salesmanship was hard to get ahold of, and 24-48 hours later when he did get back with me he wouldn’t have the answers he was supposed to be getting me. Asked him for his best deal and the price didn’t go down but rather UP due to added freight charges.\nThe service I received from DH&M made our decision on who to go with extremely easy!\nThank you everyone for such a pleasant experience, I am absolutely in love with our new trailer!", "pics": null, "resp": {"time": 1546966921271, "text": "Natalie!  Thank you so much!  What a wonderful review!  We really appreciate you folks.  THX  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "110674710442962998214", "name": "Linda Ballard", "time": 1535119819701, "rating": 5.0, "text": "DHMCO made the scary process of buying a horse trailer online into a great experience.  JT answered all my questions, guided me through the process, and made sure I got the best trailer for my budget and needs.  Cindy and Cynthia made the remote purchase transaction as simple as possible.  The service department made sure everything was working and clean before it rolled off their lot, and the delivery team walked me through the trailer and made sure I was okay with it before leaving.  I’m impressed with the professionalism at DHMCO.  I will recommend y’all to anyone looking for a horse trailer.", "pics": null, "resp": {"time": 1535120899890, "text": "Linda, we really appreciate you as well as your kind words!  If you need anything in the future please let us know we will be here to assists!   Thank you again!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "102075294516515177703", "name": "Teresa Batson", "time": 1505663413233, "rating": 5.0, "text": "Another highly satisfied customer.  We drove from Granbury Tx with a trade , got there yesterday.  New trailer is everything described .  They were fast & efficient.  a special thanks to Priscilla & Dan.  We should be home late afternoon!", "pics": null, "resp": {"time": 1509367924132, "text": "Thanks Teresa!!  We really appreciate you folks!  DON SMITH, OWNER, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "117593217149113148107", "name": "Alyssa Buchthal", "time": 1585768257907, "rating": 1.0, "text": "Run by racists. Beware.", "pics": null, "resp": {"time": 1592695796515, "text": "Typical antifa tactic. “Do as I say or you are a racist”."}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "109467950599980471209", "name": "Regina short", "time": 1548935362466, "rating": 5.0, "text": "Great services,  everyone In the service department was fantastic", "pics": null, "resp": {"time": 1548943371551, "text": "Thanks Regina!!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "106640878269640204697", "name": "Mary C", "time": 1525835467289, "rating": 5.0, "text": "The service department is so helpful! These guys are great!!", "pics": null, "resp": {"time": 1525874459545, "text": "Mary, thank you so much!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "101742044537197344919", "name": "Bryce Davis", "time": 1505574798291, "rating": 5.0, "text": "Quick and easy", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP0ZxHmrFfGBWGQT--CMwgSs1xhsn8uf5g_NsiM=w150-h150-k-no-p"]}], "resp": {"time": 1509367949590, "text": "Bryce, thanks for the visit! We really appreciate it and will do all possible to earn your business! DON SMITH, OWNER, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "104711566484059271102", "name": "Ty Woods", "time": 1519157341834, "rating": 1.0, "text": "I believe there is a little bait and switch that goes on here!!!!  Advertised priced trailer was sold... and I get that that can happen however really tried to up sell me once we got there and trailer was gone.  Not sure trailer was ever there at the discount price but have no proof. Buyers beware I wasted a trip to Alabama", "pics": null, "resp": {"time": 1519158471489, "text": "Ty, you are absolutely out of line by accusing us of this.  WE'd never do this, and I resent you casting this aspersion on me, my outfit, and my employees.  If it was advertised it was here.  \"No proof\" you say, yet you slander us?  Shame on you.  If you'll give me the details I will sure look into it and publish on here.  Don Smith, owner, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "106399251755563917368", "name": "Amanda Schwendt", "time": 1515521395153, "rating": 5.0, "text": "Very helpful staff. Deal fell through but overall very nice experience.", "pics": null, "resp": {"time": 1575395923287, "text": "Thanks Amanda!  We really appreciate the opportunity!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "103219216832167289320", "name": "Michael Edquist", "time": 1552689466257, "rating": 5.0, "text": "Best selection new and used in the south", "pics": null, "resp": {"time": 1552742721997, "text": "Thanks Michael!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "102103496088017552071", "name": "Jerry Bellemare", "time": 1439491599364, "rating": 5.0, "text": "i bought a trailer from them in 2008. and 7 years later no problems with the trailer at all . they are as courteous today as they were 7 years ago great service and just good company all the way around i highly recommend  them to anyone", "pics": null, "resp": {"time": 1439556528539, "text": "Jerry- Thank you for the kind review!  We hope you are enjoying your Bison horse trailer and look forward to seeing you again in the future!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "112790926468671101305", "name": "Andrea Barstow", "time": 1519654961261, "rating": 5.0, "text": "Great experience dealing with these folks.", "pics": null, "resp": {"time": 1519654739304, "text": "Thank you Andrea!!  We really appreciate you folks!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "105714340869298678165", "name": "Fli Mi", "time": 1491598527707, "rating": 1.0, "text": "Lowball your trade in and inflate theirs! Would not waste my time with them again", "pics": null, "resp": {"time": 1491657050730, "text": "Fly Y, I'm sorry we could not give you what you expected for your trailer.  Due to its age (1994) and type of construction (Fiberglass Reinforced Plywood), it just has little value when competing with the other trailers on our yard, and would be a very hard sell for us.  We did advise you of this before you travelled.  It has to be a good deal for both of us or its just not worth doing. I do wish you the very best in finding someone that you can trade with.  I really appreciate the opportunity!  Thanks Don Smith, owner, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "108263720677849551039", "name": "Kevin Sullivan", "time": 1553295651394, "rating": 5.0, "text": "Great people & service.", "pics": null, "resp": {"time": 1553347029543, "text": "Thanks Kevin!  Really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "107543394613470604599", "name": "Tim Bigham", "time": 1530215145041, "rating": 5.0, "text": "Great people and great service!", "pics": null, "resp": {"time": 1530279602747, "text": "Tim, thank you so much!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "117177366249397549129", "name": "Dallas Mathis", "time": 1535133121773, "rating": 5.0, "text": "Friendly staff ( no pressure ) and LARGE selection of LQ trailers", "pics": null, "resp": {"time": 1575395860161, "text": "Thanks Dallas!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "105076483640335881579", "name": "brad doughtie", "time": 1550613519746, "rating": 5.0, "text": "Very nice 👌", "pics": null, "resp": {"time": 1550616477802, "text": "Thanks Brad!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "117177366249397549129", "name": "Dallas Mathis", "time": 1535133121773, "rating": 5.0, "text": "Friendly staff ( no pressure ) and LARGE selection of LQ trailers", "pics": null, "resp": {"time": 1575395860161, "text": "Thanks Dallas!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "113399399281158913698", "name": "Elena Ramos", "time": 1542157140874, "rating": 5.0, "text": "Excelent", "pics": null, "resp": {"time": 1542208966179, "text": "Thanks Elena!  We really appreciate you folks!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "109082154427388358596", "name": "Beverly Hamilton", "time": 1528468118163, "rating": 1.0, "text": "Horrible!! Do NOT even go! Waist of time! Contact me and i will tell you my EXPERIENCE!!", "pics": null, "resp": {"time": 1528470294687, "text": "Beverly\n\nI do not appreciate this post.  Myself and our finance department worked very hard to get y'all approved.  We cannot help that the bank turned down the application.  There is no need for you to call us unprofessional.  We really appreciate y'all giving us the opportunity to earn your business!  I wish it would have turned out differently.  When you do tell your friends, I suggest you mention the reason the deal did not work was due to credit, not the dealership that went above and beyond to get y'all approved.  Thanks again!  KEATON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "112223013964123073823", "name": "keith scott", "time": 1487716626123, "rating": 1.0, "text": "Traveled from Michigan to purchase a trailer never inquired about financing but the girl (Cindy ) took it upon herself to run a credit check for whatever reason!", "pics": null, "resp": {"time": 1487863517578, "text": "Keith, it would be impossible for us run your credit without you, or someone very close to you, having given us your personal info.  Your statement is false.  Your application came in to us at 719PM on 6FEB17.  The application was signed.  We have the IP address it came from if you'd like it.  If you did not send it in, someone in your family did.  You were in our store, and yall picked up the trailer, on Sat the 18th of Feb.  You posted this negative review on the following Monday, the 21st of Feb, after you picked up the trailer.  I'd appreciate it if you'd correct this rating.  Your dishonesty in posting it is showing, and it could hurt our business even though its completely false.  Thanks DON SMITH, OWNER, DIXIE HORSE & MULE CO."}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "104265428809223000941", "name": "Jennine Badenhorst", "time": 1545166361734, "rating": 5.0, "text": "Best service ever!", "pics": null, "resp": {"time": 1545248678490, "text": "Thank you Ms Jennine!  We really appreciate you folks and are praying for the very best for yall!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "103118682676161994699", "name": "Marcie Gay", "time": 1529764471184, "rating": 1.0, "text": "Horrible no help what so ever!", "pics": null, "resp": {"time": 1529931163247, "text": "Ms Gay, I am sorry you folks feel this way.  One of my salesmen, JT, asked yall on 3 different occasions, while you were here, if you needed help, and you did not.  He did direct you to the trailers you were looking for.  We were extremely busy, and short staffed, but we do not use that as a reason for poor service.  Had we known you did decide you needed help, we would have gotten to you just as soon as possible, consistent with helping those who were here before yall were.  Again, I apologize.  It is never our intent to fail to help anyone.  THX  DON SMITH, OWNER, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "114796167009110459211", "name": "denise cole", "time": 1527443429117, "rating": 5.0, "text": "Best price and quality around", "pics": null, "resp": {"time": 1527598471974, "text": "Thank you Denise!!  We really appreciate that!!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "114296993281398919525", "name": "Kay Osborne", "time": 1523298944141, "rating": 5.0, "text": "Very helpful and polite", "pics": null, "resp": {"time": 1523722841990, "text": "Thanks Kay!!  Really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "107676437804154174636", "name": "Donna Faulkner", "time": 1494023436411, "rating": 5.0, "text": "Bought my Lakota horse trailer there.", "pics": null, "resp": {"time": 1494076729103, "text": "Thanks Donna!  We really appreciate you folks!!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "117968821250749074726", "name": "Kevin Farthing", "time": 1461208336291, "rating": 4.0, "text": "Good inventory!", "pics": null, "resp": {"time": 1467113383550, "text": "Thanks Kevin!!  Really appreciate you!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "111340020648492165958", "name": "J", "time": 1461069990403, "rating": 1.0, "text": "its funny you turned me down on trading trailers last week credit score was toooo low but i came back to Decatur bought a brand new 2016 f-350 at 2.9 interest rate", "pics": null, "resp": {"time": 1461073810628, "text": "Bob, it was the bank that turned you down, not us. They have different criteria for hirse trailers as opposed to vehicles. Much easier to qualify for a truck. I'm sure sorry we missed your business. If we did the approvals you would have been approved!  We do appreciate the opportunity!  Don Smith, owner, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "116308428910534495257", "name": "Delores Black", "time": 1453850855920, "rating": 5.0, "text": "Thanks to all for making this purchase a pleasure", "pics": null, "resp": {"time": 1454004285582, "text": "THX DELORES!! We really appreciate yall!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "102221634857410247798", "name": "Hannah Rain", "time": 1435416197592, "rating": 4.0, "text": "Best Trailer Dealer Around", "pics": null, "resp": {"time": 1435449048958, "text": "THXHANNAH!!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "108531206953022530831", "name": "Thomas Richardson", "time": 1622327196084, "rating": 5.0, "text": "Great people, service and prices.", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "103954925502415020241", "name": "Amy Strickland", "time": 1526685441341, "rating": 5.0, "text": "Excellent price, product, and customer service!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO5DLDejKk_V_R91NTo6I_MYF_VkA02zwAW1AWg=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "104146607796122412734", "name": "Kimberly Cole Zemke", "time": 1602257464440, "rating": 5.0, "text": "Michael us amazing and kind and helpful.  He sold us the golf cart we have which was an AMAZING DEAL!!!  We have had it for over 4 years and no issues it runs like a brand new one.  Love it!!!  If you need a trailer or a cart this is the place to go.", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "116852313633494775461", "name": "Tommy Zaffina", "time": 1609551317072, "rating": 5.0, "text": "they took great care of my golf cart at a very fair price", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "105730269914771033381", "name": "Bill Crum", "time": 1594301199639, "rating": 5.0, "text": "I got a great price on a golf cart.", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "105950400399598896068", "name": "John Weeks", "time": 1549691075250, "rating": 5.0, "text": "On a trip to Atlanta to pick up a motorcycle I had a bearing failure on the trailer.   The staff saved my trip! Great price, great service, and just nice guys!  Thanks again guys!", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "118211182111054245412", "name": "Melissa Kenney", "time": 1556066087013, "rating": 5.0, "text": "I had a great experience. Lance and his staff are extremely helpful, and made the purchase of my utility trailer a breeze. Thanks guys!  I love my trailer!", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "112878877166662110359", "name": "David Coleman", "time": 1590600595546, "rating": 5.0, "text": "Good service and fair price", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "105707995202022143772", "name": "J Bishop", "time": 1523668593477, "rating": 5.0, "text": "Lance and his staff are absolutely top notch! I can’t say enough good about them. They bent over backwards for me on a trailer purchase with accessories. Outstanding experience and I would deal with them again! Absolutely amazing customer service, very friendly and honest!", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "114766514451668720681", "name": "gustavius Maxie", "time": 1558489983838, "rating": 5.0, "text": "Great people to work with i purchased a great golf cart and a enclosed trailer best pieces in town", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "102519569392415995511", "name": "Michael Reed", "time": 1576413545246, "rating": 5.0, "text": "Helpful and friendly  and honest people and i will be back", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "117623726088012499943", "name": "LadyA", "time": 1566281882048, "rating": 3.0, "text": "Good access to highway with decent prices.", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "104073533512037095696", "name": "Garrett Pass", "time": 1448979103820, "rating": 5.0, "text": "Very pleased with the help and service I received from TNT Outfitters.  I found them to be very honest people and not just trying to make a sell. Good business.", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "100827980336443509071", "name": "Ron Rothenstine", "time": 1537028761947, "rating": 5.0, "text": "They were very helpful and the only place that was open, I would recommend them to my friends.", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "112758005858889481584", "name": "Asher Flatt", "time": 1400992146554, "rating": 5.0, "text": "The staff at TNT Outfitters was extremely helpful and had exactly what we were looking for.  I highly recommend Truck-N-Trailer Outfitters for golf carts and trailers!  And my husband loves the truck accessories!", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "104348308464920940592", "name": "Retriever Fever Kennel & Co.", "time": 1544383267290, "rating": 5.0, "text": "Great service , made me a honest deal on some tires", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "105326765472364841139", "name": "Ar Binder", "time": 1502328990662, "rating": 5.0, "text": "Great visit,  received  excellent  service...thanks for for ur help Mick.", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "110727654775874212674", "name": "Donreco Glaze", "time": 1538292673649, "rating": 4.0, "text": "Great place for ur Golf Cart needs", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "117510777673596781507", "name": "Bill Lewis", "time": 1553091716631, "rating": 5.0, "text": "Great place fair on price and friendly", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "111347733909384461792", "name": "DonReco Glaze", "time": 1539593494435, "rating": 5.0, "text": "Great place for your golf cart needs", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "109908490511245862445", "name": "Jerry Plyler", "time": 1530386930483, "rating": 5.0, "text": "Good service great prices", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "111783116724064207118", "name": "Villeboi Racing", "time": 1553314353087, "rating": 5.0, "text": "Great guys good deals", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "114299529375906353889", "name": "Eric Jerkins", "time": 1544637645139, "rating": 4.0, "text": "Good selection", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "107507338406564971042", "name": "Robert Davis", "time": 1533465066972, "rating": 5.0, "text": "Very nice owner", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "102587419672656525972", "name": "Tommy Champion", "time": 1532798167169, "rating": 5.0, "text": "Great work", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "108491582765694770269", "name": "Jamacia Rudolph", "time": 1553269675922, "rating": 5.0, "text": "Great place and service", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "100845360677973159976", "name": "pete herman", "time": 1519238604129, "rating": 5.0, "text": "Great service with no pressure", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "114570348319076463380", "name": "Danny Lewis", "time": 1557845904008, "rating": 5.0, "text": "Awesome 👍👍", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "117834243295787295873", "name": "Tanya Gillyard", "time": 1506557714120, "rating": 5.0, "text": "Cargo Trailers, Utility Trailers, Truck Accessories and Golf Carts... Oh my!", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
