{"user_id": "115510477498388607862", "name": "Mary Morgan Sholter", "time": 1615218836665, "rating": 1.0, "text": "Kindred is a horrible hospice service.  I would not recommend them to anyone!!  First off they are very disorganized and they do not seem to have qualified and compassionate employees.  My uncle was in their care while severely sick, they only provided minimal support and care visits and did not listen to the family on how they could help and support.  The nurse who saw him day (hours) before his death said he was good and should be good for another week or so, she left without changing his colostomy bag and turned to my aunt and said, ok I’m leaving now you can do your job and she had to change his bag.  When he did pass it took them 4 hours to get to the home and pronounce him.  They called a day after his death to see if they wanted a nurse to come visit my uncle that day, he had been dead already a day!!!! And after 3 days after death they have STILL not picked up the equipment from the home! This place is horrible and would tell anyone NOT to use them!!", "pics": null, "resp": {"time": 1615220366244, "text": "Hello Mary. I appreciate you sharing your feedback with me and can assure you we take your concerns seriously.  I've passed along your review to our administration for investigation, and the leadership team would like the opportunity to discuss your concerns directly. For your privacy, please send your contact information to experience@kindredathome.com. When you provide your contact information, it helps to expedite communication with our team. As an alternative, you may call our anonymous compliance hotline at 1-800-359-7412 to report your concerns. Thank you, Brian D"}, "gmap_id": "0x888c2c8043d24bc1:0x4afb85ca252de576"}
{"user_id": "108699333513666355151", "name": "Del Chick", "time": 1547155532395, "rating": 2.0, "text": "I would not recommend them, at first they seem nice but they’re extremely disorganized.  I like Baptist Hospice, I switched to them and was pleased.", "pics": null, "resp": {"time": 1547211529879, "text": "Hello, Del. Thank you for sharing your experience. Please know we take your concerns extremely seriously.  I've passed along your review to our facility administration for follow up and would like the opportunity to discuss your concerns directly. For your privacy and in order to address your concern in a timely manner, please send your contact information to experience@kindredathome.com.  Providing your contact information will help expedite our communication. As an alternative, you may call our anonymous compliance hotline at 1-800-359-7412 to report your concerns. Thank you, Eric B, Director, Kindred at Home."}, "gmap_id": "0x888c2c8043d24bc1:0x4afb85ca252de576"}
{"user_id": "106871101799430229684", "name": "Carol-Ann Stewart", "time": 1616286244221, "rating": 5.0, "text": "Synergy Homecare was the perfect agency to support my dad’s stroke recovery. I needed a little extra help each weekday morning while my dad was on home health and his care giver (Brandon) really helped him gain his strength back.\n\nSynergy was very responsive and very easy to work with, I highly recommend this company.", "pics": null, "resp": {"time": 1617285655380, "text": "Thank you Carol-Ann it was an honor to provide care for your dad."}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "102407641770590147367", "name": "Delaris Juitt", "time": 1630341899390, "rating": 5.0, "text": "The office staff and caregiver are excellent Connie makes sure to provide the right caregiver to their patients.  Also counsel the caregiver on what the patients need.", "pics": null, "resp": {"time": 1630443795197, "text": "Thank you Ms. Juitt. We appreciate you!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "105152836720160835427", "name": "Jan D", "time": 1610993364460, "rating": 5.0, "text": "The caregivers we had were compassionate and loving. Helpful and caring. They took a load off our minds for sure. Synergy was easy to work with, as well. Thank you so much.", "pics": null, "resp": {"time": 1611160937729, "text": "Thank you Jan."}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "100953268878880699199", "name": "Tracey Sheets", "time": 1600803322962, "rating": 5.0, "text": "I continue to be impressed by all the staff at Synergy Home Health. Especially Mrs Keisha. I feel like they really care about the patient and as my husband’s caregiver, I feel very supported by Synergy. Everyone has been so nice and helpful. I’m extremely grateful I connected with Synergy.", "pics": null, "resp": {"time": 1600807057799, "text": "Thank you Tracey for your kind words!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "112357443399142504759", "name": "Aleshia Walker", "time": 1571425543312, "rating": 5.0, "text": "Working for SYNERGY has been an extremely positive experience.  The whole organization truly cares about providing quality care and support to each client, and is in this business for all of the right reasons.  They are available 24/7 and work hard to accommodate their clients' scheduling needs.  The office staff truly cares for each client like family and we have wonderful caregivers.  I'm excited to see what the future holds for Synergy HomeCare!", "pics": null, "resp": {"time": 1571428429210, "text": "Thanks Aleshia, we are blesses to have you on our team."}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "109757023190937385623", "name": "Jenny Hallyburton", "time": 1596589434418, "rating": 5.0, "text": "Synergy has great customer service and the management team has always been helpful. Scott and Lynn are always willing to meet families and answer any questions they may have. I highly recommend this sitter service.", "pics": null, "resp": {"time": 1596650962123, "text": "Thanks Jenny!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "111854529968598824500", "name": "Amy Whittenburg", "time": 1572538859541, "rating": 5.0, "text": "My mother is in late stage Alzheimer's and the caregivers have been wonderful with her.  They are very skilled and have the knowledge to deal with my mom on a daily basis.  They bathe, feed, keep her engaged and love on her.  Could not ask for a better company to take care of my mom.", "pics": null, "resp": {"time": 1572539905188, "text": "Thank you Amy!  We love working with your mom!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "102790628163316545891", "name": "Lady Te", "time": 1579859234962, "rating": 4.0, "text": "I will not be with this company much longer due to low pay, plus I found a wonderful family that I will be working for with much better pay. I love what I do and plan on staying in this line of work but love doesn’t pay the bills or put food on the table and clothe my children. I loathe being forced to work overtime just to make ends meet which takes time away from my family. I really do wish things were different because I absolutely love the company and some of the management. I just wish they paid based on experience but they don’t. If you are experienced you will be making the same as someone who has never done this before and are afraid of the elderly. They really do there best to show appreciation for there caregivers and cna’s but trust me, the best thing to do is pay your experienced employees a decent livable wage.\n\nYou can bet that whenever you see “competitive wages” on the job application just know that means you will be paid little to nothing and a decent check depends on how desperate you are for the money and if you aren’t desperate enough to do a boat load of overtime then don’t waste your time.\n\nI will say that Scott and Lynn are wonderful people and they are flexible with your shifts so you’ll be able to work what fits you best. Keisha, Kathleen and Santrece are so warm and wonderful to work with.\n\nI’d say this job is great for beginners and students who plan on going into medical. Although we do not provide skilled nursing like a Ltcf it is the basics and allows you to get your feet wet. I love the company but I’ve outgrown it and just because it’s no longer a good fit for me, doesn’t mean I will not recommend this company to reliable people who need work. I’ve already sent some people Synergys’ way.", "pics": null, "resp": null, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "101382569584896141318", "name": "T0785", "time": 1596580342498, "rating": 5.0, "text": "Thank you so much for your great care for our patients and staff at Arbor Springs!", "pics": null, "resp": {"time": 1596651018835, "text": "Thank you Taresa!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "101637236862186019155", "name": "Nicole Gachett", "time": 1597238908358, "rating": 5.0, "text": "Awesome staff and great welcoming atmosphere upon entry of the office.", "pics": null, "resp": {"time": 1597244129981, "text": "Thanks Nicole, you're awsome!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "108371891602155134744", "name": "Dwayne Long", "time": 1579543108674, "rating": 5.0, "text": "These are some truly amazing people who take  very good measures to insure that you are receiving the best possible care for what is going on and helps you understand all aspects of your care. And it helps that they have a great  attitude and outlook for helping people to understand.", "pics": null, "resp": {"time": 1596651070015, "text": "Thanks Dwayne!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "109195218335298633090", "name": "Janine Rumker", "time": 1542733229753, "rating": 5.0, "text": "Right from the very beginning, Shasta from Synergy made us feel welcome and cared for. She was patient and kind with my mother, who recently had a heart attack and had a stent put in. My mother is a caregiver, not used to accepting help and certainly a very proud and private person. She did NOT want any help, certainly not with bathing. Shasta knew just whom to send...Michelle. What a blessing! My mom went from not wanting any help, to wanting to take Michelle with her to her home in Florida! Michelle was so kind and understanding. She did things without being told, was efficient and sweet. I can't say enough good things about our first experience with home care. Thank you so much Synergy!", "pics": null, "resp": {"time": 1542753539473, "text": "Janine,\nTaking care of your mother was such a blessing. Michelle told us many times how much she enjoyed their time together. We wish the best for your mother in Florida and we will miss her.\nThank you again,\nShasta Kromer"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "105946262325231529260", "name": "venus9 Cotton", "time": 1584158205763, "rating": 4.0, "text": "I have never work there but I heard some good thing's", "pics": null, "resp": null, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "102790628163316545891", "name": "Lady Te", "time": 1579859234962, "rating": 4.0, "text": "I will not be with this company much longer due to low pay, plus I found a wonderful family that I will be working for with much better pay. I love what I do and plan on staying in this line of work but love doesn’t pay the bills or put food on the table and clothe my children. I loathe being forced to work overtime just to make ends meet which takes time away from my family. I really do wish things were different because I absolutely love the company and some of the management. I just wish they paid based on experience but they don’t. If you are experienced you will be making the same as someone who has never done this before and are afraid of the elderly. They really do there best to show appreciation for there caregivers and cna’s but trust me, the best thing to do is pay your experienced employees a decent livable wage.\n\nYou can bet that whenever you see “competitive wages” on the job application just know that means you will be paid little to nothing and a decent check depends on how desperate you are for the money and if you aren’t desperate enough to do a boat load of overtime then don’t waste your time.\n\nI will say that Scott and Lynn are wonderful people and they are flexible with your shifts so you’ll be able to work what fits you best. Keisha, Kathleen and Santrece are so warm and wonderful to work with.\n\nI’d say this job is great for beginners and students who plan on going into medical. Although we do not provide skilled nursing like a Ltcf it is the basics and allows you to get your feet wet. I love the company but I’ve outgrown it and just because it’s no longer a good fit for me, doesn’t mean I will not recommend this company to reliable people who need work. I’ve already sent some people Synergys’ way.", "pics": null, "resp": null, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "110463180510508467113", "name": "Urica Summers", "time": 1571426576882, "rating": 5.0, "text": "I started with Synergy last year it's a great place to work and the staff is very friendly and the schedules are flexible 😊", "pics": null, "resp": {"time": 1571428245321, "text": "Thanks, Urica!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "105536607524898326678", "name": "Gretchen McKenzie", "time": 1565981358160, "rating": 5.0, "text": "I have been working for synergy for two years and I love my job and they’re great people to work with.I give five stars to this awesome company!", "pics": null, "resp": {"time": 1565984793343, "text": "Thank you Gretchen!  We appreciate you so much!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "117152289914272617284", "name": "Erin Carter", "time": 1595974644799, "rating": 5.0, "text": "Great staff and so compassionate!", "pics": null, "resp": {"time": 1596026201190, "text": "Thanks Erin!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "115359726514514132019", "name": "Santrice McClure", "time": 1571425170185, "rating": 5.0, "text": "I start as a caregiver in 2015 when they first open up. I work in the field i absolutely love working for Synergy Home Care and the owners a very understand and i love working with them.", "pics": null, "resp": {"time": 1571428108107, "text": "You are an awesome caregiver."}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "105040614970322723215", "name": "Jasmine Tierra", "time": 1625257563702, "rating": 5.0, "text": "I came here from Montgomery to earn my CNA license and I had an offer for a job interview back home in one of the local hospital’s emergency  departments before I even finished the program! Totally worth it as opposed to other programs that take up to 18+ weeks. My instructor Natasha was the bomb! She really wants her students to succeed and fully equips you for the field. I miss it there!", "pics": null, "resp": {"time": 1625319803659, "text": "Jasmine you were a great student and person and we wish you nothing but success in life. Thank you for taking the time to review our program."}, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "116182182075752727487", "name": "Savanna Upshaw", "time": 1625249015632, "rating": 5.0, "text": "I took the MA program at saads and everybody there are absolutely amazing", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "110388887821605397135", "name": "Deirdre Snyder", "time": 1611347103584, "rating": 1.0, "text": "Rude, rude, staff. No professionalism whatsoever. The staff could not care any less about helping you or being even the least bit friendly or polite. I wanted to do business with a local company instead of ordering online, but they’ve made it impossible. This is my second visit and the last time I will shop with them.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "103436375027839050242", "name": "Krystal Littrell", "time": 1611939749308, "rating": 5.0, "text": "We use SAAD for my mother who is on Home Health Care and they are wonderful. They work around your schedule and it's a wonderful relief for me to have nurses and CNA'S come out to help woth her care.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "111343532482788391659", "name": "Lannie Shearls", "time": 1620733573339, "rating": 3.0, "text": "The staff that came to my home was very attentive and did their job but management was uncooperative and rude and did not give our doctor the correct information.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "102589736285448526851", "name": "Kurstin Nicole", "time": 1579306115405, "rating": 1.0, "text": "I Do Not Recommend! I took the MA Course in Aug 2018 & I still haven’t landed a job. Nonetheless an interview. Some of my fellow classmates also haven’t had any luck. Don’t get me wrong the MA instructor was excellent. I have no complaints about her. I just feel that for the price you’re paying they should have a job placement program after finishing the course to help their students land a job. I wrote them asking about if they had a job placement program like the other Technical schools just to have my message left on read. Very unprofessional. It took for me to message them a second time just for them to respond. They don’t care about their students & their life after the program. All they care about is the money. Don’t do it. Go somewhere else.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "107435373335659462815", "name": "Kay Bradley", "time": 1581704477899, "rating": 5.0, "text": "The Staff is beyond amazing. I’ve used them for years for my Parents Homehealth needs and now for my Husband’s Hospice service. I haven’t encountered one member from this awesome team yet that don’t exceed all expectations. Truly an amazing group. From the store to the Nurses, Aides, Social Workers, even just someone that answers the phone. You can feel their genuine love and compassion for everyone.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "117629804098008598422", "name": "Jessica Deese", "time": 1596292457360, "rating": 5.0, "text": "Katlyn and Courtney found 24/7 in home health care workers in record time. They were relentless in their pursuit of getting the help\nWe needed in an incredibly short time frame. So grateful for their help!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "100552586008493434991", "name": "Diane Faris", "time": 1591198849754, "rating": 5.0, "text": "We have been using Saads for years as a source for in home care. I have been very happy with the nurses and aids that have cared for me as well as the physical therapists that have helped me. Sometimes one has to be patient with the logistics of appointments for in home care but other than that I would recommend this company whole\nheartedly. Recently my husband went under Hospice care in our home. One aid Erica was so outstanding  in her care for my husband that she was a true blessing. He had a wonderful nurse, Latoya, who went above and beyond the call of duty . She is an outstanding nurse who truly cares for her patience’s needs and those of the family.", "pics": null, "resp": {"time": 1591370041095, "text": "Mrs Faris, we are very thankful for your kind words and recognition of two outstanding employees. We will work to continue to improve the logistics of delivering care in the homes of our community and believe the time is coming when patience is always appreciated but only needed for special circumstances. We plan to provide a gift to the two employees mentioned as a way of thanking them for making a difference in the life and care of your husband. You have our gratitude and love."}, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "103451236787718480584", "name": "Hannah Derouen", "time": 1588952082535, "rating": 5.0, "text": "Would highly recommend SAAD’s. I personally know a lot of the staff and they are incredible people that truly care about their patients. They have cared for my grandparents as well.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "107089769266925254823", "name": "lcp191", "time": 1576121714212, "rating": 3.0, "text": "Don’t get me wrong, the hospice facility is absolutely beautiful, and the nurses are very friendly, but the way my family member was treated after they passed was very disrespectful.\n\nThey had passed early in the morning, and I was reassured they would call to have his body transported ASAP. They covered his body with a sheet, left him in the room, and there he sat from 5:30 AM until 6:00 at night. At noon, I asked what was taking so long, and was reassured they would be here shortly. I asked again at 2:30, and was told the same. Finally at 4 I went to the admin office, and they forgot to call. After they finally called, they were picking up his body within 2 hours.\n\nThey were very apologetic, but they need to improve on communication.\n\nAnd although this did occur, I still wouldn’t hesitate to recommend someone to this facility if they needed it, it is definitely the best in the area. I visited probably 5-6, and the others had as much as 20:1 patient to nurse ratio, while this was 6:1 I believe. Food was good, and for the most part the nurses were all friendly.", "pics": null, "resp": {"time": 1576171844319, "text": "Lcp191, I appreciate your kind words about our care but I am deeply saddened with your report as nothing short of five star experience is acceptable to us.  It is an honor to care for patients and family members during this time. We respect this time very much and would never want a family to feel we are rushing to get their loved one out of our hospice retreat. Also, we are very much aware of when a patient has passed and work with our local funeral homes to make sure transport is arranged promptly. I am unable to determine what loved one you are referencing with this experience after passing and I ask that you call us and reference your review to speak with either our program director or with our Vice President. They are both hoping to hear from you so we can learn from your experience and make sure we deliver tremendous love and dignity for all patients and families we have the honor to care for.  251.380.3810"}, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "100691518852368159494", "name": "Robyn Danielle", "time": 1579880072925, "rating": 5.0, "text": "I took the Phlebotomy course. The instructor was knowledgeable and made the class fun. I would recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "112855492369501846261", "name": "JahMyiah Pollock", "time": 1521734986225, "rating": 5.0, "text": "I took the phlebotomy class and the instructor, Vic Walton, was AMAZING! Vic is the funniest man i know but he is also the best teacher i ever had! It’s a great learning experience; he will teach you everything you need to know and the second week you’ll be sticking patients at the hospital. It is a GREAT experience and it is definitely worth the money!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "115661041174065718004", "name": "Kim", "time": 1589896886560, "rating": 1.0, "text": "This place is EXACTLY what is says SAAD as hell!!! Do not use this company!!!! Especially Ms. Fulghum! This woman has no manners and is mean as a snake! STAY AWAY!!!!!", "pics": null, "resp": {"time": 1591370979311, "text": "Kim, your post unfortunately doesn't offer much in the way for us to improve. Saad is an arabic name as John E. Saad was the founder. His parents immigrated to this area from Lebanon and Mr Saad was very proud of his heritage and therefore named the company Saad Healthcare. Saad in Arabic actually means happiness, prosperity, success and good luck. Although you may have not had that kind of experience with our company, we do wish you happiness, prosperity and good luck in life. Your one other review on google seemed to indicate you have had other experiences where you reference someone you did not like and I hope you will post some reviews of places that bring you more happiness than the two you have chosen to review."}, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "106410530640102199650", "name": "Kayla Robinson", "time": 1534146438302, "rating": 5.0, "text": "I give Saad healthcare training and education service a 5 star! I had a great experience and received a lot of support to succeed in obtaining my phlebotomy certification. I was referred to this school from a local relative and I live out of town, coming from Massachusetts.I highly recommend coming to this school! My classmates and instructor were phenomenal. I gained so much knowledge about phlebotomy while attending. Thank you!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "112403386819159253369", "name": "Tye Roberson", "time": 1545093809919, "rating": 5.0, "text": "The Phlebotomy class was all I expected it to be, I really enjoyed the clinical portion and the hands on training. Our instructor Vic was AWESOME... a very knowledgeable patient individual who knows his craft. Hats off to Saad Heathcare for having such a well rounded instructor to teach. I'd refer anyone to take this class under Vic's leadership.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "100289629727852263591", "name": "Suzanne Karam", "time": 1576169420466, "rating": 5.0, "text": "The best constructed wheelchair I have had. The Saad's courier delivered my wheelchair to me at the hospital because I was being discharged on Sunday afternoon. Excellent quality in the equipment, and excellent quality of service from Saad's---the Patient Care Specialist, working in concert with the hospital staff, pursued my needs very efficiently and with precision. The physical therapists and nurses have been delightful!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "100593738433812147668", "name": "Elizabeth Peterson", "time": 1579644849999, "rating": 5.0, "text": "Saad has great customer service and if you have an order paid for by insurance that needs a pickup and advise what time you will arrive they have it ready at that time for you. Or just as you arrive so you will not have to wait at all.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "114929886995964051466", "name": "Shantrel Patrick", "time": 1520292115130, "rating": 5.0, "text": "My personal experience has been a wonderful one. The staff at Saad are both professional and efficient. I recently received my certification in phlebotomy and my instructor, Mr. Vic, was amazing. In just 3 weeks, he managed to teach everything we needed to know, to CONFIDENTLY & SUCCESSFULLY perform a phlebotomy in any arena, all while giving a good laugh.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "118381645402261227347", "name": "Dylan Clayton", "time": 1575813155014, "rating": 5.0, "text": "The nurse's are nice and the man cooking food is 11/10. Food is good did not expect that.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "107835493611532435555", "name": "K B", "time": 1563923443271, "rating": 5.0, "text": "I just finished the phlebotomy course and Vic is one of the best instructors I have ever been given the opportunity to learn from! Vic makes the class fun all while learning what you need to know to become a great phlebotomist. The hours may seem long but with such an amazing instructor that goes out of his way to make sure each individual learns and goes on to succeed in this job field the time fly's by. I would recommend Saad and Vic Walton 100 percent.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "115044511985254598818", "name": "Heather Board", "time": 1579880182645, "rating": 4.0, "text": "Took the phlebotomy course with Vic Walton, 100% would recommend anyone wanting to take this course to make sure he is the instructor. Our class of 3 weeks was well informative and we all passed the class and medca exam with A's. Vic trys his hardest to get you a job afterwards and makes sure you get the best out of your money.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "103737676487661534961", "name": "Ashley Burke", "time": 1520019715716, "rating": 5.0, "text": "I just graduated from the phlebotamy program and it has been one of the best decisions I have ever made! I wasn't confident at first, but with my instructor, Vic Walton, I became extremely confident in my abilities very quickly! He's a great teacher and full of a lot of knowledge. 10/10 would recommend this class to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "103238149531223491429", "name": "Kayla Porter", "time": 1555013193443, "rating": 5.0, "text": "I took the phlebotomy course in October, Vic Walton was my instructor. I couldn't be more pleased with my time there. Vic was more than helpful and did everything in his power to make sure that we were on track, no one was ever left behind. Honestly I would recommend this course to anyone who's looking for a change and who is looking to be certified. All of the instructors are wonderful and it was an experience that I will keep with me forever.\n\n2 months after I finished the classes and relocated to Florida, I was employed with lifesouth and every day I go to work and enjoy what I do.\nI appreciate my time at SAAD more than you know and I hope that anyone who is considering taking this opportunity decides to give it a shot because you won't regret it.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "117224497552447609984", "name": "Milissa Ziegler", "time": 1585924866842, "rating": 1.0, "text": "I tried to have a prescription for medical equipment approved through this company and every time I call they gave me a different excuse as to why it’s was not processed and said they needed more information from my doctor. My doctors office gave them more information and there would be another excuse. This was for a nebulizer which I needed. I also try to use them two years ago when I had knee surgery and I had the same issue. I would not recommend this company to anyone", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "104824697732381539608", "name": "Frankie Henry", "time": 1529682483761, "rating": 5.0, "text": "I’ve just completed the Certified Medical Assistant program and we could not have had a better instructor! She made everything easy to understand and stressed the importance of making sure we did everything correctly!! I recommend everyone who is interested to sign up!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "104164672565451965845", "name": "Shirley Stallworth", "time": 1576262909941, "rating": 5.0, "text": "I always have a good experience when I’m shopping at SaadHealth.  The staff are knowledgeable, and pleasant.\n\nS. Stallworth", "pics": null, "resp": {"time": 1576268698527, "text": "We are very thankful for you and appreciate your kind words."}, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "105531683509141889547", "name": "Erin Galey", "time": 1579881258342, "rating": 5.0, "text": "I have completed the certified phlebotomy technician program through Saad health care. I can honestly say their teaching programs are by far the most professional, organized, and innovative facility.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "104036838626785980890", "name": "Russell Perkins", "time": 1576200374855, "rating": 5.0, "text": "Very quick service from 2 friendly staff members.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "114481963440300789140", "name": "Sarah Jernigan", "time": 1516112434059, "rating": 5.0, "text": "I absolutely love this course and my instructor. I’ve learned a lot, and I honestly wish the course was longer because we have such a great time and Vic’s teaching methods are amazing. I highly recommend taking this class.", "pics": null, "resp": {"time": 1516114413796, "text": "Sarah, thanks for your review. We love Vic too and are so thankful to have great instructors. Thank you for choosing our program and we wish you the very best."}, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "114811735846599365758", "name": "Deborah Williams", "time": 1574865752311, "rating": 1.0, "text": "As Thanksgiving fastly approach, my heart gets heavier & heavier my first holiday season wthout my mother. Although she was never was allowed to be off to celebrate & create memorable moments wth her family, jus to pick up the phone & hear her voice say “hav a Blessed Thanksgiving I love you” 😭 made my day! She was working serving the Saad family creating memorable moments for their family on every holiday. For over 50 yrs she did this & shared many stories of how they treated her & the things she would suffer if she did try to take off. What a very heartless family! I would always tell her mama please let me say something to them this is not right! They are violating labor laws & your civil rights, she would say “no this is not the time” me being an obedient child would always obey my mother wishes. They stood up @ her funeral and spoke on how much they loved their dear Marybelle which was a lie, they loved what Marybelle could do for their family. FOR GOD SO LOVED THE WORLD THAT HE GAVE!!! GOD GAVE, HE ADDED VALUE NOT TAKE IT AWAY!!! That’s what love does!!! My mother is gone to her Heavenly Home, now it’s time to tell the story. The true story!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "105937809863153740488", "name": "Brandy Bumpers", "time": 1521923074454, "rating": 5.0, "text": "I currently completed the Phlebotomy class, and I loved it. Vic(Instructor) was terrific. He made the class very interesting. He was so helpful.  The class was very hands on. You actually get to perform  phlebotomies and not jus READ about them. I feel very confident in my skills and I'm ready to search for a job. This class was MONEY well spent!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "112843770104391580201", "name": "Kristin Brantley", "time": 1518279386829, "rating": 5.0, "text": "I just finished the phlebotomy course with Vic Walton and it was a wonderful experience. He made sure we knew our stuff. He was very helpful and forthcoming with information. He made the class fun and enjoyable. I feel very confident and comfortable with sticking people and look forward to a career that I will enjoy. This course fully prepares you for the real world. I met some wonderful people during clincals and I feel this is the right place for me. If you are considering this course or any of the other courses SAADs offers, they are very forthcoming with information about them.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "106469005556727229807", "name": "Orion Savoy", "time": 1516026510874, "rating": 5.0, "text": "The phlebotomy class has been a blast! I feel equipped to join the work force! I would reccomend this to anyone trying to get into the medical field. Vic ,the instructor, is a nice, funny guy. Good comic relief.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "111956575317290893383", "name": "Shyaunna Echoles", "time": 1568744510827, "rating": 5.0, "text": "I took the phlebotomy course almost a month ago and had a very good experience. Vic is an awesome teacher and helped in every way he could!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "117176364859831372836", "name": "Dr.David Callaway", "time": 1556508809555, "rating": 5.0, "text": "Great place for  your medical needs.They have great customer service.", "pics": null, "resp": {"time": 1553890601399, "text": "Hey David, we are very sorry to hear about your experience.  Our owner was made aware of your complaint would like to assist you personally.  Her phone number is 2512878889.  We apologize again and will take actions to prevent this in the future."}, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "113870546230787053740", "name": "Veronica Livingston", "time": 1521734439920, "rating": 5.0, "text": "In three weeks I feel that I have learned everything that I need to be able to perform in the real world. The second week of class we did clinicals at Providence hospital. Everyone has been very nice and made sure that we knew what we were doing. I highly recommend taking this class with the instructor Vic Walton.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "110541610668385812464", "name": "Uncle Jimmy", "time": 1545745535815, "rating": 1.0, "text": "AVOID this company at all costs! Aide was not ethical. Took advantage of my family member, an elderly man who is very sick. Police report made. Investigation unway while Owner of this company admitted her Aide’s actions but said her employee did nothing wrong! But take note, she terminated the Aide immedtely. As a result of this company, it has affected our entire family coast to coast with stress. We want to keep others from enduring the Dane if not worse. Do your due diligence first.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "109609613835616135007", "name": "Paige Bryan", "time": 1515949763219, "rating": 5.0, "text": "The phlebotomy class has been the most fun experience! 10/10 recommend for anyone looking for a career!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "118223952195832767229", "name": "kathleen woodruff", "time": 1557535703910, "rating": 4.0, "text": "I just completed the phlebotomy and the teacher Vic was great he made learning fun and made sure we knew how to be a great phlebotomist", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "108118177965588951142", "name": "Herman cobb", "time": 1558551482171, "rating": 5.0, "text": "I give sadd nurses a 5 star they are the best", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "113690855683728642641", "name": "Honestly Loyal", "time": 1515623450478, "rating": 1.0, "text": "I paid $800 for a phlebotomy class and did not receive the correct amount of clinical training hours. Throughout the 3wks.we were there, we only received 4 clinical hours in 1 day on a Saturday at a hospital in which our classes nor training were scheduled to take on weekends. Therefore only 5 of my classmates came and unfortunately the other ones could not because it was a Saturday. In which means they were not able to do any clinical hours. Unfortunately that was the ONLY 4 clinical hours for the entire complete 3wk.program. My classmates and I were cheated out of $800. Not a place to go for a phlebotomy training class. Don't waste your money. Go somewhere else and get the proper amount of training and clinical hours for your money's worth.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "112361321735294789974", "name": "Olivia Turner u", "time": 1533880900572, "rating": 5.0, "text": "Education department is wonderful and the phlebotomy teacher was excellent and knowledgeable", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "104259058254191468788", "name": "Brandi Murdaugh", "time": 1520029572928, "rating": 5.0, "text": "I finished the Phlebotomy class today and completely loved my experience at Saad's!! I had the best instructor. Vic Walton is an amazing teacher!! He made my learning experience a success. I was nervous and unsure of myself, but he taught me how to become a confident phlebotomist. I'm now on my way to a bright future as a phlebotomist thanks to my instructor Vic and education opportunity Saad's provided. I highly recommend this course!!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "101750578675502308346", "name": "takira baxter", "time": 1516206344033, "rating": 1.0, "text": "I attended a college where we received 160 clinical hours and up to 150 pokes in our phlebotomy course program. The phlebotomy program at Saad's no where near provided this to their students. My friend's instructor stayed texting and looking at the phone a lot while trying to teach them.  Clinical hours are the entire main key to having the knowledge, skills, and abilities to drawing blood. Saad's did not provide them or give them any clinical hours at all so they were lacking terrible skills and abilities of drawing blood because of the no clinical hours and lack of training. All the students complained and felt like the only thing they paid for was a phlebotomy button Saad's gave them after they were finished with the program. A hope to get job in the med.field but not a living off of job. Plus it's a very challenging job to get because too many people are trying to get a license for it so it is too much competition. Majority of jobs only hire experienced workers with 2+years of experience because they are afraid that you may cause a patient to have a permanently injured arm (hematoma) so they do not take risk. A permanent injury can cause the patient to sue the hospital. Volunteer programs do not offer many openings either because they are also afraid that you may cause an injury to a patient's arm so they do not take a risk on non experience phlebotomy technicians either. So be careful with this chose of career because it is no where near guaranteed to get a job for a while. And hospitals are starting to let RN nurses do more drawing blood than phlebotomist. So it makes it even harder to get a phlebotomy job. I also recommend and advise you to attend a college that offers the same cost for this program, more training, clinical hours, and you may have a better chance of getting a job. Because jobs trust colleges way more than a student who attended a healthcare place offering a program. Especially not Saad's due to their lack of non clinical hours and training.Take my advice seriously.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "109266193797410791492", "name": "John rohman", "time": 1498214119661, "rating": 5.0, "text": "To the saad's family, the Rohman family has been using saad's home healthcare services for nearly four years, we have had numerous visits from physical therapist, nurses and and home health aides all considerate  and very professional. There is one who stands out above all nurse Kerry Y she recognized the need of her patients share her ideas and techniques displays harmonious and  cooperative spirit, always conducts herself in a professional manner and was an important contributor to speedy recovery from a installation of ankle fixator. I'm certain. other patients benefit from nurse Kerry loving care it's been a real pleasure to have her in our home. Sincerely John Rohman chief engineer unlimited (ret)", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "112914118622779802302", "name": "Woody Yonts", "time": 1491241892546, "rating": 1.0, "text": "Upon the advice of my orthopaedic surgeon that SAAD was a top performing equipment provider I  bought a rubberized leg cast cover that the saleslady had a very hard time fitting, even after putting it on over a plastic bag.  It was more difficult to remove.   After taking the cast cover home, my wife and I struggled with the cover especially having a difficult time removing it.  I used the device one time and it is too hard to use.  I tried to return the clean and undamaged item to the store approximately 14 days after the purchase.  The salesman declined to return the item and his manager backed him up.  The sales receipt does state they have a 7 day return window but in my case I was unable to return the item in the stated time period.  Although there are several more expensive items that SAAD carries that I need to purchase,  I will take my business to a SAAD competitor.  Potential SAAD customers beware of purchasing an item that is extremely hard to use and beware of the lack of flexibility in the SAAD item return policy. SO SAAD.", "pics": null, "resp": {"time": 1491856726654, "text": "Mr. Yonts, we are very sorry about your experience at Saad Medical.  We would like to fully refund you and hope that you would trust us in helping with any future purchases. Please contact David Parnell our store manager at (251) 287-8933 or stop by our location on University BLVD.  We take pride in our customer service and look forward to assisting you in any way possible.\n\n-Saad Ownership"}, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "109300289197021295448", "name": "Passion Martin", "time": 1495720303045, "rating": 1.0, "text": "Cna education department never answer they phone. Every time I call to register for the Cna program, it seems like I could never do so bc I can't seem to get in contact with anyone. I leave voicemails never a call back.", "pics": null, "resp": {"time": 1495733212950, "text": "Thank you for bringing this to our attention. We are very sorry about the inconvenience.  Please call (251) 343-9600 and ask for Barbara Fulgham. She is will assist you with registration.\n\n-Saad Management."}, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "104334190412356343353", "name": "Maddi Owens", "time": 1520117444892, "rating": 5.0, "text": "I learned more in 3 weeks than I ever thought was possible! My instructor was Vic Walton & i fully recommend taking this course with him.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "109126253863898395616", "name": "Bea Phillips", "time": 1540468663500, "rating": 1.0, "text": "I have never worked with a company that demanded my SS card when equipment is approved by insurance with 0.0 copay. After approval, this company had my doctor's request for equipment, and still would not deliver without further paperwork from my doctor.\nAfter a month of poor service, I had to go elsewhere. Please shop around before crashing into Saad's.", "pics": null, "resp": null, "gmap_id": "0x889a4d2eebeb8da7:0x7f3bbfbe54537b08"}
{"user_id": "110362371069731585716", "name": "Don Jackson", "time": 1621116533155, "rating": 1.0, "text": "Where do I begin? During my father’s stay at this facility, he contracted Ecoli and was hospitalized  for two weeks.  Following his hospitalization, an employee of the facility (who claimed to have been looking out for my father) started texting and calling me.  She advised me that my father was receiving inadequate care, that another employee was abusive to patients and that the facility was unsanitary.  ECOLI IS TRANSMITTED IN UNSANITARY ENVIRONMENTS.   The employee then attempted to leverage me for money.  It was classic:  “I am going to look out for your father. He is not being treated well.  I need money..  Let me hold a few dollars.”  The employee actually sent text messages asking for money.  The Director of the facility was advised of the employee’s conduct.  When he was advised, he stated on a teleconference with almost ten witnesses that the employee attempted to leverage me because I was “successful” without accepting responsibility for the employee’s conduct.  Unsanitary environment, telephones that don’t work (even though you are charged for them),   etc.  Since the visitation restrictions were imposed 14 months ago, I am concerned that the quality of care has declined.", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "113392264273281434276", "name": "Just 1 Man", "time": 1531473605315, "rating": 1.0, "text": "Beware of this place.  Your family member is not safe.  They sent my mother in law off campus for an MRI that she wasn't scheduled for and didn't have it documented until the next day and never informed any of her 8 children that they were doing so. If there wasn't so much covering up and lying it wouldn't have been so bad.  Generally I believe in accepting responsibility and moving on to a solution,  but when grown women are lying and pushing the blame, that means this type of thing happens often.   If it had been my mother.... it wouldn't have ended like that.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMKsGutfPnmOrf4BxgAy7kJtQLHYOQljpk4Ga4h=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMruQtZHmPIL8Q1e5OK-O4fpAWHakk3ARXmwDEY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPcu7mgMdmOLdnfDvEh5-lBuQaY8uarQOf_UfG4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOMIuxGAboGbmKXDQQExyx8VNnNv9EkwpzGnWBy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMUe0s_WIExTNh-4tdidxqtWdi8Ccegc4X-AxhD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOIhHtC8q5551ePwsodbrtWpNTyoNMkUuulys_5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOa4ZmzDxAfaVdCFhxd1gH072DRDh9fmUHP2qz4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP4ig0UhYWPXH8_tgnb8_k-r5ZZac_urMIz2TiI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNtaCPt67K_ieRdMkt0axA4PUpfYq5l1LwO8O7r=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPBN3aXmW3s3YYRH2zKYR1cjaISLquNWEtifIvX=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "116990627022591063287", "name": "Esi Fante", "time": 1622974689180, "rating": 1.0, "text": "If you can avoid it PLEASE DO NOT go to this place! TERRIBLE!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "110477490497628531930", "name": "Vicki Scott", "time": 1583111196967, "rating": 5.0, "text": "Hillview Terrace is Amazing! My mom loves being there and they are taking such good care of her. We started in Rehab Select and they were great! The Administrator, Business Office, and the Nursing Staff on Oak Station are so so wonderful. They always check on my mom and keep her room clean. They have fun activities for the residents. We couldn’t ask for a better group of people to take care of my mom .", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "103404453744902264223", "name": "Douglas Dunn", "time": 1596656553131, "rating": 1.0, "text": "My uncle was placed here for 14 days after a broken hip.  The center used the COVID-19 pandemic to keep family members from checking on him.  He was left unattended because they said he had to be quarantined.  His surgical dressings were not changed during his stay here.  He was not bathed.  Now he has bedsores, open sores in his groin area, and his surgical sutures were infected.  This facility used COVID-19 as an excuse for neglect.   He is now in more pain and in worst shape than before he went into this facility.", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "115332787168540554038", "name": "Kendra Johnson", "time": 1576589639448, "rating": 5.0, "text": "This review is for Rehab Select!\n\nThe admission process was seamless and the staff was outstanding! Huge thanks to all of you for taking care of my grandmother after a traumatic experience. We greatly appreciate you guys and couldn’t thank you all enough! Would definitely recommend!\n\nHonorable mentions to Ms. Awilda, Audreanna, and Nurse Paige! You guys were awesome!", "pics": null, "resp": {"time": 1579488759044, "text": "Thank you"}, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "101513295959200797940", "name": "James Archie", "time": 1580420492124, "rating": 5.0, "text": "Admission process was seamless, way faster than the hospital, the staff was very nice and i was informed of her health condition every day", "pics": null, "resp": {"time": 1580489310018, "text": "Thank you for your review and i'm glad you had a great stay. We are always looking for ways to make processes work better. Let us know if we can ever be of any assistance.  Thank you again."}, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "110130734769499153325", "name": "audrianna laprade", "time": 1580420925368, "rating": 5.0, "text": "I had a great experience, great staff and great care, sometimes they took a few minutes to answer the call light but overall very good", "pics": null, "resp": {"time": 1580488929676, "text": "Thank you for your review and I’m glad you had a great experience. We will continue to strive to exceed our customers expectations.  Thank you again and if we can ever be of assistance please let me know."}, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "112560825251651090280", "name": "Berenice Lopez", "time": 1580419938462, "rating": 5.0, "text": "My loved one received the best care here, the staff is very friendly , and they have an amazing Rehab program!", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "113947367106011066301", "name": "Fred Burnett", "time": 1603157529991, "rating": 5.0, "text": "The nurses were very helpful", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "105294504306449432759", "name": "wendee hughes", "time": 1552284425722, "rating": 5.0, "text": "Very nice and very clean facility. Staff are knowledgable and caring with patients. Had an excellent experience here and would recommend to anyone needing a place for their loved one!", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "111226592635558673172", "name": "Peggy Terry", "time": 1558901284450, "rating": 2.0, "text": "When you gotta go you gotta go !!\nThis is Rehab select adjoined to Hillview terrace.\nThis staff here doesn't get in a hurry for anyone. The call button is useless . I experienced this myself not the patient. I'm going to find out a top person to talk to . This was on Sunday afternoon between two and three . Finally got a tech by going to the desk . Oh she came and then disappeared for another ten minutes before actually fixing the problem.\nDon't bring your family member here.\nRehab Select", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "104219253168906735577", "name": "Awilda Fegans", "time": 1581018931690, "rating": 5.0, "text": "I would recommso please with her out come.\n— Awilda Fegsns\nend Hillview Terrace to all of my Friends and Family...", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "102836385155515055988", "name": "Patricia Carroll", "time": 1595982402562, "rating": 1.0, "text": "If you can AVOID this place at all cost. It shouldn't even be open.", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "117512636144899196082", "name": "Lover Boy", "time": 1536084308694, "rating": 1.0, "text": "I've never been to this place, but I've interacted with a few of the staff at my former job. Those particular ones were rude & had no basic manners. I guess because they wear blue scrubs & work in a clinic that they must think they're above you. One in particular I dealt with named \"Marghert\" had a very cold demeanor the whole time I was waiting on her, and of course, she didn't say thank you or anything when the transaction was over smh. I won't refer any of my loved ones to this place. If you care about your loved ones, then you wouldn't either.👎", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "115671644076438443237", "name": "Jennifer Dickey", "time": 1525899520605, "rating": 1.0, "text": "This place is a joke. Giving them one star is too much. I honestly cannot believe this place is still open. My mother's care was ridiculous. They never gave her her meds when they were suppose to be given. They all acted like they hated their jobs. They looked and talked to my mom like she was disgusting. I got her the hell out of there and took her to the hospital so she could get real care and they were appalled by her treatment as well. They even tried to blackmail her when she said she wanted to leave (per her surgeon who did not agree with any of her care) and stated that she would be stuck with the bill because Medicare wouldn't pay. I called Medicare myself and they said that's not true. The whole place smells like urine and feces. The rehab lady was rude as hell as well. No one here is professional. I could go on and on but just thinking about this place disgusts me. IF YOU LOVE YOUR FAMILY MEMBER, DO NOT SEND THEM HERE!!!!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "106538787021055842802", "name": "Dixie Forever", "time": 1443460954362, "rating": 1.0, "text": "If your family member passes away at this facility, the administrator sends any funds in the patient account to Alabama Unclaimed Property rather than turning the funds over to the designated family contact.  You will never be able to recover the funds, as the administrator will not authorize Unclaimed Property to release the funds.  The administrator will dodge your phone calls and refuse to communicate with you.  They are ripping off patient accounts.\n\nThe nursing home is filthy, needs repainting and reeks of urine.  DO NOT send your family member here.", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "110314129110964388632", "name": "Ann Jac-Gor", "time": 1536092853114, "rating": 1.0, "text": "My mother in law came for rehab from knee replacement surgery. She has dementia, diabetes and the knee surgery.  They along with the insurance company said that they know how to deal with patients with dementia. They complained to my husband that she couldn't respond to their commands and she just sat there...his response was I thought you had the capabilities to deal with dementia patients? The response was \"we don't do miracles.\" Mom had TWO UTIs while there. The second time we came close to the room on Sunday to a foul smell.  I checked to see if she was wet. She was wet and the pad beneath her was wet as well. They sent a culture of urine to be tested on Monday; the result was that she had a Urinary Tract Infection (UTI). By Wednesday they were awaiting prescription orders for her treatment.  My mother in law was transferred from there to another facility the next Tuesday. The UTI was still not treated. The facility where we had her transferred handled the UTI immediately. Dementia gets worse when there is an infection or UTI. She's Diabetic: they told me that they don't have a diabetic diet there to give patients. Well, I asked them not to give her sugar, caffeine, and pork. Her sugar was as high as 300+. When she was home, 118 was the highest unless she cheated then 220. She never took insulin shots; she got them there because they sent it up high with the bad diet, then gave insulin to bring it back down. Diabetic patients are groggy or sleepy when their glucose is up. According to them, she doesn't respond to commands. DUH if her glucose is high and she has a UTI, what the heck do they expect? OH, they don't do miracles! I guess I was talking to a wall when instructions and requests were given!!", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "100223018059746284973", "name": "andrew cook", "time": 1463336085942, "rating": 5.0, "text": "I visited a family member in this facility and couldn't have been happier. Great facility and staff members. I wouldn't mind staying here when I get older!", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "111015174795016819423", "name": "Misael Hacked my account Santos Hernandez", "time": 1534112174006, "rating": 1.0, "text": "You all need to hire more men because ladies are not strong enough to pick up them people.\nAnd your parking lot is too dangerous. I see why people dont like to visit anyone there because the parking is so difficult you might hit someones car. Hope y'all change how you do things. Thanks", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "116383739753856880524", "name": "Karlito Sway", "time": 1498610935423, "rating": 1.0, "text": "Its depressing as hell to be honest. Why tf would anyone wanna send their loved one to die here?", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "109178797799692328928", "name": "Julianne Hansen", "time": 1551657553656, "rating": 1.0, "text": "Sadly, I visited this facility to see a friend's mother who is recovering from an injury.  She said she hadn't had a bath and that she hadn't been \"changed\" all day.  Yet I saw plenty of staff gathered around the desk chatting and joking.  When I visited the restroom, a cockroach ran across the floor of the stall I was in .  I am appalled at the conditions here and would not want a loved one of mine placed here.", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "112110909459577945586", "name": "Daniel Bonner", "time": 1563843569850, "rating": 1.0, "text": "My medicine is 2 hrs late every morning. The nurses will argue about something as small as weather I had 1 or two drops in my eyes. Very immature and arrogant nursing staff.", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "104199677204067561749", "name": "lrs 0022", "time": 1463336299232, "rating": 5.0, "text": "Love this facility! good and clean environment", "pics": null, "resp": {"time": 1465409514050, "text": "Thank you for visiting our location."}, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "113755979874501631707", "name": "Lakendra Jones", "time": 1442277600865, "rating": 1.0, "text": "The administrator was nice and very professional", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "104559874364757622142", "name": "Sam Cullen", "time": 1531139544395, "rating": 1.0, "text": "Corn dogs for bypass patient and filthy condition. This place needs to be closed", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "109396910537942618601", "name": "vanessa brown", "time": 1542262126393, "rating": 3.0, "text": "My Dad considered this facility. We chose a different one. He needed more care than this one provided. This facility is more for seniors who are able to prepare their own meals and don't need as much support. The facility doesn't provide 3 meals per day and does not have an RN for every shift. IMO, if the senior is in reasonably good health and just needs an occasional \"look in\", then it could be fine. I felt as the seniors needed more help with daily living activities then that's when the facility really makes their money. I will be honest and say these are my opinions and everyone knows what that means. The 2 bedroom apartment was nice esthetically,  the staff seemed nice. It just wasn't a fit for my parent. My objective in this post was the photos of the apartment. Hopefully it helps someone.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPmN4GyAdHKnj1ZdMzAvbrvxNotws0ICVoAuD4s=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMMQuu16wJsnqYWVfb0rOT4J1aZTXrBAJwt3lcx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM-YIhdP4mdxOrL5D_faigvKHR2upfkHib40qvS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO6VbMZ-Qv2z92wLacs3XBzgm2tkeK3-c9ck8Q3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOPEvoB0RorVysmA7VzhspeaBrQahgweZlzVTVn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOdcIAo5fkZkuevUa67fJa4q5eQBDfAWx-sZfpt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO79tzSS_-vKEcCBq4D4nwc0RM0-yGSM4CcHwES=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMAASjgqwBDWddbhiZC2i2RRBObex9wST-wwzYj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN90S9rVfS6lKUtcbyz-ohwS-vAoZXF3pRyHXAc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPncoewE0lSYfLSsE0FR7kfEby28l_kO_9uKmFM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPDabNfkj1awVkG0jSfAJ9oo2i5EpDc-aSmnhyW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMVbu1E-6S0hHSugbA-mIykxp5HC36Wsk2lZJao=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "111030873461850762635", "name": "Anthony Bowen Sr.", "time": 1590526970541, "rating": 5.0, "text": "I have been living here since August 16, 2019 and I find this is like my best place to reside and it’s a great place to live. I plan to be here for a long time.", "pics": null, "resp": null, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "103973485537537315420", "name": "Cynthia Lee", "time": 1541785818819, "rating": 1.0, "text": "BEWARE OF THIS PLACE!! My father lived here and do to health reasons needed to be transferred to a nursing home. We gave the notice to Brookdale and moved him out. Two months later they drafted 1640.00 from his bank account!!!! AFTER he was no longer a resident for two solid months!! Now they are refusing to give his money back and we can't afford to pay his nursing home for the month. They are shady and all about money. They are not honest and will take advantage once they have your bank account information. I recommend going somewhere else to a place that has integrity. BEWARE OF THIS PLACE!!!!", "pics": null, "resp": {"time": 1542231781083, "text": "Cynthia,\n\nWe are aware you have spoken to the executive director regarding this matter. Our district director of operations also left a message for you, and we encourage you to call her back if you wish to further discuss."}, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "106889816728629286135", "name": "Laron Hardy", "time": 1574281326361, "rating": 5.0, "text": "My mother has been at Brookdale Cedar Springs for almost a year, and we couldn't be happier.  I would highly recommend Cedar Springs.", "pics": null, "resp": null, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "116233651757463573141", "name": "Doug Tucker", "time": 1544677761719, "rating": 5.0, "text": "My mother in-law was a resident here. I visited many times. Nice place.", "pics": null, "resp": null, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "106732304407467933113", "name": "Lyman Holland", "time": 1613854838902, "rating": 1.0, "text": "Workers have not shown up two Saturdays in a row. No calls from company. I have called them, they promised me they would call back in 15 minutes. It has been 45 minutes and they have not called back. They will not answer their phone when I try to call them. My father is bed bound. Due to health issues I can’t change his diaper. Very frustrating I wouldn’t waste your time and money. They really don’t care! Last Saturday the excuse was snow and ice. This is Mobile we didn’t get any snow or ice.", "pics": null, "resp": null, "gmap_id": "0x889a4d1526c7e5cd:0x63f50e0167e05eb8"}
{"user_id": "111370876698018911290", "name": "Cota", "time": 1602867506998, "rating": 5.0, "text": "Great company with great service.  Would highly recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a4d1526c7e5cd:0x63f50e0167e05eb8"}
{"user_id": "106570938823520019133", "name": "William McHenry", "time": 1514520260003, "rating": 5.0, "text": "Very grateful for these people.", "pics": null, "resp": null, "gmap_id": "0x889a4d1526c7e5cd:0x63f50e0167e05eb8"}
{"user_id": "113294030849554782446", "name": "Breann Mellon", "time": 1620508608773, "rating": 5.0, "text": "Dr. Lydia is hands down the most amazing Veterinarian I have ever had the pleasure of meeting. Her kind, compassionate, and thorough home visit for our 15 year old Shepherd/Collie mix Molly during her final day was so peaceful and respectful. There was no better way to have said goodbye to our girl than in her favorite spot in our backyard with all our love surrounding her.\nThank you again Dr. Lydia, you are a beautiful soul!", "pics": null, "resp": {"time": 1620745233546, "text": "Oh Ms. Breann. Thank you so much for your kind words. I was honored to help your family, and glad that I was able to make it at least a little more bearable to say goodbye. Molly was obviously a very big part of your family, and you have my deepest condolences. I also hope you had a safe trip home."}, "gmap_id": "0x889a4f7c63ca3277:0x2407755604991426"}
{"user_id": "104795229128236730576", "name": "Lillian-Lotus Buccola", "time": 1617374318129, "rating": 5.0, "text": "Dr. Sullivan has a voice that can sooth even the most stressed human and animal.  Her entire level of professionalism and kindness was not only a welcomed factor, but one I have to say delivered a new wave of calm and love as we sent my service dog and best friend of 13 years on to the next realm.\nFrom explaining in depth from how the process works to how our baby would be handled with his cremation was relaxed and heartfelt.  We were given an imprint of his paw which will be kept on our bookcase with his picture everyday forward.  I cannot recommend Dr. Sullivan enough to anyone who has to unexpectedly [or expectedly] put their furbaby down.\nTruly. We thank Dr. Sullivan for her amazing work and the kindness she showed during the entire event.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNoxIfrpeIWMoHcx70_r5EBD0x7HhEEJNQhuQj5=w150-h150-k-no-p"]}], "resp": {"time": 1617648004572, "text": "Thank you so much Ms. Lotus. It was my honor and privilege to be a part of such a intimate and beautiful event, sorrowful though it was. I appreciate your kindness, and am heartened that I was able to help make it at least a little more bearable."}, "gmap_id": "0x889a4f7c63ca3277:0x2407755604991426"}
{"user_id": "105487503297174252631", "name": "Angeline Daigle", "time": 1600299174786, "rating": 5.0, "text": "It was a last minute request , but Dr. Sullivan was there for us on our darkest and saddest day. She not only kept Frankie calm but my husband and I as well. We are forever grateful for her service, professionalism, kindness  and compassion.  I highly recommend her.", "pics": null, "resp": {"time": 1600432690205, "text": "Thank you, Angela. While still a heartbreaking experience, I am glad I was able to help make it least a little more positive. It was obvious Frankie was truly a piece of your hearts, and his loss is immeasurable. I do hope in time you are able to find some comfort."}, "gmap_id": "0x889a4f7c63ca3277:0x2407755604991426"}
{"user_id": "112697919192558024590", "name": "Joshua Carter", "time": 1595005148624, "rating": 5.0, "text": "I just had our first visit from Lydia. She was very informative and gave me a lot to think about. It’s hard to make decisions about your loved one and someone like Lydia can add structure to the decision and help you come up with a plan. She can help make your dog feel better but also make you feel better. I wanted to have her come by and meet my 15-year-old English Springer spaniel ahead of the decision to have a goodbye visit.I highly recommend Dr. Lydia", "pics": null, "resp": {"time": 1595350703973, "text": "Thank you so much, Joshua. I really enjoyed meeting you and Ollie. I greatly appreciate you allowing me to assist you and Ollie during this very personal and sometimes uncertain time."}, "gmap_id": "0x889a4f7c63ca3277:0x2407755604991426"}
{"user_id": "111716072817681279006", "name": "nani nunu", "time": 1588998649841, "rating": 5.0, "text": "My wonderful older dog was failing and had multiple health Issues.  Dr. Lydia was open, knowledgeable, and compassionate.  We came up with an end of life plan that served us all.  From A-Z, Dr. Lydia was our Angel.  I highly recommend her.", "pics": null, "resp": {"time": 1589846005393, "text": "Thank you so much! It is truly my honor and privilege. I am deeply appreciative of your trust and faith in me during such an uncertain and difficult time."}, "gmap_id": "0x889a4f7c63ca3277:0x2407755604991426"}
{"user_id": "104652583956608193730", "name": "Brittany Pickens", "time": 1573428769114, "rating": 5.0, "text": "Dr. Lydia is incredible with my senior dog. She is warm, kind and SO thorough.  We are thankful for her help.", "pics": null, "resp": {"time": 1573530705099, "text": "Thank you so much, Brittany! It's my pleasure and my honor to work with you and your sweet baby!"}, "gmap_id": "0x889a4f7c63ca3277:0x2407755604991426"}
{"user_id": "104248126637153268070", "name": "Jeremy Patton", "time": 1508356233285, "rating": 5.0, "text": "Very well ran company.  Will treat you right in what is usually a tough time.", "pics": null, "resp": null, "gmap_id": "0x886265f5723aa417:0xc3fd7799b10e618b"}
{"user_id": "116747970366806884058", "name": "Glenda Holmes", "time": 1508010657590, "rating": 1.0, "text": "Slow servers  .spend over 45 min waiting for help putting someone in bed .turns off call light then leaves", "pics": null, "resp": null, "gmap_id": "0x88921e03d04bb585:0x662bc6996238d04"}
{"user_id": "110730022895683710594", "name": "Marsha", "time": 1619320276015, "rating": 1.0, "text": "I was an employee there. Run..do not walk from this place. If they don't like you for any reason they will blacklist you. I received very unfair treatment from the entire corporation. The administrator hides in her office all day and ignores what's taking place in the facility. No staff, residents not being changed all night   and CNAs that refuse to do their job, but that's ok. Do not put a loved one there if you care anything about them.", "pics": null, "resp": {"time": 1619699049123, "text": "I would like to get some more details about your experience with us. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "106155001013839517077", "name": "jimmy caradine", "time": 1622227243217, "rating": 1.0, "text": "My wife used to work here they treat their employees like second rate citizens and their residents even worse was the best day of my life when my wife (a CNA) quit after 5 years of miserable employment", "pics": null, "resp": {"time": 1622723573708, "text": "I would like to get some more details about your experience with us. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "103047225937755520180", "name": "Kelly Grimes", "time": 1615500895296, "rating": 1.0, "text": "Do not send loved ones here. Chronically understaffed. Patients are ignored. No assistance getting out of bed. 12 days no bath even for my Aunt that needed temporary care. She will likely have permanent health problems as a direct result of her care here", "pics": null, "resp": {"time": 1614168188600, "text": "We would like to address the situation you have described. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "108856367196992770443", "name": "Hali Baskin", "time": 1601235457609, "rating": 1.0, "text": "If I could post negative numbers on this review, I would. The staff here is inattentive and without any desire to care for your relative. My grandmother ultimately died due to lack of care at this facility. She was found passed out in her bed (thought to be dead) from seizures when she had pressed the buzzer.\n\nShe was given a buzzer to press for when she needed help. Often the buzzer would beep for over 30 minutes before someone got to her room. If you love someone, do not send them here. If you want your relative to die-this is the place!", "pics": null, "resp": {"time": 1601257716933, "text": "We would like to address the situation you have described. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "116836891626906348528", "name": "shan b", "time": 1606156328033, "rating": 1.0, "text": "My dad is currently a resident.  I really believe that the constant isolation from the constant lockdowns over the Covid-19 virus are contributing to the progression of dementia.  I’m sorry but this place is horrible and their management is beyond reproach. There are certain staff members that care, but as a whole they could care less about the well being of their residents.  Facility is mostly dingy and the smell usually wreaks of waste. I wish so much that I had a better option for the last days of his life. 😒", "pics": null, "resp": {"time": 1606655986578, "text": "Thank you for bringing this matter to our attention. We will use this as an opportunity to improve. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "100823483177462791653", "name": "MSH3 Hoff", "time": 1576976201601, "rating": 3.0, "text": "My father is a short-term resident here for post-operative rehabilitation services in their rehab center and while the staff is very friendly and for the most part attentive to his needs when he calls, they seem to have a major problem with their plumbing. The toilet in his bathroom stays clogged constantly and is full of feces and is not cleaned daily, as it should be. I myself have cleaned it twice and unclogged it once, but that was several days ago and it is clogged and in an absolutely disgusting condition. This is a health hazard, not to mention the stench of human waste. This is unacceptable and needs to be dealt with pronto.", "pics": null, "resp": {"time": 1577717087820, "text": "Thank you for taking the time to leave us feedback about your experience with us. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "115280977418623998777", "name": "Holly Fryar", "time": 1579474196539, "rating": 1.0, "text": "The facility is filthy. Building is old and in need of major renovation. Level of professionalism and organization is unacceptable. My dad was at Lakeshore for 20 days and was progressing after a stroke. He went to Magnolia for additional therapy and regressed. Would not recommend!", "pics": null, "resp": {"time": 1579529193334, "text": "I would like to get some more details about your experience with us. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "115676073525655490808", "name": "Julie Ritchey Miles", "time": 1566283341906, "rating": 3.0, "text": "I liked it but there is not enough gel for the patients there. The meals are not well planed. For diabetic and the patients wait a while . I think it could be cleaned but a very busy lace .I would do checks every hour and have more help.Good I would get a chef as much as they pay. Nice help matters .Some yes.", "pics": null, "resp": {"time": 1566307797802, "text": "Hello Julie Ritchey Miles, we appreciate you taking the time to leave us this feedback."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "107532281106470587621", "name": "Alyssa H", "time": 1558979168880, "rating": 1.0, "text": "Terrible place!  Do not let your family go here!  They do not change their clothes/sheets and will leave the patients sitting in urine all day long.  The therapy is a joke.  I cringe at the thought of what my loved one went through here because we thought it was a good facility.", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "102341606915896174033", "name": "Alethea Thomas Thomas", "time": 1537462268022, "rating": 5.0, "text": "I don't know why happy patients don't give reviews, but this is the best nursing home in Jefferson county. The staff is friendly, the place is clean today and the patients are happy. My mother is glowing with excitement. Thank you for doing a great job.", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "118187556843519478827", "name": "Stephanie Childers", "time": 1606768350145, "rating": 1.0, "text": "This place is a absolute disgrace.", "pics": null, "resp": {"time": 1606915649700, "text": "I would like to get some more details about your experience with us. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "108322651987158498558", "name": "Jeannie Cheatwood", "time": 1569353427795, "rating": 5.0, "text": "I haven't been working here long, but I absolutely love it!!! This is by far one of the best places I have worked!!!!!", "pics": null, "resp": {"time": 1569363028630, "text": "Hello Jeannie Cheatwood, thank you; we appreciate your feedback!"}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "101359773182912386989", "name": "Amanda Harless", "time": 1571530372800, "rating": 3.0, "text": "My grandmother has been here almost two years her clothes have been stolen and$100 dollars was stolen from me while I was cleaning my grandmother in the bathroom. The administrator Tom laughed at me when I reported it. He asked me if anyone in the facility could say that I had $100 in my wallet! Why would I tell anyone that. It’s been months since my last review. I love the nurses that take care of my granny, no mistakes about that. The clothes that were “lost” she has been reimbursed for. The $100 that was taken from my purse has never been resolved and probably never will be.", "pics": null, "resp": {"time": 1571579715926, "text": "Amanda Harless, thank you for your feedback."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "114091223975608073962", "name": "Wilbert Kelley", "time": 1569716699779, "rating": 1.0, "text": "The morning staff was excellent, but that evening shift was rude, and didnt seem to care. I had problems with a nurse name Ed or Eddie, and a Tammy. They were very unprofessional.", "pics": null, "resp": {"time": 1569762327348, "text": "Thank you for taking the time to let us know about your recent experience. We are disappointed to hear that you are not satisfied with your visit. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "117378815586547605264", "name": "Amiah Morgan", "time": 1569003665096, "rating": 1.0, "text": "The morning shift is wonderful, but the evening shift with Tammy Wilcox is just lazy and Just Have nasty attitudes. This facilities is very outdated, just need renovated", "pics": null, "resp": {"time": 1569875760803, "text": "I would like to get some more details about your experience with us. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "103039976318859264374", "name": "Shelly Sutherland", "time": 1508262134336, "rating": 4.0, "text": "My godmother is there her name is Bonnie Moore and she is very pleased with this nursing home and the staff is wonderful and she's starting rehabilitation and they have been amazing. Thanks to all staff and nurses for your kindness.", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "117605915137919942132", "name": "Michelle Johnson", "time": 1503375124707, "rating": 1.0, "text": "Horrible facility......my mother nearly died from lack of medical care from the nursing staff. I filed a report with the state and filed a police report naming two nurses from that facility.\nIf you love your family member- do not put them there.", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "100313739578693862022", "name": "Jennifer Russell", "time": 1534957934114, "rating": 1.0, "text": "Supposed to had been in rehab to get stronger and wound care. Negative wound is worst . Never got sleep, always had an old drink by his bed. They never would let me look at his wound. On top.of didn't give him all his correct meds.....", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "114223814775376485994", "name": "Nicole Morgan", "time": 1569075568690, "rating": 1.0, "text": "The morning staff is excellent, when it comes to the night shift, they are sorry with nasty attitudes. I hope if your family comes here, you never have Eddie or a woman name Tammy.", "pics": null, "resp": {"time": 1569278578229, "text": "I would like to get some more details about your experience with us. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "101971699341796154328", "name": "Danielle Bourque", "time": 1496801517823, "rating": 1.0, "text": "Horrible place! The night shift more than the day shift, my mother in law is staying due to a broke hip, I went to ask some of the staff members a question and it was like it pained them to get off their cellphones and give me eye contact and smile, one never even turned around and keep her back toward me. It breaks my heart to see how badly the residents are treated and how run down and disgusting the facility is.", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "102245494479718607453", "name": "O. Shanta", "time": 1507046731878, "rating": 1.0, "text": "I chose this place for my mom because the pictures looked pretty and cleaned, plus the offered rehabilitation. My lack of knowledge caused my mother a lot of neglect and humiliation. There is a ton I could say but I’m going to narrow it down to four:\n1. My mom called me one day around 730pm and stated she had been calling for someone to come change her diaper since 3:30pm.\n2. My mom suffers from CHF and needs a low sodium diet. Whatever she would chose from her REGULAR menu to eat, the kitchen would send her whatever they wanted her to have. Usually something processed and high in salt. Now my mother retains fluid very badly.\n3. After seeing other areas of neglect, I researched better facilities and put in to transfer my mother. I put the request in, in person on a Thursday morning. I came back Friday afternoon and it had not been send. I checked on it Monday evening it was finally sent. Then there was the transportation issue, the family pays, WHAT no one told me. Well Magnolia social services didn’t help me, nor did they offer guidance or contact numbers. So I called the transfer NEW facility and admissions said “we will take care of this for you and we will get you the lowest price possible, we will try to make this transition smooth”. About 15 Min later I was set with transportation.\n4. They are always short staff, once my mother had a very bad case of heart burn. She pushed her button for help, a hour later mom called me and I called the nurses  desk. The supervisor came, took her BP, said she will be back with some tums. An hour later Mom pushed the button. No one came. She called me, I called the desk, the new shift nurse said the supervisor WENT HOME! So I got dress and went to the store and drove from the South side to Gardendale to take mom some heartburn meds.\n\nWhen you enter Magnolia Ridge the smell of OLD urine and bowels will meet you at the door and it lingers in the hallways. Whenever I leave the building that smell is stuck to my clothes.\n\nIf you put your love ones in this facility “YOU BETTA CHECK ON THEM DAILY”", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "110792846252800472606", "name": "Dick Brown", "time": 1491590512353, "rating": 4.0, "text": "Did a good job for my brother-in-law.", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "114578353128762266815", "name": "Sharon Teer", "time": 1560775747970, "rating": 1.0, "text": "DON'T, just don't!  For elderly care or rehabilitation!", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "116384818994464040034", "name": "Lajuan Earl", "time": 1474376880261, "rating": 1.0, "text": "Disgusting! Would not recommend needs to be close down does not take care of patients and do not take to the doctor when needed", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "111330106677486073170", "name": "papa Millwood", "time": 1482536912826, "rating": 2.0, "text": "My MawMaw there and I don't think it's good for a dog but my granny want leave", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "111969034020268513267", "name": "Doreen Williams", "time": 1441110627155, "rating": 5.0, "text": "Great  place to work", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "102156627289574871198", "name": "Andrea Pitts", "time": 1612977322489, "rating": 5.0, "text": "I am so happy to be a part of this wonderful and compassionate team!", "pics": null, "resp": null, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "109506143782258256705", "name": "Pamela Wade", "time": 1590258061588, "rating": 5.0, "text": "This company and the wonderful people that work there made such a difference in our lives.  Without Laura, Anita, Jackie and Deb I couldn't have taken such good care of my son-n-law.  His last days were spent with the ones that loved him most.  ExpectCare made that possible. They're  definitely  5 star in my opinion! ❤", "pics": null, "resp": null, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "110620539195023731140", "name": "Beth Tidwell", "time": 1593514455005, "rating": 2.0, "text": "Staff is friendly. But my family came home using them. He had had pneumonia, didn't set up oxygen, did show how to use or set it. Didn't show how to use nebulizer. We were told they'd be out daily when he was sent home. Lucky if you can get them out once a week. Find a better more organized place of you care for your loved ones. I don't know which family member they paid to put the 5 star review.", "pics": null, "resp": null, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "110978785229686445716", "name": "Tim Hayes", "time": 1593831867977, "rating": 5.0, "text": "Wonderful and caring people that took care of my mother in her last couple of months of life. Would highly recommend this company for anyone seeking care for their loved one.", "pics": null, "resp": null, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "107734830357919424584", "name": "dest j", "time": 1600911326807, "rating": 5.0, "text": "Incredible staff!!! ❤️ Love this company!", "pics": null, "resp": null, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "100815586768459556764", "name": "Melissa McCombs", "time": 1573143979391, "rating": 5.0, "text": "Wonderful Christian Organization! So blessed to be a part of a team with mission-minded focus who go above and beyond in providing patient care.", "pics": null, "resp": null, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "104556093762452166717", "name": "Jeff Ross", "time": 1581714308786, "rating": 1.0, "text": "ExpectCare's inability to properly bill Medicaid has resulted in my inability to close out Mom's estate.  Mom passed in July 2019 and still, in Feb 2020, we are waiting on them to properly bill Medicaid.  Extremely frustrating - has compounded the grief of Mom's passing.", "pics": null, "resp": {"time": 1586792028139, "text": "Jeff,\nI am so sorry that this happened. I am the new Partner/Executive Director for our Hospice service line at ExpectCare. I wanted to let you know that we have heard from Medicaid, however,  and were told that there was no problem on our part. If this has not been resolved, please call me directly, 205-790-0065 if I can be of assistance. Continued prayers for your family!"}, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "113936985839512553761", "name": "Laura Lee", "time": 1524511806056, "rating": 5.0, "text": "The leadership team of Expect Care are on a mission to change how elderly people are cared for.  They welcomed my aunt and I during a difficult time and spent hours getting to know our needs.  They helped me through each decision keeping our financial situation in mind.  I am grateful for having this organization in my corner!", "pics": null, "resp": null, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "117308735987020343457", "name": "Mike Osborn", "time": 1521037506477, "rating": 5.0, "text": "It is indeed a true joy to work with such caring people in our Mission based Hospice. Our commitment concentrates totally on the care of the patient and their family. We look forward to caring for your loved one and spreading the good works of ExpectCare.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMlu3MYMJwNEkTEqtcwK2lOtrcPqlT5FxWrmKe_=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "112404592040666698699", "name": "Kywanniee Stuckey", "time": 1521436266075, "rating": 5.0, "text": "Expectcare is a growing company that is truly committed to providing the best overall care to patients and families first. It’s evident that the team strives for the mission of doing God’s work. The clinical team not only have the skills to provide quality care, but also the compassionate spirit that is needed to provide adequate and total care physically and spiritually. The team is an absolute pleasure to work with. Leadership is committed to serving in every way possible.", "pics": null, "resp": null, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "102091692253483770238", "name": "Benjamin Keaten", "time": 1547647835732, "rating": 5.0, "text": "Great company! They have a great people that work for the company and wonderful management. They have a great future with a wonderful christian mission in mind.", "pics": null, "resp": null, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "102454974865003766398", "name": "Melissa Waugh", "time": 1579062793348, "rating": 1.0, "text": "Do yourself a favor and keep looking. This company lacks compassion and knowledge to care for those in their final days on this earth. I was shocked by some of their suggestions and responses to calls for help. This company should be shut down in my opinion.", "pics": null, "resp": {"time": 1586886598514, "text": "Melissa,\n\nI apologize that you feel this way as we pride ourselves in our mission to provide compassionate care at end of life. We value your feedback and would like more information to help improve our quality care. I am the new Partner/Executive Director for the Hospice service line and I would like to speak with you about your experience. Would you call me please at 205-790-0065?"}, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "107226174688525479197", "name": "ricdady77 Stewart", "time": 1521031151818, "rating": 5.0, "text": "Professional Staff and Management, pleasure to work with them. Truly focused on patients and families. Christian based leadership with higher cause and ministry.  Organization always striving for high quality patient care.", "pics": null, "resp": null, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "112980588391609638763", "name": "Lance Lee", "time": 1521403969502, "rating": 5.0, "text": "Caring staff and volunteers who are committed to serving the Lord and ministering to patients and caregivers through hospice and in-home care services.  Each person goes above and beyond giving personalized attention toward each need.", "pics": null, "resp": null, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "117176715105116752020", "name": "Constance Moore", "time": 1555978602205, "rating": 1.0, "text": "This is the worst home health care agency I have ever worked for they don't pay you for all hours worked they give you the run around about money they owe you! the hours were supposed to be unlimited but that was a lie and leta Parsons is a fraud have you taking care of 2ppl and paying you for one when there getting paid for both I had a feeling not trust them because of the unprofessionalism from the start.", "pics": null, "resp": {"time": 1586886805882, "text": "Constance,\nThank you for your review and we value your feedback but this google site is for the \"Hospice\" service line. I apologize that you had a negative experience working as an employee with the sitter company but as the new Partner/Executive Director for the Hospice side, I will ask that this review be removed from this site. If you have any questions, you can call me directly at 205-790-0065."}, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "110798787825127060722", "name": "Ron Pinkerton", "time": 1523377307135, "rating": 5.0, "text": "Recent comment from family member:  \"extremely pleased with the care given to my loved one...will be glad to recommend Expectcare to those I know\" , April 2018", "pics": null, "resp": null, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "103274311118277010524", "name": "William Powell", "time": 1521076794164, "rating": 5.0, "text": "Excellent company. Christ-centered care. Good people.", "pics": null, "resp": null, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "100797197793850253161", "name": "Trey Horton", "time": 1509595568271, "rating": 1.0, "text": "I've been around Hospice and home health for 17 years. This is by far the worse run company I've seen.  Understaffed because they are overworked. Rude management to their employees and patients. Horrible company! BEWARE!", "pics": null, "resp": {"time": 1586887900741, "text": "Trey,\n\nThank you for your review as we value your feedback. I am the new Partner/Executive Director for ExpectCare Hospice and would like more information regarding your experience to improve our customer service. Please feel free to send me a message or call me directly at 205-790-0065."}, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "109935002862566923780", "name": "Dawn Smith", "time": 1521075024320, "rating": 5.0, "text": "Excellent company with caring and compassionate staff. They go the extra mile.", "pics": null, "resp": null, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "110708648270486346952", "name": "Min Lameya Kimbrough Huffman", "time": 1484438111616, "rating": 5.0, "text": "Very nice people that own/work for this company.", "pics": null, "resp": null, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "104649352453179957145", "name": "kea p", "time": 1540750790028, "rating": 1.0, "text": "Very unprofessional I would give no stars but I can't. Employers are disrespectful they under pay employees and don't care about them or there will being. They send different caregiver to clients home everyday. And will take any case as long as it's money involved even of it's endangering to the employees. No over time pay, and they want you to travel to a clients home that's more than 30 minutes away for only 5 hrs a day.", "pics": null, "resp": {"time": 1586887080023, "text": "Kea,\n\nThank you for your review and we value your feedback but this google site is for the \"Hospice\" service line. I apologize that you had a negative experience working with the sitter company but as the new Partner/Executive Director for the Hospice side, I will ask that this review be removed from this site. If you have any questions, you can call me directly at 205-790-0065."}, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "117426128003707312830", "name": "jaiyahc789", "time": 1508183993227, "rating": 1.0, "text": "Horrible! Horrible staff, disrespectful and prejudice! Find another care service", "pics": null, "resp": null, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "116745807901248217302", "name": "Mikindra Fowlkes", "time": 1554485412170, "rating": 1.0, "text": "Definitely a garbage place to work for", "pics": null, "resp": {"time": 1586887463353, "text": "Ms. Fowlkes,\n\nAgain, thank you for your review but this google site is for the \"Hospice\" service line. I apologize that you had a negative experience working as an employee with the sitter company but as the new Partner/Executive Director for the Hospice side, I will ask that this review be removed from this site. If you have any questions, you can call me directly at 205-790-0065."}, "gmap_id": "0x88891b3f7b6c8d81:0x80c51b59acde7196"}
{"user_id": "115445645137246527741", "name": "Andrea Benes", "time": 1569105357371, "rating": 5.0, "text": "Amazing company and staff.  They truely care and go the extra mile.", "pics": null, "resp": null, "gmap_id": "0x888922c04b40a471:0xafec576299d87a5c"}
{"user_id": "109664649145193557880", "name": "Tim Hatchett", "time": 1350613965929, "rating": 5.0, "text": "Words cannot express the valuable and professional services provided to my family during this time of need. I will not attempt to single out any on individual, because all the caregivers were dedicated, courteous, and professional, and performed their duties with diligence, patience, sincerity, and perseverance. I highly recommend the Hospice Services of Alabama staff to anyone in need of hospice care.", "pics": null, "resp": null, "gmap_id": "0x888922c04b40a471:0xafec576299d87a5c"}
{"user_id": "109597428741632184143", "name": "Mark McMillan", "time": 1527096175480, "rating": 5.0, "text": "Although we only used them for a few days before mom passed, they were great and professional in every way.  Would recommend them without hesitation.", "pics": null, "resp": null, "gmap_id": "0x888922c04b40a471:0xafec576299d87a5c"}
{"user_id": "100797197793850253161", "name": "Trey Horton", "time": 1426695099846, "rating": 1.0, "text": "My family's experience was far from great. The lied. They told us the were good Christians and they never did anything they said they would. They caused my family great discomfort. So not so good Christians..  I can't believe they are in business with such bad leadership. I DO NOT RECOMMEND ANYONE TO THIS COMPANY!", "pics": null, "resp": null, "gmap_id": "0x888922c04b40a471:0xafec576299d87a5c"}
{"user_id": "100845360677973159976", "name": "pete herman", "time": 1535408045852, "rating": 1.0, "text": "Please do not use Homestead hospice out of Selma, Alabama. They came into my parents home and had a real good sales pitch. No one has contacted my family since my father has passed. The only person that seemed to have any care for my father was the nurse aide. She was wonderful. They sold us on a bunch of non truths. When he passed I contacted them as requested only to find out that it would be 2.5 hours before someone could be there. Who would want to sit with a loved one there that long. They then got mad because we contacted police and fire departments to assist us. Then to top everything they refused to sign the death certificate and only let us know that after 2 weeks when we had to contact them. Please reconsider another hospice for your loved one.", "pics": null, "resp": null, "gmap_id": "0x888f067f924460e3:0x314c41934e91f92d"}
{"user_id": "109904625313878925390", "name": "Linda Lambert", "time": 1568819523069, "rating": 5.0, "text": "Hospice of North Alabama, in Huntsville was called on for the care of my mother who had Alzheimer. My mother was bedridden for 5 months, and Hospice of North Alabama was there to help ease us through those final months of her life. The sensitivity of Hospice's employees were evident at every visit. Their willingness to be available and to explain what was going on at each phase of her illness was a huge help and provided much comfort and peace of mind. I wish to thank those at Hospice for their efforts, caring support and assistance. Their dedication and professionalism displayed in the care of my mother will forever be remembered and greatly appreciated.", "pics": null, "resp": null, "gmap_id": "0x88626df98dbaaf6f:0x6611e039b810a857"}
{"user_id": "113805942913574970707", "name": "Bonnie Brooks", "time": 1569358382859, "rating": 5.0, "text": "In the past few months my family & I have had the opportunity to receive specialized home health care. We have been greatly Blessed with exceptional staff who are knowledgeable in this field. The staff has been very responsive to all our needs and have been extremely personable.  I highly recommend this company to all who read my review.\n\nThank you,\n\nBonnie Brooks", "pics": null, "resp": null, "gmap_id": "0x88626df98dbaaf6f:0x6611e039b810a857"}
{"user_id": "100760071549884825824", "name": "Kelly McNutt", "time": 1569280953086, "rating": 5.0, "text": "My Dad was a patient in 2015. He had great nurses Shaun and Julie who took excellent care of his nursing needs. Ben was his HA (Bath aid) whom Dad thought the world of. Dad enjoyed his chaplain visits from Bro.Charles who  provided him with great spiritual  blessings and later preached his funeral . Even though I work in hospice, its so different when its your own family member on hospice service. The support given to me and my family   was overwhelming and greatly appreciated.", "pics": null, "resp": null, "gmap_id": "0x88626df98dbaaf6f:0x6611e039b810a857"}
{"user_id": "117860651463078900465", "name": "Maureen Sylvester", "time": 1570753946784, "rating": 5.0, "text": "Words cannot express how grateful and thankful I am that Jake and Rene are assigned to my husband, Leon, during this very trying time. They are the most compassionate and caring professionals. They go above and beyond their call of duty to make sure his every need is met and he is made comfortable. They are at the top of my list for Hospice Care!!", "pics": null, "resp": null, "gmap_id": "0x88626df98dbaaf6f:0x6611e039b810a857"}
{"user_id": "117625427675603822080", "name": "Dawn Bragg", "time": 1569079328161, "rating": 5.0, "text": "My father has been with Hospice of North Alabama for almost two months now. They have been a blessing to my family. They are prompt, professional, and caring. The level of care is outstanding and my father actually looks forward to seeing them every day. Jake and Renee have gone above and beyond making my Dad feel comfortable.", "pics": null, "resp": null, "gmap_id": "0x88626df98dbaaf6f:0x6611e039b810a857"}
{"user_id": "116505781547688715559", "name": "jimmy sears", "time": 1569796820375, "rating": 5.0, "text": "My mother was under hospice care for several months. they were so helpful and kind. she had to have a lot of meds and Dr, Greg Cheatham  and her nurse had no problem keeping her comfortable.. The nurses an the ladies giving the baths were so kind and made my mother feel so comfortable and calm. they treated my mom just like family. They kept the caregivers informed on everything and took the time to listen to us. i would recommend this hospice family to anyone going through this time. Just love them all. i call them my family and so thankful for all of their help.", "pics": null, "resp": null, "gmap_id": "0x88626df98dbaaf6f:0x6611e039b810a857"}
{"user_id": "104224982136157980246", "name": "Melody Kendall", "time": 1570591561436, "rating": 1.0, "text": "I do not recommend Hospice of North Alabama. The total experience we had was devastating to our family!!! You’re welcome to contact me and I can share our experience.", "pics": null, "resp": {"time": 1571089847552, "text": "Thank you for your review. We are sorry that you had a negative experience. End of life is a very difficult time, and we sympathize with the devastation and heartache of the loss of a loved one. Please call our office to speak to our Clinical Administrator. She can also connect you with our Senior Vice President of Operations to address your concerns."}, "gmap_id": "0x88626df98dbaaf6f:0x6611e039b810a857"}
