{"user_id": "102786413455361026301", "name": "cara vaughan", "time": 1622157042570, "rating": 1.0, "text": "Last year I called them to do an education summary. The company that built my pool is now out of business, go figure. They quoted me one price on phone then after he came and instructed us on pool maintenance I received a bill for another $135.\nThis year I called for pump repair/replacement. We were quoted one price that was to include new salt cell and replumb so we could maintain salt cell.\nThe tech that came out said “oh, I don’t know anything about salt cells I’m just here to replace pump.”  I was not hone my son was there and did not know the whole agreement.\nWhen my daughter in law called back to discuss she was told no the quote was for pump replacement only. If we had repaired pump it would have included the salt cell.\nThis is totally unacceptable.\nI will not use them again!!", "pics": null, "resp": null, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "104907493161419427807", "name": "Jeremy Elkourie", "time": 1621908559426, "rating": 5.0, "text": "I previously used another service that was so frustrating I did not know what to expect from Shoemaker pools.  I was surprised at how responsive they were returning their calls within 48 hours.  They were able to resolve an issue in less than a month that the previous company couldn't resolve in a year.  They treated me more like a friend than a random customer.  I have called them every year to open and maintain my pool for the last 3 years and have yet to be disappointed.  I highly recommend giving them a call for whatever your pool needs may be.", "pics": null, "resp": null, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "102862903885572430267", "name": "Kalmisha Carter", "time": 1621293962295, "rating": 5.0, "text": "Awesome Service! Great Quality Products. Owner is a great guy to do business with.", "pics": null, "resp": null, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "109421680609307307869", "name": "Elizabeth Jackson", "time": 1608429908925, "rating": 5.0, "text": "If you are looking for a new pool service company Shoemaker should be first on your list. From my first contact Landon and his team have been incredibly responsive. They do what they say they they are going to do every single time. My service professional is David and he is caring and considerate. He does beautiful work and always goes over and above what is expected. For reference I have a pool, hot tub and fountain. They have never looked better!", "pics": null, "resp": null, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "104199122910579571381", "name": "Carol Brooker", "time": 1608060318110, "rating": 5.0, "text": "We have always used Shoemaker pools for years. Starting with Mike the owner over the years they have provided us with excellent service. Only one call to ask for extra service if we have a storm or if we are having a special event and it is take  care of. You could not ask for a better pool service. Now Landon is helping us but I suspect Mike is still around. This is truly a wonderful family business providing excellent service.\n\nCarol Brooker and Stan Faulkner", "pics": null, "resp": {"time": 1608320405985, "text": "It’s been a pleasure to work and continue working with you and Stan! Thanks for taking the time to give us a review."}, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "100289857737343284961", "name": "Jeff Smith", "time": 1608047557459, "rating": 5.0, "text": "We’ve used Shoemaker pool’s for 5 years. They do excellent work. We don’t have to think about our pool. Their guys are very knowledgeable. Always on time. What little interaction I’ve had with corporate has been very positive.", "pics": null, "resp": {"time": 1608050742558, "text": "Thank you for taking the time to leave us this amazing review!"}, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "107013373112412292202", "name": "Dean Thornton", "time": 1608052423777, "rating": 5.0, "text": "Shoemaker Pool Service has been a reliable company for our pool maintenance for several years now. They take care of everything we need including any repairs. Every week, they send us an email confirming they have completed our service including a photo of our nice, clean pool.", "pics": null, "resp": {"time": 1608054464424, "text": "We are thrilled that you enjoy the weekly service emails of your pool. Thank you for the review!"}, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "102199188715175538257", "name": "C Michelle Harris", "time": 1623670643833, "rating": 1.0, "text": "Never heard back from them. So I don't know", "pics": null, "resp": null, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "101937006619211029336", "name": "Mr. PNUT", "time": 1583162395793, "rating": 5.0, "text": "Excellent, knowledgeable and friendly staff.\nGreat showroom!", "pics": null, "resp": {"time": 1569504994175, "text": "Thank you!"}, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "110493877804612685559", "name": "Lynn Souissi", "time": 1551537822280, "rating": 5.0, "text": "Experienced staff and super friendly.  They've been around for a long time and their  knowledge is unsurpassed. I wouldn't use anyone else", "pics": null, "resp": null, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "116329482656602134621", "name": "justin maddux", "time": 1523372754045, "rating": 5.0, "text": "I had the pleasure of meeting  Nicole today, she was super friendly. I strongly recommend shoemaker pools!!!!", "pics": null, "resp": null, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "106086262103082141782", "name": "TG Fxte", "time": 1555095727353, "rating": 1.0, "text": "Terrible customer service and very rude staff. Was told wrong chemicals to put in my pool.", "pics": null, "resp": {"time": 1555159481564, "text": "I am sorry to hear about your experience . Please email me to discuss your experience so we can make sure that we can improve in the future. scott.fuller@shoemakerpools.com .\nThanks for your feedback."}, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "100688060459065612599", "name": "Rudy Howard", "time": 1605187112592, "rating": 5.0, "text": "clean and professional", "pics": null, "resp": null, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "104221693756549383338", "name": "Billy Cooper", "time": 1561065328530, "rating": 1.0, "text": "Never got back with", "pics": null, "resp": {"time": 1561068464533, "text": "I'm sorry for your  experience. Did you speak to a representative from our company to leave a message?  Did you come into our store?  I would like your feedback so we can improve in the future."}, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "103520693613177132330", "name": "Pure Bliss", "time": 1568465029219, "rating": 4.0, "text": "Service was awesome", "pics": null, "resp": {"time": 1568466299088, "text": "Thanks for your review. What can we do in the future to get 5 Stars?"}, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "108102753850718109323", "name": "David Mauricio", "time": 1531698000656, "rating": 5.0, "text": "God pool  company", "pics": null, "resp": null, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
