{"user_id": "102489038693307778410", "name": "shaun williamns", "time": 1615722902299, "rating": 5.0, "text": "Awesome community and the people are super nice.", "pics": null, "resp": null, "gmap_id": "0x888ccf613d94bf21:0xd924f6af9b2da890"}
{"user_id": "105637596405850075359", "name": "Roger Jackson", "time": 1620140667134, "rating": 5.0, "text": "A nice quiet place to live. The owners try to stay aware of what's needed in this mobile home park. They are strict but also friendly.", "pics": null, "resp": null, "gmap_id": "0x889bac4019ac3015:0x705252cc87f4c4d1"}
{"user_id": "115930788583027559774", "name": "Queen Carter", "time": 1506017326010, "rating": 5.0, "text": "owners are great, everyone mostly stays to themselves but are friendly. We take our toddler and his bff/gf on walks through all the time. Lived here 2yrs and the rent is decent for the amount of space. You pay for a 3bd 2 Bath  with a yard and small fixes for what you pay a 2 bd 1 bath  aprt. Just keep your yard up. Pets allowed for a fee", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNsXehEMgevaJTpaPfG8qSBr4eDKgBvbbCVIEsZ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bac4019ac3015:0x705252cc87f4c4d1"}
{"user_id": "112389154386461720886", "name": "Tanya Falls Mouser", "time": 1610560012389, "rating": 5.0, "text": "Its a very nice mobile home park with tiny homes also they rent .very clean very family friendly  nice place and the owners are really good people", "pics": null, "resp": null, "gmap_id": "0x889bac4019ac3015:0x705252cc87f4c4d1"}
{"user_id": "107346070818819761424", "name": "Pam Samford", "time": 1583268793549, "rating": 5.0, "text": "Great place to live", "pics": null, "resp": null, "gmap_id": "0x889bac4019ac3015:0x705252cc87f4c4d1"}
{"user_id": "101124562384992030954", "name": "sherry hardin", "time": 1546269002095, "rating": 4.0, "text": "A secret little country mobile home community hidden away like a perfect Lil gem, right in.the heart of Semmes. Extremely quiet & the grounds are kept up and remain very clean. A very strong sense of feeling safe and secure, is a big plus!😉", "pics": null, "resp": null, "gmap_id": "0x889bac4019ac3015:0x705252cc87f4c4d1"}
{"user_id": "107348311279449522528", "name": "Jessie Mobley Jr", "time": 1484436439825, "rating": 5.0, "text": "They are very efficient at repairs. They keep it clean and quiet. Great place for a family. Cheap rent with nice manufactured homes. The owners are always nice and leave you be and let you do your own thing.", "pics": null, "resp": null, "gmap_id": "0x889bac4019ac3015:0x705252cc87f4c4d1"}
{"user_id": "107582387254293710042", "name": "Jamie Ivey", "time": 1468799568618, "rating": 4.0, "text": "It is the cleanest trailer park Ive ever lived in and People here know how to mind there own business and you don't have to worry about your family👪", "pics": null, "resp": null, "gmap_id": "0x889bac4019ac3015:0x705252cc87f4c4d1"}
{"user_id": "102985542569491518724", "name": "jessey johnson", "time": 1390848281566, "rating": 5.0, "text": "This is the cleanest trailer park I have ever seen. Great location and great prices", "pics": null, "resp": null, "gmap_id": "0x889bac4019ac3015:0x705252cc87f4c4d1"}
{"user_id": "113015136935728300553", "name": "Scrapman", "time": 1504833045465, "rating": 5.0, "text": "Very clean, quiet and under great management.", "pics": null, "resp": null, "gmap_id": "0x889bac4019ac3015:0x705252cc87f4c4d1"}
{"user_id": "103924947068267295640", "name": "Michelle Clifton", "time": 1572523640144, "rating": 5.0, "text": "Very nice!!! And quiet!!!", "pics": null, "resp": null, "gmap_id": "0x889bac4019ac3015:0x705252cc87f4c4d1"}
{"user_id": "109118116839621898161", "name": "frances smith", "time": 1527590060932, "rating": 2.0, "text": "Really nice park, clean , great folks", "pics": null, "resp": null, "gmap_id": "0x889bac4019ac3015:0x705252cc87f4c4d1"}
{"user_id": "109711017509803125910", "name": "Storm Adams", "time": 1530112273843, "rating": 2.0, "text": "Nope", "pics": null, "resp": null, "gmap_id": "0x889bac4019ac3015:0x705252cc87f4c4d1"}
{"user_id": "115482212534389928686", "name": "william smith", "time": 1526746087203, "rating": 1.0, "text": "Its a trailer park!", "pics": null, "resp": null, "gmap_id": "0x889bac4019ac3015:0x705252cc87f4c4d1"}
{"user_id": "118170085313907967844", "name": "Ann Croom", "time": 1538666589174, "rating": 5.0, "text": "Beautiful place", "pics": null, "resp": null, "gmap_id": "0x889bac4019ac3015:0x705252cc87f4c4d1"}
{"user_id": "104343322407975601358", "name": "Sean Steelreath", "time": 1520209092194, "rating": 5.0, "text": "What a place to be", "pics": null, "resp": null, "gmap_id": "0x889bac4019ac3015:0x705252cc87f4c4d1"}
{"user_id": "111796066740316839669", "name": "Daryl Green (Der-der)", "time": 1470725831983, "rating": 5.0, "text": "One Call Rv Services", "pics": null, "resp": null, "gmap_id": "0x889bac4019ac3015:0x705252cc87f4c4d1"}
{"user_id": "112619433399366223090", "name": "Devin Wallner", "time": 1444458588273, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x889bac4019ac3015:0x705252cc87f4c4d1"}
{"user_id": "112029187253593613773", "name": "Chelle Ham", "time": 1558013026020, "rating": 5.0, "text": "My husband and I have been living at the cottages for nearly a year already. We can honestly say that we have really been enjoying our time here. We have one dog and the dog park is a great size for her. Much larger than other dog parks I've used in neighborhood settings. The cottage itself is nice. I love the floors and high ceilings. We are the first to live in our cottage which is so great as a renter. The pool is great. Lots of space to lounge as well. I wish the gym had a better variety of equipment. There are two duplicate machines. I wish there were garage units available for rent and an outdoor kitchen space like advertised on the website. My husband is in the military and this neighborhood is within driving distance to Fort Rucker. It is worth the commute if you want to live in a nice area.", "pics": null, "resp": {"time": 1558038004298, "text": "Thank you so much for your comments.  Feedback helps us see ourselves as others do.  It is our pleasure having you as residents...and that includes your fur baby!"}, "gmap_id": "0x88928c30e5419bd3:0x5210f3527da77f07"}
{"user_id": "111982576863457304128", "name": "Boe Irwin", "time": 1623852616169, "rating": 3.0, "text": "Small houses", "pics": null, "resp": null, "gmap_id": "0x88928c30e5419bd3:0x5210f3527da77f07"}
{"user_id": "110341692884196812189", "name": "Samantha Hilton", "time": 1552923224217, "rating": 5.0, "text": "Beautiful cottages and neighborhood, well landscaped. Jan Mashburn is very sweet, knowledgeable and professional.", "pics": null, "resp": null, "gmap_id": "0x88928c30e5419bd3:0x5210f3527da77f07"}
{"user_id": "104813864558355085932", "name": "Monique Anderson", "time": 1581837593508, "rating": 2.0, "text": "Far to expensive for the small space they provide..", "pics": null, "resp": null, "gmap_id": "0x88928c30e5419bd3:0x5210f3527da77f07"}
{"user_id": "107758928361792805596", "name": "Beth Curry", "time": 1572111042653, "rating": 5.0, "text": "So cute and quiet!", "pics": null, "resp": {"time": 1579715217878, "text": "Yes it is!"}, "gmap_id": "0x88928c30e5419bd3:0x5210f3527da77f07"}
{"user_id": "112129994710641689115", "name": "Harold Street", "time": 1551916643953, "rating": 5.0, "text": "Friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88928c30e5419bd3:0x5210f3527da77f07"}
{"user_id": "103664357549830664019", "name": "T MK", "time": 1560685985933, "rating": 5.0, "text": "Super Cute!", "pics": null, "resp": {"time": 1560782631388, "text": "Thank you so much; we think so, too!"}, "gmap_id": "0x88928c30e5419bd3:0x5210f3527da77f07"}
{"user_id": "101682714112719279625", "name": "Brian Jackson", "time": 1619192338745, "rating": 2.0, "text": "Well the property manager was cool but whom ever the owner of the property is needs to be more open minded when it comes to an eviction. I went in to try and rent to own a home. An eviction was on my record but they never even allowed me to explain that I was in an owner financing agreement but the owner changed the contract out of her name behind my back and when I asked her to please bring me the new paperwork with the new name so it wouldn't be illegal for me to live in the property, she took her family and moved to Georgia and I and was never heard from again so I moved. They need to listen. This lady hired a management firm and did an eviction and I was left homeless.", "pics": null, "resp": {"time": 1619193460623, "text": "Unfortunately we don’t accept evictions."}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "112970030942152292806", "name": "Katie Jo Gossett", "time": 1614273343665, "rating": 4.0, "text": "I moved in January 2021. Since then I have had to request some maintenance work. Overall they have exceeded my expectations as far as work done and result. I can see how this place is trying really hard to change the park and bring about some new standards. The neighborhood seems quiet. No late night craziness. I can't think of another trailer park that offers standards like yard maintenance, cerfews, and down to earth staff.", "pics": null, "resp": null, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "118275267123449826768", "name": "SJAL Music", "time": 1619645895476, "rating": 4.0, "text": "I'm trying to get in contact with someone about getting into a place but no one has gotten back to me .  If you guys have any available please let me know I left a voice mail.", "pics": null, "resp": null, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "114543930097688740438", "name": "Kitty Jo", "time": 1601080165914, "rating": 1.0, "text": "If I could give zero stars I would have. Terrible management and the trailer I rented had something breaking every week. The only good thing about the park was my neighbors.", "pics": null, "resp": null, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "102195481575726024013", "name": "Ryan Kirk", "time": 1519623889716, "rating": 5.0, "text": "From zero to hero! Good things are happening at this park! New ownership & management care about this park, it’s homes, the people and making sure it’s the most affordable, lowest priced and best value housing in the greater Montgomery area! 😁👌", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMKpvyEslx2UjP-krETtkgSZpUQBjEFs2oXDlQO=w150-h150-k-no-p"]}], "resp": {"time": 1525900805452, "text": "😊👌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "110977101958353157042", "name": "Best “Beck” Bae", "time": 1620345479748, "rating": 3.0, "text": "Need better roads, to attract better people!", "pics": null, "resp": {"time": 1597004426941, "text": "Thanks Best Bae. I hope you’ll join us on the 1st Friday of every month for the “Community Meetup & BBQ”, so we can continue to work together to improve your approval rate. 😁"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "109449039009707652600", "name": "michelle jennings", "time": 1569698225879, "rating": 4.0, "text": "I haven't been here long but in the time I've been here i have been happy. I feel safe and my children are happy and i love the people that I'm surrounded by. They care for families and want to give you an affordable place to stay. I'm very grateful for them.", "pics": null, "resp": null, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "103038731240320856092", "name": "Honey Fine", "time": 1587736031627, "rating": 1.0, "text": "Nobody not saying how much is rent/ 3/2???? R the homes is update with new model homes 2000-2020? R they well insulated??? I kno my cuz was renting one from a private owner 4/2 sits on 1 acre land for 500.00.", "pics": null, "resp": {"time": 1593107659637, "text": "Sorry Honey for not getting back to you. It’s best to call or email as we don’t check here everyday.\n\nLet us know if there’s anything else we can do to improve your experience at 334-245-6410."}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "108842900511592234389", "name": "Vincent Osborne", "time": 1613780453778, "rating": 5.0, "text": "A great place to stay", "pics": null, "resp": null, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "104708889725540517617", "name": "Amber Shepherd", "time": 1571254964914, "rating": 4.0, "text": "We were helping a family member move into a new rent-to-own trailer in the park. When we got there, one of the managers came over and told us that the money that was given was just to hold the trailer so no one else could rent it. There was a still an amount of money that I'm not sure of for rent. Well, our family member doesn't get paid until the first and if the manager hadn't been so helpful, they wouldnt have had a place to live. The manager okayed them paying the rest of the rent on the first.\n\nThen, we were trying to turn the water main on so we could have, well, running water. When we turned the knob, water shot out because the main pipe had a huge crack in it. One of the workers was in a  bedroom fixing something and as soon as he was told about the crack, he stopped what he was doing to check on it. Within 15 minutes there were 4 or 5 more workers helping with the pipes and fixing the stuff inside that they hadn't gotten too before we moved the furniture in.\n\nAll in all, I'd recommend this place if you're looking for a cheap place either permanently or temporarily. The prices are fairly cheap.", "pics": null, "resp": {"time": 1571256350229, "text": "Thank you Amber! We appreciate your feedback! 😊🙏"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "116885965891684574423", "name": "ary armon", "time": 1571604830565, "rating": 5.0, "text": "I have been living in airbase estates going on two years now and  I love it .  My rent is affordable and my trailer is very spacious  and my neighbors are awesome . My landlord is engaged and very understanding . Airbase estates gives an opportunity to the community and a sense of belonging . Great place to live .", "pics": null, "resp": null, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "100500815471522699934", "name": "Twanda Walker", "time": 1571709082848, "rating": 5.0, "text": "I lived here a year september  its a very safe and reasonable price living friendly staff and owner and they always helpful and very concerned  about u here kids have nice activities very comfortable living i recommend Airbase Estates  for a very friendly and reasonable living and safe place for u and your family ..", "pics": null, "resp": null, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "116282186220562371663", "name": "Matt Mckinley", "time": 1577866137860, "rating": 5.0, "text": "Sorry was trying to back out and must have hit on the star by mistake, im enjoying my little quiet spot here, its soo peaceful and home(y) feeling, the biggest blessing is theyll work with you in a time of need on rent as long as your trying on your end", "pics": null, "resp": {"time": 1577861018468, "text": "Hi Matt,\nHow can we help you? 310-745-3108."}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "100399391910903496971", "name": "Candice Asberry", "time": 1571671085977, "rating": 4.0, "text": "Ive been staying out here for almost a year now i have not had any Major Problems with my trailer the staff is very helpful and  knowledgeable if you do have any problems they will fix right away", "pics": null, "resp": null, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "100763325902697845151", "name": "Kia Henderson", "time": 1578955981764, "rating": 1.0, "text": "2 small 4 the prices trailers r old clean but 2 old 4 the price they want. Mayb gud if u r single", "pics": null, "resp": {"time": 1578964883938, "text": "😊👋Hi Kia. Which home did you look at? What are you looking for? Feel free to call me and I’ll see what I can do to help 310-745-3108."}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "117690997220184799838", "name": "Cedrick Grandison", "time": 1554053732210, "rating": 5.0, "text": "Very rocky start but this is a very exceptional locality. I would recommend it to any who needs a piece of mind in this city. Very nice and quiet!", "pics": null, "resp": {"time": 1553962314682, "text": "Thank you Cedrick! I’m glad we were able to help smooth this over and make it work for you. 😊🙌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "101682325017132067766", "name": "nautice smith", "time": 1555728010413, "rating": 1.0, "text": "All the people giving 5 stars are making me wonder because I see all too clearly the monstrosity that these tenants are living in. I've been in several different trailers and they pretty much all look like something that should be in a junkyard condemned! Overgrown yards with 1977 edition trailers. I'm surprised the city let it be in city limits and they got the audacity to charge rent for those broken down pieces of scrapnal.", "pics": null, "resp": {"time": 1555738089113, "text": "Hi Nautice. This is the owner of Airbase Estates. I’m sorry you had a bad experience. Unfortunately we show homes before or during remodeling because remodeled homes are taken and full when move-in ready. We have really wonderful residents here and do thorough background checks. I’m not sure what happened with you and your application, but if there is anything I can do to help you can call me at (310) 745-3108."}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "107129239688266884780", "name": "Pamela Swinney", "time": 1540082425493, "rating": 1.0, "text": "I love giving good reviews, but for this review I am giving them 1 star. Honestly Airbase Estates  doesn't even deserve one star. The property I've seen wasn't nice looking at all. The trailers are falling apart, they need painting and much, much more. The whole area looks bad. I wish they would do something about it. They are right next to Maxwell Air Force Base. It's a shame. The rental prices are ridiculous. If they fix these trailers up the owner should keep the rental prices the same. There would be no need to raise the prices because then maybe the trailers would be worth the price they are now.", "pics": null, "resp": {"time": 1540095290596, "text": "UPDATE 10/22/18 from owner: I was informed this person left upset because we rented/sold the home they wanted to someone else who put down their deposit 1st. I have given them my number if they want to call me, so I can help give them priority on another home.\n—————————————————————\n\nHi Pamela. I’m glad to hear you care about this park as well. My name is Ryan Kirk and I’m the new owner. I couldn’t believe what I saw as well and knew I had to help turn it around. With that being said we are still in the middle of renovations on the park. It’s 89 homes so it’s a large project. We are projecting to be finished by January 2019. We do show homes before they are finished because of the demand. We either sell them or rent to own the units as is for the customer to improve themselves or we will finish them for them. Feel free to call me directly And let me know if there’s anything else I can do to help be of service. My number is 310-745-3108. I hope that helps. Let me know if you have any other questions."}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "109764927186906023402", "name": "Cake Diva", "time": 1533429998592, "rating": 1.0, "text": "Nothing like the pictures... Very dirty and ran down didn't see any improvements at all... Not impressed.\n.\nUpdate! 8..3..2018\nNever lived at this place so therefore a I wasn't evicted came to view and I've seen 3 different places and was not impressed. 2 of the places I've seen was very bad smelling. I did see the reviews which is the reason why I came to this location but after the tour I quickly left! Wish I had pictures to post. I came to visit about 1-2 months ago...", "pics": null, "resp": {"time": 1532577321268, "text": "@NumberOne CakeDiva. If you look at the reviews from new residents you’ll notice they are enjoying the new improvements from new ownership since October 2017.\n\nI don’t understand how you came to your conclusion and it’s unfair to folks looking for a clean and safe community that cares about its residents and is renovating the park.\n\nWere you recently evicted? Have you been inside a remodeled home? If you were to tour interiors you would see where all our labor and materials have been going. The Park renovations began in October 2017 and we are 70% done, but Interiors were completed first. The Exterior renovations to wrap up the project and provide the curb appeal you’re looking for will be completed by October 2018. I hope that helps. Let me know if you have any other questions."}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "114034175685877659921", "name": "ray ray steele", "time": 1571585374943, "rating": 5.0, "text": "They are great  all the mobile homes are renovated and a great place to live the owner is very understanding and will work with you", "pics": null, "resp": null, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "103154187455325727991", "name": "Y Da Hail Mary", "time": 1552523228950, "rating": 5.0, "text": "It’s a blessing a true blessing. We have experienced help , love , laughter, even God. The Owner Was Giving Our First Week .... many ways to help with rent . It’s a blessing ... we all have to start from somewhere. I pray blessings for this facility .", "pics": null, "resp": {"time": 1552524408596, "text": "😊🙏That’s very kind. Thank you!"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "103629416008644791784", "name": "cedric s", "time": 1540080762314, "rating": 1.0, "text": "Poor upkeep on the part of the owners.  Lots of mildew visible on the outside of the units.  Not worth the price.  Should be renovated or removed.  An eye sore to be so close to Maxwell AFB.  Does not live up to the name.", "pics": null, "resp": {"time": 1540095309940, "text": "UPDATE 10/22/18 from owner: I was informed this person left upset because we rented/sold the home they wanted to someone else who put down their deposit 1st. I have given them my number if they want to call me, so I can help give them priority on another home.\n————————————————————— Hi Cedric. I’m glad to hear you care about this park as well. My name is Ryan Kirk and I’m the new owner. I couldn’t believe what I saw as well and knew I had to help turn it around. With that being said we are still in the middle of renovations on the park. It’s 89 homes so it’s a large project. We are projecting to be finished by January 2019. We do show homes before they are finished because of the demand. We either sell them or rent to own the units as is for the customer to improve themselves or we will finish them for them. Feel free to call me directly And let me know if there’s anything else I can do to help be of service. My number is 310-745-3108. I hope that helps. Let me know if you have any other questions."}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "114412201093157278920", "name": "Addre Reed", "time": 1571427661543, "rating": 5.0, "text": "Quiet place to live and landlord works with you as well; KeAndrea Allen", "pics": null, "resp": null, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "105049022272918424091", "name": "KAREN NORRIS", "time": 1579983154357, "rating": 1.0, "text": "No dont live here. Very bad disrepair and it is always loud.", "pics": null, "resp": {"time": 1579989024445, "text": "Karen is right. We had a awful noise issue with the tenant 2 doors down from her home. Our on-site security guard served him a 7 day notice for violation of park rules and he has since been served an eviction. No more noise issue 😊✅. We value quiet and peaceful enjoyment.\n\nAs for disrepair... the park is under new ownership and we are remodeling homes 1 by 1. It’s a slow process and we have high demand when a home is ready and occasionally before we get a chance to work on it.\n\nI believe at the time of Karen’s move in she was in a hurry to get into some thing right away due to her circumstances, ready or not.\n\nThe condition of that home at the time was what it was. She wanted it, approved it and moved in 🤷‍♂️.\n\nHowever... We do have 7 remodeled homes ready and available today. Call 334-245-6410 x 1 to setup a showing Today 😊🙌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "110790174476551186084", "name": "Darryl", "time": 1521822191194, "rating": 5.0, "text": "This manufactured home park is starting to look like a little neighborhood.  Fresh new ideas and a little love being spread throughout. Before Long might have to find room for expansion.  Plenty of recreation for the family.  Free WiFi and many new perks to go around. Come by and take a tour if you don’t want to take my word for it !!!", "pics": null, "resp": {"time": 1521823251322, "text": "Thank you very much for the kind review! 😊👌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "102563876183429574972", "name": "Alisha Osborne", "time": 1552511097874, "rating": 5.0, "text": "I love my trailer no matter how busy they are. Im always happy at the in of the day....Thanks Mr.Osborne for fixing the trailers an giving me a chance.And last but not lease Thanks Mr.Kirk for okaying it.", "pics": null, "resp": {"time": 1552512410238, "text": "😊👋 Thank you Alisha! We enjoy having you at the park."}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "100200633716442263322", "name": "Porchia Coleman", "time": 1551645261576, "rating": 5.0, "text": "I presently stay here and just moved in and I love my house. I love the quiet neighborhood and the distance to different stores.", "pics": null, "resp": {"time": 1551645458618, "text": "Thanks Porchia! We’re so happy to have you 😊👌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "109179921635830417612", "name": "Virtuous Woman 365", "time": 1551492740644, "rating": 5.0, "text": "I have to say they will work with you and if you truly want the opportunity to own your own property this is the place for people who want thrive and not live from check to check.", "pics": null, "resp": {"time": 1551645562854, "text": "Thanks Anna! I’m so happy it worked out! 😊🙌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "102449228594588784813", "name": "Destine Smith", "time": 1531812636412, "rating": 5.0, "text": "Lovely , quiet neighborhood. Perfect for my first place! I absolutely love it here & The landlord is a wonderful person . You won’t regret coming here 💯", "pics": null, "resp": {"time": 1531851797103, "text": "😊👌Thank you Destine! I’m glad we could help."}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "105502077367396312815", "name": "Eric James", "time": 1605695452291, "rating": 3.0, "text": "A bit run down but ok", "pics": null, "resp": null, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "100743085860592213881", "name": "Matt Barnes", "time": 1615586795391, "rating": 5.0, "text": "Decent", "pics": null, "resp": null, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "111009490794118849531", "name": "Latrice Weeks", "time": 1582521116829, "rating": 5.0, "text": "Very quiet affordable place for family's off all backgrounds", "pics": null, "resp": {"time": 1597004666132, "text": "Thanks Latrice! And thank you for your Households participation and feedback at the “Community Meetup & BBQ”. We look forward to the next months 1st Friday meetup (Sept 4th, 2020) to continue to bring the community together and improve the park. 😊"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "115494742076659184710", "name": "Amari Symone", "time": 1554928843589, "rating": 5.0, "text": "I love my home it's nice & the area is very quiet nice place to live 💜", "pics": null, "resp": {"time": 1554937810448, "text": "Thank you for the kind feedback 😊🙌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "115460632206757275228", "name": "Maria Redd", "time": 1607322452969, "rating": 3.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "115603604237531029786", "name": "Pamela Mcrath", "time": 1561389510023, "rating": 5.0, "text": "Quite safe area and across from ms bs home cooked food", "pics": null, "resp": null, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "104945614388097526181", "name": "shawntrice knight", "time": 1549849276938, "rating": 1.0, "text": "Part one December 2018.Very Nice People I Love the park manager she is a people person and made me feel very welcome. Part two as of February 2019. These people told me to write this or I will get an eviction on top of that when I got ready to move they throwed all of our stuff out without an eviction notice from the sheriff I am I the process of filing a law suit against them and Everytime I came out there it showed up on my phone my son even got bitten up by bed bugs I have things on record that they have them coming out of there employee mouth and pictures of bed bugs so the reason why I'm making this post is to let them know you can't just do people any kinda way and you make post on Facebook using wsfa name they should file a lawsuit also I not stopping till something is done about this trailer park I came back to correct what I wrote was fake", "pics": null, "resp": {"time": 1538109165639, "text": "UPDATE 2/28/19... just received a call from Alabama Power today that this resident was stealing power and will be pursuing her for damages.\n\nHi. This the owner of Airbase Estates. I’d like to set the record straight. What Mrs knight forgot to mention was after she moved in on September 2018 she lost her job and did not pay her rent from November 2018-January 2019 and still owes a balance of $1,250. We agreed to not file a eviction if she voluntarily vacated. Once Mrs Knight moved out she abandoned her personal belongings without communication at our cost to have to store the items in the unit and then clean it out after 14 days. We tried calling, texting and emailing Mrs Knight without response and we have record of that. After 14 days we cleared out the unit, which is our only solution in this circumstance as per the rules by alabama state law. As far as her bed bug complaint.. there were no bed bugs when Mrs Knight moved into the home and we never received any communication that there were until now. Those are the facts."}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "109642584736767343296", "name": "Latasha Jordan", "time": 1521058791659, "rating": 5.0, "text": "At first  my rating was a one star and that was giving it a push. But you have to give them time and they will fix this park up. So I am being patient and I know the new management will get this park up and running with some upgrades to this place.", "pics": null, "resp": {"time": 1520984160783, "text": "😁👍 Thank You Latasha! We hope you’ll join us at the upcoming “Resident Appreciation BBQ and Grill-out” on April 14th at noon in the Picnic Pavilion 🌭🍔🥤☀️🔥"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "116724347194659351030", "name": "Viola Fowler", "time": 1521520410597, "rating": 5.0, "text": "Airbase estates is expanding nicely. Great remodeling great area very quiet great location to downtown &  Maxwell airforce base.", "pics": null, "resp": {"time": 1521523659644, "text": "Thank you Viola 😊👌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "117766210304626813065", "name": "Diana Carroll", "time": 1522617661473, "rating": 5.0, "text": "At the park area, an my grandson is having fun. I like that it's enclosed.\nWill be here alot I'm sure.", "pics": null, "resp": {"time": 1522622174834, "text": "Thanks Diana! We are so thrilled to hear you and your grandson are enjoying the new picnic pavilion! 😁👌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "112421252072468584009", "name": "Lue Terrell", "time": 1572570736969, "rating": 5.0, "text": "Quiet environment. Nice neighborhood to raise your family in. Timely mantaince done in timely manner.", "pics": null, "resp": {"time": 1519754701681, "text": "Hi Lue 😁👋 if you are still a resident at Airbase Estates, which I know you are, and are enjoying the fresh new improvements happening we hope you will update your review or leave us a new one 😄👍. If your experience has been anything less than 💯, ⭐️⭐️⭐️⭐️⭐️, 🔥, 🌈 and 🍭 then I hope you’ll give us the feedback we need to get you there at airbaseestates@gmail.com, call/text us at 334-245-6410 or simply visit us in the office. Thank you for being a valued resident and customer 💯! 😊👌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "114698941788485509121", "name": "Lethia Hester", "time": 1520301821328, "rating": 5.0, "text": "Very please with the new improvement and thank you so much for making this place feel like home great job.", "pics": null, "resp": {"time": 1520302899773, "text": "Thank you 😊👌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "113469235961006092918", "name": "Tip J", "time": 1521130177992, "rating": 5.0, "text": "Airbase Estates is more homely with the new paint jobs and new floors, the playground area is a great new attraction, convenient to your surrounding area schools,shopping,restaurants...", "pics": null, "resp": {"time": 1521131776097, "text": "Thank you Tiffany 😊👌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "111744602075836009008", "name": "bhealthy12", "time": 1527704179052, "rating": 5.0, "text": "A great place to live with good staff and the remodeled homes are nice.", "pics": null, "resp": {"time": 1527710496902, "text": "Thank you Deondrae 😊👍 You are one of our most valued residents."}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "106425323270340758675", "name": "Louis Edwards", "time": 1562632297955, "rating": 5.0, "text": "Good affordable, housing good place to stay.", "pics": null, "resp": {"time": 1562633001619, "text": "Thank you Louis! Let us know if there is anything we can do to help you to keep it that way."}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "103053292712215211386", "name": "Leah Jones", "time": 1569695157816, "rating": 1.0, "text": "Horrible living conditions, would not recommend.", "pics": null, "resp": {"time": 1569701749219, "text": "Hi! This is the owner of Airbase Estates. This is an older park with older homes. Driving through it feels like camp as a kid. However, the interiors of the homes have been upgraded. You’ve got to walk inside a home to appreciate it. I hope that helps. Let us know if you have any other questions. 😊🙏"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "108124451479814398702", "name": "JOSHUA PHIFER", "time": 1554495383831, "rating": 5.0, "text": "A wonderful place to stay and raise a family", "pics": null, "resp": {"time": 1554498691689, "text": "Thanks you Joshua 😊👌 we’re so glad to have you here!"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "104907559420563146970", "name": "Demetrius Towns", "time": 1571865014783, "rating": 5.0, "text": "This a good place love it", "pics": null, "resp": null, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "115106782501270153886", "name": "Tashia Towell", "time": 1562442168079, "rating": 2.0, "text": "Not what's being advertised.", "pics": null, "resp": {"time": 1562442907722, "text": "Hi Tashia! This is the owner of Airbase Estates. I’m sorry to hear your experience hasn’t been what you expected, so far. I would like to change that. Please call me at 310-745-3108 and I will do whatever I can to help. 😁👌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "111781314968540335551", "name": "Leslie Furr", "time": 1526496576416, "rating": 4.0, "text": "New management makes you want to move", "pics": null, "resp": {"time": 1513615820622, "text": "Hi Leslie! 😁 I’m sorry to hear that. What can we do to make your experience a better one? As you know we are about 2 months into remodeling the park and homes. By the end of January you’ll get to enjoy the new game room/clubhouse, picnic pavilion, playground, repaved streets, online resident portal to pay your bills without having to come into the office and FREE park Wi-Fi. We will also be adding white picket fencing around the exteriors of all homes as well as painting and power washing. We look forward to your feedback so we can make your stay nothing less then 💯 awesome 😁"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "106572563963862949332", "name": "Cortney Rogers", "time": 1571694463934, "rating": 5.0, "text": "Great place to live", "pics": null, "resp": null, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "110596581466424100847", "name": "David Andtews", "time": 1565102439968, "rating": 5.0, "text": "Good place to start", "pics": null, "resp": {"time": 1565103913462, "text": "Thank you David! 😊👌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "101207543381134137358", "name": "Leslie Hilton", "time": 1505509380913, "rating": 3.0, "text": "Rather not say, still have to live there", "pics": null, "resp": {"time": 1519754672391, "text": "Hi Leslie 😁👋 if you are still a resident at Airbase Estates, which I know you are, and are enjoying the fresh new improvements happening we hope you will update your review or leave us a new one 😄👍. If your experience has been anything less than 💯, ⭐️⭐️⭐️⭐️⭐️, 🔥, 🌈 and 🍭 then I hope you’ll give us the feedback we need to get you there at airbaseestates@gmail.com, call/text us at 334-245-6410 or simply visit us in the office. Thank you for being a valued resident and customer 💯! 😊👌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "111555553799873756117", "name": "Sharon Brooks", "time": 1584466677016, "rating": 1.0, "text": "Not good", "pics": null, "resp": {"time": 1584482247177, "text": "Hi Sharon. This is the owner of Airbase Estates. I’m saddened to see your one star review. Give me a call and I’ll see what I can do to help at 310-745-3108."}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "115106782501270153886", "name": "Tashia Towell", "time": 1562442168079, "rating": 2.0, "text": "Not what's being advertised.", "pics": null, "resp": {"time": 1562442907722, "text": "Hi Tashia! This is the owner of Airbase Estates. I’m sorry to hear your experience hasn’t been what you expected, so far. I would like to change that. Please call me at 310-745-3108 and I will do whatever I can to help. 😁👌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "106452478536998135628", "name": "MYRIO HILL", "time": 1535406402053, "rating": 5.0, "text": "kool", "pics": null, "resp": {"time": 1535408165898, "text": "Thank you 😊👍"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "114498461284832078311", "name": "James Bright", "time": 1573061504772, "rating": 5.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "114797889686529255878", "name": "1CERTIFIEDLADYTxLMM", "time": 1497403419963, "rating": 4.0, "text": "It's ok", "pics": null, "resp": {"time": 1519754744589, "text": "Hi Tammy 😁👋 if you are still a resident at Airbase Estates and are enjoying the fresh new improvements happening we hope you will update your review or leave us a new one 😄👍. If your experience has been anything less than 💯, ⭐️⭐️⭐️⭐️⭐️, 🔥, 🌈 and 🍭 then I hope you’ll give us the feedback we need to get you there at airbaseestates@gmail.com, call/text us at 334-245-6410 or simply visit us in the office. Thank you for being a valued resident and customer 💯! 😊👌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "116240621471899925582", "name": "Leslie Furr", "time": 1533226083983, "rating": 3.0, "text": "Slow about fixing things", "pics": null, "resp": {"time": 1533229106660, "text": "Hi Leslie. We are completing all work orders this week. We were waiting on a shipment of windows and doors, so I’m not sure if that was your issue or not. Were you able to give the office your list of repairs? If not, please email them to me at airbaseestates@gmail.com and I will make sure they have that list and get to it this week. 😊👌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "102448075683470000437", "name": "Elizabeth Smith", "time": 1529362727891, "rating": 5.0, "text": "Hello 😡😤", "pics": null, "resp": {"time": 1527709619993, "text": "Thank you Elizabeth 😊👌 We are so grateful to have you and your family. We value you and look forward to having your mother and extended family join us as your new neighbor 😁👍"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
{"user_id": "110804874249764991257", "name": "Derrick Bibb", "time": 1505571121233, "rating": 4.0, "text": "Home", "pics": null, "resp": {"time": 1519754635131, "text": "Hi Derrick 😁👋 if you are still a resident at Airbase Estates, which I know you are, and are enjoying the fresh new improvements happening we hope you will update your review or leave us a new one 😄👍. If your experience has been anything less than 💯, ⭐️⭐️⭐️⭐️⭐️, 🔥, 🌈 and 🍭 then I hope you’ll give us the feedback we need to get you there at airbaseestates@gmail.com, call/text us at 334-245-6410 or simply visit us in the office. Thank you for being a valued resident and customer 💯! 😊👌"}, "gmap_id": "0x888e86c658480b21:0xbdfb3cc7887ad60c"}
