{"user_id": "106605113871406299060", "name": "Kaska Howard", "time": 1626986361298, "rating": 5.0, "text": "Troy has very nice new dorms! Elevators, single/double rooms.", "pics": null, "resp": null, "gmap_id": "0x888dedbdedc76a61:0xb032831bb45ba86f"}
{"user_id": "112587228096856716452", "name": "Anthony Meeks", "time": 1619441116335, "rating": 3.0, "text": "Nice people. A little slow to respond to questions. Had to call them three times to get an answer.", "pics": null, "resp": {"time": 1619443525051, "text": "Thank you for bringing this to our attention we’re sorry to hear that your experience was not up to standards. Would you mind calling our office to discuss more about your experience? Thank you."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "110197836712977589313", "name": "Jamie Mathewson", "time": 1623184276862, "rating": 4.0, "text": "Bre and Ronette were amazing!! took 3 weeks to approve the fence but the responses on emails were friendly and very professional", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "113543118362288436856", "name": "renee Kelly", "time": 1608059892323, "rating": 5.0, "text": "Ms. Ronette was very professional, courteous and prompt.  She ensured my ARC request was staffed and walked me through the portal with ease.  She's the best and very user friendly.", "pics": null, "resp": {"time": 1609790379244, "text": "Renee, what a kind thing to say! Ronette really is a rock star! We are glad you were well taken care of."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "103842694057972466454", "name": "ASHLEE ADKINS", "time": 1605208447670, "rating": 5.0, "text": "For the first time since moving into our new home in March of 2018, we received a violation notice. Oops! So, I made a call to find out more details on what was wrong with said violation. My call was answered on our first try.\n\nAfter explaining what was in the picture, I’m happy to say Ronette was very quick (in less than 48 hours) in helping get us “legal” again.\n\nThanks again for all the help!!", "pics": null, "resp": {"time": 1605212620037, "text": "Ashlee, we are so glad to hear that we were able to assist and help you get back in compliance quickly and easily. Thank you for the great review!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "106143326838567020006", "name": "Billy Brizendine`", "time": 1609879035716, "rating": 5.0, "text": "Ms Ronette was very responsive, quick, and friendly! She helped me through the entire process and answered all my questions with ease. Thanks!", "pics": null, "resp": {"time": 1610385255014, "text": "Billy, we appreciate your feedback! We will pass along the praise to Ronette!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "115280833291958983693", "name": "Rachael Glass", "time": 1603676765866, "rating": 4.0, "text": "As an experienced retired property manager and having served on HOA boards I give Elite A lot of credit for what they do in my community I now live in.  Management is a juggling act because you have so many things to try and satisfy.   They are pleasant to talk to and are always open to resolving things when it is brought to their attention.", "pics": null, "resp": {"time": 1604327271154, "text": "Rachael, we so appreciate your kind remarks! You are right in that this industry can be very difficult, but we love what we do and the wonderful people we get to work for/with so it makes it all worth while!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "109616081294034997810", "name": "Lara Gilbert", "time": 1600276297716, "rating": 5.0, "text": "Ronette Harwell was amazing to work with! She was extremely helpful in guiding us through the ARC application process. She was quick to respond and had such a sweet demeanor. She truly made it easy to ask questions.", "pics": null, "resp": {"time": 1600366524487, "text": "Lara, thank you for letting us know of the great job Ronette is doing! We will pass on the praise!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "112859916613237310457", "name": "Howard Fry", "time": 1599150299960, "rating": 5.0, "text": "I had to obtain approval from my HOA to have work done on the exterior of my home.  Elite is our HOA property manager.  I was able to download the appropriate pdf from Elite's website and enter the data directly on the form.  I appreciate being able to enter the data directly.  I had to submit other files regarding the dimensions and colors.  Elite received my application and files then forwarded them to our HOA ARC that performs the review.  The ARC reviews the plans then sends their recommendation to the HOA Board who then notifies Elite.  That requires emails, downloads, review, communications, and postings.  I submitted my request on August 28 and was approved on September 3 and that is less than one week.  That turnaround time is what I call responsive.  The instructions were clear and the forms user friendly; that is a relecton of their professionalism.", "pics": null, "resp": {"time": 1599170217337, "text": "Howard, we greatly appreciate your feedback! You are so right, this IS a very involved process and we are happy to hear that you had a great experience!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "116478479815378142128", "name": "melanie aldridge", "time": 1609786651695, "rating": 5.0, "text": "Great to work with...issues are addressed quickly and professionally.  Communications are always pleasant.", "pics": null, "resp": {"time": 1609790306021, "text": "Melanie, Thank you for your 5 Star Review! Happy New Year to you and yours."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "100579179155027796623", "name": "Mark Hopper", "time": 1583267951163, "rating": 5.0, "text": "My subdivision is managed by Elite Housing Management. We have had a shuffle of management companies over the last 8 years. It was not until ELITE came aboard 2 years ago, that the property began to take a positive turn. The grounds improved. The amenities- pool, lakes, grounds, all improved.  ELITE  HOUSING'S visibility inside the subdivision improved,too. ELITE initiated an overnight patrol to assist in community presence proving to be a deterrent to vehicle break ins. My wife and I have been pleased with the service of ELITE HOUSING MANAGEMENT!", "pics": null, "resp": {"time": 1619444094827, "text": "We are incredibly grateful that you took the time out to leave us this note. Our company values put customer satisfaction as top priority and we are committed to our customers. Its customers like you that make our job wonderful. We look forward to serving you again."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "104394707320649308060", "name": "Tina Littleson", "time": 1607360693368, "rating": 5.0, "text": "Ronette was Wonderful!\nVery responsive and informative.\nGreat personality and fun to work with.\n\nThank you Ronette!", "pics": null, "resp": {"time": 1607371329173, "text": "Tina, your review is so appreciated! We will pass along the praise to Ronette!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "116970696438600698720", "name": "Katy", "time": 1601482212397, "rating": 5.0, "text": "These are some of the nicest and most patient people I have ever had the pleasure of interacting with. No matter how many questions you have you can rely on them to answer you or send you in the right direction. Michelle, Linsey, and Rhonette (I'm so sorry for the spelling as we've only talked on the phone) thank you so much for being there and doing such great jobs.", "pics": null, "resp": {"time": 1601488462227, "text": "Katy, wow! Thank you very much for your kind words. We have a wonderful team here and are so glad to hear that they are taking care of our homeowners! We will pass along the praise."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "105669448563038146787", "name": "dylan dwyer", "time": 1603119411746, "rating": 5.0, "text": "We are moving into our home and needed to get a fence installed. We had to get approval through our HOA first. Ronette helped me through the whole process. She was lightning fast in her responses and was very helpful! Thankful for making this an easy process!", "pics": null, "resp": {"time": 1603121886191, "text": "Dylan, we are so pleased to hear that Ronette was able to assist you with getting your fence installed easily and quickly! Welcome to your new neighborhood!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "114563910190198243049", "name": "Sruthi Krishnan", "time": 1605540492810, "rating": 5.0, "text": "Ally, at the Elite Housing Management was Awesome!!! :) She was helpful and very quick in providing answers to my questions.", "pics": null, "resp": {"time": 1605639905577, "text": "Sruthi, thank you for letting us know of the great work Ally is doing! Don't hesitate to contact us for any questions you have in the future."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "105068499892634920067", "name": "Emmett Moore", "time": 1602536903788, "rating": 5.0, "text": "The staff is very pleasant, friendly and professional.  Almost all of them are very organized, responsive and take care of issues expediently.", "pics": null, "resp": {"time": 1602538923866, "text": "Emmett, thank you for the kind review. We love working with you and your community and will continue to serve at the best of our ability!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "105247263215155623960", "name": "War Eagle20", "time": 1604044879469, "rating": 1.0, "text": "Think twice before allowing this company to manage your HOA property.\nThey have illegally OVER STEPPED THEIR BOUNDARIES countless times in my neighborhood with threats of inflicting unwarranted fines and even threats of coming to your property IN WHICH YOU OWN and dismantling or tearing down things such as flags, political banners, etc that DO NOT GO AGAINST OUR HOA COVENANT or BYLAWS.\nThis company is a walking lawsuit waiting to happen!\nI didn’t want to give this company even one star. Unfortunately, I had to in order to post my review.", "pics": null, "resp": {"time": 1604090304261, "text": "Hello War Eagle20. Please understand that we were hired by the Board of Directors of your HOA to uphold the covenant and bylaws of your HOA. We have not overstepped these boundaries within your community. We would never threaten anyone in the communities we manage. Our job is to ensure that the HOA covenant and bylaws are being upheld by members of the community and to provide a variety of services to maintain your and your neighbors’ property value and safety. Hopefully you will come to see this after you review your HOA’s covenant and bylaws again. If you would like us to review these with you or show you the portion that refers to political signs and displays in your yard we would be happy to assist."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "104236439345458550496", "name": "Undrea Randolph II", "time": 1592507282801, "rating": 5.0, "text": "I don't typically leave reviews for anything but Ally was AMAZING. First time homeowner and very new to HOA stuff and she was able to not only answer all my questions but follow up where needed. Greatly appreciated and an excelled asset. Glad to know she will be there when i call!", "pics": null, "resp": {"time": 1592512818884, "text": "Undrea, thank you for sharing about your great experience with Ally! We will pass along the praise!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "114116253433656230430", "name": "Allison Hunt", "time": 1583856054661, "rating": 5.0, "text": "The Staff truly cares about the homeowners, and making the community and the value of your home grow! It is a company that cares, and they show that through their hard-work. It is a small company that manages a rather large number of communities in the up and coming Huntsville/Madison area. AWESOME COMPANY!", "pics": null, "resp": {"time": 1619443822643, "text": "Thank you for taking the time to leave us such a nice review!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "114840113472528183295", "name": "Willie Brazile", "time": 1592842354658, "rating": 1.0, "text": "I think this company has been basically useless in my community.  We have yet to meet anyone associated with this company nor have seen any proof our dues are going towards anything substantial in our neighborhood.  We don't have any speed bumps to detract speeding, the community spaces outside our lots are not cut frequently, and we do not even have a clubhouse.  With well over 100 homes in the community, there should be funds available to have a nice area for the community.  Also on multiple occasions,  there has been no public declaration on dogs policy.  There are people who willingly have their dogs with no leash in the street and other yards and the HOA has done nothing about it.", "pics": null, "resp": {"time": 1592853253243, "text": "Willie, we understand your concerns however it is important to note that Elite Housing Management is not the HOA for your community: we are the management agency your HOA has elected to handle the day to day tasks necessary to keep your community in proper running order. The ultimate decisions on what can/will be done with your community rests with your Declarant/Board of Directors."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "100357085788571952358", "name": "Kim", "time": 1597327207436, "rating": 5.0, "text": "Thanks Tami w/ Elite Housing for trusting our company Stephens Electric co.,Inc to do work  on your properties it is such a joy to work with Tami and Elite Housing on many project she is very professional and always on top of the work they are needing done Wonderful company !!!", "pics": null, "resp": {"time": 1597331074204, "text": "Kim, we really appreciate your kind words! Tami is wonderful and we will pass along the praise! Thank you for your hard work!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "116108155268393387870", "name": "Donna Saunders", "time": 1596542692135, "rating": 5.0, "text": "Elite Housing Management replaced a previous company and walked into a difficult situation.  Our fountain barely worked, the pool construction had been delayed several times and a host of other neighborhood complaints.  Elite stepped up to the plate.  The fountain has been running.  The pool had a \"Grand Opening\" with food trucks.  The food trucks were invited into the neighborhood especially when we under severe lockdown from the pandemic.  I have to give a special shout out to Ronette Harwell for being patient with us and our Architectural Applications.  Her response to our questions was immediate and she asked the right questions to get our applications approved quickly.  Elite Team keep up the good work especially as the neighborhood continues to grow and change.", "pics": null, "resp": {"time": 1596563651657, "text": "Donna, thank you so much for the rave review! We love working with your community. We will share your praises to Ronette!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "114134953853593288585", "name": "Battlefield Alpacas", "time": 1600554456005, "rating": 1.0, "text": "I’m not sure they have even read our new community’s covenants.   We pay $75 a month, zero amenities.   Every other home has a violation.", "pics": null, "resp": {"time": 1600694966125, "text": "We would like to learn more about the issues you are experiencing within your community, and see how we can be of assistance. Please give us a call at 256-808-8719 to discuss your concerns with a valued member of our staff."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "103235675765160271984", "name": "Greg Hurley", "time": 1598630959416, "rating": 5.0, "text": "Ronette Harwell was a joy to talk to. She's super responsive and always willing to help. I think she deserves a raise.", "pics": null, "resp": {"time": 1598877837408, "text": "Greg, we appreciate you taking the time to go out of your way to let us know about the great job Ronette is doing! We will all give her a pat on the back!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "116843498555280846837", "name": "Buzz Killington", "time": 1592420631875, "rating": 1.0, "text": "We will always get letters to pay your dues but when we call about any issues it's a pain to get through. When we finally get through to complain about a dog that is always off it's leash, the said call animal control.  We don't have speed bumps or a rec center. What am i paying for?", "pics": null, "resp": {"time": 1592515597934, "text": "Thank you for your feedback, as it helps us get better. As an HOA Management firm, our responsibility is to help keep your community safe and to optimize and maintain the value of your property. Unfortunately, there are some things that are out of our hands and best left up to the professionals who deal with specialized things, such as a loose dog."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "101956734892180280834", "name": "Don Shield", "time": 1593474262709, "rating": 5.0, "text": "Management is very responsive and their professionalism is outstanding. Elite’s system tool is easy to navigate and track the total life cycle of our HOA.", "pics": null, "resp": {"time": 1593531518679, "text": "Don, thank you so much for the compliment! We love working with your community!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "112443656954273739317", "name": "Annette Akers", "time": 1590085233660, "rating": 5.0, "text": "My recent experience with Elite Housing Management was with Ronette Harwell in particular. I submitted an application to build a fence. As I'm not an experienced homeowner, I was unsure of how to layout the fence on my plot plan. Ronette was wonderful and explained how to read a plot plan very patiently and helped me understand. She responded to any question almost instantly and I had my approval within a day. Wonderful experience! Thank you.", "pics": null, "resp": {"time": 1590090361895, "text": "Annette, we're glad to be of assistance! We will absolutely pass along the praise to Ronette!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "109294407368812421053", "name": "Will Mahle", "time": 1597335116524, "rating": 1.0, "text": "They seem to take credit for good reviews here, then when there is a bad review, they blame the HOA Board of Directors.\nThey fined me daily for a moving pod that was in my driveway even after I explained to them that I had lost the contractor working on the house I had purchased due to Covid.\nIt is all about the Benjamins with Elite Housing.", "pics": null, "resp": {"time": 1597348490860, "text": "Will, as an HOA management agency working on behalf of the HOA, we do as the board of each community directs us to do. We are hired to enforce the covenants and rules of the community, while remaining strictly objective. Please give us a call so we can discuss this issue and work towards reaching a resolution."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "105109397557154377765", "name": "Donna Boyett", "time": 1593713537993, "rating": 5.0, "text": "I had an issue that they addressed very quickly and efficiently. They were very professional. Much appreciated.", "pics": null, "resp": {"time": 1593720558855, "text": "Donna, thank you for your feedback! We are here to help!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "116066710819130843048", "name": "jamie prince", "time": 1591109217343, "rating": 5.0, "text": "Elite has made an incredible difference in our community and I could not be happier. I was skeptical when they first came in to the community due to some of the reviews I saw but in less than a years time they have taken all of that skepticism and worry away. The Elite staff lives up to their name with their swift responses and resolutions to any and all issues we have had!", "pics": null, "resp": {"time": 1591110150688, "text": "Jamie, thank you for your review! We are glad to know that we have gained your trust and that you are happy with our company!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "116146792816410274700", "name": "Lizabeth Payer", "time": 1583870573835, "rating": 5.0, "text": "I would give Elite 10 stars if I could. They literally saved our Association from a previous crooked and corrupt property management company. Thank God for Chad, Crystal, Tammy and Ally - the office staff I have the most interaction with. Especially Chad and Crystal - our Hero's for sure. Always there to help, quick to respond, and they calmed all of our fears regarding maintenance issues, property struggles, and getting things back on track which was not easy. I don't know what the other haters are talking about - without a doubt they are the best in their field. Our Association is very grateful to Elite - a huge thank you for all your hard work.", "pics": null, "resp": {"time": 1590091526760, "text": "Lizabeth, thank you so much for your raving review and for trusting Elite Housing Management to care for your Association! We love working with your community!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "108664136639959221048", "name": "Josh Cook", "time": 1592445206359, "rating": 1.0, "text": "Elite is a Joke!!!! seriously the worst excuse for a HOA myself and a lot of others have ever seen before in our neighborhood. They literally take all of this money from the neighborhood to cut a little patch of grass. I could understand if we had a playground or pool in the neighborhood but we don't. We just got our yearly budget report which just shows they don't do anything. If you are looking to buy a house DO NOT buy a house that has Elite Housing Management for the HOA they are complete Trash.", "pics": null, "resp": {"time": 1592514708329, "text": "Josh, we hate to hear that you are displeased with how Elite is caring for your community. However, we feel it is important to note that Elite is not your HOA... we are the management agency appointed by your Home Owners Association Board of Directors for your community. We do not make the calls for what happens in your community."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "111311615621446510193", "name": "Aline Kuntze", "time": 1590771228476, "rating": 5.0, "text": "I had a great experience with the agent which helped me in my neighborhood, Ronette Harwell. She was pretty considerate and quick to help!", "pics": null, "resp": {"time": 1591107371192, "text": "Aline, thank you for sharing your great experience with Ronette and Elite Housing Management!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "111168224272105895948", "name": "Robert Lamb", "time": 1582554093977, "rating": 1.0, "text": "Horrible staff. \"Elite\" is nothing but a scam. They take tens of thousands of dollars from each community every year with nothing in return. The grass around the lake in our neighborhood stays overgrown. People constantly park on the street while also having cars parked in yards and on the side walk. No playground for the kids to stay off the street. They never run a street sweeper to clean up all of the trash that people create in the neighborhood. We have only had ONE meeting in the four years we have lived in Bermuda Lakes.  I can't believe this company is allowed to steal peoples money the way they do!", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "102007237479688656139", "name": "Ana McCormick", "time": 1593469505257, "rating": 5.0, "text": "Every time I call, Ally is always there to help with my day to day questions. Ronette has been phenonmenal! We have only had to make request twice now but both times, she has always responded quickly if I needed to add or make changes to our forms. (even my cartoon drawling lol).  I have been pleasantly surprised and happy with this HOA management company!", "pics": null, "resp": {"time": 1593531421102, "text": "Ana, thank you so much for your review! We love patting our teammates on the back for a job well done!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "101082784287487185017", "name": "Joanne Hunt", "time": 1590007458616, "rating": 1.0, "text": "Not impressed at all!!!!  This company sent me a warning letter based on a drive by weeks prior...my trust level in this company is extremely low at this point.  The employee I spoke with did not seem confident in her responses...she was making it up as she was going along.  When I responded logically, she seemed intimidated.  I am seriously considering selling my house to rid my self of Elite Housing!!!  By the way, I rate Elite Housing 0 stars!!!", "pics": null, "resp": {"time": 1590507249869, "text": "Joanne, we hate to hear that you are not happy with our company. We do our best to help the communities we represent by enforcing the covenants that each HOA has set in place. Our management team would like to speak with you to discuss your grievances; please give us a call at your earliest convince. Thank you."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "102854263922990519961", "name": "Trey Dyer", "time": 1592326678028, "rating": 5.0, "text": "The Bridges on The River HOA\n\nI feel it necessary to share my very positive thoughts and interactions with Elite Housing Management Company, and most importantly the Staff!  Amazing folks at EHM, from Chad, Tami, Crystal, Ronette, Ally and anybody else that works at EHM that I haven’t had the pleasure to meet.\n\nAfter reading most all of the reviews, believe me as a current HOA board member, this company is top notch!  Many of the negative reviews have nothing really to do with EHM.  They only enforce the covenants that we as a community have in place.  As another HOA board member noted, the board members and homeowners are the responsible party’s.  Our last Management company was impossible to reach by phone!  Absolutely not the case with Elite, as I have yet to receive a voicemail box during work hours.\n\nThere app is very helpful.  I have not encountered another company using one.  I am sure some do but I am just saying it is a plus.  Email responses are super fast.\n\nFor the reviewer that complained of Elite not keeping streets cleaned/street swept!!!  Really??  Just Really??  Address that with your HOA board members and have them allocate funds to have it done.  Elite will then ensure it is handled, I can assure you of the latter.  I can’t speak for your board members however.  End rant.\n\nKeep up the GREAT work EHM!!!!", "pics": null, "resp": {"time": 1592342763463, "text": "Trey, thank you so much for the raving review! We really appreciate you taking the time to share what you love about our company and to address our wonderful staff. We love working with your community and look forward to the future!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "101390257905957208402", "name": "Dave Miller", "time": 1580090671921, "rating": 1.0, "text": "My latest experience, I called in reference to a warning I received in the mail which did not pertain to our residence.  Was left on hold.  I am still waiting for the first satisfactory experience with this office.  Deserves a zero star rating.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "116443464162593393767", "name": "Robin Mitchell", "time": 1564409293493, "rating": 5.0, "text": "I reached out to them recently and received an immediate response from both James and Kelly!! They were both extremely helpful and very nice!   I truly believe they care about the value of our property and want to help us!", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "116443464162593393767", "name": "Robin Mitchell", "time": 1564409293493, "rating": 5.0, "text": "I reached out to them recently and received an immediate response from both James and Kelly!! They were both extremely helpful and very nice!   I truly believe they care about the value of our property and want to help us!", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "101390257905957208402", "name": "Dave Miller", "time": 1580090671921, "rating": 1.0, "text": "My latest experience, I called in reference to a warning I received in the mail which did not pertain to our residence.  Was left on hold.  I am still waiting for the first satisfactory experience with this office.  Deserves a zero star rating.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "101945965333167642099", "name": "Demetria Braudaway", "time": 1589912759350, "rating": 5.0, "text": "Elite Housing Managment is the HOA for my community.  I have been working on getting a pool and stained fence approved per our covenant.  It has been a delite to work with Ronette Harwell at Elite.  She has guided me through the whole process to approval.  I sent many emails and phone calls throughout the process and she was so responsive and attentive.  She went over and beyond to help me with my plot plan for the pool.  I could have never gotten this done without Ronette.  5 STARS all the way!!!!!!\n\nThanks, Demetria", "pics": null, "resp": {"time": 1590090539154, "text": "Demetria, we are so glad you had a great experience! We will pass along the praise to Ronette!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "114828635203903089547", "name": "Sondra Williamson", "time": 1591191606986, "rating": 5.0, "text": "Very nice people to work with. Fast and professional.", "pics": null, "resp": {"time": 1591626410618, "text": "Sondra, you for the 5 Star Review! We are glad to hear you are happy with our services."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "116938637124452834970", "name": "Danielle Jefferson", "time": 1583510692523, "rating": 1.0, "text": "Elite doesn't even deserve this one star. ELITE IS THE WORST MANAGEMENT COMPANY!! Poor customer service is the number one issue with them. Also, poor management with keeping our streets cleaned as well. Elite should be known as a SCAM. They are money hungry individuals who thrive off giving fines! They care nothing about the residents!", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "108634015255610182155", "name": "Matthew Pugh", "time": 1580129833224, "rating": 1.0, "text": "Very poor customer service. I have asked for a simple document for over 2 weeks and they claim to be too busy to take 30 seconds to email it to a customer.", "pics": null, "resp": {"time": 1619443980624, "text": "Thank you for your review. I’m sorry to hear you had such a frustrating experience, but I really appreciate you bringing this issue to my attention. Please reach out to our office to discuss your concerns."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "106442516294531775915", "name": "Allen Krasner", "time": 1583768774993, "rating": 1.0, "text": "Stay far away from this company and do not use them. They are horrible and do not care for anything other than getting HOA dues. They have only driven through our neighborhood once and ignored a multitude of violations per the community rules. We followed up with them about a complaints a neighbor leaving 4 trash can bins in then street for a week, and there respond was “ we will try to reach the owner again and has anything changed”. If they actually monitored the neighborhood, they would know! They are slow to respond, if they respond at all.", "pics": null, "resp": {"time": 1619443875718, "text": "Thank you for posting a review and we’re sorry to hear that your experience was not up to standards. We would like the opportunity to talk and investigate your feedback further."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "107702911486358411082", "name": "Teresa Christian", "time": 1563464411106, "rating": 1.0, "text": "My review, from over a year ago, was just answered. Why now? It's really futile at this point. Also, of course, I have the correct phone number. I don't know why I was even asked this silly question. We were first to move-in, so I can speak of turnover.\nCommunication has become better with Elite and my household over the past few months.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "106712140368274383416", "name": "Amy Donlin", "time": 1588791990830, "rating": 5.0, "text": "Very responsive.  Helpful and they care about the community!", "pics": null, "resp": {"time": 1590090610127, "text": "Amy, thank you so much for the compliment! We love our communities!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "107559176893986881934", "name": "Maygin Wheat", "time": 1575753838162, "rating": 5.0, "text": "Crystal and Tammy get stuff done. Always kind, courteous and effectively communicate.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "106712140368274383416", "name": "Amy Donlin", "time": 1588791990830, "rating": 5.0, "text": "Very responsive.  Helpful and they care about the community!", "pics": null, "resp": {"time": 1590090610127, "text": "Amy, thank you so much for the compliment! We love our communities!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "106966820874435813574", "name": "Ryan Hicks", "time": 1598492690972, "rating": 1.0, "text": "This is the biggest joke of property management/HOA management company I have ever had to deal with.", "pics": null, "resp": {"time": 1598547615494, "text": "Ryan, we hate to hear that you are not pleased with our management agency. Would you please reach out to us via phone so we can learn more about this issue and see if we can find a resolution? We look forward to speaking with you."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "108863387897977873261", "name": "Cheryl A Robbins", "time": 1567136117758, "rating": 1.0, "text": "If I could I would give this company NO stars. I have had people parking next to my home and dumping trash in my yard. When I asked why they were there they told me that the homeowners were given permission. I have NEVER had a good experience with this company. They are suppose to ENFORCE the no parking on the street bylaw but instead they let it pass. Most days I have to be hyperviligent when driving since there are cars parked on both sides of the street. I have never seen them do anything for the neighborhood and have never been told of any meetings. I see no purpose for an HOA if they do nothing but harass and belittle the people who are paying them for who knows what!", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "117754865191287794333", "name": "Bryan Goldsby", "time": 1617594289755, "rating": 5.0, "text": "They handle it all...", "pics": null, "resp": {"time": 1619443751859, "text": "Thank you Bryan! We at Elite Housing Management are incredibly grateful that you took the time out to leave us this note and value your loyalty and relationship."}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "113858197244389809969", "name": "Kathy Smith", "time": 1579281838567, "rating": 5.0, "text": "Our community picked them up in July to manage our community HOA and they have been outstanding to work with.\n\nThank you for your patience and understanding and relentless questions through our transition between builder controlled HOA to owner controlled.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "101104221390346757169", "name": "David Isbell", "time": 1574033236256, "rating": 5.0, "text": "Highly recommend Elite Housing Management. Great office staff!", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "117447015708343382341", "name": "Fred RN", "time": 1590614057170, "rating": 5.0, "text": "There is a lady named Ronette, she will take care of you. See her first!", "pics": null, "resp": {"time": 1590694201616, "text": "Fred, we are so glad that Ronette has taken great care of you! Thank you for the great review!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "106245935505705844657", "name": "Judah Frank", "time": 1544306587479, "rating": 1.0, "text": "Don’t see the point in our HOA. We live in a neighborhood with no community pool and very minimal landscaping, yet we pay hundreds of dollars per year. I did visit their office once and took note of the nice Mac computers they use, so that told me all I needed to know.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "102518528700582152220", "name": "David Hood", "time": 1570471870534, "rating": 2.0, "text": "Cost: 4/5\nEffectiveness: 1/5\nCommunication: 2/5\n\nTo preface this review, I live in the Burwell Gardens subdivision.\n\nOur covenant very specifically states (Section 4, Page 9) you may not park your cars on the street regularly. It is immediately evident that this is not adhered to. Pick any time of the day to drive down the neighborhood street, and you are forced to zig-zag through a labyrinth of cars.\n\nThe HOA did send out a notation about 6 months ago advising the neighborhood there would be fines for cars regularly parking on the street. Traffic cleared up for ~1 week, then promptly resumed with the parking habits. It is clear that the fines are either not happening, or are being ignored completely without any consequence.\n\nI'm not sure why this HOA is permitted to continue doing business in our neighborhood.\n\nPictures can be made available upon request... but as you cannot swing a dead cat without hitting someone's car on the street in our neighborhood, this is unnecessary.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "114361267075829124081", "name": "Michael Walker", "time": 1592414582116, "rating": 5.0, "text": "Everybody at Elite is a absolute pleasure to work with!! Very professional company!", "pics": null, "resp": {"time": 1592514744998, "text": "Michael, thank you so much! We have come a long way and are excited for our continued growth!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "103380890730769577454", "name": "Emily Little", "time": 1564510713034, "rating": 5.0, "text": "A very responsive and great team! Would HIGHLY recommend!", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "102131961207277935418", "name": "Lawrence Whisenant", "time": 1558119156591, "rating": 1.0, "text": "Very poor customer service. Very poor resident support. Provides very little in terms of useful services to the residents of the community.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "103133007757067972151", "name": "Aaron Hearne", "time": 1535302751953, "rating": 1.0, "text": "I have never had someone answer the phone when I call. The fees are way too high for a neighborhood without a pool because there's no return on the investment. The common areas get covered in weeds and dead trees get left standing. The common areas are only partially mowed. They pick and choose when to enforce the neighborhood bylaws, possibly only when the building company calls them.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "107492314666221778513", "name": "Bronson Smith", "time": 1582138617401, "rating": 5.0, "text": "They have really turned my neighborhood around and even helped me increase the value of my property", "pics": null, "resp": {"time": 1619443995136, "text": "Thank you Bronson for your review!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "105934677781709060515", "name": "Shannon Newby", "time": 1525121736783, "rating": 5.0, "text": "Return call within hours. Professional and very efficient with what was requested. Very impressed with office staff!", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "101521681063030864712", "name": "Crystal League", "time": 1515512937970, "rating": 5.0, "text": "I truly love the team here at Elite; working hard every day to help our local communities and those who live within is our passion.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "117123280224222875836", "name": "Greg Sexton", "time": 1515469916382, "rating": 5.0, "text": "Great team! The staff is very friendly and efficient, and will go the extra mile for their clients.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "109027106989730497744", "name": "David Isbell", "time": 1591193019958, "rating": 5.0, "text": "Great company!", "pics": null, "resp": {"time": 1591626426432, "text": "David, thank you so much for the kind words and 5 Star Review!"}, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "113367449539994867095", "name": "Teresa Christian", "time": 1522265324038, "rating": 1.0, "text": "Can never reach staff for help and a lot of turnover.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "117628814064609603215", "name": "David Speedy", "time": 1535154496681, "rating": 1.0, "text": "They don’t do their job.  No accountability of our dues and no disclosure of expenditures.  They are crooked and unethical.  They don’t deserve 1 star.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
{"user_id": "110808925002810894031", "name": "Kurt Sitler", "time": 1624221744982, "rating": 1.0, "text": "Elite Housing manages our neighborhood HOA. They have ignored several emails. Look elsewhere for a company to manage your HOA.", "pics": null, "resp": null, "gmap_id": "0x88627ab4a3c459b1:0x12f63ea8e30cec7f"}
