{"user_id": "105160723824423738713", "name": "Theresa Kallman", "time": 1585326545672, "rating": 5.0, "text": "I have had the pleasure of working with HDB for several months during a number of insurance policy renewals.  I have also utilized Charles Humphrey in obtaining the best advise on complex claim's coverage opinions.  The inside staff has been most helpful in answering questions promptly and securing documents as requested.  My experience with this firm has been some of the best I have experienced over nearly 25 years in  Risk Management.", "pics": null, "resp": null, "gmap_id": "0x14fb1e4b8d8dfca1:0x53abf134365d5b71"}
{"user_id": "117570697018032509453", "name": "Janice Argent", "time": 1568410515919, "rating": 5.0, "text": "Great company to do business with.  They actually care about your needs and do not hesitate helping you with any issues you may have.  Their employees are A-1, top of the line and they know their business.", "pics": null, "resp": null, "gmap_id": "0x14fb1e4b8d8dfca1:0x53abf134365d5b71"}
{"user_id": "106546063799870641981", "name": "Robert W.", "time": 1581446586490, "rating": 5.0, "text": "HDB is outstanding.  Always helpful and always responsive to the client's needs.  Christa Speigner does a fantastic job and I never hesitate to call on her when I need support.  She responds immediately and can ALWAYS provide the information and explanations that I need to manage our insurance program.  I would recommend HDB to everyone who has an insurance need.  They are the best!!!", "pics": null, "resp": null, "gmap_id": "0x14fb1e4b8d8dfca1:0x53abf134365d5b71"}
{"user_id": "111513835010421197626", "name": "Ashley Mason", "time": 1570115751478, "rating": 5.0, "text": "Sherry and the crew at HDB do an amazing job for us. They are all so willing to help with any crazy question I may have!", "pics": null, "resp": null, "gmap_id": "0x14fb1e4b8d8dfca1:0x53abf134365d5b71"}
{"user_id": "100339846772968534548", "name": "cindi pittman", "time": 1581024492176, "rating": 5.0, "text": "Always a fast response and you can tell they really care about their customers!", "pics": null, "resp": null, "gmap_id": "0x14fb1e4b8d8dfca1:0x53abf134365d5b71"}
{"user_id": "106735066992155550783", "name": "emmyj mommy", "time": 1568819474350, "rating": 5.0, "text": "Elaine D. is very knowledgable and kind.  Worked with me to find the correct fit!", "pics": null, "resp": null, "gmap_id": "0x14fb1e4b8d8dfca1:0x53abf134365d5b71"}
{"user_id": "110191281675397033153", "name": "Wendy Curvin", "time": 1573224197379, "rating": 5.0, "text": "This is a great company, with great perks for it's customers.  Have been working with them for over 12 years.", "pics": null, "resp": null, "gmap_id": "0x14fb1e4b8d8dfca1:0x53abf134365d5b71"}
{"user_id": "109567560036451471709", "name": "Kristy Brown", "time": 1581010957692, "rating": 5.0, "text": "Everyone at Harmon Dennis Bradshaw has been very knowledgeable and helpful in every situation.  They are a great team and I enjoy working with them!", "pics": null, "resp": null, "gmap_id": "0x14fb1e4b8d8dfca1:0x53abf134365d5b71"}
{"user_id": "112557002886083231739", "name": "Ray Thomas", "time": 1582314909364, "rating": 5.0, "text": "HDB  and Barrie has been our agent for 20 years or more, enough said....", "pics": null, "resp": null, "gmap_id": "0x14fb1e4b8d8dfca1:0x53abf134365d5b71"}
{"user_id": "116798614198050409584", "name": "Jamecia Harper", "time": 1619823075012, "rating": 1.0, "text": "They will tell you they have a job lined up for you and you will never hear from them. Carmilee Jones was my advisor and she would tell me that she had a position open that she could get me in. I never heard from her and after multiple attempts of trying to contact her, I just gave up. Do not recommend", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "108584533493642107105", "name": "Brittany Pritchett", "time": 1623279031352, "rating": 1.0, "text": "The front desk girl and also Kelly is great to work with hery professional. Carmilee is very rude and unprofessional. Says she doesn’t have any opening when clearing they’re coming available on your employee portal. She kept a a attitude and once told me she didn’t have anything open to look for a job on my own .", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "116584615504767473126", "name": "Mona Carletta", "time": 1604589106584, "rating": 5.0, "text": "I love the front desk receptionist and all the recruiters there\nThey go above and beyond to help you find a job!!\nThis is the best temporary agency in Mobile!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "110390650372296196635", "name": "Johnny Phillips", "time": 1585697946069, "rating": 5.0, "text": "Clark personal is a good company to work for. I worked with them years ago and decided to come back. I talk to a recruiter name Maranda she was very professional,explains ,her job well so that you understand, replies quickly to emails and just a good professional person all the way around. I'm sold!", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "112802206487147032262", "name": "Della Thomas", "time": 1591387506720, "rating": 5.0, "text": "Miranda and Kelly are great day just work with they will assist you in every way they can and finding employment and keeping you employed.", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "101398635835928190208", "name": "Sarah Ray", "time": 1565217222357, "rating": 5.0, "text": "First hand experience. I learned Clark will ensure you are paid and paid correctly within reason. I myself had a payroll issue on a Wednesday due to not having my correct direct deposit information plus the company I work for did not submit my hours to Clark. Too late to fix this now i thought. I called payroll at Clark, she advised me what I had to do on my part and they handled the rest. I know I had my paycheck on Friday with relief of needing my money. Bottom line is excellent for me and worthy of this review!", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "105021170578529876646", "name": "Chase Nelson", "time": 1565647375812, "rating": 1.0, "text": "On behalf of our company I tried to meet with Bob (the owner) and other members of Clark several times in order to recruit new employees. They never followed up or engaged.  This goes to show that the services they offer would certainly fall short and  you would probably receive very poor or unqualified candidates.", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "110088456992157037540", "name": "chasca23", "time": 1565065767065, "rating": 1.0, "text": "This office has no interest in placing qualified personnel in demanding positions. If you have a degree, advanced skills, and have ever lived outside of the twenty square miles you were born in, do not waste your time in applying to this branch office.", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "114904626301426505672", "name": "OJL's Writings", "time": 1498738561591, "rating": 4.0, "text": "Sends you to great companies.  Can be long term in one place for years. Once you prove your reliable and hard working. Clark keeps you busy", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "113811168226354326175", "name": "Detroit Q", "time": 1534819269506, "rating": 5.0, "text": "I had a very good experience with this agency. I put in my application and was hired temporarily with the company I currently work for full time. Just like with anything I had to put forth some effort but no biggie. People tend to leave bad reviews about temp agencies in general because they feel like the road begins and ends with the agency. The truth of it all is the temp agency is just a tool for the job seeker. Everything else is up to the person looking for the job. I had to politic like crazy to get hired at the place I work at. I didn't want the temp agency to do it for me because no matter how much I put on the resume. Nobody can sell my skills to a company better than I can. I just needed the temp agency to help get me in front of the audience.", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "111700652032241755330", "name": "Water Melon", "time": 1600440076643, "rating": 1.0, "text": "😡Clark were is my husbands check?", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "102910327011062715024", "name": "Christina Riley", "time": 1475086118230, "rating": 3.0, "text": "I was sent to this job site and worked for a couple weeks it was going great until I got a text message saying that the job assignment has ended like come on be for real. now im back to square 1 again jobless and searching. clark I need your help .", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "114819959305360051129", "name": "June Hope", "time": 1493132439337, "rating": 5.0, "text": "Angela was a tremendous help in showing me how to get the job I needed and wanted.", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "100234559180805720471", "name": "Corrina Marcus", "time": 1503244290958, "rating": 5.0, "text": "This place is awesome... Just gotta have patience!", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "109100105716076139015", "name": "J M", "time": 1528478874321, "rating": 1.0, "text": "Clark doesn't like to pay you, when their company messes up payroll! Complete nonsense!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "101089640539389544152", "name": "Hey Chief", "time": 1477662863554, "rating": 1.0, "text": "Put in a application for a warehouse positions. Was told positions would open in October.  Two months later nothing. I call and spend 20 seconds on the line with Amy and they say they will put me on the list but no calls yet. If you're looking for a job \"Clark's a waste of time.", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "104123130013872051767", "name": "Laura Merritt", "time": 1523636202918, "rating": 5.0, "text": "Rhonda is very informative and helpful.", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "106909063433050675955", "name": "Alome Chanthasinh", "time": 1433891367098, "rating": 1.0, "text": "Dead end. They couldn't get me a job if life depends on it.👎👎", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "101505578844930584040", "name": "Mark James", "time": 1493215633439, "rating": 1.0, "text": "Cheat people out their money bad experience.", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "100099088156875560667", "name": "Amber Tuchscherer", "time": 1504652778129, "rating": 5.0, "text": "Friendly and helpful staff", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "102900669567842386022", "name": "Caligula Romme", "time": 1545235645959, "rating": 1.0, "text": "Payroll problems at this place.", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "110084371911842446145", "name": "carl webber", "time": 1460992207335, "rating": 1.0, "text": "It's very hard to get a job I put my app in two mouths ago I call them everyday an the lady Amy always saids the same thing we will put you on the list I been on the list for month really?", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "115546256751260982785", "name": "Ken Holley", "time": 1491139501161, "rating": 5.0, "text": "They are ok", "pics": null, "resp": null, "gmap_id": "0x889a4d08cc35d5ff:0x2b3d32d001027d47"}
{"user_id": "105009069663296496987", "name": "T “Lady T” CL", "time": 1555150428060, "rating": 2.0, "text": "Had never heard of this place before until they contacted me about a position. Someone else was hired. I stopped by the office to drop off requested paperwork. She said she would keep my information on file. No follow-up or communication since then.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOinsjvrG7S1Yd1V76dHG8ba8QzcnZ3U1TWguOq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMzRmiKtylB7CTdinEazOTHbomJun4mQdTSkS3P=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPt_Zr_oRLVSG1da-b8e48i3IvHQfWyPynKjJG9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMtrnr9rmv99HtVUucNmk7HYalCootfCEsrPZ0H=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO9gfezIRSOknlwHiiUQKlyHLMK4VDsqPqLQE9K=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOeYVpG1yekGsvqe19dnUyUwkVdxsVwurEQAl-w=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOe3GNfHJXHUfIW-jmOsfqIx1hJk5zz2z64Btid=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNR10JCSCr7GStBcyXOLjEXPcnQ98CGHxSfIl6v=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMO75ZnyeGWaBmf3hu-FF_53MkxFxUks9PWD9xR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN-NtNtlpe4400ppCiAkmXGvk_OFUEWzbDYJOq4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM6H08-AnXm0Dv87xAEPCB2_ib9Ogdlstnhdf1S=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNZ2sk0M9arcYG6b1XV9n2KvVRaMtsZSUNTqxuY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNclxgbOFepzUlS1Dx78tvV4zcCKfcs3akYfSq1=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "113599126063458561745", "name": "Elaija Mason", "time": 1559302622711, "rating": 5.0, "text": "Went in one day they told me they would contact me when a job came available got the call early the next morning that they found a position got sent to interview with the hiring employer and 1 hour later I was hired! I have been to several temp agencies but this one got me in and got me out FAST and the staff are very energetic I will definitely be referring people !", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "104530235677517075897", "name": "Vernon B", "time": 1481307191984, "rating": 5.0, "text": "I've consulted with Darrell Walker Workforce many times regarding several of their employment services, including job placement, executive search, and workforce planning. On one occasion, I met with their administrative staff and recruiters in their Birmingham office. Throughout our 4 hour+ meeting, I was impressed with their attentiveness to my specific needs, eagerness and ability to answer my questions, breadth of knowledge about the staffing industry, and the years of experience they (literally) brought to the table. As an aside, they were providing temp services way back before the word \"personnel\" fell out of favor! I know I'm in good hands with Darrell Walker and will continue calling on them in the future for my staffing and payroll outsourcing needs.", "pics": null, "resp": {"time": 1481323844720, "text": "Hi Vernon! We remember that marathon meeting quite well. And we enjoyed every minute of it! One of the main reasons Darrell Walker Workforce is capable of providing relevant and beneficial employment services is because we understand the importance of listening. And the more we listen to valuable clients like yourself, the more we learn. We're definitely looking forward to our next \"discussion\". Thank you for taking time to leave a review. ~ Linda Walker Channell (President)"}, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "105177598837917596552", "name": "Nimitz 17", "time": 1572160206395, "rating": 5.0, "text": "I called in and they had me a job the next day, 5 stars all the way!", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "116894094856529757653", "name": "Shelley Belly", "time": 1409771304426, "rating": 5.0, "text": "Sheila and Meredith are very helpful and knowledgable in their field of human resources and placement.   It was a pleasure to deal with them. I have referred friends in the area to them and they have all enjoyed their experience with Darrell Walker Workforce Systems.  I would definitely recommend them to others.", "pics": null, "resp": {"time": 1481321495273, "text": "Hello Ms. Belly! Sheila and Meredith combined have over 45-years experience (and they're so young) in the staffing and recruiting industry, and Darrell Walker Workforce is grateful to have them on our team! It was a pleasure working with you as well and we REALLY appreciate your referrals. Thank you for your kind review. ~ Linda Walker Channell (President)"}, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "116123383910812557403", "name": "anthony d.", "time": 1541855764124, "rating": 5.0, "text": "I was hired by D. W. Over 2 yrs. ago and assigned a job by them in moody, al. After staying at that assigment for a couple months, I was hired on with the company full time and have been with them since then. The staff was very nice. I recommend D. W. highly as a place to get employment started. Also am making more money.", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "105933276905541719337", "name": "Len Snow", "time": 1546876171431, "rating": 1.0, "text": "I Signed Up For These People Multiple Times An They Never Found Me A Job I Call Every Monday These People Know My Name Personality An Never Found Me Nothing I Really Feel Like This Place A Waste Of Time An Just Won't You To Come In An Do Your Paperwork So They Can Get Paid", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "112974491811833007974", "name": "Humble Beginnings", "time": 1539894515015, "rating": 2.0, "text": "Only 12 hour shifts available.", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "103746775015177415026", "name": "Andrea Alston", "time": 1620317713830, "rating": 1.0, "text": "If you are in desperate need of  a job this is not the place.They are very nice and eager to find you a job in the beginning. ( at least thats what it seem like) I was very fooled by this company I was getting job offers from other companies and this company took 4 months to run a background I have worked in a few professional management settings this was beyond ridiculous.  I even went to the county where the background was stuck in . The office management was getting an attitude with me because I was calling trying to get an update.  To be clear  I did have something on my background that was over 7 years ago I was very honest and upfront with the staff. This has not ever  hinder me from obtaining a job as I have worked in management for over 2 0\nyears. I was beyond disappointed on how I was handle with the Management staff at this establishment.", "pics": null, "resp": {"time": 1620879477383, "text": "Thank you for your comment. We are so sorry to hear about your experience, and we’d like the opportunity to investigate and address your concerns. If you are willing to discuss this further, please contact our Customer Feedback team directly at 800-803-9336 or customerfeedback@roberthalf.com."}, "gmap_id": "0x8889179feec41c7d:0xe0dc48b434e7dde2"}
{"user_id": "114909064236614593006", "name": "Mur Lock", "time": 1581826795215, "rating": 1.0, "text": "Filled out all their info. Got called about a few positions. After they got  allll my information- never.heard.from.again! This seems to be a trend in these temp to hire type agencies. They must all just want to beef up their pool of candidates for businesses but the actual candidate comes last and is disregarded after they get a hold of their resume and info. I will email asking my file be deleted as they wasted my time.", "pics": null, "resp": {"time": 1582050820060, "text": "We are incredibly sorry to hear about the lack of communication you experienced at this branch. Would there be any further details that you would like for us to know? You can reach out to our quality assurance team at customerfeedback@roberthalf.com and/or 1-800-803-9336. We greatly appreciate you letting us know what happened and hope to have one more opportunity to connect with you."}, "gmap_id": "0x8889179feec41c7d:0xe0dc48b434e7dde2"}
{"user_id": "115828335009536105016", "name": "Aubree Gillis", "time": 1578596589476, "rating": 5.0, "text": "The best staffing agency ever, they changed my life.", "pics": null, "resp": {"time": 1579029538778, "text": "Thank you, Aubree!"}, "gmap_id": "0x8889179feec41c7d:0xe0dc48b434e7dde2"}
{"user_id": "111393472582038386846", "name": "kandi lykes", "time": 1463698387676, "rating": 1.0, "text": "Not very professional on top of the fact that I have had a application on file with them for the past 4 years and have never been sent out on a job.", "pics": null, "resp": null, "gmap_id": "0x8889179feec41c7d:0xe0dc48b434e7dde2"}
{"user_id": "102857455174792796880", "name": "Cinderella 7x7", "time": 1492874830490, "rating": 5.0, "text": "They help a lot of people find jobs!", "pics": null, "resp": null, "gmap_id": "0x8889179feec41c7d:0xe0dc48b434e7dde2"}
{"user_id": "118191943825514412064", "name": "Jared King", "time": 1611689920013, "rating": 5.0, "text": "As a small business owner, there are times when your vendors are more of a headache than actually helpful. Well, the team at ESS do not carry themselves in that manner. From the first call, through the follow up, they were extremely helpful. I worked with Miquel and he was quick to work me through the entire process. I highly recommend them, and will make sure to use them in the future!", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "107509513238098696800", "name": "Ryan Hand", "time": 1481855412535, "rating": 5.0, "text": "Extremely professional and very efficient. Building isn't marked very clearly but it is easy enough to find. I will be using their services for my business employment screening and compliance needs.", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "117879196677154575643", "name": "Hugh Bailey", "time": 1441690120475, "rating": 5.0, "text": "I had to go here for a TWIC card that my employer required. My appointment was for right when they opened but I got there almost 30min early. As soon as the first person was there they said they could get me in early. The facility was very clean, well furnished, everyone dressed and spoke very professionally and the front desk associate was extremely attentive. I was greeted (not called back) in the waiting room by the lady did did my application. She was quick, courteous and to the point. When we were done she escorted me out. The card was in my hands in just a few days. I was very impressed with the entire experience.", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "112974112117612835839", "name": "Heather Meeks", "time": 1418746825575, "rating": 1.0, "text": "This place is SO awful.  Do not use them!  I was forced to use them because the college program that I am in requires background checks and urine drug tests for admission and they use ESS.  First of all it is day 12 and they do not have my background check back!  I have called their customer service multiple times and each day they tell me \"it will be back today\" or contradict themselves by saying \"we have to make sure the information is correct.\"  Finally, an employee of the college department had to call them and guess what the hold up is...they needed confirmation on my middle name.  You think you could have asked me that one of the SIX times I called you?!  Also, another classmate had been waiting 7 days for a drug test to come back-the school had to call them only to find out that they neglected to send it.  And we got to spend $72.00 for this lovely \"service.\"  The school (who is a huge client of theirs obviously) is extremely irritated with them as well and I wouldn't be surprised if they go with a different provider in the future.  EISI is also in the Birmingham area and does the same service nationwide and will do it cheaper (like 50% cheaper) and quicker.  DO NOT WASTE YOUR MONEY ON THIS PLACE.", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "118248946522021696637", "name": "B C", "time": 1491399272303, "rating": 1.0, "text": "UNETHICAL AND GREEDY. This company scams and over-charges their customers. Companies and individuals should STAY AWAY from this company.\nI had a background check performed for myself and employee. ESS decided to search the middle name and last name of myself and my employee in an effort to make more money.\nThis search was not justified and, as expected, no records came up in a middle name/last name search for myself or my employee.\nThen, I receive an invoice (already charged to my credit card) for 5 total name searches.\nSearching for aliases is understandable and I would not object to this, but they arbitrarily decided to perform unnecessary name searches and charge us for them.\nI have had background checks for myself and employee performed 3 years ago for the same program, and the other company did not unnecessarily search for middle name/last name because they knew that it was unethical.\nI can not stress this enough, STAY AWAY from ESS! They WILL scam you.", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "114135229758172020977", "name": "Michael Justin", "time": 1464486276194, "rating": 5.0, "text": "Good people that run the place. For having to go and give a urine test they were very friendly", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "110428646061924796491", "name": "iL LEUMAS", "time": 1510274757297, "rating": 5.0, "text": "Speedy & friendly place to pee in a cup.", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "115363498306726153289", "name": "Face Ya dig", "time": 1488669557260, "rating": 4.0, "text": "Quick amd friendly service.", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "107466669449025185301", "name": "Jay Jay", "time": 1488080762143, "rating": 1.0, "text": "The girl at the front desk have a very nasty attitude!", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "111793597607092462334", "name": "Michael Shabani", "time": 1485404926572, "rating": 4.0, "text": "Very busy place", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "109994998120876342093", "name": "Andrea", "time": 1496579803448, "rating": 4.0, "text": "In and out.", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "111160761935169011529", "name": "allen holmes", "time": 1415247530405, "rating": 5.0, "text": "great service", "pics": null, "resp": null, "gmap_id": "0x88893d4540b014a7:0xe7ad6ab4b75c0ae5"}
{"user_id": "117538654077325984932", "name": "Britini Holmes", "time": 1618597037666, "rating": 1.0, "text": "Dropped my car to get headlight replaced because the headlight they replaced it with went out in less than 2 months. I left my car at 1045 am yesterday...I called throughout the day and my car was next. According to the manager, he only had four workers and they were very behind. By 8:45 that night, I still did not get a phone call that my car was ready so I decided to go get it because they closed at 8:30. As I pulled up they were turning off lights and leaving. I asked the manager where is my car? He informed me that he tried calling me, although my phone never rang, and that he had to order the bulb. I was angry but because the manager assured me that tomorrow I would not have to wait once the bulb arrived I will be in and out, I calmed down. I went back today and the same store manager informed me that it would be an hour. I am contacting corporate. Horrible customer service.", "pics": null, "resp": {"time": 1618601180011, "text": "Britini Holmes, I am sorry for your bad car repair experience, but the company you left your review on is Alliance HR. We are a staffing company. I hope you will remove this post as we had nothing to do with your issue. Thank you, Alliance HR management"}, "gmap_id": "0x8862867c2e3bcd43:0x68c3a8e78db97d9"}
{"user_id": "100711494013029029685", "name": "Amy Ashburn-Forest", "time": 1606914832807, "rating": 5.0, "text": "My husband walked in looking for a better paying job, and walked out hired, with a start date in place, and all required paperwork and drug testing done at the same time. He's very happy with the staffing company itself, but more importantly, really loves the job they found for him. Just look for Old Town Pottery and Ollie's in the shopping center to know you're in the right place. It's tucked into that shopping center, next to a furniture store.", "pics": null, "resp": null, "gmap_id": "0x8862867c2e3bcd43:0x68c3a8e78db97d9"}
{"user_id": "106579168332514179321", "name": "Truth Exposed", "time": 1605121046217, "rating": 1.0, "text": "Applied but would not send me out to work.", "pics": null, "resp": null, "gmap_id": "0x8862867c2e3bcd43:0x68c3a8e78db97d9"}
{"user_id": "117785099269692810411", "name": "turbojet powered", "time": 1561546700031, "rating": 1.0, "text": "Beware of the receptionist Nazi. One of the recruiters had contacted me by phone for a position they needed filled.She said to stop in to meet with her. Unfortately the receptionist would not let me speak with a recruiter or even advise them that I was their.So I told the receptionist to have a nice day and left. A robot would do better then she could. She made it clear that the front area was her world and she is the supreme leader of it. This is ashame because the recruiter I spoke with seemed very knowledgeable. This was at the Madison AL. location", "pics": null, "resp": null, "gmap_id": "0x8862867c2e3bcd43:0x68c3a8e78db97d9"}
{"user_id": "107961604027386873848", "name": "Tony Bernal", "time": 1488548186094, "rating": 5.0, "text": "I worked for them for about 2yrs. They are always helpful and very dedicated to place you on the right job. Very nice people, if I needed a job again it would be my first stop.", "pics": null, "resp": null, "gmap_id": "0x8862867c2e3bcd43:0x68c3a8e78db97d9"}
{"user_id": "116501208403472094643", "name": "Jeki T LaJuan", "time": 1546721280777, "rating": 5.0, "text": "Yeah, though people here are good worker..!", "pics": null, "resp": null, "gmap_id": "0x8862867c2e3bcd43:0x68c3a8e78db97d9"}
{"user_id": "109254652788754396664", "name": "Nene Burgess", "time": 1449937090050, "rating": 1.0, "text": "This is by far the worst temp service to work for. I worked for Alliance about a year or two ago and I had a bank account with Compass set up for dd then. I am now 5 months pregnant and needed something so I went back to work with Alliance just this month on the 1st. I filled out new banking info in order to receive my paycheck 2 weeks prior to starting work. Why? Because I no longer bank with Compass because my account was compromised and docked 2-300 in the negative and I no longer wanted to have an account there for various reasons. I was suppose to receive my check this Friday on Dec 11th and they sent it to the closed negative account where all of my check was taken. The excuse was they didn't put the new info in on time and can't help that the account was negative. Everyone there keeps giving me the run around and I am pregnant with bills on the holidays and have worked my ass off at a perfume plant for them only to not have been payed. And get this, after everything, the lady called and fired me in claims that I didn't meet their quota when I reached 90-100% every hour. Will be suing this company very soon. And will never return or recommend anyone in need of a job to go there.", "pics": null, "resp": null, "gmap_id": "0x8862867c2e3bcd43:0x68c3a8e78db97d9"}
{"user_id": "102645556140178528033", "name": "StrikerJ", "time": 1534964558970, "rating": 5.0, "text": "Easy service and very friendly and talkative staff.", "pics": null, "resp": null, "gmap_id": "0x8862867c2e3bcd43:0x68c3a8e78db97d9"}
{"user_id": "102789046447453754173", "name": "Jasia Lang", "time": 1518396602431, "rating": 5.0, "text": "Novalla is the person to go too.\n\nTusi Tagoilelagi", "pics": null, "resp": null, "gmap_id": "0x8862867c2e3bcd43:0x68c3a8e78db97d9"}
{"user_id": "114541383030442207270", "name": "Jim Pickens (DOOBY)", "time": 1561988583928, "rating": 1.0, "text": "Never called me back for a job!", "pics": null, "resp": null, "gmap_id": "0x8862867c2e3bcd43:0x68c3a8e78db97d9"}
{"user_id": "110732979832840825309", "name": "antonious reynolds", "time": 1510151090517, "rating": 1.0, "text": "They sorry as hell make me sit there for 3 hours then send me home it's not a guaranteed everyday job", "pics": null, "resp": null, "gmap_id": "0x8862867c2e3bcd43:0x68c3a8e78db97d9"}
{"user_id": "116677061163225094313", "name": "JJ Betancourt95", "time": 1581284059575, "rating": 5.0, "text": "(Translated by Google) If you need work and can't find a place to work, this place is very good to get you a job.\n\n(Original)\nSi necesitas trabajo y no encuentra sitio para trabajar este lugar es muy bueno para conseguirte trabajo", "pics": null, "resp": {"time": 1598466009746, "text": "JJ, Thank you for the positive 5 star review. We are glad we are able to place great people in great positions. Have a great day!"}, "gmap_id": "0x8862867c2e3bcd43:0x68c3a8e78db97d9"}
{"user_id": "102793482545739008941", "name": "Janis M Diaz", "time": 1526654252273, "rating": 5.0, "text": "(Translated by Google) Excellent\n\n(Original)\nExcelente", "pics": null, "resp": null, "gmap_id": "0x8862867c2e3bcd43:0x68c3a8e78db97d9"}
