{"user_id": "107460987664397684482", "name": "Rachel", "time": 1490726561354, "rating": 5.0, "text": "The bass fishing here is incredible", "pics": null, "resp": null, "gmap_id": "0x88602d551d8292f5:0x5149e53b1fbacbfa"}
{"user_id": "117814999330181050994", "name": "Joe Hunt", "time": 1584662452166, "rating": 5.0, "text": "My experience here was one of a lifetime. The great southern hospitality here was absolutely amazing. I look forward to going back to hunt more! The hunting alone was an amazing experience. On top of that, the natural beauty and atmosphere made it a wonderful experience for me and my wife. Larry (the owner) was such a polite man, he was always nice and helpful 24/7. His cooking was absolutely delicious!! I would recommend this place to absolutely anyone! The prices are extremely fair! I went on a 3 day hog hunt with my wife and had a joyous time. My overall experience there was amazing and I plan on returning again!", "pics": null, "resp": null, "gmap_id": "0x889a6d4ff5e7e715:0x52fef79e43510bff"}
{"user_id": "103354255269981683620", "name": "Zach Adams", "time": 1624569708028, "rating": 5.0, "text": "Awesome experience and great food", "pics": null, "resp": null, "gmap_id": "0x889a6d4ff5e7e715:0x52fef79e43510bff"}
{"user_id": "117581359180587935912", "name": "Bob Lafferty", "time": 1524527870613, "rating": 5.0, "text": "Wow.    An awesome time shown by the host Larry and his friend Joe Joe.   Pigs were harvested and times will be remembered forever.  However we will be returning.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNR0E6AmtKNc3hIitjj8sLH5RTii1PTgbxXlTWt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNJQ9St1BMBDtOge7XBSY7Ccl5yrOczaIpszo34=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOYIpm1eP8dhS1nI06KfvZPW3BrCVu70tn_ikEy=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a6d4ff5e7e715:0x52fef79e43510bff"}
{"user_id": "104837003783940260220", "name": "Jody Vanderpool", "time": 1604856240951, "rating": 5.0, "text": "great facilities great food and excellent company.", "pics": null, "resp": null, "gmap_id": "0x889a6d4ff5e7e715:0x52fef79e43510bff"}
{"user_id": "109020783925240465446", "name": "jewell watson", "time": 1536446051449, "rating": 5.0, "text": "We are from west ky, had an awesome time here back in March , Larry and Joe made everyone feel like family. They cooked some amazing meals, drove us to our stands, we saw tons of hogs.  I just booked another hunt for a party of 3 again for October 2018, We absolutely love this place. For an amazing, relaxing, fun, definitely a great harvest hunt,  schedule a hunt here and you wont be disappointed. We will be scheduling another hunt for Feb or March 2019, while we are here!", "pics": null, "resp": null, "gmap_id": "0x889a6d4ff5e7e715:0x52fef79e43510bff"}
{"user_id": "106890848674247527990", "name": "Cory Cox", "time": 1521971687374, "rating": 5.0, "text": "Larry and his group know exactly how to treat you to a good time. All meals cooked and they drive you to your hunting stands. Not to mention depending on the game, they even make extra trips every day keeping the bait full. Could not have asked for a better weekend. They hosted 12 guys without any issue. We already started planning the next trip.", "pics": null, "resp": null, "gmap_id": "0x889a6d4ff5e7e715:0x52fef79e43510bff"}
{"user_id": "108572488688068546549", "name": "Attila Voit", "time": 1564454974589, "rating": 5.0, "text": "So much fun here with larry and jojo..thanks guys always a great time..", "pics": null, "resp": null, "gmap_id": "0x889a6d4ff5e7e715:0x52fef79e43510bff"}
{"user_id": "109787817981524460052", "name": "Reese Flotte", "time": 1516581881738, "rating": 5.0, "text": "I had a great time they treat you like family home stile cooking very comfortable beds good times hunting. I don't think its fair to give them a bad review with all the pluses", "pics": null, "resp": null, "gmap_id": "0x889a6d4ff5e7e715:0x52fef79e43510bff"}
{"user_id": "107920821516291233303", "name": "Nick Phair", "time": 1618748947388, "rating": 5.0, "text": "AWESOME EXPERIENCE!!! This was my first time at Pako and won't be my last. The hospitality is beyond amazing, J Paul is awesome and loves seeing everyone be successful on their hunts. Mrs Rita is very welcoming when checking in, my guide Shaq was also knowledgeable and funny. And the food is the best! Can't wait to have them sweet potato dumplings and pork steak again. Thank you Pa-Ko for an awesome weekend, and making unforgettable memories, can't wait to come back every year from here on out.", "pics": null, "resp": null, "gmap_id": "0x888d1a80b55f2e23:0xa1e4ea442ed42e36"}
{"user_id": "116600028664217844186", "name": "Darin Shaw", "time": 1618734236596, "rating": 5.0, "text": "A buddy and I came down for a hog hunt this year. What an awesome experience. Very friendly people Mr. J. And Mrs. Rita greet you with a warm amd inviting welcome. MR. J does the best job he possibly can to put hunter in rewarding  spots for their hunt. The meals were fabulous they have nice living quarters for you to stay I'm as well. We both had an awesome time and will definitely be back for more great hunting. So if your looking for am awesome time love to hunt amd want a great experience at an affordable price pako Plantation is the place to go.", "pics": null, "resp": null, "gmap_id": "0x888d1a80b55f2e23:0xa1e4ea442ed42e36"}
{"user_id": "103999424478198220514", "name": "Hutch Sprayberry", "time": 1574725408285, "rating": 5.0, "text": "My dad, brother, and I are headed home from Paco Plantation. What a great experience! We went quail hunting, and we were guided by Mr. Todd Cochran. He is very professional. We took our Brittany to hunt the second half of the trip and Mr. Todd was very willing to give us advice. He gave great advice and information that made our dog better within 10 minutes. He could not have been better. Thank y’all for the great experience, and a special thank you to our great guide!", "pics": null, "resp": null, "gmap_id": "0x888d1a80b55f2e23:0xa1e4ea442ed42e36"}
{"user_id": "106681591956498450396", "name": "Brad Faigle", "time": 1581951826379, "rating": 5.0, "text": "Been here twice and won't be my last. Greeted with the best hospitality I've seen on a hunting trip and not to mention how good the food is! J. Paul cares and wants hunters to be successful and Rita is extremely welcoming when checking in. Don't hesitate, book a trip!", "pics": null, "resp": null, "gmap_id": "0x888d1a80b55f2e23:0xa1e4ea442ed42e36"}
{"user_id": "113526155702327086626", "name": "S Peeples", "time": 1573558760876, "rating": 5.0, "text": "When you arrive you are greeted by personable staff. Willing to go the extra mile to make sure your stay is memorable. The hunting is some of the best we have ever experienced. Deer are very plentiful.  The living quarters are nice, clean and comfortable , the grounds are kept clean, the food oh the food- yum!. Our guide Shack was very professional and willing to help with anything we may have needed.  Jay Paul went out of his way to make sure our experience at Pa-Ko was memorable. 5 stars is not enough, I would have to at least give Pa-Ko 10 stars.  Thank you Jay Paul and ALL the staff, we look forward to seeing all of you again soon.", "pics": null, "resp": null, "gmap_id": "0x888d1a80b55f2e23:0xa1e4ea442ed42e36"}
{"user_id": "107602503929728937727", "name": "Joni DeMarco", "time": 1577748444120, "rating": 5.0, "text": "This was our second year at Pa-Ko and I can’t say enough about this place the hospitality is second to none the staff is so friendly and helpful. The weather did not corporate with us it was very warm for this time of year but the deer were still moving a little. I saw my first big buck with the help of one of the guides he was awesome I so wanted to take him home with me but my excitement and nerves got the best of me and I missed him.\nBut I learned so much about deer and how they move and what or shooters and what are not.\nI highly recommend Pa-Ko for beginners and experience hunters . Jay Paul and his staff are the best . We will definitely be back next year .\nThanks again Jay Paul and staff.", "pics": null, "resp": null, "gmap_id": "0x888d1a80b55f2e23:0xa1e4ea442ed42e36"}
{"user_id": "116607529238645953089", "name": "J P", "time": 1415107240157, "rating": 5.0, "text": "Excellent food and board! Top notch facility, If you like hunting the REAL way, this is your place. All fair chase game. Been going for years and hope there is more to come. J Paul and Mrs.Rita Taylor are some of the best people you could ever meet. They do a wonderful job of making their guests feel at home!", "pics": null, "resp": {"time": 1446224835261, "text": "Thanks for the kind words, Jeremy -- much appreciated! It's been awhile since this review, so stop on by again anytime. Hoping to see you soon! - Jay Taylor, Owner"}, "gmap_id": "0x888d1a80b55f2e23:0xa1e4ea442ed42e36"}
{"user_id": "111086267013168780564", "name": "Brian Mathis", "time": 1500128912658, "rating": 5.0, "text": "We hunted with J. Paul and the crew at PA KO last February. Many deer were seen over the three day hunt and my friend killed a nice 8 pt on the first evening hunt and I had the opportunity to kill a nice buck the last morning but decided to let him grow. Jay is a great outfitter and a pleasure to be around. The accommodations and southern cooking are first class. We will be back!", "pics": null, "resp": null, "gmap_id": "0x888d1a80b55f2e23:0xa1e4ea442ed42e36"}
{"user_id": "102454410978111406383", "name": "jeffs emailbox", "time": 1552276387017, "rating": 5.0, "text": "J Paul is the man👍 he's very professional and takes his clients needs and abilities seriously. In our 2 party hunt we were put in some of the best locations to score on some pork . If you don't score here it's your out fault . My hunting buddy let the squeal out of a nice piglet and I rushed a shot on some porklets and came up empty handed but I'm extremely happy with the whole experience. J Paul and crew made us feel very much at home for the short time we where there. We had to leave early for medical reasons but we'll be back for sure. Thanks Pa Ko Plantation. 👍👍", "pics": null, "resp": null, "gmap_id": "0x888d1a80b55f2e23:0xa1e4ea442ed42e36"}
{"user_id": "114459046960793750455", "name": "Joe D'Angelo", "time": 1454436925930, "rating": 5.0, "text": "We had a great time hunting quail in January with clients.  Plenty of birds, dogs and guides were great, accommodations and meals were terrific.\nJ. Paul and his team do a great job.", "pics": null, "resp": {"time": 1454871668613, "text": "Joe, thanks a lot for leaving the great review for us. It really means a lot to everyone here! Come on back and hunt with us again whenever you'd like. Take care. - Jay Taylor, Owner"}, "gmap_id": "0x888d1a80b55f2e23:0xa1e4ea442ed42e36"}
{"user_id": "103669510957749709099", "name": "Carroll Lineberger", "time": 1515515341045, "rating": 5.0, "text": "Pa-Ko is a great place to hunt and visit. From the time you get there you are treated like family! Jay knows what he is doing with the deer and hogs. I have seen and killed some good bucks on my hunts there. Unlike at some of the other lodges in the same area you get no BS from them. I have had the opportunity to hunt many places in my life and I really enjoy Pa-Ko. The highlight of Pa-Ko is the game, people, lodging and food not 6 different kinds of coffee!", "pics": null, "resp": null, "gmap_id": "0x888d1a80b55f2e23:0xa1e4ea442ed42e36"}
{"user_id": "109952097141745688676", "name": "Bradley Betts", "time": 1543711057311, "rating": 5.0, "text": "First trip to this Plantation was AMAZING!! My daughter has never been on a guided hunt til here. First night in the stand she saw 10 deer, 1 being a 4 point buck. 15 min of shooting light left she took a good mature doe, one shot through the boiler room and she dropped in her tracks. Once back at the lodge, Jay Taylor the owner, Lester and Shaq the guides were all congratulating her on her first harvest. My daughter was beaming from ear to ear with a smile for the way she was treated about her first deer. Secound day of hunting she saw 9 deer and 10 turkeys. Third day was a bad thunderstorm and that evening it quit raining enough to go out. In ten minutes of being in the stand Hayden shot at a hudge 4yr old 7 point. She missed, so no wounded deer. My daughter was heart broken but with the guides kind words of wisdom and Jays encouragement she got back in the stand to keep hunting. We have have one more day of hunting but i just wanted to post about our experience at Pako. We will be back every year from now on. Pako plantion would get 100 stars if there was that many to give them. Were gonna be life time guest of Pako!! Thank you Jay and staff for everything you've done for my daughter and I.\n\nP.s\n\nThe food is Awesome also. Good southern cooking at its best!!", "pics": null, "resp": null, "gmap_id": "0x888d1a80b55f2e23:0xa1e4ea442ed42e36"}
{"user_id": "107699086114643432077", "name": "Richard Kilbride", "time": 1541503309057, "rating": 5.0, "text": "I only wish I had found this place ten years ago . This was my second year at PaKo I had the best time in both trips met some really good guys in camp who I had never met before and will be acquaintances and friends for the rest of my life .\nI have been a bowhunter for about 45 years JPaul knows what he’s doing ! Stands  were in excellence spots,  I had numerous opportunities , I saw more bucks then does.\nI had success both years but as most bowhunters know that is just  icing on the cake . It’s obvious JPaul takes a tremendous amount of pride in getting his clients opportunities ,he  works we pull the trigger .", "pics": null, "resp": null, "gmap_id": "0x888d1a80b55f2e23:0xa1e4ea442ed42e36"}
{"user_id": "110733885963332218360", "name": "Carroll Lineberger", "time": 1479849158550, "rating": 5.0, "text": "I have had the opportunity to hunt at numerous places over the past years and Pa-Ko is a truly great place to hunt.  J.P. worked his butt off for not only our group but the others in camp trying to get you on deer. The facilities are private, comfortable and inviting for you to relax and put your feet up after the days hunt. Shaq and Lester, where do I start they are just great guys and do a great job with the meat and helping get us out to our stands. Now the cooking is second to none! The Pa-Ko crew will prepare some great southern meals for you and you will gain some weight! I was very satisfied with my hunt and am going back the because J. Paul, Rita   and the rest of the crew will treat you like family give you a quality hunt and you will have a great time.", "pics": null, "resp": null, "gmap_id": "0x888d1a80b55f2e23:0xa1e4ea442ed42e36"}
{"user_id": "105640169165715645438", "name": "David Lisenby", "time": 1513209290256, "rating": 5.0, "text": "A great place with great staff and facilities!", "pics": null, "resp": null, "gmap_id": "0x888d1a80b55f2e23:0xa1e4ea442ed42e36"}
{"user_id": "114155862815188439474", "name": "John S", "time": 1548208113289, "rating": 1.0, "text": "Do not recommend this outfitter", "pics": null, "resp": null, "gmap_id": "0x888d1a80b55f2e23:0xa1e4ea442ed42e36"}
{"user_id": "109958274698872254203", "name": "Justin Wiles", "time": 1618428242479, "rating": 1.0, "text": "Absolute scam! I get harassed numerous times a day by buck masters. Told them a subscription is not something I could justify at the moment after finally answering. I received a magazine in the mail out of nowhere and called. A extremely rude lady named (Jamie) answers, claiming I signed up for the subscriptions and she also stated I need to pay the $150 or everything will be turned over to collections. What goes around comes around Buckmasters", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "110580803103598720550", "name": "Kirby Rogers", "time": 1568998725295, "rating": 5.0, "text": "Great place to see, but no gift shop. Wished Jackie would have been there!", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "108536660019743424365", "name": "Freedom Chicken", "time": 1525801128775, "rating": 1.0, "text": "Absolutely shady as all can be. A lady called me with some kind of \"offer\" and all I could think of is....how did you get my number....to which she replied I entered in a sweepstakes. So that's how they get their business. They have to go through shady backdoor methods to get your contact information. I will never do business with this company.", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "100010594973143665556", "name": "Luke Russell", "time": 1506615475469, "rating": 1.0, "text": "SCAM ALERT! If I could rate zero stars, I would. No, in fact, make that negative 150 stars. DO NOT EVER ANSWER THE PHONE FROM BUCKMASTERS OR ATTEMPT TO DO BUSINESS WITH THEM IN ANY WAY. It is the biggest scam of a company I have ever had the displeasure of dealing with. After one conversation on the phone WITHOUT signing up for anything, they started sending me bills to pay them for a magazine subscription  and threatening to send me to a credit agency. After nearly a year of back and forth they finally stopped asking for money, but now they regularly call me to ask again if I want the magazine subscription... again and again even though I have asked numerous times to be taken off the list. Now I just ignore them at all costs. PLEASE DO NOT EVER TALK WITH THEM or you could get roped into the same mess. Also as a point of advice for anyone struggling with the same issue, as long as you never actually gave them credit info (which I never did) they will not actually send you to collections. It's all empty threats to trick you into giving them money. Lord knows what they would have done if they ever got my credit info. I would like to see this company shut down.", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "113926441020715653551", "name": "Krucibal ERAH", "time": 1543938408727, "rating": 2.0, "text": "I worked here, I thought it was gonna be good, all the workers are nice, but the supervisor and the manager don't care about any employees, they treat u like a number and like ur disposable, if somebody leaves they laugh while u walk out and tell u they are better off. I been out sick a couple times with them and I live an hour away with little to no transportation and they fired me AND my brother for being sick and having problems getting to work. This place only cares about the money they already make enough of. Save your money and let this place shut down. It would be better for everyone since nobody there actually enjoys it! P.S I see better management literally anywhere else. I guess this is why they got sued a few years back.", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "102853279949083173666", "name": "Brad Crawford", "time": 1560325717536, "rating": 5.0, "text": "These guys & gals are great..gave us a detailed tour...Art director Ryan Noffsinger is an awesome bowhunter + does fantastic art work for Buckmasters ..& the man himself owner/founder  Mr Jackie Bushman is a hunting legend  & as nice & friendly a person ud ever wanna meet...", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "101310999751810485493", "name": "Mason Clark", "time": 1495732809077, "rating": 1.0, "text": "I have never given buckmasters my business. They got a hold of my phone number. I receive phone calls looking for Mike on a weekly basis for the past two years. I have explained to the representatives and managers that my name is not mike and they have the wrong number. I am assured I will not receive any more phone calls yet I still do. I have reported Buckmasters to the FTC on two occasions I am hoping this resolves my issue.", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "111970262492221169877", "name": "felicia franklin", "time": 1552848666813, "rating": 5.0, "text": "Have an amazing selection.  Not much they don't have.", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "101727990286113251361", "name": "Christy Phillips", "time": 1467397837411, "rating": 1.0, "text": "My MINOR son has been receiving threatening phone calls on his cell phone to pay $136.90 or he will be turned over to collection.  He registered for a free chance to win a hunt & this is what happens!  I have spoke with 3 ppl, emailed twice & its yet to be taken care of.  I would NEVER order this magazine after this idc how good it is.  I did not want to leave any stars but it would not allow me to post my review!", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "101124469375526003683", "name": "Pat Mason", "time": 1562963408974, "rating": 5.0, "text": "Great hunting organization.", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "113048706646863563595", "name": "Jerry Robinson", "time": 1425335092898, "rating": 1.0, "text": "SHAME ON BUCKMASTERS. \"GOOD OLE COUNTRY BOY HUNTERS\" TRYING TO BULLY SUBSCRIPTIONS ON PEOPLE. THEY SHOULD BE ASHAMED OF THEMSELVES. I DIDNT RECEIVE ANY GIFTS OR MAGAZINES AND THEY ARE WANTING TO SEND ME TO \"COLLECTIONS\". GREAT JOB BUCKMASTERS!", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "114193774015853834739", "name": "K Holtman", "time": 1463618948210, "rating": 1.0, "text": "You're an awful company!! You have been HARASSING my family for 2 months now to pay a subscription fee when we NEVER ordered your magazine. You trick people into believing they are signing up for a free \"trip\" & then surprise them with an invoice over $100 for a magazine they didn't even agree to!! You should be ashamed. Everyone BEWARE of this company...it is a full blown SCAM!", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "104641908009645682400", "name": "T Warbington", "time": 1299010509177, "rating": 1.0, "text": "These idiots call me twice a day 24/7.  Don't want to talk to them because from the reviews I have seen you are automatically signed up for a 5-year subscription by saying hello.  I got a great app on my iphone called iblacklist.  They are currently blacklisted from my cell phone which is just awesome!  They have about another 2-weeks to stop calling since I am on the federal do not call list.  Also, under the TCPA (Telephone Consumer Protection Act of 1991) if you request them to send you a copy of the TCPA laws and they refuse, you can sue them in small claims court and 99% of the time win.  You may win $250-$2000.00!  I encourage you to do so.  I will be.", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "105989880727309458656", "name": "Anne MORGAN", "time": 1517514281944, "rating": 1.0, "text": "BUCKMASTERS call me EVERY DAY! I have ask and told to be taken off their call list. They have phone numbers that come from any and every state. This is a prime example of HARASSMENT!!! Lawsuit waiting to happen.", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "117505256717249762661", "name": "Benjamin Selman", "time": 1553031243089, "rating": 3.0, "text": "Reoccurring sales calls get old quick.", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "105627729724697776424", "name": "Robert Sawyers", "time": 1466714619905, "rating": 1.0, "text": "DO NOT GIVE THEM YOUR PHONE NUMBER THEY WILL CALL FROM MANY DIFFERENT NUMBERS AND WILL NOT LEAVE YOU ALONE SCAAAMMMMM", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "105691238465450215421", "name": "Lane Thomas", "time": 1570729186849, "rating": 1.0, "text": "I filled out a survey and the people that work for you and your magazine need to stop calling me I was hunting yesterday and they called me like three times on my phone if anybody sees this that works for your company have them to stop bothering me", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "114068844112162058043", "name": "Brant Portner", "time": 1518195344998, "rating": 1.0, "text": "Whatever you do, do not give them your information.  They are spam and will call you daily.", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "111363511253130994727", "name": "Michael Ware", "time": 1521434815110, "rating": 5.0, "text": "I work here", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "118339113301843270304", "name": "firedancer 2597", "time": 1618879990826, "rating": 5.0, "text": "Amazing company", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "113818427363963691996", "name": "Corey Autrey", "time": 1449686647366, "rating": 5.0, "text": "Very nice people in customer service", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "106294311010440226882", "name": "Sylvia Graham", "time": 1528205723156, "rating": 5.0, "text": "Very woodsy", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "117007019025630184458", "name": "Game Manager", "time": 1485609144410, "rating": 5.0, "text": "Very friendly", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "112734776619597715460", "name": "Lusio Chavez", "time": 1467747337356, "rating": 1.0, "text": "This company is a joke, they'll call you more than a ex girlfriend hounding you to keep signing up for more subscriptions and try to sway you over with some cheap Chinese pocket knife which isn't worth that material it's made from.", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "112401117139551640339", "name": "Charles Hall", "time": 1475887459817, "rating": 4.0, "text": "A long-time customer of mine and generally just good folks.", "pics": null, "resp": null, "gmap_id": "0x888c2dc8157dd435:0xc82eccf6b515d830"}
{"user_id": "102243688199585538714", "name": "Ramonalesa Fifth", "time": 1616178508374, "rating": 5.0, "text": "I love this place I use to live here and I should have stayed here looking for a good place to go and camp with a view check it out one of the best owners you will ever meet a beautiful caring soul", "pics": null, "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "109168962694955633266", "name": "lydia lee", "time": 1551207256102, "rating": 3.0, "text": "Very nice place. It has a nice family feel to it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPTRd0kFivJSt2uzS8A1R38vI5Yg9klaeNvrP0P=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOMQBvcp1TRAimWhYSWR4JKyCvtI_NdpgsAhoBg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOKtrzoxyvuulnZOmqA0CdIK7e0le3VYTKYRGfL=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "104072022121275447786", "name": "Crystal Madru", "time": 1623751193791, "rating": 5.0, "text": "Great place to relax and unwind!", "pics": null, "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "111506625377798742913", "name": "KJ Aubrey", "time": 1596340623251, "rating": 1.0, "text": "The owner was friendly over the phone at first, but I feel that she could have been more up front about the nature of her place. That would have saved us a wasted 23 mile trip both ways. Waterloo is a beautiful place, but I would rather stay on the free TVA land than at this so-called campground. The campground is actually a trailer park with some spots for camping. We stay in many campgrounds, some better than others, but this is the first time we have driven through a campground and left. I could not even find the camp office to begin with and everybody at the trailer park was staring us down when we drove through.\n\nWhen I couldn't find the office, I called the owner back to tell her we had changed our minds. She did not answer her phone. I got a phone call later on from a different number and it was the owner. I let her know that her park was not what we expected and that we had changed our minds. She got an attitude with me and said, \"Thanks for letting me know. I waited for you for over an hour.\" I then informed her that I had tried to call and she didn't answer. I did not bother to mention that she wasted an hour of my time and the gas that I used to drive to her disappointment of a trailer park that she is trying to pass off as a campground. If you do decide to camp in Waterloo, I would suggest that you turn right on the road before you cross the bridge into town and stay on the TVA land. It is well maintained, peaceful and it is free.", "pics": null, "resp": {"time": 1596388937393, "text": "I am sorry that our campground was not what you expected. Our property is 2 businesses, a small campground on the water with bathhouse, boat launch, fishing dock. The main portion are Lake lots that we lease yearly for vacation sites. It's not unusual for people to turn in the wrong drive; I keep meaning to get new signs but since my husband died in March I've been trying to juggle the whole thing alone. After we spoke, I did see that you had called the office number, which is supposed to be transferred to my cell phone. So I called you at 6:10 and we both missed each other. I apologize for my shortness, I have no excuse for that except that 14 hour days, 7 days a week sometimes gets me overwhelmed.   I'm usually pretty nice.  Our campground is usually not full in the fall, and the weather is perfect for camping. If you ever decide to reconsider camping with electric, water , and hot showers, I would be glad to make up to you your \"wasted 23 mile round trip\". Thank you for your review."}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "111580044071031207746", "name": "Michelle McFall", "time": 1548566200904, "rating": 4.0, "text": "Great place for sunsets and sunrise over the TN river. And eagle watching !", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM4XQU-RnNk40g-ish4FgdnH4V6gbfKhZDe3KuT=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "107009208558358647785", "name": "Mary Morrison", "time": 1596397929775, "rating": 5.0, "text": "Been going to this campground for 13 years....it is like family and going home. We camp at many different campgrounds from private to state parks and they all offer different amenities.  At Hart it is shaded, beautiful views of the water, hot showers and friendly people...the owner treats everyone like family...we love Harts", "pics": null, "resp": {"time": 1596406455767, "text": "You are family! Thank you!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "116395176407479116374", "name": "RV Mobile Repair, LLC", "time": 1572718148990, "rating": 5.0, "text": "A beautiful place to camp along the Tennessee River. Everyone seems really friendly there.  If you're there and you need some RV work call662 me306 at0937", "pics": null, "resp": {"time": 1583441164687, "text": "Thank You!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "116497042075129356365", "name": "Lee Hemming", "time": 1552742282552, "rating": 2.0, "text": "We were greeted by the very helpful and friendly owner. The views are beautiful, however with the description and great reviews, we expected a little more. This is more like a rustic fishing camp. It was recommended that we not use the coffee maker and the microwave at the same time. Yikes! 30 amp service is old. Picnic tables need help. Grass sites. Also there was a dog roaming in the park that was unfriendly, so we didn't feel comfortable having ours out and about. Paid $17 for the night, a fair price, probably. With a few upgrades, this could really be a hidden gem. Grocery and dining not close, so bring what you need.", "pics": null, "resp": {"time": 1552757632542, "text": "Thank you for staying with us, Mr. Hemming. Your review is pretty accurate, upgrading our electric and some cosmetic work on the tables etc have been in our plans. We actually met with the Utility Company last year , and are still waiting on their approval of the plans . The campground sites were built in the 1970's, and RV requirements have definitely changed since then. We do have some 50amp service, I'm sorry I did not show you those sites. I hope we will be able to get to work on that soon, and that when we do, you will come see us if you ever swing south again!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "106657943049957080985", "name": "Fred Pearson", "time": 1547833590304, "rating": 5.0, "text": "The most beautiful location,  and the owners and the friendliest people you would ever meet anywhere.", "pics": null, "resp": {"time": 1583441218845, "text": "Thanks Fred and Darlene!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "101108458958246713864", "name": "Rich Singh", "time": 1505543727621, "rating": 5.0, "text": "Hart Park is the most wonderful place on Earth. I want to live there, the Hart's are the nicest people and it's a wonderful place to stay visit at once .", "pics": null, "resp": {"time": 1505603420575, "text": "Thank you, Richard!! Come Back Soon - we miss you!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "112044836098910936961", "name": "Sheila Gilbert", "time": 1527211783386, "rating": 5.0, "text": "Considering a purchase of a place here, it's looking like it's going to happen! I love the idea of having a waterfront summer place again.", "pics": null, "resp": {"time": 1527213688005, "text": "Thank you Sheila! We hope you and Rick decide to have your vacation home with us!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "103276936838777509212", "name": "Ricky Franks", "time": 1537204044561, "rating": 3.0, "text": "Great place for a family fishing and camping trip.", "pics": null, "resp": {"time": 1537288563048, "text": "Thank You! Hope to see you again soon!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "100929038730606830551", "name": "Cricket Hanback", "time": 1552663635354, "rating": 3.0, "text": "Great camping on lake in WATERLOO", "pics": null, "resp": {"time": 1552757066958, "text": "Thank you!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "104470303809770742935", "name": "Ramona Fifth", "time": 1517187524722, "rating": 5.0, "text": "I use to live here love being near the water I miss it.", "pics": null, "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "106853335721575062153", "name": "Carol Diane Poole", "time": 1534906501273, "rating": 3.0, "text": "Its a pretty place", "pics": null, "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "109867373327648303697", "name": "Donna Robbins", "time": 1541541111726, "rating": 5.0, "text": "Peaceful on river", "pics": null, "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "115309460698403558002", "name": "Kirt Daniel", "time": 1561778651390, "rating": 4.0, "text": "Beautiful", "pics": null, "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "115787910258258649224", "name": "Tammy Woods", "time": 1478556078765, "rating": 2.0, "text": "Not taken care of.", "pics": null, "resp": {"time": 1478563869440, "text": "I'm so sorry you found us lacking, Ms. Woods. When did you camp with us? We try to maintain our Campground  to please all of our campers.  I hope you will let us know when you camp with us again and perhaps we can go over your concerns and make your stay more enjoyable! Thank you for your input."}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "108691719219762204093", "name": "Marcie Minear", "time": 1618499509333, "rating": 5.0, "text": "Captain Ron is awesome!  He really knows his stuff!  He is the best of the best and I can’t wait to fish with him again!  If you’re looking for a fun night on the water, Night Shift Charter Service is the way to go.", "pics": null, "resp": null, "gmap_id": "0x889a1a737d0aa33f:0xac2c0442a5a54494"}
{"user_id": "103685896472846863771", "name": "Van Hodges", "time": 1623775902699, "rating": 5.0, "text": "Captain Ron is awesome and we had a great time fishing. We did the midnight to 230am slot.", "pics": null, "resp": {"time": 1623777284331, "text": "Thanks so very.much.  do appreciate!  Really.wnjoued fishin with you, and \"Lefty\".  Good times"}, "gmap_id": "0x889a1a737d0aa33f:0xac2c0442a5a54494"}
{"user_id": "102566041382377600446", "name": "Scott Cobbs", "time": 1618499640430, "rating": 5.0, "text": "Captain Ron Stone is an awesome guide and will put you on the fish!  Thanks Ron!", "pics": null, "resp": null, "gmap_id": "0x889a1a737d0aa33f:0xac2c0442a5a54494"}
{"user_id": "114288854556176835744", "name": "Riverrats Outdoors", "time": 1599247629583, "rating": 5.0, "text": "I have had the privilege of knowing and fishing charters alongside Ron Stone and can tell you there is not a better guy. Ron has always been willing to go the extra mile and is a great example of what a Captain and Outdoorsman should be. You will not meet a better guy. You will not be disappointed if you decide to book a trip with Capt. Ron I'm willing to bet my name on that! Keep killin it bro!", "pics": null, "resp": null, "gmap_id": "0x889a1a737d0aa33f:0xac2c0442a5a54494"}
{"user_id": "101420673624337674403", "name": "Zac R", "time": 1565537156523, "rating": 5.0, "text": "We had a great time with Captain Ron. If you're down in the Gulf Shores / Orange Beach, Alabama area his charter is definitely something you should check out. Our kids had a really great time. Captain Ron was wonderful with the whole family and it was one of the most fun things we did on our trip. Absolutely worth it.", "pics": null, "resp": null, "gmap_id": "0x889a1a737d0aa33f:0xac2c0442a5a54494"}
{"user_id": "106073797853287542616", "name": "Paige Waters", "time": 1598815957049, "rating": 5.0, "text": "Great night charter! Captain Ron is awesome.", "pics": null, "resp": null, "gmap_id": "0x889a1a737d0aa33f:0xac2c0442a5a54494"}
{"user_id": "104878074110410260437", "name": "Jimmy Oswalt", "time": 1596655141627, "rating": 5.0, "text": "Ron will put you a night of your life, Do not need to know how to shoot a Bow, he will teach you as the night goes on.", "pics": null, "resp": null, "gmap_id": "0x889a1a737d0aa33f:0xac2c0442a5a54494"}
{"user_id": "102158937372455634311", "name": "Jake Pin", "time": 1524444000870, "rating": 5.0, "text": "Capt.Ron is phenomenal. He will make you feel right at home even if you’re a beginner, and girls don’t be afraid! Ron is prepared for anyone, my younger sister was hesitant thinking she wouldn’t be able to pull back the bow much less hit anything. That was far from true as she had the best shot of the night. He has left handed bows and extras of everything. If you’re worried about the boat not being sturdy.. don’t. We were all shocked at the stability of the vessel and Capt. Ron’s skill of maneuvering it. He wants to put you on fish, & that’s what you need. He saved our trip! Our deep sea fishing charter with a large local marina was cancelled 1hr prior to departure.. so we found Night Shift charter & decided to try something completely new to all of us. Admittedly due to lack of options and time restraints as we were leaving the next morning. We gave Ron a call just 5 hours ahead of time and luckily he wasn’t booked that night & gladly took us out. Truly Customers for life! Booking another trip soon.", "pics": null, "resp": null, "gmap_id": "0x889a1a737d0aa33f:0xac2c0442a5a54494"}
{"user_id": "112601334919777340658", "name": "Keith Masingale", "time": 1466643192097, "rating": 5.0, "text": "WOW, Thank you Captain Ron!! My 2 sons and I had a blast. Captain Ron worked very hard to make our experience top notch.  Lot of rays, blue crabs and a few flounder. Captain Ron is very patient honest and straight forward, a real stand up guy. I would highly recommend giving Captain Ron a try!!!! We will see you next trip, we have a new tradition! 🐟", "pics": null, "resp": null, "gmap_id": "0x889a1a737d0aa33f:0xac2c0442a5a54494"}
{"user_id": "108609802090341725986", "name": "Ryan Parker", "time": 1503532163500, "rating": 5.0, "text": "Fun times and great thing to do on vacation. Very family friendly and captain Ron will answer all your questions and explain everything to you. He provides drinks and good conversations with a fun fishing trip.", "pics": null, "resp": null, "gmap_id": "0x889a1a737d0aa33f:0xac2c0442a5a54494"}
{"user_id": "118064700287827676797", "name": "Dean watson", "time": 1505739924867, "rating": 5.0, "text": "CAPT.  Ron did not disappoint... we found fish... Gigged them and shot them with the bows... and took them back to eat... was a great experience for the whole family !   would definitely do this trip again ...", "pics": null, "resp": null, "gmap_id": "0x889a1a737d0aa33f:0xac2c0442a5a54494"}
{"user_id": "114912852971862676145", "name": "cody bultsma", "time": 1556228727614, "rating": 5.0, "text": "Capt ron was a hack of a man! Sure made me laugh! Really new how to get you on the fish and get you shooting stright", "pics": null, "resp": null, "gmap_id": "0x889a1a737d0aa33f:0xac2c0442a5a54494"}
{"user_id": "106553736107658030986", "name": "Doug Temple", "time": 1536099122173, "rating": 5.0, "text": "Always an awesome time with captain Ron. Our annual bowfishing trip with him is something we look forward to each year.", "pics": null, "resp": null, "gmap_id": "0x889a1a737d0aa33f:0xac2c0442a5a54494"}
{"user_id": "103353060536035970303", "name": "Zack Kettells", "time": 1494811277043, "rating": 5.0, "text": "Captain Ron does a great job. Highly recommend for anyone.", "pics": null, "resp": null, "gmap_id": "0x889a1a737d0aa33f:0xac2c0442a5a54494"}
{"user_id": "101785322557944285495", "name": "David Thompson", "time": 1472884573646, "rating": 5.0, "text": "Just got back from our bowfishing trip and couldn't wait to write a review. Captain Ron was fantastic! We stuck five big flounder, one mullet, one catfish and five stingray. I've been bowfishing before but this was my wife's and brother in law's first time. The bows were new, well maintained and at a perfect draw weight. My wife had no problems at all and outshot me! The boat was comfortable and since Captain Ron only takes out parties of four or less we all had a lot of action. He was on time and very professional in setting up the charter. We had dolphins swimming all around the boat and had an amazing time. Captain Ron was very safe, polite, and great to talk too. If you have never gone bowfishing before, GO. It's a blast, and Night Shift Charter exceeded all my expectations.", "pics": null, "resp": null, "gmap_id": "0x889a1a737d0aa33f:0xac2c0442a5a54494"}
{"user_id": "110771739394823545975", "name": "Cody Kok", "time": 1556216013574, "rating": 5.0, "text": "Just went out last night and couldn’t say enough about Captain Ron. If we come down next year we are going to go again!", "pics": null, "resp": null, "gmap_id": "0x889a1a737d0aa33f:0xac2c0442a5a54494"}
{"user_id": "104271713085368527994", "name": "Cary H", "time": 1613957931392, "rating": 5.0, "text": "Terry, Stephanie and Ryan (with Jennifer) do a great job making your hunt a great experience.  They were very accommodating to myself and my son (11) we were unable to harvest a hog but that is no fault of racknine ..the opportunity was there , but the ability was not....", "pics": null, "resp": null, "gmap_id": "0x888d9b76628a2ac5:0x43d7d67e724f7faf"}
{"user_id": "112366146153218775647", "name": "Jared Pullen", "time": 1603747781098, "rating": 5.0, "text": "Great people and hunting experience.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP-XrfEkD30ud_7KpOEUnxhPYjS7IXA9psy80Cv=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888d9b76628a2ac5:0x43d7d67e724f7faf"}
{"user_id": "112560052905577914787", "name": "DONNA MANNER CLOUD", "time": 1595890252983, "rating": 5.0, "text": "Where do I start?  From the minute you drive in, you are welcomed like family!  The lodge is clean, cozy, and comfortable with everything you need.  And the food!  OMG...it makes my mouth water just thinking about it!  There is nothing better than coming in from a long day of hunting to a hot, home-cooked meal that's better than most expensive restaurant food.  Terry and Stephanie do everything to make you feel right at home.  And I haven't even gotten to the best part...the hunting!  Terry will go above and beyond to ensure you have the best hunting experience ever!  We will go back again and again because it is THE BEST HUNTING EXPERIENCE YOU CAN GET.", "pics": null, "resp": null, "gmap_id": "0x888d9b76628a2ac5:0x43d7d67e724f7faf"}
{"user_id": "103226076638292425425", "name": "James Miles", "time": 1570271534772, "rating": 4.0, "text": "We had a great time", "pics": null, "resp": null, "gmap_id": "0x888d9b76628a2ac5:0x43d7d67e724f7faf"}
{"user_id": "110240160449376149160", "name": "Jill Easton", "time": 1623617323788, "rating": 5.0, "text": "Planning a corporate retreat, wedding, meeting, and want it in a quiet, secluded  setting? White Oak is perfect. There is a large Pavillion overlooking the pond, a meeting room that will easily seat 50 and big western motif rooms with great beds.\n\nBreakfast is a combination of southern comfort foods like exceptional bacon, grits, eggs and seasonal fruit. Lunch includes salads with more hearty food like spaghetti and meat sauce. Did I mention there is a fishing pond loaded with giant bream and bass.", "pics": null, "resp": null, "gmap_id": "0x888cff3e47d090cf:0x2b8377c29e99b2ff"}
{"user_id": "101669925847941739831", "name": "Bob Robertson", "time": 1476111707743, "rating": 5.0, "text": "This is one of the most beautiful places I've ever visited. And for deer hunting, you just can't beat it! The hospitality of the Pitmans is unsurpassed. No better place for your next trophy whitetail deer hunt!", "pics": null, "resp": null, "gmap_id": "0x888cff3e47d090cf:0x2b8377c29e99b2ff"}
{"user_id": "105720328237822440417", "name": "Roy Washburn", "time": 1551383833979, "rating": 5.0, "text": "Beautiful facility, excellent hospitality and great hosts.  Thanks for a great time!", "pics": null, "resp": null, "gmap_id": "0x888cff3e47d090cf:0x2b8377c29e99b2ff"}
{"user_id": "106987233263543241784", "name": "Shawn", "time": 1537652466227, "rating": 5.0, "text": "Fond memories rekindled on this sacred part of God’s creation as we stayed there Auburn Game weekend (30 minutes from Auburn-AirBnb).  Owners Robert and Hilda Pitman are equally as charming in this historic Alabama hunting and fishing paradise. A word to the wise-use the printed directions from the AirBnb as the cell coverage is spotty at best-your navigator likely won’t get you there. Bring your finishing rods!", "pics": null, "resp": null, "gmap_id": "0x888cff3e47d090cf:0x2b8377c29e99b2ff"}
{"user_id": "109457970813210221498", "name": "Holly Macintire", "time": 1522479118511, "rating": 4.0, "text": "It's been 15 years since I was there last. It is still beautiful...regardless.", "pics": null, "resp": null, "gmap_id": "0x888cff3e47d090cf:0x2b8377c29e99b2ff"}
{"user_id": "106811915466315877134", "name": "Tony Oswalt", "time": 1512604757906, "rating": 5.0, "text": "Like my second home", "pics": null, "resp": null, "gmap_id": "0x888cff3e47d090cf:0x2b8377c29e99b2ff"}
{"user_id": "103222225668410421734", "name": "Tim Locke", "time": 1552389446255, "rating": 4.0, "text": "Nice place to hunt,I love it there, not many other people hunt the area like some WMA", "pics": null, "resp": null, "gmap_id": "0x8887bad83f77bc8d:0x626c68fdb9070389"}
{"user_id": "109295079943262153067", "name": "Rabbitt Staib", "time": 1614191365204, "rating": 5.0, "text": "First time, good time. The entire team here at Cameron was very accommodating the food was great the hunts were excellent. Plenty of quail, and everyone in my group was quite satisfied. Nice meeting area in the back with a fire pit. I really can't say enough about this place. Jonathan taught me quite a lot, and everybody was very safety-minded. I really can't wait to come back here again. I highly recommend this place.", "pics": null, "resp": null, "gmap_id": "0x88842cfbefe002fb:0x31e35d3f452bb2b4"}
{"user_id": "105635099160658765544", "name": "Clayton Hudson", "time": 1556833549186, "rating": 5.0, "text": "Fantastic hunting", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO0-xIKkKlkS0ixhGD_UALsN7Dptm7WxfnxWMzq=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88842cfbefe002fb:0x31e35d3f452bb2b4"}
{"user_id": "109527333767676149753", "name": "Randy Richesin", "time": 1613380292429, "rating": 5.0, "text": "Had a wonderful hunt everyone so nice; food was amazing ;", "pics": null, "resp": null, "gmap_id": "0x88842cfbefe002fb:0x31e35d3f452bb2b4"}
{"user_id": "112319848555924986653", "name": "Charles Hollingshead", "time": 1607828046823, "rating": 5.0, "text": "Great hunting,great staff,and great fun for the family young and old", "pics": null, "resp": null, "gmap_id": "0x88842cfbefe002fb:0x31e35d3f452bb2b4"}
{"user_id": "104747018830096457804", "name": "Bill Blair", "time": 1548694540318, "rating": 5.0, "text": "This place is first class in every way. I'm almost 73 years old, and I've been bird hunting since I was too young to carry a gun. I'd follow my daddy, and I'd usually find a good stick to carry, and for a 7 year old, that and my imagination was all I needed. At Cameron's, there are so many very large coveys of quail, it is nearly impossible to estimate how many birds we found. The pointing dogs were very good, and the Boykin spaniels were an absolute pleasure to have there to work for us.  Oh, and we can't forget the meals we had prepared for us. Breakfast and lunch were absolutely delicious. The best quail and gravy I have ever eaten. Great family owned and operated business. They made me feel like I was family. I told our guide that that day of hunting was the most fun that I had ever had with my clothes on!", "pics": null, "resp": null, "gmap_id": "0x88842cfbefe002fb:0x31e35d3f452bb2b4"}
{"user_id": "104308497481224632444", "name": "Isaac Russell", "time": 1616108152929, "rating": 5.0, "text": "Good place", "pics": null, "resp": {"time": 1616196195188, "text": "thanks ole buddy"}, "gmap_id": "0x88842cfbefe002fb:0x31e35d3f452bb2b4"}
{"user_id": "103066679532123662668", "name": "Chad Kozlowski", "time": 1519841680868, "rating": 5.0, "text": "Thanks again to Cameron Quail Farms for another great hunt this year. My (83 year old) Grandfather and I have visited back to back years and have enjoyed a great hunting experienced in a Family environment. The Cameron family and their staff are amazing people and will treat you like one of their own. Five star hunting, lodging, food, experience and more.", "pics": null, "resp": null, "gmap_id": "0x88842cfbefe002fb:0x31e35d3f452bb2b4"}
{"user_id": "104730278064493356230", "name": "Leighton Boggs", "time": 1514506351469, "rating": 5.0, "text": "Great good time!  Killed alot of birds, ate some amazing food and made some good memories. We are sitting by the fire telling stories now. 35 degrees", "pics": null, "resp": null, "gmap_id": "0x88842cfbefe002fb:0x31e35d3f452bb2b4"}
