{"user_id": "106948672167918902874", "name": "Shelby Anne", "time": 1562727656351, "rating": 3.0, "text": "Just passing through didnt stop to check this place out looked nice though", "pics": null, "resp": null, "gmap_id": "0x888a544896376d05:0xa431878d6a61f845"}
{"user_id": "106271567645637328629", "name": "Dave T", "time": 1621164463442, "rating": 2.0, "text": "Super nice staff and solid accommodations but not seeing deer for three days in January for that kind of $$ is ridiculous. The lodge was full and nobody even shot at a deer. Head to Texas instead for the same money.", "pics": null, "resp": {"time": 1621278929236, "text": "Dave is accurate on his review.  The deer did not move at all for him on his trip.  Overall for the three days he was in here, they did not move very well.  We took a few deer those three days but nothing worth talking about.  One of the guys in the group with Dave saw an 8 point but was small.  Some times the deer do not move very well.  That is one thing, if we could find a way to change, we would definitely change.  Sorry to let you down."}, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "112966380165222051041", "name": "Cla Parker", "time": 1612480872622, "rating": 5.0, "text": "Can't say enough good about this place.  When I pictured a true hunting lodge, Master Rack was that place.  The entire experience was top notch.  The accomodations were great, the guides and staff were awesome, and the food was out of the world good.  I was there on a 3 day hunt and my wife accompanied me as a non hunting guest.  While I was hunting my wife stayed around the lodge and was treated like a queen by the entire staff.  When she wanted to sit a stand with me, the guide went out if his way to make it happen.  My hunt was successful with a buck and a doe and we are already planning out next trip.", "pics": null, "resp": null, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "116797559074258607840", "name": "Randy Veliky", "time": 1607548481341, "rating": 5.0, "text": "The guides go above and beyond to make sure every customer has THE BEST experience. The food, accommodations, and stands are all top notch. You may go there a stranger but you will leave a friend. They made my first deer an experience that I will never forget. Can't wait to go next year.", "pics": null, "resp": null, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "117292446975355398868", "name": "Robert Bone", "time": 1612804844158, "rating": 5.0, "text": "We had a blast. Food was great and saw plenty of deer. Me and my GF were able to harvest a 3.5 year old 7 and 6.5 year old 6. Our guide Clint was awesome as well as the owner Steve. Had a great time.", "pics": null, "resp": null, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "107793328579724857604", "name": "Katelyn Moore", "time": 1609425782817, "rating": 5.0, "text": "What a great experience.  Awesome people, first class lodge, beautiful country and a variety of hunting locations.  Everyone there was extremely helpful and had a service mindset.  We are already planning our next trip up there next year.  We have plenty of meat now for 2021.  First rate operation.", "pics": null, "resp": null, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "109746114192634371443", "name": "steve mcaward", "time": 1615827414980, "rating": 5.0, "text": "Great Hunting, Food was good , guides were awesome. Good times every night in the lodge or at the fire pit. Our party of 8  is booked again for Jan. of 21, cant wait. Steve runs a great operation.", "pics": null, "resp": null, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "116283175616015068460", "name": "David Mathis", "time": 1607740827934, "rating": 5.0, "text": "Have been going to Master Rack the last 3 years and its been great each time. My dad is older and can’t get around as well as he used to (or climb) and they have plenty of box stands on the ground that he could easily get in. They even carry his gun and backpack to the stand for him. He’s had a blast each year. We just got back from hunting this November and I killed a nice 9 point ( and 2 hogs) on a greenfield and saw a lot of deer. The food is outstanding ( way better than what you’d expect), the lodging is good and the guides go above and beyond. Steve puts a lot of work into his property .We’ve had both Gomez and Larry as guides and by the end of the hunt there almost like friends. You have a shot at killing a big deer (my friend missed a 130-140” inch deer in 2019 in late January chasing a doe). Great place and just a lot of fun.", "pics": null, "resp": {"time": 1607794374954, "text": "Thank you David.  Enjoyed yall as usual.  Have a Merry Christmas and a Happy New Year."}, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "115319090217389201178", "name": "Mike Kendrick", "time": 1523179910482, "rating": 5.0, "text": "Master Rack Lodge was a great experience. If people are important to you, you will not find better folks than Steve and his bunch. Thank you Steve for your friendship and hospitality. We really appreciate all you did for us on our visit.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipODl51z10hUMNbNXbSAQZt6gZNJ2r487dqkmq0b=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPNBWdjkIv0w9PX9Tz_S21OxUmuyQ9yDkzpba05=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMkECvlQ8aBpLdXc_BfECJmfFVTNWbm1s_84Ev6=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "110989810438851663201", "name": "Bob Toole", "time": 1579909537430, "rating": 5.0, "text": "This was my second hunting trip and first deer. Master Rack Lodge is awesome. The staff and hunters who were there was a amazing group of people. Gomez was our main guide, Chad, Zach and Mr Steve were involved. Their excitement about what they do was inspiring. Knowing that I had never harvested a deer, much less a whitetail, they made sure to explain things efficiently. My first morning of observing this amazing land while waiting for the peace to be broken up by deer activity, was only ruffled by a huge Gobbler. It made its way from the woods to a sunny spot and opened its majestic wings and tail. What a picture I will never forget. It was about 28 degrees that morning. Then we went back to the lodge and ate some warm breakfast, hot coffee and great hospitality. While engaged with conversation of Mr. Chad he informed me that at the location of my evening shoot there is a buck hanging out by the crossed pine trees. The buck was strange, as one antler was taller than the other and not a normal looking rack. He said good luck. This really impressed me as I realized these guides must study the land so they are better equipped to guide us properly.\nWith the morning finished we returned to a great house across from the lodge. Full kitchen, more coffee, very comfortable bed , heaters, clean bathroom, hot-hot water. My buddy went back out early, I was picked up buy Mr. Gomez. He said Mr. Bob you don't shoot anything on the couch. So I got my butt up got dressed and jumped in the truck. Mr. Gomez talking to me , answering my questions (Probably heard the same questions 1000 x's) . We arrive to the green field at a shooting house. As usual Mr Gomez opens it and ask for my gear , places my gear safely in the box. Then he looks at me and say's \"your going to see a lot of doe's, WAIT for the buck\". For some reason that stuck in my head. Now i am no spring chicken. But I do know when it comes to hunting I am a novice, uneducated beginner! Very willing to learn. This learning is made easier when you trust the teachers. Believe me all the guides and the outfitter are men of virtue. So I climb in the stand 1:30 in the afternoon, first day. The peace and quiet is unforgettable! the picturesque beauty of it all is worth the event. Between 4:10 and 6:00 4 doe and a buck. Yes Sir the same buck  Mr. Chad told me about and Mr Gomez guided me on. The first 2 doe arrived on the far end of the green field then the other 2 doe's popped up 50-60 yards to the right followed by the buck. I put the buck in my sight as it moved in on the back side of the 2 doe's.  I moved my cross hairs to the front of the 2nd doe and waited as the buck moved into the cross hairs and BAM! I 1. waited for the buck. 2. stalked it (Kind of). 3 clean drop shot... Then I lit up like a hooked Dolphin:) . Damn I hit it! I'm so excited What do i do. So i grab the phone thinking I'm calling Gomez. Hey Gomez I got a buck, they reply No Gomez here! I look at phone and found Gomez so i texted him \" Got a buck, I did it I waited for a buck! Gomez says where did he go, I said nowhere he dropped where i shot him. He said don't move we will be there. Then Gomez, Mr Steve and the dog show up and are smiling bigger than I am (Not Really). Mr Steve had me get behind the buck and pose for a picture. They loaded it up and the rest is history. The guides and some very patient guest all heard this story, i think i told it 10-15 times today/:).\nThis title should be \"waited for the buck!\" Thank you! Mr Steve and your team. Please say thanks to the entire staff you are truly the best. Hopefully I will get to hunt there again. God Bless!\n\nPS. Thanks Chance Walsh and my Son Dean.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPbQsnsfbvWB5iGaChg5HhURF-OP1lOwIzAitHE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO2ezoSuRLUO4VzfS_OLvqdjE6T0oQ9K-W_Iw5C=w150-h150-k-no-p"]}], "resp": {"time": 1584636622699, "text": "Great Guy!!  I really enjoy seeing a grown man get more excited than a youth hunter.  He was so jacked up when we got to him he was still a little shook up.  I love it.  This is the reason people love to whitetail hunt.  It is a special connection between the hunt and harvest.  This animal served a awesome purpose for an equally assume human.  I wish every hunter would get this excited.  It makes our job a lot more pleasurable.  Congratulations on a awesome buck Bob.  See you again soon."}, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "101906464868133159784", "name": "Ethan Howell", "time": 1567785365280, "rating": 5.0, "text": "We went last season with a group of 6 around New Years. Stayed in the private house. The food was great the entire trip. Our guide Morgan made our trip even better. We ended up with 2 does and 1 buck. Not bad considering we had a ton of rain before we arrived and the rut hadn’t kicked in. We will be doing another trip this season during the rut hoping for some more bucks. Thanks to Steve, Morgan and everyone else at Master Rack. I’m looking forward to our hunt this season.", "pics": null, "resp": {"time": 1567787619208, "text": "Thank you Ethan.  You guys were great.  We look forward to having you back.  Thanks for the post."}, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "114246525499380042212", "name": "Steve Murphy", "time": 1580157005694, "rating": 5.0, "text": "Absolutely one of the best trips I’ve been on, the home cooking was the best, Steve and Chad were great they had everything I needed covered from day one. We did some all day hunts, I had food and water ready to take with me. I saw 29 deer on morning hunt. Awesome place and I will be back!!!", "pics": null, "resp": {"time": 1584636710126, "text": "Enjoyed having you Steve.  Another hunter that can make a good shot.  It was a pleasure spending time around you.  Hope to see you again.  Thank you for the review."}, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "109422360770990025349", "name": "Ken Huebert", "time": 1581877256204, "rating": 1.0, "text": "It was a joke! I was going to come with 2 other friends! I had chance to do at last minutte,so I did,first off it is real easy to say I'm sorry after you take everyone's money! Small deer if any, offer pigs and other game,which seen none! It's about money plain and simple,so sad people lie and cheat you after they take your money ,I could not look anyone in the eye if I lied like that sad sad sad never do a paid hunt again in my life", "pics": null, "resp": {"time": 1584650806493, "text": "This is about par for the course right here.  Since you took the time over a year later to send this wonderful review of our place, I will relay the circumstance to the ones that read these reviews.  I personally guided Ken.  The group saw a lot of deer and everybody else in the group harvested bucks and does.  Ken was sitting in some of the best stands and was still getting shut out or seeing just a few deer.  I felt bad for him.  We hate to have hunters not seeing many deer.  It is one thing if the movement is slow and every hunter is struggling.  It is a whole different story when the hunters around you are seeing piles of deer and having a great harvest.  Some people apparently need to find another hobby.\n\nIt troubles me to respond like this but this is flat pathetic.  Ken Huebert didn't even finish his hunt.  Half way through his trip he got discouraged and left in the middle of the night without even saying bye.  He left a great note on his door that read \"Thanks for the food\".  Wow.  I will tell you though, the other hunters in the truck were glad he left.  World Wide Web?  Its a great place to spew propaganda.  No lodge is perfect.  No human is perfect and whitetails don't move all the time.  I would advise everybody to take a moment and absorb Gods creation not just in the woods but everywhere everyday.  Life is too short to deal with this mess."}, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "100254746598018443462", "name": "Tab Verdeja", "time": 1517171185803, "rating": 5.0, "text": "Great time at Master Rack Lodge! The service, food, and accommodations were top notch. We went with a group of four guys from Miami and saw deer every single morning and afternoon. Steve was a great guide and very knowledgeable about Whitetail deer. We got to shoot our first Whitetail! Couldn’t have asked for a better experience. Already planning to come back next season. Tree stands, hunting grounds, and lodge exceeded all our expectations!", "pics": null, "resp": {"time": 1517335394247, "text": "Thank you Tab.  Look forward to seeing you guys again.  Great group with a great attitude.  Pretty good shots too when you shoot.  Should have told them about the big buck Ha Ha.  Have a great year."}, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "103469369412084511065", "name": "kevin simmons", "time": 1503348303228, "rating": 5.0, "text": "Excellent experience!!!  I have hunted the last three years at Master Rack Lodge, and it has been incredible every year.  Steve and his team are  definitely focused on their clients' experience from the minute you arrive at the lodge until you pull out of the driveway heading home.  Chad, Ken, and the rest of the guides seem more like hunting buddies than staff, and Ms. Roberta's southern cooking is as good as it gets.  Customer Service here is first class.\nI have had great success connecting with mature whitetails at Master Rack, and have seen many, many deer at the various stand locations the guys have set me up in.  This is a place where you can be patient and selective.  The number and the quality of deer on their property is very impressive.\nThey have many different hunting options from ground level box stands over green fields, to lock-on bow stands in thick cover creek bottoms, and everything in between.  I'm pretty sure I have not sat in the same stand twice since I started coming to Master Rack, and they have all been great as far as I'm concerned.  The property is beautiful.\nSteve and all the guides have a great deal of expertise when it comes to deer hunting, and they have always seemed focused on making sure I was hunting in the type place I wanted to be.  Evenings around the lodge fireplace are a good mix of relaxing from today's hunt and strategizing about tomorrow's.\nI can't say enough positive things about my experience here, and I hope to return for many deer seasons to come.  I would highly recommend Master Rack Lodge.  Great job all the way around Steve!", "pics": null, "resp": null, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "101961472531954724064", "name": "Chase Henderson", "time": 1518708927508, "rating": 5.0, "text": "The guys at Master Rack Lodge are exceptional at what they do. Me and my dad were there for a 3 day hunt and enjoyed every second of it. The stands/shooting houses are primetime and the service is top notch. They make it clear up front that you're not guaranteed to bag a huge buck, and they can't bring em out on a leash, but what they do is put you in great spots to have a chance at one. The guides are all helpful, accommodating, and fun to be around and the atmosphere is very laid back. The rooms get the job done and the food is outstanding if you like southern cooking. I can't thank the guys at Master Rack enough for facilitating an excellent few days for me and the old man to spend some good quality time together! Oh and I harvested my first buck! Quality outfit here.", "pics": null, "resp": null, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "101212743544811714751", "name": "SD Boyd", "time": 1578320750454, "rating": 5.0, "text": "My son and I went on a three-day hunt during the first week of January. Our only complaint is that Steve was not able to adjust weather conditions for two of those days.\n\nMy son saw 11 does one day and several during the trip. I saw five. I didn’t get to kill a buck, but my son did get his first one. This was all that I really cared about. I saw a hog and a bobcat during the last hour of my hunt. We’d all love to come home with state records. However, a lot of kids came home excited about getting their first deer. None of them were anything to be ashamed of. One kid shot his first deer and got a very nice bobcat, too. There are some solid bucks in those woods and the guides are highly motivated to get their clients a shot at taking one home.\n\nSome of the negative reviews were harsh. I couldn’t believe that there was some negative feedback regarding the food. I’m 6’ 3” 270 and I like to eat. I never left the table feeling hungry. Every person that I spoke with was also very pleased with the food. Master Rack Lodge isn’t Ruth’s Criss Steakhouse. If you don’t like Southern food, you aren’t going to be happy. However, all the hunters did look forward to two very good hot meals when we came back from hunting. Cold cereal, coffee, and fruit is available before the first hunt of the day. If you need more to get you going first thing in the morning, bring a few protein bars.\n\nI was particularly miffed at the comments about the guides. These guys aren’t just chauffeurs. If they aren’t in a tree stand with a client, they aren’t sitting around watching TV all day. They are scouting and prepping for the hunts. My son and I have limited experience, so I paid Morgan to serve as a guide for my son’s hunts. He was the difference between success and failure. He served as a good instructor for my son’s class in whitetails 101. I highly recommend utilizing these guys especially if you or your partner aren’t a seasoned hunter. My son’s first ever buck was a nice 130 pounds. We had to leave right after the hunt and Morgan quickly prepped the deer and handled the inexpensive European mount with the local taxidermist. Tip these guys!\n\nThe rooms were comfortable, but we didn’t spend much time there. They have DirecTV in all the rooms, but we tended to socialize in the lodge area until we went to sleep. When we were in there, the entire staff was constantly making sure that our glasses were full. Socializing was easy and I quickly made three friends for life.\n\nI would suggest that you make sure that your gear is adequate for rainy conditions. Precipitation is unpredictable in Alabama, but it tends to occur in windows. If your guide thinks that the weather permits a woods hunt, you may end up miserable if you get hit with a short shower. A lot of us thought that we had “waterproof” raingear. We didn’t. The first half of day one was miserable. Also, I like to shoot a .45-70. Using something that kills bears was probably a mistake. On my last day, I saw a bobcat. I would have taken it, but I’m not a taxidermist and I wasn’t sure how much of it would be left for a full body mount. Next time, I’ll bring a .243.\n\nIn summary, this hunt provided what I wanted. My son will probably take many deer home, but he will never forget this experience or what he learned from his guide. I’ll be back in a couple of years, but next time I’ll come during the rut.", "pics": null, "resp": {"time": 1584635807748, "text": "Steve.  We really enjoyed having you guys and appreciate the review.  It seems as though a lot of times the only time people review is when the hunt did not go their way.  This business is tough to produce quality animals all the time if not impossible.  It is important to know your area and what size animals to expect prior to picking a state to hunt.  I wish everyone that enjoyed their hunt here would take a minute to leave a review.  This site would be full Im sure.\n\nWeather definitely plays a big role in how hunts turn out.  You guys could have had the same experience in the rut as far as weather.  It seemed like it rained here every other day.\n\nWe are always proud to see hunters finally get that first buck.  Brandon was a trooper and a good sitter.  He was also a good shot.  That is extremely important, especially when you consider we had 82 misses this year.\n\nThank you again for the review.  I hope to see you guys again."}, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "109587717112733493107", "name": "Ernie Ashe", "time": 1578653949208, "rating": 5.0, "text": "Great service....great hunting.....great people.......we will be back!!", "pics": null, "resp": {"time": 1584635837970, "text": "Thank you Ernie.  It was a pleasure.  Thank you for the review."}, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "104268250753207618103", "name": "Nathan Florian", "time": 1503352618687, "rating": 5.0, "text": "If you are looking for a \"deer in a pen\" type hunt, this isn't the place for you....if you are looking for the best hunting Alabama has to offer, look no further than Master Rack!\n\nOur group has been hunting with Steve since 2014, and has since turned into a yearly \"corporate event\" for my company. The largest buck I have taken at Master Rack  so far is a 4.5 year old, 185 lb 9 pt that scored 146.\n\nThe food is second to none, if you are on any kind of a diet plan on gaining 5 lbs before you leave. The guides are courteous, knowledgeable and have been with the operation for many years. Clint and Clay usually guide for us and have always went above and beyond for my clients and I...that's why we keep coming back each year.\n\nObviously the weather and time of year play a factor, but plan on seeing deer when conditions are right. We have hunted during the rut and there are deer lined up at the cleaning rack, and during the early season and only see a few come in after each hunt. Either way, you will see that the stands and food plots are taken care of and the place isn't a \"hunter factory\" that cycles in as many hunters as possible.\n\nI would highly recommend Master Rack if you are looking for a quality hunt, southern hospitality and an overall great experience.", "pics": null, "resp": null, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "108716643259919453209", "name": "Nancy Giancontieri", "time": 1517238138134, "rating": 1.0, "text": "I am writing on behalf of my husband. It was his first (and last) trip to Master Rack Lodge. His hunt was January 21-24. He only saw 1 doe and 1 undersized buck during the entire trip. He was housed in a separate building where 3 bedrooms shared 1 bathroom. The food was terrible, not sure if it was because it was brought over from the main lodge. Do not know if others were served generic cold fruit loop type cereal for breakfast, as they were. Lunch and dinner were equally as bad. Although the guide did his best, there were no sigs of deer. 27 hunters were on site during those dates and it was reported that 2 does were taken. His group came home extremely disappointed by this experience.", "pics": null, "resp": {"time": 1517335076240, "text": "The dates that Mr. Giancontieri were in here were pretty slow as far as Whitetail movement.  There are several variables that were going on, but probably best to just say its whitetail hunting.  It isn't always great.  At this point we should be in full blown rut and as of today leaving this reply January 29th it is just starting to kick in.  We have seen and shot several bucks chasing does and it is glad to see the rut finally starting.  This is not normal.  Usually the 21st would be in the middle of prime time.  The \"reported\" harvest was a little better than described but still not up to our normal average for that time of the year.\nThe housing that was offered to the group was so they could be together in one place.  This was discussed upon booking.  We don't usually get a lot of complaints about this but here we are.  It is different than our normal set up.\nAs far as the food goes.  We offer a continental style breakfast early which is a light meal.  Yes it does include cereal.  The same layout for everyone.  Lunch is a brunch with typical traditional southern breakfast options.  Supper the same traditional southern style cooking.  Obviously our menu is not for everyone but rarely do we ever get a complaint and if we do we can offer a different selection of meals with out issue.\nWe don't guarantee any hunt.  We are fair chase and more and more it seems fair chase is not the way to go for everybody.  You can usually tell when the deer are not moving good based on reviews.  If movement is good and a nice buck is harvested, a review is usually avoided.\nWe do appreciate giving us an opportunity and are sorry to hear we did not perform to your standards."}, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "118052339241661608218", "name": "MICHAEL RODRIGUEZ", "time": 1517240500898, "rating": 5.0, "text": "I arrived at Masterrack Lodge with three  first time hunters.  All hunters had opportunities to shoot Bucks and Does.  The fields i hunted on were well groomed and well taken care of and All stands were in pristine condition.  The customer service exceeded all our expectations.  The Food, I only wish I had stuffed some of that fried chicken in my bag for the ride home.", "pics": null, "resp": {"time": 1517335131998, "text": "Thank you Michael.  Look forward to seeing you guys next year."}, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "108852381951289749777", "name": "James Jones", "time": 1571626439740, "rating": 5.0, "text": "My son and i had a great time tyvm Steve and staff see yous again from Canada.", "pics": null, "resp": {"time": 1584635135068, "text": "We enjoyed our first Canadian bow hunters.  I was a little intimidated on the booking of this hunt.  It is really difficult to compare Alabama bow hunting to Canada.  Our bucks just are not as big.  So we talked about it a good bit prior to their arrival and discussed the possibility of unique bucks with specific character racks.  They were excited about that so that gave me some relief of stress.  Well it turned out that they both had bucks that were in range that would have been 140 class bucks.  One had about 5 or 6 racked bucks in front of him and a really nice 10 that stayed where he couldnt get a clean shot.  He ethically passed on the opp.  The next morning took a nice 8.  The father of the group missed a nice 10 point on his last sit at the absolute last minute.  Turned out to be a really nice hunt for the group.\n\nYou never know how a hunt will turn out.  Some are good and some not so good.  This one turned out good and we are proud to represent Alabama bow hunting to the Canadians.   We look forward to having the group back."}, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "116250234697109701631", "name": "War Fox Gaming", "time": 1511292931366, "rating": 5.0, "text": "Fantastic stay with amazing people there. They were there from beginning to end making sure we had everything we wanted or needed. Thanks for the great memories Steve, Gomez, Clint, Clay, and Morgan. We will return.", "pics": null, "resp": null, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "114144134782011006239", "name": "Jacob Bourdeau", "time": 1553647767848, "rating": 2.0, "text": "It is with a fair amount of disappointment that I write this review.  I planned a 3 day hunting trip for 7 guys to MasterRack Lodge.  This was the first hunting trip like this that I had ever planned.  It was my idea to put the group together so I did the leg work.  My fear in taking the lead was not delivering when it came to our lodge.   I called several places looking for an opening.  When I spoke to Steve at MasterRack, he said all the right things.  10,000 acres of land, over 300 stands, deer populations of 90-110 deer per sq mile, 3 great home cooked meals per day.  It all sound good.  We were coming with a big group so we would be staying in a house off site, just our group.  So hey, it all sounded good.\nHere is what I learned after we booked and arrived at the house:  There would be 22-25 hunters hunting at the same time as our group.  There was a group of 22-25 hunter in for the 3 days before us and a group of 22-25 before them and so on.  The goal for Steve and his group is to put as many hunters as possible through his woods.  This is great if you don’t care about seeing deer!\nWe hunted Jan 31 thru Feb 3 so we were at the end of the season.  Our group of 7 killed 1 small doe, 1 smaller buck (spike horn) and a pig.  We saw a few deer, but very few for a place that was supposed to have 90-110 deer per sq mile.  The food we were served was great, the only problem, we we served 2 meals a day not 3?  When it came to our guides, they were great young guys, not great guides.  They served the role of taxi driver.  We tried to talk to them about stand, trail cam pics and deer overall.  Mum was the word.  10,000 acres of land and we were posted in stand a couple hundred yards apart?  We are expected to tip a guy $300 for a ride to a tree stand???  And then there was Steve, we never one time saw him.  We sent our guides to go pay him several thousand dollars in cash and he never saw it necessary to stop by the house 1/4 mile from the lodge to check in and say HI!  I guess they do things in the South a little different than we do in the North.\nAs a group, I never thought we would shot 7 big buck, but I did think one or two of our crew would at least see a nice buck........ I understand that they call it hunting, not shooting.\nAs a bunch of guys we had fun.  We joke, laughed, drank some beer and made memories that will last a life time.  As a group of hunters, we will hunt again, just not at MastRack!", "pics": null, "resp": {"time": 1554225418336, "text": "Thank you for the review.  This is one review that was deserved to a degree.  I have felt regret for some time over not stopping by to visit with this group of hunters during their stay.  I like to take time to get to know our hunters as much as possible.  A lot of time it can be limited for the amount of time our hunters spend in the woods.  But on this occasion it is definitely one that I dropped the ball on.  I am sorry for allowing this to happen.  It is not normal and I do apologize.\n\nThere is one thing that bothers me though and that is the number of hunters that is claimed to be running through our operation.  This group booked late (around Christmas).  At the time we were booked for the month of January and had been booked for a while.  I noticed that the private house was not being used that weekend.  The end of January is normally a very good time to be hunting our area.  We have taken a lot of big deer in late January to early February.  So, I offered this option to the group and didn’t see it being much of a problem to go a little heavy for those days.  However, these are not normal numbers.  We usually average around 20 hunters in camp during the rut.  We run 2 teams and split the property so it puts around 10 hunters hunting approximately 4500-5000 acres each.  The dates prior to this hunt we had a total of 21 hunters in camp with 4 of those guys staying at the private house.  The dates after this hunt we had 10 hunters in camp and nobody staying in the private house.  We don’t overhunt our place.  The perception is always misconstrued when we have a heavy group and the deer do not cooperate.\n\nOur population is very healthy and is between 90 and 110 per square mile.  We are also located in the #1 county in the state of Alabama and have a consistent harvest rate of 50+ bucks per season.  We run population counts each year to calculate management policies.  Sometimes you can hunt and it seems like we have 130 per square mile and sometimes you can hunt and it seems like there are only 40 per square mile.  Deer movement is always going to be up and down.  It is always unfortunate when our hunters experience a slow movement pattern.\n\nI have been here 22 years and we have always done our meals the same.  We offer a light continental style breakfast (cereal, muffins coffee etc) a breakfast after morning hunt and a country style supper after the evening hunt.\n\nOne more point to note is one of the guides that was assigned to the group was in training and the other a season guide.  Although it was his first year at Master Rack, we were assigning his stands for him during this trip.  We were giving him first choice on areas.  His knowledge base as far as stands and what direction the deer were coming from and what had been seen in the area was, for sure, limited.  This is not normally a problem but with me not taking the time to visit with Jacob and his group and explain all of this to them, I can see where this turned out to be an issue.  Once again, this could have all been resolved if I wouldn’t have dropped the ball on visiting with the group.  I take responsibility for that.  I just didn’t want it to be misleading and our entire guide staff being misjudged.  I truly regret that I didn’t do a better job with this group, especially a group that was traveling all the way from Vermont.  Although it will not fix this one, I can assure you this will not happen again.  God Bless."}, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "102799557385495126746", "name": "David Mullis", "time": 1547778943615, "rating": 1.0, "text": "MasterRack Lodge was a disappointing hunting experience. We had a group of 9 experienced hunters go on a 3 day hunt from Jan.13-16.  This is prime pre rut/rut activity for deer hunting in Alabama.  The weather was low 30’s and the high in the low 50’s, moon phase was excellent for deer activity. There were 2 legal bucks seen and one killed. One of our hunters did not see a deer during our 3 day hunt, the more disappointing part is our guide did not seem to care that he wasn’t seeing any deer. I saw 8 deer during our stay, one spike and the rest does. Almost every tree stand we were sent to is about 30 yards off the main road over looking a food plot, and there is generally another stand and food plot no more than a couple hundred yards away. I feel MasterRack Lodge is designed for first time hunters, not experienced hunters. The food was good. The private cabin we stayed in was nice but one bathroom is difficult with 9 guys. MasterRack Lodge offers a hunting experience but lacks the quality buck hunting we thought we were paying for.", "pics": null, "resp": {"time": 1552410502178, "text": "This review is sad.  A one star rating basically says the place was terrible on all levels.  Mr. Mullis... what a shame.  This is the type of stuff that makes an outfitter shake his head.  Since the dialogue was opened up I will voice my reply.\nTHE HOUSE SITUATION:  Your group booked knowing there was only one bathroom.  It was made VERY clear on several occasions. We opened up another bathroom downstairs by ME moving out of my lower level quarters just for your group and you never used it.\nTHE HUNTING:  Overall, deer movement was pretty descent.  We recorded over 500 does and close to 100 bucks seen. We harvested 9 bucks and a bunch of does and saw a couple of bobcats including 4 misses and a wound over the three days they were at the lodge.  I think that is pretty good seeing the deer were still NOT Moving spectacular at all stands.  Mr. Mullis was correct with the number of deer he saw. ??  Their group saw a little over 100 does and around 20 bucks, most bucks young.  The bucks they harvested were all immature bucks.  The one buck we let slide was a 2 year old 8 point.  To be 9 \"experienced hunters\" They sure paid a lot of money in fines as well as breaking rules.  This usually stimulates a ONE star review.\n\nTHE ROADS:  Our place has a very good road structure throughout the property.  Between the roads and the firebreaks It makes everything accessible for the most part.    These are the only roads I can think of that he would be talking about.\nTHE GUIDES:  Our guides take very good care of our customers.  It can be a little embarrassing if one of the guys in a group is not seeing any deer.  However, there is never a time when the guide does not care.  And if there is, bring it to my attention and I will send him packing.  We are all about customer service.\nMY RATING:  Since outfitters never get a chance to review their hunters, I will take the time to review this group:  I rate this group as a 2 star. (Generous huh)  Seemed like a nice group.  However after breaking rules by shooting at deer on the way to the stand, that me and the guide and Luke ( the trail dog) had to chase down and finish off just to find out it was illegal too.  Then be accused of swapping the deer to make them pay more money in fines, shooting deer that they knew would not qualify and wounding and missing does, racking up fines of around $1700, it sure makes you question what someone means by \"experienced hunters\".  I would like to think that all people are good and fair and honest.  However, going online and leaving a one star review for a lodge that obviously does not deserve it proves to me that some just are not.  Now if you want to rate whitetails on how they move, that would be more understandable.  What has the world come to???????"}, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "103464231572653918765", "name": "Robert Cosmos", "time": 1548208640968, "rating": 5.0, "text": "Mr mullis\nI have been going to master rack for about 15 yrs now have killed some nice deer have been and not killed any deer . Weather was not right moon but that is why it is called hunting. I hunt all over the country my main place is Fredonia ks where I have harvest some 190 and up. I am a bow hunter also. I have stayed at the bat house which I am positive steve told you a head of time that there is only 1bath room. I am willing to bet you all wanted to be together so that was the best option. As for the stands almost all of there stands are in the woods with some by the Rd but Definitely not 30yds away more like 100 or better. After seeing your review I would have to say you or someone in your group probably got fined for shooting a small buck or a button happens to the best of us but master rack is a family style hunting lodge and you had to know what you were getting into when you called because steve explains everything Straight up. As for the right being on the road still is an on right now and probably won’t kick in till the end of January maybe the first week of February so no alabama wasn’t in the middle of the peak right yet. I would say not knowing where you come from that maybe you just don’t understand how dear hunting works but you’re not always going to see Deer you know I was going to shoot a big one but you are going to get good food you are going to have a good time and if you don’t I do believe it’s because you made it that way. Master Rack is an exceptional lodge that caters to families and young kids if you want more experience maybe next time you might want to go to a high fence where you know you gonna be able to shoot a deer that’s panda bear chases it happen that way I’ll experience hunters know this.", "pics": null, "resp": null, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "107891976431932338955", "name": "James Harris", "time": 1549828508155, "rating": 5.0, "text": "Just left Master Rack Lodge without a deer but did so by coice guide Gomez was 1st class . Saw deer most of all had great time hearing hunting stories hanhing out with my Dad & Brother Steve & his crew accomidations were great & Robertas  cooking was to best. We will return again . It is a fair chase hunt it aint all about the kilking.", "pics": null, "resp": null, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "113108920582406815798", "name": "John McBride", "time": 1517248099174, "rating": 5.0, "text": "Hunted with MasterRack Lodge the week of 1/15/2018 – 1/17/2018 and had a great time. Our guide Clay was excellent, always had a positive attitude and clearly knows about hunting Alabama Whitetails. The other guides and staff, Larry, Chad, Gomez and the rest, really made an effort to look after you in the field, the lodge and the skinning shack (if you were lucky enough). The outfitter Steve was great to talk to and accommodating with a last minute addition to our group. All the meals were great, prepared by Miss Robermto??, she accommodated everyone’s special requests. The lodging was fine, we were in the separate house, which our group preferred. It was quiet and all you could ask for when hunting.\n\nTraveling, from Naples, FL and upstate, NY, we had 5 hunters in the group ranging in experience and age (mid 30’s – 70’s). Though we arrived right on the cusp of the rut, the weather shut everything down. Nice weather the first day, the second day turned below 20F, winds 15-20mph, and 100% humidity. The third day more of the same but with 1-2 inches of snow on the ground, the snow improved visibility but didn’t help with the deer moving.\n\nTwo does were taken in our group the second day. I saw eight deer that day and probably missed others, at least three were bucks, but none with four points on one side. The last 20 minutes of the last day, saw a nice buck but could only count three points (need a better scope). My brother was on a big buck for three days but couldn’t get a shot. This is not hunting in fenced areas or over bait, so don’t expect it to be like that.\n\nSome in our group might not give as high a rating, but we all had a really good time (some didn’t see deer, lodging switches, long drive times, lack of sleep and bad weather were contributing factors). Bringing home meat always improves the ride home. Had the feeling the hunting was really good here, but it is all about timing. Next time I will have a better scope to see those brow tines.", "pics": null, "resp": {"time": 1517335266751, "text": "Thank you John.  The rut has finally kicked in.  Sorry it was so far behind this year but that's whitetails for you.  We don't normally get snow but got it twice this year.  Snow is never favorable for whitetails here in Bama.  Wish you were here now.  Hope to see you again."}, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "112172960316526651675", "name": "Chad Bailey", "time": 1548223384529, "rating": 5.0, "text": "I have been very passionate about hunting for over 25 years. I have my own properties I manage and also take several hunts a year ,with experienced guides, in many different regions of the country. Masterrack Lodge is hands down the best money I have ever spent on a hunting experience. This includes some of the high end guides in the Dakota's, Texas and even Illinois.\n\nThe first trip was a shot in the dark. It was late season, my property in Georgia was spent and I wanted to try and catch the rut one more time. My hunting partner and I chose Masterrack just because we had the opportunity at 2 Bucks. Going in blind is not my style but this by far was the best 'Hail Mary' call I have made in life to date.\n\nAnytime I enter a new environment I like to sit back and see how everyone is treated and grab a feel for the 'culture' of my surroundings. From the moment we arrived we were treated with respect and warmth. The entire crew were very courteous and everyone worked to make you feel comfortable.\n\nI will get to the hunting in a moment but one of the best moments I witnessed is when the Owner, Steve, was approached with a situation I think I was not supposed to hear. Another guest had brought his 12 year old son to try and get his first buck. He had an opportunity that morning and took it. When they brought the animal to the lodge he was about an inch short on his inside spread. You could see the young boys body language change as he heard the news, shoulders dropped, head down and that wonderful smile erased from his face. Steve whispered in the fathers ear, what was said I didn't hear, but the next thing I heard was Steve telling the boy about how that was a fine first deer and it was better than his first. He spent the next 15 minutes cheering the boy up and when he was done the boy was back to walking on air again. Come to find out he waived the fine. Its hard not to respect a man that passed on money to make sure he did not ruin the experience for the father and son. That is something I have seen the exact opposite of in other lodges that give you the feeling it is al about the dollar and not the experience.\n\nAs far as the hunting,  this last year was our 5 year at Masterrack. We have experienced some poor weather from 88 degree January's to freak snow storms. At no point did Steve or his staff hesitate. They dialed up the intensity and worked to get us where we needed to be. Every trip we have had the opportunity. We have not always taken it but the chance was there.\n\nSteve is very passionate about his work, his reputation and the experience his guests have while there. He ensures his staff are experienced hunters, educated on his property, know the characteristics of his heard and understand the importance of Customer Service.  Enjoying the company of the Staff almost makes you take for granted the accommodations. Everything is top notch. The only warning I have is make sure you pack a set of clothes that are one size bigger because you will need them for the ride home after eating Roberta's cooking!! :)\n\nI can't thank Masterrack enough for all the wonderful memories. Every year when I leave Plant City it feels more like I am going to a Family Reunion combined with a great hunting trip.", "pics": null, "resp": null, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "106255487400477271657", "name": "Sherrie Vineyard", "time": 1522474156688, "rating": 5.0, "text": "Great hospitality and there cook rocks!", "pics": null, "resp": null, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "106804535489758899192", "name": "Maurice Mayeux", "time": 1514759289761, "rating": 5.0, "text": "Great place and better people.", "pics": null, "resp": null, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "109130086903055691427", "name": "Jeremy Adcock", "time": 1559218501553, "rating": 5.0, "text": "Loved it", "pics": null, "resp": null, "gmap_id": "0x888dbb77f4b8761f:0xf2ca06acf8f95936"}
{"user_id": "116642797315014722617", "name": "Jeremy Strickland", "time": 1619657556320, "rating": 5.0, "text": "It was a very good hunting trip. This is a hunt not a go and shoot pigs in a fence. Mr Kieth is a top notch owner. Zach is a 23 yr old that cooks like he has been cooking in a top notch restaurant. I promise you this you wont go hungry. Plenty of pigs to shoot at. The secret is being there when they are. Thank you again for your hospitality Mr. Kieth and Zach thx for the full bellies.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN8ejA3WB0WxHLcBu9PqL9LZo_9bFtvnlp0o1hQ=w150-h150-k-no-p"]}], "resp": {"time": 1619649135567, "text": "Thank you sir!"}, "gmap_id": "0x888d68487d52e191:0x289e326633622349"}
{"user_id": "104295022484450099897", "name": "Brett Keeley", "time": 1621291666028, "rating": 5.0, "text": "I have hunted alot of places. Hands down one of the best places I have been. My son and bother had a great time. Great conversations,food and lodging. They go over the top on making sure you are comfortable and killing hogs. We will be back and I would recommend them to anyone looking for a hog hunt. Thanks for a great time Keith and Zach!!!", "pics": null, "resp": {"time": 1621401062508, "text": "Thank you Sir! We really appreciate your business!"}, "gmap_id": "0x888d68487d52e191:0x289e326633622349"}
{"user_id": "103723764639131081538", "name": "Scott Penton", "time": 1615313412383, "rating": 5.0, "text": "Father and Son hunt 2020...Keith and his team provided the best hunting experience for me and my son. Their accommodations were perfect and their hospitality was even better. They made us feel like we were at home and never did we feel like we were just part of an outfit. My son harvested a deer and Keith had it processed by the time we left. Lots of good food, laughs, hunting, fishing and relaxing. What more could you ask for. We are booked again for 2021 and we can’t wait!", "pics": null, "resp": {"time": 1615314824460, "text": "Thank!"}, "gmap_id": "0x888d68487d52e191:0x289e326633622349"}
{"user_id": "111989585277516422219", "name": "charles waterfield", "time": 1608917330308, "rating": 5.0, "text": "I had a great time hunting Piney Woods. Keith is a great host, cook and man all around.  His crew are the best, very knowledgeable and entertaining. The property is second to none, from plots to deep woods. If anyone wants a great experience give them a call you will not be unhappy. Looking forward to next season and maybe some turkey hunting this spring.", "pics": null, "resp": {"time": 1608960882343, "text": "Thank you Sir!"}, "gmap_id": "0x888d68487d52e191:0x289e326633622349"}
{"user_id": "116445365444075156260", "name": "Joseph Carter", "time": 1614632528092, "rating": 5.0, "text": "We went last year on a hog hunt with Keith an l brought 9 guys on company hunting trip on 02-26-21. We’ve been a lot of places that say they have hogs but these guys really do, the first night we got 5 an the second night 4. Good people, good food, good times, already planning on coming back next year.", "pics": null, "resp": {"time": 1614633325555, "text": "Thanks!!!"}, "gmap_id": "0x888d68487d52e191:0x289e326633622349"}
{"user_id": "103429953286200302866", "name": "Robert Czaplicki", "time": 1610421742765, "rating": 5.0, "text": "Just spent 4 days with Keith, Zack, and Jamie at Piney Woods hunt lodge. Had a great time ! The food was perfect, exactly what you would expect from a hunting lodge. The sleeping arrangements where just a short 5 minute drive away from the lodge at the bunk house. There where plenty of stands we went to, they all had food plots and feeders located to give you a average 100-125 yard shot. The opportunity was there for me to harvest a nice deer but I failed to seal the deal. I will definitely be going back to hunt with Keith, Zack and Jamie again. Thanks again guys.", "pics": null, "resp": {"time": 1610422870409, "text": "Thank you Robert.   We enjoyed having you hunt with us.  Hope to see you again.   Thanks for the review."}, "gmap_id": "0x888d68487d52e191:0x289e326633622349"}
{"user_id": "115366752156263719190", "name": "Michael Halfacre", "time": 1618701658651, "rating": 5.0, "text": "Keith goes out if his way to ensure you have a good hunting trip and plenty to eat!", "pics": null, "resp": {"time": 1618706490668, "text": "Thank you  sir!"}, "gmap_id": "0x888d68487d52e191:0x289e326633622349"}
{"user_id": "113866029406207123614", "name": "Jason Carter", "time": 1614732645262, "rating": 5.0, "text": "Hands-down best place to hunt hogs I have hunted all over he has tons of pigs great food and hospitality second to none Group of 9 we killed 9 hogs", "pics": null, "resp": {"time": 1614745206603, "text": "Thank you!  You guys are definitely killers! See you next trip."}, "gmap_id": "0x888d68487d52e191:0x289e326633622349"}
{"user_id": "102839497875011023446", "name": "James Hallford", "time": 1474295567016, "rating": 5.0, "text": "I have hunted with Keith at Piney Woods a couple of times. You will not find any better people that the Wades. The lodge is wonderful and the cooking is is some of the south's finest. Keith and his crew go above and beyond to make sure your hunt is successful and memorable.", "pics": null, "resp": {"time": 1474298636842, "text": "Thanks!"}, "gmap_id": "0x888d68487d52e191:0x289e326633622349"}
{"user_id": "113685171259842176545", "name": "Cory Compton", "time": 1474257256803, "rating": 5.0, "text": "Piney Woods is an exceptional lodge. Mr Keith and his staff go above and beyond to provide the complete outdoor experience. Awesome hunting and fine southern cooking. We will definitely be coming back!", "pics": null, "resp": {"time": 1474260893048, "text": "Thanks!"}, "gmap_id": "0x888d68487d52e191:0x289e326633622349"}
{"user_id": "104853872587733795672", "name": "Sherry Barnes", "time": 1558923510926, "rating": 5.0, "text": "Great hunting, accommodations and the best home cooked meals I have ever had.   Mr. Keith Wade is a super guide and cook. Best tomatoe gravey in the south.", "pics": null, "resp": {"time": 1558926474468, "text": "Thank you very much!!!!!"}, "gmap_id": "0x888d68487d52e191:0x289e326633622349"}
{"user_id": "100343418277295742466", "name": "Matt Towne", "time": 1522375614198, "rating": 5.0, "text": "Great hunt, great host, 3 hogs in 3 days. Keith is straight up, worth the drive from Indiana. Looking forward to the next time..Go Notre Dame!", "pics": null, "resp": {"time": 1522446270180, "text": "Thank you for your business!  RTR!"}, "gmap_id": "0x888d68487d52e191:0x289e326633622349"}
{"user_id": "106344897153707188219", "name": "Marlayna Wiley", "time": 1474257649486, "rating": 5.0, "text": "If you want an amazing southern hunting experience then Piney Woods is your place! They treat you right. The hunts are great. Also, look to be well fed.", "pics": null, "resp": {"time": 1474260871989, "text": "Thanks!"}, "gmap_id": "0x888d68487d52e191:0x289e326633622349"}
{"user_id": "101588937627517115906", "name": "Kenny Schell", "time": 1473888532370, "rating": 5.0, "text": "Piney Woods put me on the largest hog I've ever shot, not to mention fed me well!  Will definitely be back.  Thanks Piney Woods Hunting Lodge for the great experience!", "pics": null, "resp": {"time": 1473896535360, "text": "Thanks!"}, "gmap_id": "0x888d68487d52e191:0x289e326633622349"}
{"user_id": "103082928640375001555", "name": "Gregg Shannon", "time": 1476732301948, "rating": 5.0, "text": "Going on my third year in a row of hunting here at the lodge and have shot game every time!  Last year I got two bucks in the same day one that scored 151 points with broken brow tines.  I have also hunted quail with both my dog and Keith's (the owner) dogs and had a blast.  I have hunted and killed several hogs and had them butchered by Keith's game processing in nearby Bunkerhill, AL.  Turkey is next on the hit list.  If you don't get game here then you have fell asleep in the box/stand.  Keith goes out of his way to be accommodating to all and will even discount or extend the hunt to folks who have not seen game to shoot. What more could you ask for?", "pics": null, "resp": {"time": 1476717340331, "text": "Thank you for your business and looking forward to seeing you and your team this year."}, "gmap_id": "0x888d68487d52e191:0x289e326633622349"}
{"user_id": "113734855306975918102", "name": "Morgan Strickland", "time": 1474290015986, "rating": 3.0, "text": "I went to Piney Woods Lodge and did a tower shoot with them and got to waste some bullets at some pheasants, had a blast! Beautiful place and some great food and lodging to go with it:-)", "pics": null, "resp": {"time": 1474396791982, "text": "Thanks!  Come back to see us so we get a chance to raise our rating with you!!"}, "gmap_id": "0x888d68487d52e191:0x289e326633622349"}
{"user_id": "100958049290569604083", "name": "Preston Davis", "time": 1474258071910, "rating": 5.0, "text": "Had a great time at Piney Woods Hunting Lodge. Keith is a great cook and overall had a great experience.", "pics": null, "resp": {"time": 1474259750094, "text": "Thanks"}, "gmap_id": "0x888d68487d52e191:0x289e326633622349"}
{"user_id": "107505092075092045129", "name": "Zachary Barnes", "time": 1506737979705, "rating": 5.0, "text": "Great place for deer, bird, and hog hunting", "pics": null, "resp": {"time": 1497811774627, "text": "Thank you!"}, "gmap_id": "0x888d68487d52e191:0x289e326633622349"}
{"user_id": "110240160449376149160", "name": "Jill Easton", "time": 1623617323788, "rating": 5.0, "text": "Planning a corporate retreat, wedding, meeting, and want it in a quiet, secluded  setting? White Oak is perfect. There is a large Pavillion overlooking the pond, a meeting room that will easily seat 50 and big western motif rooms with great beds.\n\nBreakfast is a combination of southern comfort foods like exceptional bacon, grits, eggs and seasonal fruit. Lunch includes salads with more hearty food like spaghetti and meat sauce. Did I mention there is a fishing pond loaded with giant bream and bass.", "pics": null, "resp": null, "gmap_id": "0x888cff3e47d090cf:0x2b8377c29e99b2ff"}
{"user_id": "101669925847941739831", "name": "Bob Robertson", "time": 1476111707743, "rating": 5.0, "text": "This is one of the most beautiful places I've ever visited. And for deer hunting, you just can't beat it! The hospitality of the Pitmans is unsurpassed. No better place for your next trophy whitetail deer hunt!", "pics": null, "resp": null, "gmap_id": "0x888cff3e47d090cf:0x2b8377c29e99b2ff"}
{"user_id": "105720328237822440417", "name": "Roy Washburn", "time": 1551383833979, "rating": 5.0, "text": "Beautiful facility, excellent hospitality and great hosts.  Thanks for a great time!", "pics": null, "resp": null, "gmap_id": "0x888cff3e47d090cf:0x2b8377c29e99b2ff"}
{"user_id": "106987233263543241784", "name": "Shawn", "time": 1537652466227, "rating": 5.0, "text": "Fond memories rekindled on this sacred part of God’s creation as we stayed there Auburn Game weekend (30 minutes from Auburn-AirBnb).  Owners Robert and Hilda Pitman are equally as charming in this historic Alabama hunting and fishing paradise. A word to the wise-use the printed directions from the AirBnb as the cell coverage is spotty at best-your navigator likely won’t get you there. Bring your finishing rods!", "pics": null, "resp": null, "gmap_id": "0x888cff3e47d090cf:0x2b8377c29e99b2ff"}
{"user_id": "109457970813210221498", "name": "Holly Macintire", "time": 1522479118511, "rating": 4.0, "text": "It's been 15 years since I was there last. It is still beautiful...regardless.", "pics": null, "resp": null, "gmap_id": "0x888cff3e47d090cf:0x2b8377c29e99b2ff"}
{"user_id": "106811915466315877134", "name": "Tony Oswalt", "time": 1512604757906, "rating": 5.0, "text": "Like my second home", "pics": null, "resp": null, "gmap_id": "0x888cff3e47d090cf:0x2b8377c29e99b2ff"}
