{"user_id": "109499679235720714437", "name": "Catherine Gilmartin", "time": 1623854228115, "rating": 5.0, "text": "Love Dr Mary..had acupuncture for me and my furry friend", "pics": null, "resp": {"time": 1623859749092, "text": "Thanks, Catherine! It's always a pleasure helping out where I can!"}, "gmap_id": "0x889a1282df9ca79f:0x9f442f3fd686b7e1"}
{"user_id": "114804843461978426904", "name": "Chasin 70s", "time": 1574173248268, "rating": 3.0, "text": "Dr. Sabal is very nice however she does not accept insurance, FSA/HSA or credit cards. Adjustment was mediocre.", "pics": null, "resp": null, "gmap_id": "0x889a1282df9ca79f:0x9f442f3fd686b7e1"}
{"user_id": "100936005404081165974", "name": "Brennan Donahue", "time": 1535816305933, "rating": 5.0, "text": "Dr. Mary was fantastic! I am a fellow chiropractor and was on vacation when I visited Dr. Mary. Great office, great care, and wonderful personality. I highly recommend calling her if you are searching for that perfect chiropractor.", "pics": null, "resp": {"time": 1535833980427, "text": "Thank you, Dr. Donahue! I had great teachers and I love what I do! Enjoy your visit to the Gulf Coast!"}, "gmap_id": "0x889a1282df9ca79f:0x9f442f3fd686b7e1"}
{"user_id": "104964761215020793854", "name": "Michael Beauchamp", "time": 1552056423478, "rating": 5.0, "text": "Rented a Bemer for a few weeks. Dr Sabal went out of her way to check in with me on a regular basis.", "pics": null, "resp": {"time": 1552131629122, "text": "Thank you, Michael, for taking time to \"Google\" Family  Care  Naturally...Happy to help, passionate about patient care!"}, "gmap_id": "0x889a1282df9ca79f:0x9f442f3fd686b7e1"}
{"user_id": "104702108101526037432", "name": "Gd Ford", "time": 1614096669625, "rating": 5.0, "text": "I had been a smoker for 40 plus years. I smoked a pack a day and tried to quit numerous times. The hazzle of not being able to walk to my mailbox without getting out of breath is now a thing in my past. I am now able to walk to my mailbox without loosing my breath. Not only am I now a non smoker but I have even been sleeping better. Thanks to Robertsdale Hypnosis for making me a nonsmoker!", "pics": null, "resp": null, "gmap_id": "0x889a6d8c19394763:0xffa6a0cf9236b93a"}
{"user_id": "108100276719129198581", "name": "Reunion Pointe", "time": 1605627624475, "rating": 5.0, "text": "Diets? I have been on all of them.   Even though I never gave up hope of better health and more beautiful shape, I was totally blown away by how hypnosis helped me achieve results with absolutely no diet at all.   I thought I was happy this morning when I put on jeans I hadn’t been able to wear for years but happier when the shorts I wore yesterday came off without unbuttoning or unzipping them.   My husband commented the shorts need to hit the donation bag! This is a journey and I still have a ways to go.   I see the road ahead as an easy one to navigate.", "pics": null, "resp": null, "gmap_id": "0x889a6d8c19394763:0xffa6a0cf9236b93a"}
{"user_id": "116768553993006521393", "name": "Annette Nolan", "time": 1606854608554, "rating": 5.0, "text": "When I started this weight loss program I was 156 pounds and a size 12.  8 sessions later, I am 146 pounds and a very comfortable size 10!  With 13 inches GONE!\n\nAnd the best part is I’ve been able to maintain that loss (and add to it) over time... even over Thanksgiving. No more YO-YO dieting for me! Hypnosis works so much better than any diet.\n\nIt isn’t magic but the audio tapes I use in my program make me feel more alive... more confident. Even 2 weeks after listening to them I felt like I came out from under a rock - I was more aware and hopeful for my ultimate success - which is a size 8. I have only 15 more pounds to go and I’m very sure I’ll reach that goal in the next 3 months, then I’m set!!! I can’t wait.\n\nI’m surprised at how much more energy I have, I’m sleeping better and my stress level is much better.\n\nIn truth, Not all hypnotists are created equally. I did see a hypnotist a few times 25 years ago... but he was not nearly as professional and didn’t give me anywhere near the support, information or products that I have here. Robertsdale Hypnosis even has a service guarantee. As long as I was accepted into a program, they will stick with me until I get my goal weight as long as I follow instructions! Can’t beat that.\n\nI’ve decided to be on one of their ads as soon as I lose the rest of the weight! Look for me there!!", "pics": null, "resp": null, "gmap_id": "0x889a6d8c19394763:0xffa6a0cf9236b93a"}
{"user_id": "100691045987460233320", "name": "minoley1", "time": 1605635774195, "rating": 5.0, "text": "I just finished my first hypnosis session to stop smoking and WOW!!!!  My stress level was about a 10 before I came to Robertsdale Hipnosis. After just one session it is truly zero. My mind is so relaxed, it almost seems like my problems are only half as bad, and I truly do not want a cigarette. I'M DONE!\n\nI admit Iwas a little doubtful if this would work at first.  More than anything I just wanted to feel like I didn't want a cigarette anymore. And it's weird! I really feel that way now! I am so glad I made myself call for my free screening. This is so worth it. Try it! it might change your life. It did for mine.", "pics": null, "resp": null, "gmap_id": "0x889a6d8c19394763:0xffa6a0cf9236b93a"}
{"user_id": "117988440198437701601", "name": "Tasha Johnson", "time": 1591485912293, "rating": 5.0, "text": "I had never done anything like this before but after one session I actually quit smoking! I smoked a pack, sometimes more a day for 11 years! I have tried everything to quit, patches, lozenges, all of it!  Absolutely the best experience and best decision I ever made. I feel 10x better and healthier. The hypnosis has helped me with my confidence and anxiety also. If your on the fence and not sure if it something you want to do, do it! Julie is wonderful!", "pics": null, "resp": null, "gmap_id": "0x889a6d8c19394763:0xffa6a0cf9236b93a"}
{"user_id": "105954626774733986333", "name": "Crystal Moye", "time": 1595540013349, "rating": 5.0, "text": "The thing I wanted to know the most when I came here was how it worked for people. I was done with diets that don't work and I really wanted to learn to eat like a thin person.\n\nBesides learning that, I also found out how to get rid of stress and calm down in my head.\nI was surprised how much my sleep improved from the first day which makes my life a whole lot calmer.  My husband has noticed I'm more relaxed and active and he's happy with the results so far.\n\nWhat's really cool is already I'm only eating HALF of what I used to, and it's not because\nI \"have to\" it's because I WANT to and that is a huge change.\n\nMy advice to someone looking at coming here is there are so many benefits and things you learn about yourself when you come here, you shouldn't miss it!", "pics": null, "resp": null, "gmap_id": "0x889a6d8c19394763:0xffa6a0cf9236b93a"}
{"user_id": "114178211231949495488", "name": "Chris Roberson", "time": 1585795220651, "rating": 5.0, "text": "I gotta tell the truth..  I am the most skeptical  person you will ever meet.  I was really doubtful  about hypnosis  and whether or not it really worked  It kinda seemed  like it was just gimmicky.  However I smoked all the way up until my appointment  time at 3PM.  When my first session  was complete I walked out and had zero, I mean zero desire for a cigarette!  I haven't smoked in 3 weeks now and have no desire to.  I am a believer!  I was a smoker for 35 years! I am  a non smoker  now, for the rest of my life! Julie is awesome! I will save in 3 months of not smoking what I paid for the sessions! It is totally worth it!", "pics": null, "resp": null, "gmap_id": "0x889a6d8c19394763:0xffa6a0cf9236b93a"}
{"user_id": "105115780389358634551", "name": "Mrs. Araza", "time": 1596646418890, "rating": 5.0, "text": "yesterday I went out and bought a size 9 because I can no longer fit in my size 15s any more! This is only my 5 session in my weight lost program... its helped me start exercising more eating right and finding foods I like to eat healthy more... its helped me become healthier on the inside with my heart and soul to get me to where I've lost two pant sizes....\n\nI came in to this with an open mind because I new a few other people that have done hypnosis on to quit smoking and it work same a losing weight... to this day for 10 years they haven't touched a cigarette... as well as the people I know that have done weight lose has stayed small with out gaining any weight back....\n\nI'm sooo excited to get back to where i was before my stroke it has been a big challenge for over a year and a half to lose my weight that I gained because of it... im very happy that I've done the hypnosis if it was it for them i would still be lost...\n\nI'm very thankful ive met her and came to this location. I live in CA/AZ and decided to come here in Alabama. I'm sooo thankful i met her and worked with her!\n\nThank you sooooo very much for all this work...", "pics": null, "resp": null, "gmap_id": "0x889a6d8c19394763:0xffa6a0cf9236b93a"}
{"user_id": "116111952078456618172", "name": "Ginger Placente", "time": 1562685821857, "rating": 5.0, "text": "Last Sunday I went to church in a smaller size pair of pants and I was very happy. That was only after four sessions of hypnosis to lose weight. I am surprised at the amount of progress this early in the program because I am not on a diet, or restricting what I eat. It just seems to be happening very easy. Next I am going to get a cute little summer dress. It's been years since I have done that. I'm excited.", "pics": null, "resp": {"time": 1566783544401, "text": "That's awesome! It won't be long before you're a member of the Little Black Dress club!"}, "gmap_id": "0x889a6d8c19394763:0xffa6a0cf9236b93a"}
{"user_id": "114938198126257511122", "name": "Sarah Hermetz", "time": 1582237992841, "rating": 5.0, "text": "It has given me a new life style. I wasn't this thin in middle school. I am in a place where I can live a full and healthy lifestyle, not only in my weight but with my self. Thank You Julie!!", "pics": null, "resp": {"time": 1583122309304, "text": "Thank you so much for your review of Robertsdale Hypnosis! We are so pleased you are working for your goals."}, "gmap_id": "0x889a6d8c19394763:0xffa6a0cf9236b93a"}
{"user_id": "110317247938468229613", "name": "Ron Dumas", "time": 1556120516557, "rating": 5.0, "text": "I am really interested in hypnosis as an alternative to some limited things like diets. I am here to lose weight,, control my state of mind and get more energized and organized. I believe Julie and Robertsdale Hypnosis can and will help me with these challenges and make me a better and happier person. this will Help me be healthier, happier and more focused with a lot less stress.", "pics": null, "resp": {"time": 1566784018461, "text": "We are most pleased to be here with you, hand-in-hand as you seek a better you! Thanks for trusting us to join you in this decision."}, "gmap_id": "0x889a6d8c19394763:0xffa6a0cf9236b93a"}
{"user_id": "116035737496734466269", "name": "Ginny Stopa", "time": 1559920676162, "rating": 5.0, "text": "This is only my fourth session but just last week I put on a bathing suit for  the first time in over two years. I’m also wearing sleeveless tops because of how many inches I’ve lost already. I have found that it takes WAY less food to make be satisfied at each meal and I never feel deprived. I am so glad I found hypnosis-it is easy and so fun. And I get great results.", "pics": null, "resp": {"time": 1566783933313, "text": "We are so glad you are with us as well! We are excited for your best future yet!"}, "gmap_id": "0x889a6d8c19394763:0xffa6a0cf9236b93a"}
{"user_id": "115118258410274372420", "name": "Diane Diane", "time": 1563980020886, "rating": 5.0, "text": "In session 1 I was scared - this was unknown to me and I wondered if hypnosis would work for me. By the 2nd session, NINE THINGS had improved or changed for the better! Wow! In session 3 we did a great technique to get me out of dieting thinking and during that, I began to clearly and easily visualize myself as the thin person I want to be. In fact, I put a picture of a thinner me in a BATHING  SUIT in the screen of my phone to remind me where I’m headed. Who would have thought I could come so far in such a short time! Today is session 4, and I told Julie that last week was a little crazy because I actually had a heart attack! I’m fine now, but of course all my friends brought giant piles of food over to hep me recover. It used to be I would have dived in to all of it, especially the sweets. Instead, none of the sweets interested me. It wasn’t that I wanted them but  “couldn’t” or “shouldn’t” have them - I genuinely didn’t want them. That’s gotta be the hypnosis changing my food preferences, and it was so easy. It is working for me. At week 4 I’m feeling so confident in where I’m going. I’m going to be a size 8, and that’s just how it’s going to go!!", "pics": null, "resp": {"time": 1566782853412, "text": "YAY! Keep going. Your health will continue to improve as long as you focus on the prize and take each day as the amazing opportunity it is!"}, "gmap_id": "0x889a6d8c19394763:0xffa6a0cf9236b93a"}
{"user_id": "112499033638943332386", "name": "Bill Nassar", "time": 1565797535404, "rating": 5.0, "text": "We are very pleased with the outcome here at Robertsdale Hypnosis with my step son. It was amazing to see how quickly he relaxed - more so than he has been in years.  i was really skeptical at first, but this isn't like on TV! instead, it gives the tools to be more confident and calm. you rally learn how-to relax, and then so many more thipngs are possible. The office is very professional and the people really know what they're doing,  We got the anxiety relief help we were seeking and are very glad we came. Thank you so much!", "pics": null, "resp": {"time": 1566782544051, "text": "Thank you for trusting us with your relief! It is the highest compliment to know that we placed you at ease and you enjoyed your visit in our office."}, "gmap_id": "0x889a6d8c19394763:0xffa6a0cf9236b93a"}
{"user_id": "101377675501718763821", "name": "Ann Morris", "time": 1563902660705, "rating": 5.0, "text": "I knew hypnosis would be the answer because I tried everything else! I smoked for 55 years up until June 6th. That was my first hypnosis session and I stopped smoking forever. I'm very proud of that date. It was so relaxing, and I found out I was aware of everything, and I felt calmly in control the whole time. The thing I like best about being a non-smoker is I have so much more energy and since my mind isn't racing, I can make decisions better. I like to brag, and everybody who knows me has heard me say, \"I'm a NON SMOKER!!\" Oh, and I've already saved 75% of what it cost just because I'm not buying cigarettes any more. In a year, I'll have enough to take a cruise! This worked so well, I'd do it again tomorrow.", "pics": null, "resp": {"time": 1566783492242, "text": "Congratulations! Stay with it and don't loose any ground."}, "gmap_id": "0x889a6d8c19394763:0xffa6a0cf9236b93a"}
{"user_id": "100807178020429045941", "name": "thegreenantllc Brandy55", "time": 1565963824816, "rating": 5.0, "text": "My grown son has severe anxiety and depression. We took the normal path for treatment and got improvement but he was still unable to live a normal life. We found Julie at Robertsdale Hypnosis and made the decision to see if hypnosis could help.  With only 3 sessions behind us he is much more relaxed and comfortable handling interactions with others. I reccomend anyone suffering from anxiety or other debilitating conditions to give hypnosis a try, it is certainly working for us.", "pics": null, "resp": {"time": 1566782453782, "text": "Thank you for this word of encouragement! It's so important to note every situation is different and we love recognizing the needs of every client. We are so excited by the path your son is on."}, "gmap_id": "0x889a6d8c19394763:0xffa6a0cf9236b93a"}
{"user_id": "103866852895116876040", "name": "Darlene Wolfe", "time": 1541035405957, "rating": 3.0, "text": "Is Starbucks,  consistent, clean, and courteous", "pics": null, "resp": null, "gmap_id": "0x889bb23fc8701c35:0xa0a46f36a729338a"}
