{"user_id": "107603182922878137408", "name": "Lindsea Bishop", "time": 1604673979087, "rating": 5.0, "text": "Amazing! Laura helped me finally resolve my styling/closet issues. I'll never have to waste money again after receiving her professional help. We did the entire closet meeting on Zoom, yay for safe virtual styling! She gives you so much helpful information and guidance, and I never felt anxious or overwhelmed. I got so much clarity from my zoom styling session that I am absolutely energized and ready to dress myself well. She gives you much needed confidence. Whats really cool is that she does not just help you then dump you..she actually provides help before the session, follow up information, and will even shop with you. She does so much work behind the scenes for you, and with you.  High quality help for regular people. I can't say enough good things about styling with Laura Showalter.", "pics": null, "resp": null, "gmap_id": "0x889a1783903017c7:0xf562d20abb2adcbc"}
{"user_id": "102978719731467314432", "name": "Arielle Webb", "time": 1598053650916, "rating": 5.0, "text": "Had the most wonderful experience! We used Laura to do a photo shoot for our salon’s grand opening. She helped with our wardrobe, styling,  and makeup from start to finish. We will definitely be using her again in the near future as we loved how every bit of it turned out. Very professional, punctual, and reasonably priced.\n\n-Arielle, Owner, Posh Pups Grooming Salon Santa Rosa Beach, Florida.", "pics": null, "resp": null, "gmap_id": "0x889a1783903017c7:0xf562d20abb2adcbc"}
{"user_id": "110195330221867749019", "name": "William Cadden", "time": 1606148840693, "rating": 5.0, "text": "hands down one of the best decisions I've made when it comes to clothing. I have used her services multiple times now, and will definitely be using her services again in the future!", "pics": null, "resp": null, "gmap_id": "0x889a1783903017c7:0xf562d20abb2adcbc"}
{"user_id": "107223545386299059102", "name": "Barefoot TreeHugger", "time": 1613188531784, "rating": 5.0, "text": "Five stars time and time again for Laura Showalter! Through Dedication, Wisdom, & Pure Fashion Perfectionism Laura Showalter litterly zoomed throught my closet with ease. But taking her time to address her professional ideas and tips on what to keep and work with and what to donate and then there were even piles of upgrade, which I enjoyed! She has helped me so incredibly more than I could have imagined. By using the questionnaire and only a few conversations she had me figured out! Laura coverd it all. My new style that was practical as I live dang near in the artic 6 months of the year. It was functional, Put together for a mom of 3 kiddos, and stylish! As an entrepreneur, mother and nature lover I can feel good, look good anywhere anytime!!!!! Thank you so very much Laura! True blessing and talent you are!", "pics": null, "resp": null, "gmap_id": "0x889a1783903017c7:0xf562d20abb2adcbc"}
{"user_id": "111783323300647383736", "name": "Matthew Coughlin", "time": 1597698467435, "rating": 5.0, "text": "Laura Lee is an amazing wardrobe stylist to work with. I love working with her on my commercial photography sets. I can trust her to execute the vision of the production. She is a joy to be around and makes everyone around her feel comfortable. I would highly recommend Laura Lee Showalter as a Personal Stylist and Production Stylist.", "pics": null, "resp": null, "gmap_id": "0x889a1783903017c7:0xf562d20abb2adcbc"}
{"user_id": "118130830378912450402", "name": "Coty Brannon", "time": 1598024198119, "rating": 5.0, "text": "I’ve worked with Laura on several occasions. Shes been more then helpful for my yearly closet clean out, event styling and a anniversary photo session. She always works around my busy schedule and has made her self available on zoom for when I’ve had a last min wardrobe melt down.", "pics": null, "resp": null, "gmap_id": "0x889a1783903017c7:0xf562d20abb2adcbc"}
