{"user_id": "108588138220092294987", "name": "Juan Rivaz", "time": 1605856519096, "rating": 5.0, "text": "Very organized firm--sent me a list of all documents required and stated upfront they would not submit anything until the packet was complete and fees paid so we did not have to keep getting calls about submitting more evidence or money for more applications, it was all done in one step. Hard part was the waiting, but overall  our case got resolved in a very decent amount of time!", "pics": null, "resp": {"time": 1605856819154, "text": "We are very grateful that you have chosen us to represent you with your Immigration case. Thank you for your evaluation and for recommending our Firm to friends and family."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "102656170651651772481", "name": "Lincoln Johnson", "time": 1606780146143, "rating": 5.0, "text": "I am grateful to have found JD & his amazing staff. I reached out to his staff last year when a family member recommended him. I was a little hesitant at first because another lawyer took our money and did no work however, JD reassured me that he has never lost case and that he will not stop until he wins our case. I can finally tell you that he did just that. Not only did he help my family, now he’s become a family member of ours. I am forever grateful to you mr Walker.", "pics": null, "resp": {"time": 1607961951347, "text": "Thank you for allowing us to represent you and your family. We are always here to help."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "117023824001218539824", "name": "Roberto Ruiz", "time": 1606713723999, "rating": 5.0, "text": "Best immigration lawyer in town. I had issues with my green card application from another lawyer and we hired JD and he explained the process from to start and finished and got my green card application approved in 15 days. Thank you JD Walker and your staff.", "pics": null, "resp": {"time": 1606855955513, "text": "Thank you for allowing us to represent you and your family. We are always here to help."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "101476017256857574933", "name": "Lydia Guzman", "time": 1565653232633, "rating": 5.0, "text": "Immigration attorney J.D. Walker provided my husband and I with fast and economical services at a time when we could not do it on our own. In fact my husband’s green card was actually made easy by the knowledgeable staff at J.D. Walker. I found them very friendly and knowledgeable about our very complex immigration laws. They always provided quick responses and straight forward answer to our inquiries. Our paperwork was always done right the first time and always filed promptly.\n\nI also found J.D. Walker’s fees surprisingly low for all of the services they provide. They truly did make dealing with our immigration laws a tolerable experience. I cannot imagine a more trustworthy and helpful immigration law office in the world! Thank you J.D. Walker for your exceptional services!!! J.D. Walker is a five star ⭐️⭐️⭐️⭐️⭐️ immigration lawyer.", "pics": null, "resp": {"time": 1565764086616, "text": "Thank you for allowing us to represent that you are your family. We are always here to help."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "118033816086976617263", "name": "Amy-Nicole", "time": 1604446521052, "rating": 5.0, "text": "The best immigration attorney in Alabama!\nHe’s helped me and my family so much when everyone else refused to take our case, he did.", "pics": null, "resp": null, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "109522402083279080155", "name": "Oke Akachukwu", "time": 1565814388259, "rating": 5.0, "text": "Mr. J.D. Walker, I would like to thank you and your staff for all of your direction, guidance and support throughout my green card journey. It was a bumpy ride with lots of barriers but the outcome was fruitful. I somehow forgot to share my feedback on the best services I received from your legal team and I sincerely apologize for that. Your firm really did an amazingly thorough and professional job and Words cannot give any appreciation justice. Thanks much to your receptionist, she was superbly positive, efficient and professional. I could not have wished for a better person to have dealt with it and the service I have received from you has been excellent. You have kept me well informed and up to date with everything. I would always refer your firm if the need ever arises for any legal assistance. Once again my heartfelt thanks and appreciation for you and everyone else worked on my case.\n\nBest Regards,\nOke", "pics": null, "resp": {"time": 1566254156122, "text": "Thank you for allowing us to represent that you are your family. We are always here to help."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "104001293701856157446", "name": "Brandon Smith", "time": 1553819605187, "rating": 5.0, "text": "I applied for my green card with immigration attorney J.D. Walker. My case was not straightforward and there were possible complications. The expert advice, thorough research, great communication and preparation provided by J.D. Walker ensured a smooth process and I receive my green card approval 11 months later!!!. Even if a case is simple, having proper representation is paramount to success. Having the best representation as provided by J.D.  Walker and his staff are highly recommended. I owe J.D. a great deal of gratitude. I highly recommend his law office as the best in Alabama and one of the best in the country.", "pics": null, "resp": {"time": 1553820864968, "text": "Thank you for allowing us to represent you are your family. We are always here to help."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "105294835139705368959", "name": "Yadira Jaramillo", "time": 1554242293676, "rating": 5.0, "text": "Mr. JD Walker is a great attorney. He helped me with my husband's criminal and immigration cases. Even with the language barrier, he was very patient and understanding. He took time to explain both long processes to me as we went along with both cases even though he only deals with Immgration.  I am very happy that he worked hard to get my husband's criminal case dismissed. I am even happier now that he was able to get a reasonable immigration bond amount and I was able to get my husband back home. Mr. Walker is a very diligent hard working attorney. He takes pride in his work and always does his best in each individual case. I recommend him to anyone who may need an attorney who is knowledgeable and passionate about his work and his clients.", "pics": null, "resp": {"time": 1554309030020, "text": "Thank you for allowing us to represent you are your family. We are always here to help."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "106200905758863729386", "name": "Hawa Hassan", "time": 1539639271469, "rating": 5.0, "text": "My family and I are beyond grateful for Mr JD Walker. We found him by accident while googling for another lawyer and God blessed us with this man of God. He helped us with our work permit then helped us with our green card. Thank you so much to you Mr Walker. I will tell everyone from my country about you so they can all be blessed by your work.", "pics": null, "resp": {"time": 1539744439559, "text": "We really appreciate your business and we are always here to provide excellent service."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "100602705160737523315", "name": "Ignacio Vasquez", "time": 1554243177865, "rating": 5.0, "text": "Experienced and knowledgeable\nI am an US Army veteran and went to see Mr. Walker to try to get my wife her residency. Mr. Walker explained the options we had and told us about a new policy for family of military. He was able to take us step by step throughout the process and went to the interview with us. He was very accesible and never treated us arrogantly like other attorneys we talked to before coming to see him. JD Walker is very popular with the immigrant community and we found out about him through a friend of mine. Every time we had a question, either him or members of his staff made sure we got a prompt answer. I highly recommend him and will definitely be back to see him when my wife is eligible for naturalization.", "pics": null, "resp": {"time": 1554309023387, "text": "Thank you for allowing us to represent you are your family. We are always here to help."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "103160554988876086374", "name": "Yassmin Ibrahim", "time": 1535136082885, "rating": 5.0, "text": "Attorney JD Walker is an absolutely brilliant attorney! He is simply fantastic! At this time I can't find the right words to express my appreciation for his legal knowledge, dedication and attention to details. JD Walker  is so clever. Really he is! Mr Walker  is a born \"Talent Counselor\". HIs patience and ability to listen and understand the problem is beyond human understanding! Mr. Walker helped me to resolve very complicated matter for my mother & I. No other attorney could help us and JD Walker and his staff did it!!! He Is fast & efficient under the complicated circumstances. Thank You!", "pics": null, "resp": {"time": 1536526707436, "text": "We really appreciate your business and we are always here to provide excellent service.  Have a great weekend."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "115511600862972397833", "name": "Jose Resendiz", "time": 1572057211850, "rating": 1.0, "text": "I don’t not recommend Mr JD walker Maybe in easy cases  that don’t require experience and dedication, think about it before hireing him . I have lost a lot of time and money with Mr. JD Walker", "pics": null, "resp": {"time": 1572114923214, "text": "I’m sorry to hear about your bad experience. We’re normally known for our exceptional attention to detail, and we regret that we missed the mark. My name is J.D. Walker and I am the owner. If you’d like to discuss this further, please contact me at (205) 492-8967/jdwalker@jd-walker.com"}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "117640969486840349319", "name": "John Cardenas", "time": 1571700791847, "rating": 1.0, "text": "Disorganized, called two weeks ago to make an inquiry regarding an immigration case, a clerk told me over  the phone  that I would need to come to their office for all inquiries; drove an hour, got there and I was told that I need to set up an appointment over the phone before they could see me....I was like...uh really lady.\nLost two hours of my time, I would NOT recommend them.", "pics": null, "resp": {"time": 1571949463870, "text": "Amy,\n\nThanks for your feed back however, we are unable to verify any of the information that you have described nor can we locate your name and contact information in our client database; which means that you never called or made an appointment. We apologize for any misunderstanding or confusion.\n\nWe take customer feedback very seriously so if you can contact our office manager directly at info@jdwalker.com so we can resolve this issue as a matter of urgency.\n\nMany Thanks,\nJ.D. Walker"}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "105671919051701364633", "name": "Reyansh Mohammed", "time": 1539896251798, "rating": 5.0, "text": "JD Walker and his staff were excellent. Me. JD Walker was so gracious and helped me at every step of the process. His work was so detailed that there was no room for error. Thank you again to Mr. JD Walker and his wonderful staff. I highly recommend this Immgration law office.", "pics": null, "resp": {"time": 1540545334682, "text": "Thank you for allowing us to represent you are your family. We are always here to help."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "117485983083915332140", "name": "Viveka Bizzell", "time": 1490412827704, "rating": 5.0, "text": "Attorney J.D. Walker is a professional and knowledgeable Immigration Attorney. I referred all  of my clients to him as I know he will give them honest advice based upon the law. He's passionate, tactical, responsive and focused.  He is a strong litigator and represents his clients best interest well.", "pics": null, "resp": {"time": 1490461158182, "text": "We appreciate your business and we are always here to provide excellent service."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "101874958365836950580", "name": "Lowell Francis", "time": 1573078041693, "rating": 5.0, "text": "I got naturalized in 2016 through marriage to a US citizen.\n\n1. I came to the US,  May 2012 on a J1 Cultural Exchange Visa, Met US citizen, got married October 2012, Applied for adjustment of status Nov 2012 then obtained a conditional greencard May 2013.\n2. Applied for removal of condition Mar 2015.got new greencard Nov 2015\n3. Applied for Naturalization March 2016 (3 year rule) got naturalized July 2016.\n\nRed Flags and Problems\n1. I got an outside child in 2015 with another US citizen while married.\n2. My now ex wife asked for a divorce shortly after I became citizen (September 2016.)\n3. I got remarried Nov 2016 to a person from my country of birth who came to the US on a visitor's visa\n4. Submitted I-130 and & I-485 for my new wife to be able to adjust status Feb 2017\n5 Got interviewed Dec 2017. (stoke interview on site) we were both  separated and questioned then ask to sign statements.\n\nMy case  pretty much  had all the red flag that that USCIS looks for, and I made the mistake of going down that road myself .\n\nUSCIS was not happy with the fact that I got divorced only months after being naturalized, they did not like the fact that I got remarried so quickly after the divorce, they did not like the fact that my new wife was from the same country that I am originally from , they did not like the fact that she got married to me within 90 days of entering the USA on a visitors visa. they did not like the fact that I got an outside child while I was married to my ex (first wife)\n\nI hired JD walker after I realized that I was under suspicion for marriage fraud, This was the single best decision I made through my immigration journey, JD Walker took over my immigration case that was dragging for over 2 years successfully got USCIS to issue my wife a 10 years permanent residency card. we now have a child together and are about to close on our first family home.\n\nI highly recommend using this law firm to represent you in immigration matters, JD walker is well known among his community and is highly respected by the USCIS officers in the Atlanta and Montgomery location for his success in immigration matters\n\nThank you JD Walker!!!!", "pics": null, "resp": {"time": 1573083022882, "text": "Thank you for allowing us to represent you are your family. We are always here to help."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "106133466637715844642", "name": "Shunika Terry", "time": 1490373345280, "rating": 5.0, "text": "J.D. Walker is a dedicated and experienced immigration attorney.  Understanding the process of deportation and how it can impact you is very important. He is highly dedicated to providing every client with the best service and makes sure you are selecting the best path to citizenship.", "pics": null, "resp": {"time": 1490463889184, "text": "Thank you Shunika, we at JD Law Firm greatly appreciate your words. Have a great weekend!"}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "114512345331044261131", "name": "Asmite Mesfin", "time": 1539993808156, "rating": 5.0, "text": "I highly recommend JD Walker! He is committed, hard working and has tons of knowledge about Immgration law. He always kept an accurate track of my process. I would hire JD Walker again and again and again😘", "pics": null, "resp": {"time": 1540545316861, "text": "Thank you for allowing us to represent you are your family. We are always here to help."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "106442514406236740666", "name": "Starr Culpepper", "time": 1490373368785, "rating": 5.0, "text": "Very responsive and understanding of my concerns. He made me feel comfortable and the process was smooth! I would definitely recommend his legal services to anyone I know.", "pics": null, "resp": {"time": 1490464875410, "text": "Thank you Starr, we are glad you had a great experience with us. Please feel free to contact us at anytime, we are here to serve you!"}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "101357185507672925667", "name": "Edgar Juarez", "time": 1584401282416, "rating": 5.0, "text": "Nice lawyer he help me good with my questions👍👍", "pics": null, "resp": {"time": 1584405447094, "text": "Thank you for allowing us to represent that you are your family. We are always here to help."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "109386996320364697456", "name": "Lydia Haile", "time": 1554238983520, "rating": 5.0, "text": "JD walker  was there for me and won my deportation case. I was ordered deported and was detained for many months and was going to be deported to my home country. Mr. Walker stopped my deportation, reopened my case, removed my deportation order and obtained my release. From that moment on, Mr. Walker was always with me during my saga to legalize my status and stand up for my rights. HE FOUGHT FOR ME -- for years in the district courts and the immigration courtrooms and in different cities. My bond hearing was in Louisiana, and Mr. Walker was there for me. Mr. Walker was there for me at the Memphis court to help me obtain my lawful permanent residency. My immigration case was never easy. Even on the last day of my immigration trial, it was a very contested hearing. We won and JD Walker many times spoke up for me, made numerous objections, protected my rights, made sure that I was treated like a human being and with respect. And Mr. Walker later represented my cousin . The day before my cousin’s interview, there was a big snow storm in Birmingim  and the flights were cancelled. Mr. Walker left the airport and drove  overnight (THROUGH A SNOW STORM) so he could be with us at 8:00 a.m. the next morning. My cousin  got her green card, thanks to JD Walker. What Mr. Walker did for me and my family was amazing and is superhuman.", "pics": null, "resp": {"time": 1554309044597, "text": "Thank you for allowing us to represent you are your family. We are always here to help."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "117327491865007378646", "name": "Alberto Labarrera", "time": 1554232381073, "rating": 5.0, "text": "I cannot imagine anyone giving this law firm a 1 star!!!. I am so grateful to an amazing, knowledgable, compassionate lawyer. Two years ago i was so certain i would be back in Honduras, but Mr. JD Walker worked tirelessly  within his  expertise and today i am a proud Green Card holder. If you really need honest competent, knowledgable lawyer to represent you look no further..Abogado JD Walker’s  law firm is the place. Kudos to \"JD\" thank you very very much... i owe my freedom to you.", "pics": null, "resp": {"time": 1554309098335, "text": "Thank you for allowing us to represent you are your family. We are always here to help."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "107751906009208516459", "name": "Jamal Midani", "time": 1613431875933, "rating": 5.0, "text": "Good service", "pics": null, "resp": null, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "100308531514315618024", "name": "Lisa Sanchez", "time": 1554156167125, "rating": 5.0, "text": "Best Immgration lawyer in Alabama! Thank you for everything Mr. JD Walker", "pics": null, "resp": {"time": 1554309242029, "text": "Thank you for allowing us to represent you are your family. We are always here to help."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "117398196108216507780", "name": "Katie Bennett", "time": 1489262412490, "rating": 5.0, "text": "I highly recommend JD Walker Law Firm. The staff is very kind, helpful and greet you at the door with a warm welcome. J.D. is extremely knowledgable and takes the time to make sure you (the client) is educated and understands each step in the process.", "pics": null, "resp": {"time": 1490461530070, "text": "Thank you Katie, we appreciate working for and with you. Please feel free to reach out If you are ever in need of our services."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "108710355902013339594", "name": "Lisa Alvarez", "time": 1564917152039, "rating": 1.0, "text": "This attorney is very incompetent. Seek others before using him.", "pics": null, "resp": {"time": 1564939485779, "text": "Lisa,\n\nThanks for your feed back however, we are unable to verify any of the information that you have described nor can we locate your name and contact information in our client database; which means that you never called or made an appointment.  We apologize for any misunderstanding or confusion\n\nWe take customer feedback very seriously  so if you can contact our office manager directly at info@jd-walker.com so we can resolve this issue as a matter of urgency.\n\nMany Thanks,\nJ.D. Walker."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "106350653980861285812", "name": "Ana D Villalta", "time": 1554161286237, "rating": 1.0, "text": "So bad customer service,just take away our money\nPaperwork missing here.", "pics": null, "resp": null, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "110093018378796882959", "name": "Jenifer Galvez", "time": 1534535102903, "rating": 1.0, "text": "If I could give this place 0 stars I would. No communication skills and told me to drive 8 hours for a refund. After charging my credit card over the phone. Not very professional but if you need a cheap lawyer call him.", "pics": null, "resp": null, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "102829110046200438289", "name": "Tyliea Hernandez", "time": 1538539772780, "rating": 1.0, "text": "No ones never calls you back and the lady answering the phone is very RUDE!", "pics": null, "resp": {"time": 1538565679738, "text": "Tyliea,\n\nThanks for your feed back however, we are unable to verify any of the information that you have described nor can we locate your name and contact information in our client database; which means that you never called or made an appointment.  We apologize for any misunderstanding or confusion\n\nWe take customer feedback very seriously  so if you can contact our office manager directly at info@jd-walker.com so we can resolve this issue as a matter of urgency.\n\nMany Thanks,\nJ.D. Walker."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "116439969707445938187", "name": "juan gutierrez", "time": 1574333909581, "rating": 5.0, "text": "Good", "pics": null, "resp": {"time": 1574777142943, "text": "Thank you for allowing us to represent that you are your family. We are always here to help."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "111966702154615138583", "name": "Angela Lopez", "time": 1605856235212, "rating": 5.0, "text": "(Translated by Google) I had a very complicated case and the other lawyers stole my money. I hired JD Walker to represent my family and they received their visa. We are very grateful to have met JD Walker !!!\n\n(Original)\nTuve un caso muy complicado y los otros abogados me robaron el dinero.  Contraté a JD Walker para representar a mi familia y recibieron su visa.  Estamos muy agradecidos de haber conocido a JD Walker!!!", "pics": null, "resp": {"time": 1605856812900, "text": "We are very grateful that you have chosen us to represent you with your Immigration case. Thank you for your evaluation and for recommending our Firm to friends and family."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "106556790364351686215", "name": "Elva Salazar", "time": 1554231825381, "rating": 5.0, "text": "(Translated by Google) I highly recommend JD Walker to anyone looking for help navigating the legal minefield that is permanent residence. As someone who stresses easily, Mr. Walker has saved me many sleepless nights. He and his staff are fast, efficient, reliable and honest, and I will tell any of my friends to use them for immigration. Thanks to them, my future with my husband in America is brilliant ❤️\n\n(Original)\nRecomiendo altamente al abogado JD Walker a cualquiera que busque ayuda para navegar por el campo minado legal que es la residencia permanente. Como alguien que se estresa fácilmente, el Sr. Walker me ha salvado muchas noches de insomnio. Él y su personal son rápidos, eficientes, confiables y honestos, y les diré a cualquiera de mis amigos que los utilicen para la inmigración. Gracias a ellos, mi futuro con mi esposo en América es brillante ❤️", "pics": null, "resp": {"time": 1554309160840, "text": "(Translated by Google) Thank you for allowing us to represent that you are your family. We are always here to help.\n\n(Original)\nGracias por permitirnos representar que usted es su familia. Siempre estamos aquí para ayudar."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "117555175783296572402", "name": "Susanna Castro", "time": 1554239573217, "rating": 5.0, "text": "(Translated by Google) I must say that Attorney JD Walker and his team are excellent and I cannot thank them enough for their help this past week, their immediate telephone response to my email was amazing and the information provided was, as always, invaluable.\n\nI would recommend them to anyone I know who may need any kind of legal advice or assistance. I can confidently say that they will give you good advice and help you with any issues you may have! Forever grateful\n\n(Original)\nDebo decir que Abogado JD Walker y su equipo son excelentes y no puedo agradecerles lo suficiente por su ayuda la semana pasada, su respuesta telefónica inmediata a mi correo electrónico fue increíble y la información proporcionada fue, como siempre, inestimable.\n\nLos recomendaría a cualquier persona que conozca, que pueda necesitar cualquier tipo de asesoramiento o asistencia legal. ¡Puedo decir con confianza que le darán un buen consejo y lo ayudarán con cualquier problema que pueda tener! Por siempre agradecido", "pics": null, "resp": {"time": 1554309037561, "text": "Thank you for allowing us to represent you are your family. We are always here to help."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "113581467077547285272", "name": "Jaime Andres", "time": 1554233533514, "rating": 5.0, "text": "(Translated by Google) I had a very sensitive immigration issue to resolve when I hired Attorney JD Walker to handle my case. Everything was handled with the utmost professionalism from the first day. My case received the level of attention and priority I expected and the whole team was always committed and above all. They guided me through the process with a lot of diligence and courtesy. Thanks to your work, knowledge and efficiency, my case was a success! After a little over three months, my case of permanent residence was resolved. I can not thank JD Walker and his staff enough for their fantastic work and I recommend them to everyone who needs a major immigration law firm in and around Alabama!\n\n(Original)\nTuve un asunto de inmigración muy delicado que resolver cuando contraté a Abogado JD Walker para manejar mi caso. Todo fue manejado con la máxima profesionalidad desde el primer día. Mi caso recibió el nivel de atención y prioridad que esperaba y todo el equipo siempre estuvo comprometido y por encima de todo. Me guiaron a través del proceso con mucha diligencia y cortesía. Gracias a su trabajo, conocimiento y eficiencia, mi caso fue un éxito! Después de un poco más de tres meses, mi caso de residencia permanente se resolvió. ¡No puedo agradecer lo suficiente a JD Walker y su personal por su fantástico trabajo y los recomiendo a todos los que necesiten un importante bufete de abogados de inmigración en Alabama y sus alrededores!", "pics": null, "resp": {"time": 1554309082112, "text": "(Translated by Google) Thank you for allowing us to represent that you are your family. We are always here to help.\n\n(Original)\nGracias por permitirnos representar que usted es su familia. Siempre estamos aquí para ayudar."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "109348893498024930397", "name": "Juan Lopez", "time": 1553820714861, "rating": 5.0, "text": "(Translated by Google) A great immigration lawyer !!! The immigration attorney J.D. Walker will fight hard for his case and will not steal your money.\n\nA great immigration lawyer !!! Immigration attorney J.D. Walker will fight hard for your case and will not steal your money !!!\n\n(Original)\nUn gran abogado de inmigración !!! El abogado de inmigración J.D. Walker luchará duro por su caso y no le robará su dinero.\n\nA great immigration lawyer!!!  Immigration attorney J.D. Walker will fight hard for your case and will not steal your money!!!", "pics": null, "resp": {"time": 1554309254730, "text": "(Translated by Google) Thank you for allowing us to represent that you are your family. We are always here to help.\n\n(Original)\nGracias por permitirnos representar que usted es su familia. Siempre estamos aquí para ayudar."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "118169004691981501006", "name": "Javier Membreno", "time": 1553811094385, "rating": 1.0, "text": "(Translated by Google) If you to loose your $ 155 in a fake consult call Viviana and Samantha.\nThis people send paper work to sign contract with them. never never they gave me a single call. when I call them talk very rude grumpy and missing paperwork.\nDo not waste your money and your love one waiting for nothing. $ 3500 dollars is money.\nIf you want to lose your money in a false consultation, call Viviana Samantha.\nThese people are useless. they do not give a single call and when they are called they answer in a grunt and rude manner.\nThey send you papers to sign and they do not tell you anything to do.\n$ 3500 dollars is money. it's not free\n10000 stars minus.\nDo not hire them !!!!!!!!!!!!!!!!!!\n\n(Original)\nIf you to loose your $155 in a fake consult call Viviana and Samantha.\nThis people send paper work to sign contract  with them. never never  they gave me a single call. when I call them talk very rude grumpy and missing  paperwork.\nDo not waste your money and your love one waiting for nothing.$3500 dollars is money.\nSi quieres  perder tu dinero en una falsa consulta ,llama a  Viviana Samantha.\nesta gente no sirven para nada. no dan ni una sola llamada y cuando se les llama a ellas contesten de manera grunona  y grosera.\nte Mandan papeles para firmar y no te dicen  nada que hacer.\n$3500 dolares es dinero. no es gratis\n10000 stars minus.\nDo not hire them!!!!!!!!!!!!!!!!!!", "pics": null, "resp": {"time": 1553819134339, "text": "(Translated by Google) Here at the Law Office of JD Walker we take customer service very seriously. Unfortunately when you called, you did not have any information on your detained brother. We called your family multiple times and not one called us back. When you called today and you were very rude to our staff and using language that was very disrespectful. We apologize for any misunderstanding or confusion and very glad we had the opportunity to work with you.\n\nHere at the legal office of JD Walker we take customer service very seriously. Unfortunately, when you called you did not have any information about your arrested brother. We called his family several times and nobody called us back. When he called today and was very rude to our staff and used inappropriate language that was very disrespectful. We apologize for any misunderstanding or confusion and are glad we had the opportunity to work with you.\n\n(Original)\nHere at the Law Office of JD Walker we take customer service very seriously. Unfortunately when you called you did not have any information on your detained brother. We called your family multiple times and no one called us back. When you called today and you were very rude to our staff and using inappropriate language that was very disrespectful. We apologize for any misunderstanding or confusion and very glad we had the opportunity to work with you.\n\nAquí en la oficina legal de JD Walker nos tomamos muy en serio el servicio al cliente. Desafortunadamente, cuando llamaste no tenías ninguna información sobre tu hermano detenido. Llamamos a su familia varias veces y nadie nos devolvió la llamada. Cuando llamó hoy y fue muy grosero con nuestro personal y usó un lenguaje inapropiado que fue muy irrespetuoso. Nos disculpamos por cualquier malentendido o confusión y nos alegramos de haber tenido la oportunidad de trabajar con usted."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "100738611775375428969", "name": "Miguel Flores", "time": 1539803585904, "rating": 5.0, "text": "(Translated by Google) Thank my Lord. I am happy that you have helped me become a US citizen. Attorney JD Walker and his team are excellent and I highly recommend him to everyone. He has become my friend and mentor.\n\n(Original)\nGracias Señor. Estoy feliz de que me hayas ayudado a convertirme en ciudadano estadounidense. El abogado JD Walker y su equipo son excelentes y lo recomiendo a todos. Se ha convertido en mi amigo y mentor.", "pics": null, "resp": {"time": 1540545472806, "text": "(Translated by Google) Denada !!!\n\n(Original)\nDenada!!!"}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "116166599242084915073", "name": "Maria Hernandez", "time": 1539694703233, "rating": 5.0, "text": "(Translated by Google) Attorney JD Walker is an excellent attorney who made sure that my husband and I were able to stay in the United States so that our family could continue to grow. He and his staff were very knowledgeable about immigration laws and explained everything to us correctly. We drove 5 hours to see it and it was worth it. I have never done a review, but I felt this was absolutely necessary because there are many Immigration attorneys who take advantage of people like me and my husband because we are desperate. I am very grateful to JD Walker and his staff for taking good care of me and my husband.\n\n(Original)\nEl abogado JD Walker es un excelente abogado que se aseguró de que mi esposo y yo pudiéramos permanecer en los Estados Unidos para que nuestra familia siguiera creciendo. Él y su personal estaban muy bien informados sobre las leyes de inmigración y nos explicaron todo correctamente. Manejamos 5 horas para verlo y valió la pena. Nunca he hecho una revisión, pero sentí que esto era absolutamente necesario porque hay muchos abogados de Inmigración que se aprovechan de personas como yo y mi esposo porque estamos desesperados. Estoy muy agradecido por JD Walker y su personal por cuidarme bien y por mi esposo.", "pics": null, "resp": {"time": 1539744528010, "text": "(Translated by Google) We really appreciate your business and we are always here to provide you with excellent service. Have a great weekend.\n\n(Original)\nRealmente apreciamos su negocio y siempre estamos aquí para brindarle un excelente servicio. Ten un excelente fin de semana."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "106043235708134819421", "name": "javier Angel", "time": 1576246586749, "rating": 5.0, "text": "(Translated by Google) Good quality lawyer\n\n(Original)\nAbogado de buena calidad", "pics": null, "resp": {"time": 1584405436715, "text": "Thank you for allowing us to represent that you are your family. We are always here to help."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "108496818278999082603", "name": "Mac Mac", "time": 1536955296245, "rating": 1.0, "text": "(Translated by Google) I did not like your service\n\n(Original)\nNo me gustó su servicio", "pics": null, "resp": {"time": 1538565773558, "text": "Here at the Law Office of JD Walker we take customer service very seriously. Unfortunately we do not have you in our record; which means that you never called and we apologize for any misunderstanding or confusion.  You can call me directly\nand I will make sure that someone calls you back in a timely manner at (205) 492-8966.  Thank You, J.D. Walker, Esq."}, "gmap_id": "0x88891b973bbc499d:0x9f9a5367999c52e4"}
{"user_id": "109291812664393294752", "name": "Andou N. Jennifer", "time": 1622508441853, "rating": 1.0, "text": "Everything is around money. Each question you ask, or something you mention will be part of restriction. when you think you are telling something because the lawyer can help you see clearly and tell you what to do, and how he will help you, but no, he will use this information to put more restriction on the contract.\n\nAt the end, if you ask too much questions, they send you an email to let you know they have too much work. You become a nuisance.\n\nPlease take time to ask questions. About everything. Read the contract and ask questions about each paragraphs.", "pics": null, "resp": {"time": 1623160802620, "text": "Though we cannot address specific details regarding your matter here for confidentiality reasons, we invite you to contact us directly to discuss your concerns. We thank you for consulting with us, and wish you well in your endeavors."}, "gmap_id": "0x888c93390ec7b34b:0x345cd16fb85b3a95"}
{"user_id": "108159231591359044000", "name": "Ray Ray Ash", "time": 1621893199787, "rating": 5.0, "text": "Here is a lawyer that will work for you and not just the fees. Brian is very easy and knowledgeable in his fields of the law what ever those needs are. Mine's are traveling to other countries to be married and having the proper paperwork for both place of residents. Time change and I were late (1hr) but he waited with a smile. OMG I said to myself and he had great news to follow-up on my questions and some I didn't think about asking.\nWho is Brian J. Bogdany???\nDedicated,Honor,Devoted,A Believer,Family Oriented,\nDuty,Committed,Trustworthy\nand a Joyful man to handle\nyour legal affairs.\nMr. ASH,R.,U.S.NAVY retired", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOIRe7Z6jcjeST9QM_dBdFmJfzwCPTQMPXyoUeu=w150-h150-k-no-p"]}], "resp": {"time": 1625761354718, "text": "We greatly appreciate your confidence and your kind words. Thank you."}, "gmap_id": "0x888c93390ec7b34b:0x345cd16fb85b3a95"}
{"user_id": "110171162575614371083", "name": "magda kruger", "time": 1625760564213, "rating": 5.0, "text": "He is extremely good at what he does and one of the most helpful people I've ever met.", "pics": null, "resp": {"time": 1625761236616, "text": "Happy to be of service. Thank you."}, "gmap_id": "0x888c93390ec7b34b:0x345cd16fb85b3a95"}
{"user_id": "115237433475731487780", "name": "Eric Davis", "time": 1611782578047, "rating": 5.0, "text": "Mr. Bogdany was very helpful in our immigration case.", "pics": null, "resp": {"time": 1611784535053, "text": "We are happy you were satisfied with our work. Thank you so much."}, "gmap_id": "0x888c93390ec7b34b:0x345cd16fb85b3a95"}
{"user_id": "105886604400786289898", "name": "Connor D. Grimshaw", "time": 1558622602514, "rating": 5.0, "text": "Very knowledgeable and overall a nice person. Kind heart-ed and strong willed. I would not have a problem trusting them with my life.", "pics": null, "resp": null, "gmap_id": "0x888c93390ec7b34b:0x345cd16fb85b3a95"}
{"user_id": "109217094427497241517", "name": "Johnny Adams", "time": 1581178394312, "rating": 5.0, "text": "Thanks for always taking the time to listen and give advice. Keep up the good work!", "pics": null, "resp": {"time": 1590092274082, "text": "We always appreciate speaking with you Johnny!"}, "gmap_id": "0x888c93390ec7b34b:0x345cd16fb85b3a95"}
{"user_id": "105279572074460082005", "name": "Jillian Yanes", "time": 1573143083279, "rating": 5.0, "text": "(Translated by Google) This is the best lawyer. Very professional, good prices; and onesto. I recommend it\n\n(Original)\nEste es el mejor abogado. Muy profesional, buenos precios; y onesto. Se lo recomiendo", "pics": null, "resp": null, "gmap_id": "0x888c93390ec7b34b:0x345cd16fb85b3a95"}
{"user_id": "116662700113098536630", "name": "jay pelaez", "time": 1624637537208, "rating": 5.0, "text": "Attorney, Lisa Ramirez was amazing!!!! My family had some immigration issues. One of our friends recommended Mrs. Ramirez, since our first phone call she made us feel at ease, treated us as if we where her only clients, Mrs. Ramirez was able to resolve our immigration status at a great rate and in efficient time. I Really don't know where would we be at, if she was not the Attorney representing us. Mrs. Ramirez emphasize with what we were going through and diligently worked with our case and was able to resolved all our immigration status.  We are internally grateful for here excellent work.", "pics": null, "resp": {"time": 1624825711362, "text": "Hi Jay. Thank you for your 5 Star review. We wish you and your family a successful future."}, "gmap_id": "0x88891984adae8ecb:0xb1dc591a3a754319"}
{"user_id": "112754971311487838439", "name": "Cyrille Kamdem", "time": 1624633997558, "rating": 5.0, "text": "I'm glad I turned to this law firm for my family's needs. It has been a very confusing transition but Mrs. Rameriz is very knowledgeable and her communication is very open. I'm impressed with the timely manner that she has gotten things done. She is easy to work with and affordable. She is not only their to take your money but she delivers whatever it is that she is working towards. I highly recommend them.", "pics": null, "resp": {"time": 1624825617427, "text": "Thank you Cyrille for your kind review. We're so happy for your outcome. We are so fortunate to have Lisa in our team. The WIL Team."}, "gmap_id": "0x88891984adae8ecb:0xb1dc591a3a754319"}
{"user_id": "103636263015702475082", "name": "Ginger Cendoma", "time": 1624581894415, "rating": 5.0, "text": "The attorney Lisa was very helpful with the process of obtaining visa for our family. She was responsive to e-mails and phone calls. She provided assistance when we needed help to collect documents. We felt at ease with the information and help she gave us. We didn’t worry about the process.", "pics": null, "resp": {"time": 1624585924103, "text": "We're so happy with the outcome of your case. Thank you and your family  for being such great clients. - The WIL Team"}, "gmap_id": "0x88891984adae8ecb:0xb1dc591a3a754319"}
{"user_id": "105481323058384235204", "name": "Kennia Martinez", "time": 1624583846562, "rating": 5.0, "text": "I would definitely recommend lawyer Lisa and the Weinstock company to anyone.  They did everything they said they would. They were always available whenever I had a question or concern. If a message or email was left, I had a call back or answer within a few hours.I was always treated with honesty and respect", "pics": null, "resp": {"time": 1624585272684, "text": "Thank you Kennia for your great review. We are so happy with the outcome. Thanks for being a great client. - The WIL Team."}, "gmap_id": "0x88891984adae8ecb:0xb1dc591a3a754319"}
{"user_id": "102892883356377373135", "name": "sheree graham", "time": 1625024469175, "rating": 5.0, "text": "The best attorney in town, from day one they took care of us and kept us updated and made sure all the paperwork were thoroughly done and followed up as and when due. Lisa and everyone working here are top notch professionals and are very hardworking.\nThank you Weinstock Immigration Lawyers.", "pics": null, "resp": {"time": 1625063236557, "text": "Awww. That's so sweet. Thank you for your business and your wonderful review. This made our day. Thanks again, Sheree."}, "gmap_id": "0x88891984adae8ecb:0xb1dc591a3a754319"}
{"user_id": "100449714126546321503", "name": "andrew ramirez", "time": 1624578291259, "rating": 5.0, "text": "The attorney Lisa was very dedicated to helping us with to ensure my mom’s were filed correctly and everything that should have been submitted was included the first time. We recommend her work for family immigration.", "pics": null, "resp": {"time": 1624584858851, "text": "Thank you Andrew for your kind review. Thanks for trusting us with your mom's immigration case. Your success is our success. We wish you and your family a successful future. - The WIL Team"}, "gmap_id": "0x88891984adae8ecb:0xb1dc591a3a754319"}
{"user_id": "113793349294290122377", "name": "The Surge", "time": 1624582449606, "rating": 5.0, "text": "Mrs.Ramirez helped me with my case fast and professionally, she’s very understanding and worked with the resources I had. An amazing lawyer and person and I appreciate all the work she does to help people in need.", "pics": null, "resp": {"time": 1624585807591, "text": "Thank you so much for your 5 Star review. We appreciate your trust ann happy to call you our client. Wishing you and your family a successful and healthy future. - The WIL Team"}, "gmap_id": "0x88891984adae8ecb:0xb1dc591a3a754319"}
{"user_id": "116541118539124803719", "name": "Vanessa Guerrero", "time": 1624727887788, "rating": 5.0, "text": "I’ve been working with attorney Lisa Ramirez & I have to say she’s been the best attorney I’ve had! She’s so caring always checking in on her clients & always there to answer any concern I might have, totally recommend her!", "pics": null, "resp": {"time": 1624825926349, "text": "Thank you Vanessa for your great review. We are so grateful to have Lisa join our team. - The Weinstock Immigration Lawyers Team."}, "gmap_id": "0x88891984adae8ecb:0xb1dc591a3a754319"}
{"user_id": "100239062429749579054", "name": "Jay Black", "time": 1624583702293, "rating": 5.0, "text": "Very professional and helpful,prizes are reasonable compared to other lawyers,", "pics": null, "resp": {"time": 1624585504701, "text": "Thanks for your 5 Star review and comments. It means a lot to us. - The WIL Team"}, "gmap_id": "0x88891984adae8ecb:0xb1dc591a3a754319"}
{"user_id": "117310205712037131609", "name": "Brenda Gonzalez", "time": 1624731572180, "rating": 5.0, "text": "Good and friendly, she would answer all my questions when needed", "pics": null, "resp": {"time": 1624825969928, "text": "Thanks Brenda for you 5 star rating and your kind words."}, "gmap_id": "0x88891984adae8ecb:0xb1dc591a3a754319"}
{"user_id": "107891812137949524514", "name": "Rosario Rodriguez", "time": 1625591722817, "rating": 4.0, "text": "Very responsible, and very kind", "pics": null, "resp": {"time": 1625592475287, "text": "Thank you Rosario for your kind comment. What could we have done better to get a 5-star rating?"}, "gmap_id": "0x88891984adae8ecb:0xb1dc591a3a754319"}
{"user_id": "112993183345908049224", "name": "Jose rosales", "time": 1624579854848, "rating": 5.0, "text": "Un a atención excelente  y  te ablan  con la berdad  si hay posibilidad en tu caso", "pics": null, "resp": {"time": 1624586150364, "text": "(Translated by Google) Thanks José for your excellent review. You can always count on us. - The WIL team\n\n(Original)\nGracias José por tu excelente reseña. Siempre puedes contar con nosotros. - El equipo WIL"}, "gmap_id": "0x88891984adae8ecb:0xb1dc591a3a754319"}
{"user_id": "113233293319247333650", "name": "Felipe Rangel", "time": 1625609794101, "rating": 5.0, "text": "(Translated by Google) Professional Service and Courtesy.\n\"I recommend it.\"\n\n(Original)\nServicio Profesional y Cortesia.\n\" Se la recomiendo.\"", "pics": null, "resp": {"time": 1625669168129, "text": "(Translated by Google) Thank you very much Felipe!\n\n(Original)\nMuchas gracias Felipe!"}, "gmap_id": "0x88891984adae8ecb:0xb1dc591a3a754319"}
{"user_id": "105080987235754697916", "name": "Cruz Virgos", "time": 1624579364597, "rating": 5.0, "text": "(Translated by Google) Highly recommended and very responsible with his work\n\n(Original)\nMuy recomendable y muy responsable con su trabajo", "pics": null, "resp": {"time": 1624586248049, "text": "(Translated by Google) Thanks Cruz for your review and comment. We strive to give and perform quality work. - The WIL team\n\n(Original)\nGracias Cruz por tu reseña y comentario. Nos esforzamos por dar y realizar un trabajo de calidad. - El equipo WIL"}, "gmap_id": "0x88891984adae8ecb:0xb1dc591a3a754319"}
{"user_id": "106126450424976687378", "name": "Moe AL", "time": 1591917129783, "rating": 5.0, "text": "April Pugh went above and beyond to help me acquire my green card. She knows her craft and she is very reliable. Her team is outstanding. I would definitely recommend Bingham at Law to anyone who's in need. They will help you!", "pics": null, "resp": null, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "109256864263331007641", "name": "Marilyn Sanchez", "time": 1600706555329, "rating": 5.0, "text": "Mr.Bingham is really good at his work. Very professional highly recommend. His a very nice guy.", "pics": null, "resp": null, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "102512180956406731376", "name": "Cheryle Greene", "time": 1589220587057, "rating": 5.0, "text": "I know Mr Ellis personally and as a Lawyer. He is a great guy with everyone best interest at heart. He is upfront . There have been issues that he told us he could not help with , he went above and beyond the call to help us resolve a land issue. Look forward to him being there for us for years to come.", "pics": null, "resp": {"time": 1590619971862, "text": "Thanks Cheryle, look forward to being there for you and David."}, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "110887585780674249980", "name": "Hector Caballero", "time": 1599784682062, "rating": 5.0, "text": "Excellent attorney ,the one to use for complex cases,very profesional , versed in immigration and criminal law.A very experienced attorney with deep understanding in difficult legal matters.", "pics": null, "resp": null, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "118411471769183817220", "name": "Roderick L Jackson", "time": 1569341293397, "rating": 5.0, "text": "Everything, the kindness and willing to answer any questions you may have. I'll give them two thumbs up! Keep up the good work!", "pics": null, "resp": null, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "103033478474797768569", "name": "Sheila Henderson", "time": 1517609253142, "rating": 5.0, "text": "Mr. Bingham has been my family attorney for over 20 years. He makes me feel comfortable discussing my problems with him. There is no other attorney I would trust to handle my legal needs. He is honest. He is compassionate about his work. He goes over and beyond for his clients.  I highly recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "112396482626747259144", "name": "Wilian Estrada", "time": 1582298749397, "rating": 5.0, "text": "The atorney ellis is a nice person. honest and trustworthy i recomended 100% he always say the true, he do my citizin and my wife green card resident good prices and fast.", "pics": null, "resp": null, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "107492964305562385131", "name": "Jean-Paul Bootier", "time": 1529124787955, "rating": 5.0, "text": "A very good immigration lawyer. He came highly recommended from a big pharmaceutical company out of Boston. He also has other lawyers working with him that cover a myriad of issues.", "pics": null, "resp": null, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "103263126604876783837", "name": "Steph Jimenez", "time": 1518202507474, "rating": 5.0, "text": "Highly would recommend.  Everyone is nice and very helpful.  You get the help you need.", "pics": null, "resp": null, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "102532554578783270122", "name": "cristian reyes", "time": 1516998099338, "rating": 5.0, "text": "He is a very honest attorney if nothing can be done he will let you know upfront.", "pics": null, "resp": null, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "113544727065219390824", "name": "Ellis Bingham", "time": 1520462280419, "rating": 5.0, "text": "he is passionate about his work and shows his concern for bettering his clients life, by doing his best to help in any way possible.", "pics": null, "resp": null, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "117630408188647470480", "name": "Byron Josue Aguirre Carcamo", "time": 1517255080918, "rating": 5.0, "text": "Very good service once I sat down with my attorney she already new every answer to my questions, 10 more additional stars for their service ⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️", "pics": null, "resp": null, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "107330284936072076784", "name": "Karla Parra", "time": 1518811004698, "rating": 5.0, "text": "Mr. Ellis was very helpful and kind and gave me various options for my current situation.", "pics": null, "resp": null, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "101127880260499970720", "name": "Garry Westwood", "time": 1516592829137, "rating": 5.0, "text": "I do not know what problems these all guys have but  i can tell and put my on fire for this lawer he know his job he helped me a lot he even helped my friends and got them out of their problems. I can tell you all one thing you allbtrybto make candy from sh** he is person not GOD. Privet is atlanta Ga", "pics": null, "resp": null, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "104817376667456824535", "name": "Rosario De Los Santos", "time": 1503689952261, "rating": 1.0, "text": "Very rude unprofessional...lier and staff don't even know how to translate he has to correct his translater 4 times as I sat there and watch him. SO PLS people don't waste your money on him or any of his staff...", "pics": null, "resp": null, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "117316453009325093788", "name": "Karissa Gonzalez", "time": 1525107866879, "rating": 5.0, "text": "They are very helpful and very good at there job...", "pics": null, "resp": null, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "116971783818115379085", "name": "JL Drywall LLC", "time": 1485548511186, "rating": 1.0, "text": "Don't waste your time or money on Mr. Bingham or his staff. They'll say one thing to collect the fees but say a completely different thing later. They don't stick to what they promise. Client satisfaction is the last thing they are worried about. Unprofessional, liars, unexperienced, greedy, dishonest.", "pics": null, "resp": {"time": 1590619371797, "text": "You can't skip court and expect to win!"}, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "114000998852951215287", "name": "Solly 1hunndo", "time": 1576078948582, "rating": 5.0, "text": "Great honest attorney", "pics": null, "resp": null, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "102371393591908044761", "name": "Jovita Ibarra", "time": 1517599930760, "rating": 5.0, "text": "(Translated by Google) Attorney Bingham is one of the most efficient attorneys I have ever met. The lawyer helped me with my son when he was arrested. He helped us get him a bond and represented him in court. Most importantly, he was able to get residency for my son. When we have legal questions, we always go to him. I always recommend your services to my family and friends.\n\n(Original)\nEl abogado Bingham es uno de los abogados más eficientes que he conocido. El abogado me ayudó con mi hijo cuando fue arrestado. Nos ayudó a obtenerle una fianza y lo representó en corte. Lo más importante es que pudo obtenerle la residencia a mi hijo. Cuando tenemos dudas legales, siempre acudimos a el. Siempre recomiendo sus servicios a mis familiares y amigos.", "pics": null, "resp": null, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "108806162705979739551", "name": "Victorio h Mendoza", "time": 1522113427764, "rating": 5.0, "text": "(Translated by Google) I highly recommend Mr Bingham, he is an honest lawyer, he speaks to you with the truth when you present your case, I face deportation due to my ignorance of getting immigration papers with a notary, but thanks to him I won my case and I obtained my residence and another Judges in Atlanta know him and respect him for his work, which he does very well. I said that I had to appear 4 times at the immigration court.\n\n(Original)\nYo recomiendo mucho Mr Bingham el es un abogado honesto te habla con la verdad cuando le expones tu caso yo enfrente deportacion por la ignorancia mia de llegar papeles de imigaracion con un notario Pero gracias a el gane mi caso y obtuve mi residencia y otra cosa los jueces en Atlanta lo conocen y respetan por su trabajo que hace muy bien lo digo yo que tube que presentarme 4 veces a corte de migracion gracias Mr Bingham", "pics": null, "resp": null, "gmap_id": "0x8888de271880c67b:0x2ebf49263faf0708"}
{"user_id": "116187116089830225324", "name": "Dave", "time": 1621477485683, "rating": 5.0, "text": "My wife and I were in desperate need of a lawyer after the one we had hoped on cancelled on us the day of the appointment. We found Mr.Stoner online and he was able to fit us in that day, once we arrived we were welcomed by his lovely staff and incredible wife. They made us feel at home and thoroughly checked over our case. I honestly can't express enough how brilliant and kind this firm is. They are worth every penny and I would highly recommend them to friends and family.", "pics": null, "resp": {"time": 1622155174958, "text": "Thank you, Dave, for those kind words.  We work as a team at our law office.  Glad to know we could be there in a moment of need."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "103811966154598673667", "name": "Jayy KORRIE RouperroW", "time": 1577479915092, "rating": 5.0, "text": "Get The Job Done.  And In A Manerable Time.. Because Time Waits For Nobody", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOw0Kx1tXbUEiMw7mE-hCPheB9lFZ8eMoLo3HNx=w150-h150-k-no-p"]}], "resp": {"time": 1589814061304, "text": "Thank you for the 5 stars, Korrie!"}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "117095983396322809622", "name": "Gaby Soto", "time": 1623976356433, "rating": 5.0, "text": "If you need a lawyer right away Mr. Stoner would be the perfect lawyer to go to. He will assist you even after office hours, he will always pick up your calls, and he gives a good example of your situation.", "pics": null, "resp": {"time": 1624022105495, "text": "Thank you for the review.  We really enjoyed helping you all."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "117321759836713109350", "name": "daisy hernandez", "time": 1614954131349, "rating": 5.0, "text": "Went to a public library to get a notary signature for my marriage certificate and they told me that I couldn’t get married because my husband had to have some type of an Alabama ID and my mother as well. We called and Mrs. Stoner answered and told us that it was false information and that we didn’t need no Alabama ID to get married. Ended up getting married very quickly. Both Mr & Mrs Stoner have been great lawyers and helpful in many ways with my husband’s immigration case and helped us with our marriage certificate! Highly recommend!!", "pics": null, "resp": {"time": 1614962900450, "text": "Thank you, Daisy, for the review.  Always enjoy helping our friends and clients all the way through any process.  So happy for Victor and you."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "106483606625515869517", "name": "Theresa Crisp", "time": 1618952172506, "rating": 5.0, "text": "I have been to Allen Stoner several times for legal matters. He has been very professional and very courteous to my needs. Allen is a great listener but gives advice suitable for your situation. I highley recommend Mr. Stoner if you need him for anything.", "pics": null, "resp": {"time": 1618956263200, "text": "Thank you for the feedback and support."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "114625488368453598920", "name": "Gustave Fredrick", "time": 1616619115810, "rating": 5.0, "text": "I would like to thank Allen, Cookie, and their staff for applying excellent service, personal attention, and professionalism towards my wife's immigration case. It felt as though our case was the only one they were dealing with throughout the process. They were with us from the beginning of our journey to the end. I would definitely recommend Allen Stoner to both family and friends.", "pics": null, "resp": {"time": 1616620274458, "text": "Gus, thank you for the kind words.  We appreciate those words of encouragement."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "106361939873322802734", "name": "Holly Addison", "time": 1611388048266, "rating": 5.0, "text": "Mr. Allen Stoner was able to help my son and I achieve something I never thought we’d be able to. Him and his wife were so wonderfully kind and not only did they stay on top of everything, but they made it all so easy for us too. They knew what steps needed to be taken and what information was needed The Minute I stepped into the office. I’ve seen multiple attorneys throughout Decatur and Huntsville and not one of them compared to Allen Stoner. I can’t put into words how thankful I am for Mr. and Mrs. Stoner.", "pics": null, "resp": {"time": 1611440478490, "text": "Thank you for the kind words, Holly."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "112034348758123235456", "name": "MELI ReDu", "time": 1615332976517, "rating": 5.0, "text": "Mrs. Allen R Stoner is very professional, Works fast and is very reliable He did a great job in my case.\nI Would highly recommend him !!!", "pics": null, "resp": {"time": 1615336705494, "text": "Thank you.  We work as a team for all our clients to provide professional, friendly, and fast service."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "102546927609492018038", "name": "Nathaly Leos", "time": 1594668017215, "rating": 5.0, "text": "Mr. Stoner is a very compassionate attorney. He has always been honest, reliable and an overall great attorney. He did an exceptional job in my Mothers immigration case. My mother worked with Allen for 9 years and in those nine years he did everything In his power to help in her case. He also assisted other of our family members and was just as great! We highly recommend Allen and his staff!", "pics": null, "resp": {"time": 1594674633779, "text": "Thank you for your kind words and continued trust in us."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "104572943815643999745", "name": "Maria Palacios", "time": 1614224091692, "rating": 5.0, "text": "We known  Mr. Stoner since 2009 and We like the way he works what we like more about them its that he wont lie to you.he is a very honest Attorney  we happily  recommend  him to eveyone. Hebis tge best Thank you for your help", "pics": null, "resp": {"time": 1614226512791, "text": "Thank you Maria and Jose for the recommendation.  Your kind words of support keep us moving forward."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "105887419890041265255", "name": "Nicholas Emmanuel", "time": 1615582096728, "rating": 5.0, "text": "Barr Allen is simply the best!!! God bless you sir.", "pics": null, "resp": {"time": 1615582696943, "text": "Thank you for the encouragement, Nicholas.  So glad you are satisfied with our work."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "116343278339287594805", "name": "Kathy Williams", "time": 1605919010088, "rating": 5.0, "text": "I was very pleased with the legal service that Mr. Stoner did for my son. He was very attentive and handle anything professional.", "pics": null, "resp": {"time": 1605981754574, "text": "Thank you for the review, Kathy.  This feedback is important to us personally and professionally.  We represent each client as we would want to be represented by an attorney."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "111642289475771302635", "name": "Whitney Osburn", "time": 1597349938335, "rating": 5.0, "text": "Allen is a wonderful attorney. I have spent the past year working with him on a custody case involving my daughter. He has walked me through every step of the way and diligently worked to get the case taken care of. I would highly recommend him.", "pics": null, "resp": {"time": 1597354764736, "text": "Thank you, Whitney, for giving us the opportunity to help you.  We appreciate your review."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "108603853635779593004", "name": "Victor Huerta", "time": 1597971234346, "rating": 5.0, "text": "Mrs. Allen R Stoner is a wonderful attorney Works fast and is very reliable He did an exceptional job in my case. he is very honest and work very good I’m thankful with him because he help me a lot to win my case.\nI Would highly recommend him !!!", "pics": null, "resp": {"time": 1598200432652, "text": "Thank you for the review, Victor.  Our goal is client satisfaction."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "101992470473590164555", "name": "Isael Hernandez", "time": 1613010678916, "rating": 5.0, "text": "Great lawyer and their staff as well 👍", "pics": null, "resp": {"time": 1613086646988, "text": "Thank you, Mr. Hernandez.  We enjoyed getting to know you and working with you."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "113452932079139119595", "name": "Lola Barrios", "time": 1597417943475, "rating": 5.0, "text": "I highly recommend Allen Stoner as attorney hes responsive and professional he help alot of my family member out of immigration jail he is a very honest and compassionate lawyers.", "pics": null, "resp": {"time": 1598200621345, "text": "Thank you for the review, Lola.  We appreciate your assistance in helping our Hispanic clients."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "100804214615896997779", "name": "carilu duran", "time": 1595616337639, "rating": 5.0, "text": "He is the BEST Attorney. I drive from Brantley Al to come see him.. highly recommend him", "pics": null, "resp": {"time": 1597354895375, "text": "Thank you, Carilu.  We try to be the best and appreciate your review."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "117473617407033824383", "name": "mark kosgei", "time": 1587009282180, "rating": 5.0, "text": "I got my permanent residence thanks to this dude! I couldn't  have done it without him. He is great lawyer, very professional and knowledgeable. They treated me like family. I recommend using him!", "pics": null, "resp": {"time": 1589813996113, "text": "Glad to help clients like Mark.  Thank you for the opportunity to help."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "118234468514263456722", "name": "Rachel Vought", "time": 1595949437433, "rating": 5.0, "text": "Me Stoner is knowledgeable, compassionate and professional attorney. I highly recommend him if you need an attorney.", "pics": null, "resp": {"time": 1597354846679, "text": "Thank you, Rachel, for the review.  We appreciate Lee and you."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "103484832559765897065", "name": "tiffany roberts", "time": 1586072061411, "rating": 1.0, "text": "Mr. Stoner's lack of interest/effort in my case cost me my case. I hired him to be my voice at trial, but he did absolutely no work toward my defense. If your case ends up in the media, he's your man. If not, you are out of luck and left with years of appeals.", "pics": null, "resp": null, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "114058811980397034790", "name": "Tony Perdue", "time": 1559176723926, "rating": 5.0, "text": "Allen Stoner and his team are top notch. They do everything they can to help their clients. I would completely trust Allen with any legal issues that needed to be addressed. North Alabama is very fortunate to have a such a trustworthy, experienced, and highly skilled lawyer. I can’t recommend Allen enough, if you need legal representation.", "pics": null, "resp": {"time": 1543598153014, "text": "Thank you.  Reviews like this from satisfied clients are like fuel in my tank - I'm good for 300 more miles."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "101574660921357548783", "name": "Abel M'", "time": 1584237313657, "rating": 5.0, "text": "The best attorney.  Allen Stoner truly work hard into your case and make you feel like you are the only case that he has going.\nHe is very professional, straightforward and honest he kept me informed and  walked things trough step by step from the very beginning until the last face of my immigration process.\nI highly recommend Mr. Allen Stoner for all your immigration needs and many other law matters..\nThank y'all Mr. Allen Stoner for all your immigration service I'm  so happy for my results .\nEl mejor abogado de immigracion muy honesto y profesional . Se los recomiendo a todas las personas que necesitan un abogado en casos migratorios el los guiará durante todo el proceso  legal.", "pics": null, "resp": {"time": 1584284742132, "text": "Thank you for the kind words.  A pleasure to work for you."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "109923802906518111540", "name": "Megan Khan", "time": 1535479440381, "rating": 5.0, "text": "After my husband and I got married we had no idea how we would apply for his green card. Fate would have it that I actually met Allen, his wife, and their children on the beach several years ago. We stayed in touch and I knew they would be perfect to assist us with the immigration paperwork. They are all so caring, knowledgeable, and helpful. Any questions we had through the process were answered quickly. I would recommend Allen’s law office to anyone seeking help with immigration. I can’t thank them enough for everything they have done for our family.", "pics": null, "resp": {"time": 1598202311033, "text": "Megan, thank you for the review and kind words."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "113639146110416763972", "name": "THE HOMICIDE", "time": 1589903594026, "rating": 5.0, "text": "Very professional, compassionate and knowledge! I highly recommend!!", "pics": null, "resp": {"time": 1589918699051, "text": "Thank you, Jay.  You keep killing those beats!"}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "115533928755488912128", "name": "Denise Blackmon", "time": 1589818464870, "rating": 5.0, "text": "Mr Stoner and his assistants are the best they have helped me and my husband they are very responsive they talk to you and explain every detail to you they always answer the phone and return your phone calls immediately.\nThey care about their clients.\nThank you Mr Stoner for all of your help", "pics": null, "resp": {"time": 1589918831570, "text": "Thank you for your 5 star rating and your kind words.  We love helping clients like you!"}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "109076511019111576518", "name": "Wendy Lang", "time": 1540214202286, "rating": 5.0, "text": ". Stoner is an exceptional attorney.  He stepped in to assist in a situation in which I didn't know where to turn.  He was attorney, confidant, accountability partner, mentor.  and friend and I cannot have been more pleased by his representation.  I have recommended him to others and will continue to do so.  His sense of understanding and his personal communication skills at a difficult time are exceptional.", "pics": null, "resp": {"time": 1598201923339, "text": "Thank you for the review Wendy.  Our goal is to be both an attorney and counselor in difficult times."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "112568666618949024268", "name": "Kelli Lovelace", "time": 1535573709624, "rating": 5.0, "text": "Definitely recommend Mr. Stoner if you're in need of an attorney. Very efficient and caring. . office staff also approachable and friendly. Cannot say enough good things about Mr. Stoner and his staff.", "pics": null, "resp": {"time": 1598202227525, "text": "Kelly, I belatedly thank you for the review.  We appreciate the kind words - they keep us going."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "105115600044074262311", "name": "Stephanie Coronado", "time": 1551412795137, "rating": 5.0, "text": "Works fast and is very reliable! I definitely recommend him for any of your needs! Very kind and trustworthy people! Can't thank him enough for everything he has done!", "pics": null, "resp": {"time": 1598201838255, "text": "Thank you for the review, Stephanie.  We appreciate your kind words."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "105876323371033927143", "name": "Karen Box", "time": 1537903807611, "rating": 5.0, "text": "Allen and his staff have been extremely helpful in my husband's immigration process! Because of Allen's work, we were able to attend my husband's meeting in Atlanta with confidence that we had provided every document necessary for his green card. We look forward to using Allen's services when it comes time to apply for citizenship!", "pics": null, "resp": {"time": 1598202016866, "text": "Karen, I belatedly thank you for the review and kind words."}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "117461616885896441492", "name": "Mariah Reyes", "time": 1600789083529, "rating": 5.0, "text": "Thanks for everything !!", "pics": null, "resp": {"time": 1600793355161, "text": "Mariah, thank you for your review! We enjoy working for our clients and we certainly appreciate 5 star reviews!"}, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "108529204429686756766", "name": "Barbara Minardi", "time": 1522513059918, "rating": 1.0, "text": "All they care about is your money, specially his wife. I’ll never recommend this people. Horrible experience", "pics": null, "resp": null, "gmap_id": "0x886286a530b4a123:0xc81ee6299b47d811"}
{"user_id": "109644033929317994505", "name": "John Allen Dees", "time": 1575493330007, "rating": 5.0, "text": "Excellent law firm! Amanda Cook has represented me for many years. She gets results and has an incredible understanding of the law. She places client’s interest first and delivers results. I cannot stress the importance of having an attorney represent you that can be trusted. I use Amanda and her firm for personal and corporate law and highly recommend her and her firm.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "104605536948423497449", "name": "Amanda Brown", "time": 1575487021835, "rating": 5.0, "text": "Amanda Cook was there for me when I felt that I had no one. She kept outstanding and detailed files. She was and is still a caring and conscious person. I trust Mrs. Cook because she was and is always forward and honest. I hold her in the highest of regards and hope she continues to be successful. Thank you for all of your help Mrs. Cook.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "108169762106398780036", "name": "Melony Scott", "time": 1575486849875, "rating": 5.0, "text": "Amanda has been nothing but sharp, professional, and absolutely goes above and beyond for her clients.  I would definitely refer and recommend her team for any and all of your real estate closings.  Best closing attorney in town.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "112065845213252215695", "name": "Britt Stewart", "time": 1592436846833, "rating": 5.0, "text": "Amanda was very responsive and helpful in answering questions I had. She made it very easy to understand what she was explaining to me as she was answerin .", "pics": null, "resp": {"time": 1592496858283, "text": "Thanks, Britt!"}, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "114747648592487171086", "name": "Vesko Ruychev", "time": 1575572040017, "rating": 5.0, "text": "Amanda Cook is simply fantastic - very compassionate and determined lawyer. She is very knowledgeable in her field and takes every case seriously. I would recommend her to anyone who needs legal help in the Montgomery area.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "117002363099761293655", "name": "Happy Plant", "time": 1575500898518, "rating": 5.0, "text": "Amanda Cook is one of the most professional and ethical lawyers I have ever met. I have known her for many years and have seen, first hand, her integrity under fire.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "109931954828290582960", "name": "Renee Williams", "time": 1575504288415, "rating": 5.0, "text": "Amanda at Cook and Associates has been a godsend for me and my Production Company, ClassA entertainment. She is very knowledgeable, professional and understanding. I was lost when it came to contracts and certain legal aspects of the Industry and with her and her firm's help and expertise, we were able to get through our first major film distribution deal with ease. She is open, honest, fair and non-intimidating and my crew and I need and appreciate that. I highly recommend these guys!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "103788935114690151706", "name": "Chris Tarantino", "time": 1606050833528, "rating": 5.0, "text": "Best law firm in the area.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "103315757220045923657", "name": "Melissa Douglas", "time": 1555875543738, "rating": 5.0, "text": "They are thorough and take care of their clients. As a client since 2018 till now she has been there with me through every step of the way. So far my processes are going better than I expected and she is very patient with me. 🙏🏾", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "115909689548384142759", "name": "Donna Wallace-King", "time": 1575522994953, "rating": 5.0, "text": "Amanda Cook is an excellent attorney who knows the law, knows what she's doing, and knows how to help you.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "100462850223584979781", "name": "Jessica Lidvall", "time": 1550186783962, "rating": 5.0, "text": "Great choice in a place to go!!\n\nMrs. Edwards is very respectful and professional. She is extremely helpful and patient when you have a ton of questions.\n\nCook and Associates ✔✔", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "105108679963079525811", "name": "Tiffany Birley", "time": 1575485755916, "rating": 5.0, "text": "Amanda is very thorough and works hard for her clients.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "101981365406872978193", "name": "Kevin Cheff", "time": 1553687988840, "rating": 5.0, "text": "My husband and I hired Britany Edwards through Cook & Associates to assist with preparing for my Green Card case and attend the interview process. With short notice, she was able to gather key evidence and provide excellent advice and guidance. I would without hesitation hire Britany again in the future for my immigration legal needs.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "108063941568868988973", "name": "Kamaria Waiters", "time": 1556752540883, "rating": 5.0, "text": "Amazing and  affordable I looked her up by a whim and boy was I surprised at how she handled my divorce, at every meeting she treated me as top priority I have referred her to several family member and still keep her number in my phone on stand by.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "109579596911167305810", "name": "Zachry Ashmore", "time": 1510877910770, "rating": 5.0, "text": "Amanda is a highly competent lawyer who knows how to win. As a former client I cannot recommend her services enough. She helps you understand your rights and goes the extra mile to ensure you get what you deserve.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "108791845843035799435", "name": "Valtoria Jackson", "time": 1568397528344, "rating": 5.0, "text": "Prompt Personal Patient and Professional to a diverse community.", "pics": null, "resp": {"time": 1573693198221, "text": "Thank you!"}, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "118294674440253991154", "name": "Micah Hohenberger", "time": 1505960182254, "rating": 5.0, "text": "She did a wonderful job. Very helpful and follows through with any issue you will have. I would highly recommend her!", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "106976782506717656149", "name": "Kimyatta Chong", "time": 1542244575173, "rating": 5.0, "text": "The most professional and organizied business Attorney! She will definitely fight for her clients.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "115452665781330852161", "name": "Britt Johnson", "time": 1575503179287, "rating": 5.0, "text": "Amanda Cook helped me tremendously through a tough time.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "112664093801535349684", "name": "Jessica Argue", "time": 1550187808275, "rating": 5.0, "text": "Britany Edwards is wonderful and will fight for her clients!", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "110648235980868930324", "name": "Tangela Broaden", "time": 1579958925996, "rating": 5.0, "text": "Very friendly and knowledgeable people", "pics": null, "resp": {"time": 1582329808132, "text": "Thank you, Tangela!"}, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "117672840978131555737", "name": "Ned Lidvall", "time": 1550185651755, "rating": 5.0, "text": "The best and very helpful with any questions!!", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "116662015388513805065", "name": "Jeremiah Horton", "time": 1556284978480, "rating": 1.0, "text": "Gave me a quote  $300 Talk to a another lady on the phone tell me it would be $900 3 times the money I was expecting to spend.   Never sent her any paperwork. 10 minute conversation on the phone Sending me bills for $300 This is definitely  Not anyone you want to do business with!!!!!!!! Crooks", "pics": null, "resp": {"time": 1559149531598, "text": "Mr. Horton, thank you for your feedback. We would be happy to address all of your concerns if you would call us to discuss the issue."}, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "107375605431341034464", "name": "GT Comic Con", "time": 1503529218629, "rating": 5.0, "text": "Experienced and very professional lawyer, the best to work with.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "100484430856197750625", "name": "Scott Grant", "time": 1575500348457, "rating": 5.0, "text": "Super attorney & person.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
