{"user_id": "113587536587962144090", "name": "Tuskie Sanders", "time": 1623593251826, "rating": 5.0, "text": "Paul and his staff has a neat selection of pre-owned vehicles. Service AFTER the sell is second to none! Highly recommend this Business!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPPgWeXzVDxs4Sl1aPJR-jcrBVTt0jj68ueY_bP=w150-h150-k-no-p"]}], "resp": {"time": 1623604535872, "text": "Thank you so much for your kind feedback, Tuskie! We are beyond appreciative of your business. Also, thank you so much for your loyalty!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "103058692384531006540", "name": "Timothy Brewer", "time": 1622124440252, "rating": 5.0, "text": "I bought a car from them a few years ago. After much research, they were by far the best value for the price. This is where we got the most car for the money. We were so happy, we bought a second car from them.  Been driving both cars long enough to know we got great deals.  I highly recommend this place.  One note.  They use no haggle prices.  Which means you don't have the stupid run around you get at other places, but don't expect to talk them down off their price much either. But as I said, they are still my pick for the most car for your money.", "pics": null, "resp": {"time": 1622125922407, "text": "Thank you so much for your kind feedback, Timothy! We loved doing business with y’all and we appreciate your loyalty. We wouldn’t be in business without customers like you. Thank you so much for your business!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "117879267024296613687", "name": "Lisa Noland", "time": 1616617387076, "rating": 5.0, "text": "Great people to do business with. They sell quality used cars at good prices. We bought a car from them 3 years ago and still driving it and still very happy with it. Today we bought a second car from them. They are located over an hour from our home but well worth the drive.", "pics": null, "resp": {"time": 1616619578656, "text": "Thank you so much, Lisa! We are beyond appreciative for your loyalty and your feedback! Y’all help us stay in business! We hope y’all enjoy the vehicle!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "109689801443268588327", "name": "Dominique Blue", "time": 1619899560584, "rating": 5.0, "text": "Today we purchased a car here and the process was quick and easy. I had a price budget, and was able to stay within budget. All update again after we've had the car for a while!", "pics": null, "resp": {"time": 1619966330784, "text": "Thank you so much for your kind feedback, Dominique! We really appreciate you and we hope you enjoy the vehicle!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "118238371456432021517", "name": "Dimika Bozeman", "time": 1626092235896, "rating": 5.0, "text": "So I know there is a shortage of vehicles right now but we were able to find what we needed. The owner was so honesty with us in a way that you would never expect from someone trying to sell a car. I had already done my research on the vehicle anyway because it had a Carfax and Car Chex report on the vehicle. Then found they were a reputable dealer with USAA and TrueCar through my school. So when he was NOT some sleazy car salesman (unlike the other location I ended up at) it was rather refreshing. So if you are in the market and the shortage ends then you should definitely do business with them.", "pics": null, "resp": null, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "101334741663946293567", "name": "David Mann", "time": 1617754229138, "rating": 5.0, "text": "An incredible family-owned business! Leon and Shelia are great! They truly care about you, and your needs! Not your typical carlot... they're family and treat you like it! It's definitely worth out the drive out to Calera, I'd do it again!", "pics": null, "resp": {"time": 1619481483969, "text": "Thank you so much for your kind feedback, David! Most importantly, thank you so much for your business! It was such a pleasure to work with y’all! We hope y’all enjoy every minute of the vehicle!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "103635585603629809054", "name": "JT Fondren", "time": 1617557143773, "rating": 5.0, "text": "Great people who take good care of their customers. Purchase was easy and fast with excellent communication and full transparency. Highly recommend.", "pics": null, "resp": {"time": 1619480955142, "text": "Thank you so much, JT! We appreciate your business and your feedback! We hope y’all enjoy the vehicle!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "112348482867752794900", "name": "Daniel Shivers", "time": 1614888735111, "rating": 5.0, "text": "Found a Honda Pilot on Trucar, called in and test drove it. We decided we wanted it then and went on with a surprisingly smooth purchase! It was hassle free, and there was no sales pressure at all.", "pics": null, "resp": {"time": 1615306666033, "text": "Thank you so much for your kind feedback, Daniel! We really appreciate y’all and we hope y’all enjoy it!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "114521552393546160826", "name": "Stephen Hall", "time": 1579016700622, "rating": 5.0, "text": "This place is awesome.  Very few car dealers are like this anymore.  If you are looking for a great deal on a used car or truck, then buy one here.  I just purchased a 2015 Ford F250 at a great price. After I got the truck home a couple of days later I noticed a coolant leak.  I had it checked out and it was about $580 for the coolant leak and some other issues.  I called them back and they were willing to give me $300 towards the repairs.  I knowingly purchased the used truck \"as is\" and knew he didn't have to give me anything towards the repairs but I am thankful he was willing to help me out!  When I need another used car I will be back!", "pics": null, "resp": {"time": 1579363355549, "text": "Thank you so much for your kind words, Stephen! We always stand behind our vehicles and we always try to give the best deals possible! We hope you enjoy the truck and we look forward to doing business with you in the future!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "115286477662051714502", "name": "Eva Tensley", "time": 1568158518125, "rating": 5.0, "text": "I bought a car here for my mother it was perfect. The owner handled us with care and RESPECT most people treat older women not so great. This place was different they even got me a low percentage rate. This my 3rd car from them. They are fare and honest. Thank you all so very much. Sheila and Paul the rest of  the staff where grat.👍🏿👍🏿", "pics": null, "resp": {"time": 1568226674561, "text": "Thank you so much, we appreciate y'all more than y'all know! We are so grateful to have a customer as loyal as you! Thank y'all again!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "105847325819350471797", "name": "Matt Pair", "time": 1572534764946, "rating": 5.0, "text": "My wife and I bought a Chevrolet Suburban this week from Montevallo Imports. The process was quick and very friendly. The biggest plus was their financing, they were able to secure ya a better deal than even our bank (USAA). If you’re in the market for a used vehicle I highly recommend you give them a shot.", "pics": null, "resp": {"time": 1572540947346, "text": "Thank y'all so much, Matt! We appreciate you leaving us such a kind review! Y'all make our job worth it! We hope y'all enjoy it!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "110024295584491955418", "name": "Ron Martin", "time": 1576860547891, "rating": 5.0, "text": "Montevallo Imports is great! Staff is awesome, no sales pressure and quality used cars!\nPaschan did an awesome job of telling me about the vehicle and was not pushy. Ms. Sheila dealt with my finance company and had me out the door in less than 30 minutes.\nI usually don’t frequent car dealerships because of all the games and sales pressure but you get none of that here! Just simple, honest and pleasant car buying experience!\nIf you are looking for a great car at a great price, then look no further than Montevallo Imports!!\nI purchased a 2016 Honda CR-V for my wife as a surprise Christmas gift and they even kept the car for me a couple of days because she was going out of town and I wanted to surprise her when she got back.", "pics": null, "resp": {"time": 1576864517025, "text": "Thank you so much for your kind feedback, Ron! We appreciate you and your business! We hope your wife loved the vehicle and we’re honored that we could be a part of this special surprise!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "105905342367837404859", "name": "Lara Guthrie", "time": 1547099862320, "rating": 5.0, "text": "Thrilled with our experience!\nThis was the fastest, most pain free car buying experience ever. They let us test drive without pressure, had a rather quick paperwork process, and everyone was extremely laid back.\nI feel like we got a fantastic deal and we will be back.", "pics": null, "resp": {"time": 1553623192259, "text": "Thank you, Lara! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "110328229294518294026", "name": "fredyb", "time": 1488248473290, "rating": 5.0, "text": "This dealership is amazing I drove from Foley, AL nearly 4hours away. The owner Paul and his staff stayed late for me and my wife to arrive to check out two cars. The dealership closed at 6:30pm and we didn't arrived until 8pm, not once did we feel rushed or pressured throughout the process even after arriving so late. They let us test drive both vehicles by ourselves without anyone telling us where to go, the owner Paul even encouraged us to take it on the highway. Once we decided on a vehicle the paperwork process was even better! I couldn't believe how fast we was in and out hassle-free! The customer service was beyond any dealership I've experienced in my area just great people that made us feel very comfortable. This drive of nearly 4 hours was very worth it and I would do it all over again if I had to! I definitely will be back someday in the future for my next purchase, while my wife sit back and enjoy hers now. Thanks Paul, Montevallo Imports, and staff for making my wife dreams come true! I pray that God continue to bless this business and I speak more and more blessings amongst this business for doing what's right by their customers! We need more dealerships like this one around, I wish I could give it 10 stars!☄", "pics": null, "resp": {"time": 1553623450511, "text": "Thank you, Fredyb! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "112054762671829021839", "name": "el", "time": 1573497253056, "rating": 5.0, "text": "One of the best car buying experiences  I’ve ever had! wonderful people and wonderful cars! I highly recommend!", "pics": null, "resp": {"time": 1573501688150, "text": "Thank you so much! We appreciate you and we appreciate you taking the time out of your day to leave us such a kind review! We hope you enjoy your vehicle!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "114264279162917671361", "name": "Angela Johnson", "time": 1527346787359, "rating": 5.0, "text": "We purchased a vehicle from Paul on 5/24/18.  I will have to say it was the best car buying experience my husband and I have ever had.  Paul and Shelia made everything so easy and smooth.  We felt like we got a great deal.  I would highly recommend them to anyone.", "pics": null, "resp": {"time": 1553623299192, "text": "Thank you, Angela! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "107766748291823599940", "name": "Roman Zeigler", "time": 1563691992267, "rating": 4.0, "text": "I purchased a 2007 Lexus LS 460 from this dealership. They were excellent during the process and let me test drive the car and I took it to the Lexus dealership and had it checked prior to purchase with no worries from Paul, the owner. Unfortunately a few days after I bought the car I had a major braking issue that costed me $2000 to repair. Paul was very pleasant throughout the process of trying to fix the vehicle and agreed to make it right. He refunded me $560 dollars toward the repair of the car. Although it cost me over $1500.00 to repair a car I only had four months, the staff and owners were the best! No car dealership is perfect, but Paul and Sheila at least try to do their best!", "pics": null, "resp": {"time": 1563815724756, "text": "Thank you for doing business with us, Roman! We appreciate you and your feedback!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "100966229585604599893", "name": "Kirk", "time": 1535558734364, "rating": 5.0, "text": "Bought my BMW here and had a great, hassle free experience.  Paul and Sheila have been very helpful anytime I have had questions about my car. Paul has even helped me diagnose a problem that saved me an expensive trip to the dealer. Highly recommend!", "pics": null, "resp": {"time": 1553623251948, "text": "Thank you, Kirk! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "116754102022949380385", "name": "Lisa Lively", "time": 1537455290732, "rating": 5.0, "text": "Great Experience!  Very patient with me and let me drive several vehicles I had seen on the website. Purchased a Lexus RX 350 and love driving it!", "pics": null, "resp": {"time": 1553623223646, "text": "Thank you, Lisa! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "105664079077460951504", "name": "david amoroso", "time": 1521047742221, "rating": 5.0, "text": "Paul and Shelia are just down to earth GREAT people. Always have giving me and my family a fantastic deal on the vehicles (yes it's plural) that we've purchased. They are laid back and very easy to deal with. No haggling back and forth. They just say \"here's what the price is out the door.\" BAM! DONE!....It's that simple! Thank you for being ethical salesman to me and my family. We'll come back again. :)", "pics": null, "resp": {"time": 1553623339326, "text": "Thank you, David! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "104325537094819488763", "name": "E. S.", "time": 1496811939016, "rating": 5.0, "text": "This dealership is awesome and always has quality choices in cars. No gimmicks. No pressure. No one should buy a car blindly.  Do your homework before purchasing a car so that you will know if the car fits your budget or has a prior history of issues. Just bought our 2nd car from them and it runs like a dream. They let you take it to a mechanic to check it out and they do not pressure you to buy. THE BEST DECISION WE MADE!!!  WE LOVE OUR CAR!!!", "pics": null, "resp": {"time": 1553623416988, "text": "Thank you, Edward! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "112050154247269688466", "name": "Jim B", "time": 1392998209109, "rating": 5.0, "text": "Very satisfied, I purchased my first car from Montevallo Imports five years ago and since then I purchased my daughter's car and recommended them to all my friends.  I guess you can say I am very pleased.  They treat you well, like treating a family member and they do know cars well.  In addition, I can call anytime and ask about car related issues and they are never too busy to help.  I am very pleased and can safely recommend them to anyone that does not wants to be ripped off.", "pics": null, "resp": {"time": 1553623532317, "text": "Thank you, Jim! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "102403892534582445214", "name": "Leslie", "time": 1570320182275, "rating": 5.0, "text": "I got a great deal on a car today ! Awesome place and very friendly ppl ! I will most definitely shop there again and highly recommend them !", "pics": null, "resp": {"time": 1570475347529, "text": "Thank you so much, Leslie! We appreciate y'all's business and we appreciate your feedback!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "100104124921882111570", "name": "Vonny", "time": 1467749551668, "rating": 5.0, "text": "I purchased a 2013 Jetta. The car was immaculate and very well priced. The sales person was extremely accommodating and we had all the paperwork finished very quickly. My financial institution was giving me problems that day (I usually have all my financing taken care of before stepping foot on a lot) but the sales person was very patient and helpful during the entire process. I couldn't be happier with my experience with this dealer and I will definitely consider them for future purchases.", "pics": null, "resp": {"time": 1553623485094, "text": "Thank you, Vonny! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "116342724001587883014", "name": "Tommy Bolton", "time": 1534832486356, "rating": 5.0, "text": "Paul was wonderful to work with. We got a great car at a great price! I Recommend everyone to check them out first.", "pics": null, "resp": {"time": 1553623262884, "text": "Thank you, Heather! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "102542014190512798010", "name": "Shilonqua Lee", "time": 1554802744773, "rating": 5.0, "text": "This was without a doubt the easiest and most pleasant car buying experience I've ever had.  Everyone was courteous and friendly, and the deal was done quickly.", "pics": null, "resp": {"time": 1554909412449, "text": "Thank you so much Shilonqua! We really appreciate your business!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "107070577408246662914", "name": "Andrew Morgan", "time": 1385504413631, "rating": 4.0, "text": "I was very satisfied with my purchase from Montevallo Imports.  I saw the truck online, and went by one weekend afternoon.  They made a copy of my license and let me take the truck for a test drive on my own which was a breath of fresh air because I didn't feel like I was taking up the sales guys' time. Sheila, the manager was very kind and helpful.   When I got back, I got the carfax report without issue.  There was no high pressure sales pitch that I had become used to after looking at lots of trucks over several weeks. I was honest about minor defects I had found on the vehicle and they acknowledged and did not dispute them.  We haggled a bit as is healthy and expected, but I think all parties were satisfied and I know I got a fair price for the vehicle.\n\nI wanted to use my credit union, so had to wait until Monday to take possession, which wasn't a problem. After a handshake, we agreed to meet again on Monday. On Monday, after I got my credit union info, Sheila checked other banks they commonly use just to make sure I was getting the best deal on my loan.   The truck was cleaned and ready to go, and they had all my paperwork ready to sign.  We exchanged a check for keys and I was out of there in less than 30 minutes.\n\nIt has been a little over a month and I am so far very satisfied with my vehicle, and I would definitely consider doing business with Montevallo imports again.\n\nSince I haven't had a problem, I can't give a full 5 stars since I can't know how they would handle any weird thing that might come up. With that said, I got a great vehicle at a great price without any hassle, so I can't complain.", "pics": null, "resp": {"time": 1553623557335, "text": "Thank you, Andrew! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "104520468353389255367", "name": "Eliane Sarkis", "time": 1611451647706, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1612199061967, "text": "Thank you so much, Eliane! We really appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "113290916230680500752", "name": "Chris Futral", "time": 1534477547324, "rating": 5.0, "text": "This was by far the best car buying experience I have ever had. Paul is a one of a kind dealer and I recommend this place to anyone who is looking for a car", "pics": null, "resp": {"time": 1553623286200, "text": "Thank you, Chris! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "118264947672003681055", "name": "Nise 2You", "time": 1422815198580, "rating": 1.0, "text": "My husband and I were in search of a cls 550 and located one at Montevallo Motors. When we arrived the sales person was kicked back in the lobby as if she was on break. I assumed she was a customer by her demeanor. We asked to see the car.  The car was overpriced based off of the car fax report. The car as well had several cosmetic issues. When we asked to hear the engine, the car would not start. This leads me to believe that they do not crank their cars on a regular basis and have them sitting there. After 20 minutes of jumping the car off, I asked if the cup holder could be replaced, since the car was priced well over 20k. Her response was it will just peel off again. The appropriate response would have been, the cars are sold as is...not no it will just peel again. I will never visit this car lot ever again and will encourage my family and friends to not patron this location as well.", "pics": null, "resp": null, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "110164585741214068525", "name": "Adrian Traywick", "time": 1454258013854, "rating": 5.0, "text": "Just bought a car from this dealership! Fabulous experience! Quick and painless. Willing to negotiate and courteous. I highly recommend!", "pics": null, "resp": {"time": 1553623509169, "text": "Thank you, Adrian! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "104624484420914532417", "name": "Audra Folse", "time": 1564588841542, "rating": 5.0, "text": "I was treated with respect and kindness they are very caring people", "pics": null, "resp": {"time": 1565105170252, "text": "Thank you so much Audra! We really appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "116699562677929719530", "name": "Belinda Walker", "time": 1609876783154, "rating": 5.0, "text": "Very friendly environment.", "pics": null, "resp": {"time": 1609877730331, "text": "Thank you so much for your review, Belinda! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "116605321203907170608", "name": "Brandon Vigneulle", "time": 1391899163729, "rating": 5.0, "text": "I recently purchased a used car from Montevallo Imports in Calera.  The sales team was very knowledgeable and helped me get into a safe third row SUV as my wife and I were headed that day to the hospital to have another baby.  I highly recommend this company to anyone looking for a used car.", "pics": null, "resp": {"time": 1553623544220, "text": "Thank you, Brandon! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "104853703572470070198", "name": "Gator Jiles", "time": 1524341518109, "rating": 5.0, "text": "My stepson Jalen bought a 2016 Nissan Altima from them and Paul did everything to make the deal right. We will be buying from the again. Thanks for making his 1st car purchase a success.", "pics": null, "resp": {"time": 1553623311981, "text": "Thank you, Gator! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "114392656422702275478", "name": "Bob Marsh", "time": 1506988460014, "rating": 5.0, "text": "Incredibly courteous. Total Service with Hometown feeling. Alabama is lucky to have such a car dealer.", "pics": null, "resp": {"time": 1553623394054, "text": "Thank you, Bob! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "102894253241878880173", "name": "Kova Walker", "time": 1553262798841, "rating": 1.0, "text": "I will not recommend buying a car from these scammers.   This car place is a scam. They want you to come and spend your money but they don't wanna put any money into the cars. Once the transaction is completed they will not own up to anything concerning repairs. I got a bad deal. Purchased a car in 12/2018 and its a piece of junk. I'm saving you from scammers. I repeat DON'T BUY FROM THIS PLACE.  Im going on the BRC6 about this dealership.", "pics": null, "resp": {"time": 1560367234274, "text": "Hi Kova, we’re sorry you had a bad experience with us. We are a family owned business and our goal is to provide you with great service and offer good deals on great cars. Our vehicles are listed and sold as is with no warranty, unless stated otherwise. We try our hardest to please all of our customers and to make things right if something does happen to go wrong after the vehicle has been purchased. If there is anything we can do to make it up to you please give us a call at 205-663-9993 or come by and see us. Thanks."}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "101951025638954978122", "name": "lori auterson", "time": 1507752648594, "rating": 5.0, "text": "Awsome people so helpful and kind .we had a problem on hwy 65 south located its dealership for help they checked out our truck. Our truck and fixed for free so cool 5 stars!!!", "pics": null, "resp": {"time": 1553623371395, "text": "Thank you, Lori! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "104016661374618344414", "name": "Nicole Pollard", "time": 1478724520019, "rating": 5.0, "text": "Great place with great people.extreamly nice and helpful.nice cars at a very good price.they have a great detailing crew and mechanic.i had a wonderful experience buying my car.i will definitely be useing this place for all of my future car purchases", "pics": null, "resp": {"time": 1553623463459, "text": "Thank you, Nicole! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "105578320694413110618", "name": "Johnny Carr", "time": 1512167303024, "rating": 5.0, "text": "Great customer service.  Paul, the owner is a man of his word.", "pics": null, "resp": {"time": 1553623355953, "text": "Thank you, Johnny! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "109184865380870437193", "name": "Joe Birdwell", "time": 1467655215072, "rating": 5.0, "text": "Friendly sales team, didn't have to worry about someone driving off with the car we were looking at they held it for us while we waited for the insurance check.", "pics": null, "resp": {"time": 1553623496188, "text": "Thank you, Joe! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "101149854975984145710", "name": "Joshua Blackwell", "time": 1490202215778, "rating": 1.0, "text": "I bought a 1996 Mercedes-Benz C280 from these crooks, and I ended up having to put over $3,000 of electrical work into it over the next several years. Don't go here.", "pics": null, "resp": {"time": 1560366324376, "text": "Hi Joshua, I’m sorry you had this experience, however this car was never at our lot. I believe you have mistaken us for another car dealership. We don’t purchase vehicles this old because they may cause customers issues. Thanks."}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "108049507596331399039", "name": "Mike Royal", "time": 1507160167930, "rating": 5.0, "text": "Great experience, enjoyed doing business there, very friendly, will recommend. Thanks Shelia", "pics": null, "resp": {"time": 1553623380803, "text": "Thank you, Mike! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "111333820986952088875", "name": "Tyler Spigner", "time": 1597936895909, "rating": 1.0, "text": "Knowingly sold me a car with an oil leak. I had a “full warranty” from them and they didn’t honor it. Please please please do not go there.", "pics": null, "resp": {"time": 1612214225664, "text": "Hi Tyler, we understand that you are unhappy, however we did look in our system and you did not purchase a \"full warranty\" with the vehicle. We are a family owned business and it was never our intention to let something so horrible happen to you. We stand behind our vehicles and we check all of them for issues before putting them for sale on our lot. We would never intentionally sell you a vehicle with an oil leak. If there is anything we can do to rectify the situation please give us a call (205)663-9993."}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "101171626387186752855", "name": "Scott Swann", "time": 1489713293218, "rating": 5.0, "text": "I found the car I wanted and walked in with a set price in mind. They actually beat it without even knowing that they did. I couldn't be happier. I will be doing business with them again. Zero hassle and zero complaints.", "pics": null, "resp": {"time": 1553623428926, "text": "Thank you, Scott! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "110321075123693397098", "name": "julian jordan", "time": 1548802383251, "rating": 1.0, "text": "Some issues  didn't expect on the vechile...", "pics": null, "resp": {"time": 1560367436356, "text": "Hi Julian, we are sorry you experienced some issues with one of our cars. Please call us at 205-663-9993 or come by and see us if there is anything we can do to help resolve these issues. Thanks."}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "104801461833583581949", "name": "Jordan Halstead", "time": 1540998966471, "rating": 5.0, "text": "Helped me get a car for a decent price. They really do try and help you out.", "pics": null, "resp": {"time": 1553623208874, "text": "Thank you, Jordan! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "108930406682938971057", "name": "Tara Brown", "time": 1553542909320, "rating": 1.0, "text": "These people at this place customer services is horrible especially Sheila and the cars are a pieces of junk...Please don’t waste your time or money on these junk cars!!!", "pics": null, "resp": {"time": 1554909486128, "text": "Tara, We are so sorry you feel this way. Please give us a call to attempt to rectify the situation."}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "103570724663183788725", "name": "Danita Crear", "time": 1521778781699, "rating": 2.0, "text": "Rusty, salt damaged engines. Buyer beware.", "pics": null, "resp": {"time": 1560368261080, "text": "Hi Danita, we do not sell vehicles that have “rusty, salt damaged engines.” We believe good people deserve great deals, as well as great vehicles."}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "103403739093419049204", "name": "marc quiggle", "time": 1523719448918, "rating": 5.0, "text": "Great buying experience!", "pics": null, "resp": {"time": 1553623321314, "text": "Thank you, Marc! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "109088762366483547257", "name": "B. Dewitt", "time": 1351974920756, "rating": 4.0, "text": "Very satisfied.", "pics": null, "resp": {"time": 1553623571223, "text": "Thank you, Barrett! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "116933915985585472572", "name": "Stacie Brown", "time": 1504459577294, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1553623404852, "text": "Thank you, Stacie! We appreciate you!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "109363736434306732188", "name": "Yolanda Molina", "time": 1565055163811, "rating": 5.0, "text": "(Translated by Google) It is a good place with very friendly staff and good prisoners excellent cars\n\n(Original)\nEs un buen lugar con un personal muy amable y buenos presios exelente carros", "pics": null, "resp": {"time": 1565105778319, "text": "(Translated by Google) Thank you very much and we hope to do business with you again in the future!\n\n(Original)\nMuchas gracias y esperamos volver a hacer negocios con usted en el futuro!"}, "gmap_id": "0x88892934cf65579f:0x6626919cc78ffc39"}
{"user_id": "105438737965357469618", "name": "Missy Shani", "time": 1533572553485, "rating": 5.0, "text": "Meh", "pics": null, "resp": null, "gmap_id": "0x88928e0745564dd7:0xe41dcc4942efd99a"}
