{"user_id": "103471902839248208111", "name": "Jonathon Broadhead", "time": 1620391488893, "rating": 5.0, "text": "We switched our auto and business insurance to State Farm with Lee and his team. They went above and beyond to ensure we were properly covered. His team is a pleasure to deal with. I highly recommend using them.", "pics": null, "resp": {"time": 1620403974550, "text": "Thank you Jonathan for the kind words!!  We are glad we could take care of all your business insurance and personal insurance needs!!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "102326067421346311109", "name": "Kelsey Smith", "time": 1612976909835, "rating": 5.0, "text": "Couldn't ask for a better experience. Not only was my quote significantly cheaper than the competition, my interaction with the agent(s) was swift and professional. All questions were answered thoroughly. Lee and Taylor provided the best experience I've ever had with any insurance agency. I recommend them to anyone!", "pics": null, "resp": {"time": 1612985525687, "text": "Thank you Kelsey for the kind words!  I am glad that Taylor and could get you guys taken care of!!  Glad to have you as our customers!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "114482619688202552534", "name": "Dee Pereira", "time": 1616307900029, "rating": 5.0, "text": "I really only talked to them on phone. They were very pleasant and helpful to me. My business with them was quick and painless. I was able to set up my auto insurance. I  would recommend them.", "pics": null, "resp": {"time": 1616328293461, "text": "Dee thanks for the kind words!!  We are glad that we could make the process of switching your insurance over painless!!  We look forward to taking care of you for many years to come!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "107167273870447555761", "name": "Casey Day", "time": 1612984423931, "rating": 5.0, "text": "Knowledgeable and professional, Lee and his team are unmatched in customer service! We have had such a good experience switching insurance companies and we will be with them for the foreseeable future. 10/10 would recommend for anyone shopping around for a new agent!", "pics": null, "resp": {"time": 1612985335626, "text": "Thank you for the kind word Casey!  We enjoy taking care of our customers and are glad to have you guys as customers!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "108987892777837689056", "name": "Edward Miller", "time": 1616198497204, "rating": 5.0, "text": "Lee and his staff has the absolute best customer service of any insurance company I have ever dealt with.  They are professional, responsive, and always \"go that extra mile\" to ensure their clients needs are satisfactorily  met.", "pics": null, "resp": {"time": 1616328225962, "text": "Thank you for the kind words Mr. Edward!!  It is our pleasure to always go the extra mile for our customers and we appreciate having you as one of our customers!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "110472524062301389990", "name": "allie carpenter", "time": 1611110739966, "rating": 5.0, "text": "I am grateful to have known Lee and his family for years! I’ve always thought highly of them and now am grateful to be considered a customer of Lee Milliner  State Farm! More than just good insurance but also a team of people that genuinely care about the needs of their customers! I recommend to anyone!", "pics": null, "resp": {"time": 1611150416847, "text": "Thank you so much Allie for the kind words!!  Proud to have you as a friend a d now a customer!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "105497296728647536771", "name": "Samantha Jones", "time": 1611334061006, "rating": 5.0, "text": "Great company and great people! Lee and Kaylyn did a great job of taking care of me and then helped me find a new agent when I moved to another state! I absolutely would recommend them. They are kind people who do everything they can to help you.", "pics": null, "resp": {"time": 1611336039310, "text": "Hey Sam thanks for the kind comments!!  Myself, Kaylyn and the rest of the team love making sure our customers are taken care of!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "103130111839741741413", "name": "beth bullard", "time": 1610566170784, "rating": 5.0, "text": "Lee is great! Makes you feel very welcome. Never been more satisfied than I am with State Farm. Keep up the great work. You definitely look out for you customers and get them the best of everything you offer.", "pics": null, "resp": {"time": 1610569394517, "text": "Beth thank you for the kind words!!  We love taking care of our customers and making sure they get top notch service for their insurance needs!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "113942886505746447703", "name": "Justin Corbitt", "time": 1611699383749, "rating": 5.0, "text": "Great people to deal with. Always very responsive on anything that I need. Not to mention their pricing is very competitive", "pics": null, "resp": {"time": 1611760917594, "text": "Justin, thanks for the kind words!  Glad to have customers like you!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "103385683746024614757", "name": "Judy Morgan", "time": 1610576440274, "rating": 5.0, "text": "I have known Lee Milliner for 10 years or more - I knew he and his office would treat me fair and give me great service - To this date I have not been disappointed in  their service - Great to have someone that cares and will work with you - Just like a family", "pics": null, "resp": {"time": 1610577154132, "text": "Thank you for the kind words Ms. Judy!!  You took care of me for many years now we are just repaying that to you!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "104086047051861717029", "name": "abby beard", "time": 1611356783747, "rating": 5.0, "text": "Great people to work with! Made my first time buying auto insurance a great experience! Go see them!", "pics": null, "resp": {"time": 1611425763022, "text": "Thanks for the nice comments Abby!!  We are glad we could make your auto insurance experience seamless for you!!  Excited to have you as a new customer!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "104945258289276218128", "name": "James Wiley", "time": 1611156595777, "rating": 4.0, "text": "Always talk me in a nice and Professional manner and good support when I need it, glad that I chose state farm.", "pics": null, "resp": {"time": 1611194040188, "text": "Thank you for the kind comments Mr. Wiley!  We look forward to taking care of you for many years!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "112391534557543287703", "name": "Regina Pitts", "time": 1600800359528, "rating": 5.0, "text": "State Farm has been a part of my life since childhood. Never have I had a more caring and awesome staff as the one in Lee Milliner's office. Thank you for always being there and for being a breath of fresh air ‼️", "pics": null, "resp": {"time": 1600868722880, "text": "Thank you Regina for your kind comments!!  We enjoy taking care of your auto and home Insurance needs!!  We love taking care of our customers and look forward to taking care of you and your family for many years to come!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "114332591982943239232", "name": "Ashton Hurt", "time": 1611363638054, "rating": 5.0, "text": "Probably the best State Farm agency in enterprise and even the surrounding areas 10/10 would recommend. 👍🏼", "pics": null, "resp": {"time": 1611425791772, "text": "Thanks Ashton for the shoutout!!  Thanks for recommending us!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "104075972169919352589", "name": "Chris Henderson", "time": 1610760377119, "rating": 5.0, "text": "Lee and his staff are great!! They are always available to answer any questions!", "pics": null, "resp": {"time": 1610760941045, "text": "Thank you for the kind words Chris!!  We appreciate you as a customer and look forward to taking care of y’all for a long time to come!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "109178650307140351726", "name": "Candice Nelson", "time": 1605043383606, "rating": 5.0, "text": "I just switched from Alfa to state farm. The customer service is fantastic and the quote is the best in town. Thank you Kim for all your help!!!", "pics": null, "resp": {"time": 1608228422549, "text": "Candice thanks for the review!!  We appreciate you trusting us with home and auto insurance needs!!  Glad Kim was able to take such good care of you!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "101125300183130835766", "name": "Huey Cardwell", "time": 1612916498630, "rating": 5.0, "text": "I have only been with Lee for a few months and have been extremely pleased with all the services he offers.", "pics": null, "resp": {"time": 1612917287852, "text": "Thank you Mr. Huey for the kind words!!  We appreciate having you!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "112556500249748693626", "name": "Evelyn Zuhse", "time": 1610575309214, "rating": 5.0, "text": "This team is very professional and on top of the Insurance game.  No one else needed.", "pics": null, "resp": {"time": 1610577195983, "text": "Thank you Ms. Evelyn for the kind words!!  We appreciate and enjoy having you as our customer!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "117757358203348546483", "name": "Kaylyn Beard", "time": 1576794684848, "rating": 5.0, "text": "Best risk advisor in town! Lee knows his stuff! I enjoy working alongside him and Kim daily while we do our best to take care of Enterprise!", "pics": null, "resp": {"time": 1576801048416, "text": "Thank you Kaylyn for your kind words!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "103570843244836312620", "name": "Kaitlyn Boswell", "time": 1611265094173, "rating": 5.0, "text": "All the employees are helpful and friendly!", "pics": null, "resp": {"time": 1611266048505, "text": "Thank you for your kind words Kaitlyn!!  We are happy to have you as a customer and enjoy taking care of your insurance needs!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "116293169641325170853", "name": "Escape Enterprise", "time": 1581966504566, "rating": 5.0, "text": "Lee and his team do a wonderful job of making sure that your every need is taken care of. They are very thorough as well as fair.", "pics": null, "resp": {"time": 1581979463606, "text": "Thank you very much!!  We enjoy taking care of our customers!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "100188560168072150550", "name": "Talbot Stark", "time": 1616192039396, "rating": 5.0, "text": "So pleasant and professional", "pics": null, "resp": {"time": 1616328145338, "text": "Thank you Mr. Stark!!  We enjoy taking care of you!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "116405817300794033350", "name": "Scotty Hutto", "time": 1551203759286, "rating": 5.0, "text": "Had a great experience with Lee and his team. They took their time and reviewed what insurances would work best for my family’s coverages. I would recommend them for anyone who has questions about their insurance policy’s.", "pics": null, "resp": {"time": 1551210788863, "text": "Thank you for the kind words Scotty!!  Glad we got you taken care of!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "117387118222574709137", "name": "Debroaha Petersen", "time": 1556154206740, "rating": 5.0, "text": "Lee Milliner has a great staff. They are always helpful with any questions. I have been very satisfied with the change.", "pics": null, "resp": {"time": 1556277712057, "text": "Thank you very much Ms. Debroaha for your kind words. We look forward to taking care of you for many years to come!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "109180610136268730638", "name": "Beerdin", "time": 1610553757824, "rating": 5.0, "text": "Great team!", "pics": null, "resp": {"time": 1610562860455, "text": "C thanks for the shoutout!!  We do have a great team taking care of your auto, home, and life insurance needs!!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "103134926094323171198", "name": "April Tucker", "time": 1547826350559, "rating": 5.0, "text": "Great agent with several years experience in the insurance industry.  Highly recommend Lee and his team.", "pics": null, "resp": {"time": 1547849254082, "text": "Thank you April for your kind words!!  We love our customers and the Wiregrass area!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "107650353359394092212", "name": "Angela Allen", "time": 1602330273013, "rating": 5.0, "text": "Kind help", "pics": null, "resp": {"time": 1602429195667, "text": "We appreciate you Angela!!  Glad to take care of your auto insurance needs!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
{"user_id": "106123515061936640928", "name": "Jill Lloyd", "time": 1568643158964, "rating": 5.0, "text": "Lee is an awesome agent!", "pics": null, "resp": {"time": 1568649704860, "text": "Thank you Jill!!  We enjoy taking care of our customers!!"}, "gmap_id": "0x88926f4eff0c2d03:0x3e1e26d5a85e8c77"}
