{"user_id": "101487715862290106103", "name": "Justin Denino", "time": 1627840160771, "rating": 5.0, "text": "Had a great experience with this facility. A variety of equipment was readily available and the classes were welcoming and provided an excellent workout. Kristen slayed her spin/combat cardio class with not a second wasted from beginning to end. Awesome workout! 🏋️‍♂️", "pics": null, "resp": null, "gmap_id": "0x889a408fc8f01cd7:0x850f811076522be2"}
{"user_id": "115252346240742485438", "name": "scott tate", "time": 1618718103140, "rating": 5.0, "text": "Mallory is the ultimate trainer as well as the gym owner.  She's extremely intelligent on all parts of conditioning and diet and knows how to adapt a training program to an individual's needs.  The gym is well stocked with modern equipment including machines, loose weights, and a full assortment of training accessories.  All staff are very friendly and the gym is well maintained.  Other services include various cardio and conditioning classes and a staff of one on one trainers.  I can't say enough about how totally awesome my experience here has been. I love Mallory and this gym as her experience as an authentic trainer has upped my fitness level and lifestyle between the training and diet advice.  I've been a member of many gyms, but this is my favorite and I highly recommend it!", "pics": null, "resp": null, "gmap_id": "0x889a408fc8f01cd7:0x850f811076522be2"}
{"user_id": "105514115001048784816", "name": "Joe Booksh", "time": 1620294812565, "rating": 5.0, "text": "Fairhope Fitness is the best gym in Fairhope.   Mallory, the owner, is so awesome and very helpful.     The classes are great too!", "pics": null, "resp": null, "gmap_id": "0x889a408fc8f01cd7:0x850f811076522be2"}
{"user_id": "100419081312835890267", "name": "Emily Elrod (Workzbe)", "time": 1618660904114, "rating": 5.0, "text": "Beautiful facility and Best trainer ever works there. Ask for Sara if you can. Trust me, she is soooo worth it.", "pics": null, "resp": null, "gmap_id": "0x889a408fc8f01cd7:0x850f811076522be2"}
{"user_id": "101644378457227527216", "name": "John J McGuinness", "time": 1599338269659, "rating": 5.0, "text": "After arriving in Fairhope  a month ago from New York, where gyms had been closed for five months, there was Fairhope Fitness, a 247 access gym With lots of ways to get your body going.. Mallory, who is the owner and trainer herself  has put together a great staff. Her personal story is inspirational,  which is why she’s created an environment where fitness is both an “inside and outside job”.\n\nFairhope Fitness has a really good vibe where clients can develop a fitness program that works for them which a variety of workout activities including  TRX, weights, cardio and yoga and nutrition counseling.\n\nMore than a gym it’s a place for wellness and community.... Love it.", "pics": null, "resp": null, "gmap_id": "0x889a408fc8f01cd7:0x850f811076522be2"}
{"user_id": "109889992593052182420", "name": "Louisa Whitmire", "time": 1593784018235, "rating": 5.0, "text": "I have been working out at this gym for about 8 years.  It has always provided me with the workout equipment I need. They also have awesome trainers and free classes offered with the membership. The gym recently changed ownership and I have noticed the owner has been frequenting the gym more than the previous one. She’s personable and very helpful if you have questions/comments/concerns. I enjoy my workouts there because I can get my pump on with zero interruptions. I also enjoy the fact that the gym is central to downtown Fairhope. Oh and last thing the gym is open 24/7 so if you want to roll up to work out at 12 am you are totally allowed to do that. 5/5 gym experience!", "pics": null, "resp": null, "gmap_id": "0x889a408fc8f01cd7:0x850f811076522be2"}
{"user_id": "106729633709826892787", "name": "Edward Stratton", "time": 1504720358115, "rating": 5.0, "text": "This gym may be small, but it's definitely one of the better ones . No one really bothers you, you can do your workout in peace and move on about your day. Thanks for keeping this gym d-bag free.", "pics": null, "resp": null, "gmap_id": "0x889a408fc8f01cd7:0x850f811076522be2"}
{"user_id": "114105976783824091604", "name": "Tyler Tunstall", "time": 1526340645383, "rating": 5.0, "text": "Good gym but small", "pics": null, "resp": null, "gmap_id": "0x889a408fc8f01cd7:0x850f811076522be2"}
{"user_id": "114755534852122585159", "name": "Mallory Johnston", "time": 1583507285956, "rating": 5.0, "text": "Zoom Indoor Cycling provides fast-paced, instructor-led group workout classes where you control the intensity. From the staff to the instructors to the owners, Zoom employees welcome you from the beginning and are always happy to help you be your best during the 45-minute workout.\n\nZoom provides a great HIIT and high cardio workout. It has improved my running without any additional training (I hate running but sometimes 5ks are fun?).\n\nIf you are trying to find a new workout, checkout Zoom.  It won’t be easy but you’ll feel incredibly accomplished when you leave drenched in sweat.\n\nDon’t forget! Your first class is free!", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
{"user_id": "117858111132515326825", "name": "Hannah Williams", "time": 1570588455815, "rating": 5.0, "text": "I love love love this place. The workouts are always fun, yet challenging. I never feel like I’m being judged. The instructors and staff are friendly and helpful. The facilities are top notch. And amazingly, at 9 months pregnant, I can still do the workouts (modified) without causing pain or unnecessary stress on my body.", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
{"user_id": "100235005081965865563", "name": "Virginia Hargis", "time": 1581957587003, "rating": 5.0, "text": "I have been attending Zoom for about 1.5 years, and I absolutely love this place! The the instructors are friendly, the studio is very nice, and you’re always guaranteed a good sweat! I highly recommend as one of the best workouts in Huntsville.", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
{"user_id": "106529953301561865637", "name": "Casey Craig", "time": 1582117840274, "rating": 5.0, "text": "Zoom is so great. As a person who is not so fond of cardio, they make it fun and exciting during each and every class. The instructors are the best & the sense of community is awesome! Love my Zoom fam! 💜", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
{"user_id": "115221155779211836706", "name": "Stephanie Mauro", "time": 1559671096633, "rating": 5.0, "text": "An amazing workout! I love that they have theme rides and periodically hold charity rides to donate money to great causes. They try to be involved in the community and partner with other local establishments quite frequently.", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
{"user_id": "100316387123092659203", "name": "Gretchen Mills", "time": 1584019113926, "rating": 5.0, "text": "Always look forward to class! Zoom has a great atmosphere and staff!! Highly recommend", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
{"user_id": "113931828062096136196", "name": "Gretchen Lindley", "time": 1576936605720, "rating": 5.0, "text": "We decided to do a family class at 7am after a night of drinking. Anna kicked our butts but was the absolute best time!!! This was a first for all of us & we all loved it! We will be back! Thank you Anna!", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
{"user_id": "117518055704677608786", "name": "Brent Vogt", "time": 1590165911383, "rating": 5.0, "text": "Love this place! Great people, great atmosphere.", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
{"user_id": "116102599398274973629", "name": "Kendall Rader", "time": 1536201089407, "rating": 5.0, "text": "I love this place! I had never done a cycling class before and thought I'd give it a try (since the first class is free). The staff at Zoom are so upbeat and helpful! You don't have to be a cycling pro to have fun at Zoom. Every fitness level can enjoy a class and feel very accomplished after!", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
{"user_id": "111137113695159465831", "name": "Emily Rogers", "time": 1537049948318, "rating": 5.0, "text": "Great staff and awesome classes. Challenging and you always sweat a ton. Really nice amenities with fresh towels, blow dryers, bath products, and anything you could think of. Worth every penny.", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
{"user_id": "109209872725278327922", "name": "Keith Murray", "time": 1553693240361, "rating": 5.0, "text": "I was a Zoom member for about 5  months before I moved and really enjoyed it.  Staff was very friendly & helpful no matter what your skill level it.  Would recommend them highly.", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
{"user_id": "116766827267777405334", "name": "Cory Leitao", "time": 1547134886210, "rating": 5.0, "text": "Great atmosphere, each instructor provides a different \"flavor\" of spin. Facilities very clean and well kept. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
{"user_id": "106573494482579209648", "name": "Streeter Michael", "time": 1534000836778, "rating": 3.0, "text": "My experiences where great I loved it. I loved the 30 lunch time classes they where hard and you really worked. The major problem it it is so expensive I can not afford to go anymore. I used to belong to a place that had twice as many classes and I paid 80 dollars a month. Small price = more people going", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
{"user_id": "103487653345088242490", "name": "B E", "time": 1538713181433, "rating": 5.0, "text": "I love zoom! The people are always friendly and encouraging! This is a great place for people new to cycling!", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
{"user_id": "113509674749618942144", "name": "Megan Davidson", "time": 1538154760310, "rating": 5.0, "text": "Best 45 minute workout ever! Love the themed rides and instructors!", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
{"user_id": "116358472022359611156", "name": "Lacy Berry", "time": 1519924078819, "rating": 5.0, "text": "Extremely clean, friendly people, and professional workouts. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
{"user_id": "109361536408043540999", "name": "Trisha Takanawa", "time": 1518746028087, "rating": 5.0, "text": "OMG!!!! First off I have never Cycled before. But this was the best thing I have done in 2018. The atmosphere when I walked in the door was sooo welcoming and fun! Everyone was upbeat and pleasant!! The place is very  clean and customer friendly! The class was extremely fun and upbeat. Jasmine ( the instructor) is AWESOME!!!!!! She was soo fun and energetic! Although I did not continue the entire class ( out of shape lol) there was NO JUDGMENT!  I was educated on things I can do and motivated to come back! I will DEFINITELY be back!!", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
{"user_id": "105971635602237649534", "name": "Sundance Knox", "time": 1513781014181, "rating": 5.0, "text": "Fun classes. Great location and facility.", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
{"user_id": "100664618416193845847", "name": "Michelle Fernandez", "time": 1581944080182, "rating": 4.0, "text": "Great workout!!!", "pics": null, "resp": null, "gmap_id": "0x88626b50d5fcc423:0xc56dd7bf075339a"}
