{"user_id": "108614218106347132040", "name": "Johnathan Mitchell", "time": 1628271145689, "rating": 2.0, "text": "My experience with Watts Realty was great up until it was time to move out. I was charged an absurd amount for not cleaning leaves off the back patio area, even though I called prior to moving out and asked if I needed to clean the area. Not to mention, the area was full of leaves and trash when I moved in. There needs to be better communication between the landlords, so this problem does not happen. I will say the representative I spoke with was always professional and pleasant. However, it is extremely frustrating to be charged for something you were explicitly told did not have to be cleaned.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "100393639034289471497", "name": "Jeannie Evans", "time": 1625066855146, "rating": 5.0, "text": "Watts Realty has managed apartments\nfor my family for 3 generations. They have a highly qualified, professional staff who have always done an excellent job to enhance the value of our property and keep it fully occupied, while keeping the tenants happy. I would recommend them to anyone!\nJeannie Evans", "pics": null, "resp": {"time": 1625089125125, "text": "Thank you for very for your review! It has been our pleasure for our company to work with you and your family to protect, manage & grow your real property assets over the years.  We appreciate the opportunity to be of service for all of your real estate needs! Thank you for continuing to utilize Watts Realty!!"}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "116474851893345762656", "name": "Willie Frazier", "time": 1624632481825, "rating": 5.0, "text": "Brett and Cliff does quality work and very professional.  I sure appreciate them. They always do a good job.", "pics": null, "resp": {"time": 1624646222055, "text": "Thank you for your kind comments! We will let both of them know your appreciation!"}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "102737778781057098505", "name": "Lyn Bloom", "time": 1622058792840, "rating": 5.0, "text": "I reported that had an issue with my door today and they came to fix it the same day. The maintenance department here is very responsive. Brett and Cliff are professional and respectful and never leave a mess.", "pics": null, "resp": {"time": 1622737142983, "text": "We appreciate your kind words!"}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "106863628424491787359", "name": "Tiffany Ellis", "time": 1617208887866, "rating": 5.0, "text": "Me and my boyfriend are in the first week of renting here and found a few things we wanted checked on by maintenance. I made a request through the tenant portal on Sunday and today, Wednesday, maintenance came out to fix the issues. I would say three days is not a long wait time. He was very nice and listened to my requests and did everything he could to make sure it was all fixed. I’m very happy with how things are going so far into renting through Watts Realty.", "pics": null, "resp": {"time": 1622737245484, "text": "Thank you!"}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "113127606912045626463", "name": "Sheryll green", "time": 1620058615155, "rating": 5.0, "text": "My Maintenence service request was taken care of within 24 hours by serviceman Brett, who was professional, nice, thoughtful and diligent in duties. Very kind and respectful. Did not create a mess and took care of each of my requests in a timely manner and was very neat and clean in performance.", "pics": null, "resp": {"time": 1622737204318, "text": "Thank you!!"}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "111974051892195855165", "name": "Valencia Banks", "time": 1623428750376, "rating": 5.0, "text": "Brett is great he's always professional and never leaves a mess when he comes...thx", "pics": null, "resp": {"time": 1623430322521, "text": "Thank you for the kind review.  We will be sure to let Brett know he's appreciated."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "113157758825232291867", "name": "Omarace Radford (GHOSTT)", "time": 1622665960677, "rating": 5.0, "text": "Brett is very Professional & very courteous!!! Always fixes my problems whenever I call the Realty office!!! Very appreciative of his work!!!", "pics": null, "resp": {"time": 1622737168340, "text": "Thank you for your kind words!"}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "103837046116466243909", "name": "Stephen Copeland", "time": 1599970200733, "rating": 5.0, "text": "Been with the company for almost twenty years, great management staff, very dependable, and fair with property management.  They will manage and make tenants accountable by law.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "113511472598205751245", "name": "Jackie Williams", "time": 1616101811575, "rating": 1.0, "text": "Liars*** rent to whom they choose never was my credit ran NEVER **", "pics": null, "resp": {"time": 1616167263064, "text": "Ms. Williams.\n\nThank you for your review.  With your rental application you recently authorized Watts Realty to obtain an investigative consumer report from AppFolio, Inc., who provided us with the information regarding your credit history.  Because of privacy laws we cannot discuss in detail regarding your complaint in a public forum. However, you will be receiving a letter in the mail regarding this decision and contact information for the reporting agency.  You have the right to obtain a free copy of the report if you submit a written request to AppFolio, Inc. no later than 60 days after you receive the notice in the mail.  If you do not receive the letter providing you with the information indicated, please contact our office direct."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "102515470534758046713", "name": "Tyiesha Jordan", "time": 1622665969129, "rating": 5.0, "text": "Brett always helpful", "pics": null, "resp": {"time": 1622737180287, "text": "Thank you!!"}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "105970757067103209668", "name": "Rosalind Lewis", "time": 1596501943910, "rating": 3.0, "text": "The clerk's at the front desk are informative and when requesting a look at an apartment , searching for the address on buildings caused tremendous stress. Numbers were different than given.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "109287471340290177596", "name": "raven Johnson", "time": 1604332929867, "rating": 1.0, "text": "I will not recommend them to anyone they are not understanding and they do not answer maintenance requests, emails, voicemails", "pics": null, "resp": {"time": 1604953450745, "text": "Ms. Johnson, we apologize for any inconvenience you have experienced. As you are aware, we have modified your lease, at your request, multiple times and have attempted to address each request you have made. We have attempted to reach out to you via private communication regarding your last request; however, we have not received any further information or communication from you since October 20 other than this negative review.   Please contact our office to complete the final paperwork you requested."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "101271938316157060068", "name": "Free Forme", "time": 1590557765366, "rating": 1.0, "text": "Horrible company. Stephanie was really rude. She told me that (watts) didn't want people of color in their homes. She hung up in my face repeatedly. I continued to call back and never was able to speak with anyone. This is beyond disgrace. Take your money elsewhere.", "pics": null, "resp": {"time": 1590608951305, "text": "Free Forme, thank you for your comment. Our company takes allegations of this nature very seriously. We provide equal housing opportunities to all people, regardless of race, color, religion, sex, handicap, familial status, national origin, sexual orientation or gender identity. Our staff are trained to be responsive to our callers at all times. Very rarely, a caller becomes verbally abusive. If this happens, our staff are empowered to warn the caller about any abusive language used before disconnecting the call. Our president, Chip Watts, is available to discuss this or any other issues you or any other viewers of this review may have. His direct line is 205-703-4277."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "116605722222385552176", "name": "Priscilla Speller", "time": 1578091565344, "rating": 1.0, "text": "I do not recommend this place at all scam artist to the max I done contacted this office soo many times about so many issues done had they contractor come take pictures of mold in my house bees nests etc none has been done son got stung he’s highly allergic that’s when they finally came to do something I have this huge while in my ceiling from the rain owner is trying to swap the dates and lie about a bunch of stuff even though there been paper trails witnesses etc etc place is just something else so I’ve been paying rent for a place i can’t even stay at smh management should be ashamed of themselves", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "110047117994901560761", "name": "Hollie Deaver", "time": 1441338852085, "rating": 5.0, "text": "I submitted an inquiry email last week for an online listing at 5:30am. I received a response from each of the employees I emailed. The first response at 8:34am, and the second response came before noon. The experience I've had is flawless. Kaitlin and Michael are both extremely professional, viewing the unit was completely hassle-free, and every step in the application process has been clear. I highly recommend Watts Realty to friends, family, coworkers, and the public.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "108660659058935916743", "name": "Xuan Huang", "time": 1504989345681, "rating": 5.0, "text": "We highly recommend Watts Realty Company.\n\nMr David Watts was our agent when we started to search for commercial property in downtown Birmingham. We were extremely picky in what we want, and because this was our first real estate investment, we were extremely cautious - for every property that interested us, we made multiple visits. In other words, David was not having an easy job being our agent, however, he showed great patience and understanding toward us. As the first-timers, we had A LOT of questions about properties, inspections, regulations, property management, etc, and David Watts always gave us satisfactory answers or referred us to other professionals. He assisted us in every step and met with us as soon as we sent in requests. With David's help, we found and purchased a property we loved, and it may not have happened if we worked with someone else.\n\nLast but least, we are thankful the the entire Watts company crew who helped us arrange the meetings, look up some paperwork, buy the insurance, etc. We highly recommend Watts company and we are thankful that David was our agent.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "116794898271334198442", "name": "Teresa Hill Berry", "time": 1553220735303, "rating": 3.0, "text": "Most of their Apartments I do like however I've only known them to offer gas I don't want gas a lot of people don't want gas along with that I think the apartments are overpriced. I think that they should at least online tell you how much square footage and show the floor plan of the apartments as well. Today is at 8 at this review I would like to share this I have no intention of paying gas light water and rent. If I rent from Watts Realty and adding additional bills that I have not had an approximately 20 years.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "101550303594346479564", "name": "Martin Williams", "time": 1539976536644, "rating": 5.0, "text": "Watts is outstanding to deal with... they answer all my questions and their staff if very nice.  I Highly recommend them to either tenants or property owners", "pics": null, "resp": {"time": 1539982153675, "text": "Martin, thank you for your review...we are happy to be of service for your real estate needs!"}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "116503452684472352793", "name": "Vincent (Vince) Bolus", "time": 1559678032763, "rating": 1.0, "text": "Even after dealing with predatory management in the Tuscaloosa student housing scene for the last few years, the people at Watts Realty somehow managed to be even ruder and disrespectful than I could have imagined. It was nearly impossible to get into contact with a property manager while wanting to view an apartment (I called at minimum of 10 times and was never able to get on the phone with her once). The receptionist(s) is rude as well and always tended to rush me off the phone. When I expressed interest in talking to a property manager to the receptionist, without fail, the excuse was either that the PM was either \"not in yet\" (at 11 A.M., sure), or \"on the other line.\" I will never rent from these people. Check the other reviews if you want more horror stories.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "107631625689229352011", "name": "Cynthia Wilson", "time": 1568341619982, "rating": 1.0, "text": "I went down to the office at the end of March because the apartment i wanted was available April 1. I had already seen the apartments due to a recent tenant and I like what i seen so I  put in a application to the address 705 1st St. S  in titusville. I used my real name which is Cynthia Jenkins. The lady at the desk informed me that the apartment wasn't ready yet but I told her that was  aware and just putting in my application early so it could be processing because I had really needed the apartment. I put in my application that morning and around 3 the same day was denied the apartment by a lady in your office. She told me they would be sending me the papers why i was denied and never received them. Very poor customer service skills need a better staff I would recommend them to no one also was told to edit my review and did because apparently now i'm lieing on the company and don't know where i applied to. Just ridiculous", "pics": null, "resp": {"time": 1568302601219, "text": "Ms. Wilson (Jenkins), thank you for providing us with your \"real name\" so we can address this issue to you. Our application process usually takes approximately 48 hours to complete. As such, we do not deny applicants on the same day.  We mailed a formal letter to you via USPS that explains what information was used in regards to your application. That letter also provides contact information for the consumer-reporting agency that prepared your Investigative Consumer Report. You have a right to a free copy of the report and to dispute the completeness of accuracy of any information in the consumer report with the consumer-reporting agency."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "104874101493045588824", "name": "Justin Forbes", "time": 1528824065652, "rating": 1.0, "text": "If negative 5 stars was an option, I would choose that. David Watts is a property manager there who blatantly violated my rights under the Alabama Uniform Residential Landlord and Tenant Act as well as several articles of his own professional code of ethics as a Certified Property Manager. If you want to receive the respect you deserve as a tenant and have your rights upheld, do yourself a favor and never rent from this company.\n\nHi Michael,\n\nIt's nice to hear your rationalizations in defense of your younger brother's behavior, but I am more interested in the opinions of the Jefferson County Court of Law and the IREM ethics board.", "pics": null, "resp": {"time": 1528734635206, "text": "Mr. Forbes, we appreciate you taking the time to rate our company and provide a review.  After reviewing your concerns and your lease, we have determined that there have been no violations of the Alabama URLTA or the professional Code of Ethics to which our company adheres. Based on the documented emails and telephone calls between you, your wife (Ms. Galang) and our office, we attempted to schedule the shower leak repair multiple times during a time when you or your wife would be present. Unfortunately, due to several miscommunications by both parties (including third-party contractors unrelated to our company), this leak was elevated to an emergency status that would allow access to be granted without your presence and/or permission under the Alabama URLTA. Upon entering the premises, multiple other lease violations were then noted, including the presence of multiple breeds of pets that previously were not disclosed by you or your wife.  We understand your concern about our respect for our residents and their rights; however, the owners of the property also have rights under Alabama URLTA. After an extended period of time not being able to schedule a time when all parties could be present, the owner’s rights to protect the property from continued damage were enforced. We do appreciate your tenancy since mid-May 2018 and apologize that our relationship has degraded in the short time you have been a resident in Alabama. Hopefully, we may be able to better serve you in the future and avoid further miscommunications."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "100167206167242651986", "name": "Emile Hughes", "time": 1596471945151, "rating": 5.0, "text": "Great people, committed to doing a good job", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "109262868358788676851", "name": "Dawg Fan", "time": 1489009567000, "rating": 5.0, "text": "On behalf of Bailer & Brock Investments, I would highly recommend Watts Realty. We are small company with several rental properties to supplement our professional income. Watts offers responsive, thoughtful, personalized (even for smaller clients), and wise advise to help protect our substantial investment. From natural disasters, to terrible tenants, to market knowledge, for almost 10  years, Watts had us covered.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "100355889045727756809", "name": "gcouogluhgit.Jasmine vWilliams", "time": 1513341968398, "rating": 1.0, "text": "Very unprofessional! I started out renting a home from them then one day out the blue they sold the home.. Like are you serious I pretty sure selling wasn't last minute for them so why not let me know as well. Not only that the people they sold to tried to jack up my rent and never fixed anything!", "pics": null, "resp": {"time": 1513370008705, "text": "Ms. Williams,\n\nWe appreciated you as a Tenant during your time with us.  However, we do not appreciate the 1 star and misplaced Google review.  Please recognize the following points.\n\n1)\tWatts Realty does not own property.  We manage for many different third parties.  Your lease document would have the name of the Landlord when it was under our management.\n2)\tInvestment properties are sold in the normal course of business every day across the globe.  We cannot control our Clients’ decision to sell their own property(ies).   Sometimes Watts Realty isn’t involved with the sale transaction, only to receive notice the day of a sale.\n3)\tInvestment sales fall through in the normal course of business every day across the globe.  We cannot notify Tenants of the numerous potential transactions, especially when many never coming to fruition.  Due diligence periods extend to the date of Closing in many, many cases.\n4)\tThe property in which you reside was sold over 18 months ago in May of 2016.  We promptly notified you of the sale, and have not been associated with that property since May of 2016.\n5)\tDue to this Google review, we contacted your Landlord just to inquire about the situation. We have no involvement or contribution with your problems with your Landlord.  We do not manage the property, nor are they a Client of Watts Realty. Please do not misplace your frustration on us. You need to work with your Landlord to resolve those issues."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "111879888276420925405", "name": "Amanda Johnson", "time": 1411159900246, "rating": 1.0, "text": "Thought I found a great property but took forever to get stuff fixed and now that I have moved, they are siding with the landlord to try and get me to pay for stuff that I am not responsible for. Stuff that was not even in the lease. I figured keeping my deposit would be enough but no they want more money.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "118368357415377647047", "name": "Cris Galang", "time": 1528691857854, "rating": 1.0, "text": "DO NOT RENT HERE. THEIR LOW STAR RATING SAYS IT ALL. These are horrible people who treated me and my husband with such disrespect. It seems like they are nice to you if you let them manage your property but they treat renters differently. It took them 3 weeks to repair leak from upstairs shower (obviously not emergent to them, didnt even bother following up the first week if the plumber they hired came and did the job). Then persisted in entering our home without prior notice even when we explicitly didnt give them permission to do so, clearly a violation of our privacy.", "pics": null, "resp": {"time": 1528490457289, "text": "Ms. Galang, we appreciate you taking the time to rate our company and provide a review.  After reviewing your concerns, we have determined that there have been no violations of your privacy outside of the lease terms you agreed to adhere by. After you reported the leak on Sunday, May 27, during the Memorial Day weekend, the leak was assigned to a third-party contractor for completion. Regrettably, the shower drain requires a special tool to repair and the contractor did not have such tool available at the time they were on the property on May 27 (the same day you reported the leak). Based on the documented emails and telephone calls between you, your husband (Mr. Forbes) and our office, we attempted to reschedule the shower leak repair multiple times during a time when you or your husband would be present. Unfortunately, due to several miscommunications by the parties involved, this leak was elevated to an emergency status that would allow access to be granted without your presence and/or permission as per the terms of your lease. We entered your premises on June 8, less than two weeks after you reported the leak, to complete the repair by the contractor while being supervised by one of our employees. After we entered your premises, several lease violations were then noted - including the presence of multiple breeds of pets that previously were not disclosed by you or your husband.  We understand your concern about our respect for our residents and their rights; however, the owners of the property also have a responsibility and rights to protect their property (and your home). After an extended period of time not being able to schedule a time when all parties could be present, the owner’s rights to protect the property from continued damage from the leak were enforced - which triggered other property rights issues that we are attempting to work with you for you to bring into compliance with the terms of our lease. We do appreciate your tenancy since mid-May 2018 and apologize that our relationship has degraded in the short time you have been a resident in Alabama. Hopefully, we may be able to better serve you in the future and avoid any further miscommunications or lease violations."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "111597448468372536851", "name": "Amber Lese", "time": 1562783076565, "rating": 1.0, "text": "Never recieved callback for property management. Gave info to two different receptionists, both said they'd call me back....Still waiting....", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "107600611917026089533", "name": "Bogart Daniel", "time": 1534830886611, "rating": 5.0, "text": "Been renting from Watts since 2009. I appreciate the rapid response to necessary repairs.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "101417502656593551708", "name": "Jean Hudson", "time": 1453418790806, "rating": 1.0, "text": "Was VERY uncomfortable with the request for my credit card information to view property! All other realtors gave lockbox code or met us for showing. The property and neighborhood was mediocre at best. Scammers??", "pics": null, "resp": {"time": 1487709535094, "text": "We utilize an automated showing system called Rently for the convenience of prospective tenants on the go and don't have the time to schedule a walk through with our residential property manager.  The credit card information is for security purposes to verify your identity.  It is only a $0.99 charge that allows you access to up to 20 homes that utilize the Rently system or 30 days, whichever comes first.   If you do not feel comfortable using your credit card, please call us and let us know that is the case and we can provide you access by gathering additional identifying information from you.  If you want to walk through with an agent, please call us and schedule a time to do so.  I hope that clears up any confusion."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "104673910191656681848", "name": "David Walsh", "time": 1444224427728, "rating": 5.0, "text": "Very friendly staff. Answered all my questions and were extremely help. I didn't end up renting from them because they didn't have anything available in the area I was looking in. However next time I am looking for something, they will be the first company I call.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "103082982533749814582", "name": "Tiffanyliiolhhhkn ijy Roberson", "time": 1545056666849, "rating": 1.0, "text": "Please do not rent from these people. you will definitely regret it.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "102977397899624241934", "name": "Brian Burke", "time": 1361900635062, "rating": 2.0, "text": "i can't recommend my dog rent from these folks. not worth even calling them", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "100687683077362676635", "name": "Francine Jones", "time": 1540845691095, "rating": 4.0, "text": "They have the best apartment to live in", "pics": null, "resp": {"time": 1540850776206, "text": "Thank you for your positive review - we hope you enjoy your time with us!"}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "102793683616107044407", "name": "JJonathan Coen", "time": 1402709234779, "rating": 1.0, "text": "Wouldn't recommend such unprofessional property managers. Couldn't even get a response to my emails.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "100656287352031513570", "name": "zach garcias", "time": 1487513151406, "rating": 1.0, "text": "Do not, I mean do not rent with Watts Realty. Don't even know why they still in business.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "118079335840727972437", "name": "Tan Gamble", "time": 1487711527136, "rating": 1.0, "text": "After viewing a property that they find renters for I applied. I received a phone call the next day saying that I was denied due to credit. So I called back and asked what the minimum credit score was and there is not one. So how can the a reason why I was denied?", "pics": null, "resp": {"time": 1487785351778, "text": "Ms Gamble, we have mailed a formal letter to you via USPS that explains what information was used in regards to your application.  That letter also provides contact information for the consumer-reporting agency that prepared your Investigative Consumer Report.  You have a right to a free copy of the report and to dispute the completeness of accuracy of any information in the consumer report with the consumer-reporting agency."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "116899580948661063412", "name": "Susan Cotten", "time": 1445020097367, "rating": 1.0, "text": "Called yesterday to ask about property management.  Talked to Raleigh Winstead who promised I'd receive an e-mail from him by 10 a.m. today.  It's 2:49 p.m. and no e-mail.  Hasn't returned call I made to him three hours ago.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "106487978216037651280", "name": "William “Russ” Thompson", "time": 1552329459958, "rating": 3.0, "text": "$100 application fee!!!", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "117974775966838095390", "name": "Exclusive Painting1", "time": 1505756727538, "rating": 5.0, "text": "AAA", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
