{"user_id": "100188475556070003347", "name": "David Sweet", "time": 1625257916749, "rating": 1.0, "text": "These are some of the rudest people l have ever encountered. You cannot get anywhere with anyone in person, or on the phone. They like to hide behind the phone so they can continue to be rude and then put you on hold for so long in hopes that you will hang up.\n\nI understand there is construction going on, but why would you allow them to park their machinery or put their supplies in the handicap spots. Handicap parking is already limited, especially van accessible spots.", "pics": null, "resp": {"time": 1625674720666, "text": "Hi Mr. Sweet, we would like to discuss this matter further. Will you please call our office at 414-5900 and ask to speak with the operations manager so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "114122180049592975248", "name": "Abigail Laird", "time": 1628755521857, "rating": 1.0, "text": "I've had constant pain for years now and because I'm young the doctors feel \"uncomfortable\" trying more serious treatments even though I'm losing my whole life to this pain. For over 2 years I have had to wait 1 to 2 months for my doctors appointments and every appointment they tell me the same thing and go in circles with me, refusing to progress treatment. On top of that when they reply to reviews they copy and paste the same message over and over again. They are not listening to me and they won't listen to you. They don't care.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "100072144027300149007", "name": "V White", "time": 1623944197402, "rating": 1.0, "text": "At first doctor was nice the first few visits. Then the doctor started to act like he did want to be bothered. Came in leaned against the cabinet acting like I was a waste of his time. Yesterday stated he didn’t keep track of my health that I saw specialist for that let them keep track of my seizures and heart. He was only there for general things. But yet he is required by law and my insurance to keep track of who I see and my medical records. To which he demanded I find another doctor all because my disability lawyer asked if he could give his opinion on a form since he was to be talking with all doctors he referred me to. The billing and customer service department of the group believe that I got what I deserve and the doctor is correct. I am a person that has seizures and has AFib and has not been driving since a wreck to where this is the second general practitioner has refused to listen as a doctor should. And force me to find another doctor and the cost of losing everything because of they don’t care.", "pics": null, "resp": {"time": 1624291869282, "text": "We would like to discuss this matter further, so we encourage you to call our office at 414-5900 and ask to speak with the operations manager so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "110408389021647933884", "name": "The Sullivans", "time": 1616935158158, "rating": 5.0, "text": "The doctors are very thorough! The nurses, lab techs, and the entire staff are very professional, helpful, friendly.\nThe Follow my Health app that the doctor office use is very helpful to me. I can keep up with all of my lab results and be made aware of any changes in minutes.\nI would highly recommend A.M.G.", "pics": null, "resp": {"time": 1621282650025, "text": "Thank you for the kind words and the 5-star review. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. Thanks again for the feedback!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108259019381558190450", "name": "Miss Shauntay", "time": 1618478030563, "rating": 1.0, "text": "If you have a bill you can’t even make an appointment. They are going to constantly push that bill in your face. Not only that Dr. Carlos doesn’t care about his patients. More than once he’s come in seen me for 2 minutes and dumped me out. I didn’t feel that I had answers or anything. He just gets his money and doesn’t care. He doesn’t take your symptoms serious. Over a year ago I saw him about symptoms he told me I just needed to lose weight. Long story short I nearly died because of a appendicitis. He doesn’t investigate anything. He writes prescriptions and referrals wrong also. They will get your money for sure! But care is below average. Nurses are nice and fast though", "pics": null, "resp": {"time": 1621282602343, "text": "We would like to discuss this matter further, so we encourage you to call our office at 414-5900 so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "105839049446841841103", "name": "Trevor Bell", "time": 1598745913158, "rating": 1.0, "text": "I am appalled how my mother has been treated and even myself as I was trying to get some answers related to her overall well being. Dr Burch was not concerned about patient care and did not give me the time a day to discuss some concerns I had. After trying to speak with the Practice Administrator, I was given to HR.  If you go here, Do not except phones calls back timely nor compassion regarding your loved ones well being. They should really evaluate their “core values” and conduct some S E R V I C E training within their office and staff.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "106658978299455795244", "name": "Janelle Presnall Barbato", "time": 1597967399917, "rating": 5.0, "text": "Well you might have a little wait time but the doctors are outstanding! I love it! These doctors still come visit you in the hospital!", "pics": null, "resp": {"time": 1598281426049, "text": "Thank you for the kind words and the 5-star review, Janelle. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. Thanks again for the feedback!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "113802026061945133288", "name": "Terri Gaal", "time": 1596136311687, "rating": 5.0, "text": "My family and myself have seen numerous Dr.'s in this group.  They are caring and help address your health issues.  The entire staff is friendly and helpful.", "pics": null, "resp": {"time": 1597683570940, "text": "Hi Terri, thank you for the kind words and the 5-star review. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. We're glad that we can serve and meet the healthcare needs for you and your family."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "114547424449841324436", "name": "RJ Clark", "time": 1594938400854, "rating": 1.0, "text": "This place is ridiculous. Every time I go I have to wait over an hour for an appointment at 2 that will last maybe 10 minutes. After seeing the doctor finally at around 4:45, I was sent to get lab tests and then an x-ray. Lucky for me after I was able to get my lab done it was 5:15. Which is when the x-ray closes. Waste of time", "pics": null, "resp": {"time": 1596136494822, "text": "We value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. We really would like to discuss this matter further so that we can help resolve any issues that may be. Would you mind speaking with our operations manager about your experience?"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "114049596922624930484", "name": "Butch Ladner", "time": 1592501351332, "rating": 3.0, "text": "I like all the doctors that I have seen over the years but I quit going there after I scheduled the 1st blood work appointment of the day. After about 15 minutes past my appointment while sitting in the waiting room, I called and knocked on the door... no response. I had to be at work so I left. Later I filled out forms to have my records sent to another facility but they were apparently never transferred.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "117411607479349393115", "name": "Deanna Davis", "time": 1597868154706, "rating": 5.0, "text": "I love the docs n staff and the fact that they are right at my hospital", "pics": null, "resp": {"time": 1606849123022, "text": "Thank you for the kind words and the 5-star review, Deanna. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. Thanks again for the feedback!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "103597519588746451759", "name": "Kent Busby", "time": 1599001793278, "rating": 5.0, "text": "Fast and efficient!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMDuQ9I70L6wSoG2c4a3s9XRbW8YcHKdw-TiBlb=w150-h150-k-no-p"]}], "resp": {"time": 1606848995468, "text": "Thank you for the kind words and the 5-star review, Mr.Busby. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. Thanks again for the feedback!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108999883754558901602", "name": "Sarah S", "time": 1596091461530, "rating": 1.0, "text": "If you want to waste your time using this Dr's office then this is the place for you! I have NEVER in my life dealt with a medical office with such poor service. Whenever you call this office to leave very important information concerning your health, asking for a NURSE to call you, be prepared to wait days (thats even if you get a return phone call) The Dr seemed like a very concerned physician however his nurses like to treat patients like their the Doctor! I had one nurse who called me back after 4 days and she tried to tell me she knew exactly what the Doctor had ordered me to do with a certain medication and when i ask her how she knew, she tried to tell me she was in the room with the Dr. which I called her out on because she wasnt in the room with the dr and I. A lady by the name of Jordan was, this ladies name was Gloria! When I confronted her and told her NO MA'AM you were not in the room Jordan the dr and myself were the only 3 people in there that day, she put le on hold and later came back to the phone with a different attitude, but informed me that my Dr was out of town and guess what HE HAD NO FILL INS.. I have worked in the medical field and bo that Drs cant just leave their patients without ANYONE to help them with their medical needs!! Long story short I went without my medication from Thursday until the following Thursday! 7 FULL DAYS!! It was no big deal to this lady at all!! I have gladly found another physician and I honestly wouldn't take my animals to this office!! So again if you want to deal with getting the run around THIS IS YOUR PLACE, IF NOT DONT BOTHER EVEN MAKING AN APPOINTMENT!! I will be reporting this medical office!! Thanks for wasting my time Alabama Medical Group!! Maybe dr Rubenstein needs to stick with being the mayor and retire at being a physician!!!", "pics": null, "resp": {"time": 1596136407942, "text": "Hi Sarah,we value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. We really would like to discuss this matter further so that we can help resolve any issues that may be. Would you mind speaking with our operations manager about your experience?"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "109278907505601771623", "name": "Janet Newburn", "time": 1580262751417, "rating": 2.0, "text": "I don’t normally write online reviews, but this group is terrible.  The Doctor’s and staff are nice, but lack professionalism. I see Rubinstein at the Saraland location and Siegel at the Springhill location.\nThe wait times are off the charts. When you ask why you are waiting so long, they either just look at you or push you to another waiting area. My time is just as important as theirs. I was at the Saraland location today for over 2 hours. I saw Rubinstein for approx. 4 minutes. Routine checkup.\nThe staff has not the first clue about what’s going on medically with patients.  I have been called with incorrect information regarding my results, I have had to tell them what they were supposed to be doing per visit with Doctors.  I have been scheduled for a procedure that was ill prepared then I was forgotten.\nOffice Managers, are you reading these reviews?\nPatient care should come first and far most at all times.  The staff in these offices should be more concerned with this than what they are having for lunch.\nI walked out after seeing Rubinstein today after I was left sitting to have blood drawn. (I know how long it takes to draw blood)\nI’m sure they couldn’t care less! Sooner or later this junk is going to catch up with y’all.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "100877325519879114300", "name": "Howard Rhodes", "time": 1594666879937, "rating": 1.0, "text": "They wouldn't call in my blood pressure medication while I was out of town, And had much attitude about it !  So I had to find a new doctor.", "pics": null, "resp": {"time": 1596136522089, "text": "Hi Mr. Rhodes, value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. We really would like to discuss this matter further so that we can help resolve any issues that may be. Would you mind speaking with our operations manager about your experience?"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "103772813478267092741", "name": "Becky Kidd", "time": 1566764803412, "rating": 5.0, "text": "I am so very thankful to Dr. Jonathan Siegel and his wonderful staff. Each person was extremely helpful, professional, and caring to me, from the initial consultation with Dr. Siegel, to follow up after my procedure.", "pics": null, "resp": {"time": 1566930659186, "text": "Thank you for the kind words, Ms. Kidd. We're glad to have Dr. Siegel as a member of our team and are so glad you shared your feedback with us."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "115645794739993181607", "name": "SHANTA EDWARDS", "time": 1568308488496, "rating": 1.0, "text": "This is the worst group in the Bay Area PERIOD!! I was turned away because I couldn't pay $110 on a previous bill that didn't even belong to the Dr I was seeing! I made arrangements on this bill and have been paying monthly but this DR refused to see me still!! All the money that I've paid and my insurance have paid and this is how I'm treated!!! I'm not asking for special treatment, just trying to be treated!\n\nI am in severe pain and I am ashamed for this group that they would care more about money than they would helping care for their patient! What kind of medical practice does this!!!!! Only money hungry ones. I will NEVER come back to this establishment nor will I recommend them to anyone. I am going to share this story on social media as well, to let people see how these practices are letting patients suffer because of the almighty green dollar. It is not right nor is it fair. I could see if I had NEVER paid them anything, but to pay every month even with me not even working, makes this situation not only sad but despicable and down right disheartening.  Thanks so much Alabama Medical Group and your doctor's for always putting money first over patients!!!!!!!!!!!", "pics": null, "resp": {"time": 1568318194483, "text": "Hi Ms. Edwards, on behalf of Alabama Medical Group I apologize that you feel this way. I've spoken with the customer service rep who assisted you today and I have reviewed your file and there seems to be some inaccuracy's with your statement that I'm hoping we can clarify. If you will please call our office at 414-5900, our operations manager would like to discuss your visit in further detail. Thank you and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "111948156850650712197", "name": "Kaitlyn Franklin", "time": 1566523939687, "rating": 1.0, "text": "These doctors are the most neglecting, ill mannered doctors I have ever come across and not to mention horrible communication and listening skills. And then they’ll continue to pass you around to many other doctors because they don’t have the means to help. My family and I decided to pull from this doctors office today. Never again.", "pics": null, "resp": {"time": 1566930495208, "text": "Hi Ms. Franklin, we value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. With that being said, you left no details about your experience that resulted with you leaving us with a 1-star review. We really would like to discuss this matter further, so I would like to encourage you to call our office at 414-5900 so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "102470176151313839239", "name": "Karen Bozant", "time": 1516898167158, "rating": 5.0, "text": "The doctors are great and the lab techs work quickly. I'm amazed that I don't have long waits like other places. They get to know you and not just push you through their office.", "pics": null, "resp": {"time": 1517335519319, "text": "Thank you for the feedback Ms. Bozant!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "102065393161772879398", "name": "Deanna Davis", "time": 1557694251896, "rating": 5.0, "text": "The docs are wonderful caring kind people. The staff are precious. A blessing!", "pics": null, "resp": {"time": 1557752797132, "text": "Thank you for the 5-star review and the positive feedback. We are so pleased to hear such kind words about our staff."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "101834874133775682304", "name": "Cliff Wright, Sr.", "time": 1487116906874, "rating": 5.0, "text": "One stop shop for all things internal. Have seen many of the doctors for various conditions and treatments and all are knowledgeable and professional. My personal favorite is Dr. Don Sanders; you won't find a more caring and compassionate doctor anywhere, especially one that actually listens to (not just hears) his patients. Front desk staff does leave a lot to be desired as they are young and tend to be rude and impatient, but you're not there to see the 'staff' so just blow it off.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108583936746234276700", "name": "Betty White", "time": 1527424613482, "rating": 5.0, "text": "Hands down the best group I have been with! I would definitely recommend this place as not only the best on the coast, but probably the best in the country!", "pics": null, "resp": {"time": 1531946217349, "text": "Thank you for the kind words, Mrs. White. Our healthcare team at Alabama Medical Group takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "100660206795587994091", "name": "Caitlin Brown", "time": 1565360593343, "rating": 1.0, "text": "The WORST doctors office I’ve ever dealt with. These people are ignorant and incompetent. Horrible horrible staff, do NOT recommend .", "pics": null, "resp": {"time": 1565629726845, "text": "Hi Ms. Brown, we value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. With that being said, you left no details about your experience that resulted with you leaving us with a 1-star review. We really would like to discuss this matter further, so I would like to encourage you to call our office at 414-5900 so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "104845393980734080516", "name": "Lacey McElderry", "time": 1462815853800, "rating": 5.0, "text": "This is a great doctor's office. The staff and the care that you will receive is top notch. I highly recommend the delicious dietitian program.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "112527433897831320353", "name": "Kacey Young", "time": 1559852828371, "rating": 1.0, "text": "Waited two hours for my mother to see a doctor for a scheduled appointment. Then the front desk was very rude. Never apologized for the two hour wait. They are overbooked. Shouldn’t have to wait all day for appointment.", "pics": null, "resp": {"time": 1560178187698, "text": "Hi Ms. Young, we're sorry to hear that your mother's appointment ran late, but unfortunately due to the nature of our business sometimes this happens. With that being said, we never want our patients to be unhappy and we apologize for the unpleasant experience. If you would like to discuss this matter further or if we can reschedule your mothers appointment, please call 414-5900 and ask to speak with our operations manager and she will get her scheduled."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108876214357831787440", "name": "R.Allen Crowe", "time": 1550779389888, "rating": 1.0, "text": "So I just retired from the United States Navy after 28 years of service.  My family and I moved to Mobile, Alabama for our last move as we intend to live here for the rest of our lives.  Well as in any place you live there are many good things and there are not so good things that you experience.  We just came across a not so good thing and that is the Alabama Medical Group, P.C.  We were only with this PCM and the medical group for 3 or 4 months when we received in the mail a letter from them dismissing one of my family members.  The letter did not state any reason why only that they “need to do this from time to time.”  When asked why our family member was dismissed their representative would not provide a reason and on top of that they were rude during our phone conversation.  As a Navy Captain (retired) who has been to many places in this world along with my family who have been with me through all of that,  this has been the most disappointing experience of my career and was upsetting for my family members.  As a result of this,  my entire family has now changed PCMs.  I hope this feedback will help the management of Alabama Medical Group to self reflect and make some changes for the better. In the meantime,  I would not recommend this facility if you are a veteran as I assume they do not hold the veteran status as important.  That is strictly my impression.", "pics": null, "resp": {"time": 1551286970550, "text": "Capt. Crowe, I've looked into the situation involving your wife's experience at our practice and due to HIPAA compliance regulations there is very little I can comment about her visit and post publicly on the internet. It's unfortunate to hear that she had a negative experience, and I would like to encourage her to call our office at 414-5900 and ask to speak to the operations manager or the marketing director so we can discuss the allegations in your comments above. One comment that I can, and would like to address, is your statement saying that we do not support veterans. That simply is not true. In fact, several of our physicians currently serve in the military, along with members of our staff, as well as their spouses. We appreciate their service to our country along with yours and the other men and women who chose to make that sacrifice to protect and serve our great nation."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "105074773294626981722", "name": "Trevor Clifton", "time": 1521137650713, "rating": 5.0, "text": "I may be partial, but Alabama Medical Group is the best practice in Mobile! I will definitely continue to use my physician and the organization for any needs that they are able to assist with.", "pics": null, "resp": {"time": 1521138312641, "text": "Trevor, we don't think you are being partial at all. We appreciate your 5-star review and positive comments!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "106422606782648998008", "name": "June Reddix-Stennis", "time": 1538776500624, "rating": 1.0, "text": "Just left the Alabama Medical Clinic Walk In Clinic, I was refused service first because it was 4:15pm but the Facebook page says the close at 5pm and the website says they close at 4:30pm, either way I got there at 4:15pm so she said they couldn’t see me because they cut off at 4:15! Then she asked if my primary doctor was in the group, my response was no but I have two specialist in the group, so she then informed me that they couldn’t see me because I didn’t have a primary doctor there. The website says nothing about having to already have a primary there! Either she was lying or the website is giving out bad information! I just drove all the way from west Mobile to go to the walk in clinic and couldn’t even walk in! Wow! I’m sooo disappointed, someone really needs to correct this problem, it’s so unprofessional and so was she! My visits with my specialists there have been great but the Walk in Clinic needs work!", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "104937206293796425931", "name": "Laurie Watson McKay", "time": 1496175842762, "rating": 5.0, "text": "My surgeon was Dr. Scott. He was fantastic and very down to earth. I would trust him to cut me open anytime! :-)", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "117914164218167977798", "name": "Jennifer Schuller", "time": 1492451124413, "rating": 5.0, "text": "Internal Medicine Center is made up of a group of kind, caring and compassionate physicians who are highly skilled and trained to take care of all of your healthcare needs.", "pics": null, "resp": {"time": 1560264058735, "text": "Thank you for the 5-star review and the positive feedback. We are so pleased to hear such kind words about our staff."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108754969109803500157", "name": "Robert Johnson", "time": 1470864349303, "rating": 4.0, "text": "i like Dr Carlos and think he's a good dr but I wish the waiting time wasn't always so long to see him.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "105907220982380648113", "name": "Frances Moore", "time": 1433257481641, "rating": 1.0, "text": "I found that the Doctors at the center are helpful but the staff are horrible.  They are not concerned with the patients health.  They are not helpful and when you are sick you want to be able to see the doctor.  I was told that I could go to their urgent care facility the next morning if I was having a problem.  Horrible staff I would not recommend this facility to a dog.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "109606875225452259763", "name": "Bo Lambert", "time": 1486094853163, "rating": 5.0, "text": "Best doctor...Dr Arnold....nice to know some one cares when you go in...and oh by the way..WDE..DOC!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108449377063460987318", "name": "Neal Hattenstein", "time": 1490366132515, "rating": 5.0, "text": "Dr Alan Shaine is my Doctor and he is a womdeeful doctor sits with you and exam .just great bed side mannnee", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "112636333242840920295", "name": "tammy beard", "time": 1467068304662, "rating": 1.0, "text": "The facility itself may be ok. Idk. But , in my opinion, Dr. Amy Strasburg is rude, vapid, unprofessional and would be better suited for a career behind a cosmetics counter. If you go there, ask for a different doctor. And be prepared for each and every visit to take two or three hours. Apparently, their system completely collapses on a regular basis.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "109773861361038995364", "name": "Rebekah Graham", "time": 1542482155457, "rating": 5.0, "text": "Everyone is friendly and Dr. Hayden Long is the best.", "pics": null, "resp": {"time": 1547573568593, "text": "Thanks Rebekah, we are so glad to have Dr. Long as a member of the AMG team!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "100414115519850203702", "name": "Daniel Crocetti", "time": 1417005648420, "rating": 5.0, "text": "Great team of professionals, providing excellent care.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "114181223864192186992", "name": "Mohamad Sahyouni", "time": 1555080582287, "rating": 1.0, "text": "Horrible.", "pics": null, "resp": {"time": 1560178315712, "text": "Hi Mr. Sahyouni, we're sorry to hear that you had an unpleasant experience at our practice and would like to discuss the details of your experience. Would you mind if our operations manager contacted you to discuss?"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "115253474520263900291", "name": "dustyralph rhodes", "time": 1557851172579, "rating": 5.0, "text": "Dr. Nolan is the best . always reliable to pay attention to the details that saved my life on more than one occasion. There is none better than those who work in that office. GOD IS GOOD", "pics": null, "resp": {"time": 1559846639823, "text": "Thank you for the 5-star review, we appreciate your feedback. We think the world of Dr. Nolan and are so glad you had such a great experience."}, "gmap_id": "0x889bb28d5df20b1b:0x22322ff632b72b2c"}
{"user_id": "112823728938311688415", "name": "Stephanie Melton", "time": 1508717483550, "rating": 5.0, "text": "So kind, so smart,  so consistant.  My favorite Dr ever.", "pics": null, "resp": {"time": 1597685195284, "text": "Hi Stephanie, thank you for the kind words and 5-star review!"}, "gmap_id": "0x889bb28d5df20b1b:0x22322ff632b72b2c"}
