{"user_id": "101887403272089077815", "name": "Matthew Atkinson", "time": 1544549762715, "rating": 5.0, "text": "Great service! Always go the extra mile to make sure the job is done right. Highly recommended!!!", "pics": null, "resp": null, "gmap_id": "0x889bb18133e43a17:0xdb35ab0e0975919e"}
{"user_id": "111435917458406500224", "name": "Forrest Derr", "time": 1427594551571, "rating": 5.0, "text": "I have used the L Connection at various times over the years since they formed.  Always great service and value.", "pics": null, "resp": null, "gmap_id": "0x889bb18133e43a17:0xdb35ab0e0975919e"}
{"user_id": "103460429055967158228", "name": "Prakash Acharya", "time": 1478816734784, "rating": 5.0, "text": "good! lol", "pics": null, "resp": null, "gmap_id": "0x889bb18133e43a17:0xdb35ab0e0975919e"}
{"user_id": "109878048499931385857", "name": "Bo Doeg", "time": 1515759493612, "rating": 5.0, "text": "We had to take one of our children down to have a congenital cataract removed, it was kind of scary for us all going into the hospital. That's where it all changed. Every single person that we experienced that worked there was absolutely a joy. I have yet to encounter a more friendly and caring environment from any service or business since. Janitorial staff to Surgeons are the friendliest, most helpful people and will gladly assist you in doing anything. Her surgery was a success  (as if there was another outcome possible), every nurse we spoke with was reassuring that we were getting the best care possible and the most effort possible was put into our daughter. Doctor Davidson is amazing in her manner and ability to explain everything so we all understand, her skills are top notch in all categories. So glad to have it over and behind us, so blessed to have the experiences we did there. Amazing.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0x8e7775cdb6e35beb"}
{"user_id": "103018293117354472082", "name": "Mea", "time": 1562368190712, "rating": 5.0, "text": "They took wonderful care of my sister and they helped her come back from something that could have killed her. So god bless the staff here and also all the other kids who are still fighting. I met some really sweet kids who missed there family and I'm glad I could be there for them.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0x8e7775cdb6e35beb"}
{"user_id": "116026881132975845802", "name": "Amelia Casby", "time": 1534799418793, "rating": 5.0, "text": "Very open, welcoming, comforting and hardworking staff working. They are so nice to patients and try so hard to be realistically positive. And the colors and things in the buildings are so uplifting. And they have some of THE BEST doctors in the world.", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0x8e7775cdb6e35beb"}
{"user_id": "110615898060951705883", "name": "Casey Harris", "time": 1556206672323, "rating": 5.0, "text": "We are happy to have them here.its the very best place for children", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0x8e7775cdb6e35beb"}
{"user_id": "117542877037314467623", "name": "Terry Willcutt", "time": 1549749758443, "rating": 5.0, "text": "Great Place", "pics": null, "resp": null, "gmap_id": "0x88891bb82e602809:0x8e7775cdb6e35beb"}
