{"user_id": "106020007816960517356", "name": "Dalaina Chasteen", "time": 1487269983730, "rating": 5.0, "text": "Loved it here!! Room was clean and the location was perfect. Staff was friendly and the room service was great! Anything you needed they got it for you. Can't beat the price either! They had construction going on, putting brand new stuff in all the rooms, laying carpet in the hallway, but it wasn't a bother. Would definitely stay here again!!", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "102529007155864672184", "name": "Tina Blankenship", "time": 1466607121878, "rating": 4.0, "text": "We stayed at this hotel 2 nights, the staff was really nice, anything we needed they were happy to help. The room was clean but the shower curtain was torn and the sheets were stained. The floor in the room was wood so it was clean but the hallway carpet was dirty. There is no arcade but the pool room is nice. Breakfast was also really good. There is cereal, bagels, waffles, different breads, and milk, coffee, and juice. The juice is not good at all but the rest of it was great.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "108348999130221805383", "name": "Tammy Helton", "time": 1487054853491, "rating": 4.0, "text": "Room was clean.  Fresh paint.  New furniture.  New linens and mattresses.  Service was great.  I would stay again.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "113613270801219195832", "name": "Ashley Peters", "time": 1494551764821, "rating": 5.0, "text": "Amazing hotel all around! Clean rooms, very nice staff, and great location! Will be coming back every chance we get! God Bless!", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "101076357223975752020", "name": "Katie Beecham", "time": 1462998533315, "rating": 1.0, "text": "Do not, for the love of God, stay at this hotel. Spend your money where you'll be taken care of. Booked online for two queen beds, as my boyfriend, sister and I were on vacation. Got there, only had a queen bed and no other rooms. They said the next night they would give us a different room. I asked management about a different room, they only had a room with a hard key that management would have to unlock for us every time we needed back in the room. We declined because of the inconvenience. Upon check out, I asked if they would discount the room since they messed up our reservations. They did nothing to correct the issue. I will NEVER stay at this hotel chain again. Also, it smells very bad and feels very dirty. I don't recommend walking around barefoot.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "112775070750254740878", "name": "Brittany Turner", "time": 1464849539311, "rating": 1.0, "text": "DO NOT STAY HERE!!! I understand it's a cheap hotel near the beach, but it is worth spending the extra money to stay somewhere CLEAN!!! The room was filthy! We did not have a fridge or microwave. There were no towels and when I asked for more I was blatantly told there weren't any and wouldn't be for a while. This happened both nights of my stay and the staff was very unapologetic. Also, upon checkout, the girl working the front desk was very rude. I didn't expect a five star stay, but a clean room with towels is the bare minimum.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "108907860264564025951", "name": "Shannon Simon", "time": 1463633680046, "rating": 3.0, "text": "Magnuson has purchased a hotel that was formally a Days Inn. When it was a Days Inn this hotel was awesome... Now it is run down!! The tub and bed had hair everywhere. The hot tub and sauna is out of order. Breakfast is toast and corn flakes. The customer service was horrible. They overcharged me for a room and gave me a hard time about getting a partial refund. I will not return.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "107264274263160097064", "name": "Kari Matadobra", "time": 1467399896060, "rating": 1.0, "text": "I heard that they are getting better, and I sincerely hope they clean the place up. My husband and I came here and then left to a different hotel in April 2016 at 8 pm at night. I very much hope that they shampoo the carpets and clean the elevators and replace the shower curtains and leave cleaning materials in the room for people to use. We were just so worried about the cleanliness of the bed, and the weird feel of the room, that we couldn't stay.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "115779459512654793153", "name": "valera miller", "time": 1434070673598, "rating": 1.0, "text": "BED BUGS..BED BUGS..BED BUGS!!!WE WERE THERE FOR A WEDDING ON MAY 30, 2015. THAT BED BUG MOTEL LOCATED AT 3049 WEST 1ST STREET SHOULD BE CLOSED DOWN PERMANENTLY AND CITED BY THE CITY AS UNINHABITABLE!!THE ROOMS WERE NASTY..LOCKS ON DOORS WERE BROKEN..YES BROKEN!!! AND ALL THE LINEN AND BEDDING SHOULD BE BURNED AND DISCARDED!!AND LAST BUT NOT LEAST, THE CLERK AT THE FRONT DESK SHOULD BE FIRED!!HER ATTITUDE WAS RUDE AND UNPROFESSIONAL FOR ANY TYPE OF PROFESSIONAL BUSINESS LOCATED IN AMERICA!!!!.AND THEY HAD THE NERVE TO STILL HAVE THE OLD TRAVEL LODGE SIGN POSTED OUT FRONT TO GIVE YOU THAT FALSE SENSE OF SECURITY!!THE ONLY REASON WE STAYED AT THAT BATES HORROR MOTEL WAS BECAUSE ALL THE OTHER HOTELS WERE FULL DUE TO THE HOLIDAY WEEKEND UPON OUR ARRIVAL!!!!PLEASE THINK TWICE ABOUT THIS PLACE!!SLEEP IN YOUR CAR IF YOU MUST!!..WE HAVE THE PICS AND BED BUG VIDEO TO PROVE IT!!PLEASE RUN🏃🏃🏃", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "117599467557316215589", "name": "Patrick Kiessel", "time": 1459396012742, "rating": 1.0, "text": "This place is a dump. Too many negatives to list here. The only positive is that it doesn't leak when it rains. It's cheap for a reason. I suggest spending a little more and staying somewhere else.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "109656157541829172649", "name": "Carol Velez", "time": 1467120066016, "rating": 4.0, "text": "After reading all the negativity reviews of this hotel, I was scared to actually stay there.  However, I got a great deal for 4 nights and considering I was limited on cash, I decided to stay there.  The room we stayed in was not bad at all.  They are remodeling and I do think we had one of the remodeled rooms.  The room was very clean.  The shower looked brand new.  The toilet flushed and shower drained very well.  The only negative remarks I have about the room is the fresh odor of paint gave me headaches and the remote control.... The t.v. remote control did not work.  I went to the front desk and they gave me another one.  That one didn't work either.  They told me they will have to reprogram the remotes, which they never did.  That didn't matter that much because we weren't watching much television anyways.  Staff was nice.  I asked for extra towels and they gave me more.  Extra roll of toilet paper was in the bathrooms.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "104718729995984817758", "name": "Carol Stephens", "time": 1474737564916, "rating": 1.0, "text": "WARNING. Employee Stole my credit card number and charged $63.05 for pizza on it.\nWe stayed at the Magnuson Inn 213 W Fort Morgan Road Gulf Shores,Al.\non September 19,20 &21 2016. We have stayed there several times with no problems. However the property has been sold since our last visit and different people work there now. Until I found about the theft (when I got home) everything was fine .The staff was friendly, the price was right and I could bring my 2 small dogs.\nIf you decide to stay there pay with CASH! Then you won't have to go through\nwhat I am at the bank. New cards etc.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "114650866768969173924", "name": "Anita Bible", "time": 1404219009010, "rating": 2.0, "text": "This is really a Day's Inn Hotel.  I'm not sure why they are calling it Magnuson.  Our stay was 6/26/2014\nWe were told check in time was 3 over the phone and no early check in.  When we got there at 3 we were told \"check in time is 4\" Not cool!  They did let us in our room though when I ask for a manager and told her I had called an hour before we arrived and was told \"check in time was 3\"\n\nIf you think your getting a continental breakfast, it's pathetic!  Here is what you get: two types of cereal (corn flakes and generic cheerios) bread white and wheat for toast.  Packages of oatmeal to make your own, what say's orange juice (I doubt if it is even has 10% because it taste like coolaid not juice) and coffee with packages of non dairy powdered creamer and sugar or sweet and low.  That's it, no fruit, pastries only what is listed above.  I told the manager that was the most pathetic continental breakfast I have ever seen and she just walked away.  For 159 per night, I would expect more than this!\nBeds were very comfortable on a good note.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "113811548511857487056", "name": "Inda Hooper", "time": 1459523436859, "rating": 1.0, "text": "Please don't waste your money at this place!!!!! It was dirty scared to walk around with no shoes on. The\nshower had hair all in the tub and tub walls. Had to go to the front office to\nget more toilet paper. Asked for two rolls and the lady at front desk said we didn't need two rolls. Rude! Had to go to the front to get towels too and the sa", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "115708695913687872339", "name": "Morgan Barnes", "time": 1464052373812, "rating": 1.0, "text": "This was the most disgusting hotel and the worst staff I have ever met. We found drugs in our room left from one of the cleaning employees or the last person who stayed in that particular room. They obviously did not bother to clean the room due to the drugs being left in the open. They then acted like it was no big deal and kept telling me they would contact me about the issue but I have not heard back from them and the manager did not document the issue either. The room was filthy and outrageously priced. We were one of the three other guest that checked-in within the same time frame and all had complaints about the filthiness of the room that \"just got done cleaning.\"", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "114517182758577689159", "name": "Charles Gann", "time": 1438301549176, "rating": 1.0, "text": "This is a negative Rating Does not deserve a star! This is the Worst hotel Ever!!!!!!! First we couldn't check in until almost 5 pm because our rooms were not ready, even though we booked a month in advance. Then, the room was nasty. The air barely worked. They only let you have 2 towels per room and will only give you towels if you turn in the dirty ones. So basically you turn in the dirty ones in the morning to get two clean ones at about 5 pm. The ladies at the front desk could care less about the customers and they show it with their attitudes. The ice machine was broken. The elevator got stuck with my kids in it. Doors Do Not shut, you have to pick the door up!!! We stayed 5 days and maid service Never came into our rooms! What a joke. Now our c/c is being charged because someone at the hotel stole our card number and started using it down there. And yes we called the police and there was already an ongoing investigation!!! Called the hotel about the charges and they said it was a pet deposit!! I didn't have any pets, Do not waste your money or time and Priceline shouldn't list this place on their website!", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "101043778655340596484", "name": "Serena Mason", "time": 1457834048810, "rating": 1.0, "text": "We thought it was a fairly decent look hotel, but once we checked in there was a bad faucet in the tub. The second room had no tv control, and the bathroom door wouldn't latch. Then the next day we had no power or water, understandable for a short time because of a busted pipe. The power finally came back on but the water was off untill late that night. Any organized business would discount for that sort of stuff so that people would return.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "105838235103436304710", "name": "Ashley Whitaker", "time": 1470561506124, "rating": 5.0, "text": "The staff were friendly,  and the rooms were very clean.  Great place to stay.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "109609033891581450792", "name": "Justin Goodman", "time": 1451103090066, "rating": 1.0, "text": "Nothing good to say about it. When we got there the girl at the front desk had no prior training. They just stuck her in there on Christmas day not knowing what to do. She didn't even know how to put paper in the printer.  After we paid with our credit card and got the room key we noticed a sign on the elevator that said elevator may get stuck....!!! We get to the room and it's so stuffy from no air circulation. ..it stunk! The air conditioner was missing all of its parts and would not even come on! The toilet had the last guests skid marks...lol...and there were dead roaches all in the floor! Went to get a refund and the girl at the front desk didn't know how to refund our money so she had to call another woman and she said it would be 2 hours before she would be there to refund our money. I was fuming! And on top of it all the parking lot was dark and scary....thought our vehicle would get broken into and while we were waiting on our refund a old man brings in a pair of hooker boots he found in the parking lot! Omg.....never again!  Poor management.....", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "105541350847148793101", "name": "LaSheena Revel", "time": 1462072877076, "rating": 1.0, "text": "Tonight is our first stay,so I'll pray to God it's all right for one night...\n\nUnfortunately I booked with a whole nother hotel with a credit card and get there and they have no rooms available !\nPissed off\n\nSo were stuck with this one :/", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "103931501657505888905", "name": "slabbaby81 Buchanan", "time": 1476979107390, "rating": 1.0, "text": "I recommend not to stay here..stayed 3 weeks and room was cleaned maybe three times!!", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "104245805782164956869", "name": "Jeremy Gossett", "time": 1490586523513, "rating": 4.0, "text": "Newly renovated, better than I expected.  Now a Quality Inn.  Google still thinks it is Magnuson Inn or Gulf Shores Inn. Booked Gulf Shores Inn, Notified by Manguson... checked into Quality Inn.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "115605870339142303889", "name": "Marina gardner", "time": 1438452602285, "rating": 1.0, "text": "We arrived around 4 when we were told we could check in. I had reserved the room a week in advance. Our room was ready but the people ahead of us wasn't.\nThere were 2 towels in the room after I stated there were 4 people. Went to get more and they said they were out. Desk attendant actually went to and empty room and got towels.\nThe people employed here do not care that the place is a mess. They aren't friendly. There are no smiling faces. Nothing. Thank goodness there is a Walgreens in front for simple things like soap. We brought our own but in case you didn't don't rely on the hotel.\nThe bed was comfortable.  The air worked good and there's a tv in there.\nI understand you get what you pay for but I paid $140 a night and got crappy service. No towels. Bathroom shower had no pressure. Tub and toilet were stained.\nWe didn't see the continental breakfast because we brought our own food but from the other reviews I didn't miss anything.\nIf you don't mind all that it's only 5 min from the beach and was cheaper than other places further from beach", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "100899341656294320603", "name": "morgan kimball", "time": 1469813494327, "rating": 4.0, "text": "The hotel is great. Very clean and decent continental breakfast. I wish they had an outdoor pool as there is only and indoor pool and there is no faucet for the bathtub only a shower head but other than than a good stay.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "110351079127710899707", "name": "Dee Lewis", "time": 1469545299201, "rating": 2.0, "text": "It should have came with a microwave for $130 plus tax a night. Housekeeping didn't change the pillowcases after our first night. We could tell because dye from someone's hair was still there. Everyone was staring as if they wasn't use to my culture . There were only 2 towels for 4 people. It just felt secretly dirty from the time I walked in, but everything else by the beach was booked.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "114299529375906353889", "name": "Eric Jerkins", "time": 1485387434793, "rating": 4.0, "text": "Great service and prices", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "102317119393825310053", "name": "Jessica Godfrey", "time": 1457216146432, "rating": 5.0, "text": "Its not the best hotel but it's also not $200 a night my room was clean and smelt nice and love the fact that they have an indoor pool I will definitely  be back", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "105127431818369066694", "name": "shanda pressley", "time": 1465819330598, "rating": 1.0, "text": "Oh my gosh! If there was a negative 2! We just prayed we made it through the night. Looks ok from outside. But the plug ins....forget about it only 2 would hold  our phone chargers. The toilet omg wouldnt flush, we had to get water in a trash can pour it in the back of toilet. The curtains didn't match the 2 bed spreads, neither did the 2 bed spreads. The remote was held together by ducktape! Hardly no channels. The lights either didn't work or they came on by themselves! For real while our son in law was brushing his teeth the light flipped on! We slept on top of the covers. Don't go in the bathroom unless someone else is in the room! It sometimes won't open! You will have to be let out! Bring bedroom shoes or flip flops thE carpet will make your feet dirty!! The walls are a mess! Patched up, not painted. The bathroom door is coming apart literally. Had we not been so tired and already paid we would have asked for our money back and fussed that guy out for having a crappy ass hotel!!!! Trust us \"it ain't worth it!\"", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "103619605862624127783", "name": "Angela Inman", "time": 1439616141975, "rating": 1.0, "text": "Well..besides not very pleasant service and lack of service they have ROACHES. They need to shut down and bomb and fog the place.. nasty i hope i have everything checked good so i dont see one at home!! And really hope my card number doesnt try get used like someone else. But i did watch them they didnt get back of my card info. Then they didnt write the correct address in my papers but said it was okay.. ?? I feel it could be a great place with smiles and better attitudes toward the place.\nIll pay more for somewhere else next time!", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "102046286004151092203", "name": "Claudia Fox", "time": 1472346402764, "rating": 5.0, "text": "Excellent housekeeping, even though we got sand everywhere", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "112113872790583040948", "name": "Paula Doucet", "time": 1427898286190, "rating": 1.0, "text": "reservation for king size bed with handicapped accessibility.  tried to give us room with double bed and no handicap access.  and charge the same rate.  wasnt a magnuson, it was a travelodge.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "112841907946962085093", "name": "Tonya Early", "time": 1441148933371, "rating": 1.0, "text": "18th anniversary 😥 No Towels! Room Not Clean, we didn't get room we reserved. Dirty coffee pot, clogged kitchen sink I was given Poo covered plunger to plunge it with.. No sink soap, no kleenex,  fridge was dirty, no blankets, hot tub broke , pool turned off, ice machine broke,  breakfast was stale cereal or instant grits.  Cable tv would not work clear  it was staticky bad 😡😡", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "111032018128603651521", "name": "Jennifer Walker", "time": 1445998505619, "rating": 1.0, "text": "Upon arrival the guest clerk was no where to be found...husband waited 10 mins before anyone came out??RED flag 1... Finally she came back and was having issues finding our names in her computer system...I had booked online w/ccard she showed no record of it?? She became more irritated the more she kept looking and could not find anything.  She's griping and complaining about this and that and why they can't just do it this way and that?? Okay we end up just paying for the night...got our keys and headed to the room.  There was a black guy in there cleaning?? Red flag 2 Ok so she proceeds to go in and get on her knees wiping up the floor in the bathroom?? WTHeck?? Red flag 3  Ok so we go in and she promises to bring some fresh towels. We didn't even notice she gave us a room w/ 2 queen beds we had booked for a king bed. It was hot in the room so we checked ac and it was iced up. Umm needed to pee so go to the bathroom and there is mildew all over the dang shower curtain?? No light fixture in the bathroom.  Filthy is all I can say. I turned back the linens and noticed stains on the sheets. Needless to say we did not stay the night.  I can promise you this is an owner problem!! No sense of ability to manage money. He needs help w/this hotel.. It needs lots of maintenance.  Please spend your money somewhere else.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "110241396801482297006", "name": "Doris Black", "time": 1470139661375, "rating": 4.0, "text": "It couldve been cleaner but its so close to the beach i didnt care. Quiet at night.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "113040345905805353877", "name": "Terry Coburn", "time": 1467175545591, "rating": 2.0, "text": "Where do I start?  TV doesn't work, temperature of shower water could not be regulated, and pool was dirty.  In general not a well kept hotel.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "102583550589465283215", "name": "Matt Murphy", "time": 1435506142593, "rating": 1.0, "text": "Awful. Had to wait four hours to get a room we booked two months before then they gave us the wrong room three times. When we finaly got our room it had not even been clean and the ac bearly worked!!! Will never stay again", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "104303080965221361418", "name": "Angelia Ezell", "time": 1409608640707, "rating": 1.0, "text": "Worst hotel ever!! first of all had trouble finding it The sing says the name is Travel Lodge not Magnuson !! Rooms were dirty, paint chipping off walls, smoke detector missing and the bare wires hanging out of wall, Bed spread dirty with cigarette burns in it, pillows had yellow stains when ask for clean pillows and linen staff laughed and said they didn't have any!!  Bathtub chipped and had hard water stains, toilet had dried urine around bottom and didn't flush good. Hairdryer, microwave, and lamp did not work! no ice machine, parking lot dark lights not working, lights in walkway outside of rooms not working. Offered continental breakfast it was a joke!! Toast with butter and bad coffee! We will never stay there again I'd sleep in car first!", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "114184808275861211154", "name": "Brittni Pierce", "time": 1468593601980, "rating": 1.0, "text": "So terrible. Roaches in the rooms, service staff is rude af. NEVER NEVER STAY HERE", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "110101150296791600802", "name": "Cesar Adrian Barrios-Martinez", "time": 1460271683363, "rating": 2.0, "text": "Pretty under maintained and the staff are not knowledgeable about the hotel. Do not recommended to anyone. Unless you're on a budget", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "107468333547957971936", "name": "amy rake", "time": 1468925654656, "rating": 3.0, "text": "There was no hot water at all for showers. Look on door was broken and damage to walls. No lights in our room other than the sink light and bathroom. Doors slamming all night from stairwell because elevator was not working. Rooms were insanely priced.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "114304926841317030558", "name": "Penny Norris", "time": 1449192121136, "rating": 1.0, "text": "NO WAY-There is simple nothing good to say about this place.Everything was out of order, service was lousy,bugs. Beyond time to close those doors.....Unfit", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "115365031902020907465", "name": "Amanda Porter", "time": 1466330218619, "rating": 4.0, "text": "Was picking up friends that were staying there as guest.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "112576073268391715730", "name": "Kimberly Bunger", "time": 1489629827512, "rating": 3.0, "text": "The hotel had the wrong name on the building, staff was great. Room was ok, bathroom door would shut or lock", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "115082272101161306077", "name": "Roosevelt Byrd", "time": 1488806587545, "rating": 1.0, "text": "Mold in breakfast area .... rude customer service.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "100549927940834845028", "name": "David Hilton", "time": 1474059540702, "rating": 4.0, "text": "Nice and quiet", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "112178707128452361557", "name": "J anime", "time": 1466909520216, "rating": 1.0, "text": "content://media/external/file/1425\nMan dis place is shity they didn't wash the sheets the elevators haven't been service the floors are dirty use toilet paper on the rollers chair in the room are flat out filthy I WISH I COULD GIVE IT A QUARTER OF A STAR I WILL NEVER COME AGAIN PLEASE I BEG U GET THIS PLACE SHUT DOWN I HAD TO GO BUY A COMFORTER SET BECAUSE THE SHEETS THEY HAD WERE THAT NASTY!!", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "104528755127205848798", "name": "Kenneth Lewis", "time": 1463807649102, "rating": 5.0, "text": "I pick up a friend for work there", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "112733997083011499475", "name": "David Kilgore", "time": 1489932333833, "rating": 4.0, "text": "Only problem was there was no remote in our room.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "111187506880159803495", "name": "justin brewer", "time": 1468234952507, "rating": 3.0, "text": "The price was really cheap but the customer service was not friendly.  The pool had to much chemicals in it.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "107619000055899372371", "name": "gjwilly1 x", "time": 1485307997105, "rating": 1.0, "text": "Poor - staff ok but the place is a disaster!", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "102479633703641839843", "name": "James “SPUDZ” Loiseau", "time": 1466237968913, "rating": 3.0, "text": "Towels was a issue, and our room was but the steps and the door SLAMS and  is extremely loud!", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "109918292133655624329", "name": "Richard Longacre", "time": 1475981314293, "rating": 1.0, "text": "Worst, most disgusting hotel either my wife or I have EVER stayed at. Sadly the pictures must have been taken right after they painted and cleaned. Just don't stay here.", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "102458020358374688544", "name": "Lori Jackson", "time": 1468821079404, "rating": 5.0, "text": "not to far from the beach. basic rooms but clean. Indoor pool", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "116066742617716407663", "name": "Amanda Coburn", "time": 1467180154794, "rating": 2.0, "text": "Going through a remodel...", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "109858117028247372408", "name": "Juanita Brown", "time": 1485716594666, "rating": 5.0, "text": "LOVE it", "pics": null, "resp": null, "gmap_id": "0x889a04ce45e4b54b:0x69dd99eebda77346"}
{"user_id": "109626583483884241707", "name": "Matthew Brown", "time": 1447351327158, "rating": 1.0, "text": "Lucky their staff is nice and friendly otherwise I wouldn't have bothered with a star in the first place.I only stayed for one night and booked weeks in advanced.When I first showed up everything looked ok at the front office.Clean...yeah sure the breakfast area is small but hell the price was cheep.However despite how calm and friendly their staff is.There was no excuse for the state of the room they first put me in.I will admit I am not the most clean guy myself.But never would I dare bring guests to a room that has Roaches crawling around.Which reminds me I should have let the front staff know about the horrible caulking job they did to try and hide the mold on the bathtub.Not to mention the loose shower head.There was still forgotten items from the previous guest in the room which tells me they didn't give a dam about doing a basic cleanup in the first place.Luckily the second room the put me in was on the other side of the building.Which was MUCH cleaner and well taken care of.They also gave me a $20.00 dollar bill for the \"inconvenience\" of my stay when I checked out.All an all if anyone was to ask me if I would justify the price for one night.NO I would rather spend the extra $50.00 and go to the first Comfort-Inn at the area instead.", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "111001758217579635136", "name": "Brandon Little", "time": 1436295361784, "rating": 5.0, "text": "I thought they were terrific. Nice rooms, a decent continental breakfast, easy access to the space center, and a swimming pool. Plus, they were very affordable for all that. They have an outdoor pool, but it's in the center courtyard, so it's secluded from the rest of the world.", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "117487287093210498239", "name": "Demeikia Houston", "time": 1384654998879, "rating": 4.0, "text": "Because of the previous reviews i had my mind made up that i was not staying here. but i needed the closest and some what cheapest room to stay in. so i gave it a shot,  i called the front desk and rsvp'd my room i also asked for them to make sure the room was Superior before i got there. the lady was not only polite but had no problem seeing to my needs. once i got there i searched and searched trying to find the littlest thing wrong...but i couldn't. everything was clean and well placed! my stay at this hotel was wonderful and i would recommend it to anyone!", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "112788041781721140050", "name": "Rachel Jordan", "time": 1468393507246, "rating": 5.0, "text": "I loved the place! Everyone was friendly. I had left a few things in the room and they were kind enough to let me retrieve them.", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "111916716116322007813", "name": "Cassandra Spala", "time": 1360891728143, "rating": 3.0, "text": "Horrible customer service! We booked online a week before our trip for a non-smoking king bed room for 2 nights. We drove all the way from chicago to Huntsville Alabama. When we got there, all they had was a king bed smoking room or a non-smoking with 2 double beds. They said sorry, there's nothing we can do.", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "114263034622121615555", "name": "Dwight Hardwick", "time": 1467671154860, "rating": 4.0, "text": "It's a Days Inn now. Very pleasant stay,nice comfortable bed,AC worked really well during this hot 4th of July weekend. Would've given 5 stars but my bathroom was kind of small. But I will be staying again.", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "103696025419201686866", "name": "erika smalley", "time": 1447857734317, "rating": 5.0, "text": "Terrific stay. Had to stay here because I had a house fire. They clean up nice and they have great hospitality.", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "106842163495446191045", "name": "Jason Randolph", "time": 1367290109898, "rating": 4.0, "text": "Has truck parking which is important to me. Flat screen TVs and a recliner in the king rooms. Front desk worker was exceptional. Room was clean and comfortable.", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "114946368164702718194", "name": "Norman Ravis", "time": 1442706319416, "rating": 1.0, "text": "Place is disgusting. Bugs in the room, on the bed, everywhere. Stains all over the carpet, walls, and ceilings. When confronted about the bugs they said \"they are just cockroaches, and baby coach roaches, they aren't b.bs\" because they didn't want to say bedbugs in front of other customers. That is how disgusting this place is, they have a codename for bed bugs.", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "106616116897602803107", "name": "D'Andre Manigo", "time": 1467801351472, "rating": 3.0, "text": "It was nice. There was an issue with the tub over flowing and some silverfish but ya know.", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "110046988374247246544", "name": "Matt DeBlieck", "time": 1263881720713, "rating": 2.0, "text": "Pros:\n-Nice price\n-Nice staff\n-Comfy bed\n-Decent sized room for price\n-Decent continental breakfast\n\nCons:\n-No garbage can\n-Mold in shower curtain\n-Bathroom floor sticky\n-Small bathroom\n-Bathroom door and table had small pieces missing/definite signs of damage\n-No sign of vending machines (there were soda and ice machines though)\n-Key system composed of pieces of plastic with holes punched in them\n-Alarm on clock didn't function and clock had persistent interference from Blackberry device\n-Suspicious activity from other guests on grounds at night\n-No way to close thicker curtains (so no way to not be seen with the lights on\n-Cleaning staff leaves lights on in every empty room\n\nOverall:\nNOT recommended for families or long stays\nIf you're looking for an inexpensive place to crash for a night, MAYBE two, then you'll get a decent go at the basics.", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "113343219819442034028", "name": "Jada Snow", "time": 1452716141625, "rating": 5.0, "text": "The rooms are spacious clean Wi-Fi works good and the free breakfast is on point", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "109473690036971632323", "name": "Bryan Young", "time": 1372168337808, "rating": 4.0, "text": "Nice place to stay the night. Plenty of places to eat near by and the hotel was very clean.", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "101640416552068371341", "name": "Albe Manton", "time": 1318364821333, "rating": 1.0, "text": "La Quinta Inn ‎\n3141 University Dr Northwest\nHuntsville, AL 35816\n\nOct 6,7,8,9 2011\nArrived on Thursday for a 4 day stay.  My first room had no cold water in the shower, the faucet was broken.\nMy second room I found 3 roaches within 15 minutes of being in the room and left right away.\nMy 3rd room was fine for the first night.\nOn day 2 The AC would not work.\nI called for Maintenance to come fix it. They sent the assistant manager to fix it.\nWhen he could not fix the AC he told me to \"tuff it out or check out.\"\nI went down to the front desk were they helped me, and gave me my 4th room in 2 days were the TV did not work.\nI requested the Manager call me to discuss my problems, He/She would not contact me after asking every day for three days. The grounds are covered in debris, bottles and beer boxes by the Ice machines and was not pickup in the 4 days I was there. Only one Ice machine worked. They allowed large groups of men(6 to 8) to stand outside on the balcony drinking beer and would not send security.\nThey allowed a group of young people to have a loud party, with loud music until late at night, and would not send security\nSome of the people I was there with checked out and went to another La Quinta about 2 miles down the road.\nThe rooms are not being maintained and the Management has an attitude that makes it feel like its your fault for complaining. I have been coming to Huntsville for business every year for 4 years and I will not stay here again. There are 2 other La Quintas within 2 miles of here with much better reputation. This hotel does not maintain the standards of any other La Quinta I have ever stayed at. It's not worth staying here just to save $5.00", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "106252170190011600522", "name": "Ryan Means", "time": 1479430801464, "rating": 3.0, "text": "Kind of expensive for what it is. Mediocre rooms, not the friendliest people in the world. It's a place to sleep, that's it", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "105016938703211316510", "name": "Gideon Duvall", "time": 1467666011074, "rating": 1.0, "text": "Tried 2 hotel rooms, they were both mold infested and smelled terrible.  There was black mold in the shower.  Used Hotwire so they already had my money when I showed up so I was screwed.  Do not stay here, the rooms smell like mold.", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "117011859026844580762", "name": "C G", "time": 1446910103497, "rating": 4.0, "text": "While not perfect, it is well worth the price", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "102604168590070564579", "name": "Nick Nations", "time": 1447392273352, "rating": 1.0, "text": "Disgusting.\nRoom stunk, blood stains and burn holes on blanket, urine smell on sidewalk,  just nasty.", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "117324316107388034567", "name": "trice Carter", "time": 1462810282210, "rating": 1.0, "text": "Bed bugs...stay away room 149...new name days inn", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "115316232840616783083", "name": "Joey Towers", "time": 1447135839603, "rating": 5.0, "text": "Was a great place to stay", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "114400748459038269756", "name": "Jessica Kientop", "time": 1463398224479, "rating": 3.0, "text": "Staff is friendly. Room needs major update. Clean, but outdated makes it seem dirty.", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "100056617005436926609", "name": "BnJ", "time": 1466885244940, "rating": 3.0, "text": "Days Inn. Not Laquinta", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "106514681590013343907", "name": "Cindy Gunter", "time": 1547838389649, "rating": 4.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "101984245120862208136", "name": "Robbie Evanoff", "time": 1465550067025, "rating": 5.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "116240483833401943283", "name": "Deryck Moi-Thuk-Shung", "time": 1336188065305, "rating": 1.0, "text": "worst experience ever", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "116291394035845014513", "name": "Rated R NYPD", "time": 1429364044091, "rating": 5.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "103438258870474138255", "name": "Ralf Heckel", "time": 1366470633338, "rating": 5.0, "text": "(Translated by Google) Always La Quinta.\n\n(Original)\nImmer wieder La Quinta.", "pics": null, "resp": null, "gmap_id": "0x88626b78c2af653f:0x2a2d79847814302f"}
{"user_id": "117129969521445479932", "name": "Linda", "time": 1565435908847, "rating": 5.0, "text": "I know that last review was not so good but considering to the place I went to first was also; So this was my go to place things are quite different . The staff was just as friendly as they were last month. It's very quiet and peaceful in this area but down the street not so good. If you looking for a motel on a budget, you need to come and see for yourself.", "pics": null, "resp": null, "gmap_id": "0x8888ddc5379ce6a9:0x39554af27ba67bcd"}
{"user_id": "110108661267428448746", "name": "Patricia Hanner", "time": 1530787032719, "rating": 5.0, "text": "Been there alot.sweet people remember us.feels good to be there.no complaints!", "pics": null, "resp": null, "gmap_id": "0x8888ddc5379ce6a9:0x39554af27ba67bcd"}
{"user_id": "112240898908158425954", "name": "Kenyatta Hunter", "time": 1542510677706, "rating": 4.0, "text": "Fair price.on rooms quiet palce", "pics": null, "resp": null, "gmap_id": "0x8888ddc5379ce6a9:0x39554af27ba67bcd"}
{"user_id": "106321935889149954445", "name": "Lauren Tucker", "time": 1553995204771, "rating": 4.0, "text": "Not bad for the price!!", "pics": null, "resp": null, "gmap_id": "0x8888ddc5379ce6a9:0x39554af27ba67bcd"}
{"user_id": "118114204808544233919", "name": "Magin McConnell", "time": 1556552639957, "rating": 1.0, "text": "Nasty an room's are way 2 high", "pics": null, "resp": null, "gmap_id": "0x8888ddc5379ce6a9:0x39554af27ba67bcd"}
{"user_id": "100722308726649237216", "name": "Wesley Edwards", "time": 1454447056102, "rating": 4.0, "text": "The room was very clean, the hallway smelled like pot but that was due to a few guests down the hall.  The staff was extremely nice and friendly. There was plenty of security to make us feel safe.  Some touch ups here and there are needed but it didn't take away from the quality of room. I would definitely stay again.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "105174825821699265079", "name": "V N", "time": 1470444233858, "rating": 5.0, "text": "Nice room for the price! The room I chose had no fridge or microwave but that's because I specified that. Check in was fast. Breakfast was ok, but filled my belly. Pool needed cleaning but the manager sent maintenance right away & took care of it. Definitely staying here again!", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "112901567368956806639", "name": "KeMaya Chantal", "time": 1473897128548, "rating": 5.0, "text": "Really nice and cozy and everything including the mini fridge, microwave, and linens were clean. Didn't really expect much for the price but it definitely was worth the stay. I highly recommend this place for anyone not wanting to spend an arm and a leg on a nice hotel stay", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "114151661527628199123", "name": "Jerry Jolly", "time": 1445732528081, "rating": 4.0, "text": "Really affordable, so much so that I was almost scared away from it. Check-in was quick and easy with a courteous staff member who was prepared for our arrival. Place is older but super clean and appeared newly renovated.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "117235265953341206798", "name": "Shawn Schleppi", "time": 1469380069979, "rating": 3.0, "text": "For the price, it's not bad but just for a night. There was dog hair on one of the beds and the water in the shower didn't drain. Also heard loud partying most of the night so try not to be too close to the pool if possible.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "113303127711617191409", "name": "Shaunie J", "time": 1475799019269, "rating": 1.0, "text": "If I could give it no stars I would. This place had the nerve to take my money for my reservation and then turn around and let someone extend their stay. I am evacuating my home from hurricane Matthew and have no where else to go. Seriously?!? I'm not okay with this!!", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "106493212691361427481", "name": "Alexis G", "time": 1476594368657, "rating": 1.0, "text": "I wish I could rate 0 stars. Room was disgusting. Used bath rags, rose petals on the floor from previous people, super dusty, and dirt all over floor. No big deal they probably just forgot that room right? NO. The hallway was worse. Looks like it's never been vacuumed. I'm talking piles of dirt. Trash and even used qutips on the floor. How nice. Oh and our room smelled like weed.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "103398775965060259734", "name": "John Willis", "time": 1467719709851, "rating": 1.0, "text": "A tired old run-down Motel 6. The two positive things here are it's cheap and I saw no bugs if price is your primary criteria then stay here", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "105603949995766644117", "name": "TONY Bl", "time": 1469294090459, "rating": 4.0, "text": "A nice place to stay but there was no microwave or fridge in our room a big downer one star off for it.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "109468581584256394619", "name": "Jessica Fry", "time": 1466225463432, "rating": 4.0, "text": "Decent place to spend the night, you get what you pay though,  still not bad, would stay again.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "116957540682501802696", "name": "Nikki Turney", "time": 1469898010057, "rating": 3.0, "text": "Clean room, no frills.  Good enough for an overnight stay passing through.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "102717491189696978137", "name": "Emilee Springer LaRosa", "time": 1464160295789, "rating": 4.0, "text": "Our room was spacious and very affordable. Not the fanciest, but great value for the price!", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "100068250274680052914", "name": "Nick Turney", "time": 1469914318363, "rating": 4.0, "text": "Booked thru Hotwire, 50 bucks for the night, room waz clean, hotel was quiet. There was an outdoor pool that looked nice, but we didn't use it.  Free breakfast in the morning, but we didn't check that out. Couldn't ask for more.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "109390295590540483645", "name": "Billy Holdeman-Bass", "time": 1457413154711, "rating": 5.0, "text": "Great rooms, friendly staff. Breakfast wasn't that great, but good nonetheless.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "100214569513760974125", "name": "Parthenie Drakeford", "time": 1367883338113, "rating": 3.0, "text": "This was a nice hotel.& Clean i will be staying here on my next trip to Montgomery,Al enjoyed my stay :-)", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "111539141333888069346", "name": "Anthony Dixon", "time": 1479227086147, "rating": 5.0, "text": "Decently priced, altho they are no longer la quinta", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "104843987766867261499", "name": "glenda mechling-smith", "time": 1459057453035, "rating": 3.0, "text": "They said they had queen beds but they were full beds and b it was noisy during the night but the beds were comfy", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "104127839588436109507", "name": "TOM WORMINGTON", "time": 1427753077135, "rating": 2.0, "text": "Warning for using Hotelwiz & La Quinta! We booked 2 rooms for Jan 30 in Dec with Hotelwiz. When we arrived at motel they said we only had 1 room but they said they would take care of it & went ahead & gave us 2 rooms. Lo & behold when we got our credit card bill they charged us for the 2nd room again. We called the motel & after 2 calls they took the charge off. But when we got our March credit card bill they had charged us again. Called them again, now they say they can't take charge off it is Orbitz's fault. I don't know how the got involved.The run around that's all we got and we still have to pay an extra room charge. Not happy at all!", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "108714744889587707197", "name": "Jessica Sullivan", "time": 1428548606518, "rating": 5.0, "text": "Great staff, clean room, nice grounds for small dogs.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "107922442905801323859", "name": "Ray m", "time": 1399514269970, "rating": 4.0, "text": "Great service, don't get confused about the outside because those rooms are really well maintenance, helpful people.....", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "102642500134913740929", "name": "Derrick Smith", "time": 1468964185132, "rating": 5.0, "text": "Great place to stay I recommend everybody go and stay there", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "112515004786848921524", "name": "lisa smith", "time": 1371836712278, "rating": 5.0, "text": "I enjoyed da rooms very clean housekeepers they are helpful & friendly,da guy Robert he is da manger he seems a lil weird,anyway Excellent Hotel I Will Stay Again", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "117025016615323035708", "name": "Rachel El", "time": 1461473932350, "rating": 3.0, "text": "Decent rooms. Lots of \"activity\" all night", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "102623526026918759341", "name": "Robert Mundy", "time": 1455346756442, "rating": 3.0, "text": "Pretty good place to stay. Sometimes security doesn't seem to do there job.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "117919537733362393369", "name": "Kris Rose", "time": 1447654831881, "rating": 3.0, "text": "Hotel is very dated and the doors open directly to the parking lot. Rooms were clean.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "104770742694954424141", "name": "Mark Stanfield", "time": 1461564967844, "rating": 3.0, "text": "Hotel was adequate for a single night stay on a budget, furniture outdated and older fixtures in bathroom,  not tje place for luxury, but Korean restaurant on premises was a plus.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "105566540637430717759", "name": "Dylan Wolters", "time": 1459916162204, "rating": 1.0, "text": "Horrible service. Will never go there again", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "113460970069740438128", "name": "Dan Watts", "time": 1549645199238, "rating": 1.0, "text": "Thank god its closed. Filthy as can be. This place is the all time worst hotel I have ever stayed at.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "106921005643598719397", "name": "Allyson Padgett", "time": 1462778040779, "rating": 5.0, "text": "My friends were staying here. Not so fantastic. Couldn't always get hot water. They're door locked them inside their room. Not the best.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "109910647786868984530", "name": "Mary Reznikov", "time": 1455510728012, "rating": 3.0, "text": "Older hotel. No laundry facilities. Outside open doors. Free breakfast was minimal.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "107424903928280687769", "name": "John Geary", "time": 1446180311404, "rating": 3.0, "text": "The room was nice enough for a short work trip.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "106679444512335463836", "name": "Matt Evans", "time": 1467448693932, "rating": 4.0, "text": "Clean and affordable", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "110593614958368843829", "name": "George Hood", "time": 1470881065016, "rating": 3.0, "text": "Decent hotel for decent price", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "104576404884771952976", "name": "John Hofer", "time": 1435341385059, "rating": 1.0, "text": "The best thing I can say about this place..ITS NASTY!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "107186194817368220679", "name": "Elchin Bagirov", "time": 1455558475910, "rating": 1.0, "text": "Very unsafe. Broke the lock on my truck and stole belongings. Stay away, or at least take everything from your car into the room.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "110320046289515905706", "name": "Courtney Kirkland", "time": 1467485112302, "rating": 1.0, "text": "Backpage prostitutes be here 24/7", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "111147775362056897773", "name": "Oscar Santos", "time": 1356905126340, "rating": 5.0, "text": "The staff help me to solved reservations problem,even when it wasn't they fall.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "105261643936317976826", "name": "Aaron blabaum", "time": 1477630085894, "rating": 3.0, "text": "It was an ok stay for a night.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "116400998758224179396", "name": "lakyn wilson", "time": 1464227244594, "rating": 1.0, "text": "smelled nothing but smoke.", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "110134575672820439921", "name": "Jeffery Stokes", "time": 1476594356961, "rating": 4.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "105306512448159276731", "name": "Tina Lowe", "time": 1472100378150, "rating": 4.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "103829621253636182950", "name": "Tobi Michelle", "time": 1461555502772, "rating": 3.0, "text": "Cool", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "114351192733300284494", "name": "Kenesia Cade", "time": 1472001780358, "rating": 3.0, "text": "Rooms are small", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "107179347881745242144", "name": "RENEE NEWTON", "time": 1471955431617, "rating": 2.0, "text": "Needs updated", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "118146675033130080896", "name": "Kristy Chance", "time": 1466490750300, "rating": 4.0, "text": "Mom", "pics": null, "resp": null, "gmap_id": "0x888c2bb336e12c3b:0x46fc49efe68e69cc"}
{"user_id": "105020135192148470222", "name": "Holly Hewitt", "time": 1447163571824, "rating": 4.0, "text": "It was clean and very easy to get to. The night desk man was very nice and the morning breakfast was cereal, waffles, juice, biscuits and gravy, fruit and yogurt. Being next to a main highway  I  was surprised the traffic wasn't louder. Stayed on a Monday night though. I'd stay here again", "pics": null, "resp": null, "gmap_id": "0x888c0c9dcc68f025:0x538d1c909defbcc8"}
{"user_id": "117807887360824070543", "name": "Izzy Clayborn", "time": 1470603906255, "rating": 4.0, "text": "The rooms were nice and clean. The breakfast in the morning was way better then I thought it would be. It was overrall a great experience.", "pics": null, "resp": null, "gmap_id": "0x888c0c9dcc68f025:0x538d1c909defbcc8"}
{"user_id": "100995470513134408258", "name": "Kathleen Heather", "time": 1463797846171, "rating": 5.0, "text": "I love the way their rooms are decorated. It has such a better feel than the older style hotel rooms that seem dark and dirty.", "pics": null, "resp": null, "gmap_id": "0x888c0c9dcc68f025:0x538d1c909defbcc8"}
{"user_id": "109382956811598648314", "name": "Brittany Victoria Kuenzel (TayKay's Mommy)", "time": 1456197926342, "rating": 5.0, "text": "Very clean, affordable,  great staff ,and soo comfortable. .. me and an old friend met up the well remembered memories we will treasure forever", "pics": null, "resp": null, "gmap_id": "0x888c0c9dcc68f025:0x538d1c909defbcc8"}
{"user_id": "112217120556103476783", "name": "Carl Dodson", "time": 1414106368331, "rating": 1.0, "text": "We stayed at this hotel on October 18th, 2014 and found it to be less than favorable conditions. The room my son and I stayed in was two full beds. The bathroom had one towel and smelled of urine. My father in law stayed in another room that had NO linens and NO towels. We brought this up to them the next morning and they stated that they only had 2 people to clean 17 rooms and that if they had the cash we would have received a full refund. Because no cash was on hand they said they'd mail us one. Well it came today. Apparently the disgusting rooms we stayed in were only worth a $15 refund on an $76 room. No matter how desperate I am, I would not chose this hotel to stay in again.", "pics": null, "resp": null, "gmap_id": "0x888c0c9dcc68f025:0x538d1c909defbcc8"}
{"user_id": "101747413529236289703", "name": "Mo Mo", "time": 1467433099713, "rating": 5.0, "text": "Good service  clean room comfortable bed. Great place to stay", "pics": null, "resp": null, "gmap_id": "0x888c0c9dcc68f025:0x538d1c909defbcc8"}
{"user_id": "113056081952763403494", "name": "Timothy Williams", "time": 1471362040665, "rating": 5.0, "text": "Nice hotel for the price. Smoking rooms available.  Microwave, fridge, and 36\" TV in the room.", "pics": null, "resp": null, "gmap_id": "0x888c0c9dcc68f025:0x538d1c909defbcc8"}
{"user_id": "115314136519732984180", "name": "Kelli Cook", "time": 1478016541761, "rating": 5.0, "text": "Love it, will stay here again", "pics": null, "resp": null, "gmap_id": "0x888c0c9dcc68f025:0x538d1c909defbcc8"}
{"user_id": "106309865409861224128", "name": "Rodney Silcox", "time": 1539458880649, "rating": 5.0, "text": "Clean and friendly good food", "pics": null, "resp": null, "gmap_id": "0x889a3f20a6c1dbd5:0x3ebbe533cc83872d"}
{"user_id": "102811645706344093839", "name": "Tamara Sharp", "time": 1535698080732, "rating": 4.0, "text": "Very nice", "pics": null, "resp": null, "gmap_id": "0x889a3f20a6c1dbd5:0x3ebbe533cc83872d"}
{"user_id": "104973214420227771971", "name": "Julie Knight", "time": 1519079827744, "rating": 5.0, "text": "Inn", "pics": null, "resp": null, "gmap_id": "0x889a3f20a6c1dbd5:0x3ebbe533cc83872d"}
