{"user_id": "108728384116457783779", "name": "Kathy Nelon", "time": 1623805520259, "rating": 5.0, "text": "Stan is 1 of the best attorney's I have EVER met. He REALLY cares for his clients!!!!", "pics": null, "resp": null, "gmap_id": "0x88897d19d2d35905:0xbe74dc86ea7f6c59"}
{"user_id": "103183671827779746728", "name": "Brandy Laneigh", "time": 1571057627010, "rating": 5.0, "text": "Great attorney a,very reasonable rates.", "pics": null, "resp": null, "gmap_id": "0x88897d19d2d35905:0xbe74dc86ea7f6c59"}
{"user_id": "111938491389475152030", "name": "Tom Willard", "time": 1529416972309, "rating": 5.0, "text": "Good guy, great lawyer.", "pics": null, "resp": null, "gmap_id": "0x88897d19d2d35905:0xbe74dc86ea7f6c59"}
{"user_id": "113596067032698185711", "name": "Jerry T", "time": 1612799013049, "rating": 1.0, "text": "Young boy from Arab I grew up with years ago went in diabetic comma. He almost died and had troubles rest of his life. When grown he used these people to get disability.  After years of hospital visits, his parents taking care of him into their older years he finally got approved for disability right before he died.\nNeed a disability lawyer go elsewhere! Rest in Peace Mel.\nIts all about the 30 to 40% they get with all these crooks.", "pics": null, "resp": null, "gmap_id": "0x88891b9b9d8c9a65:0x21da5da86f128744"}
{"user_id": "113514146268006811051", "name": "cross 101", "time": 1606850766156, "rating": 1.0, "text": "I signed with them for my minor son. When i hire someone i don't want to hear \"i don't know\" \"Do what you think is best\" Then when i send a letter of disengagement. They get their snooty little whatever she is to say \"we're not sending anything\" you're fired means Y0UR FIRED GET OFF MY CASE! PERIOD! They were told back in August. Come to find out they snuck under the radar and still think they're representing my son! DON'T WASTE YOUR TIME. THESE POS DON'T CARE AND DON'T COMPREHEND YOUR FIRED!", "pics": null, "resp": null, "gmap_id": "0x88891b9b9d8c9a65:0x21da5da86f128744"}
{"user_id": "113051620845881868061", "name": "lenaye heaven", "time": 1602623172609, "rating": 5.0, "text": "Very professional definitely highly recommended if you're looking for an attorney that would represent you in the best way possible", "pics": null, "resp": null, "gmap_id": "0x88891b9b9d8c9a65:0x21da5da86f128744"}
{"user_id": "108356372951689858443", "name": "The C Show Hosted by Chris", "time": 1622051847302, "rating": 1.0, "text": "Do not use this firm.  I used the Trussville branch. The office manager is great. My case should have been a lay up.  My lawyer had no idea what my disabilities were. I had to tell the judge..", "pics": null, "resp": null, "gmap_id": "0x88891b9b9d8c9a65:0x21da5da86f128744"}
{"user_id": "105551461292114246671", "name": "TONYA HOWELL", "time": 1614283870850, "rating": 3.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x88891b9b9d8c9a65:0x21da5da86f128744"}
{"user_id": "102805687630343967706", "name": "Bug Beezy205", "time": 1559763653371, "rating": 1.0, "text": "This has been one of the worst disability law firms I’ve ever In countered. Both Birmingham and Bessemer locations, I can’t speak for any other places but those two have terrible front desk assistance their very unprofessional and nonchalant about my case. I’ve been with them over two years and have lost everything I’ve had before I called them to represent me, on top of my daughter being diagnosed with cancer. Thanks again for not being the company you promised to be!!", "pics": null, "resp": null, "gmap_id": "0x88891b9b9d8c9a65:0x21da5da86f128744"}
{"user_id": "112408858498333947081", "name": "Terry Hopson", "time": 1551504439419, "rating": 5.0, "text": "Y'all always do a good job have a blessed night", "pics": null, "resp": null, "gmap_id": "0x88891b9b9d8c9a65:0x21da5da86f128744"}
{"user_id": "117658125351201934681", "name": "Angela Burnett", "time": 1500051255994, "rating": 1.0, "text": "Rude,not helpful", "pics": null, "resp": null, "gmap_id": "0x88891b9b9d8c9a65:0x21da5da86f128744"}
{"user_id": "112539449386916011982", "name": "Melisa Daniel", "time": 1628085437350, "rating": 5.0, "text": "I recommend Bill Smith to anyone who needs a great Lawyer.  Definitely!!", "pics": null, "resp": null, "gmap_id": "0x888ca38a0ba253e7:0xcf940929c7e619ea"}
{"user_id": "103865701554264344110", "name": "Roll Tide", "time": 1627397120066, "rating": 1.0, "text": "just bad service", "pics": null, "resp": null, "gmap_id": "0x888ca38a0ba253e7:0xcf940929c7e619ea"}
{"user_id": "116789118247400310297", "name": "Shasta Robinson", "time": 1583377251166, "rating": 5.0, "text": "Worth the money. Worth the time. Very educated and experienced to provide the best outcome for you", "pics": null, "resp": null, "gmap_id": "0x888ca38a0ba253e7:0xcf940929c7e619ea"}
{"user_id": "106128560727927232419", "name": "Hannah McDaniel", "time": 1520914530712, "rating": 5.0, "text": "After I went through hell and back and back again and lived a nightmare, one some can never make it out of. The court system/employees that work for Chambers County Court System can be trifling but not so much as the judges are. They run everything, including about half of the lawyers. Money talks. But when In got my first charge in 2009 and I'm 28 now, I hired Bill Smith and he actually paid attention and I truly believe, wanted justice, but 5 or 6 years after I got arrested, 2 years in drug court(layer of hell), Bill Smith got my case dismissed and justice was served. I would hire him again in a heartbeat!!", "pics": null, "resp": null, "gmap_id": "0x888ca38a0ba253e7:0xcf940929c7e619ea"}
{"user_id": "116906794386225370648", "name": "Joseph Bell", "time": 1596161905233, "rating": 5.0, "text": "BEST ATTORNEY ALL AROUND", "pics": null, "resp": null, "gmap_id": "0x888ca38a0ba253e7:0xcf940929c7e619ea"}
{"user_id": "108138575226867481159", "name": "Ernest Talley", "time": 1604532101986, "rating": 5.0, "text": "He is awesome", "pics": null, "resp": null, "gmap_id": "0x888ca38a0ba253e7:0xcf940929c7e619ea"}
{"user_id": "108612513390153059906", "name": "LARRY MOORE", "time": 1566838264556, "rating": 3.0, "text": "Very nice and really respectfull", "pics": null, "resp": null, "gmap_id": "0x888ca38a0ba253e7:0xcf940929c7e619ea"}
{"user_id": "111526592346474380626", "name": "Greg Mcclellan", "time": 1581796391685, "rating": 5.0, "text": "Great lawyer", "pics": null, "resp": null, "gmap_id": "0x888ca38a0ba253e7:0xcf940929c7e619ea"}
{"user_id": "112364353094767107971", "name": "AJ", "time": 1617688968373, "rating": 5.0, "text": "The women that work there are very nice and make going into the business not seem to be a chore.", "pics": null, "resp": null, "gmap_id": "0x888d4774ac3a497b:0x61e03725b54bd0fe"}
{"user_id": "103698550677850184810", "name": "Shelia Rumph", "time": 1609957985593, "rating": 5.0, "text": "My favorite place , I will always shop their.", "pics": null, "resp": null, "gmap_id": "0x888d4774ac3a497b:0x61e03725b54bd0fe"}
{"user_id": "106206796937832747545", "name": "Crystal Ragan", "time": 1583354479906, "rating": 3.0, "text": "They are very friendly there hard to get anyone on the phone but besides that the people are good and the rates are pretty good", "pics": null, "resp": null, "gmap_id": "0x888d4774ac3a497b:0x61e03725b54bd0fe"}
{"user_id": "108016584629829902208", "name": "Tiffany Walker", "time": 1570823765257, "rating": 5.0, "text": "Quick service. Friendly staff. Great prices!", "pics": null, "resp": null, "gmap_id": "0x888d4774ac3a497b:0x61e03725b54bd0fe"}
{"user_id": "113352435881010930037", "name": "One Lung", "time": 1591297765229, "rating": 3.0, "text": "Pricing is back and forth and the lady who helped me was very impersonal. Didn't care for the vibe", "pics": null, "resp": null, "gmap_id": "0x888d4774ac3a497b:0x61e03725b54bd0fe"}
{"user_id": "114028193331871940201", "name": "Janet Turner", "time": 1575238348350, "rating": 5.0, "text": "Great insurance prices", "pics": null, "resp": null, "gmap_id": "0x888d4774ac3a497b:0x61e03725b54bd0fe"}
{"user_id": "115018598953679105961", "name": "chris domino", "time": 1583853617277, "rating": 5.0, "text": "Great deals", "pics": null, "resp": null, "gmap_id": "0x888d4774ac3a497b:0x61e03725b54bd0fe"}
{"user_id": "113574670412712817861", "name": "Juanita carter", "time": 1562511533290, "rating": 5.0, "text": "Friendly and fast", "pics": null, "resp": null, "gmap_id": "0x888d4774ac3a497b:0x61e03725b54bd0fe"}
{"user_id": "100223822991006352351", "name": "Sandra Wood", "time": 1614895917782, "rating": 5.0, "text": "This is hands a great law firm.  Steve Heninger and his paralegal Pamela were phenomenal from start to finish.  Steve took our complex case, and was responsive/empathic throughout the entire process.  He was able to reach a successful resolution without having to proceed with a trial.  We were very pleased with the outcome, and would not hesitate to use this firm in the future.  Would highly recommend.", "pics": null, "resp": {"time": 1615248295893, "text": "Hi Sandra, thank you for the great review. We always put our clients first, and it’s excellent to see that you had a five-star experience with us."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "117448887259587661989", "name": "Jack Simpson", "time": 1621350993699, "rating": 5.0, "text": "Eric has been working  on a case for me for awhile now. He’s always communicated with me about the case and was always looking out for my best interests. I would recommend them to anyone who’s looking for a great attorney. Thanks you sir for all you’ve done for me and always going the extra mile.", "pics": null, "resp": {"time": 1621364096973, "text": "Thank you for your review, Jack! Communication is a top priority when it comes to serving our clients at HGD."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "104068073877662004616", "name": "Jessica Shackelford", "time": 1614702477089, "rating": 5.0, "text": "Working with Nada and Jackie was a dream! They always made themselves available to answer questions. They explained things clearly to me that allowed me to make the best decision for me. They never stopped fighting for my case to ensure I received what was deserved. I can truly say they have changed my life!", "pics": null, "resp": {"time": 1614888219410, "text": "Hi Jessica, thank you for leaving us a great review! We’re here to give our clients the best representation and it’s fantastic to hear that you received top-quality legal support."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "100931808633067923799", "name": "Neal Owings", "time": 1624460239058, "rating": 5.0, "text": "Excellent Law Firm, Anna Carroll did her due diligence and exceeded my expectations. Thank you!", "pics": null, "resp": {"time": 1624460931185, "text": "Thank you for the 5-star review, Neal!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "103514086294878354306", "name": "MsBooFish", "time": 1627771472452, "rating": 5.0, "text": "Consummate and compassionate professionals! I highly recommend this firm!!", "pics": null, "resp": {"time": 1627911376679, "text": "Thank you for your kind words!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "107388512022129772614", "name": "Dustin Mccombs", "time": 1611773710890, "rating": 5.0, "text": "During my experience with Heninger Garrison Davis, I have been shown courteous, personalized, and prompt coordination in our relationship. I am never left in the dark and am always included step by step in progress and decision making along the way! They have been an excellent firm to work with!", "pics": null, "resp": {"time": 1612230062991, "text": "Hi Dustin, thank you for the great review. We always put our clients first, and it’s excellent to see that you had a five-star experience with us."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "112910142062003713756", "name": "Jonathan Lusk", "time": 1615469332047, "rating": 5.0, "text": "As a practicing attorney myself, I was well aware of this law firm's excellent reputation before I selected them to handle a lawsuit on behalf of my family. The firm lived up to its reputation and more.  Attorneys Tim Davis and Mark Ekonen handled our case. They both worked tirelessly all the way through to a successful settlement. My family and I could not be more pleased with their legal expertise and consummate professionalism. Moving forward, I will refer clients to Heninger Garrison Davis without reservation. Take it from an attorney who knows the difference between average and superior legal representation -- if you have been wronged and need a top flight law firm in your corner to achieve the best possible result, contact Heninger Garrison Davis.", "pics": null, "resp": {"time": 1615471606817, "text": "Thank you so much for your kind words, Jonathan! It means so much coming from a fellow member of the legal community. All the best to you and your family!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "108263681152454855991", "name": "Jacklyn Stegman", "time": 1614369530401, "rating": 5.0, "text": "After our bad accident (a semi truck merged into us at 65mph) myself and my mother-in-law were referred to Heninger Garrison Davis as the people who could help us the best. Let me tell you, they were right. The people we worked closest with were Mark,  Eric, and Beverly, and they are all so friendly and helpful.\n\nEven considering that I moved to a different timezone shortly after the accident, I still felt that I was able to easily communicate with them about any questions or concerns I was having (they respond with most efficiency to email in my experience).\n\nDuring negotiations with the other party (which lets face it, thats the part all of us care about the most) I was shocked by how willing this practice was to work with us and help us obtain the settlement we needed to finally put this ugly event behind us. While I sincerly hope that I am never in another situation that would call for it, I would happily use this law firm again and/or refer them to any friend or family member in need of legal representation.", "pics": null, "resp": {"time": 1614815223284, "text": "Hi Jacklyn, thank you for leaving us a great review. We’re here to give our clients the best representation and it’s fantastic to hear that you received top-quality legal support."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "103328392431722193625", "name": "Lisa Jones", "time": 1607621476590, "rating": 5.0, "text": "I truly had a pleasant experience working with Anna. This was a very sensitive matter for me & my first legal issue. Anna came highly recommended to me, and I would recommend her to someone else. I really appreciate you representing me.", "pics": null, "resp": {"time": 1611161443872, "text": "Thank you for your recommendation, Lisa! We are lucky to have clients like you and want to do everything we can to support you and get the outcome you deserve!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "100202754459755523423", "name": "Kam Pugh", "time": 1616170997721, "rating": 5.0, "text": "Erik persevered and kept me updated through a process where an insurance company tried to draw things out as long as possible. I would highly recommend Erik and his team to anyone who has a need in this area.", "pics": null, "resp": {"time": 1616185702960, "text": "Thank you for your review, Kam! Communication is a top priority when it comes to serving our clients at HGD."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "109858388818703864714", "name": "Matt Sato", "time": 1611761673606, "rating": 5.0, "text": "Unfortunately we had an accident where my wife was injured in a car accident and we needed to seek representation.  The process is already stressful and difficult but Brandy Robertson and her team at Heninger Garrison Davis, LLC provided knowledgeable and excellent service that brought acceptable resolution to our case.  Especially during the current COVID environment and with the courts being backed up it was great to see this Firm adapt to the current situation and get our case settled.", "pics": null, "resp": {"time": 1612230107811, "text": "Hi Matt, thank you for leaving us a great review! We’re here to give our clients the best representation and we are honored to have been able to work with you and your family."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "112005915573678205669", "name": "Cassie Gilbert", "time": 1611780890408, "rating": 5.0, "text": "Mr. Leonard is a very kind and  caring person. He has handled everything quickly and professionally.", "pics": null, "resp": {"time": 1612230040171, "text": "Hello, Cassie – thank you for the great review! We will pass along your kind words to Mr. Leonard as well."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "109618002338938492867", "name": "Brian Kinsley", "time": 1603217498179, "rating": 5.0, "text": "Henninger Garrison Davis is a great firm that works hard for their clients.  They are leaders in the legal community and results driven. I have worked on projects with them for years and enjoy collaborating with them.", "pics": null, "resp": {"time": 1603397732071, "text": "Thank you so much, Brian. We enjoy collaborating with you as well!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "100135860165502881183", "name": "Jeannie Nabers", "time": 1615241875739, "rating": 5.0, "text": "For anyone in need of professional, caring advice or representation, I highly recommend Heninger Garrison Davis, LLC.", "pics": null, "resp": {"time": 1615248269478, "text": "Thank you for leaving us a five-star review, Jeannie. Having you as a client has been a pleasure!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "109827643183457029276", "name": "Melissa Williams", "time": 1603392002144, "rating": 5.0, "text": "Ive had a great experience with them and I will be working with them in the near future for other cases if needed..", "pics": null, "resp": {"time": 1603397677166, "text": "Thank you for the kind words, Melissa. We are here for you if you ever need us."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "111836952100666997166", "name": "susan belcher", "time": 1589478689421, "rating": 5.0, "text": "I would highly recommend this firm. They are a very experienced, ethical, professional team which provided me with excellent legal advice for a complex issue. Thank you Beverly and Erik!", "pics": null, "resp": {"time": 1589502970482, "text": "Thanks, Susan. Great clients lead to great results!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "118124565530071795128", "name": "Megan Miller", "time": 1613176897165, "rating": 5.0, "text": "Knowledgeable, professional and thorough attorneys and staff", "pics": null, "resp": {"time": 1614045764895, "text": "Thank you for the thoughtful review, Megan!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "115769008729721991113", "name": "Laura Coe", "time": 1572910601807, "rating": 4.0, "text": "My husband and I are in the midst of a class action, medical device failure, we believe the manufacturer of the product is liable for his 15 year, ongoing medical battle with the device. Even though we have not met face to face with the attorneys,  HGD has always been quick to return phone calls, answer our call, the first time, not after days and days of leaving voicemails. Our contacts are busy doing all the leg work, representing other clients in court, etc. They are professional, keep you informed, and answer your questions quickly and honestly to the best of their ability. Sometimes the answers aren't what you want to hear, but sometimes the truth hurts. Their experience , willingness to work ethically as a team shows! I plan on writing another review down the line as our case proceeds through the judicial system.", "pics": null, "resp": {"time": 1572915821542, "text": "Thank you so much for your kind words, Laura! We really appreciate you taking time to share your experience with us! We are so glad that your needs are being met by our team and that we are keeping you updated on your case. We count ourselves lucky for clients like you and your husband! Please feel free to reach out to anyone on our team at any time should you need our assistance! Thanks again"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "117813000061196327661", "name": "colette Jones", "time": 1565891295396, "rating": 5.0, "text": "This is a highly reputable firm with highly knowledgeable attorneys. The staff are warm and caring. Highly recommend!", "pics": null, "resp": {"time": 1565891590285, "text": "Thank you for the great review! We are here to help you anytime."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "116724168243060263378", "name": "Stephen Orr", "time": 1617988559066, "rating": 1.0, "text": "Grossly misled, ignored and overcharged!", "pics": null, "resp": {"time": 1617993523719, "text": "Dear Stephen,\n\nThank you for taking time to post a review for us. We are sorry to hear that your experience was not what you expected. We set a high standard for ourselves and we’re so sorry to hear this was not met in your interaction with our business. We do pride ourselves on our clear communication and full disclosure of all fees at the beginning of any client relationship. For that reason, we would like the opportunity to talk with you and investigate your feedback further. Please feel free to reach out to me directly at 205-327-9121 at your convenience so we may discuss how to possibly resolve your issues. Thanks again.\n\nT. Gauldin – Firm Admin"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "103367730960486795057", "name": "Linda Bond", "time": 1578765196010, "rating": 5.0, "text": "I recommend this attorney, he works hard for his client’s best interest.", "pics": null, "resp": {"time": 1580337074375, "text": "Thank you for your recommendation! We are lucky to have clients like you and want to do everything we can to support you and get the outcome you deserve!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "113802985391468570626", "name": "Bill Freise", "time": 1572975913938, "rating": 5.0, "text": "Bill Bross is the greatest. I have never dealt with any one who is more helpful professional or caring I recommend them 110 pct", "pics": null, "resp": {"time": 1572982930898, "text": "Thank you for the great review, Bill! We could not agree with you more about Bill Bross. He is the best of the best! We are also very thankful for great clients like you! Thank you for putting your trust in us and we look forward to our continued partnership with you!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "114487378074814080881", "name": "Mark Phillips", "time": 1584291222506, "rating": 5.0, "text": "I can't say it would be a conflict of interest. Just kidding these guys are very professional and there's a whole team of them there they get it done thanks guys", "pics": null, "resp": {"time": 1589502994161, "text": "Thanks so much Mark! We appreciate working with people like you!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "114007062462287616139", "name": "John Smith", "time": 1619300763618, "rating": 5.0, "text": "Great people", "pics": null, "resp": {"time": 1619442704008, "text": "Thank you, John! It is always a pleasure helping clients."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "108516747051589409617", "name": "Bentley Schoening", "time": 1539708503403, "rating": 5.0, "text": "We have worked with HGD for many years. They are a very reputable firm with exceptional attorneys and staff. Highly recommended!", "pics": null, "resp": {"time": 1565891651641, "text": "Thank you for the kind review, Bentley. We have enjoyed our partnership with you as well."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "112544730905252623315", "name": "Kewanee Fox", "time": 1558353981216, "rating": 5.0, "text": "Nice office.", "pics": null, "resp": {"time": 1565891623846, "text": "Thank you for taking time to review our firm! We hope to see you soon."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "116909536351440176650", "name": "Bobbie Payne", "time": 1497800149532, "rating": 5.0, "text": "They are great lawyers", "pics": null, "resp": {"time": 1536772384282, "text": "Thank you for the kind words!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "101768783092899364813", "name": "Heather Ormsby", "time": 1614318139841, "rating": 5.0, "text": "Rick, Jr. took care of a difficult custody case for us. He came highly recommended by close friends of ours and did not disappoint. I hope to never need legal counsel in the future but, if  I do, I will be sure to use him for all of our legal needs.  Thank you, Rick!", "pics": null, "resp": null, "gmap_id": "0x88926c271dd44abd:0x57a89644809e4cf9"}
{"user_id": "109324422851809026462", "name": "Diana Hall Bixby", "time": 1600449604582, "rating": 5.0, "text": "Outstanding,  will always use them for my legal needs.", "pics": null, "resp": null, "gmap_id": "0x88926c271dd44abd:0x57a89644809e4cf9"}
{"user_id": "103835974187546984524", "name": "Paula Thomas", "time": 1477922749845, "rating": 5.0, "text": "They get the job done right, very friendly and helpful to clients.  I always want them on my side for sure! Rick and his wife are really good people, and his dad seems to be just as wonderful.", "pics": null, "resp": null, "gmap_id": "0x88926c271dd44abd:0x57a89644809e4cf9"}
{"user_id": "101656406587633375499", "name": "Amanda Cairns", "time": 1578053568687, "rating": 5.0, "text": "Great lawyer", "pics": null, "resp": null, "gmap_id": "0x88926c271dd44abd:0x57a89644809e4cf9"}
{"user_id": "106685406444347128393", "name": "Matt Campbell", "time": 1578414832599, "rating": 5.0, "text": "Excellent.", "pics": null, "resp": null, "gmap_id": "0x88926c271dd44abd:0x57a89644809e4cf9"}
{"user_id": "102903477278571145953", "name": "Antwon Lewis", "time": 1499471772603, "rating": 5.0, "text": "Great experience", "pics": null, "resp": null, "gmap_id": "0x88926c271dd44abd:0x57a89644809e4cf9"}
{"user_id": "103883477169374748394", "name": "Tammy Tarrel", "time": 1618263700148, "rating": 5.0, "text": "Unlike many other reviewers, I had a good experience! I only spoke with Ms.Hicks when I called and she was nice each time. I was able to pay a deposit on my account and then was placed on an affordable payment plan.. I made one monthly payment but decided I'd be better off paying the balance in full rather than have interest accumulate & make my balance increase despite having paid on it..  I paid the balance in full (it wasn't cheap but worth it) & received my receipt & satisfaction of judgment letter in the mail a few days later!", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "118015714714591518917", "name": "anon B", "time": 1622891083342, "rating": 5.0, "text": "Very reasonable for a debt collection agency. I was worried about the situation escalating to the courts, but they gave me a very reasonable monthly payment plan instead. The interest rates are trash but that's what our current legislature allows.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "107164701229691855618", "name": "Kareem Spence", "time": 1625621671675, "rating": 5.0, "text": "Excellent lawfirm handle business to the fullest degree.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "110743265015479340109", "name": "Ada Elmo", "time": 1605040578211, "rating": 1.0, "text": "I remember I was placed her as a temporary worker, and I only stayed for an hour! The energy was off. It was clear that this law firm didn’t want my kind in their building. I really wish companies, especially Black-owned company, would do some research on this law firm. They don’t want to hire your people but will take your money. Classy example of the system we live in!", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "106920479456680942283", "name": "Rhon Anthony", "time": 1617307835304, "rating": 5.0, "text": "For the past two months, I received GREAT CUSTOMER SERVICE!!! I don't remember his name but he's awesome, kind and POLITE!!! Before dealing with him, I dreaded calling in to make a payment but now it's much more pleasant!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "106575450091793020952", "name": "B K", "time": 1614871980737, "rating": 1.0, "text": "I have paid this place over 5000.00 lisa is rude and refuses to work with me. They suspended my license because i missed some payments while i was out of work first because of a car wreck then my grandson was airlifted to uab. I offered to pay a large amount to restart payment they refused said i had to offer a settlement i did they refused it. Hung up in my face and refused to be of any help.i called the county where it all started this place has not showed them that i paid a thing. I have to drive my gr2 ba k and forth to ua. I will end up in jail if i get tickets for driving with no license. They are heartless as hell. They dont care if you pay or not they have the power to rui. Your life. Sad thing is i dont mind paying but they will not help you.i do not see how these people work with customer ser2 but have no skill with their own kind. People are people we cant just throw you everything we make we have families too.i make 2.13 an hour im willing to do whats right but you couls care less. I pray that you find hardship like many of us have . you dont deserve to hurt people the way you do", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "109914277118529226676", "name": "Mom & Son Tv", "time": 1605322438961, "rating": 1.0, "text": "I understand their job, I also work in the collection field so I know... but there are ways you talk and treat people , The worse collection company I‘ve ever dealt with. Tammy needs to be fired due to her having a really rude attitude very unprofessional person everyone else I have spoken with has been very understanding and very sweet to me.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "106730174953950426036", "name": "Ashanti K. Smith", "time": 1611605077626, "rating": 1.0, "text": "The level of professionalism is 0!!! No need to call names because I serve a God whose vengeance is far greater than mine!!!", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "103921841147942267369", "name": "Dent West", "time": 1585244687647, "rating": 1.0, "text": "Rude as hell. Never gives you a call back if you leave a message. Highly unprofessional", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "104662468871567580229", "name": "Kayla Toney", "time": 1446481173846, "rating": 5.0, "text": "OK so they are a debt collecting company. I'm sure not a fun job. Of course I owe a lot so they had to sue me. But these people were so nice. They did not treat me as if I was this horrible person. The lady Ginger who does the collections is amazingly nice. I feel so comfortable now getting my issues resolved. Most debt companies treat you with harsh words and do not try to work with you but they do. I will be happy to do business with them and hopefully don't ever have to go through debt again.\nI will make sure they are the first debt collector I pay.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "115995876024001828619", "name": "Itz_Rain Gachatube vids", "time": 1551309323987, "rating": 1.0, "text": "You take people's hospital bills and triple them... and visiting the office today, I feel so sorry for you that this is your life's work and mission. You dont care what people are dealing with as long as you get paid.Yall made a good profit from me. I hope the office lady takes the extra money and gets some needed glasses. I gave it one star only cause your human.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "110016887070521195218", "name": "Shameecka Sharpe", "time": 1517604712480, "rating": 1.0, "text": "I work in a customer service driven industry, I’m a Registered Nurse. I go the extra mile every single day, not because I’m required to but because I have empathy and compassion. This office contacted me after I sent a Cashiers Check via Fed Ex to their establishment on a Monday. Today is Friday, I’ve left several voicemails on several different answering machines, not one single person has returned a call, NO RESOLUTION. I never leave reviews, however I’ve never experienced worse customer service. I will now have to write the judge because they couldn’t take five minutes out of their day to go the Extra mile. As I write this review I sit and I reflect on the living that was very close to death, had I not gone the EXTRA MILE. I hope to GOD, in your future someone goes the EXTRA MILE for you or your loved one.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "100344690378621085956", "name": "Misty Benson", "time": 1508953851152, "rating": 1.0, "text": "Jody has the worst attitude ever! Her tone is very condescending and she talks to you as if you're ignorant. People like her shouldn't be allowed to work with the public. Alice is great, I highly recommend her over anyone.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "102655655028842173414", "name": "Celita Ware-Thomas", "time": 1482347326125, "rating": 1.0, "text": "They are debt collectors but their approch to resolving financial issues is very unethical and inappropriate. Ginger is very unprofessional and inconsiderate. Yelling, threatening, or rude irrational comments does not make debt vanish. However, it does upset the individual in debt. As debt collectors your job is to clear up delinquent accounts but as a person you should be considerate of the individuals financial situation and be willing to negotiate. Thank God I'm a strong person because their antics would have completely broken my spirit.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "106632062537449016525", "name": "Robert Williams", "time": 1596822417959, "rating": 1.0, "text": "Extremely rude receptionist.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "118289979825483616905", "name": "Sydney Contorno", "time": 1520612750074, "rating": 1.0, "text": "They barely ever answer the phone and are no help when they do. They are rude especially alice and jody who does work there because I talked to her last week.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "109273942864307686889", "name": "Brandon Potter", "time": 1573576155644, "rating": 1.0, "text": "Very unprofessional and inconsiderate.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "109690652985076105845", "name": "Wes Mills", "time": 1513891460900, "rating": 1.0, "text": "Called in the day after being served. Was told they could take payment by card. Less than a week later they demand that the payment be in Money Order or Cashier's check for an amount higher than they had originally told me. Shady practices are bad for business", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "100763830047430070173", "name": "Jay Jay", "time": 1508850889383, "rating": 1.0, "text": "I paid what i owe but cant get a paid in full letter.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "100668483139159224711", "name": "Jorge Escobar", "time": 1519411685566, "rating": 1.0, "text": "Nasty and rude people , did not take the time to listen just a specially the branch manager.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "117392310698424747333", "name": "Saira Mateo", "time": 1459365220109, "rating": 2.0, "text": "The receptionist is really rude.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "115755996092392989683", "name": "Kenneth Wallace", "time": 1623698931695, "rating": 4.0, "text": "Pretty well organized the lawyers seems very helpful the receptionist was very helpful and nice", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "103514265552640542213", "name": "Bobby earhart", "time": 1623107223084, "rating": 5.0, "text": "ONE OF THE BEST LAW FIRMS IN ALABAMA!", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "100432544266529477784", "name": "Jose Rodriguez", "time": 1621896694960, "rating": 4.0, "text": "They really do get everything in order and help u threw anything you give them what you got and they do the rest", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "101711220989435912831", "name": "Geneva Burton", "time": 1551572891921, "rating": 1.0, "text": "I visited this law firm with the intention of establishing a Will, Power of Attorney and an Advanced Health Care Directive.  When I initially set up my appointment I was uninformed of how the process worked as well as what items I could include. Unfortunately, when I left the appointment I was still uninformed about how the process work and the items I could include.  The appointment lasted approximately 15 minutes. I felt as if I was ushered in and out of Mr. Pettey's office in an effort to move on to someone or something more important.  Afterward, I choose not to continue with their services and received a bill in the amount of $375 for services rendered for a DRAFT of a Will, Power of Attorney, and Advanced Health Care Directive. Will not be recommending this firm to any of my friends.", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "106456949975824239912", "name": "Emory Daniel", "time": 1530314760666, "rating": 5.0, "text": "Very helpful and I highly recommend them. If in need of an attorney at least give they a try before you make the decision.", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "106562742900986380804", "name": "Tim Chambliss", "time": 1490906723137, "rating": 5.0, "text": "Everyone at Samford & Denson are exceptional. Quick, concise and experienced. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "115510910853009528258", "name": "Sarah Meloy", "time": 1473420164947, "rating": 5.0, "text": "We had a wonderful experience with the team at Samford and Denson, LLP, specifically Jennifer Chambliss and Donna Kilcrease. It was a comfort to have Mrs. Chambliss by our side on some of the most important days of our lives. She always made sure to cover all bases and kept a level head on all issues. She is very much an honest and straightforward attorney who always took the high road to ensure our best interest in every situation. Jennifer Chambliss is highly recommended by our family.", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "103326764959457889556", "name": "billy chapman", "time": 1502079914767, "rating": 5.0, "text": "Dedicated lawyers, worth every penny!!!", "pics": null, "resp": null, "gmap_id": "0x888c9338ee2036f3:0xeb67fe2536a5873d"}
{"user_id": "104862434534815535549", "name": "KIRK HOLLAR", "time": 1610923049311, "rating": 5.0, "text": "My wife and I contacted Inge about 7 months ago to help with our bill at a major hospital in Alabama.  We changed health insurance just after  she was diagnosed with a tumor on her leg.  The new insurance company refused to pay any of the bill because they considered it to be a preexisting condition.  Inge was able to considerably (I mean CONSIDERABLY) reduce our bill at the hospital which saved us thousands of dollars.  This law firm is very professional, friendly, and knowledgeable about their business. I would highly recommend this law firm to anyone needing help. We are very blessed to have been connected to Inge. Have a blessed day!", "pics": null, "resp": {"time": 1610923726069, "text": "Kirk, thank you so much for your review. I enjoyed helping both of you and getting to know you. Please let me know if there’s anything we can do for you in the future."}, "gmap_id": "0x88891b95d620a057:0xeef1091a645169d5"}
{"user_id": "111454127021705492230", "name": "Meca Jackson", "time": 1611689200549, "rating": 5.0, "text": "It was such an hour and pleasure to work with you guys. You all were very professional and handled my case with dignity. I feel like we developed great rapport that will last a lifetime. I appreciate the fact that you all are always available. If I have a question you all answer within a timely fashion. I could not have asked for better lawyers.", "pics": null, "resp": {"time": 1611690281773, "text": "Thank yo so much for your kind words, Meca!"}, "gmap_id": "0x88891b95d620a057:0xeef1091a645169d5"}
{"user_id": "113276606867540648204", "name": "Fatema Ally", "time": 1611855591893, "rating": 5.0, "text": "We had our gas station burned insurance company was trying to not pay us our money Mr. JOHNSTONE help us at that hard time.he was our hope...n with  his help we r back in business again..\nHe is very honest not a greedy person..if he can do things for u he do otherwise he will tell u No...\nNot like other lawyers trying to get money n do nothing\nNow wen ever we need advice we call him n he always help us give us suggestions..\nThank u we appreciate your support and help.\nGod bless u.", "pics": null, "resp": {"time": 1611856628519, "text": "Thank you for your kind words. I always enjoy hearing from you and am privileged to have represented you."}, "gmap_id": "0x88891b95d620a057:0xeef1091a645169d5"}
{"user_id": "115165012043981655386", "name": "LeAnne Hall", "time": 1611689521210, "rating": 5.0, "text": "Overall, I am very satisfied with the services of Johnstone Carroll. My calls are always promptly returned, the staff has always been courteous and helpful, and the location is convenient if I need to go by the office.\n\nLegal issues can be overwhelming and time consuming. Seemingly, delays are the norm and the \"one step forward, two steps back\" mentality can be quite frustrating. Inge Johnstone has always explained complex issues to me in an understandable manner and that makes the process bearable. If I were giving advice to someone seeking the services of an attorney, I would advise them to choose one that WINS and one they like. Inge has always been kind and compassionate and I appreciate his commitment to fight for me and win!", "pics": null, "resp": {"time": 1611690351410, "text": "LeAnne, thank you. It is my honor to represent you."}, "gmap_id": "0x88891b95d620a057:0xeef1091a645169d5"}
{"user_id": "118234265586445224663", "name": "Ireka Shuriah", "time": 1619044944991, "rating": 5.0, "text": "Very courteous and friendly Mr inge Johnstone keen listener customer friendly would recommend his firm to everybody", "pics": null, "resp": {"time": 1619128730239, "text": "Thanks Ireka! I enjoyed meeting with you."}, "gmap_id": "0x88891b95d620a057:0xeef1091a645169d5"}
{"user_id": "106775292264714305400", "name": "Taquisha Garrett", "time": 1609173599886, "rating": 5.0, "text": "First of all the office is very clean & neatly kept! The staff is very friendly and responsive, but what blows my mind is how fast the attorney responds to messages man I’ve never been able to leave a message with a law firm an get a call back within hours or at least a day! I will be calling this office with any future concerns because even if they can’t help you here they will point you in the right direction I’m not just talking I’m speaking from experience 😘🥰 Inge was amazing!!!", "pics": null, "resp": {"time": 1609175524664, "text": "Wow! Taquisha, thank you so much! You’ve given us high praise and we intend to live up to it. I hope you don’t need us, but if you do I am here."}, "gmap_id": "0x88891b95d620a057:0xeef1091a645169d5"}
{"user_id": "101730162349981400725", "name": "Todd Mccarver", "time": 1608762943554, "rating": 5.0, "text": "I was represented by Inge in a federal class action lawsuit. I was impressed by his willingness to answer my questions and his professionalism. We won a precedent setting federal labor case. Years after that case, Inge reached out to me after the tragic death of my son and  further proved to me that he was not only my attorney but a friend who genuinely cares about his current and former clients. I am currently represented by him in another case.  I highly recommend Johnstone Carroll.", "pics": null, "resp": {"time": 1608776831771, "text": "Todd, I am humbled by your words and am proud to represent you."}, "gmap_id": "0x88891b95d620a057:0xeef1091a645169d5"}
{"user_id": "118197521319135280952", "name": "Trina Coleman", "time": 1605221788998, "rating": 5.0, "text": "Very easy to work with. Answered all my questions in a timely manner and kept me informed through every step of the process. Loved working with Inge but hope to never have to again lol", "pics": null, "resp": {"time": 1605226920016, "text": "Thanks Trina! I enjoyed representing you, but I also hope that you don't need my help again!"}, "gmap_id": "0x88891b95d620a057:0xeef1091a645169d5"}
{"user_id": "103856976724454904864", "name": "E. Nathan Harris", "time": 1625088500887, "rating": 5.0, "text": "Excellent lawyers.", "pics": null, "resp": {"time": 1625094260164, "text": "Thanks Nathan!"}, "gmap_id": "0x88891b95d620a057:0xeef1091a645169d5"}
{"user_id": "110995540192298748072", "name": "Glenda Dickie", "time": 1568253284093, "rating": 5.0, "text": "I have known Inge for several years, beginning when he helped my sister with insurance claims regarding her illness.  He was compassionate and kind, meeting with her and encouraging her and working hard to reach a successful settlement.\n\nWhen I was in need of an attorney after being injured in a car accident, I called on Inge. It was during those months when he was working on my case that I came to know him as a resourceful, tireless advocate and also as a friend. He was always accessible whenever I had a question, always interested in how I was feeling. He was able to obtain a settlement for me that was much more than I had anticipated.\n\nRecently, my elderly dad needed some legal advice.  Again, I sought Inge's help. He took time out of his busy day to talk to us and tell us how to proceed with the issue.\n\nI believe these are the reasons that Inge Johnstone is an effective and successful attorney.  He is a compassionate, kind advocate who is never too busy to take the time to listen to his clients, who he treats as friends.\nHe then uses his considerable talents as a knowledgeable, resourceful, experienced attorney to work tirelessly to obtain the best possible judgements for his clients.\n\nI highly recommend Johnstone Carroll for anyone who requires legal representation.", "pics": null, "resp": {"time": 1568399230991, "text": "Glenda, those words mean a lot coming from you. I am honored to have represented you."}, "gmap_id": "0x88891b95d620a057:0xeef1091a645169d5"}
{"user_id": "103496168289232947602", "name": "mary kate watkins", "time": 1568254958535, "rating": 5.0, "text": "I have known Inge Johnstone for almost four years. I was injured in a car wreck when I was 16, and my case took close to three years to settle. During this time, Inge maintained consistent contact. He kept me updated on how things with my case were progressing, he helped me through the deposition process since I had never done it before, and made sure the entire process was as easy as possible for me. I really appreciated that he took the time to get to know me personally and was invested in helping me. I never dreaded having to go to the office, answer a phone call, or reply to an email because he was so friendly, honest, and helpful with me. Overall, I was extremely happy with the work he did. I believe that I could not have found a better attorney anywhere else.", "pics": null, "resp": {"time": 1568399147364, "text": "Thanks Mary Kate! We really enjoyed getting to know you and look forward to hearing about the great things that you are going to do."}, "gmap_id": "0x88891b95d620a057:0xeef1091a645169d5"}
{"user_id": "108865216319146939776", "name": "Lisa Kennedy", "time": 1572640306803, "rating": 5.0, "text": "“I have known Mr. Inge Johnstone for over a decade. I was injured in a car wreck and sought legal help with recovering medical expenses as well as damages. My case took almost  three years to settle, during this time Mr. Johnstone maintained consistent contact with me.\n\nHe took me to the crash site to go over details of the accident while still fresh in my mind, assisted with finding the proper doctors for medical tests/evaluations, assisted with finding the best physical therapist and prepared me for the deposition process.\n\nHe returned my telephone calls promptly and I always felt like he had my best interest in mind. Overall, I was extremely happy with the work he did. He is honest, trustworthy and very personable.  I highly recommend Mr. Johnstone as a personal injury attorney.”", "pics": null, "resp": {"time": 1608757599404, "text": "Lisa, you are the best!"}, "gmap_id": "0x88891b95d620a057:0xeef1091a645169d5"}
{"user_id": "101881073832839879515", "name": "Laura Baker", "time": 1568690919564, "rating": 5.0, "text": "Inge Johnstone and his team were remarkably helpful and effective in helping us resolve a billing dispute. Mr. Johnstone was very attentive to our case, and in spite of the complexity of the situation, he had mastered all the details of the situation in a short amount of time. Both my husband and I value Mr. Johnstone's insight, and we are very impressed with the integrity and compassion he shared with us while tackling a difficult situation.", "pics": null, "resp": {"time": 1568719852319, "text": "Laura, thank you so much for your kind words. I really enjoyed getting to know you guys and helping to achieve a good result. I also appreciate you taking some time to complete this review. I know how busy you are."}, "gmap_id": "0x88891b95d620a057:0xeef1091a645169d5"}
{"user_id": "104975891816039130222", "name": "Keith Smith", "time": 1572444847763, "rating": 5.0, "text": "Extremely happy with the services provided... Wonderful people!", "pics": null, "resp": {"time": 1608757631033, "text": "Thanks Keith! Hope you are well. Merry Christmas!"}, "gmap_id": "0x88891b95d620a057:0xeef1091a645169d5"}
{"user_id": "110860448399331072407", "name": "Tanner-Gean Dowell", "time": 1627084015936, "rating": 5.0, "text": "Ian and Thomas ARE MY TEAM! They were amazing! Made my divorce quick and easy! Very responsive and professional! Will look to Ian for all my legal needs from now on! Held my hand through it all and still responds at the quickest call or E-mail!!! Cannot say how much I am at ease knowing I've got a lawyer team that works FOR me!", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106808053877852743200", "name": "Lewis McCluer", "time": 1619279026738, "rating": 5.0, "text": "I'm involved in a landlord-tenant dispute and realized I was over my head and needed help. I contacted the Powell Law Firm and got a consultation with Thomas that day. He was very attentive and professional and let me know my options in plain, no nonsense terms. He also let me know that the firm was always available should the matter get to the point that representation became necessary. When I had further questions as the situation progressed, I called back, but was unable to reach Thomas immediately, as he was in court that day. I left a message with their front desk,  and received a call back from Melvin later that day as Thomas was still in court. He listened intently and further advised me as what I needed to do, and even returned another call in regards to my issue. Both Thomas and Melvin were extremely helpful in what was to me new territory as I had never been in a situation like this before. They stood ready to assist any way they could to include retaining their services should the need arise. As a retired Marine with 26 years service I know professionalism when I see it. Hope I don't need to retain an attorney for this current situation but I have full confidence in them should that need arise. I highly recommend that you contact them in the event you fell you may need the services of an attorney/", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "113487847135832316301", "name": "Lisa Edwards", "time": 1626804915412, "rating": 2.0, "text": "I had a 10am appointment to see Mr. Thomas today. It was the worst meeting i have ever had with this company. The young lady at the front desk was more interested in talking to her friend on the phone then greating me when i walked in. after standing there for a few minutes i was told to go have a seat in another room to wait again. as I'm waiting i can hear Mr. Thomas instructing another young associate to go and tell someone to do something and make sure they get it done because that was his money. I'm pretty sure that conversation should not have been discussed in front of a potential client. As I am sitting there explaining to Mr. Thomas why I am there seeking hes services he was more interested in picking the sores on his leg then paying any attention to anything i had to say, and while he was showing me the bruises from his recent jet ski accident all he could tell me was to seek an attorney immediately. I believe that's what I am here. What he ment was i needed a court appointed attorney because I could not afford him. So with Very unprofessional! My family has dealt with Powell Law firm for many years my aunt has know Mr. Thomas sence hes graduation year in 07. They have been wonderful people always willing to help with a smile. till now. So with no help from Mr. Thomas all I can do now is sit back and hope a friend doesn't pass away in lockup because she has a rare condition that causes her to have seizures. I am so disappointed in the actions of Mr. Thomas and the rudeness of the employees at Powell Law Firm.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "100902628666946632693", "name": "Gregory Dalzell", "time": 1626453525916, "rating": 5.0, "text": "My sister-in-law and wife were trying to figure out what to do with issues related to their father’s estate. It was especially difficult because they are in Virginia and the estate is in South Alabama. They called several South Alabama law firms seeking help and the reactions ranged from lack of response to disinterest in their concern. They called Powell Law Firm and spoke with Mr. Melvin Dixon. Mr. Dixon listened with patient understanding to their problem and did what he could for them with direction from his senior partner. They are very grateful.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "118330176431002688600", "name": "Karen Ulrich", "time": 1624466088769, "rating": 5.0, "text": "I just needed my questions answered to make sure I was making the correct decision on an eviction process.  He listened and answered all my questions and even offered to help me again.  I am so thankful he was willing to help me without the expectation of money.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "107951597291764037125", "name": "Patric Landrum", "time": 1616011996713, "rating": 5.0, "text": "I would definitely definitely recommend Ian and the Powell Law Firm to anyone. Ian has assisted my business partners and I on several task for our company.\n\nThe professionalism and service level we reviewed from this team was outstanding. We will absolutely be doing future business with this awesome team.\n\nHighly recommend!\n\nRespectfully,\nGulf Coast Security LLC.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106691410347904209936", "name": "Cassandra Karcz", "time": 1616448238393, "rating": 5.0, "text": "I called the Powell Law Firm about a situation that had me in a panic. They were able to get me in quick, and handled my situation immediately! Thomas is great, and put my mind at ease (and gave me a good laugh, while doing so). Their staff is amazing!", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106786266679158786639", "name": "Sarah Reynolds", "time": 1606271564946, "rating": 5.0, "text": "Thomas handled my case with utmost professionalism and concern for my needs and especially for my children's needs.  He was accessible and always willing to answer my questions directly and honestly, no sugar coating.  This law firm will fight for you as long as it takes. The office staff, especially Kimmie, was always ready to answer my calls and help me with whatever I needed to get accomplished at the time. During the most horrible time of my life, Thomas and Riley stood by my side until the end of this difficult process. I can't thank them enough.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "109304266640833108957", "name": "Julie Roberts", "time": 1594672264622, "rating": 5.0, "text": "I really really like Thomas Hughes, after meeting with him, and the entire staff they all made me feel comfortable, straight to the point!\nAbsolutely THE BEST LAW FIRM I HAVE EVER DEALT WITH!!!!!! Needs a 10 Star! 👍🏼", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "101476228033013696220", "name": "Valerie Coulter", "time": 1602176984211, "rating": 5.0, "text": "Outstanding crew... They were very Professional, kind, and nice to work with!!", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "102289647367991014496", "name": "FRANK RENTZ", "time": 1584737985155, "rating": 5.0, "text": "The Powell Law Firm did wills for my wife and me. They were very professional and thorough. The work was done in a timely manner. I certainly would recommend them to others. I was very pleased.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "110280103903710786743", "name": "Amber Middleton", "time": 1565722778130, "rating": 5.0, "text": "The Powell Law firm and their staff have been fantastic through out my divorce and custody issues. Riley Powell has been there to answer any questions I've had and I've sent plenty of emails to his firm and they have all been responded to and in detail.I am always kept up to date and I always feel comfortable in court and in knowing myself and my children's best interest are put first. They truly care and always make sure things are going okay for us!  Riley Powell and Thomas Hughes are hands down the best!", "pics": null, "resp": {"time": 1566253743656, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "112804854970169096855", "name": "Lydia Franz", "time": 1567184014137, "rating": 5.0, "text": "Riley told me the best thing I have ever heard about Attorney's.\n\"You pay an Attorney to worry for you\"\nNot only did he worry for me, he brought my case to the best possible outcome we could achieve. No one ever really wins when you have to take it to court, but the advice and representation that I received made my life better, and we were able to at least bring things to a acceptable conclusion.\nI would highly recommend the Powell Law Firm.", "pics": null, "resp": {"time": 1568451270274, "text": "Thank you for leaving us a review. We appreciate it!"}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106260565649116410204", "name": "C.C. Moreno", "time": 1595297372723, "rating": 5.0, "text": "Both Thomas and Riley are consummate professionals. With their combined advocacy, I would trust them with anything I needed handled.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "103890901319725228077", "name": "Doug Jacobs", "time": 1565726681016, "rating": 5.0, "text": "5-Star Performance!  I had a case that took over two years to get completed but it was all worth the effort. Riley Powell has a photographic memory and it pays off in the courtroom. Thanks again for a great job to Riley, Thomas and Kimme!", "pics": null, "resp": {"time": 1566253724942, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "117118563722722065792", "name": "Ashley Hall", "time": 1537728035194, "rating": 5.0, "text": "Riley Powell and staff are amazing. He is more than just an intelligent, skilled, driven, and experienced lawyer although those are noteworthy attributes; he is someone who cares and is passionate about fighting for you. He knows what to say and what to do, and I am grateful God saw fit to put him in my path. I highly recommend Riley Powell.", "pics": null, "resp": {"time": 1566253752448, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "111447719194241910969", "name": "Peggie Montgomery", "time": 1587768374913, "rating": 1.0, "text": "Costly and he did not represent our son as promised.  A lot of hot air!", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "112634507670671020646", "name": "Earl Suhre", "time": 1575327795549, "rating": 5.0, "text": "Mr. Powell & Thomas were Amazing in the case they were handling for us !!!! We cannot Thank Them enough ! They went above & beyond . The Best Attorneys Ever !", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "102927331386640173175", "name": "Serendipity Sharra", "time": 1529039036799, "rating": 5.0, "text": "Met with the owners on a job interview and I can honestly say they were two wonderful, friendly, honest, and smart men. I didn't get the job but they were kind and honest with that too. I would highly recommend them and will certainly go see them if ever I am in need of a lawyer.", "pics": null, "resp": {"time": 1566253778635, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106713700146633879124", "name": "Amy Elliott", "time": 1565811262181, "rating": 5.0, "text": "Riley Powell and the attorneys at the Powell Law firm are professional, knowledgeable, honest and will fight for you!  I appreciated them being so caring, and keeping me informed during my case.", "pics": null, "resp": {"time": 1566253715758, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "111700835149697040103", "name": "Donna Michelle Wade", "time": 1528082860564, "rating": 1.0, "text": "Absolutely horrible representation . I gave them $1800 cash for a simple divorce, asked for no desperation of assets, no children involved. Simple divorce that was us mail paperwork, and showing up for final dissolution court hearing. Now they are trying to extort another $625 out of me. Maybe they are \"great\"  for their rich and privaledged clients, but have no heart or soul for your everyday person. I ran home from an extremely abusive relationship and chose them because they were close by. My mistake . Do your homework and chose a attorney based on your needs, not their's.t", "pics": null, "resp": {"time": 1566254154668, "text": "Thank you for taking the time to leave us a review. Although it is difficult to hear negative feedback, without receiving reviews we can't improve our services in order to provide the best legal services for our clients. From your review, we looked at how we communicate expectations of fees with clients in more detail so there are no surprise fees from filing. We truly appreciate you took the time to leave us a review and hope you are doing well."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "103180079001744797172", "name": "Arjen Meter", "time": 1529355941422, "rating": 5.0, "text": "The Powell Law Firm has always handled any issue, question, or legal concern my family and I have came to them with quickly. I couldn’t imagine using anyone else.", "pics": null, "resp": {"time": 1566253761952, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "110012305343759381325", "name": "Christi Wallace", "time": 1565723246415, "rating": 5.0, "text": "Highly recommend Powell Law Firm. And the staff is very friendly.", "pics": null, "resp": {"time": 1566253733407, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "104770225365755219357", "name": "Ray Ainsworth", "time": 1504141749277, "rating": 5.0, "text": "Awesome attorney!! Always there when you need them. Recommend to everyone we know.", "pics": null, "resp": {"time": 1566253809574, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "103194917123923915953", "name": "Sherry Lucas", "time": 1553786294559, "rating": 1.0, "text": "Absolutely horrible attorney for custody disputes. Made my case an absolute nightmare because of no communication with me unless he wanted more money.", "pics": null, "resp": {"time": 1566254006822, "text": "Thank you for bringing this to our attention. While no one likes to hear negative comments, we sincerely need to know when we fall short in our clients eyes. Our goal is to achieve Justice for every client and provide excellent representation. From your suggestion, we have looked at how we streamline communication with clients and this is why feedback is so important. Thank you for taking the time to leave us a review."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "111708988510646622173", "name": "Liberty Avera", "time": 1502310460290, "rating": 5.0, "text": "Very professional and helpful attorneys! Would recommend them to anyone!", "pics": null, "resp": {"time": 1566253816322, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "111245771268094104840", "name": "Judi Grant", "time": 1495462706390, "rating": 5.0, "text": "Great attorney!!! I would definitely recommend him!", "pics": null, "resp": {"time": 1566253827858, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "112069465183014736856", "name": "Jennifer “Dixie” Phillips", "time": 1445644656960, "rating": 5.0, "text": "Great attorney", "pics": null, "resp": {"time": 1566253836686, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106773951176982570848", "name": "Sherrie Kelley", "time": 1551236339979, "rating": 5.0, "text": "Mrs,Keith\nIs very honest and soft spoken man . He has been our family attorney for years. And has won every case for us !", "pics": null, "resp": null, "gmap_id": "0x888f067e724cde27:0x9b8cc174a47bce83"}
{"user_id": "111578243572408020227", "name": "Angel Alexander", "time": 1584400068795, "rating": 5.0, "text": "I really love Ms. Faye and Ms. Debbie!!!!!", "pics": null, "resp": null, "gmap_id": "0x888f067e724cde27:0x9b8cc174a47bce83"}
{"user_id": "116652349380664982062", "name": "Cheryjn Carson", "time": 1566780031309, "rating": 5.0, "text": "Love Ms. Faye", "pics": null, "resp": null, "gmap_id": "0x888f067e724cde27:0x9b8cc174a47bce83"}
{"user_id": "109384991792636698650", "name": "Jamilla Neely", "time": 1577184563456, "rating": 5.0, "text": "Bless it", "pics": null, "resp": null, "gmap_id": "0x888f067e724cde27:0x9b8cc174a47bce83"}
{"user_id": "102300624154616155507", "name": "Kirt Warren", "time": 1582474797501, "rating": 5.0, "text": "Outstanding group! They have helped us so much with our legal work.", "pics": null, "resp": null, "gmap_id": "0x888602eded4983fb:0xc937397b7d990c9d"}
{"user_id": "104757779375503390395", "name": "Adam Beams", "time": 1566092317190, "rating": 5.0, "text": "Mark and Chuck provide excellent legal services!", "pics": null, "resp": null, "gmap_id": "0x888602eded4983fb:0xc937397b7d990c9d"}
{"user_id": "111381937246128677238", "name": "Ron McGuffey", "time": 1507857391855, "rating": 1.0, "text": "Very unhappy with his handling of my account and payoff from Alabama Credit Union.  Paid off thru court and payoff given to me and court was one price.  When I got payoff from Tuscaloosa Title the payoff was $6,000.00 plus extra.  They said Mark Nelson had charged fees, any fees should already been added to my account thru the court and been in payoff amount.  Would not recommend him to anyone .  Alabama Credit Union president said he was their attorney, but they did not pay him, go figure.  WTX", "pics": null, "resp": null, "gmap_id": "0x888602eded4983fb:0xc937397b7d990c9d"}
{"user_id": "111851799291498857476", "name": "kitty trouble70", "time": 1544982074772, "rating": 1.0, "text": "I came into the office trying too get a copy of a Signed signature document after my Mothers death.  I Didn't know what I was signing, nor my other 3 siblings. Now the document is missing from the law firm and not of fill at the courthouse??!!!  So what was it that we signed??!!", "pics": null, "resp": null, "gmap_id": "0x888602eded4983fb:0xc937397b7d990c9d"}
{"user_id": "107732020678631071650", "name": "Andrew Kuhl", "time": 1549127324995, "rating": 5.0, "text": "Excellent firm", "pics": null, "resp": null, "gmap_id": "0x888602eded4983fb:0xc937397b7d990c9d"}
{"user_id": "104285226358145687786", "name": "John Posey", "time": 1615251705489, "rating": 5.0, "text": "Words can not express how much of a pleasure it was working with Adrian at a time when my world was upside down. Believe it or not I found Adrian's contact info through a random iOS app while looking for a bankruptcy attorney. I had almost given up going through with the bankruptcy due to a few \"misleading\" consultations with other so called bankruptcy attorneys, but then came along Adrian. Not only was he extremely fair pertaining to pricing, he was also super easy and cool to work with. He is honestly the type guy I would enjoy having a beer with if I hadn't ever met him under the previously mentioned circumstances. Adrian took a process that seemed so monstrous and intimidating from my perspective, and made it dare I say enjoyable. If you are doing your research on a fantastic attorney to hire, and you have discovered Adrian, do yourself a favor and save a ton of headache.... Hire Adrian!", "pics": null, "resp": null, "gmap_id": "0x8889196493badf9d:0xaeabe1093d54bab3"}
{"user_id": "103130654375807055161", "name": "Christina Sullivan", "time": 1558294056582, "rating": 5.0, "text": "Adrian has gone over and above what most attorneys would for me.  I even asked him at one point if we owed him more money because our case seemed complicated, but he said we did not.  He's very honest, very professional, and very, very reasonably priced.  I would recommend him without any reservations and I will definitely use him again!", "pics": null, "resp": null, "gmap_id": "0x8889196493badf9d:0xaeabe1093d54bab3"}
{"user_id": "101277239956964372057", "name": "James Ward", "time": 1437156220150, "rating": 5.0, "text": "In the first consultation he helped me more than the last 5 correspondences I had with my previous lawyer. Not only did he give me effective, problem-solving advice that was swift and honest, but he's a very good listener. Took time to hear my whole story instead of dismissing me after the first two sentences like a couple of other lawyers I had contacted. I recommend him in the highest way and wouldn't hesitate to use him again if need be.", "pics": null, "resp": null, "gmap_id": "0x8889196493badf9d:0xaeabe1093d54bab3"}
{"user_id": "104664278462740409012", "name": "Michael Marcrum", "time": 1547749892676, "rating": 5.0, "text": "Very nice pleasant person, down to earth. Did a very reasonable job. He was very helpful. Recommend to him anyone needing legal help.", "pics": null, "resp": {"time": 1547760699412, "text": "Thanks, Mr. Marcrum! It was a pleasure working with you."}, "gmap_id": "0x8889196493badf9d:0xaeabe1093d54bab3"}
{"user_id": "113900427265598497289", "name": "David Miller", "time": 1440096576133, "rating": 5.0, "text": "I had the pleasure of working with Mr. Dunning for over a year. He is a highly skilled and effective attorney who genuinely cares about his clients. He will take the time to really listen to your legal issues and provide helpful advice specifically tailored to your situation. Mr. Dunning is a great choice for anyone needing legal representation in the Birmingham area.", "pics": null, "resp": null, "gmap_id": "0x8889196493badf9d:0xaeabe1093d54bab3"}
{"user_id": "116972567452352089050", "name": "Cody Burns", "time": 1423607918242, "rating": 5.0, "text": "My wife and I used Mr. Dunning to create a will before we went on vacation.  This was our first time doing anything like this, and he walked us through the process in a way that was clear and straight forward.  He also did an excellent job of working within our short time frame.  I would definitely recommend him to any family looking to do the same.", "pics": null, "resp": null, "gmap_id": "0x8889196493badf9d:0xaeabe1093d54bab3"}
{"user_id": "114947435707270997455", "name": "Broken Heart", "time": 1538748410774, "rating": 5.0, "text": "Good person to deal with. Handled a bankruptcy case and was thorough with everything. Nice guy!", "pics": null, "resp": {"time": 1538749109287, "text": "Thanks, Broken Heart! Let me know if I can ever help you again!"}, "gmap_id": "0x8889196493badf9d:0xaeabe1093d54bab3"}
{"user_id": "100239152401489143887", "name": "Ashley Kerr", "time": 1448320273794, "rating": 5.0, "text": "My husband and I used Adrian to update our wills and to establish a trust for our children. Adrian was easy to work with and handled all of our needs quickly and professionally. I would be happy to recommend him to others who are in need of estate planning.", "pics": null, "resp": null, "gmap_id": "0x8889196493badf9d:0xaeabe1093d54bab3"}
{"user_id": "115903181863105004903", "name": "Jorene Thomas", "time": 1618006546765, "rating": 5.0, "text": "Scott Slate is an excellent lawyer!\nHe did a fine job in representing me.\nI highly recommend him", "pics": null, "resp": null, "gmap_id": "0x8862842ac238a6f9:0xb40aa0289d5227ed"}
{"user_id": "114143619264626630294", "name": "Jeremy Goforth", "time": 1602573696381, "rating": 5.0, "text": "Great law firm! Great group of people!", "pics": null, "resp": null, "gmap_id": "0x8862842ac238a6f9:0xb40aa0289d5227ed"}
{"user_id": "104130540446579620842", "name": "Dani Corum", "time": 1568668568972, "rating": 5.0, "text": "Great attorneys!", "pics": null, "resp": null, "gmap_id": "0x8862842ac238a6f9:0xb40aa0289d5227ed"}
{"user_id": "103793297331856878981", "name": "Courtney Shevchenko", "time": 1543800362469, "rating": 5.0, "text": "They are awesome. They were able to help us with our immigration case and made things so much easier!", "pics": null, "resp": null, "gmap_id": "0x888602e69d16111b:0x50ecefae9b0423f9"}
{"user_id": "101135209554618744620", "name": "Kenneth Thompson", "time": 1624196868726, "rating": 5.0, "text": "Not to many caring lawyers left in this world truthfully most attorney's are  crooks and I can name one for certain but I will say Strickland firm does care unlike most others.!", "pics": null, "resp": null, "gmap_id": "0x888e81db35856f27:0x402a93073d620a6c"}
{"user_id": "104093581238784133246", "name": "Willie G.", "time": 1567893179202, "rating": 5.0, "text": "Nice attorney", "pics": null, "resp": null, "gmap_id": "0x888e81db35856f27:0x402a93073d620a6c"}
{"user_id": "101980969016605177617", "name": "Marshall Mooney", "time": 1555037984769, "rating": 5.0, "text": "This is one of the best law firms I have ever visited. I mean,  I don't visit a lot of law firms, but if you were to make a list of the five best law firms fortunate enough to have me visit,  this one would make the list.... along with all the other law firms I have ever visited.", "pics": null, "resp": null, "gmap_id": "0x8889197e3a81f4f5:0xb1bffea3f10d1c2f"}
{"user_id": "111544816680097688918", "name": "Jamie Jenkins", "time": 1570413276592, "rating": 5.0, "text": "Great people. Cares about you.", "pics": null, "resp": null, "gmap_id": "0x8889197e3a81f4f5:0xb1bffea3f10d1c2f"}
{"user_id": "117527868452849520992", "name": "Harold Ciancio", "time": 1580037823201, "rating": 5.0, "text": "Great work.", "pics": null, "resp": null, "gmap_id": "0x8889197e3a81f4f5:0xb1bffea3f10d1c2f"}
{"user_id": "103553431879871169518", "name": "Don Johnson", "time": 1534449436671, "rating": 5.0, "text": "Mickey Wright has helped me so much. Thanks", "pics": null, "resp": null, "gmap_id": "0x8889197e3a81f4f5:0xb1bffea3f10d1c2f"}
{"user_id": "104716213345752082764", "name": "Betty Longs", "time": 1590207801395, "rating": 1.0, "text": "DALTON LIVINGSTON WILL NOT HELP YOU. Do not go to this law firm. The worst experience I’ve ever had. Not to mention that he’s incredibly racist, so sad to see that people like this still exist. Wish I could give him zero stars.", "pics": null, "resp": null, "gmap_id": "0x88897d183d6e72d3:0xf4679efbfe2d5d61"}
{"user_id": "111283800605277826677", "name": "April Wiggins", "time": 1466531515174, "rating": 5.0, "text": "Mr. Kelly is a very intelligent and honest man. He always looks for the best interest of his client. He's a very honest person, and will not steer you in the wrong direction! He's not like most lawyers. If he thinks that there is nothing that he can do, he will tell you exactly that, tell you the reason why, and explain  his reasoning for his decision. I HIGHLY RECOMMEND Mr. Dalton Kelly Livingston!", "pics": null, "resp": null, "gmap_id": "0x88897d183d6e72d3:0xf4679efbfe2d5d61"}
{"user_id": "106600379605748554507", "name": "daesia williams", "time": 1590208759896, "rating": 1.0, "text": "Eh very racist", "pics": null, "resp": null, "gmap_id": "0x88897d183d6e72d3:0xf4679efbfe2d5d61"}
{"user_id": "111022963953379205790", "name": "Sarah Stanley", "time": 1605191235199, "rating": 5.0, "text": "I absolutely love this group of people. Frank, Debra, Kelly, Teri, Chuck, Caroline are all absolutely amazing and so polite. I have had the pleasure of knowing them for four years now. They have treated my family well and have helped us with any issue we have had. I highly recommend Potts & Young Attorneys to help you with any issues you may have going on because once you hire them, they work nonstop to make everything happen for you. I love you guys!", "pics": null, "resp": {"time": 1605531326468, "text": "Thank you so much, Sarah! We appreciate you!"}, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "115349759852498758856", "name": "Alvin Smith", "time": 1605401237412, "rating": 5.0, "text": "Love the atmosphere of this law firm. They're honest in their evaluations and very fair in their dealings. Will always use them and will recommend them to family and friends!", "pics": null, "resp": {"time": 1605531379707, "text": "Thank you so much, Alvin! We sincerely appreciate the positive feedback and recommendations."}, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "114848250239044090115", "name": "Henry L. Weekly Sr.", "time": 1605269296380, "rating": 5.0, "text": "I find Frank, Debra, and the Staff at Potts & Young guilty of knowing the laws and guilty of working tirelessly on my case so I may receive the maximum monetarial value for my case. I have recommended them several times with the same results. I Appreciate You!", "pics": null, "resp": {"time": 1605531359865, "text": "Henry, thank you for your kind review, it means so much to us. It was a pleasure working with you!"}, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "101939179678921397071", "name": "Kay Hyde", "time": 1604531608380, "rating": 5.0, "text": "They helped us were no one else would ! Thank y'all so very much for being so patient with me. Love how professional both of you are.  Thank you so very much for everything!", "pics": null, "resp": {"time": 1605531286607, "text": "Thank you so much for your 5-star review, Kay. It was a pleasure working with you and we appreciate the positive feedback!"}, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "112870636843967502955", "name": "Tiffany Burton", "time": 1604880400739, "rating": 5.0, "text": "We hired Debra Coble as my fathers Probate Attorney to help fight for his mother’s estates and assets. Mrs Coble is very knowledgeable, experienced, and trustworthy. She believes in her clients and fights an excellent case. She believes in fighting for what’s entitled to her clients. She fights for her clients inside and outside of the court room. If you’re looking for a Probate Attorney hands down please contact Mrs Debra Coble as your Attorney. You won’t be disappointed. Now, my father can rest knowing his got everything that was entitled to him. Thank you so much Potts & Young Attorney and especially Mrs Debra Coble. We appreciate you.", "pics": null, "resp": {"time": 1605531313682, "text": "Tiffany, thank you so much for your wonderful review! We sincerely appreciate it and are here if you ever need us again."}, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "115888436554810718305", "name": "Sandra Bonds", "time": 1597874792235, "rating": 5.0, "text": "Best attorneys in Alabama love Frankie and all the employees.", "pics": null, "resp": {"time": 1604439413022, "text": "Thank you for your kind review, we really appreciate it!"}, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "111215123117231970417", "name": "Jodie Moore", "time": 1571433046340, "rating": 4.0, "text": "The food is great. The atmosphere is very comforting and calm.", "pics": null, "resp": null, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "115274532594905630609", "name": "JESS'C STIDHAM", "time": 1527116574779, "rating": 5.0, "text": "If you are in need of legal advice I highly recommend Potts & Young! They are honest, trustworthy & dedicated professionals who will have your best interest at heart. There is no one else I'd trust more with my legal matters.", "pics": null, "resp": null, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "104794685970651053242", "name": "Jackie Gross", "time": 1558459011409, "rating": 5.0, "text": "Dedicated attorney and staff that strive to do the very best for their clients.", "pics": null, "resp": null, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "103945949080058047237", "name": "Xxlxvelydxeams 123xX", "time": 1578353268078, "rating": 5.0, "text": "Response was quick and answered all my questions", "pics": null, "resp": null, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "101632500763469029367", "name": "ReleaseTheMem12", "time": 1525720357756, "rating": 5.0, "text": "Frank B Potts is a highly skilled Attorney dedicated to serve his clients with the best advise and resolutions to their legal issues and cases.", "pics": null, "resp": null, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "103858476451238361368", "name": "jessica potts", "time": 1572313058863, "rating": 5.0, "text": "Best law firm ever :-)", "pics": null, "resp": null, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "113843034038989654182", "name": "Alan Haygood", "time": 1561423916507, "rating": 5.0, "text": "I highly recommend Potts & young", "pics": null, "resp": null, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "112285918982438761481", "name": "Michele Boyko", "time": 1615964023052, "rating": 5.0, "text": "So far they been a useful, and honest. Wish i didn't have to go though it thou.  It's been hard.", "pics": null, "resp": null, "gmap_id": "0x88882af3b23816ef:0xf68360d035001297"}
{"user_id": "108303506488588474230", "name": "Jordan Luter", "time": 1622261958229, "rating": 1.0, "text": "Sparkman seems ready to retire and aloof.  My father in law’s assets were allowed to dispersed other than  his wishes due to a poorly advised will.  Do not use this firm.", "pics": null, "resp": null, "gmap_id": "0x88882af3b23816ef:0xf68360d035001297"}
{"user_id": "102315486311380982230", "name": "Stacey Garrett", "time": 1596337649842, "rating": 5.0, "text": "Mr. Sparkman is a wonderfully awesome attorney. I would highly recommend him to anyone!!", "pics": null, "resp": null, "gmap_id": "0x88882af3b23816ef:0xf68360d035001297"}
{"user_id": "115923169479687556134", "name": "Cynthia Mote", "time": 1594305658584, "rating": 5.0, "text": "Very informative!", "pics": null, "resp": null, "gmap_id": "0x88882af3b23816ef:0xf68360d035001297"}
{"user_id": "102965939881991180847", "name": "Terrial White", "time": 1603149074925, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x88882af3b23816ef:0xf68360d035001297"}
{"user_id": "106035839801775323501", "name": "Flossie.laymon52 Laymon", "time": 1521341209042, "rating": 1.0, "text": "Widow took advantage of by Michael Sparkman", "pics": null, "resp": null, "gmap_id": "0x88882af3b23816ef:0xf68360d035001297"}
{"user_id": "107621768652738156029", "name": "Melissa Davis", "time": 1606189798050, "rating": 5.0, "text": "I highly recommend Johnny Amari and his team.  I immediately felt comfortable when we met, he is very kind and  personable. He was available for me, even after hours, when I had questions and to provide emotional support.  He went above and beyond in every aspect of my case.  He listened to my ideas and valued my input, and I felt very cared for both legally and emotionally.   There is not a doubt in my mind that if I had been with another attorney,  I would be headed to federal prison.  He explored every angle to reduce my sentence guideline and had very good input on ways to get the judge to see me as more than my crime.   If you want an attorney that is attentive, available, capable and persistent, you will find all that in Johnny Amari.  I literally owe him my freedom.", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "109505656008718186731", "name": "Debbie Desmond", "time": 1613380529983, "rating": 5.0, "text": "Johnny Amari helped me with a situation I needed immediate assistance with. He exceeded my expectations and went above and beyond what I asked of him. I would absolutely use him, with any legal matter, if needed in the future.", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "106363041393517850274", "name": "Amanda Poole", "time": 1593395864066, "rating": 5.0, "text": "Mr. Amari is a great attorney very professional. He has a great sense of humor and did a fantastic job. I just wanted to tell him thank you so much for helping me. I would recommend Mr. Amari. You will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "105838850565770801950", "name": "Dern Happy", "time": 1617817081338, "rating": 5.0, "text": "John Amari took my major problem and came back with a minor inconvenience. Far exceeded all expectations. THANKS!", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "111964410383320250578", "name": "Tri Jackson", "time": 1596151012455, "rating": 1.0, "text": "After two years of out and out lies by the associate O. PARRISH on a living will, final will,  filling out\nsimple paperwork ( documents ) for Medicare that Medicare said for an ATTORNEY ( that's a joke) and was told that AMARI and Gray were representing me in the big pharma case. For TWO YEARS I WAS TOLD ALL WAS GOING GREAT AND AFTER JANUARY 1ST 2020 ALL WOULD BE FINISHING UP. Since January I have left countless messages, sent registered letters and the only thing I have gotten is the most unprofessional response you could imagine. They took my money made promises and did absolutely nothing. I'm a 100%disabled person and a UNITED STATES COAST GUARD VETERAN and have never been lied to and deceived so much in my hole life .", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "113378740369274843565", "name": "Bonnie Hubbard", "time": 1579621112175, "rating": 5.0, "text": "Wonderful, attentive, professional, and kind attorneys. They genuinely take time to review your case and explain the legal process. The offices are clean, beautiful, and modern. The retainer and rates were more than fair given the impressive quality of work. I would recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "103331778602541434206", "name": "Katelyn Lear", "time": 1605986283828, "rating": 5.0, "text": "Hands down best legal team i have ever had a pleasure of working with!", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "104332911055918182539", "name": "Henry Glover", "time": 1587494862149, "rating": 5.0, "text": "Been a fan of the Johnnys for many years.  Love knowing that my family and business legal is in their hands.", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "105230787488845149539", "name": "Matthew Burford", "time": 1524760283901, "rating": 5.0, "text": "Great 1st class legal team.", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "113004015874411924619", "name": "Christopher Lee", "time": 1564188426470, "rating": 5.0, "text": "Great and caring team", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "108474885173044015987", "name": "Justin Poiroux", "time": 1581008089671, "rating": 5.0, "text": "I'd rate 10 stars if I could. Michael is the best.", "pics": null, "resp": null, "gmap_id": "0x88891bbd7a066229:0x5a2337db144464cf"}
{"user_id": "102932560093225843725", "name": "Christopher Calvin Reid", "time": 1472484036586, "rating": 5.0, "text": "Excellent Law Firm, they do great work and don't overcharge their clients", "pics": null, "resp": null, "gmap_id": "0x88891bbd7a066229:0x5a2337db144464cf"}
