{"user_id": "105872783482157105903", "name": "Britney Wilson", "time": 1559870825121, "rating": 5.0, "text": "DMEI are amazing! Super knowledgeable and responsive. They are always willing to jump on a call with me to discuss my needs and help guide me through the best options for my business. They have a wide variety of resources that practically make them a one-stop-shop for digital marketing.", "pics": null, "resp": {"time": 1559918416945, "text": "Thank you so much Britney for your 5 star review!  We enjoy working with you and helping your business grow."}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "118141396624761693569", "name": "Proper townsend4", "time": 1560009035045, "rating": 5.0, "text": "I have seen sales more than triple in the insurance business and was truly impressed by DMEI’s work making this happen. The staff is professional, friendly, and there to help! I love this group and would recommend them for your business!", "pics": null, "resp": {"time": 1560009493815, "text": "Thank you!  We were happy to help your business get more phone calls and quality leads!"}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "107122164463029379537", "name": "Ashley Bagwell", "time": 1559861932277, "rating": 5.0, "text": "Love the group at Digital Marketing! Donnia has been wonderful!  She stops in or calls to check on us and always answers any questions I have as well as getting updates done to my webpage very promptly! Excellent customer service!!", "pics": null, "resp": {"time": 1559918512671, "text": "Ashley, we appreciate you choosing us as your marketing partners.  It has been a pleasure watching your business grow and working with such a great group of folks!"}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "112750960389083063147", "name": "Sharonica Daniels", "time": 1559759969590, "rating": 5.0, "text": "The professionals at DMEI brought my business out of a hole from another marketing agencies mishaps.  I am now swamped with business and having to find another building to work out of!  They offer great marketing services and offer a ton of FREE advice.  I was astounded at the results and tell everyone I know they need to choose them for any marketing!", "pics": null, "resp": {"time": 1559852237443, "text": "Thank you Sharonica! We were so happy to help you out.  If there is anything else we can help with just let us know!"}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "100785129227067095561", "name": "Maranda Harley", "time": 1560054581022, "rating": 5.0, "text": "One of the best marketing places around! They are sweet and always trying to do what is best for you! Thank y’all for all y’all do! 🙂", "pics": null, "resp": {"time": 1560081827920, "text": "Thank you Maranda! We are always happy to help!"}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "103431413243451431259", "name": "Harold Harvey", "time": 1550589106017, "rating": 5.0, "text": "I recently started a new ecommerce business and was struggling to market my it online.  After touching base with Donnia about marketing I signed up and now in my third month of advertising on the Google Shopping Network I have seen an influx of revenue.  Not only am I staying afloat but I am actually bringing home a paycheck!  I highly recommend the Digital Marketing Experts International team for any new ecommerce business! You will not be disappointed!", "pics": null, "resp": {"time": 1551102615066, "text": "Thank you! We appreciate your business. We love working with you."}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "111651968882769941385", "name": "Christian Harvey", "time": 1560003262720, "rating": 5.0, "text": "Great company with great people. Answered every question and met my every need.", "pics": null, "resp": {"time": 1560004055082, "text": "Thank you Christian!"}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "110879006570109544378", "name": "Blake Huey", "time": 1560014051403, "rating": 5.0, "text": "Love the marketing and the free advertising options .. not to mention the service is phenomenal", "pics": null, "resp": {"time": 1560016201994, "text": "Thank you Blake! We appreciate your awesome review!"}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "108499737291937337171", "name": "Kelly Ratcliff", "time": 1560002871352, "rating": 5.0, "text": "Great local marketing company that helped me get my website launched and after just a few months my calls went from 10 to 50 a month.  Now, I have more business and I have this company performing my social media management as well as Local SEO.  You cant ask for a better team of digital marketing professionals!", "pics": null, "resp": {"time": 1550589144292, "text": "Thank you Kelly for your kind words.  We appreciate your business!"}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "115382850304673092055", "name": "Tukker Watson", "time": 1506620090971, "rating": 5.0, "text": "I now have more business then I can handle because of my website !! Thank y'all .", "pics": null, "resp": {"time": 1506699197967, "text": "Thanks Tukker we enjoy working with you."}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "108473816858528271196", "name": "Chris Davis", "time": 1506617652347, "rating": 5.0, "text": "You want to grow you need to call these people !!!! I own several business and they def know what they are doing !", "pics": null, "resp": {"time": 1506699228720, "text": "Chris Davis your awesome and we appreciate your business."}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "108636074835586283638", "name": "Kelsey Barnard Clark", "time": 1560014959627, "rating": 5.0, "text": "Amazing local marketing agency, very professional.", "pics": null, "resp": {"time": 1560016249147, "text": "Thank you Kelsey! We love helping local businesses succeed!"}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "100877512771602896766", "name": "D Davis", "time": 1506989630256, "rating": 5.0, "text": "Great company to do business with very affordable!  $$$$$$ is key and they saved me a ton and made me a ton !", "pics": null, "resp": {"time": 1507655471458, "text": "Thanks Darcy we appreciate your business."}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "111356816794920467544", "name": "L.A. Jones", "time": 1566347150309, "rating": 1.0, "text": "Does not deliver what they promise and does not pay their employees.", "pics": null, "resp": {"time": 1566505248357, "text": "We are very sorry to hear that you feel this way. But you as well as we know the words are not true."}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "101390542394807765938", "name": "lecia turvin", "time": 1562091588561, "rating": 5.0, "text": "Awesome people", "pics": null, "resp": {"time": 1562592235183, "text": "Thank you Lecia!"}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "108365763151767114311", "name": "Katie Calhoun", "time": 1565191266737, "rating": 5.0, "text": "I loved working with Edge Web Consulting.  Erin is very knowledge on many topics that were helpful to me for use in promoting my jewelry business. She is always willing to take the extra steps to be of assistance in any way possible for the success of your company.   I highly recommend their services.", "pics": null, "resp": {"time": 1565201299978, "text": "Thank you so much, Katie!  I enjoyed learning more about your business and look forward to seeing it grow!"}, "gmap_id": "0x888921dc61e48f2f:0xf5e7acbffe8b4c85"}
{"user_id": "108496818278999082603", "name": "Mac Mac", "time": 1540070837786, "rating": 5.0, "text": "(Translated by Google) Very well\n\n(Original)\nMuy bien", "pics": null, "resp": null, "gmap_id": "0x888921dc61e48f2f:0xf5e7acbffe8b4c85"}
{"user_id": "115420156037973058693", "name": "Stacie Gilham", "time": 1610558642104, "rating": 1.0, "text": "After setting up my laptop, I was unable to change any settings requiring an administrator password due to Yeltek having themselves as the administrator.i emailed them an no response. I called and had a return called stating I could use my laptop without the administrator password. That is true, under the guest account they set up for me. I want full control over the laptop I purchased, not for Yeltek to have any account on it. I have since sent another email requesting the administrator password and left two more messages due to no one ever there answering the phone. Still no response. Bad service. I wouldn't recommend this company to anyone.", "pics": null, "resp": {"time": 1619652684700, "text": "The laptop was invoiced to Kennedy Galvanizing. YELTEK has reached several times to their office (Allen) and called Dollie/Stacie at home. We have spoken to Dollie (Stacie grandmother) and asked for her to contact us. We have attempted to guide Dollie over the phone what she needs to do. We have recommended dropping the device by the office to make this small change. We have not received follow up from Dollie or Stacie."}, "gmap_id": "0x8889cb81ae4d67bd:0x2dc92694148a3b64"}
{"user_id": "114829167387459644792", "name": "Matt 34 Ronald Holloway", "time": 1544845215774, "rating": 1.0, "text": "Haven't been", "pics": null, "resp": null, "gmap_id": "0x8889cb81ae4d67bd:0x2dc92694148a3b64"}
{"user_id": "106805795004778065305", "name": "Bess Wood", "time": 1580906676133, "rating": 3.0, "text": "Expensive", "pics": null, "resp": null, "gmap_id": "0x8889cb81ae4d67bd:0x2dc92694148a3b64"}
{"user_id": "107784652352833268963", "name": "Mary Sinche", "time": 1604674417989, "rating": 1.0, "text": "DO NOT DO BUSINESS WITH THEM. They contacted me to do business with them. I agreed at first. I then called and left a voice message to have them call me. They had sent me an e-mail with a contract that I never signed. I sent a response to the e-mail asking them to cancel. They never refunded my money. They never got my approval for the ad. I got in touch with them today after they tried to take money out of my account again. I was told that they do not give refunds that all sales are final. Even though I never signed the contract, tried to cancel before and never approved the ad. All they are interested in is taking your money and not dealing with you if you change your mind. The so called owner told me I never called and left a voice message and that I tried to cancel after they already had gone to print. All lies.", "pics": null, "resp": null, "gmap_id": "0x888922c045b2e139:0x79ff50769a631b67"}
{"user_id": "107093465766535317150", "name": "Ken G", "time": 1397905371507, "rating": 5.0, "text": "Deep South Consulting is the premier company that finds out your marketing goals and puts together a massive action plan to accomplish them.\n\nThey take time to explain the process to your comfort and then get the best results ever!\n\nI have paid and used other companies and they don't come close to Deep South Consulting.\n\nI approve them and you will not be disappointed!", "pics": null, "resp": null, "gmap_id": "0x8863827b8e1e0dbf:0xcbd6d08cd5a6159"}
{"user_id": "112747339032680856886", "name": "Nick Abregu", "time": 1383968225260, "rating": 5.0, "text": "Sloan at Deep South Consulting is a fantastic guy who knows quite a lot on how to make a business profitable. I've had a few strategy sessions from Sloan and I've increased my profits in my E-commerce by 150%. It's amazing how small changes make a big impact on the end result.\n\nI've had several strategy sessions with high end consultants and can honestly tell you Sloan is up there with the best.\n\nNick\nEntrepreneur.", "pics": null, "resp": null, "gmap_id": "0x8863827b8e1e0dbf:0xcbd6d08cd5a6159"}
{"user_id": "109219647475096791157", "name": "Troy P", "time": 1384018857910, "rating": 5.0, "text": "I've had the pleasure of talking business with Sloan on several occasions and know that his marketing insights are thoughtful and will help to enhance your company's image. It's also nice that he mixes in a bit of his humor as well, but don't miss the point that Deep South Consulting will take your company's best interest seriously by improving its exposure and reputation, which are all marketing principles that are beneficial to you, your company and your brand.", "pics": null, "resp": null, "gmap_id": "0x8863827b8e1e0dbf:0xcbd6d08cd5a6159"}
{"user_id": "107258285658810925347", "name": "Dejafali Marketing", "time": 1397863948842, "rating": 5.0, "text": "I have been using Deep South Consulting for a over 5 months now and I am very Impressed with how detail the work is done when you ask for simple to difficult task!. Sloan and his team sets their goals to the highest standard, when it comes to the customer projects. Its hard to find help like this! These guys know their stuff!", "pics": null, "resp": null, "gmap_id": "0x8863827b8e1e0dbf:0xcbd6d08cd5a6159"}
{"user_id": "102632724708021964367", "name": "Keith Miller", "time": 1622335365935, "rating": 5.0, "text": "Pam Sanderson of Infomedia is a blessing and gift to our organization. She is top notch and knows her work. She has helped our company focus clearly on how a website should serve our company. So, thankful for her insight and direction. Infomedia is a company who is here not only to serve others but also to give healthy approaches to advance your company. Best decision we have made.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "109053753805275872335", "name": "Katie Hausman", "time": 1614187329144, "rating": 5.0, "text": "We love working with Infomedia! On a day to day basis their support team is super responsive if we ever need their assistance on an issue. They are helpful in not only fixing the problem, but helping to prevent it, or teaching me how to fix it in the future.\nInfomedia also has a great team helping to use our website to the best of our abilities and maximize the ROI we are getting off the site. We are still learning and having Infomedia on our team has been a great asset!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "111775325071366907392", "name": "Mary Wyatt", "time": 1615472021839, "rating": 5.0, "text": "We love working with Infomedia! Incredible customer service and lightning fast response times! I can tell each staff member I encounter takes pride in their work and wants their clients to have a successful and high performing online presence!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "103926924892251742531", "name": "Mary Amelia Taylor", "time": 1621884280293, "rating": 5.0, "text": "I've had a long association with Infomedia on a number of projects, and throughout the past decade, I have enjoyed working with Infomedia staff and leaders, who are all professional, communicative, and deeply considerate. Thanks for many jobs well done!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "100944505269544011097", "name": "Stephanie Smith", "time": 1602504363487, "rating": 5.0, "text": "My office and I have used infomedia for over 2 years and we are extremely happy with their services and attention to detail. They are always prompt and efficient with their response. I would highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "102513970312683401498", "name": "Shawn Capital", "time": 1587665289533, "rating": 5.0, "text": "Infomedia has been a huge asset to our company.  They have ideas and suggestions that will help produce the end results you seek.  If I have any problems, they are quick to respond and communicate proficiently.  Personally, they are great people, so it is relaxing and not stressful to work through things with them.  Keep up the good work Infomedia!!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "104114741587543476648", "name": "R Jones", "time": 1580778781317, "rating": 5.0, "text": "We are delighted with our new website.  Infomedia was instructive, organized, and responsive throughout the development and design experience. My thanks for mounting a yeoman’s effort to launch our site in time for a special event. It means a lot when the CEO just steps in, gives up his weekend, and works with his team to meet the needs of a customer.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "103889217197954795399", "name": "Baldwin EMC", "time": 1582831449626, "rating": 5.0, "text": "We have worked with Infomedia for several years and our experience has consistently been a positive one. From website design and development to training and trouble-shooting, their customer service is second to none. The team is always courteous, creative and extremely efficient.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "114659301925337007545", "name": "Peyton Shepard", "time": 1560795842770, "rating": 5.0, "text": "The company I work for has used Infomedia for web services for about five years. All of their experts are incredibly knowledgeable and easy to work with. We've sent several difficult projects their way and they have executed to the highest standard every time. Their continued support services are top-notch, as well.", "pics": null, "resp": {"time": 1560863311103, "text": "Thanks so much, Peyton! We've enjoyed working with you too."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "112755480660016087123", "name": "Ann Mollengarden", "time": 1561393759628, "rating": 5.0, "text": "Amazing group to work with.  They helped to design and now help in maintaining our website.  Always responsive in a timely manner when problems arise.  They assist us in understanding our analytics. They continually work with us on improving the functionality of our site.", "pics": null, "resp": {"time": 1561395487052, "text": "Thanks so much, Ann! We look forward to a continued partnership with you."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "105821272908139228741", "name": "Tonya Bailey", "time": 1586458411125, "rating": 5.0, "text": "Infomedia offers excellent customer service with very a prompt and attentive staff, I feel very confident navigating our website with the support of their unlimited training sessions and online support team", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "107115700107845995473", "name": "Anthony Cooper", "time": 1581390071562, "rating": 5.0, "text": "Infomedia and Uptick are the best! They always over deliver on all their products and services. I’ve use them for websites, logo, advertising and more. Jason, Jerry, Lance, Dawn, Michael, Josh, Pam, and ALL of their team is incredible!!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "109773260787536610049", "name": "Dan Moran", "time": 1560479078980, "rating": 5.0, "text": "I have loved working with Infomedia since coming to from a previous group. Their professionalism and creativity is outstanding. The are the one stop Internet marketing company I was looking for. Great people!", "pics": null, "resp": {"time": 1560515393380, "text": "Thank you, Dan! We're glad you've found our team helpful."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "117971906430485324456", "name": "David Weaver", "time": 1561418628673, "rating": 5.0, "text": "I'm so glad I found Infomedia!!  We relocated our business and Infomedia built us a new website, Logo, and search engine optimization. We have seen an increase of business. It was well worth the money. Pam helped us every step of the way.  Thank you Infomedia!!!", "pics": null, "resp": {"time": 1561399615265, "text": "We're so happy to have you as a client, David! And glad to hear about your business's success."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "115178572217078164922", "name": "Christy Danzy", "time": 1560439888443, "rating": 5.0, "text": "Pam Sanderson at Infomedia has helped me with several projects that have made my job at Coca-Cola UNITED so much easier. Pam is very responsive and has shown me premier customer service. One major project Pam has helped me with is to make our Scholarship Application an online submission process after years of paper. The new process has been seamless and so easy to manage. She has been fantastic to work with for the past 2 and half years ! I would recommend Infomedia to any company having large or small digital needs; they are AMAZING!", "pics": null, "resp": {"time": 1560458473296, "text": "We're so happy to have you as a long-term client, Christy! We look forward to many more years of working together."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "107998485097485874523", "name": "Carrie Crane", "time": 1560791824082, "rating": 5.0, "text": "7 year relationship and significant experience with the Support Services Team- flawless, prompt, investigative and thorough to make certain they do it right the first time. Expansive expertise and holistic approach to include programming, design, marketing, strategy, consultation; most importantly, the magnitude of value on relationship. They're all about people and progress.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO1SyFVniM7SR9hRrLkQby809zR3U6UrFAIkoXY=w150-h150-k-no-p"]}], "resp": {"time": 1560795899006, "text": "We're so happy to have been working with you long term, Carrie, and look forward to many more years. Thanks for your business!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "111110780686997025174", "name": "Nikki Frost", "time": 1554751346154, "rating": 5.0, "text": "The Alabama Natural Gas Association has been a client of Infomedia for many years and we are more than happy with the service provided.  Infomedia brought our website back to life with a new look and made it easier for our members to maneuver through it.  Clay and his team are the best!", "pics": null, "resp": {"time": 1554903985006, "text": "Thank you, Nikki! We have enjoyed working with the ANGA team and are so glad that you're pleased with the new website."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "110022640538386682025", "name": "Brooke Beckham", "time": 1587604974436, "rating": 5.0, "text": "InfoMedia is an extremely talented group and really helped BlackWatch Sports establish its name as a new company in the community.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "111325720145791205776", "name": "Meg Burton", "time": 1555621013517, "rating": 5.0, "text": "Our team had a great experience working with Infomedia on a project to update our corporate website. The team offered engaging and fresh design options, expert guidance, and responsive customer service. We also benefit from ongoing support services that make our lives easier and our site more secure. We're glad to partner with Infomedia.", "pics": null, "resp": {"time": 1555936816386, "text": "Thank you, Meg! We look forward to many more years of working together."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "108080355811110190373", "name": "Elaine Cosmas", "time": 1566319354141, "rating": 5.0, "text": "Infomedia delivers excellent customer service, speedy turnaround time and total professionalism at every contact point.  I recently worked with Pam on a project; her knowledge and expertise totally simplified what I thought would be overwhelming!  Thank you!", "pics": null, "resp": {"time": 1566827143313, "text": "We're so glad you found Infomedia to be a helpful resource. Thank you for choosing us, Elaine!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "113072686107287858386", "name": "Maggie Collins", "time": 1574689379038, "rating": 5.0, "text": "Infomedia is an amazing company to work with and their support is top notch! They are a one stop shop for all of your marketing and website needs.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "107668424077308410698", "name": "Bob Goldman", "time": 1564496755883, "rating": 5.0, "text": "Many people have complained to me about hiring web designers who don't listen, don't communicate and don't deliver. My experience with Infomedia is exactly the opposite. They listened to what I wanted, not only responding to my ideas, but making them better. Their customer service is superb. They always did what they said they would do and they did it on time. Finally, they delivered a website that generates compliments and clients. What else can I say, except they're very nice people to work with and to know. .", "pics": null, "resp": {"time": 1564506404699, "text": "Thank you, Bob, for your many years of using Infomedia for your web services. We love working with you too and are glad that we've been able to help."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "111168231813410174142", "name": "Lisa Reitmeyer", "time": 1474918542531, "rating": 5.0, "text": "Infomedia recently redesigned our company website. We're thrilled with the fresh new look and ease of navigation. Casey was wonderful. On several occasions he worked into the night to make sure our launch was successful. We couldn't be happier with the end result!", "pics": null, "resp": {"time": 1475011218627, "text": "Thanks, Lisa! We're proud of how your site turned out, and we're so glad the look and navigation are working out so well!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "100100037366654833743", "name": "Brianna Basik", "time": 1461870854097, "rating": 5.0, "text": "My company and I have had an incredible experience with Infomedia! Truly couldn't be better. Communication is quick and someone is always answering our emails within 24 hours. Not only are the people wonderful, but our website functions perfectly and looks beautiful. They have now redone our site and our sister company's site and they are both working perfectly! Thank you thank you Infomedia!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "117070339394203036829", "name": "D Carl Garrison", "time": 1450220222210, "rating": 5.0, "text": "Infomedia has a fantastic development team that can handle web development projects plus they have a fully staffed support team that actually answers the phone 24-7 and NOT in India. I would recommend anyone with a business that is not on web or you don't like your site or you need your web to be mobile friendly give them a call. They work with you to improve your marketing via the web.", "pics": null, "resp": {"time": 1452706972578, "text": "We appreciate your feedback so much! Anyone that has called our support line knows that Michele is one of our best assets so that we can provide for and take care of clients like you. Thank you for your continued support, and we look forward to working with you in 2016!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "117814851554916965522", "name": "Lucy Gifford", "time": 1435087188021, "rating": 5.0, "text": "Our store was in need of a website that reflected who we are and what we do. Infomedia did a wonderful job designing a site that was beautiful, refined, and elegant. We also do a large bridal business and needed an easy to use online registry. Infomedia was able to provide this for us as well. Not only did they do a great job designing the site front and back, but have been so good about fixing any issues that arise or addressing changes we want to make.  I truly believe that they want the best for our business and are happy to help us grow. A special thank-you to Pam, director of client services, for always being so positive, organized, and just overall helpful!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "109011026237398794523", "name": "Shirley Fagan", "time": 1554313327865, "rating": 5.0, "text": "Infomedia has built and is hosting three of my companies' websites.  The process went well and according to plan.  In addition, the help that we receive from the Infomedia support team is very timely and helpful.", "pics": null, "resp": {"time": 1554903876942, "text": "Thank you, Shirley! We've enjoyed working with you too."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "114216348855832987915", "name": "Reid DeShazo", "time": 1556722659749, "rating": 5.0, "text": "Infomedia has surpassed our high expectations over and over again, during the last 8 years.  Easy to work with, yet very professional, Infomedia's website and digital marketing knowledge is unmatched.  We will continue to do business with Infomedia for many years to come.", "pics": null, "resp": {"time": 1557318677374, "text": "Thanks so much, Reid! We look forward to a continued partnership with you."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "106910718895030804650", "name": "Robert Montgomery", "time": 1450560571018, "rating": 5.0, "text": "Serious about transforming your business with a powerful web presence? These experts have over 20 years of experience and better yet, they are entrepreneurs themselves who truly understand business.\n\nThe team at Infomedia are some of the best people you will meet. They know how to build and host complex websites that function easily for your clients and employees to help you increase both the happiness of your customers as well as your profits.\n\nLook no further, these guys are the best!", "pics": null, "resp": {"time": 1452709491864, "text": "Thank you, Robert! Feedback like yours encourages us to always strive for excellence and to keep our business functioning with a client-centered mindset so that our customers continue to be well cared for! Thank you for your kind words!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "111553890988556438400", "name": "Dawn Taylor", "time": 1490115774925, "rating": 5.0, "text": "Infomedia has built and managed several websites that I've been a part of.  Their support team is quick to respond and are a great help on how to make the sites better.  Overall just a nice bunch of talented folks!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "107754392256182067023", "name": "wade stoudenmire", "time": 1450874162294, "rating": 5.0, "text": "Infomedia designs great websites! I enjoyed working with them. Infomedia is a very professional, responsive and creative team that are very dedicated to meeting your online marketing needs. I would recommend Infomedia to anyone who is interested in creating a website", "pics": null, "resp": {"time": 1452784075583, "text": "Your kind words are very much appreciated, Wade! Thank you for trusting our team to serve the needs of your business. We enjoy having you as one of our clients!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "107020307248292316709", "name": "Greg Atchley", "time": 1450217892564, "rating": 5.0, "text": "Super helpful and experienced professionals. This group truly care about your business. They went above and beyond to make sure we got the results we wanted. They also saved us from spending money on features that weren't necessary.", "pics": null, "resp": {"time": 1452705836598, "text": "Thank you, Greg! We are thrilled to hear that we were able to provide you with an affordable yet efficient solution!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "117403046326958427597", "name": "christopher Zapalowski", "time": 1554385150445, "rating": 5.0, "text": "When we made the move over to Infomedia, the transition was fairly seamless.  Their customer service is second to none.  Staff is friendly and easy to work with.", "pics": null, "resp": {"time": 1554903914128, "text": "Thanks so much, Christopher! You are a pleasure to work with."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "117529701341952539582", "name": "Frank Jones", "time": 1433542076455, "rating": 5.0, "text": "We have extensive experience with the folks at Infomedia. They designed our 2 websites and the back end data base that supports them, 6 or 7 years ago. They do a great job by first completely understanding our needs and then developing a solution that works the first time. Exceptionally fine people to work with too. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "113091043239517118444", "name": "Chris Barnes", "time": 1501252496446, "rating": 5.0, "text": "I think the team at Infomedia is very talented.  Their website development abilities are excellent, but where they really excel is in customer support.  The Infomedia help desk is extremely responsive, providing fast and effective service in a very pleasant fashion.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "113413478359929518307", "name": "John Hunt", "time": 1485626901577, "rating": 5.0, "text": "Working with the friendly Infomedia staff was a great experience. They did superb work creating our website and working with our team. The final product is professional and conducive to today's web standards. We also know that they are only a phone call away and are always eager to work with us and to please.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "112679783022867636205", "name": "Dawn Taylor", "time": 1459349139292, "rating": 5.0, "text": "Very quick response time to support questions.  Very attentive to requests.  Always thorough follow-up.  Creative problem-solvers. Darn nice bunch of folks!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "116389094894861885106", "name": "Robby White", "time": 1450725623775, "rating": 5.0, "text": "These guys know what they are doing.  They can help you whatever business you are in by custom crafting a solution that is tailor made to fit your specific need and budget.  Not to mention they have exemplary customer service during and after the project.\nFrom large international company to a small local storefront, they have the experience and innovative talent to be at the forefront of their profession.", "pics": null, "resp": {"time": 1452781821282, "text": "Thank you for the encouraging words, Robby! We strive to provide the absolute best service possible to all of our clients and fit the needs of the business no matter what. We are thankful we were able to do that for you!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "111822649712509257333", "name": "T Beck", "time": 1561726714120, "rating": 5.0, "text": "Infomedia completely redesigned our website during our corporate rebrand. They have extremely high creative and design standards and delivered a professional final product that exceeded our expectations.", "pics": null, "resp": {"time": 1561727595880, "text": "We're so glad that your website was a success, Tanya! Thank you for working with us."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "100807424026399332645", "name": "Jay Gilchrist", "time": 1567701091029, "rating": 5.0, "text": "Everyone I've been in contact with at Infomedia has been very responsive and knowledgeable. They make you feel like a close friend that wants to help you succeed.", "pics": null, "resp": {"time": 1567702717502, "text": "Thank you, Jay! We hope to make all of our customers feel this way."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "118425137729737333810", "name": "d laughli", "time": 1459284503300, "rating": 5.0, "text": "Infomedia has produced many great logo's and websites for several individuals I know. My contacts have always been very pleased with the work and delighted with the companies dedication to please their clients. I'm personally always impressed with the quality of the sites and friendliness of the staff.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "112088683225480124968", "name": "Tony Halsey", "time": 1434572876469, "rating": 5.0, "text": "Infomedia has proven their excellence in website design for us on many occasions. They have been instrumental in assisting us with strengthening our brand on the web which has lead to increased business opportunities. Their expertise/knowledge of the industry and project management allowed us to successfully implement a product that really stands out amongst our competitors.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "113506131613588151567", "name": "Frank Barker, III", "time": 1459288505955, "rating": 5.0, "text": "Infomedia has been wonderful in hosting my website.  They are very reliable and trustworthy.  Whenever I need something added or changed, they are fast and accurate and always happy to help.  I would recommend Infomedia to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "115690145682102861965", "name": "Matthew Wilson", "time": 1462204668197, "rating": 5.0, "text": "Infomedia has a great team! They are personable and professional. They wanted to know us better so they could meet our needs as a organization. Also - their \"Lunch and Learn\" series has been a great help.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "118430991395120685447", "name": "Heather Self", "time": 1484932798402, "rating": 5.0, "text": "Our office had an excellent experience revamping our site with Infomedia. The entire process was smooth, the team was knowledgeable and professional and every step was broken down to keep our office in the loop. i would definitely recommend working with them to anyone.", "pics": null, "resp": {"time": 1487278140688, "text": "Thanks so much for the feedback Heather. We loved working with your team!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "101216131407428393781", "name": "Ryan Romano", "time": 1490627088686, "rating": 5.0, "text": "Could not be happier with my ongoing experience with Infomedia!  They were extremely easy to work with, and the most professional company I came across.  They were very personal and intimate in helping us build our webpage and made sure all our needs were met!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "102077434988406550840", "name": "Lance Moore", "time": 1403900423339, "rating": 5.0, "text": "Infomedia is a company that is on the leading edge of website design and website marketing. Their professional team has comprehensive solutions for any size business to flourish on the web.  I feel confident that they can tackle any website project.  I give Infomedia a full five out of five for superior website development and website marketing.", "pics": null, "resp": {"time": 1431703683129, "text": "Thanks for the shout out Lance! :)"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "108329044835946594473", "name": "Blair Kelly", "time": 1480540635037, "rating": 5.0, "text": "I can't give enough compliments to the outstanding team at Infomedia. Our company's website needed a complete overhaul and Infomedia was able to create a site that effectively promotes our business and the services we offer. They went above and beyond to make sure it was exactly what we needed.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "110804044273397122797", "name": "David Sher", "time": 1472659147324, "rating": 5.0, "text": "I am thrilled with the customer service I'm receiving from Infomedia. Everyone is  attentive and helpful. It's obvious that customer service is a high priority and it's much appreciated.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "113742355104520881514", "name": "Aaron Dettling", "time": 1450726982662, "rating": 5.0, "text": "I have really enjoyed working with Infomedia.  They really know what they're doing.  And, just as importantly, they are some of the most responsive, client-focused professionals I have ever worked with.  Highly recommended.", "pics": null, "resp": {"time": 1452783604493, "text": "Thank you, Aaron! We have enjoyed working with you and we hope to be able to continue to serve you for years to come. Thank you for the encouraging words!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "115842036940324416743", "name": "Seth Williams", "time": 1425485721746, "rating": 5.0, "text": "We enjoyed working with the team at Infomedia. They have delivered a quality website for us that is very personalized to our needs, and given us great tools to help manage the site. Info media has been a huge help since getting the site live with quickly handling updates and changes we have wanted to make. For the first time in our company history we have a very dynamic custom website and a great partnership to keep it fresh in the future.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "107401020369827210783", "name": "David Martin", "time": 1411680158950, "rating": 5.0, "text": "We have had a very good experience working with Infomedia.  With very little direction, their team was able to interpret our vision for our website.  The feedback we have received from others who have visited our site has been very positive.  The Infomedia team has mastered new technologies and has shared some great ideas with us to improve our marketing efforts.  Infomedia is more than a web design firm; they offer a vast array of services and meet with us on a regular basis to insure our satisfaction and assist with our business development.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "102277179829598762250", "name": "Allyson Lyrene", "time": 1453084246253, "rating": 5.0, "text": "Our low-budget 501(c)3 needed a website to promote publicity about our Christian organization. Infomedia was able to design an affordable website that our board members agreed to accept. We were provided with training before launching and have received continued assistance when needed. The average age of our board members requires great patience as we are electronically challenged, and Infomedia has been very generous in gentleness, kindness, and patience. Infomedia suggested we update for current trends in social media and have done all the work for us. We recommend Infomedia not only for their professionalism but for their personal interest in the clients as well.", "pics": null, "resp": {"time": 1452703563883, "text": "We are so thankful to have been able to help you and to continue the relationship as your organization grows! We are looking forward to a great 2016 with you! Thank you for the kind words."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "107238666631771571034", "name": "David Lambert", "time": 1459440587314, "rating": 5.0, "text": "We here at Ellis Piano has been using Infomedia for years. The quality of service and expertise Infomedia has on staff is absolutely top notch. I would recommend this company for anyone's website design and digital marketing!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "101753082824931709139", "name": "Mark Johnson", "time": 1474132776451, "rating": 5.0, "text": "Great experience with the team at Infomedia. Leslie and Joy are rock stars!  We love our new site!!!\n\nMark Johnson\nPresident/CEO\nCreative Benefit Solutions, LLC", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "105734889269371533042", "name": "Jerry Brown", "time": 1450210374689, "rating": 5.0, "text": "After working with Infomedia and other web design companies in Birmingham, I can say that Infomedia is the best. The have an amazing design team and support team to help you after the site is launched. They stay with you.", "pics": null, "resp": {"time": 1452704157574, "text": "Jerry,\nThank you for providing some great feedback and believing in us as your all encompassing website company! We're thankful for clients like you that stay with us too!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "111923813353506074579", "name": "John Land", "time": 1431610636059, "rating": 5.0, "text": "Infomedia was recommended to us by another company in Birmingham. We were told “these are the guys to use for web design and digital marketing!” That statement has definitely been affirmed by the experience we’ve had. From the beginning, Infomedia took the time to learn about our business and determine what our ultimate goal was. We look forward to a working partnership with Infomedia for years to come!", "pics": null, "resp": {"time": 1431703611591, "text": "Great work often starts with having great clients. This was definitely the case with you guys! Thank you for the opportunity to serve Porter!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "114438997853395739482", "name": "Mitchell Waksman", "time": 1450220115110, "rating": 5.0, "text": "Infomedia has built a great website for us and their support team has really been responsive when we raise issues. Infomedia is extremely easy to work with and most importantly always available to answer my questions and fix any bugs.", "pics": null, "resp": {"time": 1452706697256, "text": "Thank you for the awesome feedback, Mitchell! We are so glad that you all are enjoying your website and that we have been able to help you whenever issues arise. It is always our goal to be quick, efficient, and find a solution."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "103831454408988001791", "name": "Greg Sheek", "time": 1536855288788, "rating": 5.0, "text": "Infomedia has been more than jus the company that hosts my program's website. They have been active partners thinking with us as we evolve our website presence to ensure our vision becomes a reality and even better than we even conceived.  Solid team, solid tech!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "100059770458926476028", "name": "Kristi Austin", "time": 1459347041901, "rating": 5.0, "text": "I have worked with Infomedia on a regular basis for several years. Infomedia manages the AAF Birmingham website and I am often the one that sends changes and updates as needed. The staff at Infomedia are extremely professional, helpful and timely with notifications that not only have they have received my request but a followup email is sent letting me know when the change(s) are complete.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "112221084375239337775", "name": "reid deshazo", "time": 1452549676620, "rating": 5.0, "text": "From the planning stages of a website, or the analytics on the back end, Infomedia has guided us through every step.  They make building a new website, and all the extras that go with it, a very pleasant experience.  We would not have re-branded ourselves the way we did without Infomedia.", "pics": null, "resp": {"time": 1452784270156, "text": "Thank you, Reid! You and your site were a pleasure to work with and we are thankful that you believed in us to create a brand new site for you that fits the needs of your business. We look forward to continuing the relationship through the years!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "106420674261273426721", "name": "Ray Thierbach", "time": 1461873035710, "rating": 5.0, "text": "Pam was very thorough with her explanation of our Program that was custom designed by InfoMedia. They helped me to understand the flow of the program so that I would be able to set some of our other partners up with the program. She is very knowledgeable with the website design and functionality. I highly recommend her for your website questions.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "110886864552135038320", "name": "Jennifer Hill", "time": 1439499925000, "rating": 5.0, "text": "Amazing team! Very professional and easy to work with. The final product far exceeded our company's expectations. Would strongly recommend to any individual or company to use!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "115136058548211068348", "name": "Lauren Dahlenburg", "time": 1452790297324, "rating": 5.0, "text": "The Infomedia team in Birmingham is simply the best I've worked with. Personable staff with superior know-how that creates satisfied customers. So excited they have decided to bring their business to the Emerald Coast!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "101139747315559908166", "name": "anne marie goodwin", "time": 1450738731976, "rating": 5.0, "text": "very satisfied with our website. they spent a lot of time getting it just right. and their customer service is wonderful! pam is the best!!!", "pics": null, "resp": {"time": 1452783811019, "text": "Thank you so much for the kind words! Pam is truly great, and we are thankful to have you as a client. We hope to continue to help serve your needs for years to come."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "117329849025408712268", "name": "Shawndee Lovoy", "time": 1459897701127, "rating": 5.0, "text": "I may be a bit biased, however, I asked for a registration to be added to our church's website for our upcoming Kids Camp, and it was done within 2 hours!! I didn't know what to expect because I had never submitted a work order before, however, I was prepared for maybe the end of the week.  I was so pleasantly surprised to click on my e-mail and see that it was done!!! I was thrilled!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "117900872714177116501", "name": "Celia Lambert", "time": 1461006568630, "rating": 5.0, "text": "“Infomedia has been our website company for 10 years. They are always very attentive and respond quickly to any issues.  We recently had them redesign our website.  They have a creative and patient design team, who are willing to work with the client's ideas. ”\n\nCelia Lambert\nExecutive Assistant\nCity of Atmore", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "108160712897316860916", "name": "Brandon sartain", "time": 1430840946680, "rating": 5.0, "text": "We have used Infomedia for years at our company for different services over time and they have always been very responsive and helpful with any task we send their way. They have incredible customer service and are very easy to get a hold of by phone and or email. I work recommend giving  Informedia a call for your upcoming company task…", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "101308681557163546754", "name": "SparkandArrow Creative", "time": 1460493103911, "rating": 5.0, "text": "Infomedia is an incredible company! Super easy to work with and great with communication. I've loved every minute working with them!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "112814206092450839918", "name": "Pat Bridges", "time": 1459283865809, "rating": 4.0, "text": "The Infomedia team is always patient and answers my questions quickly. We have the security knowing that our data is updated and protected. Pat Bridges - First Priority of Alabama", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "106578045777748880834", "name": "Danelle Murray Weaver", "time": 1560436561471, "rating": 5.0, "text": "It has been an absolute pleasure to work with Informedia. They have recently built us a brand new website, did a full SEO package on that website, designed a marketing package for our print materials, and created a new logo for our jewlery store - David's Jewelry and Coin Exchange. Pam, the Director of Account Development, has provided quality customer service. She has been extremely responsive and has given me so many tips and tricks that will help me moving forward. Thank you Infomedia!", "pics": null, "resp": {"time": 1560437544903, "text": "Thank you, Danelle! Our entire team has enjoyed working with David's Jewelry and Coin Exchange and we're so happy that you're pleased with your website."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "115080658144852096382", "name": "Keri Atchley", "time": 1450295843577, "rating": 5.0, "text": "My company and I have loved working with the everyone at Infomedia over the past few years.  They are truly a stellar organization.  They do really great work, are super knowledgable and some of the friendliest people on the planet.  I love how easy they are to work with and everyone always seems to be in a good mood - likely because they all enjoy working for the owners, a father-son duo.", "pics": null, "resp": {"time": 1452706873255, "text": "Thank you so much, Keri! We are able to great work because of great clients like you! John and Jason Lovoy have instilled vision and integrity into our company and we are thankful that it shows as we work for and care for each and every one of our clients."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "114901638739377900143", "name": "Val Walton", "time": 1430944256708, "rating": 5.0, "text": "The Economic Development Partnership of Alabama has a complex website full of information to help market the state of Alabama and to be a service to site selectors, economic developers and others.\nWe decided it was time to overhaul the site in 2014 to make it bolder, easier to navigate and to be consistent with responsive design.\nWe chose Infomedia for the redesign. From the start with Clay Conner in sales to finish, Infomedia worked side by side with our project team and actively engaged us in developing a state-of-the-art website. Joy Sanders, the designer, helped bring the vision to reality. Along the way when there were challenges, Infomedia solved problems in a timely fashion. The continued customer-support in service of the website is the best. I highly recommend Infomedia to anyone seeking development of a professional and visually appealing website.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "100870016015739487251", "name": "Frank Brocato", "time": 1459280321908, "rating": 5.0, "text": "Great company that is very responsive to making sure the customer's goals are achieved.  The staff is friendly and professional.   There expertise is incredible and their finished product is superior.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "108058834584264530319", "name": "James Gannon", "time": 1555945202199, "rating": 5.0, "text": "Working with Infomedia has been an awesome experience. These guys know what they are doing and they go the extra mile to make sure our website is exactly the way we want it!", "pics": null, "resp": {"time": 1556110699030, "text": "Thanks so much, James! We've enjoyed working with you too."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "108809483058932623860", "name": "Michael O'Neal", "time": 1460496707715, "rating": 5.0, "text": "Infomedia designed and built our website several years ago.  It has worked flawlessly ever since, and their service and ongoing customer support has been outstanding!  Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "101165755469643437648", "name": "David Burroughs", "time": 1490819486317, "rating": 5.0, "text": "Amazing company!  John and his staff were friendly, knowledgeable, and respond quickly.  I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "100524061711982033974", "name": "Rich Mandes", "time": 1450127742303, "rating": 5.0, "text": "All the folks at infomedia are very easy to work with and certainly aim to please in providing website services.  They are very quick to respond to any needs and are very good 'listeners' when it comes to determining how best to serve the customer.\n\nI would highly recommend them for any website needs you may have.", "pics": null, "resp": {"time": 1452703848721, "text": "Rich,\nThank you for the encouraging words! We are always happy to help and we are glad we have been able to provide great service for you. Looking forward to continuing our relationship!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "116105952873103592457", "name": "Jessica Allen", "time": 1555947281852, "rating": 5.0, "text": "Infomedia has been excellent to work with! Not only do they quickly respond with any customer service need, they are also willing to help educate and instruct on many difficult topics.", "pics": null, "resp": {"time": 1556110785333, "text": "Thank you, Jessica! We're glad you've found our team helpful."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "115101752129602546274", "name": "Chris Barnes", "time": 1450365957011, "rating": 5.0, "text": "Infomedia does an outstanding developing, publishing and supporting business websites.  They have a very talented and professional staff.  I would recommend them without reservation.", "pics": null, "resp": {"time": 1452707129359, "text": "Thank you. Chris! It's feedback like yours that helps us to continue to serve our clients such as yourself with ease and to always strive to get better and better! Looking forward to continuing to work with you!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "110730713363063867503", "name": "Peggy Allen", "time": 1459353340455, "rating": 5.0, "text": "Our experience with Infomedia was superb! They built an ecommerce web portal for a client of mine last year.\nJason Lovoy, personally went above and beyond in the design and implementation of this site. And in the end, the client was ecstatic!\nJason is exceptional in his attention to detail. His tireless enthusiasm to make sure the client is completely satisfied with the end product is refreshing, to say the least.\nExtraordinary company and team.\nHighly recommend!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "114920873895393348306", "name": "Rod Palmer", "time": 1567092594542, "rating": 5.0, "text": "Great helpful experience. I love these folks", "pics": null, "resp": {"time": 1567093885038, "text": "Thank you, Rod! We appreciate your business."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "107082020443500297515", "name": "Brian Ralph", "time": 1555337840568, "rating": 5.0, "text": "We've been working with InfoMedia for almost a year on the design, implementation and servicing of our new website. The team is always responsive to our requests and works to resolve any concerns ASAP. If your company needs a new or redesigned website, give InfoMedia a call.", "pics": null, "resp": {"time": 1555421854832, "text": "Thanks so much, Brian! We've enjoyed working with you too."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "102407241396859205046", "name": "BlackWatch Sports", "time": 1484763513754, "rating": 5.0, "text": "Customer service and training offerings have been great as I work with a company website. They offer free monthly \"Lunch & Learns\", and I am looking forward to attending these to learn even more!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "105909914820360390185", "name": "Virginia Sproul", "time": 1459359968338, "rating": 5.0, "text": "Excellent.  Infomedia set up a website for a 52 lot subdivision, plus sites for historic corporate work.  Easy to navigate, and clear information.\nBob Sproul, Jr.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "103971158521279636342", "name": "Avanti Polar Lipids", "time": 1554312201388, "rating": 5.0, "text": "What can we say?! InfoMedia is simply the best! The Avanti team has had the pleasure of working with InfoMedia  on several projects from website re-design to company videos to social media marketing and everything in between! The customer service is second to none. They are experienced professionals who are experts at communicating complex concepts to non-expert audiences. The team is composed of well-organized, deadline-oriented individuals who not only get the job done - but get the job done well!  InfoMedia invests in each project with team members personally familiarizing themselves with aspects of the business in order to best meet the objective of the business and industry as a whole. They are committed to creativity and helping organizations stay on the cutting edge of the state of the art! Huge endorsement and thanks from the Avanti team!", "pics": null, "resp": {"time": 1554903832981, "text": "We've loved collaborating with the Avanti team too! We look forward to many more years of working together."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "104059288257897867679", "name": "Laura Hoaglands", "time": 1491240596170, "rating": 5.0, "text": "Infomedia provides us with excellent customer service. They respond to us in a quick and efficient manner.\n\nHoagland's of Greenwich", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "108544039823470543409", "name": "Lindsay Knight", "time": 1486751569965, "rating": 5.0, "text": "Infomedia has been an outstanding partner to me and my employer.  From designing  and maintaining our site to showing us how to use Google Analytics to our benefit, they have been a great resource for us.", "pics": null, "resp": {"time": 1487277929689, "text": "Thank you Lindsay! You have been a pleasure to work with as well, and we look forward to many more years of continued partnership."}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "102336253347313986235", "name": "Frank V. Brocato", "time": 1459281230355, "rating": 5.0, "text": "I've had the opportunity to work first hand with Infomedia. The experience has been exceptional regarding customer service, pleasant responses,  phone or text messages answered quickly or in a timely manner and other service related customer needs addressed quickly. Working through complex issues particularly in the startup phase can be hectic and stressful. The staff at Infomedia works methodically with you and exhibits a presence that is reassuring.\nFrank V. Brocato\nHoover, Alabama", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "100491656115628054150", "name": "Jason Junkins", "time": 1519232994807, "rating": 5.0, "text": "Awesome group to work with.  Very knowledgeable and over the top customer service!", "pics": null, "resp": {"time": 1519863518564, "text": "Thank you so much! We love working with you, Jason!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "115137804974118998814", "name": "Blackjack Horticulture", "time": 1520267856970, "rating": 5.0, "text": "Incredibly helpful, responsive and knowledgeable. Very pleased with our interactions with them!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "103768106262104506428", "name": "Joe Gribbin, Jr", "time": 1459974879917, "rating": 5.0, "text": "Infomedia has been a pleasure to work with, the entire staff is professional and friendly.  They have done a great job updating our website and helping clarify content.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "111942934342905766653", "name": "James LeCroy", "time": 1474989939789, "rating": 5.0, "text": "I've been more than pleased with the work from Infomedia. Over the past year, they have helped manage and grow my internet marketing presence for my dental office.", "pics": null, "resp": {"time": 1475097838469, "text": "Thanks for the kind words, James. We've enjoyed working with you as well!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "111328925015855320234", "name": "Gavin Mikell", "time": 1443142345877, "rating": 5.0, "text": "Infomedia took our website from a 3 to a 10!  Went from #9 organic to #1 in just a few short months!  Pam and Jerry have been my go to people for over a year now. They have worked with our company to make it the best in Birmingham.   Dont waste time with fly by night SEO who promise you the world for a few hundred dollars.(believe me when I say, been there done that)  Work with these people to see real results!", "pics": null, "resp": {"time": 1443457330016, "text": "Gavin, Thank you so much! We have very much enjoyed working with you and your company as well and hope to continue the relationship further! As always, please let us know if you need anything!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "113277335217647512367", "name": "Ryan McWhorter", "time": 1470864022417, "rating": 5.0, "text": "Pleasure to work with. Always responsive.  Quick to make changes. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "115271259237953747024", "name": "Daniel Fowler", "time": 1450726671393, "rating": 5.0, "text": "Great group to work with, always willing and eager to assist with whatever request is made.  Quick response time when issues arise and resolution times are fast.", "pics": null, "resp": {"time": 1452783237972, "text": "Thank you, Daniel! We hope to be able to continue to serve you through the years!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "114263891254981088594", "name": "Barbara Royal", "time": 1469557893565, "rating": 5.0, "text": "Needed an email account fix, and the turnaround time and outcome provided by  Infomedia was impressive.  Their staff was enthusiastic, polite, and effective!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "106761917826442454408", "name": "Rob Genin", "time": 1490037347180, "rating": 5.0, "text": "Infomedia's team is courteous, friendly and helpful. We are so glad to have their support!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "107032342113754016990", "name": "J.R. Gronauer", "time": 1430943539635, "rating": 5.0, "text": "Fantastic company!  They have been instrumental in growing our company and they are always eager to help.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "112360879669380590552", "name": "CodymanR62", "time": 1435098944293, "rating": 5.0, "text": "Extremely helpful in guiding my company to better web positioning, especially via local optimization.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "106947069002093381874", "name": "Carrie Crane", "time": 1459285760498, "rating": 5.0, "text": "Infomedia has been very helpful and responsive.  GREAT support team!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "114333329182952451279", "name": "Audra Morgan", "time": 1459197089062, "rating": 5.0, "text": "Infomedia has been a fantastic company to work with. I am so glad I found them and I have been so pleased with their service and dedication to making sure their clients are super happy.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "108276535199246787614", "name": "Jason Junkins", "time": 1490236125474, "rating": 5.0, "text": "Excellent support!  Detailed attention.", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "110148948180417846187", "name": "Cross Creek Church", "time": 1459281350347, "rating": 5.0, "text": "Infomedia has a professional team, always willing to assist and always in a timely manner!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "110766989755825676359", "name": "Jenny Auvil", "time": 1450365953461, "rating": 4.0, "text": "Great people to work with. Very accommodating!", "pics": null, "resp": {"time": 1452707015349, "text": "Thank you, Jenny! We appreciate your feedback. Let us know if there is ever anything we can help you with!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "105616316345109534904", "name": "Darryl Washington", "time": 1459332798353, "rating": 5.0, "text": "The City of Irondale deeply values our partnership with Infomedia.  For the last (3) years the Infomedia team has become a trusted and valued partner of the City of Irondale.\n\nThey've differentiated themselves from our previous vendor as a result of their:\n\n* Innovative and creative approach to account management\n* World class customer service\n* Consultative approach to solving business problems.\nInfomedia has proven to be a valuable business onsultant and partner to the City of Irondale", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "105871159116636881859", "name": "Tom Saab", "time": 1490036194583, "rating": 5.0, "text": "Infomedia does a great job with our small business", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "101909170412992940281", "name": "WBL Women Business Ldrs", "time": 1450450497133, "rating": 5.0, "text": "A firm with a technically competent staff that is both friendly and very patient with non-IT folks.  That’s a winner.", "pics": null, "resp": {"time": 1452707397076, "text": "Your site was a pleasure to work on! We are thankful for your feedback and your continued support!"}, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "101216743082299773656", "name": "Robert Evans", "time": 1492148156161, "rating": 5.0, "text": "Great group of folks!", "pics": null, "resp": null, "gmap_id": "0x88891be66e44935f:0xb988c798b8119d6d"}
{"user_id": "110755040706073038110", "name": "Jennifer Gray", "time": 1612537454060, "rating": 5.0, "text": "Our partnership with Uptick has exceeded all our expectations. Everything they do is first-class, from communication to customer service to delivering a tailored marketing strategy with measurable results. It is clear they truly care about our business. Our consultant, Matt Spivak, is as knowledgeable, responsive, and kind as they come! We are very happy we made the decision to work with them.", "pics": null, "resp": {"time": 1614370229389, "text": "We love working with you guys.\n\nAs you mentioned, our number one goal is to help our client's see success. That means having a team of dedicated individuals like Matt who are all that you mentioned above. Here's to continued success!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "112121460122647765761", "name": "Kristin Waters Sullivan", "time": 1616425139728, "rating": 5.0, "text": "Everyone at Uptick has just been fantastic to work with, and their results speak for themselves. Cannot recommend them highly enough.", "pics": null, "resp": {"time": 1616711914653, "text": "Hi Kristin! We're glad to see you've seen results. You've been such a joy to work with and we're so glad to be a part of your success story. To continued years of success!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "104903308599738219941", "name": "Mark Lucas", "time": 1599669088709, "rating": 5.0, "text": "Uptick Marketing has an extremely knowledgeable and friendly staff. They understand the ins and outs of SEO, marketing and web development in ways we had previously overlooked. Uptick's team not only did a great job working with us to improve our existing website and web presence but they also educated us on the importance of maintaining a website that convey's our organization's message in  clear and concise manner. Uptick's client communication is great and they  are always willing to help!", "pics": null, "resp": {"time": 1599677842898, "text": "Mark, we've enjoyed every minute working with your organization.  You all provide a much needed service for our community!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "106320883002949539474", "name": "Paul Neville", "time": 1615417209694, "rating": 5.0, "text": "They are experts in the field of digital marketing and do excellent work for their clients.", "pics": null, "resp": {"time": 1615565330014, "text": "Thanks for your review, Paul!\n\nWe always try to stay on top of the latest trends in everything digital so we can help create success stories for our clients. We're glad to be able to work with great organizations like Northstar!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "101195919649157918969", "name": "Pam Sanderson", "time": 1581719139524, "rating": 5.0, "text": "I love working with Uptick! Superb team of professionals that work tirelessly to stay on top of the latest trends and google algorithm changes. I am constantly impressed by the high level of service and dedication to their craft. I highly recommend them to anyone looking for digital marketing services!", "pics": null, "resp": {"time": 1582046929324, "text": "Thanks, Pam!  We appreciate your kind words about trusting us with all digital marketing needs.  We look forward to continuing our work together!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "112529515590172999613", "name": "Claire Vaughn", "time": 1581083100060, "rating": 5.0, "text": "I have worked with Uptick on multiple projects across industries—both professionally and through volunteer efforts. The Uptick team is extremely professional and knowledgable. They are extremely easy to work with and I am particularly impressed with the data metrics they use to demonstrate the progress and success of each project. Highly recommend!", "pics": null, "resp": {"time": 1581362627459, "text": "Claire -  We love hearing about your success stories.  The best part is that we get to be a part of it.  We look forward to continuing working with you!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "114920873895393348306", "name": "Rod Palmer", "time": 1567093087205, "rating": 5.0, "text": "These folks are great. They took my team in and treat us great. Get our vision and they are truly excited about our business. Cant praise Jerry , Bo and the gang enough.", "pics": null, "resp": {"time": 1567546633374, "text": "Rod, we've loved watching your company start from the beginning and grow into what it is today.  It's such an amazing experience that we get to work alongside you!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "106578045777748880834", "name": "Danelle Murray Weaver", "time": 1566333923218, "rating": 5.0, "text": "It was a pleasure to work with Uptick Marketing on our keyword research for the Center for Educational Technologies housed within the College of Veterinary Medicine at Texas A&M University. They did an amazing job at the research and discovery of our industry, competitors and target markets. With this information they created a fool proof strategy that we could implement with ease. Lance Moore and Anna Sims were extraordinarily patient with my learning curve and shared so many tips and tricks to further benefit our success. They worked seamlessly with Pamela Sanderson at their sister company, Infomedia, who was also incredible to work with.  They all were very responsive and genuinely cared about making this a positive experience for myself and my colleagues. Don't worry if you aren't located in Birmingham, Alabama. I am located in College Station, Texas and Uptick made sure there were no challenges due to the distance.  If you are looking for a digital marketing agency, look no further - you have found them.", "pics": null, "resp": {"time": 1566398576110, "text": "Thanks so much for your kind words, Danelle. You were so communicative and engaged in our process, and we thoroughly enjoyed working with you on this project. We look forward to more opportunities to partner with you!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "107760700312770552370", "name": "Fred Henry", "time": 1566584097941, "rating": 5.0, "text": "Active, vibrant group that is customer focused.  They have worked hard to understand our business and are willing to adjust their approach as needed.  Matt Spivak is our contact and he does a great job!", "pics": null, "resp": {"time": 1567546368105, "text": "Thanks, Fred!  We try our best to be customer-focused!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "110945363804001987751", "name": "Amanda Carden", "time": 1566321109725, "rating": 5.0, "text": "We could not be happier with the services that Uptick has provided us. Jerry, Alan, and their crew are amazing! Give them a try and thank me later!", "pics": null, "resp": {"time": 1566324981539, "text": "Thanks, Amanda!  We appreciate your kind words about our marketing services.  We love working with you and look forward to many more years!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "109593740481406655371", "name": "Jessie King", "time": 1566853510093, "rating": 5.0, "text": "Uptick has been phenomenal to work with. They go above and beyond, time and time again. I could not be happier with the service they provide and the level of professionalism they help me achieve.", "pics": null, "resp": {"time": 1567546488895, "text": "We love working with you too!  Thanks for trusting us with your digital marketing needs!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "101089611626604183087", "name": "Clay Haley", "time": 1433085717542, "rating": 5.0, "text": "I have been working with Uptick Marketing for more than 2 years now and have been extremely happy with the results. I am not a tech savvy person but they have gone out of their way to make me feel confident in the decisions we have made and will always do everything they can to explain any questions I have. They work very hard to maximize my budget no matter what I am spending. They listen to me and put together plans and objectives that meet my goals. Nicole and her team have been tremendous to work with and I consider them part of my business.", "pics": null, "resp": {"time": 1433090452575, "text": "Clay,\n\nThank you for your review! We have absolutely loved working with LA Bikini and look forward to helping you as you venture into franchising for your business."}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "104200990689618231263", "name": "Melvin Upchurch", "time": 1429553418631, "rating": 5.0, "text": "Uptick Marketing has helped us launch a startup company and achieve almost instant credibility. Our online look is so impressive, many of our clients thought we were part of an established national network. We appreciate the creativity and expertise that have helped us achieve market success. Thank you Uptick Marketing!", "pics": null, "resp": {"time": 1429801943867, "text": "Thank you, Melvin! It has been a pleasure to work with LIST Birmingham."}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "102235113058008910991", "name": "Miles Worsham", "time": 1579708186611, "rating": 5.0, "text": "I have worked with \"W\" to help grow our Company's footprint through our website and on the internet. Uptick is a great Company and they have helped us to understand the importance of what they can do.", "pics": null, "resp": {"time": 1579729144884, "text": "Miles, we’ve enjoyed assisting you with the development and management of your company’s website! We look forward to hearing about your company’s continued success."}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "114185835321405580794", "name": "Kyle Moon", "time": 1566571986525, "rating": 5.0, "text": "Our experience with Uptick has been phenomenal! We have tried and failed with multiple marketing firms and we can officially say that Uptick has been the difference between our small business staying small and becoming an empire! They keep our phone ringing and thats all I need to say! Matt, especially, is a pleasure to work with. His attention to detail and his constant checkins and updates make this move well worth the money for us. He is a great human being and truly loves what he does, you can see it in his work. He deserves a raise!!!..Because, in the end, Matt's constant kindness and attention to detail is truly the deciding factor for us at Uptick. And employees like that are what separates their firm from the rest of the marketing groups in BHAM. UPTICK ALL THE WAY!", "pics": null, "resp": {"time": 1567546315595, "text": "Kyle, we appreciate you taking the time to leave a positive review about us.  We agree - Matt is a pleasure to work with.  We look forward to continued success!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "117607407654238016071", "name": "Elizabeth Ritter", "time": 1429543480317, "rating": 5.0, "text": "Uptick Marketing is assisting me with AdWords and SEO for my website.  They are extremely knowledgeable and are great at communicating the status of each project to me on a monthly basis.  They provide a customized solution that is tailored to my particular budget.  I would highly recommend Uptick to business owners that are overwhelmed by digital marketing and want to use their website and other platforms to generate leads and thereby increase revenue.", "pics": null, "resp": {"time": 1429546747413, "text": "Thanks Elizabeth! It has been great working with Ritter Law Firm and we look forward to continuing that relationship in the future!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "103971158521279636342", "name": "Avanti Polar Lipids", "time": 1566744589045, "rating": 5.0, "text": "What can we say?! Uptick Marketing is simply the best! The Avanti team has had the pleasure of working with Uptick Marketing on complete digital/social media marketing campaign from  PPC to CIA to SEO to social media/blog posts and everything in between! The customer service is second to none. They are experienced professionals who are experts at communicating complex concepts to non-expert audiences. The team is composed of well-organized, deadline-oriented individuals who not only get the job done - but get the job done well!  Uptick invests in each project with team members personally familiarizing themselves with aspects of the business in order to best meet the objective of the business and industry as a whole. They are committed to creativity and helping organizations stay on the cutting edge of the state of the art! Huge endorsement and thanks from the Avanti team! And, a big shout out to Matt, Anne, Madison, and Peyton for being the best team around! It is a truly a pleasure to work with you!", "pics": null, "resp": {"time": 1567546440238, "text": "Thank you for all your many generous comments about our team.  We strive to provide the best results and service!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "110932783308102650698", "name": "Shawna Boswell", "time": 1520528499277, "rating": 5.0, "text": "Uptick Marketing is incredible. We have been working with them for years here at ProcessBarron, and they continue to prove their expertise, professionalism, and effective marketing efforts. As Marketing Associate for ProcessBarron, I work with them directly. Not only are they respectful of our budget, but they create a plan to ensure we get those most effective services for our allotted spending. They are constantly improving and presenting new services that can be offered - truly showing their ability to be ahead of the game in the marketing industry. Uptick also takes the time to really understand our company, the industries and people we work with, and the best ways to communicate what we do. Working with them has proved to be extremely beneficial to our company. Not to mention, they are very personable and honestly a joy to work with!", "pics": null, "resp": {"time": 1521465745750, "text": "Thanks, Shawna!  We appreciate the kind words and love working with you too.  We look forward to many more years of working together!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "101686618701511713371", "name": "Jeffrey Solomon", "time": 1421790704804, "rating": 5.0, "text": "I perform marketing director duties for a client in Alabama, and we recently entered into an agreement with Uptick. Finally, a communication company that communicates, even when the contract isn't due for renewal! Thanks for an easy transition, the prompt replies and the honesty.", "pics": null, "resp": {"time": 1421791192122, "text": "Thanks for the kind words - we are glad to have you on board!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "106910718895030804650", "name": "Robert Montgomery", "time": 1450560819727, "rating": 5.0, "text": "Highly recommended!\n\nThese folks love what they do and they care about the clients that they work with.  If you are serious about driving traffic, generating more leads, and increasing sales then hiring Uptick Marketing to help grow your business is hands down one of the smartest decisions you can make.", "pics": null, "resp": {"time": 1455898785182, "text": "Robert, thank you so much for your kind words. It has been great working with you!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "103541380428516852404", "name": "Adam Zeidan", "time": 1529718790041, "rating": 5.0, "text": "Some of the best digital marketers that I have ever met period. They won't let you down!", "pics": null, "resp": {"time": 1530547500087, "text": "Thanks, Adam!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "109823540289268164612", "name": "Victours Travel", "time": 1589256375499, "rating": 5.0, "text": "She is the best person to work with ever", "pics": null, "resp": {"time": 1589923097648, "text": "(Translated by Google) Thanks, Fhionh!\n\n(Original)\nThanks, Phionah!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "110631147795590983633", "name": "Chris Roberts", "time": 1429803388664, "rating": 5.0, "text": "I have worked with Jerry Brown, Lance Moore and Jason Lovoy and they are absolutely TOP NOTCH!!  I have worked with 3 other digital marketing firms in the past, and these guys are 10 steps better than all the previous ones combined.  They follow up with me, they answer my questions, they are proactive in determining my needs, and most importantly, they treat me and my business with care and personal attention.  My business has grown exponentially since working them!", "pics": null, "resp": {"time": 1429805002718, "text": "Thank you for your kind word, Chris. It has been great to work with Two Trees Counseling and to see your business grow! We look forward to continuing working with you."}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "114990395873155706932", "name": "David Johnson", "time": 1419637687751, "rating": 5.0, "text": "I am the Executive Director for Doulos Partners and we have just entered into a partnership with Uptick in November. Even though we are only into our second month in working with them, we have been completely blown away with their professionalism and abilities. Working with Nicole Beachum has been such a pleasure and we are very excited about the progress we are already making in getting our name, vision, and stories out about our ministry to a broader audience.", "pics": null, "resp": {"time": 1421791262153, "text": "It has been an absolute pleasure working with David and Doulos Partners - which is an incredible organization that everyone should check out. Thank you, David, for your kind words."}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "112720366833108313716", "name": "Meredith Jones", "time": 1419865995989, "rating": 5.0, "text": "Uptick Marketing is phenomenal at what they do and are able to do it at a cost that makes sense for a small business.  They will come up with recommendations that are tailored to your needs and are not a one-size-fits-all firm.", "pics": null, "resp": {"time": 1421791229755, "text": "Thank you Meredith! It has been great working with your company."}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "105607574974222277153", "name": "Mary Dawson", "time": 1429542680438, "rating": 5.0, "text": "The people at Uptick know what they're doing, and treat each client like they're their only client. Anyone looking to grow their business needs to work with them - they're professional, dedicated, and their efforts always pay off.", "pics": null, "resp": {"time": 1429546705347, "text": "Thanks for the review, Mary! It has been great working with you."}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "104346181151373765817", "name": "Jason E.", "time": 1521568708806, "rating": 5.0, "text": "Solid, capable people who are committed to keeping their customers happy.", "pics": null, "resp": {"time": 1521584624124, "text": "Thanks, Jason!  We appreciate the generous words!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "113126886385517614426", "name": "Doug Hartman", "time": 1491345544042, "rating": 1.0, "text": "Waste of my time. When I sat down with Jenny I told her what I was spending and what I wanted to spend per month for SEO and PPC. We spent an hour going over the company and what I have done in the past 30 years. I'm not new to the internet marketing game. I have worked with yodel and reach local and several other big players in the internet marketing. She emailed me my proposal very quickly but obviously did not listen to anything I said as her estimate was almost three times what I told her I wanted to spend per month at a total cost of over $6000. In addition to that, I was also quoted almost $15,000 for other services. While I did not use their service I feel it was a waste of my time to even meet with them.\nI did receive a call under the guise of needing work done from their managing partner Nicole , asking why I left a negative review for them on Google if I did not pay them to do any work for me. I told her that I would go back on and I would modify my review so that people would understand I did not pay them but that my time was wasted in the phone calls, emails and meeting with them where obviously they did not listen to a word I had to say. This is why I left a negative review for them. They might do a wonderful job in marketing and advertising but I will never know because I will not use them.", "pics": null, "resp": {"time": 1491415354562, "text": "Doug,\n\nWe are disappointed to hear of your frustration with our consultation process and the speediness in which we sent the proposal.\n\nOur goal is to provide tailored strategies for every client based on their specific situation, needs, and goals. Our recommendations are always based on what we believe will specifically help your business achieve online success and may sometimes go beyond stated budgets.\n\nWe hope you're able to find a solution that is a better fit for your needs - and wish you luck in your business adventures!\n\nThank you for your input, your time in the call, and your revised review."}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "107975163611863655168", "name": "Doug Marshall", "time": 1456623003304, "rating": 5.0, "text": "As CFO of the Alabama Family Trust, we came to Uptick Marketing with an outdated website that was not mobile compatible, responsive, or easy to use.  In short, it needed an overhaul.  AFT is a 501c3 organization created under Alabama Statute to administer special needs trusts for children and adults with disabilities, protecting their assets in a SNT to help enable Medicaid eligibility. While this area of the law can be very complicated, the team at Uptick Marketing was invaluable in helping design our new website so that viewers could more easily navigate our website and better understand how AFT operates to serve individuals with disabilities.  Uptick provided us both the technical expertise to create the website and the marketing creativity to build it in the best way to reach those most in need of our services.\n\nAs the former VP/Controller of Alagasco, Chair-Alagasco IT Initiative Council, and Member-Energen Corporation IT Steering Committee, I have worked with many strong, talented IT professionals on multiple IT projects during my career at Energen/Alagasco, and the professionals at Uptick Marketing are right in there with them.  Nicole Beachum, Jerry Brown, and the entire Uptick team did a GREAT job and were EASY to work with.  Their pricing is very fair, and we are looking forward to a long-term partnership together as they are now completely handling our social media management.\n\nThese guys are true professionals - ON THEIR GAME, TOP OF SHELF TEAM, REALLY FUN TO WORK WITH, AND ALWAYS HAVE GREAT COFFEE FOR OUR STRATEGY MEETINGS!   ---- Doug Marshall, CFO of Alabama Family Trust", "pics": null, "resp": {"time": 1456762845057, "text": "Thank you very much for the kind words, Doug.  We enjoy working with your team and look forward to the future."}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "103701172021316493655", "name": "Jay R", "time": 1513089820243, "rating": 5.0, "text": "Jason and the marketing professionals at Uptick partner with you to advance your endeavors. They ask you questions so they can provide you great service and an informed response.", "pics": null, "resp": {"time": 1513173446667, "text": "Thank you, Jay!  We appreciate the time you took to leave positive feedback online.  We look forward to our continued marketing efforts in the future!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "111903491734485241011", "name": "Josh Watkins", "time": 1493262217475, "rating": 5.0, "text": "It's not just the culture, these guys really care about your business and it succeeding.", "pics": null, "resp": {"time": 1493320877986, "text": "Thank you for the kind words!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "106419758308044876902", "name": "Triple Six", "time": 1588822085452, "rating": 5.0, "text": "I was looking for internet marketing services and social media marketing in hartselle, alabama and I was told about rogue business marketing from a friend.  Extremely knowledgeable and helpful people!  I have dealt with a marketing agency in the past but they didn't compare to these guys. Extensive knowledge of facebook marketing techniques!  I am glad to have contacted them.  Their social media marketing for my business has caused my business to grow like crazy.  I highly recommend anyone to try these guys out. You won't be sorry. I knew I was working with the right people right from the beginning when they told me that they had some questions for me to determine if they could make money for my business. They said they would not take me as a client unless they knew for sure they were going to be profitable for me.  No long term contract either. But with the results I have been getting, they dont need a contract!  Again, highly recommend.", "pics": null, "resp": {"time": 1590018212192, "text": "Thank you.  It's great working with you and your team. We are going to really explode your business this year!"}, "gmap_id": "0x8888290b5d58a03f:0x5e9a55fe2ca2bef8"}
{"user_id": "107883088480413860640", "name": "Rusty Osborn", "time": 1589415567790, "rating": 5.0, "text": "I hired Casey to do my business marketing and I could not be happier. He has brought business to me from Hartselle, Cullman, Madison, and Decatur AL. If you are looking for the best marketing company in North Alabama, Rogue Business Marketing is it!!!", "pics": null, "resp": {"time": 1590018085118, "text": "Thank you Rusty. Its great working with Innovative Fence Solutions. We want to bring you much more business in the future to help your business grow."}, "gmap_id": "0x8888290b5d58a03f:0x5e9a55fe2ca2bef8"}
{"user_id": "114649182880574093698", "name": "Burt Wilson", "time": 1612302313256, "rating": 5.0, "text": "I can't say enough good things about Taylor and his team. They're the best at what they do, they've been doing this for years and it shows, and they actually care about the projects they work on. I am happy to finally find someone who's got reasonable pricing for excellent WordPress, SEO, and social media work.", "pics": null, "resp": null, "gmap_id": "0x889a43d6310b960f:0xc91ee4eab2c15059"}
{"user_id": "107245146954498568279", "name": "Kevin Northcutt", "time": 1594416272435, "rating": 5.0, "text": "These folks are great! Highly professional, courteous, and extremely helpful.\n\nHighly recommended.", "pics": null, "resp": null, "gmap_id": "0x889a43d6310b960f:0xc91ee4eab2c15059"}
{"user_id": "106938042379947212264", "name": "eric darko", "time": 1471391289287, "rating": 5.0, "text": "TurkReno is an amazing website design company. Taylor and his team has helped me create a huge news network that brings in ad revenue beyond what I ever imagined. If you're looking for the best web design company in Mobile, Alabama, TurkReno is the company to go to.", "pics": null, "resp": {"time": 1471741909955, "text": "Thank you so much for the review. It was a pleasure helping you!"}, "gmap_id": "0x889a43d6310b960f:0xc91ee4eab2c15059"}
{"user_id": "101590206624184850920", "name": "George Pfeiffer", "time": 1424980906020, "rating": 5.0, "text": "These guys are the best technicians and website designers in all of Alabama. Their services are very affordable. They also have the best deals on Apple and Mac computers. These are the only people I trust to work on my computers and websites. Truly the best.", "pics": null, "resp": {"time": 1471741933050, "text": "Thank you so much for the review. It was a pleasure helping you!"}, "gmap_id": "0x889a43d6310b960f:0xc91ee4eab2c15059"}
{"user_id": "117742890303482818197", "name": "EvilerDisturbed", "time": 1471647368356, "rating": 5.0, "text": "I started my online store with someone who had absolutely no idea what they were doing. It almost cost me everything I put in to it. When I met Taylor with TurkReno, he had ideas that I started using immediately. We got everything moved over to their hosting, got our credit cards in order, and let TurkReno do a brand new website design. Several months later, I've made more than double what we projected to do. Five stars, all the way.", "pics": null, "resp": {"time": 1471741894250, "text": "Thank you so much for the review. It was a pleasure helping you!"}, "gmap_id": "0x889a43d6310b960f:0xc91ee4eab2c15059"}
{"user_id": "100336392285111217142", "name": "Tom Bevis", "time": 1425600527983, "rating": 5.0, "text": "I have used TurkReno for web hosting and design exclusively for the last five years.  Their service is fast and effective, and they are always helpful and friendly.  On top of it all, their prices can't be beat.  The staff is patient and understanding, and any time a problem arises, it is taken care of immediately.  In the history of my account with TurkReno, the servers have never been unavailable and I have never had any problems accessing my resources.  I can't recommend these guys enough.", "pics": null, "resp": {"time": 1471741925794, "text": "Thank you so much for the review. It was a pleasure helping you!"}, "gmap_id": "0x889a43d6310b960f:0xc91ee4eab2c15059"}
{"user_id": "117934519445103184913", "name": "Rob Patrick", "time": 1472692512902, "rating": 5.0, "text": "Extremely reliable, consistent, and knowledgeable service. As a member of a major critics organization, I feel comforted and confident in knowing that Taylor and his team are at the foundation of my web presence. I'm incredibly proud to have TurkReno in my corner.", "pics": null, "resp": null, "gmap_id": "0x889a43d6310b960f:0xc91ee4eab2c15059"}
{"user_id": "117170198477064831373", "name": "Dezkly ZQuestion", "time": 1427030741641, "rating": 5.0, "text": "Top notch support, When I have questions they calmly explain what is going on and how it will be fixed. They seem to be knowledgeable and on the ball with what all is going on in the tech/online world.", "pics": null, "resp": {"time": 1471741917701, "text": "Thank you so much for the review. It was a pleasure helping you!"}, "gmap_id": "0x889a43d6310b960f:0xc91ee4eab2c15059"}
{"user_id": "114660533344253093275", "name": "Chris Kitzmann", "time": 1471640793540, "rating": 5.0, "text": "TurkReno has helped our retail operation get connected on the net and on Facebook. They've done a wonderful job of making sure that our POS systems work correctly, that our servers stay online, and that we're able to make sales no matter the time of the day. For anyone looking for a website design company that's a one-stop-shop for IT services, TurkReno is the company to go to.", "pics": null, "resp": null, "gmap_id": "0x889a43d6310b960f:0xc91ee4eab2c15059"}
{"user_id": "103733229333728313294", "name": "Hackinformer", "time": 1471574636754, "rating": 5.0, "text": "We met the TurkReno team on Twitter several years ago working on some social media projects. Eventually we ran in to some problems with my old website hosting company putting limits on my account and shutting my site off without notice. TurkReno stepped up and offered me a few ways to get my website hosting and website design under control. They grew my traffic from 20,000 visits in a year to over 4,000,000 visits in a year. We've started making an awesome amount of money through ad-revenue since then. If you're looking for a website design company that can handle hosting, logos, branding, marketing, ads, social media, or anything else website related - TurkReno is the only place we will go to. Thanks guys!", "pics": null, "resp": {"time": 1471741903445, "text": "Thank you so much for the review. It was a pleasure helping you!"}, "gmap_id": "0x889a43d6310b960f:0xc91ee4eab2c15059"}
{"user_id": "113959836608354751601", "name": "Cindy Zebryk", "time": 1471823100291, "rating": 5.0, "text": "Only website design company that I'll use in South Alabama! Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x889a43d6310b960f:0xc91ee4eab2c15059"}
{"user_id": "101763787296697454717", "name": "Burt K.", "time": 1424930668622, "rating": 5.0, "text": "They fixed my MacBook and later my website. I'm satisfied.", "pics": null, "resp": null, "gmap_id": "0x889a43d6310b960f:0xc91ee4eab2c15059"}
{"user_id": "102192550915730827757", "name": "amber keebler", "time": 1521573005705, "rating": 5.0, "text": "Great company to work with!!", "pics": null, "resp": null, "gmap_id": "0x889a43d6310b960f:0xc91ee4eab2c15059"}
{"user_id": "111078612166995827662", "name": "Hunter McGonagill", "time": 1613506056076, "rating": 5.0, "text": "V3 was a great investment for our company.  As a new small business we needed to make a solid first impression, and Chris and Trey really took their time to get to know the company and make our web presence match our goals.  We constantly get positive feed back on our site, and V3 Media is who we have to thank.  We are now repeat customers and consider them part of our team!\n\nHunter, President, Lex 7", "pics": null, "resp": {"time": 1613578487067, "text": "Hunter, we love working with you guys and are so glad to know that our work is an asset to you guys! Thank you for the great review!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "106038879658812170910", "name": "Ben Boyd", "time": 1612908867465, "rating": 5.0, "text": "Outstanding group of people! Top notch web design and digital marketing. Everyone I have dealt with is knowledgeable, professional and friendly! I’m always happy to support a local business", "pics": null, "resp": {"time": 1612914660470, "text": "Thank you for the nice message, Ben! We appreciate your support."}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "104240006345060471016", "name": "Eloise Stewart", "time": 1612917809580, "rating": 5.0, "text": "I have greatly enjoyed working with Chris, Trey, and Caleb at V3 Media. They are incredibly knowledgable of marketing, website design and functionality, and digital advertising. They have created and managed successful Facebook ad campaigns for us. I am thankful for their willingness to be creative and adapt the business grows.", "pics": null, "resp": {"time": 1612970217805, "text": "Thank you so much for the review Eloise, we have enjoyed working with you!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "115140744060065787093", "name": "Kerron Stewart", "time": 1612929213988, "rating": 5.0, "text": "I love working with V3 Media group, they are very professional, responsive, dependable, and there work truly speak volume. I will always recommend them.", "pics": null, "resp": {"time": 1612970287092, "text": "Thank you for the kind message, Kerron! We appreciate your support!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "117259083226014720704", "name": "Betty B", "time": 1592516679935, "rating": 5.0, "text": "V3 has been a pleasure to work with.  Knowledgeable and extremely responsive.  We have used several different companies in the past.  We should have gone with V3 the first time!  They completely revamped our website and our digital ad campaigns, which have all been a great success!  I would strongly suggest using this group!", "pics": null, "resp": {"time": 1592584194863, "text": "Thanks for the kind words, Betty! Glad we've been able to help grow y'all's business."}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "100891468811741520327", "name": "Tess Gibson", "time": 1560372186095, "rating": 5.0, "text": "V3 Media Group is such a pleasure to work with. They are professional, fast and have a wonderful creative eye. They are able to take vague design concepts and turn them into an amazing website. I highly recommend working with this group for any web-based needs.", "pics": null, "resp": {"time": 1560462274723, "text": "Thank you for the kind words, Tess!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "105464142396994757175", "name": "Ashley McCollister", "time": 1560371680894, "rating": 5.0, "text": "These guys are the best! They're always so helpful and quick to answer all of my questions. I could not ask for better SEO and site support. I will recommend V3 to anyone and everyone!", "pics": null, "resp": {"time": 1560462300244, "text": "Thanks so much, Ashley! Glad we can help."}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "102990583718674496471", "name": "Hayley Henderson", "time": 1560373620962, "rating": 5.0, "text": "I am so thankful for V3 Media Group. This company took our very bland and outdated website and gave it life and a modern brand that we could have never imagined. The team is so creative and they are willing to help the client at anytime. Additionally, their response time is incredible! Our company's website now creates a story and allows potential clients see our services before they even walk through our business doors! Check out their work at ColumbusTradeCenter.com.", "pics": null, "resp": {"time": 1560789230894, "text": "We're happy to help, Hayley! Glad y'all like the work we do! As always, if you ever need us, we're just a phone call away."}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "111842572480283820022", "name": "Sarah Martin", "time": 1560369015609, "rating": 5.0, "text": "We've had a wonderful experience with V3 in every way possible! Website design, marketing & real estate photography! They are very responsive and make the complicated very easy to understand!", "pics": null, "resp": {"time": 1560462386075, "text": "It's easy to do a good job when we're working with awesome people like you!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "108735868659348783310", "name": "Elizabeth White", "time": 1560438546631, "rating": 5.0, "text": "We have worked with V3 Media for years. Their service and knowledge is outstanding!  We have worked on several services and projects with them and each one has gone seamlessly.", "pics": null, "resp": {"time": 1560462216446, "text": "Y'all are the best!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "109427257635443327478", "name": "Carlo Romano", "time": 1560370653647, "rating": 5.0, "text": "The V3 group has been a vital asset to our company and the growth of our web presence; site design, SEO, and Ad campaigns. So grateful to have them as part of our team!", "pics": null, "resp": {"time": 1560462335563, "text": "This means a lot coming from you Carlo! We love working with y'all."}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "115587992282422791140", "name": "John Carney", "time": 1579817016962, "rating": 5.0, "text": "I have worked with V3 for many years and would highly recommend them for any website development, SEO, or digital marketing.", "pics": null, "resp": {"time": 1592584207973, "text": "Thanks John!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "117687456755566707355", "name": "Ryan King", "time": 1563564556494, "rating": 5.0, "text": "Great group of responsive problem solvers.", "pics": null, "resp": {"time": 1573574249497, "text": "Thanks for the review Ryan! Glad we were able to help!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "107776188780906284057", "name": "Corey Craig", "time": 1560370712731, "rating": 5.0, "text": "Professional, available, real world solutions to real world problems!", "pics": null, "resp": {"time": 1560462311132, "text": "You're the man Corey!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "106265069847651999573", "name": "Hal Walker", "time": 1560369834823, "rating": 5.0, "text": "Fantastic Group", "pics": null, "resp": {"time": 1560462343697, "text": "Thanks Hal!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "105645930334633328388", "name": "Jesse Janes Jewelry", "time": 1624651669119, "rating": 5.0, "text": "I love working with this company!  I have received so much value and the knowledge they have in this line of work is phenomenal.  I highly recommend! Tony has been extremely helpful.", "pics": null, "resp": {"time": 1625258580050, "text": "we glad to be working with you on google ads and online sales!"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "113547634633876894396", "name": "Lindsey Harrison", "time": 1624040996399, "rating": 5.0, "text": "Seriously the best at what they do!  I get an answer within minutes! When we switched to Pathfinder, our business changed!  we got more traffic and calls than we ever have.  Highly recommend!", "pics": null, "resp": {"time": 1624041837499, "text": "Thank you for having us for your google ads and website auditing, its great working with you! we always try to be as transparent and responsive as possible."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "114959177272765575974", "name": "StreetBreeds Co", "time": 1617038703106, "rating": 5.0, "text": "He’s a really skilled and knowledgeable guy, has helped me out a ton with Google and definitely knows his stuff when it comes to advertising on Google. Helped me get my accounts fixed before even hiring him. Would definitely recommend Tec Tony and Pathfinder DM to any small business looking to start working with an agency", "pics": null, "resp": {"time": 1617042137353, "text": "Thank you. We love to help small business advertise online."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "116774125450288224456", "name": "Melia McKean", "time": 1610722407749, "rating": 5.0, "text": "Looking to grow your business? Pathfinder Digital Marketing is the best! Tech Tony is the master and great to work with. Thank you Tony for all your help in getting our business page back on tract!", "pics": null, "resp": {"time": 1610723945429, "text": "Thank you so much, it's great working with you and helping small businesses grow using Google ads & all of Googles online free service for small businesses. #digitalmarketing"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "112061250114857025199", "name": "Support for Clients - Disaster and Disability Consultants", "time": 1610491664277, "rating": 5.0, "text": "It's been a pleasure to work with Pathfinder Digital Marketing the past several months. I came to them with my website a mess and they worked within my budget to get a great website that met all the compliance issues. They were responsive to my needs and knew that budget was an issue.", "pics": null, "resp": {"time": 1610491836582, "text": "its great working with your website build, and ironing out the problems. I am looking forward to continue working with you."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "104870499836615305202", "name": "Lavita Nuova", "time": 1606257976898, "rating": 5.0, "text": "Tony is great to work with! I like his cutting edge approach. Always introducing  new ideas and new tools to optimize  online marketing result! Thanks Tony!", "pics": null, "resp": {"time": 1606258934237, "text": "Thank you so much, working with your Google ads and seeing the success you are having is amazing!!!"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "103305575840508861696", "name": "Jernej Rutar", "time": 1603190347510, "rating": 5.0, "text": "Well, there are no words that will describe how happy I was working with Anthony and the whole Pathfinder team. If you want to improve your online presence on Google or YouTube, Pathfinder will find the right path for you! Totally recommend to reach out to them!", "pics": null, "resp": {"time": 1603493562654, "text": "Thank you, its great working with you"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "108422616384515701191", "name": "Christopher Wilson", "time": 1610534194137, "rating": 5.0, "text": "PLEASE USE THEM,,,,I WENT FROM A MAJOR MARKETING COMPANY THAT I HAD BEEN WITH FOR 6 MONTHS WITH ABSOLUTELY NO RESULTS,,,TO TRYING OUT TEC TONY,,AND GETTING LEADS THE FIRST WEEK!!!!\nIM A SMALL COMPANY,,,BUT WITH THE NEW WEBSITE BUILD I WILL SOON BE A LARGE ONE\nSHOUTS OUT TO TEC TONY AND RAY SMITH FOR GREAT WORK AND SUPPORT", "pics": null, "resp": {"time": 1610553243499, "text": "working with your small business google ads and website has been great. we are looking forward to continue helping you grow online."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "109654560847909075331", "name": "Joshua Bane", "time": 1607962472354, "rating": 5.0, "text": "Tony has the best knowledge for your business to get results with Google.", "pics": null, "resp": {"time": 1607974017578, "text": "Digital Marketing is important in Dothan. Thank you for leting us work with you."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "113701705506907073037", "name": "Serzh", "time": 1601395836096, "rating": 5.0, "text": "Tec Tony is a Google Ad expert who can do some amazing things to help you take your business to the next level! Tec Tony is a fun, professional and responsive individual who has helped our small Amazon business grow. I look forward to keep working with him. I would highly recommend for anything Google and or Youtube related!", "pics": null, "resp": {"time": 1601482185948, "text": "Thank you so much, its great working with you in the rank one program for amazon sales."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "107991997065353040189", "name": "Nick Guadagnano", "time": 1590180894459, "rating": 5.0, "text": "Pathfinder Digital Marketing is a great company and they really know what they're doing. I also run a marketing company so this is coming from someone who respects a marketing agency that knows their stuff + always treats their customers like royalty.\n\nYou're in good hands with this team, give them a try!", "pics": null, "resp": {"time": 1590188160100, "text": "Thank you so much."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "104685438833532252965", "name": "Historic Downtown Dothan Business Association", "time": 1602214523082, "rating": 5.0, "text": "Tony is a valuable asset to Downtown. He has helped us market our neighborhood and has gone above and beyond to help local businesses.", "pics": null, "resp": {"time": 1602262504748, "text": "Thank you so much its great working with you"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "109599975653332230644", "name": "Rafael Gil", "time": 1602249815325, "rating": 5.0, "text": "Highly recommend!!!!  I only trust Pathfinder for my digital marketing needs!!  They show me PROOF of increased business!  Tony is on top of his game!  Knows all the latest updates!", "pics": null, "resp": {"time": 1594063004029, "text": "Thank you so much😊😁❤️ It's a pleasure working with The Gil Law Firm. #Lawyers #dothanlaw #amazingclients"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "100286873766023866880", "name": "Biorsi Sula", "time": 1590247206553, "rating": 5.0, "text": "Tony is a champ! He is a honest person, does his job 100% correctly on what he says and on time always! Very knowledgeable and I have been very pleased to work with him! 🥇", "pics": null, "resp": {"time": 1593534127161, "text": "Thank you. It's great working with ur Amazon store"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "106101892032917880920", "name": "Gwendolyn Gilley Construction", "time": 1602182649965, "rating": 5.0, "text": "Tony does a great job listening to our needs and making it happen!", "pics": null, "resp": {"time": 1599580747212, "text": "Thank you so much its great working with you"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "103082567896734470523", "name": "Vanessa Upperman", "time": 1598038299161, "rating": 5.0, "text": "Had some issues with google not allowing me to verify my business. They took care of it right away with no issues!!! Great customer service!", "pics": null, "resp": {"time": 1598043206352, "text": "Thank you so much, glad we where able to help!!"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "107185996296008428550", "name": "Creation Carpentry", "time": 1556503812872, "rating": 5.0, "text": "Tony was able to take a bad situation I was in and totally redesign our website in order to have it up and running with no lost time.  They handle our marketing and have really been able to nail it as far as zeroing in on the best clientele for our business. We own Escape Enterprise and since there aren’t many escape rooms around Tony put in the extra effort to research and find out the best way to market for us. He is also willing to teach you how to do the small things and coach you along the way to make sure you are educated and know what he is doing. He doesn’t just do work behind the scenes and put a hand out for money he takes time to meet with you in person show you what he is doing and what he has done for other companies and then educate you to the level you want to be at. What a great team he has assembled to manage this digital world.", "pics": null, "resp": {"time": 1556905610892, "text": "Thank you so much"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "111658599458588167868", "name": "K B", "time": 1576863713207, "rating": 5.0, "text": "Pathfinder Digital Marketing is good,real and personal. The dictionary defines superlative as: of the highest kind, quality, or order, surpassing all else, or others. Supreme.  Excellent service, great sense of humor. An overall joy to work with. 6 stars.", "pics": null, "resp": {"time": 1576868515884, "text": "Thank you so much."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "105963276509132066814", "name": "Robert Grier", "time": 1602183691997, "rating": 5.0, "text": "Best digital marketer in dothan. best at google ads and working with your small company. Tony is amazingly good at what he does, to work with your small company and build your online presence effectively. #marketing #googleads #dothan #tectony", "pics": null, "resp": {"time": 1595951648404, "text": "Thank you so much."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "100633279424861758127", "name": "Arthit Singh", "time": 1590141848714, "rating": 5.0, "text": "Working with tony has been great, extremely knowledgeable individual who took care of my google ads really well for my amazon business, appreciate it alot Tony!", "pics": null, "resp": {"time": 1590153312609, "text": "Thank you so much! Always a pleasure to brainstorm with you."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "101869380722082337567", "name": "Courtney Quinn", "time": 1567797302771, "rating": 5.0, "text": "Tony knows his stuff!  He is kind and helpful, and just a good person.  He will take the time to do everything he can to help others grown their business.  I am happy to know him.", "pics": null, "resp": {"time": 1567878226773, "text": "Thank you, i enjoy educating businesses"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "101771394071767482876", "name": "alex cole", "time": 1591648288212, "rating": 5.0, "text": "tec tony has been a big amazing help to my company. #digitalmarketing #smallbiz #googleads", "pics": null, "resp": {"time": 1593534145901, "text": "Thank you. It's great working with a small home business"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "100275818214115293060", "name": "Aaron Wyse", "time": 1566583358629, "rating": 5.0, "text": "Anthony has put a lot of effort into learning his trade and his dedication to seeing through with getting his customers results is second to none.. If you want to get to the next level. The best way to invest in your business is to let Pathfinder do the work.", "pics": null, "resp": {"time": 1559847120852, "text": "Thank you Aron"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "103726772895086585235", "name": "Candice Hemenes", "time": 1560449068339, "rating": 5.0, "text": "Tony is a top notch professional in what he does. His genuine sincerity and professionalism in everything he does, shows through the work that he does for his clients. I highly recommend him to anyone who is in the market to improve their online presence and in turn their business.I highly recommend Tony!", "pics": null, "resp": {"time": 1560450153979, "text": "Thank you so much for your review!"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "106394610950008531716", "name": "Aaron Gartlan", "time": 1562181211382, "rating": 5.0, "text": "Tony and the Pathfinder Digital Marketing team are highly trained, skilled and experienced with digital marketing and developing and implementing plans that connect local businesses with their customers in a meaningful way making a positive impact on our community. Even better, he’s an honest hardworking family man and friend.", "pics": null, "resp": {"time": 1562458838822, "text": "Thank you Aaron Gartlan of the Gartlan Law Firm. It is great working with you."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "116512348784750064206", "name": "Peter Milner", "time": 1567453681483, "rating": 5.0, "text": "Tony has helped our firm create a website and he was absolutely incredible! He walks you through everything and is extremely helpful! Thanks again Tony!", "pics": null, "resp": {"time": 1567455659947, "text": "It been great working with you. Looking forward to working on more projects. Glad i was able to get your business on Google Maps, and create your free Google Site."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "106009283042201995687", "name": "Connor Metcalf", "time": 1539898356031, "rating": 5.0, "text": "Anthony Lloyd is by the far the most knowledgeable on digital marketing in the Dothan area. Unlike most professionals who claim to be digital marketers, Tony knows how to make his clients understand what services they are paying for and how it could benefit their companies. Not only is his integrity is unquestioned but he will go the extra mile to make sure his clients gets the results they want. I recommend Pathfinder Digital Marketing LLC to any business owner that wants better results in generating more clients.", "pics": null, "resp": {"time": 1539900287588, "text": "Thank you so much! It's great working with your company and everything you have done for my company."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "110775366445527456893", "name": "Yesenia Leslie", "time": 1603138987735, "rating": 5.0, "text": "Very knowledgeable and easy to talk to.", "pics": null, "resp": {"time": 1603493575217, "text": "Thank you its is great working with you and your store"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "116865032719751666016", "name": "Brandon Shoupe", "time": 1599960504598, "rating": 5.0, "text": "Tony helped us get our location updated on Google Maps, as well as our phone number, which was critical to getting our constituents in the door.", "pics": null, "resp": {"time": 1599960813282, "text": "Thank you so much, it's great working with you."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "112578653179841028220", "name": "Ashley Brishke", "time": 1547071943615, "rating": 5.0, "text": "Really enjoy working with Tony @ Pathfinders. He has helped us tremendously and taken away so much of the guess work when it comes to Google advertising. Thanks Tony! See you again next week.", "pics": null, "resp": {"time": 1547073491260, "text": "It's great working with you and your company @eco heating and cooling. #supportyourlocalbusiness #hvac #acrepair #heatingrepair"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "100241370442659980489", "name": "Ed Lewis", "time": 1571860305950, "rating": 5.0, "text": "\"Tec\" Tony has done an awesome job in helping me with my online presence, website, and online advertising !!! Go see him , I highly recommend him for the job you may have !!!", "pics": null, "resp": {"time": 1571864667987, "text": "Thank you Ed."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "112576034106484717804", "name": "AR Workshop Dothan", "time": 1569610479087, "rating": 5.0, "text": "Tony continues to bring literally hundreds of new customers to our web page   He knows his stuff, no fluff and backs it up with searchable facts.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNaI7MYP-0-1VWV81xhxF_n6MgKxjIhsZAybhL3=w150-h150-k-no-p"]}], "resp": {"time": 1569611849406, "text": "Thank you for letting me work with u."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "110687232656953076142", "name": "Harry Grier", "time": 1559843556592, "rating": 5.0, "text": "Tony understands how digital marketing really works. This is his only business, not selling other types of marketing with a little digital stuff thrown in. He stays abreast of all the changes that Facebook and Google make to their algorithms so he can maximize his clients marketing dollar.", "pics": null, "resp": {"time": 1559847072834, "text": "Thank you so much Harry, it has been great working with you."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "100429783229105380159", "name": "Jason Shepard", "time": 1566412948644, "rating": 5.0, "text": "Tony is always a pleasure to work with.  Very knowledgable and does a great job.", "pics": null, "resp": {"time": 1566417612356, "text": "Thank you so much, it is great to work with you"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "107108793173900605750", "name": "Rick Jenkins", "time": 1559844568495, "rating": 5.0, "text": "Tony takes the time to understand your business goals and works diligently to help you stand out above your competition. I highly recommend him and his services!!!", "pics": null, "resp": {"time": 1559847094440, "text": "Thank you Rick. It's great working with you, I am looking forward to working with you."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "115837635953130292720", "name": "Kelley York-Massingill", "time": 1559849472658, "rating": 5.0, "text": "Tony is incredibly knowledgeable and easily translates this into a digital marketing plan your business needs to grow!", "pics": null, "resp": {"time": 1560006416266, "text": "Thank you. It's great working with you."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "108445899413718067309", "name": "Kaytlan Herrin", "time": 1560006541498, "rating": 5.0, "text": "Very knowledgeable in the area of google ads and social media ads. Expert at website design and maintenance.", "pics": null, "resp": {"time": 1560280022817, "text": "Thank you"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "114436750348961557152", "name": "MUNIR ULHAQ", "time": 1546887306938, "rating": 5.0, "text": "Very knowledgeable,and friendly person. Highly recommended", "pics": null, "resp": {"time": 1546888073863, "text": "It is great working with you."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "117641655909292696797", "name": "Whitney Sherling", "time": 1547754363062, "rating": 5.0, "text": "Tony is a great guy to work with and extremely knowledgeable. Do your business a favor and reach out to him for your digital marketing needs!", "pics": null, "resp": {"time": 1548618411405, "text": "Its been great working with you. looking forward to working with you some more"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "104328752808523125959", "name": "Chris Register", "time": 1536264705510, "rating": 5.0, "text": "The owner Tony truly knows what he is doing. My businesshas grown more than radio,tv or billboard.", "pics": null, "resp": {"time": 1536265356337, "text": "Thank you for the  great review 👍"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "116156058231170684913", "name": "Anthony Tec Tony Lloyd", "time": 1511975037173, "rating": 5.0, "text": "SEO/PPC SPECIALIST", "pics": null, "resp": {"time": 1511975372430, "text": "Thanks!"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "115383526427406646915", "name": "Michael Chancy", "time": 1567619111464, "rating": 5.0, "text": "Really knows what he is talking about.", "pics": null, "resp": {"time": 1567878202451, "text": "Thank you. It is great working with you"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "105931976750454029240", "name": "Bryan Carter", "time": 1623155067098, "rating": 4.0, "text": "Effective, Creative, Professional and Friendly.", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "112858475004646862511", "name": "J.L. Fisk", "time": 1533048744381, "rating": 1.0, "text": "Go Bell Media and Go Broke! Absolutely the worst investment I have ever made in Digital Marketing. Over my 13 years of hiring agencies I have had good ones and not so good. Bell Media LLC by far the worst. Certainly, the most expensive, saw the least amount of results. I left a good agency hoping to improve on my lead generation and my leads torpedoed digital and organic and never recovered. Nice slick presentations, videos and no results. It is as if they are learning and making it up as they go and experimenting with your ad dollars, and your livelihood.  Take note for a digital internet marketing company they have no place for reviews good or bad? They are not even a member of the BBB? That also keeps them from having to deal with unhappy clients and or reviews. These guys are awful and I can prove it.  Call me", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "116939636788288178614", "name": "Jon Doss", "time": 1558039654811, "rating": 5.0, "text": "My digital presence went from zero to hero with the help of BM!  I couldn’t be more excited except that keeping up with the new sales and traffic has been exhausting. My only regret is not becoming a customer sooner.\nJon D.\nBirmingham, AL", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "114204552143651632535", "name": "Dianna Lee", "time": 1533311123942, "rating": 5.0, "text": "We have been working with Bell Media for almost 10 years.  They have consistently been cutting edge, customer-service oriented and reasonably priced.  Bell Media is a great company with personnel who are very easy to work with!\nDianna Lee\nTroy Bank & Trust", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "109897514318275744504", "name": "Alan Craft", "time": 1533078506257, "rating": 5.0, "text": "Bell Media is a fantastic overall company from top to bottom. They’ve been instrumental to our business, during the startup phase and as we’ve grown. I’ve had the privilege of seeing the company grow and evolve over the years into a first class digital marketing company. I refer my small/medium size business clients to Bell Media without hesitation because I know they’ll receive top notch service delivered by professionals with an extremely high level of expertise.", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "108368421335316664470", "name": "Jessica Powell", "time": 1533327816703, "rating": 5.0, "text": "I love working with Bell Media!  My account managers are knowledgeable, personable and easy to work with. I could not recommend them more.", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "102857959969804383138", "name": "Ultraspy", "time": 1558072121936, "rating": 5.0, "text": "I’m very pleased with the support I received from the Bell Media team.  The response was fast and friendly. Thanks team!", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "101553463164070662355", "name": "stormtracker1", "time": 1558062771572, "rating": 5.0, "text": "The support team at Bell always does an awesome job helping me out with my website issues - I definitely recommend them!", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "108264065263985256386", "name": "Clay McInnis", "time": 1533086860984, "rating": 5.0, "text": "Bell Media is top notch! If you want an effective team and strategy behind your growth as a company or organization go with this company.", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "116941894678936395298", "name": "David Luddington", "time": 1558433440533, "rating": 5.0, "text": "Great service, Jake is always ready to help. Highly recommended", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "114358729809296924778", "name": "Julianna Kaye", "time": 1558114450800, "rating": 5.0, "text": "The help desk at Bell Media was polite and quick at fixing my issue!", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "104640243380005350590", "name": "Kimberly Mueller", "time": 1558225463307, "rating": 5.0, "text": "Was really happy with the service Jake Evans provided\nme!", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "106335980442213078128", "name": "Griffin Capps", "time": 1559251203200, "rating": 5.0, "text": "Bell Media makes fantastic websites and is extremely easy to work with.", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "106991314674904129131", "name": "Chip Gentry", "time": 1485311238337, "rating": 5.0, "text": "Unique advertising strategies with an ROI", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "110636705696727654118", "name": "pamela knight", "time": 1567557977415, "rating": 1.0, "text": "Annoying", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "117807557896104808508", "name": "Jason Kelly", "time": 1601574963836, "rating": 5.0, "text": "Strong Automotive works very hard for their clients, and have developed strong bonds with their media partners. Working with Strong, I am guaranteed detailed communications, and the items I need for a successful campaign are going to be delivered in a timely manner. I highly recommend working with them, if you need their services.", "pics": null, "resp": {"time": 1601647863712, "text": "Thank you for your review, Jason! Your kind words mean so much to us. We are so glad you have had a great experience working with us and we hope that never changes! Please let us know if there is anything we can do for you. Have a great weekend!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "118280099362659724572", "name": "Erika Rios", "time": 1574347688565, "rating": 5.0, "text": "I am thrilled to be part of this talented team that continually drives results for our clients. The work we do is valuable, and management recognizes us for our hard work. Not only does Strong value the importance of digital marketing, but we ensure our clients do through continuous learning. Our yearly Strong Digital Marketing Summit at Google's Headquarters is a prime example of it. We invite our dealers to come to learn about paid search, service marketing, YouTube pre-roll, and local marketing. I highly recommend working here or better yet hiring Strong to take your dealership to the next level.", "pics": null, "resp": {"time": 1574368118223, "text": "Thank you for your review, Erika!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "115066928371365438972", "name": "David McMath", "time": 1572385610581, "rating": 5.0, "text": "This place really knows what it's doing. In business since the 70s, STRONG has not shifted its focus to some distractingly shiny object and lost its way. STRONG has been helping individual car dealers advertise their businesses and they have just gotten better and better at it. From the Sunday papers in the way-olden days to the digital and social screens that are everywhere all day every day today, STRONG knows how to get the message out there. Good job, SAM.", "pics": null, "resp": {"time": 1572616874532, "text": "Thank you so much for your review and kind words! We're happy to have you on our team!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "108203104048157951893", "name": "Andrea M. Kring", "time": 1528944029715, "rating": 5.0, "text": "When we buy a car, we consider so many details that will reflect our individuality.  The make, model, color, price, even the tires are elements that ultimately reflect what is important to each of us.  Can you imagine not considering the engine?  What good is our vehicle if we don’t have structural integrity under the hood? It would be nothing more than a pretty yard ornament and certainly wouldn’t take you far.\n\nI was drawn to Strong Automotive because I could see it had structural integrity.  I watched the company for over a year before I decided to consider working with them.  On the exterior, it looked bright, energetic, and fun.  When I took a look under the hood, I found in this agency a diverse, highly creative, and dedicated group of people who want one thing:  to be kind of engine that drives customers to your product. Every department at this agency works closely together like a well-oiled machine (pun intended) that is always being tweaked and improved to make sure it runs smoother and faster than the day before.\n\nWhen you consider Strong to represent your business, you can know that the people who make up the company truly love what they do and they are excited about working for you.  Thanks to John Paul Strong, we have a work environment that allows us to be that high-quality engine you need to drive clients to your business. #WEARESTRONG", "pics": null, "resp": {"time": 1572530005412, "text": "Thanks for your review, Andrea!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "116027403893328586710", "name": "Luke Thomas", "time": 1530134089635, "rating": 5.0, "text": "To create the best product, you’ve got to have the best team. Strong Automotive Merchandising has got this down pat. The people behind this agency are friendly, creative, and diverse. Plus, the leadership understands how important it is to stay fresh with training, career development, and providing an awesome place to work.\nFor customers it’s a surefire way to drive traffic, for employees it’s a workplace full of opportunity. Either way, you can’t go wrong when you choose Strong.", "pics": null, "resp": {"time": 1572032482094, "text": "Thank you for your review and kind words, Luke!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "117772951541245199240", "name": "Michele Lee", "time": 1529615144614, "rating": 5.0, "text": "Strong Automotive Merchandising provides innovative, effective, and purposeful service to their clients. Not only does this company value their business with clients, but also with their employees - being named Birmingham's Best Place To Work. I highly recommend Strong to both client and future employee. Anyone would be lucky to develop a relationship with this great company.", "pics": null, "resp": {"time": 1572032497008, "text": "We appreciate it, Michele!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "105800213582110031720", "name": "Tony Lopez", "time": 1532004945941, "rating": 5.0, "text": "If you're an automotive dealer looking to drive results, look no further.  After 19 years of working to drive floor and web traffic for dealers,  I don't think I've worked with a team more dedicated to that.  They have a full understanding of what media needs to be used in each phase of the buying process.", "pics": null, "resp": {"time": 1572032444190, "text": "Tony,\nWe appreciate your review and kind words!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "100401235661534663638", "name": "Katherine Reeves", "time": 1527714843859, "rating": 5.0, "text": "Strong Automotive Merchandising is truly the only advertising agency of its kind. John Paul and his team’s deep knowledge and understanding of the Automotive industry make them uniquely qualified to service automotive clients. Strong is a full-service agency that is organized, efficient, and results oriented.", "pics": null, "resp": {"time": 1527778760951, "text": "Thank you so much for your review and kind words! We're happy to hear that you're pleased with the service we provide, and we love working with you."}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "101176373838177776957", "name": "Emily Johnson", "time": 1572616517917, "rating": 5.0, "text": "Strong Automotive is a great place to work that really cares about both their customers and their employees.", "pics": null, "resp": {"time": 1572706818964, "text": "Thank you for the review, Emily!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "112740085981900133702", "name": "Mimi Hoffman", "time": 1528402336355, "rating": 5.0, "text": "Strong Automotive Merchandising is not only an exceptional and very successful company, but an ideal place to work. Everyone here is very friendly, and works extremely hard to meet and exceed our client’s expectations!", "pics": null, "resp": {"time": 1572530022307, "text": "Thank you for your review and kind words, Mimi!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "109774611003589577684", "name": "Nathan Phillips", "time": 1470843168766, "rating": 5.0, "text": "Full service automotive merchandising solution company offering traditional marketing channels plus world-class Google Premier Partner certified digital marketing. I'm incredibly proud to be part of such a team and a movement that exceeds auto dealer's merchandising needs!", "pics": null, "resp": {"time": 1572530057703, "text": "Thank you for your review, Nathan. We love having you on the team!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "100014998391677947483", "name": "Scott Rossi", "time": 1422229801121, "rating": 5.0, "text": "I have been a client with Strong since 2006. They never have failed to produce.", "pics": null, "resp": {"time": 1572530072027, "text": "Thanks for your review, Scott!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "112083818066161244987", "name": "Aritro Ghosh", "time": 1415792288784, "rating": 1.0, "text": "They suck!", "pics": null, "resp": null, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "111818947664867883602", "name": "Moises Gobin", "time": 1540573850921, "rating": 5.0, "text": "Great and affordable digital agency. I have used their marketing services for over 3 years and can not complain at all. I would recommend Jan and his team to anyone.", "pics": null, "resp": null, "gmap_id": "0x888928b2efb5491f:0x114cf3cb2bf5025f"}
{"user_id": "111170405108943276817", "name": "Jerry Montalbano", "time": 1533754277828, "rating": 5.0, "text": "Jan and his team has worked for my business over 8 years already. He has been taking care of my entire marketing, can't imagine making any profit without him. IMCastle LLC is also extremely affordable in comparison with another companies in Shelby and Jefferson County, Alabama. I get many phone calls thanks to IMCastle LLC. I recommend IMCastle LLC who needs help with local marketing.", "pics": null, "resp": null, "gmap_id": "0x888928b2efb5491f:0x114cf3cb2bf5025f"}
{"user_id": "101633521291959258699", "name": "SOUTH CALERA TOWING TERRY SIMS", "time": 1550004955089, "rating": 5.0, "text": "I have called several companies to help me out with google business listing. Everyone wanted $199 to $499 a month. I tried to call Google too. I got so frustrated untill I called Jan from IM Castle LLC. He set us up in very short time and charged  us one time reasonable fee. I would recommend IM Castle  LLC to anyone.", "pics": null, "resp": null, "gmap_id": "0x888928b2efb5491f:0x114cf3cb2bf5025f"}
{"user_id": "104957430513907337960", "name": "Aprilmayorjune Usrey", "time": 1546237421963, "rating": 5.0, "text": "Beautiful clean large lake.   Perfect for jet ski with tubing or skiing.  Jet skis are lots of fun.    Fishing is abundant with many small coves just made for a fishing boat.  Sandy areas for swimming & camping along islands on the lake.  Water is very clean. Several marinas on this large lake, lots of stores & restaurants.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOpFkBxQ4IGhSD3Ue-PrNbxAvFNfIB7Ool0qhoi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOfJkW5j1ZmUJb9jGIGXNAa9CFwhiLXMGugSqNh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNGBlz_NV30NLHvd59XsaM3swLBlktyCyznCNHX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMV1wFeJ1SYpJhFJRnT_CMlTgIn3m5rFl--fcvX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMgRpWxlpplc7eamJiLZjuWLuDHPIRpZ0IqEwVx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPOzrcaPP1uAETsOfQSQdtRxg1Nd_dlSrsLLO3b=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNo6544OnI-cEfLgEU1xt64gLQ9rXp6PgfSy0ot=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMSFiFL1UFYoRAq7XuzEQsduz3AfCCN6KWWU5-j=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMWoea4Of24sa_Km_w_xDtfjJMxgTZS-yQMXGLd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOuKYesGoekikQQ9gEJ0B24g_j_xRwjFtOxqa86=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN5tzlA9zFYpfrxQnE1krQbHvV6bhySUAVmMe_C=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMU6mbrXAsJY90I1FanBNzKgKU1mdDKzpBoxZVE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPin3MEtO96G2vSHNgMeqEu5c-u9Kn_qk0Sjd7B=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNxts5xzALewZfjbhFJ8X8SryFCbcZ0Ug9S-Jaj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPGYwOT5kQvSTJztOhMbsVOz2nR_88nmya73682=w150-h150-k-no-p"]}], "resp": {"time": 1623866550963, "text": "Thank you for rating Lake Martin. Remember our website is www.LakeMartin.com."}, "gmap_id": "0x888c1225fe1bcdd9:0x5408efbd14bebcec"}
{"user_id": "109096020455247391771", "name": "R T", "time": 1500305955112, "rating": 4.0, "text": "Peaceful vacation spot.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMOuZigabkMC8bodLesBY9chZF-bpjfzFcy_h8_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMEx7djmyHiITgcp3S79c38CbJFZVQDndUn_T62=w150-h150-k-no-p"]}], "resp": {"time": 1623866564825, "text": "Thank you for rating Lake Martin. Remember our website is www.LakeMartin.com."}, "gmap_id": "0x888c1225fe1bcdd9:0x5408efbd14bebcec"}
{"user_id": "101894572118301832321", "name": "Ken Kelly", "time": 1502642592788, "rating": 5.0, "text": "Great lake!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNp7a8fo7jDwJFnmTZjqgQDPtfPPyGiyXPM5jlg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNTOPkT1eMzi7n4w1rN01it30ZZLv0fiJE_TB9y=w150-h150-k-no-p"]}], "resp": {"time": 1623866561319, "text": "Thank you for rating Lake Martin. Remember our website is www.LakeMartin.com."}, "gmap_id": "0x888c1225fe1bcdd9:0x5408efbd14bebcec"}
{"user_id": "108098973863904659928", "name": "Josh Mixon", "time": 1444181436480, "rating": 5.0, "text": "This is a fun family friendly place to go. My wife and I have a house here. There is plenty to do. You can swim and kayak. Our favorite place to eat is at chucks marina. My kids and I like to go to chimney rock. This is a for sure thing to do. You can just dock your boat and let the kids roam. I would definitely recommend going here for a family vacation.", "pics": null, "resp": {"time": 1623866572600, "text": "Thank you for rating Lake Martin. Remember our website is www.LakeMartin.com."}, "gmap_id": "0x888c1225fe1bcdd9:0x5408efbd14bebcec"}
{"user_id": "107632007687285362034", "name": "Timothy Blackmon", "time": 1526869618709, "rating": 5.0, "text": "Beautiful lake, great for boating, tubing, jetskiing or find a quiet cove and float and swim. Fishing can be hard since the water is clear but jsut cast away you might get lucky.", "pics": null, "resp": {"time": 1623866557384, "text": "Thank you for rating Lake Martin. Remember our website is www.LakeMartin.com."}, "gmap_id": "0x888c1225fe1bcdd9:0x5408efbd14bebcec"}
{"user_id": "104248126637153268070", "name": "Jeremy Patton", "time": 1598969945701, "rating": 5.0, "text": "Great team that helps this small business owner in my weakest area....The IT department!", "pics": null, "resp": null, "gmap_id": "0x88626b9aadf196a7:0xfc9408f730627ac3"}
{"user_id": "115520996708899284368", "name": "wendy pope", "time": 1544634107971, "rating": 5.0, "text": "very responsive and knowledgeable, maintains our network security", "pics": null, "resp": null, "gmap_id": "0x88626b9aadf196a7:0xfc9408f730627ac3"}
{"user_id": "101094930589118909455", "name": "N S", "time": 1610660326681, "rating": 5.0, "text": "Excellent work, exactly what I wanted. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114261246968034770738", "name": "Jason Elmer", "time": 1582761393136, "rating": 5.0, "text": "Web Detail has been great to work with. Being a small business, I did not have the budget for a full-scale website. Jerimy and his team were there to listen to my specific needs and helped develop something that was just what I was needing for right now that can be built upon. From start to finish the process was very quick.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "104913583038605846920", "name": "Sue R", "time": 1594581970239, "rating": 5.0, "text": "WebDetail has done a fantastic job designing our website!  Jerimy and his team are very responsive if we need to make changes and outstanding to work with! We are very happy clients of WebDetail!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "116205120835683811979", "name": "Sean Lee", "time": 1579616634524, "rating": 5.0, "text": "WebDetail does a great job designing and setting up websites.  They have a lot of good ideas.  Jeremy is very responsive and easy to work with.  I will continue to utilize WebDetail for all our needs.  Thanks for a job well done!\nSean", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "115996356981222899046", "name": "SHANNON MCKEE", "time": 1582832316864, "rating": 5.0, "text": "Jerimy does an OVER THE TOP JOB!  He designed a website above and beyond what we had in mind.  Very professional, reasonably priced and excellent quality.  Would highly recommend him!  Very Very Happy Customer!  thefootclinic.us", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "109190100812205585954", "name": "Haley Baron", "time": 1583159740278, "rating": 5.0, "text": "Jerimy and his team have been phenomenal. One of the things I love most\nabout WebDetail is how quick they are in responding to emails AND how quick they make the adjustments you need on your website. I would recommend to anyone!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "106718618561893959853", "name": "ABC Cleaning and Restoration", "time": 1564612648089, "rating": 5.0, "text": "Jerimy has helped with various marketing strategies and insight on helping our business continue to grow its online presence. It’s been great working with him and his team. Certainly recommended!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "118284671236130426430", "name": "Michael Owens", "time": 1591295730241, "rating": 5.0, "text": "WebDetail LLC designed a professional webpage for our counseling practice in Alabama. We would strongly encourage talking with them if you want to take your business/webpage to the next level!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "108932407904691001085", "name": "Ashok Mahbubani", "time": 1560725021883, "rating": 5.0, "text": "Enjoyed working with Jerimy Lee on improving and updating our websites. He was attentive, informative and offered thoughtful ideas & options. He responded well to our requests for change and helped us meet challenging timing goals.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "107726332193636795174", "name": "Kenneth Winton", "time": 1579619285732, "rating": 5.0, "text": "WebDetail has done a fantastic job with our business website.  It is constantly updated and optimized to give our patients the best online experience and information.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "110626101940050352084", "name": "John Conway", "time": 1581698289524, "rating": 5.0, "text": "Jerimy was very easy to work worth and did a fantastic job!  I highly recommend WebDetail for website development!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "100373388406679517445", "name": "ironsclad", "time": 1579616530589, "rating": 5.0, "text": "Complete rebranding of my business - Irons Distillery - was done by WebDetail.  After having a attic webpage for over 4 years, it was time for a total makeover of my website.  WebDetail was able to take what I discussed with them and turn it into real product - and more than “eye candy” - it was a webpage that tells our entire story and allows excellent interaction with customers.  Check it out at ironsone.com - excellent work!!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "112934247421951823378", "name": "RAE RAE", "time": 1522766325827, "rating": 5.0, "text": "This company does a wonderful job managing and helping me with my company website.  They are patient, courteous and professional and always have time to help me with questions about the site, as well as update me on the newest and latest thing that I need to be doing.  I'm not that computer savvy so it's nice to have someone to count on.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "106803349109772970855", "name": "Matt T", "time": 1560863700511, "rating": 5.0, "text": "Extremely happy with the WebDetail team.  We hear from all our customers how much they like our site and how easy it is to navigate.  Five stars!!!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "105234704733787751409", "name": "Ellen Cozelos", "time": 1561738193154, "rating": 5.0, "text": "They did a WONDERFUL job on my new website!  Have had such a great experience with them", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "102387596088737912825", "name": "Bob Benton", "time": 1560362932614, "rating": 5.0, "text": "Webdetail is my \"go-to\" resource for all things web and social media. Their professionalism, combined with deep experimental knowledge and integrity guarantee me the best possible outcome for my clients, regardless of the size of scope of the project. Sincerely Bob Benton - CRE8IVE Branding.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "116108691609514910280", "name": "jenny mitschelen", "time": 1561399306657, "rating": 5.0, "text": "Jerimy & his staff are the best. We received incredibly friendly & professional service. Jerimy was always available to answer questions during the building of my website. Our planning meetings were fun & efficient. The staff understood my brand & vision & brought it to life. I definitely recommend the investment in having WebDetail polish up your online image!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "110337181174330128258", "name": "Russ Russell Commercial Real Estate", "time": 1560435277137, "rating": 5.0, "text": "Jerimy and crew go the extra mile to ensure you have the best quality service and product available!  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "118309393381061308054", "name": "Brent Hunt", "time": 1560426679691, "rating": 5.0, "text": "My business recently needed to update our website, and after much consideration and research, I decided to try WebDetail.  From the beginning, Jerimy and crew were very patient with me.  Together, we were able to capture exactly what I had in mind from the beginning, plus some added bonuses that were suggested to me by WebDetail.  Everything was done on-time and for a very reasonable price.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "116334689896599768559", "name": "david houser", "time": 1555603649238, "rating": 5.0, "text": "Web Detail did an awesome job on our website and is always very helpful.  They are great to work with.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "111472132666586962898", "name": "SWEET ROCK BAPTIST CHURCH", "time": 1518810263302, "rating": 5.0, "text": "Very nice company to do business with.  Jerimy has been very attentive to our needs and does a great job any time we ask for any changes to our site. Outstanding service and very happy with the service they provide.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "108974017083196184930", "name": "Helen McNamara", "time": 1471967972641, "rating": 5.0, "text": "Great and very detailed service. So very happy with everything he has accomplished with my business. So excited to see how far WebDetail will grow my business. Always completes task super fast. Best company ever!!!", "pics": null, "resp": {"time": 1472573566585, "text": "Thank you Helen!!  It's truly been a pleasure working with you thus far!  You have a fantastic and fun business, and I'm proud to be helping you take things to the next level :)"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "100675740381714374023", "name": "Chuck Bailey", "time": 1560481328198, "rating": 5.0, "text": "Alabama FairTax needed a website several years ago, so the hunt for a web designer ensued.  We needed a comprehensive site to get the word out on the national FAIRtax, and of late, The Alabama Economic Freedom Act.  The result was consultation with Jerimy Lee and kick-off of the site design.  He is easy to work with and backs up the work he accomplishes.  The work was successfully completed In good time and the site successfully launched.  Further, Jerimy “services what he sells” and that is much appreciated.  Trust Jerimy with your digital design needs.  We do!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114707576224750382190", "name": "JoAnna Wright", "time": 1507814790550, "rating": 5.0, "text": "Awesome group! WebDetail has been an immense help to my company's website, social media platforms, and digital marketing. They offer experienced insight and are willing to go the extra mile to get the job done. Highly recommended!", "pics": null, "resp": {"time": 1510669238612, "text": "JoAnna, thank you!  It's been great working with you on SO many projects :)  LOTS more are in the works currently and queued up afterwards!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "113710098397437759369", "name": "Mike Murdock", "time": 1500667270709, "rating": 5.0, "text": "I've been working with Daniel Horton since before he joined WebDetail, and always enjoyed collaborating with him. Daniel really \"gets it\" and has helped us promote our organization to the whole community. I'm always pleasantly surprised by the response that Daniel's work elicits.", "pics": null, "resp": {"time": 1509109703176, "text": "Mike, thank you for the comments!  It's been an absolute pleasure working with you and the team at Huntsville STEAM Works!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "118226670515846768597", "name": "Brooke", "time": 1579636223583, "rating": 5.0, "text": "WebDetail has been such an asset to the development and ongoing production of our website and online marketing plan.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "111054440623475764212", "name": "Jeremy Lihte", "time": 1560362021334, "rating": 5.0, "text": "The group at WebDetail has been a life saver on countless occasions for myself and the organization that I would with. I am an on the ground marketer for a group of health centers in the SouthWest. Without Jerimy Lee and the incredible team at WebDetail, my job would be impossible. Thats not even mentioning the incredible work they have done for us with our online platforms.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "103199170697977985185", "name": "Yvette “Fanci” Kelley", "time": 1495137547326, "rating": 5.0, "text": "It's great! This site helps you locate Businesses as well as promoting yours", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "103899886446719253667", "name": "Brad G", "time": 1501271976446, "rating": 5.0, "text": "WD helps a number of my organizations get their social media handled in a manner that's both creative and efficient. Would recommend their team for your next marketing endeavor.", "pics": null, "resp": {"time": 1510669125545, "text": "Brad, it's been great working with you thus far, and it's only the start of many more incredible opportunities!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114286044098706377322", "name": "Toni Eberhart", "time": 1501272463415, "rating": 5.0, "text": "WebDetail, LLC. is fantastic digital marketing agency to work with. They completed a video project for our organization and it turned out wonderfully. It communicated our story in a visually pleasing and captivating way. The turn around was very quick and reasonably priced. I recommend working with Daniel and Jerimy.", "pics": null, "resp": {"time": 1509109840743, "text": "Toni - we have had an amazing time working with you and Urban Engine!  Excited to see Urban Engine continue to bring great things to the community!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "111446099134632256156", "name": "We Run Huntsville", "time": 1501273877686, "rating": 5.0, "text": "Webdetail is great! They have not only guided us through some challenging times, but have also produced a video that reflects the  essence of our company.  I have been pleasantly surprised at the amount of insight that they have in to the workings of internet marketing. This is a valuable resource that is not to be discounted. Thanks for a great job guys!", "pics": null, "resp": {"time": 1509109915108, "text": "Gregg, we have had a blast working with you on the video projects!  You are doing some fantastic work with We Run Huntsville!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "111020432325955845497", "name": "Greg Austin", "time": 1518127301083, "rating": 5.0, "text": "Jerimy Lee and his team are the best! Friendly, cooperative, super-intelligent, and hard-working, WebDetail will design you a great website and help you perfect it! I couldn't recommend them more highly.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "109534575083022206545", "name": "Andy Johnson", "time": 1480608976682, "rating": 5.0, "text": "WebDetail has been awesome! Jerimy Lee is extremely professional and easy to work with. Always seems to be available when needed. Great company that I would recommend to anyone needing an amazing website.", "pics": null, "resp": {"time": 1480610590149, "text": "Andy, many thanks!  It's been great working with you guys as well!  I'm looking forward to seeing IES grow and succeed!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "100147673057330676819", "name": "Brooks Bryant", "time": 1464206473277, "rating": 5.0, "text": "Jerimy at WebDetail is very professional and easy to work with. The website he created for my business has helped me immensely!", "pics": null, "resp": {"time": 1464213017557, "text": "Thank you Brooks!  Certainly glad we are able to help, and we appreciate your business!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "113316583948192656382", "name": "Nelson Alvarado", "time": 1562602254409, "rating": 5.0, "text": "The staff is awesome and  very professional.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "118026746030869170702", "name": "Brian Hughes", "time": 1500497169568, "rating": 5.0, "text": "I was using a different web designer in the past that was not meeting the needs of my business. Since switching to Webdetail, everything has been smooth and reliable. Jerimy is a skilled and efficient designer and very easy to work with.", "pics": null, "resp": {"time": 1501080165631, "text": "Thank you Brian, I appreciate your business and it's been great working with you guys as well!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "104455046540160577381", "name": "Beth Jett", "time": 1464909157763, "rating": 5.0, "text": "Jerimy is an excellent web designer and very knowledgeable of all of the online strategies to attract users to our website. We are complimented often on how nice our site looks and how easy it is to navigate. He's very proficient and stays current with the constantly changing algorithms of the popular social media venues, teaching us how to and assisting us in capitalizing on SEO. Highly recommended!", "pics": null, "resp": {"time": 1464967479920, "text": "Thank you Beth! It's been a pleasure working with you, not only with updating the new website but also working with you on the SEO and social media side of things!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "110964270584795483257", "name": "Ronnie Kimbrough", "time": 1500480683023, "rating": 5.0, "text": "Great company, we have worked with Jerimy and his staff for last 3 yrs, very pleased with their service!", "pics": null, "resp": {"time": 1501080114467, "text": "Hey Ronnie - many thanks!  It's really been fun working in such an exciting industry - archery and hunting!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "113111821263432371281", "name": "Kenny Wood", "time": 1521566528707, "rating": 5.0, "text": "The folks at WebDetail do a great job.  They live up to their name and focus on the Details.", "pics": null, "resp": {"time": 1521567591806, "text": "Thank you Kenny!  We try to ensure everything is as it should be lol!  Always fun working with you!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114527104744488595419", "name": "mark Barlow", "time": 1498794292084, "rating": 5.0, "text": "I am impressed with Jerimy, more business professional, Marketing savvy than a typical \"web\" man!", "pics": null, "resp": {"time": 1499121147242, "text": "Mark, it's been great getting to know you and  your business!  I look forward to a long lasting business relationship!  Appreciate your business!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114068053410951848338", "name": "Marie Constantinou", "time": 1483656316602, "rating": 5.0, "text": "There are companies out there that make promises they just can't keep.  WebDetail is NOT one of those companies.  Their friendly and professional service is a breath of fresh air.  The results we have had since linking with WebDetail are outstanding and, quite frankly, unbelievable.  I would recommend WebDetail to any business; big or small.", "pics": null, "resp": {"time": 1483824514602, "text": "Thank you Marie!  It's always exciting working with you as well!!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "111293686069620554703", "name": "Donna Robinson", "time": 1464199124662, "rating": 5.0, "text": "WebDetail designed and developed a website for our local chapter of an international non-profit organization and the results were exactly what we wanted.  Jerimy Lee is excellent to work with - very patient and easy to understand for a web novice like me.  When the website was ready to go, he trained several of us on how to make edits on our own so we don't have to bother him all the time.  The way the website was developed makes it very simple and easy for us to edit and add data.  We highly recommend WebDetail for any web development or modifications you need.", "pics": null, "resp": {"time": 1464212981766, "text": "Thank you Donna, for the kind remarks!  As always, we very much appreciate your business!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "106008081027680808414", "name": "Kathey Hamer", "time": 1522087223152, "rating": 5.0, "text": "Executive Women International, Huntsville chapter, was fortunate to learn from Jerimy and Sio'Bhan as our March meeting program/speakers.  WebDetails gave an excellent program on social media platforms. They\nhad EWI members totally engaged as they gave interesting statistics, great advice and information regarding which platform would best meet our needs.  They left us all eager to learn more!  EWI of Huntsville has found a social media, webpage, etc., Connection. We highly recommend WebDetails.  Thank you, Jerimy & Sio'Bhan\n\nEWI BOD\nState Farm, Lara B. Sterling\nJ.R. Enterprises, Margaret Watson\nChamber of Commerce, Pammie Jimmar\nWoody Anderson Ford, Kathey Hamer", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114744844077008166521", "name": "John Molnar", "time": 1480622197799, "rating": 5.0, "text": "Working with a great company is always a good experience, but working with great people is what really makes for a good relationship.  I am so lucky to find both together, here at WebDetail. Jerimy has been both a seasoned professional and a good friend, he is always there for us to answer any question and gives great advice.  Thanks Jerimy!", "pics": null, "resp": {"time": 1482438731272, "text": "Thank you John!  I cannot believe we've been working and dealing together for almost 10 years!!  Thank you again and I wish you all the best!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114268678467562339658", "name": "C Marino", "time": 1480708535931, "rating": 5.0, "text": "Jerimy at WebDetail is awesome  and a total professional Webmaster.\nyou can count on him.\n\nC Marino    Chicago IL", "pics": null, "resp": {"time": 1482438626629, "text": "Carlos, thank you and it's always a pleasure working with you as well!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "117338195291034601019", "name": "Karol M.", "time": 1467824474292, "rating": 5.0, "text": "WebDetail worked well with us to design our business' web-site.  We were extremely specific in what we wanted and Jerimy worked very hard to make sure our needs were met.  We have had great results what few times we've needed maintenance performed on the site.  The site designed by Webdetail is very functional and can be edited easily by our staff to keep it our company's information current.", "pics": null, "resp": {"time": 1467905810688, "text": "Thank you Karol!  It has truly been a pleasure to work with you, Ray and your staff over the years!  Tempforce epitomizes character and values, and it shines through with how successful you have been!  I'm glad to have been able to help where we can.  Again, many thanks!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "111006006727255089842", "name": "Bob Williams", "time": 1500309709056, "rating": 5.0, "text": "I have had several other websites and I have been working for 5 years with Jerimy of WebDetail as my webmaster for multiple sites. He has been very professional and also personally helps me in many other ways.  We are producing a large worldwide marketing program that covers almost all needed for a very productive site. He also handles the SEO, E-commerce, et al. And we are in different states!", "pics": null, "resp": {"time": 1501080051464, "text": "Thanks Bob!  It's been a fun ride working on all the various projects throughout the years!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "116031216443385728740", "name": "Joe Shinkle", "time": 1498687381139, "rating": 5.0, "text": "Jerimy is very skilled, efficient, and great to work with! I will do business with WebDetail again!", "pics": null, "resp": {"time": 1499121111230, "text": "Thank you Joe -- Always a pleasure working with you!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "105870028499102857029", "name": "Larry Marsili", "time": 1464968829254, "rating": 5.0, "text": "I've been very happy with WebDetail's handling of multiple sites for me.  Not only do I use them for my law practice, but also for an unrelated business venture.  I've found Jerimy to be very prompt in responding, as well as knowledgeably and helpful in advising what steps I need to take to optimize my website's effectiveness.  I would recommend Jerimy and his team at WebDetail to anyone looking to start up with a website from the ground up, or anyone that is looking to improve their overall web presence.", "pics": null, "resp": {"time": 1465843125479, "text": "Thank you Larry!  Always a pleasure working with you -- on your numerous business ventures!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "116836471428552388808", "name": "John Crocker", "time": 1466087795559, "rating": 5.0, "text": "The design and quality our office has received from Webdetail for our website needs is simply excellent. I highly recommend Webdetail for all of your company's Webdesign needs. They are simply the best.\nJohn Crocker", "pics": null, "resp": {"time": 1466444222169, "text": "Thank you John!  I've certainly enjoyed our working relationship and certainly appreciate your business!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "101340839177883447969", "name": "Shelley Fraser", "time": 1555079596412, "rating": 5.0, "text": "Webdetail created and manages our company website. Any issues that come up are handled quickly and professionally.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "102672572275088400417", "name": "Pro Coat (Fabrication)", "time": 1568472017077, "rating": 5.0, "text": "Most of the advertising sales reps and web design wannabes we spoke with were more interested in showing off what they can do. Bizeeo was first and foremost concerned with providing us with the marketing services we needed to succeed. They spent a LOT of time at our shop learning about our products, services, equipment, and procedures BEFORE formulating an online marketing strategy or beginning development on our website. Their no-nonsense, systematic approach to business promotion was unique and refreshing. If you're only interested in a service provider who builds cool, trendy websites, look elsewhere. If you need a marketing professional, who knows how to promote your business on the Internet, contact Bizeeo Marketing Agency!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPWkqKLlarTcCWZG2m80s2bdwJlKnEoImxKK0rU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "111794181733632536439", "name": "Steve Sanders", "time": 1620750996317, "rating": 1.0, "text": "We were promised we would own the website and domain name after our 1 year contract. 3 years later, we still don't own anything. HORRIBLE experience.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "103788935114690151706", "name": "Chris Tarantino", "time": 1616900105544, "rating": 5.0, "text": "Vernon is knowledgeable and helped us transfer an old business we bought.  Very helpful and nice to work with.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "107140978127037205310", "name": "Ariaa Jaeger", "time": 1604165024615, "rating": 5.0, "text": "Vernon Blake was amazing, he was able to guide me through the process of optimizing my search details which will really help increase my online profile. I am more than delighted with his professionalism and knowledge. I highly recommend Vernon and the team at Bizeeo Marketing for all your marketing needs!", "pics": null, "resp": {"time": 1604168554701, "text": "Hi Ariaa, thank you for a great review! We're always impressed when a friend has their own \"knowledge panel\" on Google's search engine results page (SERP). Glad to see you were able to claim, verify, and update your panel. It looks better than ever! One day we hope to be as famous and influential as you are to warrant our own Google Knowledge Panel. Shelley and I genuinely appreciate your kind words and for taking a moment from your busy schedule to publish a 5-star rating."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "116265173786253037833", "name": "Bailey Duos", "time": 1582048350726, "rating": 5.0, "text": "\"Bizeeo is knowledgeable, professional, caring and attentive. They created my online presence from scratch and far exceeded my expectations! I definitely recommend them for any of your marketing needs!\"", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114002054062801087550", "name": "Ladonna Idell", "time": 1559079772561, "rating": 5.0, "text": "This is a follow up rating from my extensive experience interacting with Bizeeo. I don't know what I would have done without his help. He does a great job explaining what he is doing and how we can better manage our online presence.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114248760755282091601", "name": "Linda Preskitt", "time": 1569593072359, "rating": 5.0, "text": "I am completely connected to the \"Why\" of my business but as a startup sole proprietor I was desperate for someone that could help with how.  Vernon went beyond in expertise and for the first time I felt I had a partner, someone that believed in what I am doing, someone to provide the how.  If you are searching for excellence, knowledge, honesty, and a timely response, this is your Agency.  There is no better partner for your business.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "101369889282048456920", "name": "Shelley Kim", "time": 1582062668847, "rating": 5.0, "text": "I can truthfully say that Vernon is the most honest and knowledgeable online marketing specialist I know. He keeps up to date with the latest ‘trends’ by doing research daily, and, having a project management background, can create and maintain websites - and manage their SEO, for ANY industry, from schools to law to restaurants to therapists.\n\nHe’s not about the “bells and whistles” - that doesn’t bring you business - he’s about driving business to you through his online marketing work.\n\nIf he doesn’t think he can improve your sales by driving customers to your business, he will tell you - and tell you which is the best route for you to follow.  It’s not often that you find someone that ethical these days.\n\nHonestly and trustworthiness, good work ethic and values are rare commodities these days and I’m so glad that Vernon and Bizeeo have these strengths.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "108175476955979403510", "name": "Mila Ivanov", "time": 1567014409525, "rating": 5.0, "text": "He is very professional and excellent  job fixing my website and fcbk . And he can explain clearly, what need to be done. Thank you so much Bizeeo for helping me. You do Great!", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "108986317786183923860", "name": "Allison Shoemake", "time": 1566391068267, "rating": 5.0, "text": "Hey Everyone,\n\nRarely do I write reviews.  However, I did want to take time to acknowledge and show appreciation to our web designer and friend Vernon Blake.  He has done such a great job with our website.  One thing I like most about his work is that he takes the time to try and put in layman's terms the improvements that he is making.  Honestly, some times I get  it  and sometimes I just see the results!  Since partnering up with Vernon I definitely love how our website looks and functions but most of all I am seeing results with more people finding our business, more people contacting us through the website - which has resulted in more customers coming to the business!  And that is worth a thousand words.  Great job Vernon!\n\nThank you\nAllison Shoemake\n\n--", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "101901305400555139471", "name": "linda teel", "time": 1533221883149, "rating": 5.0, "text": "Vernon and Shelley @ Bizeeo are true webmasters!!  They have changed the face of our practice.  We are much more streamlined and efficient thanks to their guidance.  I cannot tell you how much we love them!", "pics": null, "resp": {"time": 1557590913159, "text": "Hi Linda, thanks for giving us a 5-star rating! It's a real pleasure working with you and your Montgomery staff. We really appreciate how you guys are always open to new ideas and receptive to change, which has paid BIG dividends for all of us. Who knew how a simple strategy of converting paper forms to online web forms would have such a tremendous impact generating new leads? Thanks again, we look forward to a long and prosperous relationship..."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "110986579158477488673", "name": "Ed Shoemake", "time": 1565482037996, "rating": 5.0, "text": "We have been using Vernon for sometime now.  We are very happy with our website and the way it is being handled.  We would recommend Bizeeo Marketing Agency for your business as well. ed--", "pics": null, "resp": {"time": 1557589509622, "text": "Hi Ed, thank you for the nice review! We appreciate you giving us the opportunity to provide online marketing services for your Montgomery business. It's a real pleasure working with local small business owners like yourself (and Allison), and we look forward to a long relationship."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "104776573168192410939", "name": "Peggy Raines", "time": 1559102140605, "rating": 5.0, "text": "Vernon is very knowledgeable, helpful, polite, and professional. I have been very satisfied with his recommendations and service.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "115875958919930114222", "name": "PMMW Lewis", "time": 1551983286377, "rating": 5.0, "text": "Mr. Vernon Blake helped me in such a tremendous way!!!! Kindness is becoming very rarer theses days, especially in businesses but this proves that they’re still some good businesses out there with kind people!!!!", "pics": null, "resp": {"time": 1557589168969, "text": "Hi P Lewis, thank you for taking the time to leave a 5-star review! Good luck with your marketing plan and please let us know if we can assist you in the future."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "102950740138757252851", "name": "Train2Win Institute", "time": 1495898023883, "rating": 5.0, "text": "We hired Vernon to explore the possibility of creating a membership website for our company... Train2Win Institute. I can tell you this was a huge undertaking and Vernon was unwavering and patient in this process. If I could describe Vernon's greatest quality it would be patience, followed by a great desire to complete the job with excellence. Vernon does not settle for mediocrity. It was our pleasure to get to know Vernon and If you want excellence...Then Hire Vernon Blake!\n\nGreg Imhoff\nPresident\nT2W Institute", "pics": null, "resp": {"time": 1514318572562, "text": "Hi Greg & Suge, thank you for the kind words! The pleasure was all mine. You guys are a top-notch organization and provide a valuable service for your clients in Alabama (or wherever in the world they are located). I learned a lot while working with you and enjoyed being a part of your bilingual web design and marketing \"team,\" if only on a temporary basis. On behalf of Bizeeo Marketing, we genuinely appreciate you taking the time to leave your gracious review and 5-star rating!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "100101481190782468781", "name": "William Runningwolf", "time": 1540996333260, "rating": 5.0, "text": "Vernon Blake is a real find! Competence, excellence, technical wizardry, and impeccable integrity. AND he produces real results. You won't find a better man out there. Stop looking, you've struck gold. He helped me out of a jam without asking for any compensation, just because he cared.", "pics": null, "resp": {"time": 1557590528570, "text": "Hi Will, thank you for the great review! I'm glad we were able to help you out of a sticky situation and very sorry that unscrupulous \"marketing consultants\" tried to take advantage of you. On the upside, we were thrilled to meet one of the most talented authors/content developers (Hi Maryla) we've encountered in a long time! Look forward to working with you on some content marketing projects in the future!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "117872439740702695413", "name": "Linda Holmberg", "time": 1409024444241, "rating": 5.0, "text": "I approached Vernon after hearing him speak at at a counseling workshop.  He was approachable, kind and seemed knowledgeable about marketing online.  When I decided it was time to market my practice I turned to Bizeeo.  It has been a very pleasant experience!  Vernon asked questions about myself and the way I wanted to grow my practice.  I was impressed with the amount of research he conducted in order to present a professional presence. He appears to care about his clients, desiring to serve them the best way he can.  Best of all, his work began bringing in business almost immediately and paid for itself within just a few months! He and Shelley are warm, personal, professional, and serve up a great cup of coffee!  I highly recommend them!!", "pics": null, "resp": {"time": 1409033878375, "text": "Hi Linda! At Bizeeo Marketing, we make every effort to understand your business services and products, as well as your short and long-term goals. Hearing that our marketing services more than paid for themselves in such a short time-frame MADE OUR DAY! It confirms that strategic planning, recognizing the untapped potential of the web and applying targeted marketing techniques has the potential to produce quick results in many industries. We truly appreciate you and your business and look forward to serving you in the future. And we always enjoy our coffee breaks! Thank you for taking time out from your busy schedule to leave a review. Vernon Blake - Web Design & Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "102219555799163263597", "name": "Rebekah Clark", "time": 1470699866362, "rating": 5.0, "text": "Vernon and Shelley designed my web page a few years back and were great to work with. They listened to what I wanted on the site and then offered additional suggestions based on their knowledge and experience. The site turned out great and I would definitely use them again.", "pics": null, "resp": {"time": 1514319305532, "text": "Hi Rebekah! Bizeeo Marketing enjoyed designing your website and providing online marketing services for your Prattville, Alabama counseling and therapy practice. Our working relationship has been a long one, and it's been exciting to watch your business grow and prosper. Thank you very much for sharing your experience with us and posting your kind review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "108236639786184597708", "name": "Frances McGowin", "time": 1409703615728, "rating": 5.0, "text": "\"K-9s 4 Kids and Heroes\" is now #1 on the search engine results page in our category because of Bizeeo Marketing Agency. Bizeeo volunteered their Website Design and Internet Marketing Services beginning early in 2014. We now have a professional, functional website that is informative and directive. Any non-profit or business knows the value of an online presence that contributes to your overall mission, goals and success. Thank you so much Bizeeo!", "pics": null, "resp": {"time": 1514320263355, "text": "Hi Frances! Bizeeo Marketing considered it a privilege to donate our marketing services to such a worthy cause. Your organization provides a valuable and much-needed service for so many people (and Dogs) in Alabama, and in so many ways through your Service & Therapy Dog programs. Thank you for giving us the opportunity to play a small role in the process, and for writing your kind review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "115630109998380844224", "name": "Tiffany Youngblood", "time": 1557587188914, "rating": 5.0, "text": "Vernon is extremely knowledgeable, kind, & helpful. I recommend anyone in need of an expert to contact this company.", "pics": null, "resp": {"time": 1557588155305, "text": "Hi Tiffany, thanks for the kind review! I enjoyed collaborating with you regarding your e-Commerce website requirements and future online marketing plans. Feel free to contact us anytime in the future if we can be of assistance."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114814581255436352692", "name": "Zac Williams", "time": 1532314036516, "rating": 5.0, "text": "Great experience in marketing. No nonsense, to the point, I highly recommend bizeeo. Very knowledgeable and always happy to help.", "pics": null, "resp": {"time": 1557591226727, "text": "Hi Zac, thanks for the kind words and 5-star review! We're excited about the quick results we obtained as a result of publishing your new website and applying an aggressive local SEO strategy. It was a team effort!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114798988453050027233", "name": "Ellen D", "time": 1397076457288, "rating": 5.0, "text": "Bizeeo Web Marketing & Design was referred to me by a mutual friend.\nVernon Blake, owner, is very knowledgeable, and very easy to work with.   He has designed an awesome website for my business always adding new and interesting articles in my specialized field .  My website is user friendly and up-to-date with the latest technology for smart phone viewing, and social media interactions.     I have been beyond satisfied with his work.    If you are considering his services I would highly recommend him.       Bizeeo Web Marketing & Design definitely gets my 5 stars!!   Thank you, Ellen Dutton", "pics": null, "resp": {"time": 1409030786787, "text": "Hi Ellen! It has been our pleasure to work with you over the past year and a half. We appreciate how you never lose sight of WHY we do what we do online, which is to find more customers for your business. Clients such as yourself allow us to ensure your marketing and advertising dollars are spent where they are most needed. We provide many marketing services, but we recommend and sell only those services that support the overall development and growth of your business. Thank you very much for taking time to leave a comprehensive review! Vernon Bake - Marketing and Business Development Services Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "115596480277714604367", "name": "Sasha Pulford", "time": 1514347967833, "rating": 5.0, "text": "Bizeeo Marketing in Montgomery provided effective, easy-to-understand marketing consulting and training services for my new business venture. They even explained SEO (search engine optimization) in a way that made sense to me. If you're in need of plain-spoken, jargon-free online advertising and quality marketing services from someone you can trust, these are the people to call. I highly recommend Bizeeo! Thank you Vernon and Shelley!", "pics": null, "resp": {"time": 1514349566739, "text": "Hi Sasha! S-E-O... We're impressed! Working with you was a pleasure! You picked up on all the marketing \"jargon\" like a real pro (even though we tried to avoid it as much as possible). I know your Pappy is proud (and so are we)! We appreciate you taking a moment to rate our services and leave a review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "105558261031880821995", "name": "Aliesha Shepherd", "time": 1383935541321, "rating": 5.0, "text": "I have been so happy that I found Bizeeo Web Marketing & Design.  He has helped save me a lot of money and headache.  My websites and pages now rank on the first page and I am getting most of my business through Google searches and not just word of mouth!\nI asked for some advice on how to make my website more visible, I was given some excellent tips and things to do to help more people find me! I would highly recommend him to anyone who has a website and would like to have a web presence!!!\"", "pics": null, "resp": {"time": 1386091718280, "text": "Hi Aliesha! It was a pleasure to help you with your online presence. You had most of the web marketing puzzle pieces in place, all that was needed was some fine tuning - and you were a quick learner. We have been monitoring your rankings in the search engines and are thrilled to see that your small business (dog training) is thriving. Let us know if we can help in the future, and thanks for taking a moment to leave a review. Vernon Blake - Internet Marketing Specialist with Bizeeo Web Marketing & Design"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "105070166819056393683", "name": "Yvonne King", "time": 1461632747576, "rating": 5.0, "text": "Vernon and his staff are true business partners. Vernon is extremely knowledgeable concerning online marketing but unlike most online marketing companies he isn't going to recommend something unless it is a good fit for your business. Vernon takes the time to do a thorough needs assessment to learn about your business and your marketing needs-then he will make a recommendation. He is very patient and meticulous. I would recommend Bizeeo to any small business wanting a positive return on their marketing investment.", "pics": null, "resp": {"time": 1464977437818, "text": "Hi Yvonne, we REALLY appreciate you and your review! Online Marketing can be quite mysterious, even overwhelming, for most business owners. We think you probably \"get\" what we do and why we do it better than anyone we've worked with. Thanks again for submitting your review and comments."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114566672165693307420", "name": "Billy Ferguson", "time": 1568484127011, "rating": 5.0, "text": "I hired Bizeeo to promote my DJ services for wedding, party, corporate and other local Montgomery events. They created a multimedia rich website and custom YouTube channel, including audio tracks and video clips representing the different music genres and other services I offer. They included a comprehensive booking form so potential customers could easily book an event from my website. I'm very pleased with Bizeeo's marketing services and my DJ services are now easily found in Google's search results. I highly recommend Bizeeo if you're in need of specialized online marketing and promotion services for your business.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "111090829406892215866", "name": "Joseph Thomas", "time": 1461686368754, "rating": 5.0, "text": "I would like to Thank Vernon & Shelley for all their hard work creating a wonderful website for our company. Bizeeo Marketing Agency will go above and beyond your expectation in the research and development of your website and online searches for your business!! We have been very pleased with there services and and highly recommend their company. Thank you Bizeeo", "pics": null, "resp": {"time": 1464975886919, "text": "Hi Joey, we thoroughly enjoyed developing and designing your website. We learned so much about the \"Piano Business\" in the Montgomery River Region. We're looking forward to working with you in the future and are very happy to know you are pleased with our marketing services. But, as always, it is a team effort! Thanks for taking time to leave a review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "100265935271884226756", "name": "Lana Grier", "time": 1386088539690, "rating": 5.0, "text": "It was refreshing to speak with a marketing agency that was completely transparent about their services. They took the time to explain what I would be paying for and precisely how they would perform their services - without using a bunch of techno-geek-babble. They even demonstrated what they had accomplished with their existing clients. This was an easy choice and one that has certainly paid dividends.", "pics": null, "resp": {"time": 1386090911243, "text": "Hi Lana,\n\nThank you for the nice review!\n\nWe do our best to educate our existing and potential clients. We have discovered that informed clients are the best clients. They know what to expect, how to hold us accountable, and work with us so that it becomes a team effort.\n\nThis enables Bizeeo to provide the best services possible and allows our clients to reap the full benefits of our efforts. It pays dividends for everyone involved. :-)\n\nThanks again for taking time to submit a review. We truly appreciate you and your business! Vernon Blake -\nInternet Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "101550549936669869722", "name": "Kyle Murchison", "time": 1514090352201, "rating": 5.0, "text": "Vernon Blake is an expert at SEO and online marketing. He revolutionized our online capabilities and allowed us to take our business to a whole new level. He's extremely knowledgeable and a pleasure to work with.  I would highly recommend.", "pics": null, "resp": {"time": 1514317393287, "text": "Hello Kyle! It's very gratifying when our clients understand the importance of \"local\" SEO and the role it plays generating new customer leads. Bizeeo Marketing looks forward to a long relationship, and we're excited to be a part of your marketing efforts in Montgomery. Thanks for your rating and review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "110485306258530375688", "name": "Brenda & David Duos", "time": 1582045443482, "rating": 5.0, "text": "UPDATE!!\nI just had to come back and tell you how much I appreciate the amazing difference you have made in jump starting our new business!  You had us growing the minute we opened the doors! Your insight and knowledge is incredible. There were so many details we would have never considered that make a huge difference in reaching new clients! Thank you for handling the overwhelming and super important job of marketing so we can focus on providing great service to the clients you helped us get!\n\nPREVIOUS REVIEW 2014:\nVernon has great ideas and he’s very knowledgeable! I love that he’s so patient when helping me or explaining how things will benefit our business. He also makes our overwhelming decisions much easier and that ultimately saves time and money!", "pics": null, "resp": {"time": 1386092671078, "text": "Hi Brenda! We always keep in mind that the purpose of our web consulting services is to save precious time for busy our clients, attract more customers, and promote profitability. Bizeeo handles the marketing and automation tasks which enable small businesses like yours to focus on actually running their business! Thank you for taking time to leave a review and feel free to call on us anytime. Vernon Blake - Internet Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "105792651197739397233", "name": "Gerri Taylor", "time": 1399384742120, "rating": 5.0, "text": "What a great group of professionals! Vernon Blake creates web designs/marketing plans that are effective and affordable. The Bizeeo team can build a new website or enhance an existing site; and your website will function across multiple platforms. I definitely recommend calling Bizeeo first, if you need help with web site design.", "pics": null, "resp": {"time": 1409031813082, "text": "Hi Gerri! It was great collaborating with you regarding your non-profit organization's Internet marketing project. Your knowledge and experience in your industry and thorough understanding of how the web \"works\" allowed us to cover a lot of ground in a short time-frame. We really appreciate you taking the time to leave a review. Vernon Blake - Marketing & Advertising Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "100613012383044548156", "name": "Ronald Man", "time": 1461152690628, "rating": 5.0, "text": "I met Shelly and Vernon on facebook, and decided to consult with them regarding my business. During the consultation, they gave me some excellent advice about the multitude of directories out there, and how to easily maneuver and utilize them.\nI followed there advice and saw a substantial uptick in phone calls and jobs in my local service industry business.\nVery, very helpful and knowledgeable people!\nI highly recommend!!", "pics": null, "resp": {"time": 1464975613640, "text": "Hi Ron, Online business directories are the \"new\" yellow pages. Submitting and/ or correcting your business details across the major business data providers, directory sites and review sites is an essential part of promoting your local business. Bizeeo practices what we preach, just perform a Google search for \"Bizeeo\" and you'll discover all of the Montgomery, Alabama listings, directories and social networks that we created (all for free).  It was a pleasure consulting with you. All we had to do is point you in the right direction and you took off! Thanks for taking time to leave a review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "106553004895518822366", "name": "a.", "time": 1426858790057, "rating": 5.0, "text": "What I most appreciate about the services of Bizeeo Marketing Agency, is that they are very responsive. They've never hesitated to get back to me promptly in addressing my needs and concerns. I have also been very impressed that this group remains abreast of the latest trends and technologies which in critical in meeting customer demand.", "pics": null, "resp": {"time": 1433034381042, "text": "Hi Angie! Working with you on a variety of projects over the past 2 years has been a pleasure. What we appreciate most about you is your Project Management expertise - the ability to see the BIG picture while understanding all the moving parts. That's exactly what Bizeeo does as a Digital Marketing services provider and why I think we work well together. Thanks for taking time to leave a review and we look forward to our next collaboration. ~ Vernon Blake - Internet Marketing Consultant"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "106150811266029691174", "name": "Blake Grier", "time": 1514314864475, "rating": 5.0, "text": "Vernon provided excellent website design services for my Montgomery area business. Our site is clean and easily navigable, and it also ranks well in Google search results.", "pics": null, "resp": {"time": 1514316920941, "text": "Hi Blake! Working with you on your web design project has been a pleasure! Your Montgomery based aerial drone photography and video editing services will undoubtedly be in high demand throughout central Alabama. We're looking forward to providing additional web-related services over the next year. Thanks for taking time to leave your rating and review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "105243813640322533280", "name": "Leigh Mollet", "time": 1541786714883, "rating": 5.0, "text": "Bizeeo Marketing has partnered with our business for years and has always worked diligently to meet and exceed our expectations with innovative ideas and creativity.", "pics": null, "resp": {"time": 1557590115715, "text": "Hi Leigh, thank you for the kind review! It just occurred to me that our partnership is quickly approaching a 10 year anniversary, how time flies! We appreciate the opportunity to work with you and your Birmingham staff and look forward to providing web marketing services and website maintenance services for years to come."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "100587306914749864025", "name": "Kathryn Fletcher", "time": 1461257062406, "rating": 5.0, "text": "I throughly enjoyed working with Vernon and his lovely assistant Shelly. Vernon investigated every aspect of our website and business to get us the best results possible. If you need personal results for your business don't hesitate call them today!", "pics": null, "resp": {"time": 1464976189661, "text": "Hi Kathryn, your online marketing project was our biggest challenge to date. Oh, how we despise those penguins! We appreciate your patience during what was a LONG process of recovering from a Google algorithmic penalty. I still have nightmares about \"storage montgomery al\"! Just kidding... Thank you so much for taking time to leave a review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114588819587790455750", "name": "Z Man", "time": 1461524676067, "rating": 5.0, "text": "I have been working with Shelley and Vernon for a little over a year now and I need to give this talented duo  a huge round of applause.  They can handle everything and handle it with the urgency, creative and technical insight  that I need.  From baby shower graphics and invites to athletic challenges and into my personal business this creative couple has helped me increase internet presence, use social media more effectively and create a functional and friendly website.  Thanks again for all your help Shelley and Vernon!!!", "pics": null, "resp": {"time": 1464977182762, "text": "Hi Z Man, I don't think we have ever worked with anyone with so many irons in the fire! We could barely keep up! But we are so impressed with all you do, especially for others. Thank you for the kind review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "112435256381244660171", "name": "Janice Prescott", "time": 1523323264743, "rating": 5.0, "text": "Shelley Blake helped me set up a Facebook business page for my handmade pottery operation (Wild Clover Studio) and connect it to Instagram. Now I only have to post the information once and it appears in both places.\n\nShelley is very knowledgeable about how the different social media applications work together. She is friendly and patient and able to explain things in plain English. And a bonus--I picked up so many tips and shortcuts for working with my phone and my computer!", "pics": null, "resp": {"time": 1524852101476, "text": "Social media marketing is an excellent online strategy for promoting your handmade pottery and other artwork, especially for potential customers in Montgomery and central Alabama.\n\nHi Janice, \"Thank you\" for taking time to leave a 5-star rating and review! You've done a great job with your Facebook promotional efforts and setting up your online store and featured products.\n\nWe thoroughly enjoyed working with you and wish you and Wild Clover Studio all the best. Let us know if we can help in the future. ~ Shelley Blake (Montgomery Social Media Marketing Specialist)"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114588819587790455750", "name": "Z Man", "time": 1461524676067, "rating": 5.0, "text": "I have been working with Shelley and Vernon for a little over a year now and I need to give this talented duo  a huge round of applause.  They can handle everything and handle it with the urgency, creative and technical insight  that I need.  From baby shower graphics and invites to athletic challenges and into my personal business this creative couple has helped me increase internet presence, use social media more effectively and create a functional and friendly website.  Thanks again for all your help Shelley and Vernon!!!", "pics": null, "resp": {"time": 1464977182762, "text": "Hi Z Man, I don't think we have ever worked with anyone with so many irons in the fire! We could barely keep up! But we are so impressed with all you do, especially for others. Thank you for the kind review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "112510985204794788171", "name": "Daniel Nielsen", "time": 1386183339474, "rating": 5.0, "text": "As a CEO of several public and private companies, I have over the years consulted with many marketing services providers, advertising companies and web designers. My experience in dealing with Bizeeo Web Marketing & Design has been thoroughly enjoyable. Bizeeo's personalized service is amongst the best I have known and their expertise and professionalism is of the highest standard. I have nothing but praise for what Bizeeo offers and would recommend their services to anyone looking for the best.", "pics": null, "resp": {"time": 1386639009944, "text": "Hi Daniel! I thoroughly enjoyed our consulting session and look forward to future collaborations regarding your upcoming web project(s). It is refreshing to work with a client that possesses an understanding of and appreciation for web marketing principles and strategies. Your well thought-out action plan coupled with your ability to execute makes my job MUCH easier. Thank you for your kind words and taking a moment to post a review. - Vernon Blake - Internet Marketing Consultant"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "118054869689627774011", "name": "Bob H.", "time": 1422397408823, "rating": 5.0, "text": "Vernon, and his staff have done a wonderful job for our company.  They have put in an extraordinary amount of time, and have guided us through the maze of knowledge needed to have a fully functional website and design.   His team is a dream to work with.  Thank you Vernon!", "pics": null, "resp": {"time": 1433033707813, "text": "Hi Bob! We had our work cut out for us, but you guys were great to work with! We started with a one-page website and ended up with a blog, eCommerce store, Social Media presence, online lead generation, email marketing and more. And you guys were just getting started! I really appreciate how you didn't just sit and wait for the phones to ring. You aggressively participated in Trade Shows & Conferences and actively pursued customers, something one must do in such a competitive industry like yours. It was my pleasure and a privilege to work with you and your staff for a year and help get the ball rolling. Wishing you all the success you deserve moving forward. Thanks for taking time to leave a review! ~ Vernon Blake - Web Marketing Consultant"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "112435256381244660171", "name": "Janice Prescott", "time": 1523323264743, "rating": 5.0, "text": "Shelley Blake helped me set up a Facebook business page for my handmade pottery operation (Wild Clover Studio) and connect it to Instagram. Now I only have to post the information once and it appears in both places.\n\nShelley is very knowledgeable about how the different social media applications work together. She is friendly and patient and able to explain things in plain English. And a bonus--I picked up so many tips and shortcuts for working with my phone and my computer!", "pics": null, "resp": {"time": 1524852101476, "text": "Social media marketing is an excellent online strategy for promoting your handmade pottery and other artwork, especially for potential customers in Montgomery and central Alabama.\n\nHi Janice, \"Thank you\" for taking time to leave a 5-star rating and review! You've done a great job with your Facebook promotional efforts and setting up your online store and featured products.\n\nWe thoroughly enjoyed working with you and wish you and Wild Clover Studio all the best. Let us know if we can help in the future. ~ Shelley Blake (Montgomery Social Media Marketing Specialist)"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "102201922843760610575", "name": "SAC's Gallery", "time": 1389307169756, "rating": 5.0, "text": "Vernon and Shelley have been wonderful. They rebuilt our website and are currently marketing it. We have seen improvements in traffic to our website and categories of customers for the Gallery. Thanks so much.", "pics": null, "resp": {"time": 1389652187586, "text": "Hi SAC's Gallery (Ladonna & Kathie)! Shelley and I thoroughly enjoy working with you guys, including all of your patrons and talented art exhibitors. When a client organization provides such high quality products and services as you do, our job of providing marketing and business development services is a piece of cake! Thank you for taking a moment to rate us and write a review. V. Blake - Internet Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "107917158782876540602", "name": "Sharon Bell", "time": 1468183198091, "rating": 5.0, "text": "Vernon Blake set up my website a couple of years ago, and he showed such patience and understanding with me since I am somewhat \"computer challenged\".   He and Shelley made great suggestions and helped me through the whole process.  His fee was more than reasonable, and he continues to check the website and help me with any changes I need.\n\nThe website is put together so nicely and is easy to maneuver.  I can not tell you how many clients who search the web, found my site, and have called to make an appointment with me.\n\nI just can not say enough positive about Vernon and Shelley and their work!!\n\nSharon W. Bell, M.S.\nLicensed Marriage and Family Therapist", "pics": null, "resp": {"time": 1469742476277, "text": "Hi Sharon! It has been a true pleasure to provide web design and website promotion services for your practice. Montgomery, Alabama is a great place for small, local businesses to market their products and services online, and your website project has certainly provided evidence of that. Of course, you have a LOT to do with that! We look forward to working with you in the future AND to your continued success! And thanks for taking the time to publish a rating & review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "112194497644220502983", "name": "Lisa Elliott", "time": 1392096865866, "rating": 5.0, "text": "Vernon has been a part of the Association for Play Therapy for years and has always been friendly and patient as he created our web presence.  Last fall, he went beyond the call of duty and he was our guest speaker for two lunch and learn meetings for the Central Alabama Play Therapy Network.  The presentations were polished, professional, and helpful to many therapists in Montgomery.  He provided valuable information to many private practitioners and agency counselors to manage their practices.  I highly recommend Bizeeo Web Marketing to any business seeking to establish or improve their web presence.  Bizeeo's customer service cannot be beat!", "pics": null, "resp": {"time": 1392097962227, "text": "Hi Lisa! It has been my pleasure working with AAPT... I really appreciate how active your organization has been over the years and your desire to make use of the web to both promote your cause and coordinate educational events. I am always available for future speaking engagements and other formal (or casual) presentations if you'd like to hear the truth about marketing your business online (that goes for any business or organization). Thank you very much for taking the time to leave a review, and I am looking forward to future projects! Vernon Blake - Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114489763160957652511", "name": "John Courtney", "time": 1401713534252, "rating": 5.0, "text": "I was so intimidated by trying to build a website and all the information that went with it. I tried to talk to several people about the things that I needed but they all wanted to talk via email or text. When I finally found Vernon, he so kindly spent all the time I needed to help me. He solved my problem in record time. I will only use Vernon and his team in the future for all my web design and most importantly I know that I and my business are important to them. Thank You again Vernon, nothing but 5 stars from us.", "pics": null, "resp": {"time": 1409032558716, "text": "Hi John! Yes, your business IS important to us, as our success depends on the success of your business. One of our business development goals is to cut through all of the marketing techno-babble. This allows us to address and resolve marketing challenges in a manner that is understood and transparent to our clients. We constantly remind our clients that they should never accept anything we say without verifying our claims and shopping around. Ultimately, we want you to choose our marketing services NOT because we say we are one of the best, but because you have performed independent research and come to your own conclusion that Bizeeo is the right marketing service provider for your business. Thanks for taking the time to leave a review, and we look forward to working with you in the future. Vernon Blake - Bizeeo Marketing Agency"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "100006047040746085143", "name": "esala wueschner", "time": 1514330213315, "rating": 5.0, "text": "Gave me great advice over the phone. Highly recommended asking them for assistance.", "pics": null, "resp": {"time": 1514331903295, "text": "Hi Esala! We're glad we could point you in the right direction. Bizeeo Marketing uses WordPress software for all of our websites, and in your case we think WordPress.COM is an excellent choice for hosting your website. Remember to review their free themes at https://wordpress.com/themes/free and their tutorials at https://en.support.wordpress.com/start/. Good luck, let us know if you have additional questions, and THANK YOU for your rating and review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "108161717015002129451", "name": "Jonathan McKissack", "time": 1403633647911, "rating": 5.0, "text": "We really appreciate all the special attention and consideration provided by the Bizeeo team during our webpage construction.  They did a fantastic job helping us through the process and always treated us with professional service...a real class act!", "pics": null, "resp": {"time": 1409032829932, "text": "Hi Jonathan! When we work with clients such as yourself that possess a clear vision for your business development goals, our job becomes much easier. We thoroughly enjoyed working with you and your wife and look forward to future projects. Thank you for taking a moment to leave a review. Vernon Blake - SEO Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "116894094856529757653", "name": "Shelley Belly", "time": 1386084614567, "rating": 5.0, "text": "I'm so glad I found this company to handle a friend's marketing!  She had paid a few thousand dollars for \"web marketing\" and contacted me to complain that she couldn't be found on Google Search.\n\nI decided to Google \"Internet Marketing Services in Montgomery, Alabama\" and they are ranked #1!!  If they can do it for themselves, then they can do it for my friend / and THEY DID!!  They practice what they preach!!\n\nThank you, Vernon & Bizeeo Web Marketing.", "pics": null, "resp": {"time": 1386096193468, "text": "Hi Shelley! You know how much I appreciate you and your kind words. It pains me that small business owners spend their advertising and marketing dollars where they are ineffective. I hear horror stories like these from potential clients on a regular basis. I always advise them, whether they hire me or not, to \"do this and do that\" and \"ask this and ask that\" BEFORE selecting their next marketing agency. There are simply too many marketing service providers that over promise and under deliver, selling services that they know are not in the best interest of their clients. Even worse, many so-called \"web marketing\" agencies are experienced only with \"traditional\" marketing such as print, radio, or television, but expanded their services into the web arena in order to survive (or be more profitable). While most of these agencies are excellent at providing \"traditional\" marketing services, many of them are wholly unqualified to provide any type of online marketing services. They might be able to produce a \"pretty\" website, but that is a far cry from what is required to implement a successful, comprehensive web marketing campaign. Thanks again for leaving a review and allowing me to vent :-), Vernon Blake - Internet Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "100895179939230655573", "name": "Mickey Thompson", "time": 1582054595462, "rating": 5.0, "text": "I came back here again to thank Vernon and Shelley for the excellent work they continue to do for our business after all these years. We still have no need to do any other marketing or advertising other than the work they do for us, and I I can go about doing what I do best, and leave them to handle what they do best. I trust them implicitly and thank them for always being available when we need them.\n\nIn this day and age, it’s so nice to be able to do business with honest, decent, upstanding folks like these.\n\nFor the 7th year in a row, we have won the TripAdvisor award for best restaurant in Prattville.\n- - - -\nMy restaurant is off the beaten path in downtown Prattville, AL making it a challenge to attract new customers. In the past, I paid to advertise in the local newspaper, print magazines, print and Internet yellow pages and an online paid listing, with limited success. I hired Bizeeo over 2 years ago (October 2012) to market my restaurant online.\n\nThey manage my website, social media, business listings and online reviews (reputation management). Since then, growth has exceed 25% for 2 consecutive years.  Due to our success with Bizeeo Marketing, I've discontinued all other forms of advertising.\n\nAlso, this year (2015), our restaurant won TripAdvisor's Certificate of Excellence award (out of 99 restaurants). This is the 3rd year in a row we have won this award. I highly recommend Bizeeo - you can see for yourself online what they've done for us.", "pics": null, "resp": {"time": 1464976737257, "text": "Hi Mickey, we have learned so much about online marketing (we are ALWAYS learning) while maintaining your website and other web properties. The biggest take-away is for some industries (your Prattville business is an example), FAR more time and effort is devoted to marketing tasks \"off\" the website, like managing online reviews and promoting your brand via social media. Of course, the foundation of it all is we are fortunate enough to work with a business owner that KNOWS what customer satisfaction is all about. And... congratulations on your TripAdvisor \"Certificate of Excellence\" award for 2016... 4th YEAR IN A Row! And thanks for taking time to leave the nice review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "111294172004688450473", "name": "Rodger Briley", "time": 1461093004289, "rating": 5.0, "text": "Really great and caring people.", "pics": null, "resp": {"time": 1464976838234, "text": "Hi Rodger, we appreciate brevity, and will respond in-kind. Thanks for the review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "101887403272089077815", "name": "Matthew Atkinson", "time": 1544549762715, "rating": 5.0, "text": "Great service! Always go the extra mile to make sure the job is done right. Highly recommended!!!", "pics": null, "resp": null, "gmap_id": "0x889bb18133e43a17:0xdb35ab0e0975919e"}
{"user_id": "111435917458406500224", "name": "Forrest Derr", "time": 1427594551571, "rating": 5.0, "text": "I have used the L Connection at various times over the years since they formed.  Always great service and value.", "pics": null, "resp": null, "gmap_id": "0x889bb18133e43a17:0xdb35ab0e0975919e"}
{"user_id": "103460429055967158228", "name": "Prakash Acharya", "time": 1478816734784, "rating": 5.0, "text": "good! lol", "pics": null, "resp": null, "gmap_id": "0x889bb18133e43a17:0xdb35ab0e0975919e"}
{"user_id": "101116028422650653020", "name": "Deborah Boswell", "time": 1623761450328, "rating": 5.0, "text": "I have used Fusion One Marketing for approximately 10 years for SEO, social media, and online marketing for 2 businesses I own.  Glyna, Rob, and the team are very good at what they do. They are also pleasant and make doing business with them easy!  I don't advertise my business through any other means other than the marketing through Fusion One's efforts online. It is worth every penny I spend with Fusion One!\nDeborah Boswell\nPresident\nProfessional Speech Services of AL, P.C.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMMc5MMeBjtXwG5idcseIvAA04NxTiXv5Xiss9Z=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "102781938288080834775", "name": "Jamie Garzarek", "time": 1621516749307, "rating": 5.0, "text": "Fusion One is a great business to work with. Glyna has done such a good job working with my company.  We started using their services several months ago and I haven’t had any complaints. They were able to change up our website and I have gained business solely on how it looks and is presented. I can’t thank Fusion One enough for what they have done for our business.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "115008367664782796332", "name": "Dave Stephenson", "time": 1621343099833, "rating": 5.0, "text": "We looked at several marketing firms and decided to go with Fusion One. We are very pleased with our results. Glyna ,Rob, Kelsey and Sarah go the extra mile and have increased our online presence and website traffic consistently every month. I have and will continue to recommend them to anyone considering online marketing!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "113946942109079573624", "name": "Leonard Austin", "time": 1609869780908, "rating": 5.0, "text": "Glyna and her team are 2nd to none. It is incredible the difference in our call volume and website traffic since they have taken over. As Marketing Director for Crocker Moving Services, this is one of the best decisions made. Fusion One also handles our Facebook and other social media accounts. Kelsi is the best and keeping relevant and interesting posts. She also helps me with recruiting from our Facebook page. I highly recommend Fusion One Marketing.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNY5OiJIj0oOEPgb_CteQ3HT4od6LxyD_PRpaA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPYoIjSkgr-phwneR9vkCszMnzVbN-0CxGniio=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "103035871281546124973", "name": "Lisa Guarino", "time": 1609894223064, "rating": 5.0, "text": "Best Team Ever! Very present and truly cares about your business! Best decision I ever made was to join Fusion One Marketing!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "103178744773585078803", "name": "anthony boyd", "time": 1580055421254, "rating": 5.0, "text": "Fusion One has turned my marketing around completely. Rob and Glyna are very easy to talk to and work with . I would highly recommend them and their team of professionals to anyone who has marketing needs !", "pics": null, "resp": {"time": 1580059814554, "text": "Anthony thanks so much, it is a pleasure to work with you."}, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "112072675417612663375", "name": "Mike Parlier", "time": 1571163593416, "rating": 5.0, "text": "I’ve been using Fusion One for all of our web and SEO for the last year and a half. Glyna, Rob, Michael, Sarah and the rest of the gang do an amazing job for us.  I could not be more happy. I would highly recommend them to anyone that needs their services.  We went from a brand new start up company to a multi-million dollar company in our first year and we owe a lot of our success to Fusion One Marketing!", "pics": null, "resp": {"time": 1580060030743, "text": "Thanks Mike we are so glad to work with you and see your companies growth."}, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "107728638646866376500", "name": "Dr. Keith Hallingquest", "time": 1543543755366, "rating": 5.0, "text": "Fusion One Marketing is an amazing company full of skilled individuals who love to deliver!  Rob and Glyna have an eye for detail and know exactly how to get your business the visibility that it needs to be more profitable.  If you are trying to expand your business, this is definitely the place to do it.  They are amazing people, delivering amazing service, to create amazing results.  I highly recommend Fusion One Marketing for any digital marketing need!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "102175912424785710537", "name": "William Collins", "time": 1545918255161, "rating": 5.0, "text": "Glyna helped us with our Search Engine Optimization and it was a great experience. She knows exactly what steps to take to make sure you're getting the most out of your search engine lead generation.  I look forward to working with her in future marketing strategies.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "101865223993202122093", "name": "Heath Barnett", "time": 1528986474348, "rating": 5.0, "text": "First the website looks fantastic! Clean and professional with a style that matches our aesthetic and just the right amount of pizazz! The intuitive interface has given our customers a voice that keeps our finger on the pulse of their needs. The marketing is top notch as well and has certainly raised awareness in the community of our business and services as well as our job postings for the new location!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "115642156001822879785", "name": "Andrew Wilkerson", "time": 1528570790656, "rating": 5.0, "text": "Fusion One Marketing - I cannot say enough amazing and wonderful praises about this husband and wife team. They have helped generate additional leads and closed business each month. Have also helped with creating a great website, social media, and getting more reviews.  I recommend FUSION ONE to anyone who is wanting a good return on their investment. most importantly Glyna and Rob truly care about your success and are such amazing people to work with.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "114201120097701466914", "name": "Brandy Cook", "time": 1543854194276, "rating": 5.0, "text": "Fusion One Marketing will help grow your business. They will give you a fantastic website and help consumers find your business online with ease. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "100967558377306804538", "name": "Emily McGrath", "time": 1495657954268, "rating": 5.0, "text": "I've absolutely enjoyed working with Nick. I have received above and beyond what I expected! I wouldn't be doing any justice trying to describe the level of attention and professionalism I've experienced. As a small business owner every dollar counts and working with Nick at Fusion One Marketing is more than worth it.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "102114088470396655242", "name": "Mitch Jones", "time": 1529411672954, "rating": 5.0, "text": "Our website had become somewhat stale and stagnant, and we weren't generating any new traffic to the site.  Glyna and her team totally reworked our page, gave it a new look, and instantly established a credible site with tons of traffic.  We have been so pleased with the reviews we have gotten from our customers about how good the site looks and how easy it is to navigate.  Fusion One really did a great job, and I would recommend them to any new or old business needing a fresh new website!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "102886367946293474833", "name": "Santiago Hechart", "time": 1546543808462, "rating": 5.0, "text": "Fusion One helps businesses look great on the internet and they do it with a smile! Rob and Glyna put all their effort into their work and it truly shows. They deliver high quality results!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "118169772875538703898", "name": "Deborah Ridderhoff", "time": 1446737933987, "rating": 5.0, "text": "Fusion One Marketing is a fantastic company to work with.  I wanted a logo and website that would not only reflect my personality but make my firm stand out from the competition.  Glynn and Rob went the extra mile to created a website and logo that is professional and unique.  In short, they nailed it!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "110259089752431924396", "name": "nikki majewski", "time": 1540832317103, "rating": 5.0, "text": "Fusion One has been a wonderful asset to Child'sPlay Therapy Center. They are quick to give advice on how to improve our social media presence, they go over monthly trends and keep us informed on the best ways to reach prospective clients.", "pics": null, "resp": {"time": 1540903045020, "text": "Thank you for the kind words Nikki!  We appreciate your business and love working with you and ChildsPlay!"}, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "104781721129865982810", "name": "Shawn Troughton", "time": 1543846013067, "rating": 5.0, "text": "Thanks to Fusion One Marketing and all they do. The owners, Rob and Glyna, love their jobs and helping businesses to be found on the internet. If you are in need of a Marketing Team, look no further!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "115165841266332848661", "name": "Sara N. Tower", "time": 1518121071318, "rating": 5.0, "text": "Fusion One Marketing is a fantastic company that puts their customers first. Nick is very passionate and extremely knowledgeable with how to market your business best. I highly recommend them if you are in need of boosting your online business exposure or need a new website!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "103022501676923844872", "name": "Jeffrey Franklin", "time": 1526917878992, "rating": 5.0, "text": "Great company to work with, they have helped grow our business since the day we opened our doors. Very professional, and honest hard working company.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "114182987158411567360", "name": "Alicia Mooney", "time": 1502819123525, "rating": 5.0, "text": "The team at Fusion One has been a pleasure to work with. They hit the ground running on our project and already have provided impressive results.  I couldn't ask for a better group of people to work with - Nick and Glyna are the real deal!", "pics": null, "resp": {"time": 1502828257550, "text": "Thank you Alicia!  We really enjoy working with you!"}, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "110438149585714064107", "name": "Stephanie Crocker", "time": 1453499362488, "rating": 5.0, "text": "Fusion One Marketing is an awesome company. I have really enjoyed working with these people .They are friendly, energetic and really do the work they say they can!!!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "102672658792353078836", "name": "Cary Miller", "time": 1449688436935, "rating": 5.0, "text": "Over 10 years I struggled with SEO and Web issues.  Fusion One has simplified my business by letting me focus on what I'm good at while they handle the ever changing world of the internet.  In addition to being great at what they do they are always professional,  prompt, and super friendly...I highly recommend with out hesitation.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "112811481809695353382", "name": "Michel Coleman", "time": 1407526441936, "rating": 5.0, "text": "I can't say enough about the integrity of Fusion One Marketing.  I have been associated with Glyna for over 4 years and would never consider trusting the internet presence of my company to any other company.  If you want the highest level of customer service and the best service to grow your business, meet with Fusion One Marketing today!!\n\nMichel Coleman\nColeman Construction, Inc.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "110220750422783895705", "name": "Brian Adams", "time": 1529084962473, "rating": 5.0, "text": "At Mr. Bugg's we have used Glyna and Rob with FusionOne for close to 10 years and they do an outstanding job with our website and anything else we have had them do.  I would HIGHLY recommend them.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "108920923591288886388", "name": "Greg Womble", "time": 1432925676669, "rating": 5.0, "text": "Glyna and Rob at Fusion One Marketing are outstanding digital marketers but also great people, too. They really help you understand the many online marketing options in a clear way and have a spirit of collaboration, not control. Their expertise is top-notch.\n\nI have worked with a lot of specialty marketing shops over the years and can honestly recommend these folks to anyone needing SEO and/or digital marketing help.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "111092795227108123196", "name": "DAVID WAYMIRE", "time": 1487431134991, "rating": 5.0, "text": "I am starting a new business and Rob and Glyna at Fusion One came highly recommended from an inquiry I made on our local FB page. They did not disappoint!  Upon contact, Glyna promptly met with me to discuss my options and what they could do for me.  From simple ideas, examples, and feedback I provided, they created my company logo then got to work creating my company website.  It was wonderful to be able to communicate directly with them with my ideas and concerns.  Despite my many changes, they were almost spot on meeting the timeline they quoted for completion.  I am very pleased with both the logo and my new website and I look forward to a long and successful relationship with Fusion One Marketing.", "pics": null, "resp": {"time": 1489062327432, "text": "Thanks David, it was a pleasure to work with you.  Please let us know if there is anything else we can help you with."}, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "115886238599327982145", "name": "Brent Panell", "time": 1512050802541, "rating": 5.0, "text": "Bottom line...they will increase your business revenue and image quality!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "115454289720838197298", "name": "Ron Eddings", "time": 1421093403378, "rating": 5.0, "text": "I highly recommend Fusion One Marketing for building your website construction and maintenance. Glyna goes the extra mile to ensure she understands the needs of her clients and help them to best optimize their website and outreach via internet marketing. She has been a pleasure to work with and has made a positive contribution to the success of my business.  I look forward to our continued business relationship and would recommend Fusion One to anyone.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "111092795227108123196", "name": "DAVID WAYMIRE", "time": 1487431134991, "rating": 5.0, "text": "I am starting a new business and Rob and Glyna at Fusion One came highly recommended from an inquiry I made on our local FB page. They did not disappoint!  Upon contact, Glyna promptly met with me to discuss my options and what they could do for me.  From simple ideas, examples, and feedback I provided, they created my company logo then got to work creating my company website.  It was wonderful to be able to communicate directly with them with my ideas and concerns.  Despite my many changes, they were almost spot on meeting the timeline they quoted for completion.  I am very pleased with both the logo and my new website and I look forward to a long and successful relationship with Fusion One Marketing.", "pics": null, "resp": {"time": 1489062327432, "text": "Thanks David, it was a pleasure to work with you.  Please let us know if there is anything else we can help you with."}, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "100924781610605824371", "name": "Brooks Barron", "time": 1446420894385, "rating": 5.0, "text": "Awesome Company! Hired them to build a website and logo and they went far beyond expectations.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "102518946299758516230", "name": "Bryan Bell", "time": 1438868381775, "rating": 5.0, "text": "If you have a business that's on the Web (which EVERY business should be) then you need to contact Glyna Humm with Fusion One Marketing.  Not only will she complete a \"health check\" to make sure your Web and social media presence is healthy but she will bring you tons of business!  Call Glyna and today thank me later! ☺", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "106733246036362941034", "name": "Susan Taylor", "time": 1407536531136, "rating": 5.0, "text": "We have been fortunate to rely on FusionOne and Glyna Humm for all our internet marketing needs for the past three years.  I have found our investment in web hosting and search engine optimization with FusionOne to be the most beneficial of all our marketing strategies.  I have been especially impressed with the attention to detail, and exceptional customer service that FusionOne and Glyna Humm embody.  I highly recommend FusionOne to any business owner looking for professional, personal and effective internet marketing.\n\nSusan Taylor", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "106294846547217048524", "name": "Scott Sutton", "time": 1527177292346, "rating": 5.0, "text": "Awesome at what they do!", "pics": null, "resp": {"time": 1527876016386, "text": "Thanks Scott, we love working with you and your team"}, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "103088374559297472035", "name": "Garry Garzarek", "time": 1408455600570, "rating": 5.0, "text": "Huge fan of Fusion One Marketing. Glyna gets it done!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
