{"user_id": "106844494893626799523", "name": "V May", "time": 1626322589344, "rating": 5.0, "text": "Katherine did an amazing job.  She was very attentive and gave thorough feedback and advice. To be such a short amount of time I didn’t feel rushed at all and every question I had she answered. I left the meeting feeling more equipped and empowered then I did before. I would recommend these services to any entrepreneur.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "100985415665885626265", "name": "LaTisha Tubbs", "time": 1626237796842, "rating": 5.0, "text": "You only have a 15 minute call but within those 15 minutes my advisor answered all the questions I had as well as setting up future appointments once a week for any other I needs I have. Gave more than enough resources. I would definitely encourage people that are looking to become a entrepreneur to register with this company for all your needs. Did I mention its free!!!!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "108371908882339659226", "name": "Chandria McCurdy", "time": 1626809774094, "rating": 5.0, "text": "I spoke with Katherine for the first time today & she was very knowledgeable on any questions I asked. Also, she was able to listen to my business plan and provide effective feedback. I am looking forward to our next phone call.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "117538087045924848317", "name": "Cosey Capital LLC", "time": 1626808851835, "rating": 5.0, "text": "We just had our first call with Katherine Zobre of ASBDC and she is AMAZING! In just 15 minutes she was able to answer all of our questions regarding funding, marketing, creating our customer profile and more. What really impressed us was how thorough her follow-up communication is. She sent several resources via email that has placed us on the right path and given us more confidence as a new small business in AL. Definitely a 10/10 experience.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "111694910971323238240", "name": "Joell Regal", "time": 1625754831071, "rating": 5.0, "text": "So far, my experience with ASBDC has been phenomenal! They are very thorough, and show a genuine interest in my business and my GROWTH! I'm so thankful to be able to utilize their services.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109974830121945172065", "name": "Shandah", "time": 1623283259347, "rating": 5.0, "text": "Katherine gets to the point and remains helpful and informative. I am thankful for this journey that we are about to embark on, and I am especially thankful for her enthusiasm and motivation. I am already excited, but she has encouraged me even more.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109037184200606486544", "name": "Kala Brown", "time": 1622998668048, "rating": 5.0, "text": "Katherine, thanks so much for a great experience! I enjoyed our call, the information you gave was precise and extremely helpful! I’m so looking forward to continuing to work and grow with you! Thanks ASBDC!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "103650169539800694095", "name": "Paden Crowder", "time": 1620960975175, "rating": 5.0, "text": "I have had a great experience with ASBDC. Katherine, is truly passionate about helping other people and their business reach their full potential. I have met with Katherine several times and her genuine desire is something that cannot be faked.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112965653760409775999", "name": "Vickie Hill", "time": 1619823085397, "rating": 5.0, "text": "Kathrine was the best, she answered all my questions and gave me the information that I needed to get on the right track. She broke everything down in to step by step manageable goals. I look forward to continuing my relationship with her through the expansion of my business.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109022400506004919374", "name": "Dominique Ingram", "time": 1620914659011, "rating": 5.0, "text": "Katherine Zobre is amazing! I was impressed on the first phone call! She is a great listener and she followed up with me via e-mail after our session with detailed information and resources! I'm excited about my Journey with Ms. Zobre!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112462637144775405307", "name": "Krystal Bowie", "time": 1619119125832, "rating": 5.0, "text": "I'm so excited to be working with AL SBDC to get my business of the ground. I knew from my first meeting with Katherine that I would be able to succeed this time around. She is helping be confident in what I am building.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "114693699989517839226", "name": "Carneil Wilson", "time": 1619285451332, "rating": 5.0, "text": "I am excited and happy to work with ASBDC.  So far Katherine has been great! I look forward to growing and creating a successful business with her help.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "101681243189359830940", "name": "Tonya Griffin", "time": 1614892303414, "rating": 5.0, "text": "Wonderful staff!  Quick response time after my initial request for assistance.  Was assigned a Coach within 1 to 2 days of my request.  Coach Katherine is AWESOME!!  Friendly, knowledgable and helpful.  The SBDC Is a great resource for anyone that is looking for assistance with growing their business and is looking for guidance towards the right direction.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "106815704827390065977", "name": "Thomas Coiner", "time": 1613618894226, "rating": 5.0, "text": "After the first one-on-one meeting, I immediately understood the value Alabama SBDC brings to the table for small businesses in Alabama. What exactly do you get? It's simple, fully customized support through an incredibly structured and professional experience. You have questions? They either have the answers, or will help you find them. Katherine Zobre is the best!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "105204358853051416357", "name": "Brandon Gray", "time": 1611337471860, "rating": 5.0, "text": "Katherine is amazing! Awesome source of information and will work very hard for you. Encourage anyone with a business to take advantage of these FREE resources. They really want to see you succeed!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112624278158624958887", "name": "Keyunna Moody", "time": 1617156002406, "rating": 5.0, "text": "Katherine Zobre instantly got on the phone and started asking my aspirations and future goals. I can tell that she’s really willing and wanting to help build my brand and I am ready.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "106708620237881186292", "name": "Brenda Jones", "time": 1617154451668, "rating": 5.0, "text": "Katherine Zobre is amazing!  She's a great listener,  very helpful and she has given me some excellent ideas!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "115516258032654905592", "name": "Jaded Me", "time": 1598383902274, "rating": 5.0, "text": "We are starting a new online clothing boutique and we were accompanied by Katherine Zobre. She was very helpful and well equipped with valuable information to help get our business up and running. Since our 15 minute phone call, she has been very attentive to us and our needs by offering links, requesting feedback to doing what she advised us to do, as well as offering her time again for another phone call. We are very excited for our journey with our business and this was such a great experience. It has helped us prepare and get just that much closer to our goals and success.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "113358471372122100087", "name": "nehemiah edison", "time": 1604334717179, "rating": 5.0, "text": "Katherine of the Small Business Development Center took time out to help and said if I ever needed help, send her messages and she’ll help. I love that someone is taking time to help someone so young like me to chase my dreams and change them into a reality. Thanks so much for helping me. Everyone starting a business should look for an advisor who won’t mind helping you no matter what and that is exactly what I have found.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "118091467482662166548", "name": "Latoya Sanders", "time": 1610598838091, "rating": 5.0, "text": "Today was my first phone interview with ASBDC counselor Katherine. She was very helpful and was able to point me in the right direction immediately. I'm excited about progressing my business with her advice and looking forward to the next meeting!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109805436112633471268", "name": "TUTR Team", "time": 1613407073667, "rating": 5.0, "text": "This service to early entrepreneurs is amazing. TAKE ADVANTAGE TODAY! Katherine Zobre specifically is kind, understanding, and very helpful.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "101931614563113828826", "name": "MiMi Wilder", "time": 1602540273224, "rating": 5.0, "text": "So far, I have only had one phone conversation with Katherine Zobre, but her guidance has been invaluable. She has given me great advice and the needed steps to get my business off the ground. I appreciated her patience with my many questions and her in-depth responses were exactly what I needed. I am super excited about this partnership.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109770837285608593304", "name": "Ashley Terry", "time": 1617212068236, "rating": 5.0, "text": "Very helpful, and I would recommend this program to any one who needs help starting a business.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "104657527575093948739", "name": "Susan Cornelius", "time": 1598488790796, "rating": 5.0, "text": "Very excited to talk with my personal representative.  Katherine was very knowledgeable and thorough.   Very encouraging and motivating.  She was able to answer my questions and give me direction.  She promptly followed up with recap of our meeting.  I anticipate her services to be very helpful in assisting my small business.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "100623667939664696212", "name": "Sybrynia Watts", "time": 1610657816827, "rating": 5.0, "text": "I am so excited about this business relationship with the SBDC and it's Coaches.  They offer a wealth of services, information, and a live support team at no cost.  Truly a blessing to small business owners like myself!!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "111107904180874186840", "name": "Marc Goldsmith", "time": 1611803014215, "rating": 5.0, "text": "Amazing assistance to help grow your business, I speak with Katherine and she truly cares and give cutting edge advice. Highly recommended for entrepreneur's seeking growth!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112266691873025166856", "name": "Michael Plumley", "time": 1598306914584, "rating": 5.0, "text": "I was given SBDC from 58inc and I am so glad they did. They make you feel very important and that you and your business matters. Katherine Zobre is very knowledgeable and professional. She listened to everything I said and typed as I talked to her and then sent me everything I said to approve it. I would recommend SBDC to anyone getting started with a business they are amazing.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "115779831004785541081", "name": "LEVELS CEO", "time": 1612960831190, "rating": 5.0, "text": "Thank you Katherine for being a great business resource and mentor for me!  The services this business provides helps no matter where you are in your business journey, as long as you are willing to do the work!!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "110383436241994909463", "name": "Jamal Commander", "time": 1609985520462, "rating": 5.0, "text": "I have had the pleasure of working with Katherine Zobre so far and it has been amazing. She has given valuable information and aided in the startup of our business so far. The ASBDC has a great model and I am a huge advocate and will definitely share with friends.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "103145855419034974945", "name": "Kierstan Lee", "time": 1608252863575, "rating": 5.0, "text": "Katherine Zobre is the absolute best at what she does. She is very professional and extremely responsive. I look forward to our future conversations.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109369576739329420495", "name": "Halei Moss", "time": 1598529964532, "rating": 5.0, "text": "Ms.Zobre was so helpful with everything I needed. She explained each step and what those steps meant. I gained a better understanding of what I need to do and she made me even more excited to get my business started! I will definitely talk with her more along my journey of getting my business started.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "107348651752831083307", "name": "ML Stewart", "time": 1604340110859, "rating": 5.0, "text": "I recently had my first phone business review with Katherine Zobre. She was able to answer all of my many questions, as well as provide me with guidance and information on how to proceed on my first business venture. I’m still a bit nervous, but knowing that I have someone as knowledgeable Katherine to speak with puts my mind at ease.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "105486027068244592933", "name": "Selena Rodgers Dickerson", "time": 1599235302228, "rating": 5.0, "text": "Working with Ms. Zobre helped me feel like I have support. I knew SBDC had some resources, but after a short, one-on-one conversation with her, I learned of so many things that I had been struggling with understanding were within reach and available through the SBDC. I feel relieved.\n\nS. R. Dickerson, President\nSARCOR, LLC", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112335072265204077576", "name": "Jacob Kilgore", "time": 1599083295869, "rating": 5.0, "text": "Very appreciate of Katherine Zobre. She answered many questions I had and was eager to learn more about my upcoming business plans in order to assist me in any way possible. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "114362848565905943182", "name": "Tanesha Williams", "time": 1608144697305, "rating": 5.0, "text": "Katherine Zobre took the time to answer ALL of my questions. Her guidance was step by step and very much appreciated!!!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "108794769249433402216", "name": "Carla Blake", "time": 1598448879460, "rating": 5.0, "text": "ASBDC is offering me the ability to develop as a business owner and reach my potential. We are growing jobs!!!! The mentorship I am receiving has paid off exponentially in a short manner of time. Katherine Zobre is my mentor and she is knowledgeable, warm, and engaging. An invaluable resource in a challenging economy.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "111008811254862798959", "name": "Tiesha Gresham", "time": 1602857887848, "rating": 5.0, "text": "My experience working with ASBDCN and Katherine Zobre has been amazing. I was able to speak with her one on one and create an outline of where my business is and where it is going. The information that was provided to me will be very instrumental in taking my business to the next level. I am so excited and can not wait until our next meeting!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "110203370210973461811", "name": "Dana Payne", "time": 1602278552104, "rating": 5.0, "text": "Katherine Zobre is passionate about what she does and it reflects when she advises and assists you in establishing and meeting your business venture goals. She guides you every step of the way and if there is an area she cannot personally assist with then she has the name and number of someone that can. She’s an excellent advisor and cares about you achieving a successful business. Always there to hold your hand along the path to creating a business that aids in growing Alabama’s economy. Thanks SBDC!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112597591197345690965", "name": "Michelle Aldridge", "time": 1600904337886, "rating": 5.0, "text": "Speaking with an advisor really eased my mind about taking the leap to go into business  for myself. They were very knowledgeable and answered all my questions. I feel they really care that I succeed in my endeavor.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "100563794591828852667", "name": "Nick Tyler", "time": 1602610544803, "rating": 5.0, "text": "Extremely professional. Love how they take the time to make sure you are informed and comfortable with business. I will continue to go back with them as my business grows.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "103752886922655130583", "name": "Dennis Echoles", "time": 1603316127454, "rating": 5.0, "text": "The communication I have been afforded the opportunity to be involved with has been very valuable. My conversation with Katherine Zobre was an awesome and rewarding experience.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "102327323909291707065", "name": "Jarkeshia McGahee", "time": 1605290694328, "rating": 5.0, "text": "Katherine was very prompt and helpful. She is helping me to get everything in order for my business. Thanks!!!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "118232973818332244173", "name": "wei li", "time": 1603331882209, "rating": 5.0, "text": "I had first consulting session today. It's brief but constructive. I'm looking forward to the next meeting.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "117343697733274548875", "name": "Sarita Colvin", "time": 1602723906909, "rating": 5.0, "text": "I have been working with ASBDC for the past two weeks; Business Planning 101 and individual consults. I have been pleased with the professionalism and the information provided. Ms. Zobre has been very knowledgeable with the information I've needed and I am looking forward to continued collaboration with her.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "101610144769610565689", "name": "Raquel T Green", "time": 1582475302155, "rating": 5.0, "text": "Katherine Zobre is an amazing business advisor. In just one brief 30-minute call she provided the most thorough compilation of support and expertise She is very personable and knowledgeable. Guiding me towards the next steps in gaining complete success with my business endeavors. Showing me my strengths and weaknesses, and even better the resources to both use them and improve them. Her passion for my idea as well as my success is remarkable. She is a coach, cheerleader, and mentor all-in-one!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "100593504616965812515", "name": "Jaz S", "time": 1591894340046, "rating": 5.0, "text": "I am working with Katherine Zobre and I am thoroughly enjoying the services that I am receiving from her. She is transparent, honest and I can tell that she wants me to have all essential components to make my business as successful as possible. I look forward to the growth of my company with her assistance! I’d highly recommend her for additional assistance and business needs.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109413757704682677123", "name": "Claudine Land", "time": 1602809962068, "rating": 5.0, "text": "Katherine is a consummate professional. She took the time to listen to my business needs and generated information for my business growth and development.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "108779211823362864830", "name": "Ingadi Flower Farm", "time": 1604592384103, "rating": 5.0, "text": "Great help!  Katherine Zobre is an outstanding resource for starting a new venture.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "107650527076798932057", "name": "ranilda lipsey", "time": 1598283597664, "rating": 5.0, "text": "It was a pleasure to speak with my representative at ASBDC. She was very knowledgeable and gave me the boost of motivation I needed after hitting a temporary wall. I can't wait to get back on track!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "113937363645765324509", "name": "YOGI DADA", "time": 1596831385259, "rating": 5.0, "text": "I am ALREADY in love with the ASBDCN! I reached out just last week and received two phones call since then confirming what I need and how to move forward. Katherine Zobre...I am already in awe! I have GREAT expectations I will not be the same as I proceed through this program.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109093736821013538731", "name": "Leah Pogwizd", "time": 1594578236309, "rating": 5.0, "text": "I am starting to work with Katherine Zobre, who is helping me start my new business. She is friendly, professional, and thorough. It is an amazing resource - and totally free! I look forward to working with ASBDC to develop as an entrepreneur.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "113599490898515550813", "name": "Russ McLeod", "time": 1567104920943, "rating": 5.0, "text": "Katherine was extremely friendly and very approachable in our conversation. The entire time,  I felt as if I was speaking with a friend that was looking out for my best interest. I asked for her background and it was jaw dropping the experience she has and the life she has lived. I was truly amazed to speck to someone at her caliber. Thank you for making the first steps of my new journey so awesome.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "107356288238717079164", "name": "Adrian Latham", "time": 1603981430086, "rating": 5.0, "text": "I have started working with Katherine and she is friendly yet very professional. She took time to listen and really assist with all my questions. I’m looking forward to our next meeting.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "103986132661777618610", "name": "Stephanie Hicks", "time": 1583429018181, "rating": 5.0, "text": "Katherine is an awesome mentor. I feel like she is an encyclopedia on business. Although I have a B.S. in HR and M.S. in Management, I am receiving some topnotched advisement and more importantly encouragement. This new entrepreneur is extremely grateful.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "102232602287241733401", "name": "MICHAEL HOLMES", "time": 1597323329087, "rating": 1.0, "text": "The sba might help white people. If you are a foundational black American  they are not going to help you nor communicate with you. SBA only collect black businesses information for EOC purpose.They will not help you get anything tangible for you business if you are black.\n\nMr . Jerry Ellison is the only person that will call you back and actually help you. He is a great man and is never to busy to help unlike the others at sba.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "106681301927380835413", "name": "Jeremy Hoggle", "time": 1586526959114, "rating": 5.0, "text": "I've had one meeting so far and wow!  The advisor was extremely helpful and very knowledgeable.  I will be scheduling more meetings as time allows.  I highly recommend contacting the Alabama SBDC Network.  You will not regret it.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "104455880800363945995", "name": "D. Gulledge", "time": 1583196664839, "rating": 5.0, "text": "Still early in the process, here, but Katherine with ASBDC has been exceptionally resourceful and timely in her responses. As intimidating as it seems to start a business, she conducted our first phone call with professionalism and nonjudgmental listening where she later provided many key insights for me to take advantage of. I feel like I have lots of homework to do, however, another advantage was that she made it clear that you're never too early or too late in the process to make progress towards your business and financial goals.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "113637077907048987937", "name": "Pamela Foster", "time": 1592162258511, "rating": 5.0, "text": "I had a very in-depth consultation session over a short period of time in order to assist me in planning and moving forward with my business.  Excellent consultation!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "115816393707704005616", "name": "Tatiana Thomas", "time": 1593523585360, "rating": 5.0, "text": "Ms. Zobre was amicable and very helpful in the advising call. I will definitely continue to use this service in the future.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "106861456167858054945", "name": "MGLC Selma (McRae-Gaines)", "time": 1594244412642, "rating": 5.0, "text": "I had a very good call with Katherine Zobre at Alabama SBDC Network and received some very helpful advice for our small non-profit going forward. I look forward to continuing the conversation.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "103777757213318779110", "name": "Jevon Lewis", "time": 1579722906730, "rating": 5.0, "text": "Katherine Zobre has been true to her words and has really been on point sharing valuable information for starting a business. I feel like I'm behind trying to catch up to her. Very much appreciated.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "101641971033697567281", "name": "Wes Hurst", "time": 1584036193461, "rating": 5.0, "text": "Katherine Zobre was extremely helpful with understand how the format of create a business goes and the willingness to help make sure I succeed with my business.  If you are not using this service whether you know what you are doing or not, you are missing out on many resources and all kind of knowledge from them.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "108730393893461746891", "name": "Hannah Gils", "time": 1592423830840, "rating": 5.0, "text": "Katherine with ASBDCN is very helpful! She's connecting me to the right resources, while answering my small business questions.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "111161303869644090319", "name": "Elizabeth Wynn", "time": 1579404387790, "rating": 5.0, "text": "I'm beginning my journey on opening Black Warrior Apothecary in the very near future. I am a handcrafted business which can be complex. Katherine Zobre is my advisor and she has done an amazing job in the short time I have worked with her. Katherine gave me a ton of insight on marketing, price point,  business planning, taxes and the proper licenses my business needs. The team at ASBDC has done an amazing job and I look forward to working with them in the future.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109918575815977543785", "name": "Corey L. Hartman, MD, FAAD", "time": 1585851752556, "rating": 5.0, "text": "So informative and helpful. A fantastic resource for any business owner. I highly recommend Katherine Zobre in particular.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "108609361953506960291", "name": "Autumn Sanders", "time": 1585247589542, "rating": 5.0, "text": "I had a great conversation with Katherine about actionable steps we can take to meet our goals. I will definitely keep in touch and recommend their services to entrepreneurs at any stage in the game.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "107640443567279733512", "name": "Bruce Williams", "time": 1595829579576, "rating": 5.0, "text": "I had a great experience working with Katherine Zobre. I look forward to working with her in the future.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109852605733526720353", "name": "Daniel Hallmark", "time": 1586533571030, "rating": 5.0, "text": "The ASBDC was exceptionally helpful in getting my new IT Consulting business started.  I am a new business owner, self-employed, with no prior background in business operations.  Katherine @ the ASBDC took time to find out where I was at, my goals and plans, and provided customized advice to help me reach my objectives.  She answered all of my questions and also provided a checklist of items to consider to ensure that all of my bases were covered.\n\nI really liked that the service was not only comprehensive but also personal. The interviews followed a structured process to make sure nothing slipped through the cracks, but the output of the program was\na set of recommendations tailored to my individual business needs.  Katherine was also extremely easy to talk with, which was great considering I was a bit nervous about starting my first business.\n\nI highly recommend any new or prospective business owners to check out the resources that ASBDC has to offer!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "101833510547668896082", "name": "Shawn Blackburn", "time": 1563911382803, "rating": 4.0, "text": "Outstanding help and support.  I was all over the place with my new business startup.  The Network was able to refocus my attention on details and prioritization.  They offered a suite of tools that were simple and easy to understand.  Their guidance is a must have if you plan to be successful over the long-term.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "103836568790275101165", "name": "Jay Coleman", "time": 1594254083551, "rating": 5.0, "text": "1st initial impression is, SIMPLY AMAZING! Look forwarding to this journey with ASBDC...", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112435593777272781939", "name": "Lynn Minor", "time": 1586041633440, "rating": 5.0, "text": "Being a fairly new business I am gaining great knowledge of on how to not only operate but being successful", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "104276913531549502237", "name": "Swyft Ryde", "time": 1581533986658, "rating": 5.0, "text": "Incredible consulting services and extremely flexible working with our schedules! Katherine at ASBDC was very thorough in reviewing our business information to date and working with us to navigate to the next stage of development.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "102366087835120814041", "name": "Rachel Robinson", "time": 1580819338983, "rating": 5.0, "text": "Katherine is awesome and was quickly able to determine the steps I need to take towards making my business(s) better and put me in the right direction. I'm excited for what's to come!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "115867315255986995682", "name": "Jack Towns", "time": 1584592068566, "rating": 5.0, "text": "ASBDC is quick to jump at the opportunity to help you with piles of material and information for to you get started, keep going or finish strong. Im in the process of starting my own business and I was sorta lost and wasn't sure where to begin, a friend told me about ASBDC and I shot them an email and we had a great phone call interview. Still in the beginning stage so I will keep  you posted on how it goes", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112708424519704145194", "name": "Shay Gray", "time": 1562772152395, "rating": 5.0, "text": "Katherine Zobre is the best Business Advisor. She has given me so many resources and information that I did not know existed. She is very knowledgeable and very detailed with her information. I am blessed to have Katherine as my business advisor!!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "114020892503821518213", "name": "Michael Kortman", "time": 1570127980741, "rating": 5.0, "text": "Just had my initial consultation with Katherine Zobre of the Alabama Small Business Development Council.  She was very knowledgeable about operating a small business and helped me greatly in determining my next moves to make my business work better.  I wish I had found this resource a year ago!  Thank you!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112455101997884773446", "name": "Alycia Levels- Moore", "time": 1582507820975, "rating": 5.0, "text": "Super helpful and amazing place to get resources to get you started on your way. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "111228505569680201161", "name": "Mark Rubino", "time": 1586549871008, "rating": 5.0, "text": "Katherine Zobre was extremely helpful and reassuring in guiding us through the PPP and EIDL programs this afternoon. Many thanks to Katherine and the ASBDC team!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "103206676951010694997", "name": "Bonnie Nicks", "time": 1556883484397, "rating": 5.0, "text": "My advisor has been prompt, well-informed, and encouraging. Equally important she has worked to insure that I stay on track and has not allowed me to fall between the cracks. She checks in on my progress in a timely fashion.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "116148025896802047455", "name": "Kristin Boyd", "time": 1580325698031, "rating": 5.0, "text": "Katherine Zobre has been very helpful. She has given me useful, objective, and constructive advice that is helping me get my business established.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "100285372841567090130", "name": "Péricles Augusto", "time": 1580012636415, "rating": 5.0, "text": "Great experience, they tried very hard to reach me, gave me all the information I needed and pointed me in the direction regarding to specific topics.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "117864358445488838715", "name": "Travelodge Tuscaloosa", "time": 1587991836314, "rating": 5.0, "text": "They are very knowledgeable and willing to help. I got answers and information that helped me complete the application process.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "110082236950105964983", "name": "DJ ALLEN", "time": 1586284331413, "rating": 5.0, "text": "Very good resource. Katherine was very helpful and encouraging.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109544417929018353918", "name": "HILLUT91", "time": 1579727014061, "rating": 5.0, "text": "Wow!  What a wealth of information coming out of my first call.  If you've ever thought about starting a business, give these folks a shout and hold on.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "101438430989112218770", "name": "TheBuzzsaw16", "time": 1598647777494, "rating": 5.0, "text": "Katherine called me right on time and listen to my concerns about my small business.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "110561432111611562879", "name": "Joel Kervin", "time": 1556908090966, "rating": 5.0, "text": "Truly an amazing resource! If you are thinking about starting your own business, ask for their help FIRST! Extremely knowledgeable and helpful staff.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "110071311114313594074", "name": "Denise Trayvick", "time": 1546000285500, "rating": 5.0, "text": "Katherine Zobre is awesome.  I had so many questions.  She took the time to listen and answer them all.  She also sent me the information to get me on the right path.  I highly recommend Alabama Small Business Development Center Network", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "117284190608121841222", "name": "Ted Price", "time": 1556812183466, "rating": 5.0, "text": "Jerry Ellison has been such a big help.  The ability to get straight answers in a timely fashion is valuable, especially for a small business.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "110944869426538145139", "name": "Jeremy Huckaby", "time": 1559792478395, "rating": 5.0, "text": "Alabama SBDC is an incredible organization with which to work. I know this from personal experience and interacting with their great personnel. They have had an amazing impact on Sprayroq's export business and continue to support export opportunity pursuits for our business.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109022181226044282661", "name": "Erick Bloomfield", "time": 1556819601294, "rating": 5.0, "text": "Mr. Washington with the SBDC, at the USA campus office, was awesome. He answered all of our questions and supplied us with with contacts to get our first brick and mortar shop up and running. If you need help and don't know where to start. Make an appointment with the SBDC. And it's free. They really do help you get started.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNwac27lf69B8SvkwDeMz63yiiUk5tKY7Bs-eIk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "117312708642364826162", "name": "Mica Angelita", "time": 1572190867831, "rating": 5.0, "text": "My consultant was very dedicated to me and managed to meet all my needs, definitley 10/10.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "104556893682209892229", "name": "Stephanie Foley", "time": 1556666241981, "rating": 5.0, "text": "They are amazing and so helpful! They care and want to help you succeed by answering all of your questions and giving you invaluable resources!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "106460908893806201249", "name": "Joanna Lemmon", "time": 1559854006132, "rating": 5.0, "text": "Katherine has been so helpful and I am so excited about her being a resource for me to start a new business here in Tuscaloosa.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "111531135119080229604", "name": "Author LaMonique Mac", "time": 1562138298060, "rating": 5.0, "text": "Kathryn, my free business coach is insightful and helpful. Thank goodness for her knowledge and guidance.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "107732671517580603955", "name": "Tyler McGovern", "time": 1562769902834, "rating": 5.0, "text": "Incredible wealth of knowledge. They help you get the exact resources you need.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "102854627994233485090", "name": "Tumbleweed54", "time": 1544063066200, "rating": 5.0, "text": "Opening a business can be a complicated and stressful process. Ms. Zobre is very prompt, knowledgeable, and understanding in making this process a lot easier. We feel very fortunate to have this professional and ASBDC assist us in achieving our goal.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "105440550461069986891", "name": "Najah Bell", "time": 1548819469084, "rating": 5.0, "text": "ASBDC will change the way you run your business. Extremely informative and a great support system.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "114175021614551675201", "name": "Trevin Fluker", "time": 1546455964073, "rating": 5.0, "text": "Katherine Zobre is a great adviser who helped me move past having an idea to actually focusing on tangible steps to starting my business.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "110744671922039398780", "name": "Anastasia Peinitz", "time": 1546971134158, "rating": 5.0, "text": "Soon after my registration with ASBDC I noticed the care and proffessionalism. An appointment was made right away and communications began.\nKatherine Zobre took a lot of time, listened to all my questions, and took notes. She is also super friendly. I look forward to go through this process with her. I think it is awesome to get this kind of help.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "115628836284122924200", "name": "Caleb Collins", "time": 1548865779611, "rating": 5.0, "text": "The sbdc has been great so far in helping me start up my new innovational technology business. They have helped me in ways of guidance and information as well as directing me to other resources to help me progress.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "105163813052378773488", "name": "Yanna Johnson", "time": 1568213483221, "rating": 5.0, "text": "Love the services!! Katherine is awesome to work with", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "101205988053872501502", "name": "Rain Blankenship", "time": 1586463044910, "rating": 5.0, "text": "Very caring and professional treatment.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "113322271588901623582", "name": "Teresa Carter", "time": 1536862214029, "rating": 5.0, "text": "Ms. Zobre was great she helped me with everything I asked.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "115421129537424134302", "name": "CAK Medical", "time": 1581707439551, "rating": 4.0, "text": "Very informative and detailed.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112785193878266302448", "name": "Amy Wright", "time": 1585107041394, "rating": 5.0, "text": "So much valuable information!!!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "111756501185496215651", "name": "Dawen Li", "time": 1560872778373, "rating": 5.0, "text": "Very good service on small business", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "100022798303028756996", "name": "Robert Armstrong", "time": 1548881048615, "rating": 5.0, "text": "Awesome group of people to work with!!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "116101873367470334259", "name": "Susie Lawley", "time": 1585676639135, "rating": 5.0, "text": "Most helpful!!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "102121591222429332324", "name": "Dustin Doss", "time": 1556852145929, "rating": 5.0, "text": "Dedicated and professional.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
