{"user_id": "106736756112861494982", "name": "Robert Yoder", "time": 1500258861472, "rating": 5.0, "text": "I know there are a couple of good florists in town, but Sherry is my favorite.  She had always gone the extra mile for me.  I've worked in a school for the last ten years and seen many arrangements come in on Valentine's Day.  I can tell which flowers come from her, because the quality sets her apart.", "pics": null, "resp": null, "gmap_id": "0x88907906e80c3105:0x973ddf6acb01f3f7"}
{"user_id": "115022745302825161386", "name": "tj bailey", "time": 1426350387221, "rating": 1.0, "text": "I ordered flowers on the website, payed with my credit card, then got a call from the shop saying they  needed more money to fill the order. I told them I was not paying anymore money to just cancel the order. The employee told me that they could not and that I would have to cancel the order myself. The website has nowhere to cancel the order on it and the only phone number on the website was the shop.\n\nVery poor customer service.", "pics": null, "resp": null, "gmap_id": "0x88907906e80c3105:0x973ddf6acb01f3f7"}
{"user_id": "103976369969660905956", "name": "Debra Hawk", "time": 1625803966697, "rating": 5.0, "text": "Plant Stand is a new business with a really interesting story. Two best friends created this one of a kind shop. With their love for plants they can transform your home or business to make it a little more brighter and a little more beautiful. It is truly unique as together they took a food truck and totally remolded it to the current look you can see in the pictures. Servicing both residential and businesses, with Plant Stand you will find reasonable prices and friendly service. The owners offer a free 30 minute consultation. Plant Stand offers, great selection, superb customer service and they will take time to educate you on each plant they sale. You can follow the owners on Facebook. Give Karlin or Abby a call and elevate your business today. I personally have purchased many plants from this business you will be truly pleased. plantstandal.com", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNHRrUZjNg3N-asTE3hJ2uwm6MIhdiNqO18gO32=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOvje2cvq6cWo1TCC-2rL8K3iMldarW38ieNPyq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMO3RZCDdMopd5khVnaRGv99KAMOUw5wFGL7NDi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNnW-uGiGaAX2EuKukjjLVmPyqzsoSm0TeRxGGz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNscI49cOnFLgrXactnGzXXtIism0s_YmskHj4k=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMWtX_K7WqrbzACjgZhmfkersnGY_MAiqYStYiH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNYdwVEbt6glj0-X7pp13Ivn8NkAfAe9EzDXi1n=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMKb_UjociTtkhr4IEeq6TztXxCrAo4D8p2OY8V=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPrluw8k4ri3eAWCkn_jId31tw7ASDYdPXxtmLV=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x280567632bf4041:0x2e7b3995ef182807"}
{"user_id": "100854925844024538539", "name": "Caitlin Gray", "time": 1625173112010, "rating": 5.0, "text": "What a wonderful florist! My husband and I were in a pinch to send some much deserved flowers to our mom and they delivered!!! I couldn’t be more proud and thankful of the arrangement they put together. I asked for cheery, bright, and fun! And it’s as if I picked the whole thing out! Great job, beautiful & fresh flowers! we so appreciate you all making this happen same day with incredible work!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP0zgokgu6obCBGTbx3OGhKdlMN-CglSJE_6Yxx=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "117337032357439332012", "name": "Angel Boldin", "time": 1619207929648, "rating": 5.0, "text": "Jenilyn's Creations is amazing. I went to place an order for a sympathy arrangement and saw online they do not deliver on weekends. I called the store and was informed the arrangement would be delivered that day. Thanks so much!", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "107649530267655429799", "name": "joanna sanders", "time": 1615394056149, "rating": 5.0, "text": "I have ordered  from them before   & they are amazing", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "112362795904868370736", "name": "Don Mitchell", "time": 1589132984772, "rating": 5.0, "text": "Jerilyn’s asked me what did I want I said I don’t know but her fave color is purple, something special for Mother’s Day.  My mom has said over and over again how beautiful her flowers are, “I love them.  I love them!  There’s so many, all purple and and they smell so good!  Thank you thank you!  They just brighten up the whole house, I put them by the fireplace so I see them every time I walk by, I just love them!”  😊", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "108707794223855448769", "name": "Don Ireland", "time": 1593723867750, "rating": 3.0, "text": "Delivery person left the flowers on the porch in 90 degrees did not knocked or ring door bell.  Someone was home all day.  Let's do better Jenilyn.", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "112363881253773273311", "name": "Lori Mercer", "time": 1535124966729, "rating": 5.0, "text": "Sorry everyone - we can't seem to get this listing updated to show our correct address.  The phone number is correct so please give us a call.  We are physically located at 57 Virginia Dale Drive, Wetumpka, AL 36092 (however this is actually in the Town of Elmore between Millbrook and Wetumpka).  We are the closest florist to the Millbrook area.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOf56r-10ndozZ3_NKUVr5z2AC8udxuP3x5B1De=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "117292449014320733361", "name": "Hazel K", "time": 1581200809098, "rating": 1.0, "text": "I paid for next day delivery flowers to be sent to my niece on her birthday. I received a confirmation that they were delivered Late Friday afternoon. I called my niece to see if they were delivered and they were NOT. I immediately called the shop several times and left voicemails. No response - the shop was closed for the weekend. Long story short, they delivered to the wrong address, despite the correct address being on file with the purchase. It was very important for me to send flowers ON her birthday and not 4 days later. It was disappointing and a hassle to figure out what happened. There was no flower upgrade, add on, or partial refund to make up for the huge mistake on their part.", "pics": null, "resp": {"time": 1581218401991, "text": "Please give us an opportunity to research and respond properly to this situation before leaving a negative review. We value every order and do everything in our power to make sure your order is delivered correct and on time. Without know the specifics of this order I can’t help you resolve the problem. I realize it is too late for her birthday but I still need to determine what happened based on how the order was placed. Please send an email to wecare@jenilynscreations.com with your full name, phone number, the recipient, and the address given so we can address this properly."}, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "112111205568377489352", "name": "tls 1024", "time": 1591797065158, "rating": 1.0, "text": "The arrangement was delivered with the wrong card on it. This is not the first time I’ve had an issue with this florist. Last time they offered a partial refund to remove my bad review and I complied but this time I have to give my review. I’m not happy with the arrangement and wonder since the card was wrong if I possibly received the wrong arrangement. Even if not it’s not a very nice arrangement. I could’ve cut flowers out of my garden and stuck in a vase.", "pics": null, "resp": {"time": 1591807109576, "text": "We are sincerely sorry about the card message.  It was a mistake in our office and we take full responsibility for that.  The sender was wanting to acknowledge your family with a gift of flowers and their deepest sympathy.  Again we are very sorry for your disappointment."}, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "115401477121385090638", "name": "Jobelle Collie", "time": 1558321588597, "rating": 1.0, "text": "My son sent me flowers for Mother’s Day last week from Jenilyn’s and my daughter sent flowers from another florist.  They were supposed to look similar, based on online pictures.  I had to lie to my son because he wanted a photo of me with the flowers.  Yikes! If flowers are dead the Monday after Mother’s Day, that’s sad.  The flowers my daughter sent (from another florist) look as good a week later as they did the day they arrived.  Since my children live out of State, they rely on online photos to decide what to send. Please don’t ruin any more holidays please.", "pics": null, "resp": {"time": 1558373717953, "text": "Please give us an opportunity to make it right before leaving a negative review. I assure you we didn’t send out flowers that were less than optimal but we will gladly replace them if contacted directly within a reasonable time. All you have to do is call us at 334-567-3325."}, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "100701437344497079668", "name": "KatMaster", "time": 1492787451690, "rating": 5.0, "text": "We used her when my husband unexpectedly passed away.  She handled me in my grief so consolingly and even met the odd requests of my children for flowers in the arrangement.  The green plants we wanted she was patient enough to help me locate as I knew nothing of their name and could only describe them generically.... patience at its greatest!  We had out of town family and friends place orders through her as well, and there were no complaints on any arrangement.  Definitely my go-to florist for the area for any floral needs!", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "114760716281924291692", "name": "Cynthia Wood", "time": 1551887470891, "rating": 3.0, "text": "Very disappointed in the flowers this florist did for a funeral last week.  I called to let them know I was unhappy and the lady said she would let Jenilyn know but she never returned the call.  I feel that what I ordered and paid for was not what was delivered.\n\nUpdate: I received a call from one of the owners who apologized and offered me a refund which I declined. He said during the holidays they had a lot of extra help and the message was not relayed to owner/management. I am changing my rating from 1 to 3 stars. I appreciate the call back, apology and his offer to refund my money.", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "105790428630669930218", "name": "Ann Sheppard", "time": 1590211524943, "rating": 5.0, "text": "They were very nice.", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "102315330142204959281", "name": "ihatenubs", "time": 1492104032090, "rating": 5.0, "text": "I'll keep the 5 stars rolling. Very happy with everything. Thank you so much.", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "115733979214335974780", "name": "Art Faulkner", "time": 1550175339553, "rating": 5.0, "text": "As usual Jenilyn’s has done a wonderful job again. Not only were the flowers beautiful but I know how hard Jenilyn and the other designers work to make each persons arrangement special.", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "104039263884679701598", "name": "Brenda Brown", "time": 1556907637730, "rating": 5.0, "text": "Great customer service and beautiful arrangements!", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "111125155448434989665", "name": "TRUMP 2020", "time": 1601476876851, "rating": 5.0, "text": "The most flowers for your buck.", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "104149609086416925053", "name": "Thomas Owens", "time": 1526397694430, "rating": 5.0, "text": "A friend's brother passed away the Friday before Mothers day, having called a few florist in Prattville A.L. (town of funeral home) I couldn't find anyone to help. The people were rude telling me it was Mothers day they were either out of flowers or to busy to fulfill the order for delivery on Monday. As I old one of the florist deaths are not planned so giving a better lead time is ridiculous..Enough of the negative..\nI luckily found and called Jenilyns Creations, it was a breath of fresh air to find someone that understood and was very helpful.\nDo not hesitate make your FIRST call to Jenilyn's when doing business Montgomery AL area and save yourself aggravation.\nI want to thank Jenilyn's team for doing what they said!!! And the price was more than fair.. Again Great Job Jenilyn's Creations!!!!", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "109141310763665632184", "name": "Tiffany Marie", "time": 1516633031294, "rating": 1.0, "text": "It's not there, wrong address, sends you to city hall in Millbrook", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "116663697577860589294", "name": "M E", "time": 1466693680656, "rating": 5.0, "text": "**FANTASTIC in every way!** Beautiful work! Fabulous to work with! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "108350980835848761825", "name": "Stephanie Swink", "time": 1486060277936, "rating": 5.0, "text": "⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️\n\nIf  you want it done right always use Jenilyn's Creations!!!! I JUST WANT EVERYONE TO KNOW JUST HOW HELPFUL SHE REALLY IS, YOU WILL ABSOLITELY LOVE HER! 🍁🌾🌺🌻🕸🌸🌼🌷🌹💐🌸🌼🌷🌹🌱🌿🌻🌺🌾🍁🍂🌹🌷💐🌸🌹🌼🌸🌻🌼💐\n\nI wish I could give Jenilyns's Creation 100 Stars! She is beyond helpful and nice. She can answer any question you have for her. With my experience, I just told her this is my friends fav color, fav flower and I don't have a lot of money to apend(everybody nowadays is on a fixed income)!  You can give her different ideas of what you want\nAnd she will\nWork her magic to give you a finished product that will blow your mind...\n\nJenilyn's Creation\nIs the way to go when u WANT  something that will blow your mind at such a reasonable price... and if she doesn't have what you're looking for ,she will do anything to get it for you to make what you want special and just right!!!❤️❤️❤️\n\nShe can use her magic and you will get what you need that  EXCEEDS your  expectations for such a reasonable price! Not to mention she is so polite and helpful. I WILL NEVER USE ANYONE ELSE!! 👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "116747275006819243097", "name": "charles aldridge", "time": 1609354706714, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
{"user_id": "111088471304957544964", "name": "Jack Schlee", "time": 1550176316645, "rating": 1.0, "text": "I ordered flowers twice. Both times they were not what I ordered.", "pics": null, "resp": {"time": 1550173911265, "text": "We are so sorry you had a problem. We just tried to call you and no answer. We’ll be glad to take whatever corrective measure you would like. Please let us know."}, "gmap_id": "0x888e9c2367c5b687:0xda42bc65ae0b8d0c"}
