{"user_id": "106582361027737547180", "name": "Paige Todd", "time": 1597066797754, "rating": 5.0, "text": "Ragan is an amazing decorator with a knack for finding beautiful pieces quickly and cost effectively! She is a consummate professional and a pleasure to work with. She helped me decorate my living room working within a budget AND during quarantine while following ALL safety protocols.  She also helped incorporate pieces I already had to make my budget go even farther. She gave me several styling options after ascertaining my style and preferences and made my room look absolutely gorgeous! I will be hiring her to decorate the rest of my house as soon as I can!  Thank you for giving me a space that I absolutely love to be in! She is very talented and created something I could have NEVER done on my own.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMGjiQA2soqxEK61X3iP3u7dbtHFumL69NSQrDK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPF5BriQifyUOOvwBejb2Puz--OyO1OJkjZEt4_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO6UU-AHwhMNza1Q6M7V7-E-2AU44_PPB8NLvZz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNGGiQ_SNObgqPyIJrW_Ec4FP6dh1_xZjAs81q-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOlQ57OH9KvwJM4ulQJ9Ej6hdYsVTNaOuAA2oH5=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88f5190af7028e25:0x3c65bfcd1a8d687f"}
{"user_id": "100446486527813323282", "name": "Jessica Quinones", "time": 1627436049775, "rating": 5.0, "text": "Ragan was great to work with! Her communication was great and she was able to squeeze my job in quickly. Highly reccomend!", "pics": null, "resp": null, "gmap_id": "0x88f5190af7028e25:0x3c65bfcd1a8d687f"}
{"user_id": "116119206114865228835", "name": "Natasha Fenili", "time": 1619702403264, "rating": 5.0, "text": "Ragan of CEG Home was an absolute godsend for getting our home ready and over the finish line. Her big and small thoughtful touches really brought the best out of our home ...and had to stop and think...why am I selling. Pure joy to work with ...a definite recommend.", "pics": null, "resp": null, "gmap_id": "0x88f5190af7028e25:0x3c65bfcd1a8d687f"}
{"user_id": "112993079339719951812", "name": "Debra Saba", "time": 1618227852803, "rating": 5.0, "text": "Ragan was amazing to work with for our home staging. She was able to design a space that was not only beautiful but livable with a small child and dog. We LOVE the way our home looks and so did the buyers...: under contract in under 3 weeks! We will be hiring Ragan for our new home for full house design! We cannot wait to see what she had in store for our dream house!", "pics": null, "resp": null, "gmap_id": "0x88f5190af7028e25:0x3c65bfcd1a8d687f"}
{"user_id": "111514362995875849500", "name": "Sarah Cappuccitti", "time": 1628201365511, "rating": 5.0, "text": "I cannot recommend Reagan and her team enough when it comes to her staging services. She is thoughtful, responsive and incredibly professional. We were forced to move our closing date and Reagan went above and beyond to make sure everything was coordinated properly and that we were able to adjust our staging dates and times, and on such short notice. She has a great eye, and staged our home beautifully. If you have the opportunity, I highly recommend working with Reagan and the CEG Homes team!", "pics": null, "resp": null, "gmap_id": "0x88f5190af7028e25:0x3c65bfcd1a8d687f"}
{"user_id": "108140029091257181702", "name": "Dale Gaston", "time": 1618241798589, "rating": 5.0, "text": "An absolute pleasure to work with. I am very pleased with the completed project.", "pics": null, "resp": null, "gmap_id": "0x88f5190af7028e25:0x3c65bfcd1a8d687f"}
{"user_id": "103750503094406874435", "name": "Mindy Bell", "time": 1596907866187, "rating": 5.0, "text": "CEG Home Interiors did a wonderful job staging my listing in Smyrna. She executed the plan with ease, made an outstanding transformation of the entire home, and ultimately helped the property go under contract with the very first Buyer who walked in the door. Highly recommend CEG.", "pics": null, "resp": null, "gmap_id": "0x88f5190af7028e25:0x3c65bfcd1a8d687f"}
