{"user_id": "103398741818025010603", "name": "Pam McCann", "time": 1615443475499, "rating": 1.0, "text": "I would not recommend this company for anything. I order the product and they sent me a email saying  my item was back ordered because it was a popular brand. When I contacted them to cancel it they sent me a email saying that I received my order when I didn’t. People please take you business elsewhere.\nPam .", "pics": null, "resp": null, "gmap_id": "0x887d485dd255ec7b:0x8d8e40b820c6e054"}
{"user_id": "108050439844182254076", "name": "Craig Ruvere", "time": 1603902878337, "rating": 1.0, "text": "I ordered a travertine fireplace hearth from them. Paid $700 for it. Shipped perfectly but when I got it in the house and went to lay it on the floor is literally snapped in half and damaged my wood floor! Fighting with them now to try and get some compensation but already feeling as though my issue is unimportant to them as I sit around waiting for a response. I was going to order a mantel from them as well...this has certainly changed my mind. Hoping for a positive resolution.", "pics": null, "resp": null, "gmap_id": "0x887d485dd255ec7b:0x8d8e40b820c6e054"}
{"user_id": "108331979695922377559", "name": "Christy Nichole Goodman", "time": 1619723381181, "rating": 5.0, "text": "I have put in an application there, I hoping to go to work for them!", "pics": null, "resp": null, "gmap_id": "0x887d485dd255ec7b:0x8d8e40b820c6e054"}
{"user_id": "104403527453585181336", "name": "Cherilyn “Cheri” Curths", "time": 1585431578856, "rating": 1.0, "text": "I just got my free standing electric fireplace the wood has little holes all over it. I canot believe a company would send this out like this .trying to get a call back $799.00 is a lot to pay for damaged goods. Cherilyn Curths email Momcat1954@hotmail.com", "pics": null, "resp": null, "gmap_id": "0x887d485dd255ec7b:0x8d8e40b820c6e054"}
{"user_id": "117321743562399713762", "name": "Tammy Ritchie", "time": 1576100367984, "rating": 1.0, "text": "I ordered a curved insert off Lowe's website and got a flat screen instead. I had to pay $85 to send it back. Total rip off never used it. I ordered because I trusted Lowe's. I can't believe that they do business with this shady company called renovations brands.", "pics": null, "resp": {"time": 1627313257206, "text": "I believe that you may have associated us with someone else. We do not sell the product type you have described on Lowes."}, "gmap_id": "0x887d485dd255ec7b:0x8d8e40b820c6e054"}
{"user_id": "117490280132508317207", "name": "Matthew Woodbury", "time": 1535040023846, "rating": 1.0, "text": "They will not help you out if you need it .   They will drag things out and then tell you that you are past the point that they can help you.  As a business owner i can not believe this is the way they treat their customers.", "pics": null, "resp": {"time": 1535062685180, "text": "Hi Matthew - We are so sorry to hear that you had a bad experience. Please let us know what brand you had problems with so we can address your issue and make it right. Have a great day!"}, "gmap_id": "0x887d485dd255ec7b:0x8d8e40b820c6e054"}
{"user_id": "113749558211599742982", "name": "ric james", "time": 1523527793388, "rating": 5.0, "text": "This could be a long story, but I'll try to make it short. Haha. The people here were absolutely amazing. Did everything they could to help me out. I was on vacation with my family and my car broke down. Sam's payment center happened to be a uhaul. I was able to rent a dolly, how hitch and necessary equipment to tow my car back to Chicago. Very helpful people. Great place to spend some money on used electronics as well.", "pics": null, "resp": null, "gmap_id": "0x88892d92ea9ad6bb:0x2eeb6ae5706ad683"}
{"user_id": "106642582597955901444", "name": "Karen Kinlocke", "time": 1544014192342, "rating": 5.0, "text": "Very helpful and accomodating.", "pics": null, "resp": null, "gmap_id": "0x88892d92ea9ad6bb:0x2eeb6ae5706ad683"}
{"user_id": "118187977868860816571", "name": "Viva La Sammy", "time": 1507572769602, "rating": 5.0, "text": "Nice place", "pics": null, "resp": null, "gmap_id": "0x88892d92ea9ad6bb:0x2eeb6ae5706ad683"}
