{"user_id": "108092536784205277650", "name": "Zigi Onye", "time": 1599336570634, "rating": 4.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x8862689fa0e1d4b3:0x17a4eaf47c392307"}
{"user_id": "102404628161888105457", "name": "Simeon", "time": 1448054909054, "rating": 4.0, "text": "Helpful staff. Very welcoming", "pics": null, "resp": null, "gmap_id": "0x88626f82f5dea379:0x441e41c8990bb38d"}
{"user_id": "108092536784205277650", "name": "Zigi Onye", "time": 1549927111513, "rating": 4.0, "text": "Cool.", "pics": null, "resp": null, "gmap_id": "0x88626f82f5dea379:0x441e41c8990bb38d"}
{"user_id": "107518830114998563835", "name": "Monique Martin", "time": 1591309984642, "rating": 1.0, "text": "They have the most illiterate workers ever, my monthly payments I've been making are going towards interest and not my balance after asking for a statement of my payments they mail me a broad breakdown instead of detailed of when my payments are actually being made. Had an incident where a payment was debited from my acct after being told they don't store info which im not understanding how when i never provided anyone with my checking info. No one could give an explanation and the supervisor had an attitude when trying to rectify the situation. Im utterly disgusted with this company.", "pics": null, "resp": {"time": 1591363281115, "text": "Hi, we are sorry to hear about the experience you have had with Republic Finance, LLC (Republic Finance). Republic Finance strives to provide excellent customer service and your feedback gives us an opportunity for improvement. If you would like a member of our customer solutions team to reach out to you, please go to republicfinance.com/contact and leave a comment with your name and telephone number."}, "gmap_id": "0x889bb2e6f53aaf8f:0x2c8a30292779993c"}
{"user_id": "107276662725774465528", "name": "Shunta' King", "time": 1505237069243, "rating": 5.0, "text": "The customer service is awesome.  Representatives are always being helpful.  This is one of the best loan offices in Mobile. I am very pleased.  I would recommend them to anyone.  The monthly payments are very reasonable with the amount they give you. Regina was my representative and she did a great job.", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53aaf8f:0x2c8a30292779993c"}
{"user_id": "107734039089114922200", "name": "Norma Webb", "time": 1561341774372, "rating": 1.0, "text": "Can never pay online! Always says wrong account number although account number is same as account number on contract", "pics": null, "resp": {"time": 1576266125924, "text": "Dear Norma, thank you for your feedback & patience with our response! If you are attempting to make a payment online using your bank account and routing number, you must enter your account number, which is a combination of the account and contract number, using numbers only. Do not include the slash when entering the account number (Example: 123456789). When entering a date of birth, the following format must be used (MMDDYYYY). If you are attempting payment using a debit card, your account number will be a combination of your branch ID and Republic Finance account number (Example: 12-3456-78910). If you have any further questions, please use our branch locator tool to find the branch closest near you to speak with one of our office employees at www.republicfinance.com/branch-locations. Thanks!"}, "gmap_id": "0x889bb2e6f53aaf8f:0x2c8a30292779993c"}
{"user_id": "100685165610936563837", "name": "Kitty Kelly", "time": 1491924373926, "rating": 1.0, "text": "CALLED OUT MY BANK ACCOUNT NUMBER TWICE IN WHAT SOUNDED LIKE A BUSY OFFICE. ARE YOU KIDDING ME?!", "pics": null, "resp": null, "gmap_id": "0x889bb2e6f53aaf8f:0x2c8a30292779993c"}
{"user_id": "105010044700874153966", "name": "Corey Covington", "time": 1582527111153, "rating": 2.0, "text": "I have been with Pen Air for 5 years. And i am currently looking to do business somewhere else.  I have tried to get small  loan twice but was turned down.     Alot of people i know use to do business with them but have went else where.", "pics": null, "resp": null, "gmap_id": "0x889a6823925a7fc5:0x49019e92156cad77"}
{"user_id": "106966586805243563557", "name": "Cathy King", "time": 1511070689222, "rating": 5.0, "text": "Staff is excellent, knowledable, and has time to spend with you.  They are also polite and accommodating.", "pics": null, "resp": {"time": 1511191581972, "text": "Thank you, Cathy! We are so thrilled to hear that you are receiving the great member service that you deserve. We always welcome your feedback, and thank you for being a loyal member of Pen Air."}, "gmap_id": "0x889a6823925a7fc5:0x49019e92156cad77"}
{"user_id": "100651302785902767933", "name": "E H", "time": 1471612137934, "rating": 5.0, "text": "Friendly with great rates. Wish they had more locations in baldwin county like Fairhope and Daphn. A mobile location or two as well, but I am grateful for this location. I believe the atm doesn't accept deposits only withdrawals but there is a over night drop box.", "pics": null, "resp": {"time": 1471617040609, "text": "Thank you Edmon for your 5-Star review and for your feedback on additional locations. We definitely like to hear where our members would like to see us. Thank you for being a member!"}, "gmap_id": "0x889a6823925a7fc5:0x49019e92156cad77"}
{"user_id": "107632895411068061047", "name": "Stephen Eubanks", "time": 1497548322117, "rating": 5.0, "text": "Awesome Place to handle your financial affairs.  Staff is very professional and friendly.", "pics": null, "resp": null, "gmap_id": "0x889a6823925a7fc5:0x49019e92156cad77"}
{"user_id": "110419110930698763490", "name": "Luna Beristain", "time": 1628879644294, "rating": 1.0, "text": "By appointment only. Very inconvenient!", "pics": null, "resp": null, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "106872604247191968752", "name": "Kenneth W. Ponder", "time": 1624839077131, "rating": 3.0, "text": "Not a co-op  credit union atm", "pics": null, "resp": null, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "106597973643975773636", "name": "South Pointe Apartments", "time": 1587482330943, "rating": 5.0, "text": "Everyone has always been extremely professional and friendly to me. Anytime that I needed assistance I have been able to sit down and discuss things out with the employees. I highly recommend Pen Air Credit!", "pics": null, "resp": null, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "110594889201757658582", "name": "Larry Price", "time": 1620767688439, "rating": 1.0, "text": "BEWARE!!!  Assistant Manager allows employees to notarized documents without the presence of the individual being there! Also goes into accounts and stalks their accounts and memorizes account numbers! This is why I no longer use them and have since opened up an account at Alabama Credit Union!", "pics": null, "resp": null, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "112785626489555667542", "name": "Teresa KIchler", "time": 1603137456230, "rating": 1.0, "text": "Only one line out of 3 open for live teller. That is not good business. I had to wait in line 15 minutes.  I’m very unhappy. When is the lobby ever going to open up", "pics": null, "resp": null, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "112183024657499154639", "name": "Candice Bramlett", "time": 1538616338694, "rating": 5.0, "text": "I went into the Foley branch with family to do some banking business. I am not currently a member, however I am considering moving my personal banking to PenAir simply because I witnessed first hand the exceptional service they provided to my Aunt like they were her family as well. This branch has great staff so pleasant and welcoming. True southern hospitality.", "pics": null, "resp": {"time": 1538690328387, "text": "Wow, Candice! We are thrilled to hear that you are considering moving your banking relationship to Pen Air! We would love to be your trusted financial partner, and look forward to serving you! Thank you for sharing your experience with us."}, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "101240209008876164124", "name": "Joseph Preite", "time": 1537972999003, "rating": 5.0, "text": "Went in today to take care of some business and everyone is always so nice there. I love the new live Atm's. I have my loans there so will be moving my personal and business accounts there first thing in the morning. Billie will bend over backwards to help you out with whatever banking issues you may have.", "pics": null, "resp": {"time": 1538137170996, "text": "Hi, Joseph! We are thrilled to receive a 5-start rating from you! Thank you for taking the time to let us know of the level of member service we are providing to you. We value our relationship with you, and look forward to being your continued financial partner. PS, the LIVE machine are pretty awesome, aren't they?"}, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "113728195089322213634", "name": "Tarius Sledge", "time": 1625596195063, "rating": 5.0, "text": "Amazing", "pics": null, "resp": null, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "117885107834909606849", "name": "Tori Applegate", "time": 1495663354429, "rating": 1.0, "text": "I had an account get overdrawn. I missed the thirty day pay back mark by TWO DAYS. I didn't get a letter or anything of the sort. They didn't say it went to collections when I paid it off. The account never closed and stayed in \"good standing\". Got a ping that I had a new derogatory mark on my credit, a collection. I went up to the credit union as soon as I saw it and asked if anything could be done. They said no. So thanks for nothing at all. I will be closing my account ASAP and will recommend penair to no one. AL Credit Union is such a better choice and they forgive if you forget by a day or two to pay something. Not to mention they try to help you build your credit not ruin it.", "pics": null, "resp": null, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "103000239273997700967", "name": "Jennifer May", "time": 1613763611036, "rating": 1.0, "text": "I have been a member for over 10 years and a CSR at the Foley Alabama branch persuade my husband while banking there. He has left my 3 kids and I for said woman and the bank decided to handle it by terminating my membership and promoting her to managers position. Pen Air has no ethics or moral standing.\nOn its website, the credit union boils down its brand promise to this: “We promise to value and respect the trust you’ve placed in us.”\nIf only that were true...", "pics": null, "resp": null, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "112584669971214097435", "name": "Brandon Sylvester", "time": 1562882282875, "rating": 5.0, "text": "I have been with this credit union for 12 years and they are always friendly and helpful.  Felisa Merryfield Helped me with my HELOC and a recreational loan.  She was fast and helped find the best loan to suit my situation.", "pics": null, "resp": null, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "102221642196898365238", "name": "Ethan Lewis", "time": 1502301331455, "rating": 5.0, "text": "It's like a family here. Great bank. Fantastic service. Best option around hands down. I'm so glad I switched from Regions.", "pics": null, "resp": {"time": 1502301997456, "text": "Ethan we're so glad you feel like family! We value our members and respect and value the trust you've placed in us. We couldn't be happier. Thank you for the 5Star Review, and thank you for being a Pen Air Member!"}, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "102632414601158435958", "name": "Good Citizen (Good Citizen)", "time": 1495049048761, "rating": 5.0, "text": "Very pleased with the overall experience at this branch in general. I'm especially pleased with Rachael Hambric's service and professionalism. I have been a long time customer of Pen Air's, have obtained multiple loans and Rachael has been my POC in every single one. Great experience overall.", "pics": null, "resp": {"time": 1495213362899, "text": "Alain - Thank you for taking the time to leave us with a 5 Star Review and your special comments about Rachael Hambric's service and professionalism. Thank you for being a loyal member of Pen Air!"}, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "117785840320674058457", "name": "Gus Delafuente", "time": 1583356631842, "rating": 5.0, "text": "Always get helped fast and proper.", "pics": null, "resp": null, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "117340164104151543039", "name": "Patrease Durgin", "time": 1474082400571, "rating": 1.0, "text": "I had recently went to this credit union in Foley to apply for a loan so that I can get me another car because an old car that I have is about to break down on me. The people there that I talked who works there were nice, but I hate the policy of this credit union that one of them described to me which is for example: If you have filed for bankruptcy within the last 10 years and haven't established much credit and you've never gotten a loan and paid off that loan, then you won't be able to get a loan from them because obviously they feel that your'e probably not going to pay that loan back to them. So they aren't going to give you a chance. Well how can one get their foot in the door to get a loan from them and then pay it off??? I don't think that is fair at all!! Such a stupid policy!!", "pics": null, "resp": {"time": 1474312994942, "text": "Patrease - Thank you for reaching out to us and provide us your feedback. It is important that we understand the needs of our members and listen to their pain points. We would love the continue the conversation with you to better understand your situation and see how we can develop a solution to get your credit repaired. We are hear to help. Please feel free to reach out to us at memberservicecenter@penair.org. Thank you again for your feedback."}, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "109919864428664857630", "name": "Nick Krupinski", "time": 1578106233414, "rating": 5.0, "text": "Very great bank, with amazing staff.", "pics": null, "resp": null, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "112363082759868468861", "name": "Robert Coats", "time": 1607794394882, "rating": 5.0, "text": "Wonderful staff", "pics": null, "resp": null, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "117526387898855299157", "name": "Mark H", "time": 1480534599917, "rating": 5.0, "text": "The ladies at the drive thru window rock and pen air is the best banking option I've found. Please keep up the good work and I'll continue to use you loyaly!!! Mark", "pics": null, "resp": {"time": 1480609701071, "text": "Mark H thank you for the 5-Star review and the kind words about our Foley team in the Drive Thru. We know you have several choices available to you and want to thank you for choosing Pen Air and for being a loyal member!"}, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "117897494955637896739", "name": "shannon moore", "time": 1460670331802, "rating": 2.0, "text": "I have been with this bank for over 2 years and their service just keeps getting worse & worse. The people at the Foley Branch are pretty nice but there is no way to contact them unless you drive to the bank.They dont allow customers to call direct. What kind of crap is that????   It is no longer personal or hometown , just cold call centers and crappy customer service over the phone. Really disappoints me since I trust them enough to keep my money.", "pics": null, "resp": {"time": 1460671228856, "text": "Shannon - Thank you for taking the time to write this review. It's important to us to hear back from our members on how we are doing. We respect and value the trust you have placed in us and would like to continue the conversation. We'll be reaching out to you to understand more. Thank you again. Respectfully ~ Pam"}, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "107703731987666724908", "name": "washedupification", "time": 1495563356750, "rating": 5.0, "text": "I got a Rootbeer sucker...and my money not much to complain about", "pics": null, "resp": {"time": 1495564886175, "text": "Thank you for the 5Star Review. We appreciate you taking the time to provide us this review and appreciate you being a Pen Air member even more!"}, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "110925731280388439492", "name": "Jamie Scott", "time": 1488040479965, "rating": 4.0, "text": "Very friendly always smiling just very nice people at the foley branch", "pics": null, "resp": {"time": 1488309566647, "text": "Thank you for taking the time to provide us your feedback Jamie along with a 4-Star review. We happen to like the folks at our Foley location also and hope they continue to provide you with exceptional service and treat you with respect. Please don't hesitate to reach out to us in the future if you have any questions or concerns."}, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "116684748883601638064", "name": "Randall Strain", "time": 1537535609763, "rating": 1.0, "text": "I agree with Shannon. I want a bank with a local number. I hate calling Florida when there is a problem. The last time I called I spoke to a Hindu that couldn't speak English. How did she get a job in customer service? It never stops with Penair. Just when you think Penair can't do anything more stupid than before , they rebuild their website. Now by the time I recieve an access code their web site is timed out. They think that no one will need to make a balance transfer for days at a time. They think everyone is psychic and can foretell the future. I wouldn't hire a Penair official to carry out my garbage , because I don't think they have the mental capacity to do the job.", "pics": null, "resp": null, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "111017495949920867374", "name": "Shane Lindsey", "time": 1539627185436, "rating": 5.0, "text": "Great staff love banking here", "pics": null, "resp": {"time": 1539700076139, "text": "Hi, Shane! Thank you for the 5-star review! We value your feedback, whether it's positive or negative, and appreciate you taking the time to let us know how we're doing. We will make sure to pass this along to the Foley location team. We look forward to serving you again soon!"}, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "109451804009689810706", "name": "Peg Aldrich", "time": 1499973981873, "rating": 5.0, "text": "The people who work here earn their pay, and my respect.", "pics": null, "resp": {"time": 1499975007124, "text": "Peg thank you so much for taking the time to give us a 5Star review and provide your feedback. Respect is a guiding principle at Pen Air and we work hard to make sure our members can trust us, feel valued, and know that we respect the fact that they've chosen us with their finances. Thank you for being a member at Pen Air!"}, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "105169241520910439078", "name": "Jason Millsap", "time": 1472851280763, "rating": 1.0, "text": "Can't contact local office directly to get info on hours. It's personnel seem cold at times & bored.", "pics": null, "resp": {"time": 1472853526257, "text": "Jason thank you for taking the time to provide us your feedback. You actually can reach the branch directly. For the Foley location, just press extension 7002, or the next time you are in the branch and prefer to deal with a specific individual just ask for their extension and they will gladly provide that to you. We hope this helps. Thank you again for your feedback."}, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "109513128360675136737", "name": "Art Abrams", "time": 1554140967493, "rating": 5.0, "text": "(Translated by Google) Great pay to bank\n\n(Original)\nGreat plaće to bank", "pics": null, "resp": {"time": 1554215811082, "text": "Hi, Art! Thanks for taking the time to leave us a 5-star review for the Foley location. It's always our goal to provide you with excellent member service. We look forward to serving you again soon!"}, "gmap_id": "0x889a0e1686603aed:0x952279ebccf292e5"}
{"user_id": "105628993078250780575", "name": "Larry Daugherty", "time": 1607452993882, "rating": 5.0, "text": "I have been with Edward Jones for a few years and know Sharon & Vester and use them for my financial advisor and would recommend both, always great responsive service.", "pics": null, "resp": null, "gmap_id": "0x888bb3beeb64f31f:0xa3c609405e0b6beb"}
{"user_id": "105124454187813409107", "name": "Jennifer van Arcken", "time": 1621546232442, "rating": 5.0, "text": "I am very pleased with the great customer support, banking and investment services provided by Synovus in Montgomery. Their team and bank goes above and beyond to provide their account holders with service and financial advice. Rex Huxford is a great asset to their team!", "pics": null, "resp": null, "gmap_id": "0x888c2a6f4f3d955b:0x784e2697014b15db"}
{"user_id": "109062902085607609138", "name": "Best Wearhouse (The Box)", "time": 1624036058348, "rating": 5.0, "text": "Landscaping is beautiful Staff is always friendly and on time!", "pics": null, "resp": null, "gmap_id": "0x888c2a6f4f3d955b:0x784e2697014b15db"}
{"user_id": "109031682288814813047", "name": "Jason Clark", "time": 1608069325185, "rating": 1.0, "text": "Terrible service. Haven't received my card well after the expected date. Will be switching to AOD in the near future", "pics": null, "resp": null, "gmap_id": "0x888b00bbd9657023:0x1445e8ebdc7caa49"}
{"user_id": "105047235379873872120", "name": "Linda Penland", "time": 1616704813767, "rating": 5.0, "text": "Great people an great bank", "pics": null, "resp": null, "gmap_id": "0x888b00bbd9657023:0x1445e8ebdc7caa49"}
{"user_id": "104674782787422072897", "name": "Craig Winn", "time": 1595002241014, "rating": 5.0, "text": "Want to experience truly exceptional customer service?  If so please visit my friends Beverly and Eva at this branch.\n\nI Enjoy going inside. The tellers are nice and very helpful. Tell Eva I said “hi”.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPU7WOdqVTprFyqxf_0tzOAR_ifsjK0BxbHV2iS=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889220b0383cd75:0x1a1ea26d4564a62e"}
{"user_id": "108033749274289504324", "name": "Marshae Archibald", "time": 1580478308696, "rating": 1.0, "text": "Last night I  went to the ATM  and requested 320.00 the ATM  was making sounds as if my money was gonna dispense so I  waited and waited for at least 10 minutes  then the  screen read ERROR IN DISPENSING MY MONEY.  BUT IT WAS DEDUCTED FROM MY  ACCOUNT!!!! IM VERY UPSET  RIGHT NOW CAN'T WAIT UNTIL THEY OPEN UP  I NEED MY MONEY NOW.!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889220b0383cd75:0x1a1ea26d4564a62e"}
{"user_id": "103070051963880049865", "name": "Gigi's Smackdown", "time": 1563553084037, "rating": 1.0, "text": "I was treated like a criminal, cause I'm black", "pics": null, "resp": null, "gmap_id": "0x8889220b0383cd75:0x1a1ea26d4564a62e"}
{"user_id": "102967202962842997064", "name": "Don Jackson", "time": 1550595319954, "rating": 5.0, "text": "I was sent to Ray Tucker by Dave Ramsey Solutions as an ELP (Endorsed Local Provider).  He was all that Dave says that you are looking for investing services.  He definitely has the heart of a teacher.  He has met with my wife and myself numerous times.  He has gone to great lengths to explain why he recommends the steps for us so that both of us understand.  Great person to deal with.", "pics": null, "resp": {"time": 1556191576355, "text": "Thank you for the opportunity to help. I really enjoy teaching individuals about investing."}, "gmap_id": "0x888c2c07a778da57:0xc77c1e9d8f228c0c"}
{"user_id": "100366646175321095947", "name": "Justin Perdue", "time": 1556119472972, "rating": 5.0, "text": "Amazing experience with Ray Tucker! He was open and informative. He made my very comfortable with how they conduct business and I look forward to working with them! Go see this guy!", "pics": null, "resp": {"time": 1556191467718, "text": "Thank you very much for your kind words."}, "gmap_id": "0x888c2c07a778da57:0xc77c1e9d8f228c0c"}
{"user_id": "102135272155512699474", "name": "Clark Furlong", "time": 1555887915631, "rating": 5.0, "text": "Our family finances got a little messy but Ray took care of us.  His advice was thoughtful and turn out spot on.  Thanks Ray!", "pics": null, "resp": {"time": 1556191500676, "text": "Thank you for the opportunity to help."}, "gmap_id": "0x888c2c07a778da57:0xc77c1e9d8f228c0c"}
{"user_id": "104569153502044684022", "name": "Elijah Lofgren", "time": 1471006396306, "rating": 5.0, "text": "Ray is great at explaining things and helping with setting up retirement savings.", "pics": null, "resp": null, "gmap_id": "0x888c2c07a778da57:0xc77c1e9d8f228c0c"}
{"user_id": "112865023635602131724", "name": "Kisha Davis", "time": 1619639964161, "rating": 5.0, "text": "One of the best decisions I made! Kelsey was AMAZING! She was patient, polite, and professional. She simplified the process to make it easier to understand. I would definitely recommend them to my family and friends! Kelsey and Phillip, thank you soooo much for everything!", "pics": null, "resp": null, "gmap_id": "0x888928ac7522957f:0x327d0194899c0b55"}
{"user_id": "104469512991965514518", "name": "Dr Kelsey Graham", "time": 1620069450422, "rating": 1.0, "text": "Against my wishes my wife, who is on hospice, took out a loan with this company. Bait and switch is only a part of what I could say about them. Inserting a television as collateral for the loan- a TV she does not even own. These people prey on desperate people and profit from the suffering of dying old ladies. My wife is not aware of my leaving this review however since I have a large YouTube presence I believe a video expose is in store. Links to follow.", "pics": null, "resp": {"time": 1620076279631, "text": "Republic Finance, LLC (“Republic Finance”) thanks you for your feedback and concerns. We would like the opportunity to discuss your specific situation, as we value our customer’s input and we strive to provide the best customer service. Please feel free to contact us at 1-800-317-7662 or republicfinance.com/contact."}, "gmap_id": "0x888928ac7522957f:0x327d0194899c0b55"}
{"user_id": "102242978119792645370", "name": "april herrick", "time": 1616194947251, "rating": 1.0, "text": "Predator lenders", "pics": null, "resp": {"time": 1616428620239, "text": "Thank you for your feedback and concerns! We appreciate you taking the time to contact Republic Finance to let us know about your experience. We would like to apologize for the recent frustrating experience you have had with us. It is always important for us to work to resolve complaints as customer service is our priority. We wish to discuss this matter with you; please feel free to contact us at 1-800-317-7662 or republicfinance.com/contact."}, "gmap_id": "0x888928ac7522957f:0x327d0194899c0b55"}
{"user_id": "103747289634684322215", "name": "Ricky Louis", "time": 1579196436449, "rating": 5.0, "text": "Mike Newman is very honest and patient. Great listener.  He genuinely cares for your best interest.  That's why I trust him with my future. Thank Mike", "pics": null, "resp": null, "gmap_id": "0x889a40555e9ec571:0x6620a6495b954a4"}
{"user_id": "115082388260666882043", "name": "Tom Beaty", "time": 1579187319229, "rating": 5.0, "text": "Mike Newman is one of the most honest, ethical people I know. You can definitely trust him with a variety of financial services.", "pics": null, "resp": null, "gmap_id": "0x889a40555e9ec571:0x6620a6495b954a4"}
{"user_id": "101780153922339326749", "name": "Ricky Trione Art", "time": 1555685750979, "rating": 5.0, "text": "Ralph Anderson is the most honest and dedicated person we know in the Financial Planning Field!  We highly respect and trust Ralph! We are proud to giving him our very highest Recommendations!  He will truly be a very valuable blessing to you and your family!  Excellent Services!", "pics": null, "resp": null, "gmap_id": "0x889a40555e9ec571:0x6620a6495b954a4"}
{"user_id": "100078668070409840862", "name": "Landon Rogers", "time": 1555598951986, "rating": 5.0, "text": "I would highly recommend giving Ralph Anderson a call if you are looking for a financial planner! After using him for years, I can confidently tell you that he is by far the most professional, well organized and attentive financial planner I have ever met!", "pics": null, "resp": null, "gmap_id": "0x889a40555e9ec571:0x6620a6495b954a4"}
{"user_id": "101102448139467666953", "name": "Tom Aiken", "time": 1556403963397, "rating": 5.0, "text": "Mike Newman has tremendous experience and is a joy to work with.  I recommend him highly.", "pics": null, "resp": null, "gmap_id": "0x889a40555e9ec571:0x6620a6495b954a4"}
{"user_id": "112229004767637436993", "name": "Ursula Lowe", "time": 1582741245783, "rating": 5.0, "text": "They are always there for their clients", "pics": null, "resp": null, "gmap_id": "0x889a40555e9ec571:0x6620a6495b954a4"}
{"user_id": "115044474494045170121", "name": "Charles Dean", "time": 1611263569313, "rating": 5.0, "text": "Matt and staff are always helpful. I high recommend them for your financial needs.", "pics": null, "resp": null, "gmap_id": "0x8861d641fe66ee67:0xc5e025e9c5643f7e"}
{"user_id": "113873813181965925037", "name": "Mary4AU", "time": 1538581425755, "rating": 1.0, "text": "I worked here for almost 4 years. I went in for an interview because they were looking for a driver with a CDL. I've had a Class A CDL since 1998. I had no idea what Loomis was. To this day I wish I still had no idea what Loomis was.\nI was promised a certain amount of pay. I was promised a 3% yearly raise.\nThose two things didn't happen.\nThey don't pay time and a half for hours worked over 40 per week. They failed to mention that. The health care plans are high and coverage is crappy. Don't even get me started on the management. Do yourself a favor and dodge this bullet. Don't even bother to apply for a job here. You'll only end up kicking yourself.", "pics": null, "resp": null, "gmap_id": "0x88891baa3e2bf9f7:0xf11aae5e904ac4c4"}
{"user_id": "103485890352765913654", "name": "Preston Holloway", "time": 1564008751166, "rating": 5.0, "text": "They have a lot of guns...", "pics": null, "resp": null, "gmap_id": "0x88891baa3e2bf9f7:0xf11aae5e904ac4c4"}
{"user_id": "101792900332934580367", "name": "Goddbod. Junya “iceberg” Winston", "time": 1594667457684, "rating": 5.0, "text": "clean establishment and courteous employees...", "pics": null, "resp": null, "gmap_id": "0x889a56f367e10f7d:0x8f01ba25fad7979c"}
{"user_id": "103028443885928691083", "name": "Pamela Lewis", "time": 1479181565126, "rating": 5.0, "text": "Been a customer for years . Happy people happy place. Very personal.", "pics": null, "resp": null, "gmap_id": "0x889a56f367e10f7d:0x8f01ba25fad7979c"}
{"user_id": "102977397899624241934", "name": "Brian Burke", "time": 1573512201201, "rating": 5.0, "text": "He was fantastic. My scheduled appointment time ended up not working so we rescheduled, he called me and said something had come up and got me in immediately which worked perfectly for me. I appreciated his ability to fit me in so quickly.\n\nHe is very professional, well spoken, and knowledgeable. I knew I was opening an account, my wife was with me, she wasn't planning on investing but thankfully ended up doing so after a short talk with him. Can't say enough good about him, already made a great return on my investment.", "pics": null, "resp": null, "gmap_id": "0x8889cbbef80cfdf1:0xa1f7dc3d030440a3"}
{"user_id": "103012834084885011464", "name": "Lauren Walker", "time": 1596124890061, "rating": 5.0, "text": "They have always been extremely professional and very helpful!", "pics": null, "resp": null, "gmap_id": "0x889a0e31460dc03b:0x2de714e56b9533dc"}
{"user_id": "101969458788227292306", "name": "Annette Thomas", "time": 1539916162628, "rating": 1.0, "text": "They called me and said I was eligable for a loan.  Gave me an amount.  I was just about to do it to consolidate my bills.  Then they called me back wanting the title to my car. AFTER already telling me I was approved.  They lied!!!!  They are charging me 41% interest on the loan I already have.  Never go here!", "pics": null, "resp": {"time": 1576264239869, "text": "Hi (customer name), thank you for taking the time to tell us about your problem. We would like the opportunity to speak with you to better address your concerns. Please feel free to contact us at 1-800-317-7662 or complaints@republicfinance.com. Thanks!"}, "gmap_id": "0x889a0e31460dc03b:0x2de714e56b9533dc"}
{"user_id": "110664739889739363935", "name": "Chris Keane", "time": 1544888346227, "rating": 5.0, "text": "Great customer service! They really helped me consolidate my debt and bring my overall monthly budget down. I would definitely recommend them to anyone needing a loan or help with debt consolidation.", "pics": null, "resp": null, "gmap_id": "0x889a0e31460dc03b:0x2de714e56b9533dc"}
{"user_id": "117897494955637896739", "name": "shannon moore", "time": 1517250882978, "rating": 1.0, "text": "Well, Things have changed. After having a great account , never late, I wanted to borrow money again. The young man who took my name and number and knew I was in a rush to get out of town due to a family emergency basically just told me that lunch is more important , so I will be put on the back burner til he has a chance to eat and no one else can help me. Bad customer service!!", "pics": null, "resp": null, "gmap_id": "0x889a0e31460dc03b:0x2de714e56b9533dc"}
{"user_id": "104047728006852065929", "name": "Kristal Lee", "time": 1598413660802, "rating": 1.0, "text": "Do not go to this place ever!!!!! Biggest scam out there. They do not care about their customers at all.", "pics": null, "resp": {"time": 1598451830943, "text": "Republic Finance, LLC (“Republic Finance”) thanks you for your feedback and concerns. We would like the opportunity to discuss your specific situation, as we value our customer’s input and we strive to provide the best customer service. Please feel free to contact us at 1-800-317-7662 or republicfinance.com/contact."}, "gmap_id": "0x889a0e31460dc03b:0x2de714e56b9533dc"}
{"user_id": "112200694641278694878", "name": "Karra Sliger", "time": 1495497116960, "rating": 5.0, "text": "They stayed open late for just lil me and the loan i have with them has helped me out alot. These ladies are very sweet and for sure ill be going back to see them ♡", "pics": null, "resp": null, "gmap_id": "0x889a0e31460dc03b:0x2de714e56b9533dc"}
{"user_id": "111679668443753392824", "name": "Wendy Looney", "time": 1580403685676, "rating": 1.0, "text": "Do not deal with this company.", "pics": null, "resp": {"time": 1580409205334, "text": "Hello, Thank you for your feedback! We value your opinion and recommendations on ways that Republic Finance can improve! If you have any concerns you’d like to address, do not hesitate to reach out to us at 1-800-317-7662 or republicfinance.com/contact. Have a great day!"}, "gmap_id": "0x889a0e31460dc03b:0x2de714e56b9533dc"}
{"user_id": "100847857321628321748", "name": "Spenser Frank", "time": 1470935414215, "rating": 1.0, "text": "Worst experience possible.  Don't deal with this company! Your bank account can be frozen for 3 weeks. This company does not work with you and they take you to court and ruin your credit.", "pics": null, "resp": null, "gmap_id": "0x889a0e31460dc03b:0x2de714e56b9533dc"}
