{"user_id": "118282753136650315537", "name": "Sullivan Edwards (Sully)", "time": 1592187325175, "rating": 5.0, "text": "Abraham and his crew were professional, courteous, and performed everything that I expected, while keeping me informed if anything unexpected came up.\n\nThey fixed some major drainage and erosion issues in the back yard (see before and after photos) by burying downspouts, building a French drain that went out to the road, and tying the downspouts into the drain. It is super satisfying to watch tons of water just pouring out of the drain into the street after a heavy rain.\n\nThey also graded and re-sodded the yard with Zoysia for less than it would have cost me to personally buy the Zoysia and lay the sod myself. I highly recommend Legacy for your personal landscaping project.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOP9LLSa1FkSJ1SEPZpCGsOwAl6myjUPrUxR1F0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN98dNwL0edkoD6b89zP9wyvyor9iFBLkHJENx4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOcwqfMq36dQbjBEMG-GqPL2swoLWdU3AmyRSHr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO99bXwaTyRCuh9LNFMCJmsZDz1rJYqdFCWDXsF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPCymUBkm2VhA4pNs7oSkMAuAvH0JvuOHZkssMb=w150-h150-k-no-p"]}], "resp": {"time": 1595192916558, "text": "Mr. Edwards,  We would like to take the opportunity to thank you so very much for the positive review.  Abraham enjoyed working on your drainage project and we are truly blessed to have such great people working with us to help solve issues that our customers may be having.  Have a great summer!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "100681058269140551242", "name": "Rene' Holt", "time": 1599235633883, "rating": 2.0, "text": "I never like to leave bad reviews and always try to keep them positive, but I contacted this company to help with some backyard design and remodel. I had a meeting scheduled with Jacob this past Wednesday and when he was 30 minutes late, I called the office to make sure nothing was wrong. Jacob called back and offered no apology for being a no-show but we rescheduled for today. It's a hour last our appointment time and he didn't show up again with no call and didn't answer his phone. If you can't be professional enough to keep scheduled appointments, twice, you're not a company I want to work with.", "pics": null, "resp": {"time": 1599268358031, "text": "Rene', thank you so very much for letting us know about the appointment issues.  This rarely happens, let alone 2 times.  Jacob inadvertently kept the same time from last week's appointment on his calendar and received a notice this morning that you cancelled the appointment, assuming it was this afternoon.  We regret that we were not able to be of assistance with your backyard project and appreciate again the review so that we can strive to do better, even in such a crazy year!    Tami"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "104106105688529962394", "name": "Neva Turner", "time": 1593643378877, "rating": 5.0, "text": "Our experience with Legacy truly deserves 10 stars. From first contact they have been the best company we have ever worked with. Everything was done timely and professionally. Quality is top notch. They have shown quality of work ethic beyond measure. We highly recommend this company. During this difficult time with Covid 19, working with everyone at Legacy has been inspiring and uplifting.\nGreat company !!", "pics": null, "resp": {"time": 1595192603424, "text": "Neva, getting to know you and your husband has been one of the highlights of our year.  You are such a pleasure to work for and your appreciation and kindness have not gone unnoticed.  The crew always enjoys working with you on your projects and we look forward to seeing what else you may have in store for your beautiful home!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "101345560364732262291", "name": "Heather Meacham", "time": 1606402094566, "rating": 5.0, "text": "Paul and Tami are so great to work with.  They pay attention to every detail and our patio is just perfect.  Very professional!!!", "pics": null, "resp": {"time": 1606504910070, "text": "Heather, it was such a pleasure to work with you on your patio project.  I absolutely love the color of the concrete,  it was an excellent choice.  Thank you again and enjoy your new patio!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "113215240688685991775", "name": "Jason Comfort", "time": 1595108518120, "rating": 5.0, "text": "First let me say that my wife and I are extremely pleased with the work.  More importantly, Abraham and his crew were phenomenal.  They were cognizant of the fact that my neighbors and I are all working from home and kept the noise at a minimum.  They went out of their way not to leave a mess after the first day after asking what our HOA restrictions were.  When they were finished, they had filled in the large hole my dogs had dug and placed down a few pieces of sod to cover some bare spots.  Truly outstanding service.\n\nLastly, when they were finished, and before they left, your team saw one of my neighbors struggling to unload a trailer.  They offered to help unload the heavy item for him.  They were truly great ambassadors for the company.\n\nWe have some pretty grand plans for our back yard that will stretch over the next couple of years.  After this experience, I guarantee that we will be reaching back out to Legacy Outdoor Services.", "pics": null, "resp": {"time": 1595192427066, "text": "Jason, Thank you ever so much for the review!  Your patience as we worked on your project was very much appreciated as the wet weather  makes drainage work even more challenging.  We are very blessed to have great teams working with us and we can't wait to see what else you have in store for your home.  Have a great summer@"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "112641626804551730969", "name": "debi frankowski", "time": 1566673144178, "rating": 5.0, "text": "We are so pleased with the work that Legacy Outdoor Services just completed at our house.  They installed and sculpted the most beautiful waterfall feature in our mountainside back yard, along with up-lighting that really looks awesome in the evening.  Additionally, they put in a flagstone patio with a gas fire pit, with beautiful natural landscape features and mulch beds all around.  We have had many compliments on it, and it is surprisingly low maintenance too!  We just love it!\nWe had several unforeseen complications which were out of Legacy's control, related to our gas line installation and inspection,  that Legacy patiently and proactively worked through.  We appreciated their high level of customer service and commitment, and will certainly use them again in the future!", "pics": null, "resp": {"time": 1567096986076, "text": "Debi, We absolutely loved working with you both!  You have such a nice home and we were so happy to be able to help you design an outdoor living area that accented your already existing hillside.  You have been so very patient as we worked towards getting your gas issue resolved.  Now you can sit back and enjoy all the elements together that make for a very relaxing getaway!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "111137092066572068365", "name": "Jacquelyn Pletcher", "time": 1592770708261, "rating": 1.0, "text": "Make sure your quote is EXTREMELY detailed, and that you’re home and watching every step they take for quotes involving construction. Otherwise you’ll end up with new concrete that is uneven (that will forever pool water TOWARDS your home), concrete paint that is already permanently stained with mud BEFORE they leave/finish, deep tracks in your sod because they will drive a concrete truck in your backyard, ground/grass that isn’t graded back the way it was before construction and therefore leaving extremely uneven muddy hills all over your yard, nails and cigarettes in your yard WEEKS after they leave, and a final structure that is uneven, sealed poorly, with paint drips that have dried.\n\nWould not refer.", "pics": null, "resp": {"time": 1595193209813, "text": "Jacquelyn,  We just wanted to thank you for taking time out of your busy schedule to leave us a review.  It is always important for a business to strive to grow in their professionalism and communication skills.  That growth is hindered if someone does not express their concerns that arise during and after a project.  Thank you again!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "113838961780293246456", "name": "Aurora Marmolejo", "time": 1598412397716, "rating": 5.0, "text": "I had some pavers placed around my back screen porch and a flower bedding put in front of my home. They did awesome work always done within two days and they cleaned the area really good. I highly recommend Legacy outdoor services.", "pics": null, "resp": {"time": 1596206972369, "text": "Aurora, Thank you so much for taking the time to leave us a review!  The crews commented on how very kind you were to them while they were working and that means a lot.  We are excited for you to be able to use your new space and look forward to helping you in the future!\nTami"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "100748477103684685549", "name": "Susan Tuck", "time": 1549400602185, "rating": 5.0, "text": "We hired Legacy Outdoor Services for a drainage issue.  We quoted several other companies as well.  Not only did Legacy provide a detailed quote with the scope of work to be performed it was very priced very competitively.  The entire staff is to be commended.  I was kept informed as to when the job would be started without having to follow up.  When the crew arrived they were well prepared and ready to work.  This is by far the best crew I have seen.  They worked extremely well as a team.  This was a messy job to say the least.  The clean up was amazing.  When they left you couldn’t even tell they had been there!  I would highly recommend Legacy for your outdoor needs.", "pics": null, "resp": {"time": 1549428935298, "text": "Susan, thank you ever so much for the positive feedback.  We appreciate greatly the opportunity to help you with your drainage issues and we are glad that we were able to meet your expectations!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "109072573966849415490", "name": "Madeline Ortiz", "time": 1579308883532, "rating": 5.0, "text": "Great experience, really pleased with the result Good communication and work complete on time. Definitely will do business again. Highly recommend this business", "pics": null, "resp": {"time": 1579384645515, "text": "Madeline,  thank you so very much for the positive review.  It was such a pleasure to meet with you and to design a landscape you can enjoy for many years to come!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "115955243844226744303", "name": "Diane Cooper", "time": 1568841843519, "rating": 5.0, "text": "Legacy Outdoor helped me get a couple of trees planted in my bare back yard.  They look nice and the hummingbirds are already checking the Japanese Maple out.  Tammy and I worked together to find the perfect trees, exactly what I wanted.", "pics": null, "resp": {"time": 1595193111358, "text": "Diane, you have been so great to work with over the past several years.  We appreciate the opportunity to help you with new projects and look forward to many more in the future.  Thanks again!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "101461821337101273629", "name": "J M", "time": 1597024440968, "rating": 3.0, "text": "My yard is really uneven in places after having new sod laid and the length of time for them to get my project done is what gives them three stars. Otherwise, they did a good job.", "pics": null, "resp": {"time": 1597526895729, "text": "Your feedback is greatly appreciated!  This year has been rather frustrating as covid, weather, and supply issues have caused delays that we have not had to deal with in the past.  Nonetheless, we are grateful for your patience and we wish you a safe and healthy rest of the year."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "109396638207751190191", "name": "JB Robins", "time": 1560557782341, "rating": 5.0, "text": "Legacy Outdoor Services did a most beautiful job landscaping my front yard.  They installed a stone border around my flower beds and perfectly matched the stone with the stone on my house.  They added so much color to my yard with yellow, red and green shrubs and added even more color with flowers.  It is outstanding and I am extremely pleased.  The landscape workers are very professional and polite.  They were always on time and did what they promised each day.  The owner, Tami, came by most days to ensure that I was happy with the way the job was going.  They are very flexible and allowed me to do add-ons as we progressed.  I plan to re-landscape the back yard next and I will be using Legacy.  Their work is excellent!!!!", "pics": null, "resp": {"time": 1560657270577, "text": "Ms. Jan, thank you so very much for the great review!  We very much enjoyed helping you with your landscape project and we can't wait to see what new ideas you will have for us in the future!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "108150526745578549771", "name": "Patrick Miller", "time": 1567880827619, "rating": 5.0, "text": "We are very happy with the work that was done. Owners and workers were extremely professional and courteous. Work was done on time and within budget. We can highly recommend this company.", "pics": null, "resp": {"time": 1567988196795, "text": "Patrick,  it was such a wonderful experience to work with you and your wife on this project.  To be able to add more outdoor area for you to enjoy while adding a functional walkway was our goal.  It was rather hot and your attention to our crew was appreciated.  Again, thank you for your review."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "109547156616978257415", "name": "Joy Fitzpatrick", "time": 1565783180842, "rating": 5.0, "text": "Loved working with Legacy on my landscaping and hardscaping.  They have a lot of creative ideas and deliver as promised. Their employees were respectful and pleasant to work with. I'll be contacting them again when I install a pergola and some additional projects.", "pics": null, "resp": {"time": 1567097194046, "text": "Joy,  Thank you so much for the encouraging review!  You had such great ideas that were not like most cookie cutter landscapes you might see.  It was so much fun finding unique plants and I have to admit there are more \"tropical\" options for this area than I thought.  You are great to work with and I hope that we have the opportunity to help you again in the future."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "116412605110655843432", "name": "Carol Johnson", "time": 1537409321880, "rating": 5.0, "text": "We chose Legacy Outdoor Services to implement the first phase of a multi-year landscape plan for our new house. It was an excellent experience all around and we are very, very pleased with the results. Everyone there is a pleasure to work with. Paul walked through the project with us when he did our estimate, and proposed several changes to our designer’s plan that were improved solutions to fix our yard’s drainage challenges. Jessica, the office manager, was always responsive to questions, and Tami did a great job hunting down the plants we selected — which wasn’t that easy in September. When they couldn’t find the specific plants on our plan, she collaborated with us to select acceptable substitutes.\nAustin, our project manager, and his crew were wonderful. They are great guys, hard workers, and do an amazing job. Even the installation was a collaborative experience. Austin suggested an additional dry creek bed on the side of the yard to deal with the excess water that funnels into our yard from the neighbor’s driveway. We are looking forward to working with Legacy again next year when we install the next phase of our landscape plan!", "pics": null, "resp": {"time": 1537447808248, "text": "Carol, you were such a pleasure to work with and everyone agreed that your design was just beautiful!\nWe can't wait to see what the next phase has in store.  Thank you again."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "112026042859733791059", "name": "Dana Williams", "time": 1551914985325, "rating": 5.0, "text": "I had drainage work done and these guys did great. Paul and his crew got on the work quickly and worked hard to complete the job through some very difficult conditions. Austin ran the crew and he was an expert at his work and went well beyond to finish a french drain, grading and downspout pipes to the street. Austin is a fine person to work with as well as his second in charge Abraham.", "pics": null, "resp": {"time": 1551985735501, "text": "Dana, thank you so very much for the encouraging words!  You are right, sometimes the wet weather makes drainage work rather challenging.  You were both so very patient and helpful during the whole process and we are so very thankful for the opportunity to help you with your drainage issues."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "113949714652133284084", "name": "Joey Borders", "time": 1554999936331, "rating": 5.0, "text": "If you need landscaping done give Legacy a call. They do all kinds of work, but we personally had hardscaping done. They came out, viewed our patio, designed a new layout, tweaked it a few times to get it within our budget, and completed the work. I even reached out to several other companies in the beginning stages. Legacy gave us the best design with the best cost. We worked with David the majority of the time. He and the company are professional. Extremely courteous and will answer any questions/concerns. Two thumbs up.", "pics": null, "resp": {"time": 1555079634538, "text": "Joey,  We absolutely loved your design, it was unique and functional for your family.  You were such a pleasure to work with and we appreciate the opportunity to help you with your hardscape project.  Have a great spring!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "103767282675903416009", "name": "Diane Moore", "time": 1547788128837, "rating": 5.0, "text": "Legacy Outdoor Services has a great team of people and are so easy to work with.  We hired them to do some ground prep work before we installed our above ground pool.  The workers were very courteous, polite, and always showed up on time.  We couldn’t have asked for a better job and highly recommend them!", "pics": null, "resp": {"time": 1547827275608, "text": "Diane, thank you ever so much for letting us know about your experience!  As always, it was a pleasure working with you and we look forward to more projects in the future!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "102804315426935822342", "name": "Lisa", "time": 1460758438235, "rating": 5.0, "text": "Legacy Outdoor Services is the only service of this type that I will use.  They have done multiple projects for me over the course of the last few years.  Their workers are always respectful and courteous. As a woman with workers on my property, that is very important to me.  They truly go the extra mile in making sure that I am completely satisfied with their work.  Whenever the opportunity arises, I am happy to recommend Legacy to anyone who needs work done, and I do so with the utmost confidence in the caliber of work that they will provide.", "pics": null, "resp": {"time": 1463678866334, "text": "Ms. Lisa,\nIt has been the utmost pleasure to work with you on all of your projects.  Your ideas are unique and beautiful and it has been a wonderful experience bringing those ideas to life.  Customer relations is very important and we are so grateful for the opportunity to be involved in meeting your expectations."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "108483660875607420822", "name": "Tami McGhee", "time": 1538179639652, "rating": 5.0, "text": "I chose Legacy Outdoor Services for a flower bed landscaping project last year and recently for a drainage project.  The owner, office staff and workers were all very knowledgeable, professional and a pleasure to work with.  I was very pleased with the work as well as the follow-up to ensure my satisfaction with the projects.", "pics": null, "resp": {"time": 1538412473747, "text": "Tami,  It was such a pleasure helping you with your project!  Drainage issues can be overwhelming and costly if not taken care of, we are so very pleased that we were able to help you with your issues and look forward to any future projects you may have."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "115395017058219405457", "name": "Ch Carter", "time": 1536679832009, "rating": 1.0, "text": "Called and tried to get an estimate to install landscaping in the rear of our newly purchased home and we're told we're outside \" Legacy's service area\" I wasn't looking for weekly lawn service I was searching for a one time landscape install.  Their website says they provide this type of service, and their office says they service parts of Owens Cross Roads, but don't cover where  I live in Meridianville.  A check of Google maps shows it's basically the same travel distance.  Must be nice to be doing so well that Legacy can afford to turn down a job, sight unseen.", "pics": null, "resp": {"time": 1536691877822, "text": "Thank you for your response.  You are correct in that we have a set distance of service from our location.  When our office is given an address of service, we then check to see if that address is within the distance we have set for our service area.  Each address is unique and may fit into our service area whether it be in Owens Cross Roads or Meridianville.  It is necessary to have perimeters in order to provide the most cost effective price for both our potential customers and our company.  Good Luck on your project."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "112498271920360270383", "name": "Mike Gordon", "time": 1547498421601, "rating": 3.0, "text": "Don't bother calling them if you are locating over the mountain in the Hampton Cove area. They even say they serve the \"Huntsville\" area, but I guess not. I'll take my business elsewhere.", "pics": null, "resp": {"time": 1547506880999, "text": "Mike, thank you for your feedback. You are correct in that we have a set distance of service from our location. When our office is given an address of service, we then check to see if that address is within the distance we have set for our service area. Each address is unique and may fit into our service area whether it be in Huntsville or Hampton Cove. It is necessary to have perimeters in order to provide the most cost effective price for both our potential customers and our company. Good Luck on your project."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "116464768980852366180", "name": "Grant Patten", "time": 1493326199889, "rating": 5.0, "text": "Amazing work! Went above and beyond, we were very satisfied. We had them come out for lawn service / hedge trimming / tree trimming / bush removal as well as lawn mowing, and we would definitely use Legacy Outdoor Services again in the future.", "pics": null, "resp": {"time": 1515601890434, "text": "Thank you so much for allowing us to help you with your project!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "102247343157860787735", "name": "Mark Bailey", "time": 1537295229665, "rating": 5.0, "text": "I had Legacy install a partial fence for our backyard.  The work was performed quickly and well done.  Very satisfied.", "pics": null, "resp": {"time": 1537448121165, "text": "Mark,  Thank you ever so much for allowing us to help you with your fence project.  We know you will enjoy the privacy for many years to come!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "102613479039580587098", "name": "Wes G Smith", "time": 1459540121771, "rating": 1.0, "text": "I would not use this contractor again, nor would I recommend them to anyone else.  They did a drainage project for me where I explicitly described the design I wanted and it incorporated solid PVC pipe.  On the day of the job, the workers showed up with corrugated pipe.  When I called the owner, he stated that PVC would be $800 more, so feeling like I didn't want to start over with another contractor, I told him to go ahead.  Then I found out that a portion of the water to be drained to the street running from the downspout  was going through perforated corrugated pipe (pipe with holes).  They assured me that the water would be moving and would not leak out into already saturated ground (yeah, right).  Then I came home to find that the grate to catch water coming off the sidewalk was about 1 and a half to 2 inches away from the sidewalk, requiring the water to run over dirt before entering the grate.  The owner tried to tell me that it would be no problem and the bare dirt would not erode despite water constantly running over it.  I insisted that concrete be put between the sidewalk and grate to keep the water from washing out the dirt.  When I came home, I found they had used a type of caulk between the grate and the sidewalk, and had done a messy job of it, I don't know if that much caulk will ever cure.  After two days it is still soft.  Additionally, where they cut through the curb, the re-concreting was extremely poorly done.  It looked like they didn't even use a trowel, much less a curbing tool.  It looked like they basically packed the concrete on with their fingers and left it.  Part of the contract called for doing a brick border along the sidewalk.  After I paid them for the portion of the contract for the drainage, they informed me that they were waking away from the contract and that I needed to find someone else to do the edging.  The pity is, the subcontractor they had lined up to do the masonry work actually sounded very competent.  Bottom line, this is a company that, in my opinion, cut corners at every opportunity, poorly designed the project, provided shoddy workmanship, and then walked away with nearly half of the contracted work unperformed.", "pics": null, "resp": null, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "112627625497851587477", "name": "Matthew Buxton", "time": 1540823978606, "rating": 5.0, "text": "My experience with Legacy Outdoor Services was great from start to finish. Austin and his crew did a great job, furthermore everything was cleaned up before they left.", "pics": null, "resp": {"time": 1542752671590, "text": "Matthew,  It was such a pleasure working with you on your project!  Austin and the crew were so very thankful for your help during the process and we are so happy we were able to help you with your drainage issues!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "114140904219899268546", "name": "Cindy McCrary", "time": 1539029376692, "rating": 5.0, "text": "Very satisfied with the landscaping and drainage work Legacy has done at our house.  Their honest and friendly crew was always a pleasure to work with.", "pics": null, "resp": {"time": 1539279886556, "text": "Cindy, thank you so much for allowing us to help you with your projects.  It has been such a pleasure to be able to work with you over these past several years!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "109399262948912963856", "name": "Carey Rosenblum", "time": 1465960466598, "rating": 5.0, "text": "Legacy outdoor has serviced my home grounds for several years. They installed a designed row of arborvite trees along my rear property line that are very healthy and provide a natural green screen of privacy. Otherwise they have come out annually to do some re-mulching in my flowerbeds and have given them thst extra spark in appearance. If you have some landscaping issues or need suggestions I would recommend them. They are honest and do good work.", "pics": null, "resp": null, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "117947770864316007014", "name": "Jennifer Benavides", "time": 1537324665297, "rating": 5.0, "text": "Dependable, honest and hardworking! Thank you Legacy for a great job once again.", "pics": null, "resp": {"time": 1537447929235, "text": "Jennifer, thank you so much for allowing us to help you with your project.  Can't wait to see what your next project will bring!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "101586645822953159514", "name": "matt demuro", "time": 1532362506140, "rating": 1.0, "text": "This company gave me probably the worst experience that I have had with a company that has done work for me. I contracted with them to do drainage work, a sprinkler system and landscape lighting.\n\nI was told this would take 3 weeks to complete, with each phase occurring on consecutive weeks. The project as a whole took almost 12 weeks to complete, and this was only because I hounded them with calls multiple times per week.\n\nThe drainage work was the first part, it seemed to be fine, though the French drain was not placed the complete length that was discussed originally. Also the fingers of river rich were put in to stop erosion, but almost no grass seed was put in afterwards, so nothing but weeds grew in between the river rock.\n\nThe second piece was the sprinkler system. This was put in during a day, but the ground was not backfilled properly and they needed to come back out to fix it. We were told that they would put down grass seed after the lighting job was completed. The lighting work was not completed for another 8 weeks, and there wasn’t any seed put down afterwards. They were also supposed to aerate and oversees the lawn, but since they could not get their mower into our backyard, they told us they would come back with a smaller mower to pull the aerator later. This never happened.\n\nI had to call them 2-3 times a week for 8 weeks to get them to complete the lighting. Part of it was landscape lighting, the other portion was putting in a fan and spotlight in/on our screened patio. The wiring was placed so shallow, that it came out of the ground within a week and they had to come back to fix. The light and fan was supposed to be put in by an electrician, but was just put in by the owner and his friend. They put a cheap conduit over the electrical wire that didn’t even cover the wire.  They sent an electrician out to fix the wiring, but he just rigged another kind of conduit on the bare wire to cover it up.  The uplighting for the trees was sold to us at $65 a light. I just found the lights online for $45 for a 4-pack of lights.\n\nWe just gave up with this company and figured we would just be stuck with this work. Over the last year, I kept burying and covering up the wire as it came out of the ground and have been trying to repair the grass in the area where they did sprinkler and drainage work. We are still fighting massive weeds from the lack of follow through on planting grass after their work was completed.\n\nI am writing this review today after I just finished replacing 3 lights that stopped working and half of the wiring that was put in for the landscape lights. Turns out they believe that wire nuts are not necessary and you only need to tape wires together with electrical tape before putting it in the ground.\n\nIf you are looking for a company to do landscaping work for you, stay very far away from this company. You will only be sorry if you choose them.", "pics": null, "resp": {"time": 1533529694432, "text": "Thank you for bringing all of this to our attention.  Unfortunately scheduling can be a challenge when dealing with different elements and sometimes issues arise.  For example the drainage was delayed due to an unmarked water pipe, flooding the drainage trenches.   The ceiling fan was installed by a certified electrician, as was the wiring for the fan, flood lights and outdoor switch.  We would be more than happy to provide the name of the electricians that provided these services.   The contract states that there is a year warranty covering defects in workmanship and materials.   Is regrettable that we did not have the opportunity to fix the issues that you were having with your lights, thus alleviating some of your frustration.  If we had only known of the issues we would have been more than happy to fulfill the contact’s one year warranty.  Again thank you for your comments and we will take them all into consideration to better our services."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "108670955347642886754", "name": "Stephen Rice", "time": 1463175075861, "rating": 5.0, "text": "I highly recommend Legacy Outdoor Services. Our neighbors compliment our yard all the time and these guys have helped with minor and complex issues on our property. We trust them 100% and most of all, they are super professional for a service company.", "pics": null, "resp": {"time": 1463678652280, "text": "Mr. Rice,\nIt has been a pleasure working with you and we appreciate the opportunity to meet your lawn care needs."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "106141751648914846395", "name": "Jim Wittenborg", "time": 1524758298468, "rating": 1.0, "text": "I would like to have used this company for a drainage installation job, however, when I called and gave my address (near Hampton Cove), I was told that I lived too far away for their business.  I guess companies just don't go that \"extra mile\" for business anymore.", "pics": null, "resp": null, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "105383289762301934437", "name": "Richard Brown", "time": 1592346320110, "rating": 5.0, "text": "Good company to work with", "pics": null, "resp": {"time": 1592496094177, "text": "Thank you so much for allowing Legacy to help you with all of your projects.  It is always a pleasure to spend time with you both!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "106962197234597285862", "name": "Whitney Bell", "time": 1627335070176, "rating": 5.0, "text": "Jackson and his team were great to work with. Everyone is slammed these days in the construction/remodeling business, so I did not hear back immediately, but I was not surprised as I assumed they were very busy. Once I did hear back, Caitlin was super responsive and answered all of my questions. I knew nothing about iron railings, so I had a lot of questions.\nJackson and Isaac handled the measurements, created the skeleton railing, and completed the install.  They are both very attentive to detail and personable. They made sure we understood the process and were happy with the final results.\nI did receive 2 other estimates, and Allen Iron Works offered the best pricing and best timing. I am very pleased with our railing and would highly recommend them.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN28nC1CCINFMcPDe7iJERNaK_nKkkJlgkL4llp=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "116570765014476343592", "name": "Donna Orrison", "time": 1617808777033, "rating": 5.0, "text": "I wanted to update my house by taking off the wooden porch columns and railing.  I added new columns and Allen Iron Works created a custom railing and stair railing for me. It turned out absolutely gorgeous!  Jackson worked with me on the design and Isaac and Jacob were fantastic with the installation.  They truly do fantastic work.  I couldn't be more pleased with how it turned out", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPRjo3xyTS2rlh3bfLWx6apeaX_FpPTMN2A7Pqd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP3JZW1bGvzJgr7BkazZODTCqHxrHf8Zo2ZqGdy=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "104083717212329833161", "name": "Frances Mayhall", "time": 1618930148735, "rating": 5.0, "text": "The new owner of Allen Ironworks, Jackson Langston, helped us with a repair to our iron railing on our front porch. He and his employees were responsive, super professional, and gave us a fair price. They also did a great job. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "118081020871359579098", "name": "stephanie stone", "time": 1596413990506, "rating": 5.0, "text": "I ordered an iron trellis and it was beautiful!  The staff were helpful, responsive to questions, and timely on delivery. I love it!  Would definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "106559254276616683387", "name": "Michelle Ford", "time": 1612312692477, "rating": 5.0, "text": "Friendly people and very reasonable", "pics": null, "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "115563040197908999532", "name": "Paris Lady", "time": 1541384788859, "rating": 5.0, "text": "Our cast iron mailbox pole broke from the yard guy backing his car into it. The pole was 70 years old. My Mother mainly wanted to keep the ornate work that the mailbox rested on. Little Hardware quoted a price of 287.00 to weld a new pole to the scroll work and the wait would up to 3 weeks. My Mother said \"Call Allen Iron Works. They have been around for years and will give a fair price for repairs\". They welded a new pole and while I waited for only 20 minutes. They charged us 40.00 which I felt was very reasonable. That was a year ago. Tomorrow I will go again for a custom flagpole that has to be made and I have complete confidence the price will be reasonable. The entire staff treated me with kindness and respect. My Mother was so excited and happy to see the mailbox iron work back in place like it hadn't changed at all since the 1940's. A businessman once told me \"It's repeat business that you always want to strive for. That's the secret of success\". He's right because Allen Iron Works has a customer for life with me.", "pics": null, "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "111419282386881666393", "name": "Vivian F", "time": 1595859942681, "rating": 1.0, "text": "I signed a contract on June 30th with a deposit of 50% of the cost. In mid July I called them for an installation date. They said \"about two weeks out.\" On July 27th I called them and they said \"a few weeks out.\" I pushed for a delivery date. They said August 17th. I canceled my order as previous promises were not upheld.", "pics": null, "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "103881629705066137010", "name": "Liz Harding", "time": 1458169347892, "rating": 5.0, "text": "I looked all over for a replacement number for my mailbox. The msilbox's manufacturer recommended this company and they were right!! Fast and wonderful customer service and the store is fascinating!!", "pics": null, "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "103899179450674281178", "name": "Julia Sanders", "time": 1481391778063, "rating": 1.0, "text": "Sorry company!!!!! The most heartless people you'll ever come across!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888990a6d1e127cb:0x564830d0d362f51"}
{"user_id": "105548214761191126251", "name": "Bravo Chakras", "time": 1563356841405, "rating": 5.0, "text": "This is going to be one of the best haunted Mine tours in Etowah County. As a matter of fact it’s the only one", "pics": null, "resp": null, "gmap_id": "0x888a3dc07ac5530f:0x7bc32f39e7017584"}
{"user_id": "109079562442020848681", "name": "Daniel Geary (JR Geary)", "time": 1554082007212, "rating": 5.0, "text": "This is some really great information to be aware of to know where this location of this Mine is so if fallout shelter is needed for our neighborhood then we will be safe from emminent disaster that Dick Donald Trump is going to cause us to be fkd up from... At least we're safe here.... Westside Outlawz .", "pics": null, "resp": null, "gmap_id": "0x888a3dc07ac5530f:0x7bc32f39e7017584"}
{"user_id": "104947720892366376638", "name": "L Cutis", "time": 1621369028140, "rating": 5.0, "text": "Paul did an excellent job on my smoker. I have smoked several briskets and dozens of ribs. Service is top notch.", "pics": null, "resp": null, "gmap_id": "0x8888a8c1f29425a7:0x2efee0e7ef097ccc"}
{"user_id": "115045185818804559103", "name": "Scott C. Allen", "time": 1504708631747, "rating": 5.0, "text": "Amazing smoker. Deal with Tyler if you can. His dad can fly off the handle. But the craftsmanship and smoker design is second to none. My smoker has raised more money for charity than it cost to build.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPwtArBS9Q2-7mOSZE1QS7jqqh2PJF4jzZjhIHU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMfNjO9cIv8whuRDUNPzK2sH1XK8ujMt0RlrWbN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPfdV99xPae3JUYDMG1mGzav9SuRWO2Vf-MTxjF=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888a8c1f29425a7:0x2efee0e7ef097ccc"}
{"user_id": "115884020783521552132", "name": "Michael Emert", "time": 1537895230348, "rating": 5.0, "text": "Tyler and his crew created a beautiful and excellent custom cooker that will last me \"forever!\" This rig maintains temps incredibly and I've got room to share, I can't wait to do my first whole hog in her. the 24x65 main chamber was ordered for that purpose. I'm just a backyard cook, but this cooker will \"UIP\" my cooking game. The Communication and Customer service is awesome and their QUALITY is 2nd to None! I'm proud to say \"I am a Shirley Fabrication Owner!!!\"", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMfzJJ8iEvWsn6mXavB_B6-PxJrq8PooMuqEf0S=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOPEVLRet-6OO96zuVqMm2SnXz7ANrnlbFOK8Kp=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888a8c1f29425a7:0x2efee0e7ef097ccc"}
{"user_id": "103249281495196397949", "name": "Jim Peter", "time": 1573453003743, "rating": 5.0, "text": "I purchased one of their 24X50 patio models with the warmer.  The quality of workmanship is first rate.  My cooker is a great value for the price.  Tyler was wonderful to work with.  I am very happy I purchased a Shirley Fabrication cooker!", "pics": null, "resp": null, "gmap_id": "0x8888a8c1f29425a7:0x2efee0e7ef097ccc"}
{"user_id": "115205716279610222482", "name": "Gabriel Jones", "time": 1594406941389, "rating": 5.0, "text": "Best place to get a custom smoker made", "pics": null, "resp": null, "gmap_id": "0x8888a8c1f29425a7:0x2efee0e7ef097ccc"}
{"user_id": "115600980696650028042", "name": "Alfred Bradley", "time": 1552100969478, "rating": 4.0, "text": "Have been looking at smokers online. Then I came across you guys and you are right there is a big difference in your quality compared to others. Will be getting in touch with you guys about the price of a 24 ×60 elevated cabinet door smoker. KEEP UP THE GOOD WORK", "pics": null, "resp": null, "gmap_id": "0x8888a8c1f29425a7:0x2efee0e7ef097ccc"}
{"user_id": "107936794956978775832", "name": "Shannon Schroeder", "time": 1487375863893, "rating": 5.0, "text": "Amazing pits!  Top quality fabrication, techniques, and options.  1st class communication and customer service.  These less than 5 star reviews have to be bogus and placed by competitors.  Shirley Fab is the reigning king of the stickburner game for good reason.  Nobody can hold a candle to Paul, Tyler, & company!", "pics": null, "resp": null, "gmap_id": "0x8888a8c1f29425a7:0x2efee0e7ef097ccc"}
{"user_id": "101678957798766834266", "name": "J.W. McFarland Jr", "time": 1570284616600, "rating": 5.0, "text": "Awesome work! Very talented.", "pics": null, "resp": null, "gmap_id": "0x8888a8c1f29425a7:0x2efee0e7ef097ccc"}
{"user_id": "115503297621963681344", "name": "Shane Gallahair", "time": 1554414390443, "rating": 1.0, "text": "This place you better run. Came here at twelve appointment was for two pm. Now there saying my stuff want be ready until 8or 9pm still waiting. But the young lady in office is very nice only reason they got one star. Plenty of parking if you need to sleep", "pics": null, "resp": null, "gmap_id": "0x888937a30fe1547d:0xe9ccf07971294ec7"}
{"user_id": "110602023307277071099", "name": "Roger Flanders", "time": 1558389940052, "rating": 1.0, "text": "Appointment time doesnt mean anything. Employees are more focused on socializing than working just like in most places in Mississippi then cry the blues when held up away from their work and too stupid to tie it together. He will show no mercy to those who are what they oppose. At dock 2 1/2 hrs after appointment and not being loaded with no one at the docks. I  anticipated this before i get the call to come to the docks. Its like lets not be obvious..... yeah to the guy who suffers from multidimensional blindness.", "pics": null, "resp": null, "gmap_id": "0x888937a30fe1547d:0xe9ccf07971294ec7"}
{"user_id": "112505440897402475365", "name": "Jagdev Singh", "time": 1562857292956, "rating": 1.0, "text": "Bring your food. It's been 6 hours still waiting for door", "pics": null, "resp": null, "gmap_id": "0x888937a30fe1547d:0xe9ccf07971294ec7"}
{"user_id": "101964975911079112108", "name": "D Hunter", "time": 1364910586457, "rating": 2.0, "text": "Not here.  It is about a half mile west on industrial parkway.", "pics": null, "resp": null, "gmap_id": "0x888937a30fe1547d:0xe9ccf07971294ec7"}
