{"user_id": "117753313894570415327", "name": "Bobbie Clemons", "time": 1627405818387, "rating": 5.0, "text": "Papa Vince Olive oil and balsamic vinegar are by far the best I have used and trust me at 76 years of age I have done a lot of cooking and this is really the only Olive oil I use for cooking and for dips it’s very light not heavy no aftertaste all it would take you try it one time and you’ll go back for more as I do", "pics": null, "resp": {"time": 1627507687315, "text": "HURRAY!! We love customers!! We love to see them living a healthy life!! I am happy we were able to add to your life - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "104635249346597652752", "name": "Cecile Barnhill", "time": 1622558054659, "rating": 5.0, "text": "Simply the Best!\n\nI've been buying products from Papa Vince for years and have not been disappointed once. The last bottle of EVOO I purchased a few months ago is the best olive oil I've ever tasted. That particular harvest is wonderful on the palette. Smooth with peppery hints. It pairs well with most everything in my culinary repertoire. Need more just to make sure I never run out.", "pics": null, "resp": {"time": 1622574173835, "text": "Ciao Cecile!! Thanks for taking time to write such a nice review about My family's products.We have chosen to invest on quality instead of marketing and your review is a blessing - Vitina."}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "117836445143578658716", "name": "Wesley Williams", "time": 1620764555629, "rating": 5.0, "text": "Extravagant Simplicity. This olive oil is something special. I find myself reducing ingredients in my dishes so that I don’t overwhelm the taste of my oil. Perfect for salads. My kids delightfully dip their bread in it. I use it to lavishly finish roasted vegetables. I have even had a spoon or two to sooth an upset stomach. If you want elevated cuisine you have to elevate the ingredients. Papa Vince olive oil is in a class all of its own. Worth every penny. It’s inspired many dishes in my kitchen. I’ve added the orange oil as essence to a whipped cream. The flavored oils are fun, but simple is best. I am a fan for life. (Can olive oil change your life for the better? Maybe so!, eat and be blessed)", "pics": null, "resp": {"time": 1620845950459, "text": "Hurray!! My family and I have put lots of love and passion into the making of this extra virgin olive oil and your review means so much joy and encouragement to continue pursuing excellence. - THANKS"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "104777544459014895350", "name": "Celia Rivera", "time": 1624752199879, "rating": 5.0, "text": "This combination of the olive oil and the balsamic vinegar is so rich in flavor without that \"oily taste\" you get sometimes from other brands. This is the way to healthy and naturally complement ANY salad dressing should taste/be like!", "pics": null, "resp": {"time": 1624843552389, "text": "HURRAY!! We love customers!! We love to see them living a healthy life!! I am happy we were able to add to your life - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "112663547937591244309", "name": "Julia Noble", "time": 1618060109723, "rating": 5.0, "text": "Papa Vince’s oil is simply the best! It is  cold pressed from fresh green olives and tastes delicious. I am so happy to find an olive oil that I can trust the ingredients. The customer service was also amazing.  Thank you Papa Vince for your commitment to quality ingredients.", "pics": null, "resp": {"time": 1618092172497, "text": "Ciao Julia!! Thanks for the great review!! My family and I have invested much in producing this extra virgin olive oil and your review means the world to us - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "105542239738683906079", "name": "Margie Teelucksingh", "time": 1611948732557, "rating": 5.0, "text": "I would like to share my experience with olive oil. I've tried many brands but couldn't find an ideal oil to cook with. I decided to try Papa Vince Extra Virgin Olive Oil. I heard from people who tried it on different web-site and  I decided to try it. What do I have to lose but an untasted dish of spaghetti or another type of Italian cuisine. I had quest invited to eat dinner in my apartment. I made lasagna and salad and of course some bread. Everyone enjoyed the meal and asked how I made the meal? They was surprised that I didn't  use my favorite oil. They liked the flavorful taste, more olive and peppery flavor. They also wiped the sauce from their plate. The salad I used the balsamic vinegar with the olive oil, they liked it too. I think everyone should try these tasty flavors. It's made by a family owned business. Try it!, what do you have to lose but good food and good company.", "pics": null, "resp": null, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "115616420945045476570", "name": "Carol Von Deylen", "time": 1617128466065, "rating": 5.0, "text": "This is the second order of the chili infused olive oil. I actually use more of this than the regular olive oil, all though that' a favorite too. I shared this past order with my three daughters who were here for St. Paddy's Day. Two got the Chili infused, and one the lemon. They were impressed with the flavor these infused olive oils impart to salads. Will be ordering more to replace my shared bottles.", "pics": null, "resp": {"time": 1617209453660, "text": "Ciao Carol!! I am so excited that your three daughters likes the Papa Vince Olive Oils!! Baking, what a great way of enjoying the Chili infused and the lemon extra virgin olive oil!! - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "114763679094618184231", "name": "Nate Portney", "time": 1627167001599, "rating": 5.0, "text": "Vitina and Papa Vince represents what quality, service, small business was meant to be.   After learning more about the business, I am warmed by their dedication, personalized attention, and commitment to helping everyone to improve their health with their EVVO and other quality products.   Looking forward to continuing purchasing for years to come.   la benedizione!  grazie Papa Vince!", "pics": null, "resp": {"time": 1627167762820, "text": "Anche a te: tante benedizioni"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "105382935161924838836", "name": "Randy Kelsoe", "time": 1609959247135, "rating": 5.0, "text": "According to several YouTube videos, real olive oil will solidify (to a soft wax) in the refrigerator. I have tried this with 4 other brands, placing about 2 tablespoons of each brand in small open containers in the fridge. 3 had no change at all. One changed partially after 4-5 days, but there was still some liquid oil. After less than 24 hours in my fridge, the Papa Vince's olive oil had turned solid. If my conclusions are correct, the Papa Vince's oil is pure extra virgin olive oil and not diluted with some other cheap oils, the 3 that did not change have little or no olive oil, and the one that partially changed was mixed with some other oil.\nThe taste and freshness are outstanding. It's expensive, but worth it.", "pics": null, "resp": {"time": 1609971794779, "text": "Thanks again!! My family and I have put much passion and love into the making of this extra virgin olive oil and your review means the world to us!! - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "100417330676904711607", "name": "Cynthia Sweeney", "time": 1622494348363, "rating": 5.0, "text": "Not wanting to carry back the Trapani, Sicily salt,  I found Papa Vince online, ordered while in Sicily. It arrived at our home the same day we returned. The salt has a taste of the ocean and sun. We have ordered it several times since, expanding our purchases to include the Busciate pasta, and Cherry tomato sauce...both very simply made but conveying a taste that astounded us.\nThe Olive oil is delicious, along with Moscato vinegar that was so good on salad it was all that was necessary.\nThe products are top quality and worthy of trying. Like us you made find yourself on the repeat ordering list.", "pics": null, "resp": {"time": 1622574103822, "text": "HURRAY!! We love customers!! We love to see them living a healthy life!! I am happy we were able to add to your life - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "113837533287978450921", "name": "Karen G", "time": 1626914688817, "rating": 5.0, "text": "Fabulous every time! Papa Vince and their products never disappoint! I take their olive oils as hostess gifts instead of bottles of wine, and my friends love it!", "pics": null, "resp": {"time": 1620155038313, "text": "HURRAY!! My family and I have put much passion and love into the making of all our products. Your review put a big smile in my face!!"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "115940538084403169065", "name": "Jeffrey McAdams", "time": 1617233741045, "rating": 5.0, "text": "I chose Papa Vince because of its quality and purity. Now, when I want to impress my family and friends I bring out my bottle Papa Vince and show them what a real quality olive oil taste like. Thank you Papa Vince for your dedication to the best standards and quality practices! Now I'm enjoying your great Balsamic Vinegar too!\n\nJeffrey McAdams", "pics": null, "resp": {"time": 1617291892295, "text": "HURRAY!! My family and I have put much passion and love into the making of all our products. Your review put a big smile in my face!!"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "114283808339942973714", "name": "Kevin Manspeaker", "time": 1620180184677, "rating": 5.0, "text": "It is bursting with flavor and I can taste the difference between what I have and yours.  The aroma is so special before tasting.", "pics": null, "resp": {"time": 1620256027869, "text": "Ciao Kevin!! I'm so happy to learn that so far Papa Vince is unmatched!! Believe me, excellence is our pride and we will keep striving toward it - Thanks - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "108546616735022190062", "name": "David Groth", "time": 1617034091236, "rating": 5.0, "text": "I love the taste and purity of the EVOO! I love to give as gifts as well. My favorite is french bread, Papa Vince, some nice cheese.", "pics": null, "resp": {"time": 1617049828165, "text": "HURRAY!! My family and I have put much love and passion into the making of this olive oil and your review means the world to us"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "108615142034630179199", "name": "Scott Trezza", "time": 1623726089001, "rating": 5.0, "text": "I am a loyal disciple since my first taste at the Pensacola Italian Cultural Society. I buy this for myself and for gifts for folks who appreciate the high quality of this exceptional olive oil.", "pics": null, "resp": {"time": 1617209830925, "text": "HURRAY!! My family and I have put much passion and love into the making of all our products. Your review put a big smile in my face!!"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "104671149752915488115", "name": "Fran Wolf", "time": 1599757922689, "rating": 5.0, "text": "This is a high quality EVOO that is very tasty.  I have tried many other supposedly \"good\" brands over the years but was put off by their taste.   Every bottle of Papa Vince contains the harvest date so that you can be sure of freshness.  I have used their regular EVOO and the lemon infused and like both.   Their website is easy to use, delivery is flawless and their customer service in excellent.", "pics": null, "resp": {"time": 1600873409779, "text": "Fran!! Hurray!! I am so happy you are sensitive to your taste buds. If more people were, there would be less fraud and... more farmers and artisans like us would be able to do what they love - produce excellence. THANKS AGAIN for this wonderful review."}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "116383346845110667602", "name": "Jonathan Walker", "time": 1617663041722, "rating": 5.0, "text": "After long hours of research I was convinced that this is the best for my money. Larger corporations can be deceiving in their business practices but when it comes down to a higher standard in quality, the family comes first.  Papa Vince delivers despite the hardships and the quality remains consistently high. If it matters to you what you will allow in your body then this is the wisest choice when it comes to health and value. Papa Vince extra virgin olive oil is my family’s only choice!", "pics": null, "resp": {"time": 1617721682520, "text": "HURRAY!! They can tell the difference!! Thanks for sharing my family's extra virgin olive oil with your loved ones. My family and I have risked so much to revive this \"medicine oil\" and your review means the world to us."}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "101916719604548241586", "name": "Chris Modic", "time": 1617295322912, "rating": 5.0, "text": "This olive oil is the best I’ve ever had. I’ve been using it on salads and will be using it all summer on Caprese salads. Try it and you’ll be hooked!", "pics": null, "resp": {"time": 1617400415866, "text": "HURRAY!! My family and I have put much passion and love into the making of all our products. Your review put a big smile in my face!!"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "117932715988722447455", "name": "Lorraine Sommer", "time": 1617205331499, "rating": 5.0, "text": "The olive oils are the best, the wine vinegar is amazing, and the pastas too! Great service and delivery, excellent communication and customer service!! Will always be back for more!", "pics": null, "resp": {"time": 1617209928406, "text": "Ciao Lorraine!! Thanks for the great review!!"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "111187898178845014752", "name": "Kathleen Smith", "time": 1612033457693, "rating": 5.0, "text": "Love all the flavored oils!! My husband especially loves the spicy one. I have been using the lemon and orange in baking. Delicious!!! Will order all of my olive oils from Papa Vince from now on!", "pics": null, "resp": {"time": 1613073205276, "text": "Ciao Kathleen!! I am so excited that your husband likes the spicy ones!! Baking, what a great way of enjoying the orange and the lemon extra virgin olive oil!! - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "116206540343160635919", "name": "Free Indeed", "time": 1603221789147, "rating": 5.0, "text": "I Loved Everything!\nMy order arrived quickly which I really appreciated and I have loved every product I’ve used! The olive oil, Muscato vinaigrette, pasta, lemon preserve and lower acid tomato sauce. I ordered two Papa Vince T-shirts from Amazon and giving them for Christmas gifts. Thank you so much for making A great bunch of products and for your attentiveness to your customers. We really need to support small businesses and you’re a great example of one. Thanks again", "pics": null, "resp": {"time": 1603557987959, "text": "Hurray!! My family and I have chosen to produce quality and count on our customers to spread the word. Thanks for such a nice review!! It means the world to me and my family"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "116846561138846548881", "name": "Eric T", "time": 1615605600830, "rating": 5.0, "text": "Great product. Everyone who has tasted the Papa Vince Extra Virgin Olive Oil at my house immediately asks what brand and where they could get it.\nGreat flavor for finishing.", "pics": null, "resp": {"time": 1615659212689, "text": "HURRAY!! They can tell the difference!! Thanks for sharing my family's extra virgin olive oil with your loved ones. My family and I have risked so much to revive this \"medicine oil\" and your review means the world to us."}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "116898381606165107636", "name": "Donna", "time": 1615645935523, "rating": 5.0, "text": "The best orange marmalade I’ve tried, and I have tried many. I always choose organic since the peels are included. This is all natural and tge perfect blend of sweet and bitter.", "pics": null, "resp": {"time": 1615659344324, "text": "You have very good taste buds!! Cousin Cati makes this marmalade once a year from fresh lemons and oranges grown locally in Sicily. She makes a small batch to make sure it remains authentic and delicious!! THANKS"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "116270784571197163669", "name": "Roxanne Wood", "time": 1615681808405, "rating": 5.0, "text": "Excellent product, tasty quality olive oils.  I won’t use any other!!  Great customer service and very friendly, loving people.", "pics": null, "resp": {"time": 1615682209323, "text": "HURRAY!! Thanks for being a customer since 2015 - May I XOXO you ( It is the Italian way to say THANKS)"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "114411947252078655967", "name": "Patty", "time": 1611801158467, "rating": 5.0, "text": "Excellent products-so authentic Italian!  Great flavor! Comes very well wrapped and wonderful info on the family history. I highly recommend them!", "pics": null, "resp": {"time": 1611972242430, "text": "Ciao Patty!! I am so happy you enjoy the flavor of our products. Yes!! we invest much in the packing of our products!! - Thanks for this beautiful review - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "118175990236298597683", "name": "elizabeth cameron", "time": 1608676024253, "rating": 5.0, "text": "Awesome and very personable customer service. I love their olive oil. Doesn't taste strange to me and I've tried the most expensive olive oils. I'm just sensitive to the olive oil taste, I guess. Going to figure out how to grind their coffee and put it into empty pods for my Keurig. Their pasta is also good. They sent me the cutest tiny olive oil sample, when I got the pasta.But the best thing is how wondering their emails are! I'm looking forward to getting more stuff from them. I just stumbled onto them by accident. Lucky accident.", "pics": null, "resp": {"time": 1609370112477, "text": "Hurray!! The best lucky accident!! My family and I have chosen to invest on quality and it is so nice to hear a customer with such a good taste palate praising our products. This review means the world to us!! Wishing you the best NEW YEAR!! - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "113431653773006802530", "name": "Patricia Portis", "time": 1617661598187, "rating": 5.0, "text": "I Love It!!!!..This EVOO is excellent quality and it taste so good!!!...I can't wait to get my hands on those Beautiful Gift Sets.....Everything looks Fantastic!!!....I'm so glad I discovered this EVOO Video, while I was browsing around on YouTube.....Thank You Papa Vince Family!", "pics": null, "resp": {"time": 1617721559763, "text": "Ciao Patricia!! I am so happy you enjoy the flavor of our products. Yes!! we invest much in the packing of our products!! - Thanks for this beautiful review - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "106096607843021650255", "name": "Ryan Bartholomew", "time": 1611192818441, "rating": 5.0, "text": "I have been ordering Papa Vince olive oil for over two years and every bottle has been excellent. The quality is superb and the price is quite reasonable. Prior to this, I had tried many olive oils, some of which were quite good, but did not match up in quality to Papa Vince.", "pics": null, "resp": {"time": 1611972442505, "text": "Ciao Ryan!! I'm so happy to learn that so far Papa Vince is unmatched!! Believe me, excellence is our pride and we will keep striving toward it - Thanks - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "116550719604171605550", "name": "Stephanie Nichols Ford", "time": 1620739155073, "rating": 5.0, "text": "We honeymooned in Sicily and it holds a special place in our heart! Happy to support a local business and get a taste of Sicily here!", "pics": null, "resp": {"time": 1620764300334, "text": "Hurray!! How exciting!! Thanks for sharing. Your review means the world to me and my family!!"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "109154775263840971933", "name": "Carolyn Clarke", "time": 1613699306617, "rating": 5.0, "text": "This is the BEST Extra Virgin Olive Oil I have ever had. We have tried so many and thankfully found Papa Vince EVOO in 2017. The quality is unparalleled. You know without hesitation that you are ingesting a product that is not only delicious but also wonderful for your body. Vitina is wonderful to order from, so personable and thoughtful.  The packaging is perfect and the gifts and literature wrap up the purchasing experience perfectly. It is my forever Extra Virgin Olive Oil.", "pics": null, "resp": {"time": 1613765804795, "text": "WOW!! Thanks for being such a faithful customer since 2017. My family and I have invested much in producing this extra virgin olive oil and your review means the world to us - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "116601515206743111253", "name": "Sam Emerson", "time": 1609192055173, "rating": 5.0, "text": "I have been buying high quality products from Papa Vince for years. Their customer service is amazing and they treat you like one of the family. Its hard to pick a favorite product, but I think running out of their Olive Oil would be tragic. Wait, their coffee is a MUST have, Balsamic Glaze will have you drooling, Oh and the Moscato Vinegar is the perfect addition to sauces and dressings... Nope I guess I cant pick a favorite lol If you're on the fence, just give them a try you wont regret it!", "pics": null, "resp": {"time": 1609369879291, "text": "Ciao Yvonne!! Thanks for taking time to write such a nice review about My family's products.We have chosen to invest on quality instead of marketing and your review is a blessing - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "118343901940703980520", "name": "Mary Ann Howard", "time": 1609887815005, "rating": 5.0, "text": "Papa Vince olive oil is absolutely delicious!! We enjoy the lemon olive oil at least twice a week on seafood and vegetables and the extra virgin olive oil several times a week in salad dressing and roasting vegetables. I highly recommend both!!", "pics": null, "resp": {"time": 1609971912150, "text": "Hurray!! How exciting to know you love the lemon extra virgin olive oil so much!! Thanks, my family and I have worked very hard to produce an extra virgin olive oil that truly delivers the health values and taste are customers expects and your review means the world to us - THANKS"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "110738955431284487608", "name": "Cindy McGuffey", "time": 1605719705832, "rating": 5.0, "text": "Olive oil is one of the best foods for good health so we are always searching for the best quality and best tasting oil to put on our salads and vegetables. Papa Vince Olive Oil has been the best we have found and we would highly recommend it for its quality, freshness and amazing flavor. Thank you Papa Vince for making it possible for us to get really good olive oil!\nPat and Cindy", "pics": null, "resp": {"time": 1605727729122, "text": "Hurray!! My family and I have put lots of love and passion into the making of this extra virgin olive oil and your review means so much joy and encouragement to continue pursuing excellence. - THANKS"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "102111297531587076904", "name": "Jo-Ann Caudill", "time": 1609791429186, "rating": 5.0, "text": "I received a gift box full of pasta, saucfe and oils as a retirement gift and found the sauce to be amazingly fresh and tasty.  I do not usually enjoy tomato based sauces but papa vince's is wonderful.  Have just ordered 9 more bottles so I share with my family and have plenty for myself.", "pics": null, "resp": {"time": 1609882570743, "text": "Jo-Ann, thanks for taking time to share how much you are enjoying Papa Vince's extra virgin olive oil. We make it just like Grandma used to make it and I am so glad that you can taste the difference!! May I XOXO you? (It is the Italian way of saying THANKS) - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "118052530126947614237", "name": "Parker Property Services", "time": 1599840454514, "rating": 5.0, "text": "This is the best olive oil I have ever used! Not only does it taste delicious, but I eat it knowing I am making a very good choice for my family's health. I really believe this is the highest quality oil I can get my hands on! Also, their customer service is exceptional, and shipping is fast! I can't say enough about this product--about this company--about this family behind this company!!! I will continue to use Papa Vince :)", "pics": null, "resp": {"time": 1600873117992, "text": "Ciao Gina!! Thanks so much for taking time to write such a nice review. I am so happy you are really enjoying Papa Vince."}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "100645330404456927870", "name": "Bruce Weiss", "time": 1599056649247, "rating": 5.0, "text": "This fine extra virgin olive oil was delivered promptly across the nation in a well-packed box with secure insulation.\nIt is the best I’ve ever used in the kitchen and it’s unfiltered and unrefined and has a longer shelf life than customary extra virgin olive oils.\nIt has a complex, strong but light pepper taste and comes in a sleek bottle with fashionable label.\nMy one complaint is that it is not yet available in gallon container! But if you order at least three bottles at a time, there is no delivery charge, making it less expensive than Amazon Prime.\nThank you for your time.", "pics": null, "resp": {"time": 1600879427304, "text": "Ciao Bruce!! OH BOY I am so honored by your passion and love for Papa Vince Extra Virgin Olive Oil. One day, we will have the gallons ready for you!! THANKS - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "102055196386162559904", "name": "Henry Kimmel", "time": 1599755072976, "rating": 5.0, "text": "Papa Vince’s products are exceptional!\n\nWe ONLY use Papa Vince’s EVOO (extra virgin olive oil—original, lemon, and orange flavored) for routine cooking plus entree and salad enhanced flavoring\n\nIn addition we totally switched and wholeheartedly advocate Papa Vince’s BUSIATE pasta (both durum and tumminia wheat varieties).   The pasta not only tastes terrific but the kids love it for its shape variety and texture", "pics": null, "resp": {"time": 1600873586288, "text": "Ciao Steve, I am so glad to hear how much your kids love Papa Vince Busiate!! Thanks for sharing and thanks for being such a fun of Papa Vince!!"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "107611669481222824979", "name": "Karen Driscoll", "time": 1610738040313, "rating": 5.0, "text": "Great olive oil.  Great customer service.  Been buying for years.  Always have on hand for all my olive oil needs.", "pics": null, "resp": {"time": 1610999981896, "text": "Thanks Karen!! Your constant support always puts a smile in my face!! Love You!! - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "105057979560684783747", "name": "Judith Gerharz", "time": 1598025808798, "rating": 5.0, "text": "We originally  found Papa Vince products on amazon and were so pleased that we now buy directly from the company and send their products often as gifts.  The olive oils are a favorite and they have introduced new citrus flavored ones, the lemon is excellent.  Love the pastas too. We will  continue being loyal customers.", "pics": null, "resp": {"time": 1600879645011, "text": "Ciao Judith!! I am very happy you found us on Amazon. What an honor to be considered as a gift for your loved ones - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "109028953604905320102", "name": "A K", "time": 1604436957605, "rating": 5.0, "text": "Papa Vince has some the BEST olive oil I’ve ever tried! So packed full of flavor and grown by people who truly care. I’m obsessed with making the freshest pesto and this stuff is gold!", "pics": null, "resp": {"time": 1605727780691, "text": "HURRAY!! I am so happy!! Thanks for taking time to encourage me and my family to keep pursuing excellence - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "111409639313155173587", "name": "joyce swanson", "time": 1609439005201, "rating": 5.0, "text": "Papa Vince olive oil is the best!!  It is a family owned business with the lovely Vitina at the helm who really, really cares about her customers.", "pics": null, "resp": {"time": 1609882465309, "text": "Ciao Joyce!! You are always so thoughtful and giving!! I am so glad you love my family's Extra Virgin Olive Oil. May I XOXO you? (It is the Italian way of saying THANKS)"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "113485734198042275848", "name": "Kim Hunt", "time": 1589220950417, "rating": 5.0, "text": "Best olive oil hands down. So many come with hidden ingredients and are not 100% olive oil. This stuff is amazing. Cooks well and digests even better. I will order nothing else and you should too! And to top it off the customer service is outstanding and that’s something you just don’t see anymore. Thank you for keeping me and my family healthy with real olive oil!", "pics": null, "resp": {"time": 1600880102769, "text": "Ciao Kim!! I am so happy you are cooking with Papa Vince Extra Virgin Olive Oil. Most people don't realize how a good steak, even a fresh vegetables just picked from your home garden are made dull  when cooked with cheap oils. They just don't know what they are missing!!"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "118356344243549091169", "name": "Frank Guccione", "time": 1600807292433, "rating": 5.0, "text": "This cold pressed olive oil is simply the best out there! Fresh, aromatic, hint of pepper. I use it to drizzle over pasta and pizza before serving or dip bread from the oven in it with some Pecorino grated cheese! Expensive, but worth every penny!!", "pics": null, "resp": {"time": 1600872866876, "text": "Frank, you are a true Italian. Drizzling Papa Vince Extra Virgin over pasta, pizza, soups... it is the best way to enjoy it. Have you tried to drizzle over oranges?"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "106729527763674206851", "name": "Phyllis Bainbridge", "time": 1607993358493, "rating": 5.0, "text": "It is rare that you come across a product that actually lives up to it's advertising, and even more rare when the Family that provides the product is genuine. This is what I found to be true in Papa Vince Extra Virgin Olive Oil. It is extremely difficult to find a high quality EVOO. I researched, and happened upon a video on YouTube about Papa Vince. The video features Vitina, and her Mother having a conversation, and drinking their olive oil out of a large shot glass. Vitina was so passionate about her EVOO. I could not wait to try it. It is truly exceptional! The quality far exceeds anything I have ever tried. I drink 1- 2 tablespoons daily for health benefits. I have a reoccurring bleeding ulcer, and diverticulitis. After one week, I noticed the benefits. After a month, I was convinced! I actually ran out, and was forced to be without my daily servings for 15 days. My stomach issues returned. I am anxiously awaiting my shipment, and I will NOT allow myself to run out again. I had the extreme pleasure of finding out the person who answered my text was Vitina herself. I couldn't believe it. I was actually complimenting, what I thought were her employees on treating their customers exactly as Vitina herself would... This company is based on family values, and integrity. They are honest. They care about their customer, and the customer experience above, and beyond. That is an extremely rare find! This company. This family. The people that represent them are truly exceptional, and in a class all their own.I wouldn't hesitate to recommend this High Quality Extra Virgin Olive Oil, or the Family that stands behind it. Check out the video on YouTube. Check out their official site, papavince.com.  My sincere, heartfelt thank you to Vitina, and her family for a wonderful product, and the most positive experience, I have had in a very long time!", "pics": null, "resp": {"time": 1609371182963, "text": "Ciao Phyllis!! I answer all text and all emails personally because I love people and I am passionate about our mission. Our mission is to create foods that promote health. Daily, I see people struggling with all kind of chronic diseases. We, at Papa Vince, believe that most of these diseases can be avoided through diet. This is why all our foods are made with ingredients locally grown in Sicily prepared with the same methods our grandparents and great-grandparents used. Thanks for sharing!! - LOVE LOTS Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "109528786910909423157", "name": "John Flynn", "time": 1602282377947, "rating": 5.0, "text": "I'm always happy to support family owned businesses. Their EVOO is of highest quality.  The BEST I ever had!", "pics": null, "resp": {"time": 1602530221917, "text": "Ciao John!! Thanks so much for taking time to write me such an awesome review."}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "104304029578277910249", "name": "Mary McElroy", "time": 1604168856200, "rating": 5.0, "text": "If you’re looking for some of the highest quality olive oil and vinegar, if you’re looking for the very best service you can imagine, you’ve come to the right place! I can’t recommend them highly enough and look forward to doing business with them again!", "pics": null, "resp": {"time": 1605459622382, "text": "HURRAY!! Thanks Mary for taking time to support our commitment to produce the best extra virgin olive oil. Your feedback means the world to us."}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "113096735870901673066", "name": "Minh Ma", "time": 1611182655833, "rating": 5.0, "text": "Best oil for salads and other uses. I’ve been using it for over and year and see the difference in my food.", "pics": null, "resp": {"time": 1611191776383, "text": "Hurray!! How exciting!! Thanks for sharing. Your review means the world to me and my family!!"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "102214554212389149744", "name": "True Hope", "time": 1603217051211, "rating": 5.0, "text": "This is the real deal! No other olive oil has the punch that this one has. One swig and you will know you have purchased the best quality available. I take a spoonful a day for my health.", "pics": null, "resp": {"time": 1603557901419, "text": "Taking a spoonful daily is so good for you!! Thanks for taking time to write such a nice review"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "109200614568659946601", "name": "k kiehl", "time": 1595959985718, "rating": 5.0, "text": "Their olive oils are so good it takes real self control not to drink them. BIG fan of the plain and lemon but haven’t tried the others. Also check out the balsamic glaze!", "pics": null, "resp": {"time": 1600879562494, "text": "Ciao!! Thanks for taking time to write such an awesome review!! I am so happy to hear you love the balsamic glaze!! Have you tried it with raspberries and blackberries? I can't wait to hear back from you - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "103823265700774152948", "name": "Philip Pei", "time": 1613511741732, "rating": 5.0, "text": "This is really tasty olive oil. Recommended.", "pics": null, "resp": {"time": 1613617820593, "text": "HURRAY!! My family and I have put much love and passion into the making of this olive oil and your review means the world to us"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "103948608764718703366", "name": "Lora Thomas", "time": 1588806311288, "rating": 5.0, "text": "Truly amazing products. Just ordered new crop of olive oil and can’t wait to taste it. Their olive oil is the best! All products that I have tried are superior quality. they are a great family owned business and customer service is terrific!", "pics": null, "resp": {"time": 1600880169924, "text": "Ciao Lora, I am so happy you enjoy each of our products. Thanks for this awesome review"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "100009182275329588377", "name": "Frank Fernandez", "time": 1602364465484, "rating": 5.0, "text": "Great customer service.Products are fresh and delicious. Not mass produced. Can't  go wrong purchasing  their products.", "pics": null, "resp": {"time": 1600872924820, "text": "I am very happy to hear how much you are enjoying Papa Vince extra virgin olive oil. Thanks"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "101667956214380192969", "name": "Grace Uihlein", "time": 1591300013832, "rating": 5.0, "text": "I have tasted many bottles of olive oil. This by far, hands down, is the best ever produced! Vitina’s promise of pure, authentic olive oil is true to her word. I am so glad I found you and this olive oil. I don’t use any other brand but Papa Vince.", "pics": null, "resp": {"time": 1600879696515, "text": "Ciao Grace!! I am happy you found me!! I feel honored by your review. Thanks"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "101403669608058700195", "name": "Lissa Johnson", "time": 1586867798561, "rating": 5.0, "text": "I love all Papa Vince products! The EVOO is the best I have found. Great to cook with. Great for dipping bread or just as a condiment on your favorite dish. I am addicted to the Orange Marmalade. I have it on toast first thing every morning. I can't be without it.The Lemon Marmalade is wonderful too. I love the pasta and tomato sauce. So good. I have also tried the Balsamic Vinegar, the Balsamic Glaze which is divine and the Sea Salt. I have not been disappointed in any of the products. Best quality around.", "pics": null, "resp": {"time": 1587168025895, "text": "Thanks so much for taking time to write such a nice review. You have just put a big smile in our face!!"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "117851952633604543690", "name": "Lucinda Myers", "time": 1622343276861, "rating": 5.0, "text": "Great products, great sales, and great customer service!", "pics": null, "resp": {"time": 1618251225615, "text": "HURRAY!! We love customers!! We love to see them living a healthy life!! I am happy we were able to add to your life - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "100027862267785215202", "name": "Tamra Crawford", "time": 1587000742691, "rating": 5.0, "text": "I got my first bottle of Papa Vince olive oil several years ago. I love the rich peppery flavor of the oil. It is my favorite olive oil. I savor it and I am sad when I run out. I also love the Moscato Balsamic vinegar as well.  Both are true tastes of Italy.", "pics": null, "resp": {"time": 1587167971674, "text": "HURRAY!! My family and I have put much passion and love into the making of all our products. Your review put a big smile in my face!!"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "105303789965001730788", "name": "Angela Ficarra", "time": 1572998145578, "rating": 5.0, "text": "Love all Papa Vince’s food products especially the extra virgin olive oil excellent like no other.\nHighly recommend once you try you won’t go back sooo good best quality ever.\n\nThis Italian Sicilian family business is a delight with wonderful tasting products love their flavorful recipes and service is excellent ...easy online purchases.\n\nI’m a big fan!!!", "pics": null, "resp": {"time": 1575473521114, "text": "Thanks for sharing your love of Papa Vince, so glad that you love our products & you're having a happy olive oil experience!"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "109240106051320080305", "name": "Jeanne Contino", "time": 1622163653465, "rating": 5.0, "text": "I have bought several Papa Vince products - from pasta to olive oil to tomato sauce.  All of them are outstanding and they make wonderful gifts too!", "pics": null, "resp": {"time": 1600880132083, "text": "Ciao Jeanne!! Thanks for the great review!!"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "109908019151784321521", "name": "Cindy Warren", "time": 1574210136248, "rating": 5.0, "text": "This olive oil is fantastic!  It has a light, very flavorful mouth feel!  Not too strong or pungent.  But, very flavorful.\n\nThe lemon olive oil is great to lightly brush on fish, prior to baking.", "pics": null, "resp": {"time": 1575393891135, "text": "Thank you so much! We love to provide our customers with quality and authentic and flavorful extra virgin olive oils to accentuate any dish you make. We look forward to having you in again!"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "103417165937550142153", "name": "Lesa Gruber", "time": 1586870999697, "rating": 5.0, "text": "I had samples at there open house.  It was very delicious and you can taste the freshness I keep in stock when I can there Olive Oils especially the Lemon olive oil.  I eat a lot of salads it makes the best salad dressing.  I have tried it in my soups and marinades.  Love it.  Great wholesome product.  O.o so good for you", "pics": null, "resp": {"time": 1575393971248, "text": "Thank you so much! We are passionate about the quality of our extra virgin olive oil, pastas, sauces which come straight from Sicily. We look forward to having you in again!"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "112366881538444856489", "name": "Stephanie T", "time": 1574210882299, "rating": 5.0, "text": "This Olive oil and balsamic vinegar is amazing. I love it! The pasta is unique and so tasty! The owners are awesome too :)", "pics": null, "resp": {"time": 1575393708440, "text": "Thank you so much! We are passionate about quality food and love to provide our customers with a quality and authentic experience. We look forward to having you in again!"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "113169349185251570812", "name": "Matthew Talmadge", "time": 1606247208189, "rating": 5.0, "text": "This is my first time trying a premium olive oil and I'm so glad that this was my first choice. From now on, it will be my only choice.", "pics": null, "resp": null, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "115900375136437764289", "name": "Our Father's Heart (Our Father's Heart)", "time": 1576932961639, "rating": 5.0, "text": "Papa Vince's products are authentic and of high quality. I am a coffee lover and have started drinking Papa Vince Whole Bean Coffee. It has no pesticides, no Mycotoxins. It is Non GMO, low acid, rich in antioxidants and is Slow Fired Wood Roasted in Sicily Italy!! I love the fact that I can now drink a smooth coffee that is low in acid!", "pics": null, "resp": {"time": 1577114602012, "text": "Thanks, so glad to hear that you're enjoying Papa Vince coffee.  We love it too!"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "103233912765278447550", "name": "Cory LeDoux", "time": 1574210808403, "rating": 5.0, "text": "Amazing fresh clean olive oil straight from Sicily!\nThey also have fresh authentic pasta and tomato sauce as well.", "pics": null, "resp": {"time": 1575393788081, "text": "Thank you so much! We take pride in providing clean, authentic and quality foods and olive oil from Sicily and love to provide our customers with a quality and authentic experience. We look forward to having you in again!"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "100381328060069280349", "name": "Katy Allen", "time": 1510595442999, "rating": 5.0, "text": "Surprisingly the best pasta I’ve ever had. I bought a gift combo for the olive oil and balsamic vinegar which I’ve had before from the free sample promo and they’re both very very good. I wanted to try the tomato sauce - which I found was a bit bland.. I’ll stick with Rao’s. However the sauce tasted extremely fresh. I would recommend it for someone looking to use it as a starter to make their own sauce. The bottle of sauce is quite small so I’m not sure it’s worth the price. However, I was surprised to find that the pasta was so incredibly good. Definitely the best I’ve had. I also bought the lemon olive oil but haven’t tried it yet.", "pics": null, "resp": null, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "111034695445733017401", "name": "Jeff Rash", "time": 1372180068250, "rating": 5.0, "text": "I purchased Mamma Mia's Extra Virgin Olive Oil at the suggestion of a friend. It is excellent. The quality and usefulness are extraordinary. I have used it on fish and chicken prior to spicing and grilling with exceptional results. I now use it in my balsamic vinaigrette and it will be the only oil I use. Best of success to them so that I will not ever lose this source.", "pics": null, "resp": null, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "106695196830813052624", "name": "Vanessa M", "time": 1371834072733, "rating": 5.0, "text": "Mamma Mia olive oil is the best!  It is of the very best quality, and it tastes like olive oil should. There is no petroleum or after taste that you get from other oils.   It takes first place in taste and quality.  It comes straight from the trees in Italy to your table.  The health benefits of using olive oil are endless.  I highly recommend this oil.  You won't be disappointed!", "pics": null, "resp": null, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "115940480390074125986", "name": "Charles Tina Fountain", "time": 1411438502398, "rating": 5.0, "text": "Papa Vince Extra Virgin Olive Oil is the absolute best!!  It tastes like olive oil- not petroleum.  It compliments every dish with its light peppery flavor.  I not only use in my everyday cooking-- I also use it with my essential oils.   I agree with Mr. Adams “You will NOT find a better tasting olive oil at any price for sale in the United States”.  If you are a lover of everything olive oil or a novice health nut, this is the extra virgin olive oil for you!\n\nWE LOVE Papa Vince Extra Virgin Olive Oil!!!! :).", "pics": null, "resp": null, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "101819164406290989588", "name": "Dianne Foster", "time": 1474315718329, "rating": 5.0, "text": "I met Vitina at our September Delta Kappa Gamma meeting and loved her hyper personality and her enthusiasm over her family's Extra Virgin Olive Oil. My first time to have ice cream and Olive oil. Very tasty. Recommend that everyone try this with Papa Vince's Extra Virgin Olive Oil.   I highly recommend this oil to use with the lightest salads to meats", "pics": null, "resp": null, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "106859900339377667147", "name": "kathy m", "time": 1441794809498, "rating": 5.0, "text": "It really is the best olive oil and I think I have tried them all. Just as good as the olive oil you get in Italy. I think it actually may be better.", "pics": null, "resp": {"time": 1442106426872, "text": "HURRAY!! Thanks so much for  the awesome review. I can't be more excited about blessing people with the best Extra Virgin Olive Oil Ever"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "113633399659976647780", "name": "Donya Stokes", "time": 1448149380872, "rating": 5.0, "text": "Just met Vitina today in Fairhope, Alabama.  What a warm and friendly lady!  I have tasted many olive oils in many specialty stores and upscale restaurants, but Papa Vince's Olive Oil is the lightest, cleanest, truest flavor I have ever enjoyed!  I have payed a lot more money for oil that did not taste this good.  I bought a bottle for myself and a bottle for my sweet Dad!", "pics": null, "resp": {"time": 1449725762350, "text": "Thanks Donya for the wonderful review. Sorry it took me this long to answer. I am going through a high learning curve but I am getting there. XOXO, Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "101214783277174516562", "name": "Diana Darling", "time": 1417473193913, "rating": 5.0, "text": "I'm so thankful to have found Papa Vince EVOO! I am super picky about the quality of ingredients that I use in my recipes, and this stuff is amazing! And the flavor... Yum! :-)", "pics": null, "resp": {"time": 1417473655223, "text": "I am so excited you love Papa Vince EVOO. Thanks"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "112760956515176701877", "name": "anandee Jones", "time": 1427583568630, "rating": 1.0, "text": "Your company is dishonest. You charged my credit card for a sample of your product, but never sent the olive oil. That makes you a thief. Be very careful ordering from this company as they may charge you for a product and never deliver the promised good to you. Posted by a ripped off customer, Kevin Jones", "pics": null, "resp": {"time": 1427666588135, "text": "Your credit card was refunded the full amount of $0.99 on March 5th. An email reply was sent to you on March 5th stating that we do not ship to CANADA. Our email may have been placed in your spam or junk folder by your email provider. Your refund may appear in the next statement since it usually takes about 1 to 2 month for the refund process to take place. Sorry for the misunderstanding! WE DO NOT SHIP TO CANADA."}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "111082939678676785894", "name": "Kris", "time": 1500810196573, "rating": 5.0, "text": "BEST small, family business with the most delicious, freshest EVOO EVER!!!! I have tried MANY excellent, high end, award winning Extra Virgin Olive Oils, and this is my favorite, and my family's too. I'm a bit of an olive oil freak and I can't stop trying different ones-but I always end up coming back to this one. My mom & I love to taste test different olive oils, and we'll go on kicks with different brands, but Papa Vince's is always our #1 top choice that we always come back to. Their EVOO is SO delicious for salad dressing, drizzled on steamed veggies, (like broccoli or zucchini) and steak or chicken. It's also wonderful on baked potatoes, and of course on pasta, and in homemade pesto or tomato sauce. I LOVE to use it as a bread dip with some nice, hot & crusty, fresh Italian or French bread. 🥖 It's a small, family owned business with wonderful customer service as well. Vitina is SO sweet, and is such a wonderful, genuine lady. Anyone giving this company less than a 5 star review is shocking to me. My whole family loves this EVOO as much as I do, and the price is not bad at all considering it's imported, and the flavor is so fresh & amazing. Bottles of Papa V's EVOO make excellent gifts too. I gave large bottles as Christmas presents last year to a few close family members, and they were extremely well received. The olive oil has strong hints of tomatoes, with a fantastic peppery kick. I can taste artichokes in it too. I can't wait to taste the fresh harvest every year, it's never the exact same as the year before, which is awesome because I look forward to a great surprise every year now.Their Moscato Vinegar is delish too and makes a fabulous salad dressing mixed with the EVOO. Highly recommend this company and I can't wait to try some of their other foods, like the fresh pasta! I'm also excited to see what new foods they add to their selection!", "pics": null, "resp": null, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "117407029809188228433", "name": "Linda Fox", "time": 1429873216293, "rating": 5.0, "text": "Yes I just received my Homemade Busiate pasta made with Tumminia Wheat, Homemade Sicilian Cherry Tomato Sauce and of course Papa Vince EVOO.  I made pasta for dinner with the Cherry Tomato Sauce and EVOO.  I must say, this is the best pasta and tomato sauce I have ever eaten.  The pasta with Tumminia Wheat is awesome.  You cannot buy any pasta in the stores that taste like this.  Also the Cherry Tomato Sauce is the best too.  It is so sweet and clean tasting.  I am hooked on this stuff.  Oh yes, and the EVOO, as usual, it is the best EVOO anywhere.  You can taste the olives and spices and it is very light.  Love love love it.", "pics": null, "resp": {"time": 1434945323733, "text": "Hello Linda! You are indeed my best customer. Thanks for this beautiful comment."}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "100698769870426334269", "name": "Stefano Feo", "time": 1586820209332, "rating": 5.0, "text": "My family makes it!!", "pics": null, "resp": null, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "101733077092401052567", "name": "Harald Jacoby", "time": 1621536806733, "rating": 5.0, "text": "(Translated by Google) Fantastic products of great quality. They are absolutely worth the price.\nThe shipment was very quick and the packaging was very good. The customer service is exemplary and very charming. I wish this small family business every success.\n\n(Original)\nFantastische Produkte von hervorragender Qualität. Sie sind ihren Preis absolut wert.\nDer Versand war sehr schnell und die Verpackung sehr gut. Der Kunden-Service ist vorbildlich und sehr charmant. Ich wünsche diesem kleinen Familienunternehmen viel Erfolg.", "pics": null, "resp": {"time": 1621540422663, "text": "(Translated by Google) Ciao Herald !! Thanks for taking time to write such a nice review about My family's products. We have chosen to invest on quality instead of marketing and your review is a blessing - Vitina.\n\nCiao Herald !! Thank you for taking the time to write such a lovely review of my family's products. We chose to invest in quality rather than marketing and your review is a blessing - Vitina\n\n(Original)\nCiao Herald!! Thanks for taking time to write such a nice review about My family's products.We have chosen to invest on quality instead of marketing and your review is a blessing - Vitina.\n\nCiao Herald !! Vielen Dank, dass Sie sich die Zeit genommen haben, eine so schöne Bewertung über die Produkte meiner Familie zu schreiben. Wir haben uns entschieden, in Qualität anstatt in Marketing zu investieren, und Ihre Bewertung ist ein Segen - Vitina"}, "gmap_id": "0x889a0538982768c1:0xc0a10e6bb3509782"}
{"user_id": "107423745350341071423", "name": "Jared McGreevy", "time": 1612642840989, "rating": 5.0, "text": "First sandwich was a couple months ago, they make the best I’ve had in Birmingham. Cool little store with nice staff. If you want a bomb sandwich look no further.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOQ3RfDAOaUqMXyFq8uMfc40dbmb3ffocunu6yE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMC6ucefPYxDjfnRDapFKUTZ8_GxaRR6VLIbwoY=w150-h150-k-no-p"]}], "resp": {"time": 1617845445489, "text": "Thanks for the Support Jared! Hope to see you gain soon. Cheers"}, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "117530862613232678205", "name": "alesia adams", "time": 1620078110030, "rating": 5.0, "text": "We love Ore!  The deli has the best sandwiches in town and the shops have eclectic and interesting items. It is a great hidden gem in Avondale. Highly recommend.", "pics": null, "resp": {"time": 1620065464107, "text": "Thank you Alesia!! We greatly appreciate your support and look forward to seeing you again! Cheers"}, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "112027623749603161558", "name": "Jorge Camacho Yau", "time": 1604716721023, "rating": 5.0, "text": "Place is really nice and the staff members are very welcoming. Love the vibe and the layout of the store!! Everyone is super nice.. I really like the deli. Fresh products and service is top notch. I strongly recommend this place. Got to talk to the owners every time I come by and they are super nice people.. please come by check it out and support local business.", "pics": null, "resp": null, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "117567342067626393965", "name": "sean williamson", "time": 1619811547112, "rating": 5.0, "text": "Great food Sandwich (PCP) & pasta salad, super friendly staff, and clean comfortable vibe. Great addition to the neighborhood!", "pics": null, "resp": {"time": 1620065375134, "text": "Thanks for the support Sean! We look forward to seeing you in the future! Cheers."}, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "112493839731154229080", "name": "Mat Burkett", "time": 1617206997786, "rating": 5.0, "text": "One of the coolest places around! Great selection of products and the food is fantastic!! Great people and service!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMQoAXzARPvOs7QP8zhyLW9EDuT9spDvgL9vbjx=w150-h150-k-no-p"]}], "resp": {"time": 1617845326538, "text": "Thanks for the support Mat! See you next time. Cheers"}, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "103323050013210560635", "name": "Frog Price", "time": 1616023277991, "rating": 3.0, "text": "Bread on the 12 inch Crestwood was good. Big sandwich. Quality meat and cheese. Good veggies. Too much bread. Not enough stuff inside. Less meat and cheese than a Subway or any other 12 inch deli sandwich. Not a good value.\nStore was nice. I found some good quality patches for my patch jacket. I bought one of each of the four available.", "pics": null, "resp": null, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "118173945316981266295", "name": "Alexander Flachsbart", "time": 1618680841268, "rating": 5.0, "text": "FINALLY birmingham has a good sandwich shop! Ore has some of the absolute best sandwiches I have ever eaten in my life. Get the Crestwood toasted. You’ll thank me later. Oh and go on saturdays for the muffuletta. Best I have had outside New Orleans.", "pics": null, "resp": null, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "103705861748245277139", "name": "Wes Mitchell", "time": 1604752295765, "rating": 5.0, "text": "Excellent service. Food is amazing! Sandwiches are superbly made, fresh, and they taste fantastic. Mozzarella and basil bites are delicious! Not to mention this place has the coolest stuff in town. Everyone should check out Ore.", "pics": null, "resp": null, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "103359013265102997413", "name": "Kimberly Bivins", "time": 1608069156821, "rating": 5.0, "text": "Great place to buy gifts for family and friends, or if you just want to grab something for yourself.\n\nAlso, they’ve opened up a deli with delicious sandwiches and fresh made sides!", "pics": null, "resp": null, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "114975100694322802735", "name": "Duane Boatright", "time": 1604720966994, "rating": 5.0, "text": "Great place with great style. I really enjoyed my sandwich from the deli and the snacks I purchased from the bodega. I recommend swinging by and snack while you shop.", "pics": null, "resp": null, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "107544935307981270778", "name": "BIRMINGHAM BROKER Business", "time": 1604716506322, "rating": 5.0, "text": "We absolutely love this place. I have been able to purchase everything from really cool T-shirts to skateboard supplies for  my kiddo. They have great brands like Filson, Pendleton, Howler, etc.  Great concept.  Not to mention they just opened a deli that we enjoy at least once a week. Bravo. Fully support and recommend.", "pics": null, "resp": null, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "105151610507227407588", "name": "Josef Schuster", "time": 1604718606038, "rating": 5.0, "text": "If you have not been yet do yourself a favor and go check out Ore. It’s a top notch place to grab a fantastic sandwich for lunch I go once a week ( be sure to Try one of the sides they are all great (oh and for sure get a cannoli... you will be happy you did) if the great food isn’t reason enough to stop in, add the unique items for sale in the store end and you will quickly realize that this is a very unique spot that Avondale and Birmingham are lucky to have. Oh I almost forgot to mention any time I have been all the folks who work there are always happy to help and make you feel at home. Bottom line What are you waiting for go get some great grub and find that gift you needed or get something cool for yourself !!! You will be happy you went..", "pics": null, "resp": null, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "109181525349677559128", "name": "PJ Aguirre", "time": 1604717464219, "rating": 5.0, "text": "The sandwiches here are awesome! High quality ingredients & huge! Friendly staff too, in a cool local shop.", "pics": null, "resp": null, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "101240219394007539769", "name": "Greg Grammen", "time": 1604784007797, "rating": 5.0, "text": "Just visited Ore Mercantile for the first time. Had a terrific experience shopping and ended my visit with a fantastic Sammy!! Will be back on the regular.", "pics": null, "resp": null, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "113196851976360399802", "name": "SometimeAfterTwoAM", "time": 1604888339265, "rating": 5.0, "text": "It's about time Birmingham got an authentic italian deli.  I can honestly say I have experienced the real thing in NYC, Long Beach, and LA and this is comparable to all 3 of those.  I had the 6\" Avondale and it was more than I could eat.  I don't see how anyone could eat a 12\" alone.  I didn't weigh the meat but I'd guess this was 2X the amount of meat & cheese as you'd get on a 12\" from Subway or Firehouse Subs and that's on a 6\" sandwich.  Bread was gourmet and excellent.  Probably the largest selection of unique sodas and bottled beverages I've ever seen at a restaurant.  I'd estimate there are more than 50 different drinks NOT including traditional Coke and Pepsi products.  Friendly staff made me want to return ASAP.  You cannot go wrong with this true authentic italian deli.", "pics": null, "resp": null, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "109095991743508749092", "name": "Shane B", "time": 1604861191723, "rating": 5.0, "text": "If you want a good sandwich here's the place! Nice service and good portions.", "pics": null, "resp": null, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "103842503205419136257", "name": "gus contreras", "time": 1604717036192, "rating": 5.0, "text": "Such a rad store!!  It’s my one stop shop for birthday and Christmas gifts.  I can’t wait to try out the deli!!", "pics": null, "resp": null, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "106811956100990839053", "name": "mick bruce", "time": 1607206653361, "rating": 5.0, "text": "Great sandwiches loved the Crestwood!", "pics": null, "resp": null, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "111878002739859551276", "name": "Alberto Enes", "time": 1615307757415, "rating": 5.0, "text": "Came for the sandwich, stayed for the cannoli", "pics": null, "resp": {"time": 1617845419010, "text": "Thanks! Hope to see you again. Cheers"}, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "114206528847496796082", "name": "Tyler Russell", "time": 1574823393279, "rating": 5.0, "text": "A little something for everyone! So many retailers with something for yourself, friends, and family. Plus, BOILED PEANUTS!!!", "pics": null, "resp": null, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "116913330702680242460", "name": "Jenni Otwell", "time": 1574081916574, "rating": 5.0, "text": "Great spot to shop for yourself or for buying gifts for friends and family!", "pics": null, "resp": null, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
{"user_id": "108722395264030418126", "name": "Alex & Katie McKown", "time": 1609214894654, "rating": 5.0, "text": "Love this place!!", "pics": null, "resp": null, "gmap_id": "0x88891bbb5fd93f4d:0x8114bda9f459eee9"}
