{"user_id": "110082952650399489693", "name": "Libbie Russell", "time": 1629453597727, "rating": 5.0, "text": "What a wonderful experience I had when I went to Cloverdale Jewelers in Millbrook. I was greeted with a smile and a friendly hello. I went in to get a piece of jewelry repaired. I was told it would be ready by Friday. Boy was I surprised when I received a call the very next day saying it was ready. When I went to pick it up I was surprised to see how gorgeous my ring looked. They had cleaned and polished it along with replacing a stone and a prong. The price was very reasonable. So if you are looking for a jewelry shop locally that has amazing jewelry and a friendly staff you can not go wrong with Cloverdale Jewelers.", "pics": null, "resp": {"time": 1629470129182, "text": "Thank you for your kind words\nWe love our customers and we love what we do and that makes it easy to do a good job"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "106614962934911046901", "name": "Patricia Jordan", "time": 1614550682876, "rating": 5.0, "text": "I went to see Rick with some old jewelry I no longer wore & some rings passed down to me that I knew I'd never wear. I explained I have never worn a specific wedding band because over the years I've never found one that I adored enough to wear every day. Most look \"typical\" and I've happily worn the few pretty ones I've collected. I didn't know what I wanted,  I just knew what I didn't want. After a couple of discussions, Rick helped me realize, I had a ring from years ago that meant everything to me... the first ring my husband ever gave me. He suggested we \"create\" that same ring but with more of a commitment look. I couldn't be happier with the result. I had tears in my eyes when he handed it to me! Who knew the little ring I was given as a promise of hope from the beginning would mature into a lifelong dream that I can someday pass on to our only daughter!! Thank you so much for your patience and ability to realize what I really wanted all along!! I can't keep looking at it and smiling!!!! ❤", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPvCabxwNsJzFaj0ql0zIyNGBu29ub1Zt28wbhm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNLlST_pWGTMJuZcnr6h8EfZFdQS6OTUQNmmQFD=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "100617592377587265762", "name": "Bridgett Ann", "time": 1613855669124, "rating": 5.0, "text": "This place is amazing! Not only was it fairly priced but the owner was unbelievably helpful and kind. The atmosphere was relaxed and comfortable, he fixed my engagement ring ( a ring i might add that I did not get from here so he had no obligation to help me with it ) that was bent FOR FREE when other jewelry places were wanting to charge over 100 to do. He sized my ring in only a day, so no month or longer wait to get my ring back. He gifted me with ring cleaner just because he was considerate and nice when he did not have to. Its a great place and if I ever need jewelry or jewelry repair I will definitely come back to this man's store each time.", "pics": null, "resp": null, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "102414998515423242558", "name": "Penny Pearson", "time": 1623529531461, "rating": 5.0, "text": "This  was my first time visiting Cloverdale jewelers in millbrook al. It was amazing. I had an issue with my wedding ring and took it to them. Mr. Rick was able to take my ring and fix it and it looked better than when I first got it. He really knows his stuff when it comes to jewelry. When you are in the mood to buy something or have something repaired Mr  Rick is the person to call.", "pics": null, "resp": {"time": 1623549985301, "text": "Thank you Penny for your kind words\nWe at Cloverdale Jewelers love our customers and we love what we do.\nThat makes it easy to do a good job"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "112992251175185478205", "name": "Karen Lawler", "time": 1623957302324, "rating": 5.0, "text": "These are the two nicest people. Very friendly and professional but personable. I'd trust them with the crown jewels!", "pics": null, "resp": {"time": 1627912530050, "text": "Thank you so much for your kind words\nWe love what we do and we love our customers too\nThat makes it easy to do a good job"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "113019207810434182732", "name": "Jenny Blackburn", "time": 1615813917034, "rating": 5.0, "text": "Had watch battery changed for my husbands Tag watch. Super nice people. Have a 1 year warranty on battery and it was only $10. They gave me a pretty bracelet for being a new customer and were easy to talk to and deal with. I will be back!", "pics": null, "resp": {"time": 1615832332448, "text": "Thank you Jenny for the kind words\nWe love our customers and we love what we do and that makes it easy to do a good job.."}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "113219322157429089181", "name": "kimberly hurst", "time": 1613326265612, "rating": 5.0, "text": "Excellent customer service! I love my custom ring made from a picture. My family has made many purchases here and we love the selection of antique, one-of-a kind pieces. This is a great place to shop and buy jewelry!", "pics": null, "resp": {"time": 1613329246751, "text": "Thank you for your kind words and we love what we do and we love our customers that makes it easy to do a good job"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "104142024531456895338", "name": "Joey Johns", "time": 1620995063755, "rating": 5.0, "text": "WONDERFUL STORE , SOME  EXTRAORDINARY PIECES OF JEWELRY AND A GREAT FRIENDLY STAFF! I WILL DEFINITELY BE DOING MORE BUSINESS IN THE FUTURE!", "pics": null, "resp": {"time": 1621085266011, "text": "Thank you for your kind words\nWe love what we do and we love our customers too\nThat makes it easy to do a good job"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "108430862071807091680", "name": "Ryan Dix", "time": 1595764767240, "rating": 5.0, "text": "Over a holiday weekend, I was able to meet with the owner and get my tungsten wedding band removed from my swollen finger. He was timely and good natured and was not critical of me at all. When I'm able to replace my wedding band, I will most certainly be using Cloverdale.", "pics": null, "resp": {"time": 1599673465134, "text": "Thank you for the kind words\nWe love what we do and we love our customers too."}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "103213388682544924300", "name": "Vince Thomas", "time": 1592491942116, "rating": 5.0, "text": "I've been to a lot of jewelry stores, and lot's of times the stuff looks all the same. Not at Cloverdale Jewelers! They have some very unique pieces in their store. If your in the market for jewelry that is beautiful and unique, please come see Rick! He's a great guy!!", "pics": null, "resp": {"time": 1592501275363, "text": "Thank you Vince for the kind words..  We love our customers and we love seeing them smile..."}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "116216625502889664374", "name": "D G", "time": 1588393395656, "rating": 5.0, "text": "My husband and I went to this store today and they have the most beautiful jewelry! The owner was so nice!! We bought a beautiful diamond and sapphire ring! I absolutely love it!! We will definitely be back!!", "pics": null, "resp": {"time": 1599673500538, "text": "Thank you for your kind words\nWe love what we do and we love our customers too"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "113364225505564370974", "name": "Missy Clemmons", "time": 1595099649295, "rating": 5.0, "text": "My husband had his ring resized. The quality of work was top notch. Couldn’t have asked for a better experience.  Very professional and friendly. Highly recommend!", "pics": null, "resp": {"time": 1595106641890, "text": "Thank you for your kind words and we love what we do and that makes it easy to do a good job thank you for your business."}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "107849092721032919838", "name": "Tony Montgomery", "time": 1579826096895, "rating": 5.0, "text": "This is one of the best places to get new jewelry or to get your jewelry repaired. We’ve taken multiple rings to be fixed and they look perfect each time. Highly recommend and the turn around is super fast also.", "pics": null, "resp": {"time": 1579877162783, "text": "Tony, Thank you for your kind words. We love our customers and love what we do. Thank you for your trust and your business"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "101256243156828716310", "name": "Lucy Bradshaw", "time": 1562447644928, "rating": 5.0, "text": "Met Rick for the first time about a week ago. He was recommended to me regarding evaluation of some jewelry.  He was great & thorough and a pleasure to work with.  I would highly recommend Cloverdale Jewelers.  They are the best!  Thanks Rick👍😀", "pics": null, "resp": {"time": 1562454983041, "text": "Thank you for the positive review. We love what we do and we love our customers too. That makes it easy to do a good job."}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "114113727246575510106", "name": "Andrew delaney", "time": 1580002577298, "rating": 5.0, "text": "Really friendly staff. Fixed my necklace for a good price. Thanks again.", "pics": null, "resp": {"time": 1580008302996, "text": "Thank you for your kind words. We love our customers and love what we do. Thank you for your trust and your business"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "101360800705137711283", "name": "Elizabeth Peters", "time": 1582438135232, "rating": 5.0, "text": "Dropped my wedding band off to get sized and got it back the next day!! I haven't been able to wear it in months and now I finally able too look married and not engaged!", "pics": null, "resp": {"time": 1599673421325, "text": "Thank you for your kind words\nWe love what we do and we love our customers too"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "111354659253044651944", "name": "Debra Anthony", "time": 1517977966783, "rating": 5.0, "text": "Awesome place!! I needed a link removed from my watch and my ring sized down. Services were rendered the same day in about an hour at reasonable rates.I Will definitely make this my go to store! The owner and staff were extremely friendly and courteous. Stop by, they have beautiful pieces as well.", "pics": null, "resp": {"time": 1518015867962, "text": "Thank you Debra for your kind words and 5 Stars... We love what we do and love our customers too. That males it real easy to do a good job. We love seeing them smile. If our customers are happy, we are happy."}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "114080431801249270970", "name": "Danielle Brisson", "time": 1526156219671, "rating": 5.0, "text": "Just got engaged and needed to size my ring down... being newly engaged and very excited, I was hoping it wouldn't take longer than a few days. Cloverdale Jewelers took less than 30 minutes, super friendly and easy transaction. Highly recommend.", "pics": null, "resp": {"time": 1526316836534, "text": "Danielle, It was my pleasure to help you out. You were wonderful to work with and that makes it easy to do a great job.\nWe love our customers and we love what we do...\nThank you for allowing Cloverdale Jewelers in Millbrook, Al. to be part of this special event in your life."}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "106555881542595553318", "name": "katie corley", "time": 1528904669391, "rating": 5.0, "text": "We brought an old family watch in to have it repaired and were Very happy with his fast turnaround. Other shops wanted to send it off and take around 2-3. But he was able to do it in shop, just in time for Fathers Day! I absolutely recommend them. Great customer service!", "pics": null, "resp": {"time": 1528928648981, "text": "Thank you Katie for the great review. We love what we do and we love our customers too, that makes it easy to do a good job."}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "105343541173092502973", "name": "Danny S", "time": 1507233666382, "rating": 5.0, "text": "I know this is a jewelry dealer, but on google it says they also repair watches. I have an automatic Seiko 5 that was dropped and stopped ticking. Rick, fixed it in less than 5 minutes and the price was very reasonable. Rick was very kind and courteous. Great job!  Keep it up.", "pics": null, "resp": {"time": 1507295977645, "text": "Thank You Danny...\nWe like what we do so it is easy to do a good job.\nOur goal is to meet and exceed our customers expectations and that is easy to do because we love our customers and treat them like family... So gald your visit to Cloverdale Jewelers was enjoyable.\nWarmest regards,\nRick"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "104145549003510454868", "name": "Vanessa Salter", "time": 1505439463926, "rating": 5.0, "text": "Had a ring that needed to be sized.... had it back within a day or so... perfect fit and it looks better and feels better than I imagined!!! Rick done an excellent job. Will b going back for any other purchases or repairs!", "pics": null, "resp": {"time": 1505489659624, "text": "Vanessa, Thank you for the kind words. We love what we do and we love our customers and do our best to exceed their expectations..   Thank you again"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "105621079593039806310", "name": "Kathy Kelley", "time": 1502933068780, "rating": 5.0, "text": "Honest jeweler with knowledge and skills. Not your usual jewelry store.  Friendly place with many one of a kind pieces of jewelry. Or let Rick make you something just for you.", "pics": null, "resp": {"time": 1502978786173, "text": "Thank you Kathy for the kind words.\nAt Cloverdale Jewelers the customer comes first whether it's a watch battery or a diamond ring they all get our personal attention and the best in customer service.\nWe love all of our customers and provide them the best prices and service available.\nWarmest regards.\nRick"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "106283427003649065984", "name": "Alene Reid", "time": 1502907165145, "rating": 5.0, "text": "We are so blessed to have Old Cloverdale Jewelry in Millbrook! Rick is the absolute best at repairs and designs. He has a huge selection of beautiful jewelry at the best prices! Rick and Kathy are sweet people and want to help you select that perfect piece! Proud to call them friends of mine!❤️️", "pics": null, "resp": {"time": 1510063591859, "text": "Alene, Wonderful customers like you make it worth being in the business. Thank you for the great review. It's easy to do things well when it is what you love to do."}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "101164474368677833275", "name": "Shea Jackson", "time": 1502851786793, "rating": 5.0, "text": "I went in today to get several rings repaired and one was repaired while I waited! Very reasonably priced and Rick was very helpful and  attentive to our needs and answered all our novice questions without making us feel insecure for asking them! I have already made a wish list and will surely be shopping there again! I also like the fact that he's open on Saturday which is very helpful to those of us that work during the week! I highly recommend Cloverdale Jewelers!  Check them out for yourself!  You're welcome!", "pics": null, "resp": {"time": 1502893565940, "text": "Shea,\nThank you for the kind words.\nPlease know that we appreciate each and every one of our customers and value that they came to Cloverdale Jewelers for their purchase or repairs.\nWe do love all of our customers and want to be their personal jeweler in every way.\nThank you again for allowing Cloverdale Jewelers to serve you. Come see us again soon.\nWarmest regards,\nRick"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "116310224805031605771", "name": "Igor B", "time": 1469634195559, "rating": 5.0, "text": "Rick Bales is an experienced professional, who will give every customer the time and service they are entitled to. Whether you are looking to buy, sell, get a resizing, or appraisal, Rick and Kathy will not rest until the customer is well-informed, and most importantly, satisfied. Ever since I found this gem-of-a-store, I don't go anywhere else.  Thanks for all the hard work over the years, and I look forward to seeing you next time", "pics": null, "resp": {"time": 1499696644043, "text": "We love our customers and do everything we can to make their experience at Cloverdale Jewelers the best possible Rick \"Owner\" at Cloverdale Jewelers"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "101799601157684066728", "name": "Rachel Pugh", "time": 1504813641944, "rating": 5.0, "text": "Rick is fantastic! He sized my wedding band exactly how I wanted it done, he is quick on getting it back to you as well! I will use him as long as he is living! He is such a sweet man. Call him today, you will not be disappointed!", "pics": null, "resp": {"time": 1504894899121, "text": "Thank you Rachel for recommending Cloverdale Jewelers. We love what we do. We love our customers and do our very best to provide service above our customers expectations at a reasonable price with quality guaranteed. Customers like you make all the work worthwhile...\nRick Bailes"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "107457191457249434103", "name": "Jerry Myer", "time": 1538011904143, "rating": 5.0, "text": "Awesome place to get your jewelry fixed. Took seconds and it was so cheap! Got a broke necklace? Go here first!", "pics": null, "resp": {"time": 1538057040166, "text": "Hi Jerry, Thank you for the kind words...\nIt was just a small repair and I do not try to make a days pay on a small job.\nI try to treat folks the same way I would want to be treated.\nWe at Cloverdale Jewelers love our customers and love what we do. That makes it easy to do a good job.\nRick Bailes"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "109396415644557007467", "name": "Nita Linneman", "time": 1533838725429, "rating": 5.0, "text": "Rick was nice kind polite and just a fun experience.  He is \"home folks.\" He changed the battery on my Fossil watch..very reasonable cost  its great we have such a Jewler here in Millbrook.  No more going to Montgomery.", "pics": null, "resp": {"time": 1533844150325, "text": "Thank you Nita for the kind words. We love our customers and we love what we do and that makes it easy to do a great job."}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "107186534093122289153", "name": "Sandra Norris", "time": 1502906601388, "rating": 5.0, "text": "Amazing customer service, has beautiful vintage jewelry with the best prices! Will definitely be shopping with them often.", "pics": null, "resp": {"time": 1502979167818, "text": "Thank you Sandra for recommending Cloverdale Jewelers in Millbrook, Al.\nWe make the providing best customer service and affordable pricing on all of our New, One Of A Kind Antique and Vintage Jewelry our goal. We would like our customers to have a \"GREAT\" shopping experience whether it's a custom designed ring, an insurance appraisal or just getting a watch battery.\nWarmest regards,\nRick"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "109201167248151649431", "name": "Rick Bailes", "time": 1498780310754, "rating": 5.0, "text": "Cloverdale Jewelers is a Great jewelry store. Prompt courteous friendly service, the very best at watch and jewelry repairs...", "pics": null, "resp": {"time": 1501510209200, "text": "Thank you for your review. We love all of our customers"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "116741371967650593550", "name": "Tony Phillips", "time": 1498668990134, "rating": 5.0, "text": "In and out for quick repair and did great!", "pics": null, "resp": {"time": 1498743886056, "text": "Thank you Tony for the kind words.\nWe love our customers and do everything we can to make their experience at Cloverdale Jewelers the best possible\nRick \"Owner\" at Cloverdale Jewelers"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "103655304311927732457", "name": "Janie Johnston", "time": 1526121156660, "rating": 4.0, "text": "Very nice with lots to chose from.", "pics": null, "resp": {"time": 1526134285178, "text": "Thank you for the kind words and for shopping our store. We love our customers and what we do."}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "108188128740653804040", "name": "Robert J Trahan", "time": 1505753155660, "rating": 5.0, "text": "Quick and friendly service!", "pics": null, "resp": {"time": 1505769340352, "text": "Robert, Thank you for the review. We always try our best to meet and exceed our customers expectations. We love what we do and love all of our customers too.."}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "108818400034133832183", "name": "Bob Frick", "time": 1484890131302, "rating": 5.0, "text": "Great service!", "pics": null, "resp": {"time": 1499696632107, "text": "We love our customers and do everything we can to make their experience at Cloverdale Jewelers the best possible Rick \"Owner\" at Cloverdale Jewelers"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
{"user_id": "109767399491073366734", "name": "Sonnie Behrens", "time": 1522119256465, "rating": 5.0, "text": "The best around! !!!", "pics": null, "resp": {"time": 1522156504943, "text": "Thank you Sonnie... You know we love what we do and love our customers too.\nSeeing our customers smile makes what we do the easiest, best and most rewarding job around.\nThank you again for the kind words. Love ya, Rick and Kathy"}, "gmap_id": "0x888e81ac22cdf9ab:0x326aa123f09b2c11"}
