{"user_id": "101361256626014669243", "name": "Victoria Brady", "time": 1626294496793, "rating": 1.0, "text": "We went in to have something engraved and to buy a piece of jewelry for our new grandaughter.  We asked to talk with the engraver and looked at a child's bracelet while we waited. . He never came out and no one spoke to us at all. After being totally ignored by all staff members for about 20 minutes we left. I will shop somewhere else where my business is appreciated.", "pics": null, "resp": {"time": 1626296382104, "text": "Mrs. Brady I am so very sorry that you were unhappy with our in ability to get to you sooner. I apologize for that, but we were very busy when you were in the store. The engraver was already out front with a customer that arrived prior to you. When the engraver finished with the customer he was waiting on, he asked who was requesting him and you had already left. He was giving the prior customer the same attention that he was hoping to give you. We did have a shortage of staff today due to illness, I apologize. I am also sorry that you did not realize he was helping someone else, I am sure you would have understood had you realized such.  Congratulations on the arrival of your new granddaughter that is such a blessing! Again, I am sorry that our engraver could not get to you sooner. I am happy to talk with you by phone as I am hurt that you left feeling unappreciated, as that is never our desire! Please call 334-365-6552 and ask for Lynn."}, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "110194117082751730934", "name": "Kat Riemer", "time": 1619028682198, "rating": 5.0, "text": "Beautiful store and fantastic experience! As always it is a pleasure working with Bryan Jewelry. The staff is very friendly and knowledgeable. I highly reccomend them for all your jewelry needs!", "pics": null, "resp": {"time": 1626296527399, "text": "Thank you so very much for allowing us to work with you! We look forward to seeing you again soon!"}, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "117280027336009922125", "name": "Alex Baker", "time": 1613669547006, "rating": 5.0, "text": "Found a nice piece of jewelry as a birthday gift, and was very impressed by the courteousness and friendly sales attitude! My salesman was Randy,you guys should come by and see him! I will definitely be back and he has vast knowledge of all things jewelry!", "pics": null, "resp": {"time": 1626296674677, "text": "Thank you so very, very much for shopping with us and for leaving this very appreciated review. We hope to see you again real soon!"}, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "106703328818939386358", "name": "Jennifer Flores", "time": 1619542704359, "rating": 5.0, "text": "I had a great experience working with the professional and friendly staff at Bryan Jewelry! I highly recommend them and look forward to working with them again in the future!", "pics": null, "resp": {"time": 1626296481801, "text": "Thank you so very much for taking time to give us this very kind review. We look forward to working with you again soon!"}, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "102186790880448283690", "name": "JarHead", "time": 1604425375890, "rating": 1.0, "text": "After I asked a few to many questions they started ignoring me.  To high of prices for my taste.  Better deals else where.", "pics": null, "resp": {"time": 1605547480748, "text": "Ernie, thank you for providing your feedback and letting us know about this issue. We set a high standard for ourselves and are truly sorry to hear that standard was not met in your interaction with us. We strive to provide all of our customers with the best customer service and quality product. Please get in touch with us on 334-365-6552 and we'd be happy to help you out."}, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "100296116426806040664", "name": "Heather Cosby", "time": 1615491449587, "rating": 5.0, "text": "Great customer service, quick jewelry repair, great work!", "pics": null, "resp": {"time": 1626296630357, "text": "Thank you for your kind, kind words. We appreciate you taking time for this review! We hope to see you again soon!"}, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "109607650175338682259", "name": "Gisette Greene", "time": 1602366815790, "rating": 2.0, "text": "While I love the ring my husband picked out, I have to say this was one of the most unpleasant experiences I’ve ever had in a retail environment. I usually don’t like to post negative reviews but after hearing from multiple people that they experienced the same from here I felt I should. I instantly felt uncomfortable when I walked in. My husband had purchased my ring and I brought it in to get resized. That was my first visit and it was okay. They said to give them at least 5 days but I should receive it back sooner. 2 days later and they called back! I was thrilled! I was surprised how quickly the turnaround was. I left but the ring was too snug. I brought it back and the entire time the young lady was assisting me she seemed like I was a nuisance. Very unpleasant and I just couldn’t wait to get the heck out of there. Again, they had a very quick turnaround and when I walked in not one word was said to me. I walked up and I almost spoke first but I wanted to see how long this would last. FIVE employees there and not one spoke a word to me. When I got up to the counter still nothing was said. She handed me my rings and finally asked how they fit. Thankfully they fit perfectly and I never have to set foot in there again. Absolutely horrible service.", "pics": null, "resp": {"time": 1602621614374, "text": "We work hard to make all feel welcome and to provide excellent service. I sounds like we failed you and I am sorry! I do hope you will give us an opportunity to help you in the future. This will give us an opportunity to review all procedures. If you would like to speak to me in person, please come by or call 334-365-6552."}, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "103993319078882573737", "name": "Hahna Burney", "time": 1618499248618, "rating": 5.0, "text": "Fantastic customer service. Do yourself a favor and visit!!!!!", "pics": null, "resp": {"time": 1626296553411, "text": "You do us an honor, thank you!"}, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "104629522467905644467", "name": "Andrea Williams", "time": 1590811475164, "rating": 5.0, "text": "I called this morning,  then decided to go in to have some engravings done. Everyone was so nice, helpful, as well as professional! I needed the engravings in connection to a birthday gift, and needed it done extremely last minute! I called several other places beforehand and was pretty much told by everyone that it was impossible to get done in the timeframe for which I needed it, and I even offered to pay a fee in order to have it rushed. The person I spoke with said that not only could they get it done within my timeframe, but also they would not charge me a fee for doing so. I thought it would take at least a day and a half, but Justin got it taken care of in just a couple hours for me. I really loved his work, and the pieces looked beautiful! I was really made to feel like I was an important customer,  and that my business was truly appreciated. I was very impressed by the pregnant lady as well as Justin, and I will definitely be recommending Brian jewelry in the future. Additionally, it will be my go to store for jewelry purchases and needs from here on out.", "pics": null, "resp": {"time": 1590839693061, "text": "Andrea, we are so happy you felt welcome and appreciated in our store! That is our great desire. We are so pleased you allowed us to help you make your birthday celebration be enhanced by our services. Also thank you for giving Justin and Kendall a shout out. We hope to see you again soon!"}, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "107709277760853037469", "name": "Jenny Whisenhunt", "time": 1576436293392, "rating": 5.0, "text": "The amazing, creative, and lovely staff was able to work with me to design a new ring using materials from one of my late grandmother's and one of my old rings. They helped me to combine the stones of the two older ones into a new piece that is simply stunning and unique. I will definitely return.", "pics": null, "resp": {"time": 1579992950528, "text": "Thank you for allowing us to work with you!"}, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "105880442728029710205", "name": "Chrissy S", "time": 1587566013691, "rating": 5.0, "text": "Bryan Jewelry has a great selection with a variety of different designers. All of their employees are helpful and give great recommendations!", "pics": null, "resp": {"time": 1588282476427, "text": "This does my heart so much good! Thank you so much, we appreciate you!"}, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "101807605606932600103", "name": "Kathryn Lange", "time": 1588272350367, "rating": 5.0, "text": "The staff at Bryan is the best! Wonderful selection and beautiful store.", "pics": null, "resp": {"time": 1588282427215, "text": "Such a delight to read your review! Thank you for allowing us to help you!"}, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "109572799589341035598", "name": "Nicholas Carlton", "time": 1527191624482, "rating": 5.0, "text": "Friendly and helpful staff. They have the best selection and verity. Loved they show room and atmosphere. Really felt like I received a fair and honest price for a quality product.", "pics": null, "resp": {"time": 1579967243171, "text": "Thank You!"}, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "109184504048582852208", "name": "Louis Clough", "time": 1522332113448, "rating": 5.0, "text": "I've had the privilege of working with Bryan's Jewelers and it was a wonderful experience.  Their knowledge and staff are some of the best.  Don't hesitate to come here and see for yourself.  The best jeweler in the area!", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "116233540326154034088", "name": "Robert Golson", "time": 1607035534089, "rating": 5.0, "text": "Great service, friendly people", "pics": null, "resp": {"time": 1626296770997, "text": "You are the best! Thank you for allowing us to help you! We hope to see you again soon!"}, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "105675921166083124568", "name": "Cathee Gipson", "time": 1602536969152, "rating": 5.0, "text": "I wouldn't trust anyone else for jewelry purchases or repair.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "106183502807697470789", "name": "Catherine Binford", "time": 1522335308440, "rating": 5.0, "text": "These guys are awesome! They were so attentive to my needs and patiently helped while I decided what I wanted. They offered so many great options. These guys are the real deal and you can't beat their customer service and selection.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "115953417427864218663", "name": "Cassandra Lewis", "time": 1395862058555, "rating": 5.0, "text": "Recently I've made several purchases for some of my nieces birthdays. They are growing up and I thought it was time for a nice necklace or pair of earrings. They still wear them out to play but the quality hasn't diminished a bit! Durable, beautiful jewelry.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "113795461254081716307", "name": "Tracy Birdsong", "time": 1527188785561, "rating": 5.0, "text": "My husband and I have been trading with Bryan Jewelry for 30 years! We can always count on Lynn and her experienced staff to provide us with the top of line diamonds and pearls at competitive prices! We've been trusted her with our precious family heirlooms and we will continue to go to Bryan Jewelry as Lynn her staff have our own wavering respect in confidence.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "113641304009735950100", "name": "Stacey Gearing", "time": 1408978409605, "rating": 5.0, "text": "Just a nice, small family owned business. I think that is what gives it such a nice feel. Their prices are good and the staff is genuine. They are always very helpful and never pushy.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "105867866687394722119", "name": "Brittany Clayton", "time": 1490841631865, "rating": 5.0, "text": "Lynn and the staff at Bryan's make your experience such a pleasure from start to finish. They take their time with you and make sure you are truly satisfied with your purchase. We will continue to do business with Bryan's for the excellent customer service and the quality of their jewelry!", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "107192958249274613267", "name": "Tanjia Foster", "time": 1501251621356, "rating": 5.0, "text": "Did business with Bryan Jewelry for the first time this week. We could not have been happier working with Lynn. Top notch service, quality and value. They have a large selection and work with you to get you exactly what you want. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "100436358118826983904", "name": "Steven Page", "time": 1400859812571, "rating": 5.0, "text": "I really like Bryan Jewelry. I have been coming here for years and I always tend to buy earrings for my wife but all of their jewelry really is great. The friendly staff and nice variety are unbeatable.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "113462649357061642713", "name": "Roscoe", "time": 1578664326617, "rating": 1.0, "text": "This is NOT the place to try and sell Gold at.  They offer far less than current value. Re reply: What a bunch of jokers \"All of our offers are fair and honest\"  Fair offer it was not.  Everyone else pays within $10 of current spot values. Crazy.", "pics": null, "resp": {"time": 1466521002506, "text": "For over 63 years Bryan Jewelry has been one of the most trusted names in jewelry in the Prattville region. While we do buy Gold, we must inspect any and all products before we purchase them, upon looking at your product it was concluded that you had bullion. For your bullion we offered 75%, which was disclosed to you before the offer was made.  For any customer we will make an offer and it's up to the customer to make the decision to sell. All of our offers are fair and honest. It is with this policy coupled with our years of experience and services that have built a legacy of integrity and trust with our customers."}, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "114685191949913046461", "name": "Clayton Clark", "time": 1416840915909, "rating": 5.0, "text": "I've been Bryan Jewelry's client for 2 years now. My recent purchases were a diamond ring and a watch. I do love the fact that they buy gold and give you top money for it. There are several reasons why I like coming back here, because of the quality of the products as well as the friendliness of the people there. Mr. Bryan-the owner-is super.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "116478127987157959502", "name": "Casey Honious", "time": 1436995752866, "rating": 5.0, "text": "I had to have my wedding band resized they told us it normally takes about 7 days but were able to finish it that day. They are kind and attentive. I am greatly satisfied and would highly recommend them. Justin is a miracle worker", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "106309706217865492230", "name": "Linda Dunn", "time": 1397757929031, "rating": 5.0, "text": "I have been coming here for as long as I can remember. Not frequently, but just whenever I need something. Whenever I make a purchase or have something fixed everyone is always happy to help and that is what I like. I haven't even bothered looking at other jewelers because I am just happy with how I am treated here.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "105300419154811309923", "name": "JoAnne Kirkwood-Staton", "time": 1343147132172, "rating": 4.0, "text": "I really shopped around for my new earrings, I'm from Florida but I was visiting family in Montgomery and they recommended that I visit Bryan all the way out in Prattville. I have to say that I'm really glad I did, their diamonds were the clearest and had the nicest cut out of several different shops I visited in Montgomery. It was definitely worth the trip", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "106646711750483026752", "name": "Diane Bryant", "time": 1457450785763, "rating": 5.0, "text": "I have been coming to Bryan Jewelry for two years now. They are excellent and in all honestly this is the only place I will buy jewelry from now on. Very pleased overall.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "115733151449302376615", "name": "Joan Einer", "time": 1428521964599, "rating": 5.0, "text": "Any diamond jewelry I buy comes from here. I prefer to come to Bryan Jewelry because I like the staff and they are good at helping me. I have bought other things as well, their knowledge of their inventory and just about jewelry in general is the best.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "111585351897140074697", "name": "Laurie Brand", "time": 1453919081176, "rating": 5.0, "text": "I've been a customer of theirs for as long as I can remember.  I've bought everything from earrings, wedding rings, charms to watch batteries.  You can always count on them to have a great selection and great customer service.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "110366669237051479678", "name": "Robin Montgomery", "time": 1422911490423, "rating": 5.0, "text": "This has been my jewelry go-to place for years because they just have and do it all. I have bought some lovely pieces, had a few things repaired, and I even sold some of my gold recently. It doesn't get much better.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "113511274027433881078", "name": "Pauly Corletta", "time": 1387298573581, "rating": 5.0, "text": "I got my wife's engagement ring here and I am very thankful that I did. They helped me pick the perfect one and I'll go back again.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "114640204041176225856", "name": "Will Little", "time": 1401909317593, "rating": 5.0, "text": "I have been buying all my watches and jewelry from Mr. Bryan for many years now. the service and quality alone in my opinion sets them apart from any other jewelry shop in the tri county area. Bryan's Jewelry is and will remain the only jewelry shop I will buy from or recommend to friends. I would suggest anyone go in and enjoy the friendly staff. BEST IN THE BUISNESS!", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "114414303019185327324", "name": "Robin Jones", "time": 1381520276848, "rating": 5.0, "text": "Lynn and her staff have a great rapport with their customers. I began coming here since I moved to Prattville. I love the store.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "102555146430203467977", "name": "Chris Buchanan", "time": 1379511613425, "rating": 5.0, "text": "For years now I've been coming to Bryan Jewelry. Whether I need something repaired or I'm looking for something new I know they're the people to come to. Everything I've gotten has been beautiful and a quality piece.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "106501980306304439417", "name": "Randy Constancio", "time": 1579279902861, "rating": 1.0, "text": "Worst jewelry store ever. Hateful staff and liars. Will NEVER go back here!", "pics": null, "resp": {"time": 1579966469212, "text": "Randy I am distressed to receive your review. I have asked for clarification from my staff and searched our data base to find any encounter that would have resulted in your disappointment. At this point I remain puzzled. Please feel free to give us a call and ask for me, Lynn Bryan Young."}, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "103309791017403049480", "name": "Tyler Brannon", "time": 1426346522944, "rating": 5.0, "text": "I had my girlfriends engagement ring hand made here and it was less expensive than I could find any where else. The quality and service was incredible.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "106218338747429425344", "name": "Douglas Coleman", "time": 1448994566177, "rating": 5.0, "text": "I am beyond thrilled with the selection they offer. I absolutely love what I purchased, I also have to say the staff is very knowledgeable and friendly.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "105244001319415628811", "name": "Janie Marsh", "time": 1446583893301, "rating": 5.0, "text": "The staff at this jewelry store are outstanding and truly know what they are talking about. Their knowledge about each item is incredible.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "116223361353431490337", "name": "JessicaDuffey 91", "time": 1491573333232, "rating": 5.0, "text": "Had a very nice experience, I had a watch engraved for my husband and it was beautiful.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "101768179530988174299", "name": "Mick Norris", "time": 1504123265633, "rating": 5.0, "text": "High quality jewelry at a great price and friendly, helpful service!", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "105033506049907668264", "name": "Peggy Morton", "time": 1444074979074, "rating": 5.0, "text": "I have been going to this jewelry store for quite some time, they fix my jewelry as well purchasing watches and rings. The staff is beyond friendly and helpful!", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "117695807965463478700", "name": "Dama Darby", "time": 1419630068128, "rating": 5.0, "text": "Excellent family and always beautiful work and repairs.", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "116638725176443398703", "name": "Melinda Rogers", "time": 1405607479719, "rating": 4.0, "text": "Great staff and a great selection!", "pics": null, "resp": null, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
{"user_id": "100710101874182872644", "name": "jon sanders", "time": 1497458002282, "rating": 1.0, "text": "Don't go here to get any work done if you expect them to tell you the truth..", "pics": null, "resp": {"time": 1504103588221, "text": "Jon,\n\nWe also appreciate feedback from our customers on every level. We've extensively checked our database and have no record of a client by your name. For over 63 years Bryan Jewelry has been one of the most trusted names in jewelry in the Prattville region. We ask that if there was truly an issue with the service you received from our company that you call and / or visit the store directly and ask to speak to the Owner Lynn. Thank you"}, "gmap_id": "0x888e8f8a7a3718a7:0xb076a74fdfc6a866"}
