{"user_id": "103806851345709793444", "name": "Tony Carleton", "time": 1611851214103, "rating": 5.0, "text": "If you are close to Cullman Al this is the place to train.  Daniel will not only challenge you he will teach you to become the best practitioner you want to become.  He travels and teaches seminars across the county.  Great Instructor/Shihan/Sandan and runs a professional school. *****", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "117642242968361388982", "name": "Kyna Sterling", "time": 1508979176867, "rating": 5.0, "text": "My girls have been training here for a few years. The Sensei's are knowledgeable and sincere. They have created a family that you'd want to be a part of.  I've watched my girls' become more disciplined, excited about learning new techniques, and their confidence has grown.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPP8vCjjkL1Ht206-8i8LmXMVCqfYXcYhYOajr5=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "112762590676449094971", "name": "Trip Kirby", "time": 1513388634111, "rating": 5.0, "text": "An awesome gym to learn martial arts.  Highly recommended.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMk6d2XDWVrck775u6xxm4TGnHMjE4ekaWdmZ1B=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "115087903054384611166", "name": "Clay Malone", "time": 1547576774540, "rating": 5.0, "text": "This is definitely the best Martial arts school in the area. It is run by high level and knowledgeable instructors who always seem to take time out of their day to help and answer questions even outside of class time. From the instructors to the students, it is a friendly and safe training environment. I  have been training at Triad for 14 years and I have no complaints. The school has helped me grow not just by teaching me karate, but also by teaching self discipline and respect. I would recommend this school to anyone, children and adults!", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "110836414028038495505", "name": "Ryan Newman", "time": 1547581415188, "rating": 5.0, "text": "I trained here for over a year, and I can’t speak highly enough about this group. Instructors are very knowledgeable and the atmosphere is welcoming, even if you’ve never studied martial arts. It’s important to train somewhere you will progress and learn, but it’s just as important to enjoy the process and the people you train with day in and day out. I trained at the Madison location several times a week, and was always looking forward til the next time. Environment was very easy going and everyone was always willing to teach share info, new techniques, and answer my seemingly endless amount of questions. If I hadn’t moved away, I would still be rolling with this crew. Miss you guys!", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "116152850948805601556", "name": "Madison Clapp", "time": 1547942169134, "rating": 5.0, "text": "This best place to learn martial arts and self defense! I have trained at trained at Triad for three years going on four and I couldn't be happier! I started training just to learn self defense and I got so much more, I gained so much confidence in myself not just in defending myself but in everything. Everyone at Triad Martial Arts are always respectful, kind and very supportive and are like a second family to me! I would recommend them to anyone!!", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "117576647325055707835", "name": "Seth Nugent", "time": 1546356471043, "rating": 5.0, "text": "I highly recommend! All the instructors are extremely knowledgeable and they go above and beyond to help if you don't understand.  I've been training here 4 months and have seen a great deal of improvement in fitness and my understanding of martial arts. They also offer quite a few classes so you can train multiple times a week.", "pics": null, "resp": {"time": 1547574896516, "text": "Glad to have you here Seth! You're a great addition to the team!"}, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "117566300244063024262", "name": "K Yarbrough", "time": 1547590629774, "rating": 5.0, "text": "Both of my daughters trained at Triad.  I cannot say enough about the training they received.  I feel that they both left the school (for college) prepared and able to defend themselves if necessary.  The curriculum developed by Johnny Lee Smith is second to none.  I will always send students to Triad.  Sensei Danny has been so good to my family and we really love this school", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "104539179201859638095", "name": "maiko beeson", "time": 1547579744636, "rating": 5.0, "text": "They have high quality and detail oriented adults and kids classes. Kids programs allow a child to acquire the skills of not only how to protect themselves, but also how to be respectful to others. Training here is one of the best decisions I’ve made.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "109869679939005542865", "name": "Andrew Z.", "time": 1513207192199, "rating": 5.0, "text": "A fantastic place to learn the martial arts. You not only gain knowledge of the arts themselves, but strength and discipline as well. The environment is extremely welcoming and everyone will help you succeed. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "114159614683055438421", "name": "Faith Nugent", "time": 1549499527894, "rating": 5.0, "text": "My husband trains here 3-4 times a week and comes home with so much excitement (and sweat). He's always wanted to get into martial arts and I am so happy to see him exploring something he's really passionate about.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "104157028964801969004", "name": "Jessica Martin", "time": 1490614494060, "rating": 5.0, "text": "I can't say enough about how great Triad is. I had my son's birthday party here. Daniel and the entire staff is exceptional. They had great activities planned and lots of patience for this young age group. We also had our cake made through them and it was fantastic and beautiful! One stop shop for the best party!! After having the party, we are definitely enrolling our son in Triad. If you're considering Martial Arts for your kids or yourself, please check them out first! You won't be disappointed. The facility is huge and really seems to offer alot. Great experience.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "114917354331544039919", "name": "Matt Bynum", "time": 1578967844383, "rating": 5.0, "text": "I signed up for a free class. The folks there were extremely welcoming!", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "111252892361307983882", "name": "Deafening Silence", "time": 1510442816630, "rating": 5.0, "text": "I have been a part of the Triad family for the majority of my life. For 11 years I have trained and taught at Triad, learning about responsibility, leadership, loyalty, and the importance of a positive role model other than one's parents in shaping the character of the individual. My instructors have shaped who I am for the better and the family atmosphere at Triad extends beyond the bounds of the dojo. If you train here, you will have people who will support you and care about your development, inside and outside of class.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "100105157771675406553", "name": "John Alred", "time": 1547606939119, "rating": 5.0, "text": "I have trained there a few times traveling in out of the area.  They are a well organized group of professionals who take their craft very serious.  They make you feel welcomed and accommodating to whatever skill level you are at.  I have had nothing but the highest respect for the dojo and it’s staff.  Very well respected in the Dallas Texas area and spoke of highly by the Machado’s!  Hit them up if you are in the Alabama area for the best training you can get.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "107827901105616942664", "name": "Michael Borden", "time": 1547575365805, "rating": 5.0, "text": "Wonderful gym with a great family atmosphere.   I have trained at several gyms around the southeast over the past 29 years and Triad is on the best I have ever been involved with.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "113625723869816514699", "name": "John O'Brien", "time": 1547578370708, "rating": 5.0, "text": "Sensei Danny and the other instructors are world-class martial artists and even better people. Home away from home and the best in the area, hands down.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "114123841112986002256", "name": "Alan Hunt", "time": 1547591864286, "rating": 5.0, "text": "I have trained Jiu Jitsu at Triad for 3 1/2 years now. When I started I had zero background in grappling or wrestling. I got lots of mat time and even though I was submitted more times than I could ever hope to count, I never felt in danger or got injured. Every instructor and training partner I've ever grappled with at Triad has an amazing attitude. They are looking to make you better as they better themselves.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "110245680004955120856", "name": "Zack Henry", "time": 1355129348294, "rating": 5.0, "text": "This place is amazing. Most knowledgeable staff in the state, and they are wonderful people as well! Triad really has a welcoming environment and the people there support each other like a family. If you are considering martial arts for you or your children do yourself a favor and give Triad a shot.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "114784049229163176373", "name": "William Terkeurst", "time": 1490709734092, "rating": 5.0, "text": "My daughter has been training with Triad Martial Arts for 5 years now. We love the family atmosphere and the quality instruction. My daughter loves this place and looks forward to each class.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "109363863906108947308", "name": "Cooper Lawrence", "time": 1506552850802, "rating": 5.0, "text": "I've been training at Triad for over half my life. It's not just some martial arts school where they hand out belt everything is earned. And it's more than just a group of people it is a family.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "104820139102751920153", "name": "Erin Kramer", "time": 1547587318267, "rating": 5.0, "text": "Wonderful family atmosphere with knowledgeable and respectful instructors and training partners who always go above and beyond to help each other grow as martial artists.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "111082809827370284127", "name": "Carlile McCoy", "time": 1355148505397, "rating": 5.0, "text": "This is the best dojo in Madison.  They are family oriented.  Danny and the other instructors teach disciplined and respect of others in addition to martial arts.  Once you join you become part of the Triad family.  The staff is also wonderful in keeping the facility clean well organized.  It is also a very large facility so there is plenty of room for classes.  We love this dojo!", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "102578683668322820844", "name": "Chris Kramer", "time": 1547582910026, "rating": 5.0, "text": "Amazing crew of instructors and training partners.  Respect, discipline and safety are always priority.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "108443733504982758610", "name": "John Rogers", "time": 1547831412116, "rating": 1.0, "text": "Abosultely terrible this place.  I have been in dojos all around the world.  I have competed in cage matches, in tournaments.  I have my own dojo in California and I am telling you right now, this place is absolutely awful.  As soon as I went in I knew I was in for a ride.  The place is so boring.  There are no workout instruments or anything.  The only thing there is a broken, anticuated workout room upstairs.  The lessons ae horrible.  I have seen many of these techniques and trust me, these do not work.  Avoid this place.  I have already told all my friends and family to not go here.  I have many students who spread the word of this place.  If you're wise you will choose another place.", "pics": null, "resp": {"time": 1547832319332, "text": "Hi John,\nI'm sorry you did not like the facility. I don't recall you coming in not do I have your name on any release but I could be making a mistake. I will stand by our training as we have professional fighters from our school as well as people competing in and winning at the highest levels of JiuJitsu. I hate that you didn't enjoy the training though. Where is your dojo in California at? I'm out that way often and am always looking to learn new technique! Thanks for your review!"}, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "102934861959970554103", "name": "Manilla Gorilla", "time": 1501698801833, "rating": 5.0, "text": "A very traditional approach to martial arts, with respectful staff, I am so glad I came across this dojo.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "117021142286141185731", "name": "Marcus Kirby", "time": 1513388672511, "rating": 5.0, "text": "Excellent Martial Arts school. I highly recommend Danny!", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "104902705755016840241", "name": "Elizabeth Peltola", "time": 1547580963264, "rating": 5.0, "text": "Best martial arts place around!", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "111652741340334319750", "name": "kellie kirby", "time": 1355172046646, "rating": 5.0, "text": "My son has been taking karate with Triad for about 2 1/2 years and he looks forward to classes each week. His skills have improved along with his respect, control and dedication to a goal. In addition to the regular karate and jiu-jitsu, he is motivated to earn the money to pay for monthly private lessons. Sensei Danny has been an outstanding role model for my 11 year old.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "110284834471676637274", "name": "Joe Parrish", "time": 1547588974833, "rating": 5.0, "text": "Awesome instructors and training partners!", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "109648389146014581505", "name": "Eric Meckl", "time": 1343236421645, "rating": 5.0, "text": "Triad Martial Arts is the school of Johnny Lee Smith. Triad features traditional karate, kobudo, Brazilian jiu-jitsu, Equalizer women's self defense, and a Vale Tudo program ideal for those interested in mixed martial arts competition.\n\nI began training at Triad in May, 2010. At the time, I was 33 years old, obese, suffering from high blood pressure, and badly out of shape. Training in their BJJ program has helped me to lose over 40lbs, and at age 36 I am now in better health than I was at 26. They have a great family atmosphere, ego-free training environment, and truly world class instruction.\n\nIf you have any interest in learning martial arts in northern Alabama, this is the place to be. Largest martial arts facility in the state. Highest ranked BJJ black belt in the state. Most BJJ black belts of any dojo in the state. Only Pan Am champion in state history. Vale Tudo program has already produced MMA pros Daniel O'Brien, Stephen Wilhite, and Matt Ward with more on the way.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "111399543972801352719", "name": "Alan wilson", "time": 1434025464880, "rating": 1.0, "text": "I do not and will not support Mr. Smith because he wrongfully supports Officer Parker.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "117825125475423350760", "name": "Dan Griffiths", "time": 1495492727501, "rating": 1.0, "text": "This gym lacks respect... Find a different gym to train at.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "100242014468353837588", "name": "SJ Donahue", "time": 1627601185981, "rating": 3.0, "text": "I really had high hopes for this camp and do think that overall it is good.  We became a little frustrated as summer camp went on, that they require DAILY extra cash of $5.  That really ends up becoming quite expensive on top of the initial price, I can't imagine having multiple kids there!  While I think the occasional field trip is fun for a change, I felt like some times this was used unnecessarily.  This information was also not told up front, but after signing up in the paperwork required.  Extra money for field trips, snacks, pizza parties, gas for the vans?!, etc.  Honestly, this is what changed our mind from doing the After School Program.  Also keep in mind the After School Program change: initially they said there would be homework time, Jiu Jitsu/tumbling/gymnastics practice, and an active game (we thought, perfect, not on devices!).  This has now changed to field trips again with daily fees and less emphasis on JJ, with no word of homework time.  It's basically 2-2.5 hours, why are multiple field trips expected???  Again - overall good, I believe they are trying, but I think they have moved away from some of the initial appeal of these programs.", "pics": null, "resp": {"time": 1627736754334, "text": "SJ! Thank you for your honest feedback! We strive to improve our programs on a daily basis!! Randall"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "118354963894732372963", "name": "Mike Fetsch", "time": 1626355487867, "rating": 5.0, "text": "Staff is awesome and really cares about your individual experience. Learned teachers means a wide variety of techniques taught. Facilities are great, and everyone is inclusive and friendly.", "pics": null, "resp": {"time": 1626370766544, "text": "Thank you sir! Randall"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "113377179990987359907", "name": "Colin Mitchell", "time": 1620227352397, "rating": 5.0, "text": "I’ve been training BJJ here for years. Gym atmosphere is very positive, and all management and instructors are very professional. Staff and members go out of their way to make newbies feel welcome. Couldn’t recommend more!", "pics": null, "resp": {"time": 1620250374291, "text": "Thank you for the kind words!! Randall"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "103597604901772932839", "name": "Amie Brown", "time": 1622603083072, "rating": 5.0, "text": "My son loves this summer program! It's amazing to be able to go to work with the peace of mind that my son is in good hands and having so much fun!", "pics": null, "resp": {"time": 1622604022751, "text": "Thank you for the kind words!!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "108135366689739818615", "name": "Jackson Swartz", "time": 1616601878087, "rating": 5.0, "text": "Very friendly and inclusive staff, it’s a fun way to stay active.", "pics": null, "resp": {"time": 1616607156064, "text": "Jake!! Thank you!! See you tonight 7 pm no gi bjj at aumma!! Randall"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "112637822304414859848", "name": "Eric Bohanan", "time": 1603212009381, "rating": 5.0, "text": "I absolutely love this place! Great atmosphere and training environment. The staff and instructors are all super helpful and welcoming. The people going are all great. Only been going a short time and I’ve already learned a lot!", "pics": null, "resp": {"time": 1603218704787, "text": "Thanks Eric!! Randall"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "106783000615877456992", "name": "Alexander Adolf", "time": 1599857304526, "rating": 5.0, "text": "Auburn BJJ is exactly what I was looking for in a BJJ gym. Very knowledgeable MMA instructions with a great emphasis on technique, practice, and discipline, while keeping it fun. All of the coaches, owners and members keep a family atmosphere and culture in the gym that allows you to feel comfortable to ask questions, trust each other and build friendships quickly. I highly recommend Auburn BJJ.", "pics": null, "resp": {"time": 1599857974151, "text": "thanks!!!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "104199405455505055098", "name": "Andrew D'Amico", "time": 1597934201403, "rating": 5.0, "text": "Dropped in for a class while visiting Auburn. They were awesome. Great instruction and fantastic culture. Had a great time and will definitely drop in again when I’m back in Auburn...War Eagle!", "pics": null, "resp": {"time": 1598652097086, "text": "Thank you sir!!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "112879577214776249457", "name": "Clinton Lothrop", "time": 1598666596217, "rating": 5.0, "text": "You're welcome, it is a very nice well run gym and community. I am happy to have discovered it.", "pics": null, "resp": {"time": 1598662930036, "text": "Man, thanks!!!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "100596772846087517637", "name": "Jack Hamersky", "time": 1594909111988, "rating": 5.0, "text": "Unbelievable staff that instill in their business what they practice on the mat. The level of understanding and flexibility for families is unparalleled. Excited to get back at it in the fall.", "pics": null, "resp": {"time": 1594913587699, "text": "Oh man! thanks for the kind words! We miss seeing ya'll!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "103627553896000861656", "name": "Nikki Richardson", "time": 1565711176621, "rating": 5.0, "text": "My kids have really enjoyed their experience here so far. We hope to continue going here for many years to come. The teachers are great with them! My oldest is 8 he’s learning a lot and so interested in it. He’s very shy but learning to open up more.", "pics": null, "resp": {"time": 1565713963955, "text": "Thank you so much!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "100429476558222887757", "name": "Nathan White", "time": 1603142016685, "rating": 5.0, "text": "Great family atmosphere, where everyone is working to help you succeed.", "pics": null, "resp": {"time": 1603142758881, "text": "Thank you sir!!! Randall"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "101101900506987202883", "name": "Ciarra S", "time": 1564154645184, "rating": 5.0, "text": "For our son's 3rd birthday in June, he said he wanted to be like a ninja turtle. The best we could do was sign him up for Jiu Jitsu. He has been in class for about 3 weeks and loves it! I feel like he is learning so much and he is excited to go every day. He loves his instructor and says that \"Ms. Raven misses him\" on days he does not have class. She is very patient with him. So far, we love it!", "pics": null, "resp": {"time": 1564156023864, "text": "Thank you so much!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "103723165756060817768", "name": "Jesus Perez", "time": 1559787762016, "rating": 5.0, "text": "It's a place where strangers become like family, everyone helps one another get better and progress as one. My 5 year old also loves it and he just started. Hopefully my wife follows us too! Everyone should definitely give it a try.", "pics": null, "resp": {"time": 1559788427706, "text": "(Translated by Google) Thanks friend!\n\n(Original)\nGracias amigo!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "109542477084258887265", "name": "Hoffman Rhyne", "time": 1560633877817, "rating": 5.0, "text": "I've been a member here for about 3 years.  I had no previous experience in martial arts, but Randall, Steven and the other staff are great instructors.  Now I only attend the open mat times and we all help each other keep improving.  It's not only a great place to learn BJJ, but also to make some solid friendships.", "pics": null, "resp": {"time": 1560645145058, "text": "thanks buddy!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "107414203298187353940", "name": "Patrick Morgan", "time": 1552924171811, "rating": 5.0, "text": "If you are looking to change your life, get in great shape and have fun while doing it, become a member of Auburn Jiu Jitsu. You will not find better instructors who care about you as an individual. I have been a member for nearly 3 years and my one regret is that I didn't start training Jiu Jitsu earlier. So, what are you waiting for. Make that phone call or drop by and get started today!", "pics": null, "resp": {"time": 1552941620176, "text": "Thanks Patrick!!!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "115909369211432220993", "name": "Kounte Threadgill", "time": 1510184542861, "rating": 5.0, "text": "There are many reasons why I would recommend Auburn Jiu Jitsu but the two most important reasons are the dedication and patience of all the instructors. They really do want to help your child learn and become an outstanding individual on and off the mat. My son started here over a year ago and his self confidence has grown tremendously. I would tell anyone that this is most definitely the place to be!", "pics": null, "resp": {"time": 1510196696718, "text": "Thank you so much!!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "112941720972234226322", "name": "Nathan Southerland", "time": 1554342587013, "rating": 5.0, "text": "Randall and the staff are amazing! It doesn’t matter your ability they work with everyone to help them learn and enjoy Jiu Jitsu. Starting your journey here is a great decision.", "pics": null, "resp": {"time": 1554346236897, "text": "Thanks Nathan for the kind words!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "113956408505059141561", "name": "Paul Medina", "time": 1559772750737, "rating": 1.0, "text": "While I was a student there I greatly enjoyed it. The staff was nice, the lessons interesting and a good overall atmosphere. However, the issue I have is their handling with billing and cancellation of memberships. I sent them multiple emails asking to have my membership cancelled yet I received no reply. I have called them multiple times and left voicemails(because, for whatever reason no one picks up) but there is no return of my calls. I even called and talked to Randall, the owner, who said he would make sure to do it. He did not. They proceeded to charge me despite no longer attending and having asked to be cancelled multiple times.", "pics": null, "resp": null, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "106097419994917410277", "name": "Scott Cleveland", "time": 1480429029865, "rating": 5.0, "text": "Great school! I have seen my sons confidence grow as he progresses through the belts, and have no worries about his ability to fully defend himself.  Kids Mid level package breaks down to around 20 one hour classes a month (5 a week) at ~120$, That's 6$ a class. Hands down, the best money  I have ever spent.", "pics": null, "resp": {"time": 1480436653965, "text": "Thanks!!! We have great kids and parents!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "115284609354963071425", "name": "John Stokes", "time": 1559844572181, "rating": 5.0, "text": "Mr Randall and Steven are great instructors. Very friendly and knowledgeable. Awesome environment to train in.", "pics": null, "resp": {"time": 1559845355333, "text": "Thank you sir"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "112452002771257352586", "name": "David Bostic", "time": 1559788202808, "rating": 5.0, "text": "Randall and the rest of the instructions are great. I highly recommend getting your children signed up and training.", "pics": null, "resp": {"time": 1559788406062, "text": "thank you sir!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "102234052720987403800", "name": "Shengkai Xu", "time": 1574015625262, "rating": 5.0, "text": "This place is a big family, everyone is helping me to get better.", "pics": null, "resp": {"time": 1574027116789, "text": "Thanks!!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "108805081142356265696", "name": "Jon Jordan", "time": 1575061407958, "rating": 5.0, "text": "This is a great Gym for anyone looking to start jiu jitsu or develop your game to a higher level. Everyone is super friendly and contribute to the clean, family friendly environment. As a jiu jitsu practitioner of 10+ years I really appreciate the depth of knowledge Randall has and his willingness to help others progress. Always a pleasure when ever I can train here.", "pics": null, "resp": {"time": 1575069889233, "text": "Thanks Jon!! Always good to see you!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "113015417689514552783", "name": "Jenny Pope", "time": 1570477269087, "rating": 5.0, "text": "My daughter is really enjoying classes here and having such a positive experience!", "pics": null, "resp": {"time": 1570478672271, "text": "Thank you so much for the kind words!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "102166872739752983559", "name": "Lori Duck", "time": 1509756177839, "rating": 5.0, "text": "Greatest role models for your children!!  The staff becomes family. Best investmentment we have made for our daughter to instill self confidence, agility and mental strength.", "pics": null, "resp": {"time": 1509761006949, "text": "Thank you so much for the kind words!!!!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "112014713062306201750", "name": "jesse savage", "time": 1553023418762, "rating": 5.0, "text": "i have been training there for four or five years great place for both Brazilian jiu jitsu and Judo", "pics": null, "resp": {"time": 1553026441263, "text": "Thanks Jesse!!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "105225001796214383715", "name": "ArchDukeOfTops", "time": 1509555753333, "rating": 5.0, "text": "Excellent family atmosphere for adults and children.  Great instructors and grappling!", "pics": null, "resp": {"time": 1509572927028, "text": "Thanks!! It's our students that make it awesome!!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "115956543474701938500", "name": "Randall Plaisance", "time": 1511545820583, "rating": 5.0, "text": "The instructors and the culture here are exactly what we need more of in this world. Great program for kids, adults, men and women.", "pics": null, "resp": {"time": 1511552049916, "text": "Thanks Dr Randall!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "105702505653376644117", "name": "James Ernst", "time": 1580443068866, "rating": 4.0, "text": "(Translated by Google) Dinka dinka doh\n\n(Original)\nDinka dinka doh", "pics": null, "resp": {"time": 1580521460203, "text": "wow! thanks!"}, "gmap_id": "0x888cf2ef2b39b5c5:0xc18b50d469e96d85"}
{"user_id": "117966643045464477767", "name": "George Green", "time": 1609280661091, "rating": 5.0, "text": "I came over from England, and asked to join a session and absolutely loved the place. It has a fantastic atmosphere, lovely people, and has a warm family environment. Professor George, is friendly, and articulates drills & movements very well. I felt extremely welcome! unfortunately I was only able to train a month, and was incredibly sad to stop!\n\nI plan to return as soon as possible, it is a fantastic place.", "pics": null, "resp": {"time": 1609393275438, "text": "Looking forward to your return George!!!\n\nSee you soon!!!"}, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "108181608335289813046", "name": "John Willis", "time": 1602039553101, "rating": 5.0, "text": "This place has literally helped me change my life for the good. Mind body and soul are all worked on here. The Professor, George Wehby, is very skilled and knowledgeable and has helped guide me on the way to becoming the best version of myself!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "104290684489297892170", "name": "Maria Gilbert", "time": 1469309402597, "rating": 5.0, "text": "Had a fantastic birthday party for Jack at Lionheart today. All the kids were engaged, busy, and loved the obstacle course. Thank you George, Dustin and J.D. for making this a fun event for everyone!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNqfM4eRr2I6UGg5PxG0rkxXIfS6ZY8FRZ5fHYm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOwj4VkFix1-88HCQzZF8WdPUiz_6L845TEublU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "106020725954275620872", "name": "John McLemore", "time": 1596902738190, "rating": 5.0, "text": "I've been a member of Lionheart for around 2 years now, and I can't say enough good about it. I've been around combat sports and martial arts for some time now, and Professor Wehby is by far the most superior instructor that I have had the pleasure of learning from.\nThe atmosphere that's been created at this academy allows beginners to learn without feeling uncomfortable while also pushing the  more advanced students to improve.\nAwesome place.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "117854971485866066388", "name": "Aaron Travis", "time": 1595691757677, "rating": 5.0, "text": "Great place with a great atmosphere.  George is truly passionate about the art and takes a principle approach to teaching.  Perfect environment for the beginner or advanced student.  Become a part of the Lion Heart family!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "101886573294471056100", "name": "Matthew Denaburg", "time": 1602184167616, "rating": 5.0, "text": "This school provides the perfect blend of a fun, welcoming environment and quality instruction. I have trained in eight different styles at various locations over the past 21 years, and Professor Wehby is by far the most accommodating instructor I have ever had the pleasure of training under. Whether you’re an experienced grappler, a striker who struggles with grappling (like me), or new to martial arts all together, this is the place to be. I truly can’t speak highly enough of Professor Wehby and his academy.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "103178900164268678950", "name": "Kirk Knudsen", "time": 1595429610209, "rating": 5.0, "text": "Great family atmosphere, wonderful place to train.  Instructors teach the Jujitsu concepts like no where else I’ve been.  I’d give it ten stars if I could.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "112385525376590742634", "name": "jeremy giadrosich", "time": 1595456777738, "rating": 5.0, "text": "I am a new student and can't say enough good things about both the instructor(George Wehby) or the people/enviroment at this school. George and the class have welcomed me open arms and made my first uncomfortable classes of not knowing anyone both inviting and accepted. I look forward to every class I attend not for just the teaching but also the camaraderie.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "105942575142355293612", "name": "Randall Phillips", "time": 1595386572814, "rating": 5.0, "text": "George Wehby is a true jiu jitsu gentleman. I have had him down to my school in Auburn to teach a seminar and every student loved having him. He teaches  jiu jitsu concepts that have lasting impressions on students. His character and professionalism in the jiu jitsu community is unrivaled.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "100534784673471152872", "name": "MrRshirley4", "time": 1598234178412, "rating": 5.0, "text": "Good instruction in jiu jitsu and in our spiritual life also.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "102724745932866278002", "name": "chris elms", "time": 1566666156791, "rating": 5.0, "text": "Every single person there was very friendly and welcoming. They all came up, introduced themselves, shook my hand unprompted.\nGreat place to train.\nThey even had a blue belt that looked exactly like Brad Pitt with a beard named david.", "pics": null, "resp": {"time": 1566667684792, "text": "😂 @ Brad Pitt look alike\n\nGlad you had a great time.\nSorry I missed training with you."}, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "117233433322048451922", "name": "Jody V", "time": 1478751059651, "rating": 5.0, "text": "I walked into this gym to just check it out 1 day. I have no prior experience with any martial arts. I like the way George broke every move down step by step & explained why it was done this way. He makes sure all levels of experience are understanding each move. Great place. Very friendly environment from the time I walked through the door. Students & instructor are great. I've been to a few class now & can't wait to go to the next.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "112025566894159895513", "name": "Nathan Fisher", "time": 1565478915233, "rating": 5.0, "text": "My son and I have both been training under Professor Wehby for about 9 months. Not only have we improved our fitness, but BJJ challenges each of us every session. This allows us to grow together as we each walk our walk in the gym. The instruction is top notch and the culture of the gym is very welcoming and accepting. Please come out and join us!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "106845757624994192712", "name": "Patrick Norman", "time": 1461040218589, "rating": 5.0, "text": "Hands down the best thing I've ever done for myself! George is a fantastic teacher and really knows how to help you as an individual. Most fun thing you can do to lose weight and learn a skill. It has helped change my life and it can definitely do the same for you!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "112531383566222456489", "name": "Eddy Parsons", "time": 1468437336989, "rating": 5.0, "text": "My daughter and I trained with Coach George for about a year. We both really enjoyed it and I feel like he helped advance the skill level of both of us. I hope to be able to train with him more in the future.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "102939123891104856574", "name": "Austin Dobbs", "time": 1511931421224, "rating": 5.0, "text": "Going to Lionheart Academy is one of the best decisions I've made. Really good atmosphere, and a great coach! Its definitely worth looking into.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "105073071856461247977", "name": "Howard Kersh", "time": 1461278007788, "rating": 5.0, "text": "The Lion Heart Academy has a very welcoming atmosphere and the majority of the students are working professionals.  There is a good mix of male and female students as well as ages and experience levels. I am 42 years old and I am not the oldest or the youngest. The instructor (George) is one of the best BJJ teachers that I have ever trained with.  I travel all over the country for work so I say this having had the opportunity to train at many well-known BJJ schools.  The big difference with George is that he spends a lot of time covering the body mechanics of the technique.  This teaching style makes it very easy to adapt the techniques discussed in class to different scenarios.  The class sizes are small so there is a lot of individualized instruction.  My game has completely evolved since training there.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "103777319471303701820", "name": "Doug Smith", "time": 1461103279196, "rating": 5.0, "text": "Professor George is an experienced Jiu Jitsu black belt with  the heart of a teacher. Quite a bit of individualized instruction even in group class setting. Everyone is welcomed, and very diversified classes with different sexes, conditioning and experience allows everyone to learn at their own pace without intimidation. Professor George is the best I have trained with. The training facility is new and clean and the rates are very affordable.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "111666963606185507472", "name": "Ben Jackson", "time": 1461116951483, "rating": 5.0, "text": "George is hands down the best BJJ instructor around. His teaching style is straightforward and easily understood. All of the people at the gym are extremely welcoming and helpful.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "107397303564790513887", "name": "Josh Taylor", "time": 1539918537180, "rating": 5.0, "text": "George Wehby is one of the best in his craft of Jiu Jitsu! The lessons of character and discipline he has instilled in my son are priceless!!!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "104054365753629255678", "name": "Kuni Scissum", "time": 1524690242300, "rating": 5.0, "text": "George Wehby is a great instructor with a wealth of knowledge in BJJ, and trains a great group of people that I've been fortunate enough to meet and roll with. Every day I walk in is a challenge to myself to learn, to train hard, and to look for ways to improve. Lion Heart Academy is the place to go to if you want to develop in Jiu-Jitsu and as person overall.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "117189871459397081732", "name": "Judy Gibb", "time": 1549076919863, "rating": 5.0, "text": "Don't know all that I should know about this faculty trying to get more info", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "105637432171083816712", "name": "Jennifer Kersh", "time": 1461419833612, "rating": 5.0, "text": "As a 40 year old woman who is not and has never been an athlete or sporty or even graceful, I am astonished at how much I enjoy learning a martial art, and specifically, training at the Lion Heart Academy.  I have never done anything like this in my life, even as a child, so it took me years to get up the courage to give this a try and now I sincerely regret not having embarked on this journey much earlier in my life.  Coach George has created an inviting atmosphere of learning, where being open, friendly and respectful is the norm.  He is an extremely good teacher who knows his stuff which is important to me - if I am going to invest in myself and invest in a new skill, I want to learn it correctly and trust that my teacher knows what he is talking about.  There are many schools of BJJ out there and they are not all created equal.  BJJ is an excellent activity for women, I have learned tricks for defending myself against larger men, I am improving my coordination and core strength and I have met new friends.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "102286971270201316398", "name": "Dustin Gilbert", "time": 1461383665773, "rating": 5.0, "text": "George at the Lion Heart Academy has had a profound effect on the way that I view and practice BJJ (Brazilian Jiu Jitsu). He is a gifted instructor, breaking the subject matter down into ideas and principles, instead of trying to have his students memorize dozens of techniques like the steps to an overly elaborate dance. Great for over 40, out of shape guys like me to get back into shape and have fun doing it. You won't find better martial arts instruction in the Birmingham, Hoover, and Alabama area!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "116105036524558654876", "name": "William Boutwell", "time": 1462653282592, "rating": 5.0, "text": "Professor George Wehby is one of the most amazing instructors that I have met in my martial arts journey. His ability to understand and communicate the principles and concepts of Jiu Jitsu are unparalleled. If you are in the Birmingham area this is were you need to train. If you are not in the area make the drive. You will be glad you did.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "102139492260978477404", "name": "Keith Wilson", "time": 1471712444211, "rating": 5.0, "text": "Awesome guy!!! Awesome place!!!!!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "116559367471451282744", "name": "Des2BFit", "time": 1609184730797, "rating": 1.0, "text": "I’m curious the only reason I’m putting a one star currently is because they haven’t left any information of why the gym is currently close. They didn’t let me know in advance so I can stop my membership. I actually like this gym but I am wondering what is going on and why they haven’t open the gym back up ??? Anyone has an answer???", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "110359442575416599268", "name": "Copper Scales", "time": 1597283511484, "rating": 1.0, "text": "Its a decent gym. Havent had any issues with management and its always been decently clean. Fix the temperature/humidity problem and it'd be 5 stars.\n\nYou cannot however use this gym as they refuse to put in proper AC and insist on using sparsely placed floor fans instead. This just doesn't cut it in a climate where I've seen 80° in december, let alone when it hits 100° in the summer with crazy high humidity year round.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "107146267343704417896", "name": "janay chatmon", "time": 1581116094220, "rating": 5.0, "text": "This is by far my favorite gym in town and I've been to them all. Staff is amazing and the overall environment is very welcoming. I love the sauna and recently they have updated most of their equipment. Happy member of Team Alpha keep up the great work guys.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "100858329024656482856", "name": "Brian Rosenthal", "time": 1599302355774, "rating": 1.0, "text": "They just shut down ..no notice no nothing..stole all our money...owner is a theif. New owners good luck.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "101747042276580289806", "name": "Jeff Brunje", "time": 1581128059065, "rating": 5.0, "text": "My daughter is extremely competitive in BJJ,and was not getting what she needed at another gym she was at,so she tried it here and from day 1 knew it offered more than just \"a belt\".\nCoach Kevin has a ton drive,knowledge,and definitely instills that in his students.She is now a full time student,and we are 100% confident in her training.In 5 years and 3 gyms she has found a main.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "100393648342157946464", "name": "Mindy Joyner", "time": 1581125220195, "rating": 5.0, "text": "Very nice workout equipment  . Staff are very helpful and friendly. They also have a really wonderful daycare.  I would totally recommend this center for Adults and kids .", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "100970478733164781929", "name": "Windy Joyner", "time": 1564178368750, "rating": 5.0, "text": "This gym has come a long way and keeps getting better. Constantly upgrading equipment and lots of great classes and instructors. I love it.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "109865892688288038665", "name": "Tiffany Garcia", "time": 1580150549105, "rating": 5.0, "text": "I love this gym,everyone is so nice . Coaches /Trainers  are so helpful. I definitely recommend this gym!💪👊", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "105391230010579075673", "name": "Cassie Farr", "time": 1580157396941, "rating": 5.0, "text": "Great personal trainers, phenomenal jiujitsu/Muay Thai/ MMA classes with a great coach. Great atmosphere. There is something for everyone, from Zumba to kids classes.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "116945315932200629770", "name": "Jacob Katzev", "time": 1579790920374, "rating": 5.0, "text": "Great place to train MMA and Jiu-Jitsu or overall just getting in shape the equipment is great.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "112706179122574432503", "name": "Adam R", "time": 1580419336148, "rating": 5.0, "text": "My boys and I train Brazilian Jiu Jitsu and Muay Thai here and love it!", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "108014976049942312701", "name": "Darkseid", "time": 1580151213182, "rating": 4.0, "text": "Great place to get in shape with plenty of options. You have Jiu-Jitsu classes, Muay Thai, Boxing, Zumba and a daycare to watch your Rugrats to give you time to get in shape. Those are just a few that I know of off the top of my head. Can't beat the price with all of those options with a nice gym with a wide verity of machines and free weights to choose from. My only complaint is the bathrooms could be cleaner and restocked more other then that I'd put it at 5 stars! Love the place!", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "113422873707397894927", "name": "Ashley Floreno", "time": 1554733522751, "rating": 1.0, "text": "Tried to cancel my membership numerous times and was getting told different information by different employees. Nobody has a clue what’s going on. I got emails daily about failed attempts to pull my membership fee for about 2 weeks. Now got an email of confirmation of payments. Waiting for it to clear my account so I can go in and raise hell. Gym is trashy and childcare is horrible. Every time I went to pick up my kids the workers were on their phones, not paying attention to the kids.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "103593146501165672492", "name": "aresvp12", "time": 1580170036879, "rating": 5.0, "text": "Best jujitsu gym near Fort Rucker.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "109531297133644565095", "name": "Angela Murphy", "time": 1581131028323, "rating": 5.0, "text": "Very clean! Friendly, helpful staff and instructors that are very patient and kid friendly!", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "102303369794891890426", "name": "H Buckits", "time": 1524284469736, "rating": 5.0, "text": "Only been a member for a week and my experience has been nothing but positive. Gym is always clean and neat. Nice variety of equipment. Very helpful staff.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "114824098002534857621", "name": "Arrow", "time": 1540053805752, "rating": 1.0, "text": "The gym itself is a nice place to workout and there is a variety of machines you can use for workouts. The staff and management on the other hand is a joke. They simply do not care about solving a problem they caused and they will also lie to you about fixing it.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "105176938308316709662", "name": "Russell Shimunek", "time": 1531847987126, "rating": 2.0, "text": "I have been going here for nine years, since it was gold’s. This place has gone downhill under the new management. Not very clean, especially bathrooms. When they do clean the bathroom, it is during the day, so you have to pee and they have it closed. Out of the 8-10 treadmills, 2 no joke, 2 actually work properly. Rates just went up again. They are charging premium rates for a mid-level product.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "107050428153089775474", "name": "JINJOO BOK", "time": 1580160234447, "rating": 5.0, "text": "If you want to train bjj or mma, this place is for you.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "100957303082867877277", "name": "Brittany Mullins", "time": 1527303186701, "rating": 1.0, "text": "Worst gym around. I would not recommend this facility to anyone. Save your money and time.Management is a joke and staff is just as bad. Lying to  members about head lice in nursery and threatening employees jobs if they tell the truth. Taking the old employees out slowly and bringing in their \"Pack\". Please go anywhere but there. Planet Fitness is way cheaper and much better.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "110713584765491102042", "name": "Brian Lee", "time": 1533660320212, "rating": 1.0, "text": "The worst gym in enterprise and surrounding area.  People check your accounts they double charge you and will not refund your money.  They raise the membership and do not inform you.  Since it was gold gym and then enterprise fitness.  The gym has went down hill fast.  The staff has no clue on how a gym should be run.  Terrible place I would not recommend this place to anyone.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "109049855482520651589", "name": "C J", "time": 1545250626905, "rating": 5.0, "text": "-people that are leaving nasty comments were not the greatest of people to deal with.\nThe gym has come a long way and so much money has been put into bringing this place back to life. No one truly knows the behind the scenes events and how hard we try to accommodate to everyone’s needs. However, the previous management was awful. I will agree with that. Too busy with personal life and not enough focus on the gym. That has changed and it’s only up from here. We have brought back the 7 day FREE trial so come on in and get your own expierence to share with the community! Merry Chrismas y’all! 🎄🍭🖤", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "112750960389083063147", "name": "Sharonica Daniels", "time": 1528307249997, "rating": 1.0, "text": "Worst gym experience ever.  Manager was higher than a kite when checking me in.  Staff had no clue about what classes were being held and when.  Absolutely a waste of your money.  Go to Planet Fitness and save your time and money!", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "105199548889977785426", "name": "Taylor Morris", "time": 1531197412858, "rating": 1.0, "text": "Worst place to work. So unprofessional. Staff is rude and has no idea what they are talking about, doing or even selling. Staff leaves front desk unattended. Managers harass they're  subordinates as well as customers. The managers are spoiled children of the co-owners who are being given a huge freebie in life.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "107422274288448335996", "name": "RiShawn Foster", "time": 1581115891564, "rating": 5.0, "text": "Great place and friendly staff", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "115235219313479369346", "name": "Faith Dream", "time": 1533343048447, "rating": 5.0, "text": "Team Alpha has an amazing crew, amazing classes, and amazing equipment I couldn't imagine going to a different gym", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "111740439668843700625", "name": "Cam W", "time": 1573832777497, "rating": 5.0, "text": "New equipment and always open, only real gym in the area for lifting.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "103754309522934241593", "name": "Clemson Voorheis", "time": 1560176504465, "rating": 1.0, "text": "Place is disgusting. Canceled membership within a week", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "110802798257715892483", "name": "Kadeem Thomas", "time": 1517616644972, "rating": 5.0, "text": "its the best gym best boxing coaches best\nzumba classes clean gym", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "109141489926737291471", "name": "Ryan Su", "time": 1581198321070, "rating": 5.0, "text": "Friendly Staff", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "105684527510550823125", "name": "Hailey Johnson", "time": 1581104225206, "rating": 5.0, "text": "Wonderful place!!", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "108586406290824782624", "name": "Lisa Willis", "time": 1581225987349, "rating": 5.0, "text": "Love it here!!!", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "116461604116030590961", "name": "Katina Williams", "time": 1559494993792, "rating": 5.0, "text": "I really enjoy going!!!!!", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "103471594826900047824", "name": "Leonardo Pores", "time": 1575414003193, "rating": 3.0, "text": "(Translated by Google) Good!\n\n(Original)\nBoa!", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "117629489070557510185", "name": "John Venegoni", "time": 1620065683507, "rating": 5.0, "text": "This is a locally owned and operated gym. The staff is first class  and looks out for their members. You will quickly become family here and learn a great martial art/ self defense system. Great for parents and children.", "pics": null, "resp": {"time": 1620071179862, "text": "Thank you John.  We are glad to have you as part of the family."}, "gmap_id": "0x888917331a37e231:0xa902f7d3912cbbaf"}
{"user_id": "109002627605872854693", "name": "Logan Mays", "time": 1620782083410, "rating": 5.0, "text": "January 2019, I entered BJJ as a gift from my parents. Through my time here, I have acquired life changing confidence about myself and have met a lot of great people and formed friendships for many years to come. Coming to the gym each week is equally as fun as it is skill building for a sport I have come to love.", "pics": null, "resp": {"time": 1620835740746, "text": "Thank you Logan.  It has been our pleasure to see you grow into a strong young man.  Keep up the hard work."}, "gmap_id": "0x888917331a37e231:0xa902f7d3912cbbaf"}
{"user_id": "104338526234424549316", "name": "Mike Y", "time": 1619639717227, "rating": 5.0, "text": "Great place to train and get a good workout.  The instructors here really know what they are doing, and they provide a fun comfortable enviroment to learn.  I would highly suggest giving it a chance if you are interested!!!", "pics": null, "resp": {"time": 1619714426127, "text": "Thank you for the kind words."}, "gmap_id": "0x888917331a37e231:0xa902f7d3912cbbaf"}
{"user_id": "103425867996371641698", "name": "Tracy Thomas", "time": 1621085626367, "rating": 5.0, "text": "A welcoming, professional environment, a great program for kids!   They do a great job of making them work hard without them knowing they are working.  It’s a fun, controlled environment for them to learn Jiu Jitsu and discipline.", "pics": null, "resp": {"time": 1621288234907, "text": "Thank you so much! We are so glad to have you as part of our family here at GB Greystone. We look forward to all that the future has for you as you embark on your jiujitsu journey!"}, "gmap_id": "0x888917331a37e231:0xa902f7d3912cbbaf"}
{"user_id": "103691697707798342969", "name": "M R", "time": 1585760042189, "rating": 5.0, "text": "I cannot say enough good things about this gym. Everything about it is very positive; from the staff to the facility itself. The mats, bathrooms, changing rooms are very clean and I have no qualms about either me or my children rolling around. The staff is extremely friendly and knowledgeable without any egos or aloofness. My family and I felt welcomed from the moment we walked in. This gym is great for everyone. Got young kids? It's for you. Are you a woman worried about rolling with men? There are plenty of women there and they also hold women only nights. Are you older and out of shape? There are plenty of older folks and you can go at your own pace. Whether your goal is exercise, self-defence, or you just want to have fun, this gym is for you. I'd give it more than five stars if that was an option.", "pics": null, "resp": {"time": 1596661946320, "text": "Thank you so much! We really appreciate all of the kind words."}, "gmap_id": "0x888917331a37e231:0xa902f7d3912cbbaf"}
{"user_id": "109292297802257528581", "name": "sheridan park", "time": 1585932714669, "rating": 5.0, "text": "Great place for your whole family!! We are a family of four and our kids love the Professors and Coaches!! Very encouraging atmosphere! You just feel at home!! The support you receive from the staff and fellow practitioners is enough to make you never want to leave! Could not say enough great things about this place! Highly highly recommend!!!", "pics": null, "resp": {"time": 1596661544594, "text": "Thank you for your kind words Sheridan. It really means a lot to us. We are so happy to have you guys as a part of our gym family!"}, "gmap_id": "0x888917331a37e231:0xa902f7d3912cbbaf"}
{"user_id": "101841350797930196670", "name": "Zac Ronk", "time": 1585925966991, "rating": 5.0, "text": "Fantastic gym for BJJ of all levels. Quality professors who are flexible enough to teach at different speeds and understand your goals. Everyone is incredibly friendly, so expect to be welcomed by a lot of people. If you're considering it, do yourself a favor and come in.", "pics": null, "resp": {"time": 1596661585698, "text": "Thanks so much Zac! Keep up the good work!"}, "gmap_id": "0x888917331a37e231:0xa902f7d3912cbbaf"}
{"user_id": "111988928193504460330", "name": "charles hayden", "time": 1575987287452, "rating": 5.0, "text": "Joining Gracie Barra has changed my life. Way better than a gym membership. I’ve lost over 40 lbs and my wife loves the transformation, both physical and emotional. If you’re looking to get your life and health back I highly recommend.", "pics": null, "resp": {"time": 1581098854533, "text": "Thank you for the kind words and thank you for all of the medals you have won for Gracie Barra over the last year.  Keep it up.  With your work ethic you will go far."}, "gmap_id": "0x888917331a37e231:0xa902f7d3912cbbaf"}
{"user_id": "102044176271255214248", "name": "Jeremiah Davis", "time": 1585756988307, "rating": 5.0, "text": "I’ve tried different workout systems and big box gyms over the years but NOTHING compares to GBBJJ. The one on one coaching (or professoring?) is my favorite part and what makes Gracie Barra stand out for me. From the second you walk in the door it feels like a big family.  I came in with 0 experience but every class is structured with all skill levels in mind and not once have I felt intimidated or out of place.  I strongly urge anyone who is hesitant to just take one class, you’ll be hooked before it ends.", "pics": null, "resp": {"time": 1596662045478, "text": "Thank you Jeremiah!"}, "gmap_id": "0x888917331a37e231:0xa902f7d3912cbbaf"}
{"user_id": "108160040159543307433", "name": "Dennis Healy", "time": 1585885257374, "rating": 5.0, "text": "If you’ve ever wanted to study martial arts Gracie Barra is the place for you. Immaculately clean facility with a family atmosphere and top notch instruction.", "pics": null, "resp": {"time": 1596661877054, "text": "Thanks so much Dennis! We try our best to make our gym as welcoming as possible. However, it's the friendships and family that create the positive atmosphere we have today."}, "gmap_id": "0x888917331a37e231:0xa902f7d3912cbbaf"}
{"user_id": "104576237916318963605", "name": "Colby Dobbins", "time": 1596162241318, "rating": 5.0, "text": "Great staff! Great instruction! Great for kids and adults!", "pics": null, "resp": {"time": 1596576716191, "text": "Thank you for the kind words."}, "gmap_id": "0x888917331a37e231:0xa902f7d3912cbbaf"}
{"user_id": "103440721032829732219", "name": "Sam Riley", "time": 1579888611928, "rating": 5.0, "text": "This is one of the best places to teach your kids, or adults confidence, strength, and flexibility with Brazilian Jiu Jitsu. Professor Frank, Coach Juliana, and Coach Kim, among others, are some of the best leaders in the industry. You cannot go wrong with Gracie Barra Alabama and the Greystone location.  I highly recommend this group!", "pics": null, "resp": {"time": 1581098603844, "text": "Thank you Sam.  We are super proud of you for losing 23 lbs in your first two months.  I'm glad you finally took the leap and moved from watching your daughter train, to training with her.  We enjoy having both of you in class."}, "gmap_id": "0x888917331a37e231:0xa902f7d3912cbbaf"}
{"user_id": "107444251410372927805", "name": "Lisa Marie", "time": 1585756455775, "rating": 5.0, "text": "I LOVE my Gracie Barra Greystone  jiujitsu gym! I’ve learned so much from the focused attention. After a hard day, I know that training jiujitsu will relax me. We have more females training jiujitsu than ever before and women’s training class is filled with laughter and great training partners. Professor Frank and Coaches Kim and Juliana have built a family here at the gym and I’m thankful to be part of this growing crew!", "pics": null, "resp": {"time": 1596661464143, "text": "Thanks so much Lisa! You're doing a fantastic job, it's great to see how much you've progressed."}, "gmap_id": "0x888917331a37e231:0xa902f7d3912cbbaf"}
{"user_id": "103178900164268678950", "name": "Kirk Knudsen", "time": 1585755307930, "rating": 5.0, "text": "Very clean gym,  with a welcoming atmosphere,  very skilled and professional staff.", "pics": null, "resp": {"time": 1596661394836, "text": "Thank you so much! We are so glad you enjoyed our facility!"}, "gmap_id": "0x888917331a37e231:0xa902f7d3912cbbaf"}
{"user_id": "102785430556908149377", "name": "Void Boido", "time": 1572469406489, "rating": 5.0, "text": "Great place right now i'm doing a sample class but I already love it", "pics": null, "resp": {"time": 1596661333156, "text": "Great to hear! Thank you so much for the kind words."}, "gmap_id": "0x888917331a37e231:0xa902f7d3912cbbaf"}
{"user_id": "113301832737629340657", "name": "Brittany Satterfield", "time": 1485721216998, "rating": 5.0, "text": "My son had anger and confidence problems before I signed him up. He has been going for several months now and his confidence is better so he has started making friends and his anger is better controlled. The staff is friendly, professional and truly cares about their students. I love that my son is learning the skills to defend himself and that he is making friends at the same time. I would definitely  recommend Premiere to others!", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "108812738542797002001", "name": "Ernestine Adkins", "time": 1457647898396, "rating": 5.0, "text": "Great school! The instructors are awesome and my daughter loves it!", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "113447560659704317625", "name": "Ashley McGowan", "time": 1486239601905, "rating": 5.0, "text": "Just finished My first Womans self Defense class and Oh My Goodness...I learned alot and signing up..it's a bit of a drive for me but it is well worth it BC it will help save my life and my daughter's life!! Y'all get signed up and learn all that you can !!\n\nChloe had fun and learned alot herself, hoping to get her signed up for classes too!!\n\nThank you Michael Vick and Kelsie Mcgowan !!!", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "110514188316197063843", "name": "Jerry Chenault", "time": 1446938272993, "rating": 5.0, "text": "Highly skilled instructors and great, caring people who run a professional school where self-development is incorporated into every physical movement. The instructors are very skilled in tournament weapons and skills as well as those super important, reality-based, self defense skills through Krav Maga.  Master Vick is an experienced trainer in Krav Maga, and even conducts seminars at other schools.", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "112413977118004466142", "name": "Rikki Tha M'Fkn Tikki (LadyArtemiss)", "time": 1385096633710, "rating": 1.0, "text": "This is by far the worst martial arts school I have ever attended. I joined Premier in October 2012 with Oct-Dec free. I enrolled on the family plan with my 3 children. My children quickly became bored with the short 30 minute classes that they could only attend twice a week. The instructors were good with the kids, it was just the rushed format that was bad. By January only one was left attending. I wasn't any happier with the jujitsu, Krav Maga, or Muay Thai classes. All classes were only 30 minutes as well. This means practically no warm up, rushed instruction, and little to no time to practice technique or spar. To make it worse, because I had some experience in jujitsu ( my main area of interest when I joined) I was handed a book with the curriculum for the night and left to teach students who had attended Premier longer than me on several occasions. So not only was I losing my training time, I was left in an awkward situation. At this point I figured I would just deal with it and not renew my contract when the 6 months were up. In January the owner sold me on joining the Certified Instructor Training Program with promises of additional training outside of normal class times, seminars that would be paid for by my tuition, weekly CIT meetings, and eventually running my own school under the premier name. There were about 4-5 other adults that signed up for this as well. We changed my contract to reflect that my monthly payments would now go to paying the $10,000 tuition for this course. Between signing up in January till April there were only a total of 3 CIT meetings, far from the weekly meetings I was promised. There was no additional training offered. The seminars were all held in either Kentucky or Texas so to attend you had to drive there and get a hotel. That's not so bad I suppose, but then I was told that there would be an additional fee of several hundred dollars to attend. Also I would have to buy all the equipment required for the seminars (which had to be Premier brand). To purchase all of this equipment added approximately $400 (that's with the CIT discount). By March I had come to accept I had been suckered into a joining a McDojo and was now stuck in a contract. I was going to make the most of it. A month or so later the lead instructor came to teach class intoxicated. To the point he was slurring and falling asleep mid sentence while sitting up. After attending the jujitsu class he taught, several of us informed the owner of the instructors condition. He allowed him to continue teaching the remaining classes (Krav Maga and Muay Thai) while he sat in the back and watched. After this I told the instructor that I wanted to cancel my contract. I expressed all of my concerns and disappointments. He assured me that he was going to improve everything and make good on his promises. He asked me to give him another chance and a little time to get things the way they should be. 2 months later the only thing that had changed was that he fired the instructor that was intoxicatedd. There were only 2 CITs left, including me. Everyone else quit showing up. I informed the owner via E-mail, multiple voicemails, and Facebook messenger that I was dropping out. I listed all of the reasons and was very polite. I received no response. I also contacted the billing company, Member Solutions, as per my contract, to cancel. I explained my multiple reasons for wanting to cancel, and they informed me that I could not cancel. The new contract I signed for the CIT program was counted as a loan for $10,000 that I had to pay back before I could cancel. I attempted again, multiple times, to contact the owner about this issue and once again received no response. I am fortunate enough to have a lawyer as a friend to help me beat this scam. However, I would strongly recommend you stay away from this \"school\".\n\nSincerely,\nChris Allen", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "103136168224154012801", "name": "Destiny Fitch", "time": 1474313544775, "rating": 5.0, "text": "Great instructor", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "108082394769142241006", "name": "Kristina Adkins", "time": 1466777339442, "rating": 5.0, "text": "my sis loves it", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "107914370840418842944", "name": "Lori McGowan", "time": 1416521275121, "rating": 5.0, "text": "Great Kids and adult classes!!!", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
