{"user_id": "108782993988311473415", "name": "Syd & Tay's Adventures", "time": 1537390001455, "rating": 5.0, "text": "Fantastic teacher. Best decision we ever made to put our daughter into Renchin Fredrick's class in 3rd grade when she struggled with self esteem and bullies. Now 2.5yrs later she is a 1st degree black belt! He is a great teacher for kids with all sorts of background. Many adults take classes too. You won't find a better deal for the opportunity for classes 5 days a week.", "pics": null, "resp": null, "gmap_id": "0x88892954c4879483:0x87a4c4f5ba82e47a"}
{"user_id": "104309180490881426361", "name": "futurewizard 97", "time": 1550533874934, "rating": 5.0, "text": "I am a student there and it is really awesome. Remember dont eat the yellow snow.", "pics": null, "resp": null, "gmap_id": "0x88892954c4879483:0x87a4c4f5ba82e47a"}
{"user_id": "115206098817311142948", "name": "yvie nicholson", "time": 1611421744654, "rating": 5.0, "text": "Kids have been taking classes since 2015 with Mr Charles. It has been a great experience for them!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPlufNNfJSzSrwZcYfAVEqIv_I5IvbGSRiVGQ9m=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOIXRTpACFUoU7qP9Du4KfPjS3pueQU-5ExYemD=w150-h150-k-no-p"]}], "resp": {"time": 1611422477048, "text": "Thank you so much!  We are so honored to have your family at JMK!  I have seen so much growth in them and I’m very proud of them!"}, "gmap_id": "0x88882af3ccd589c9:0x620c4bcece82c1a3"}
{"user_id": "113820316081682825877", "name": "Jim Routon", "time": 1616024734001, "rating": 5.0, "text": "5AM fight fitness is just what the Dr ordered! Instructor lead....No weights ....great workout....super organized.....work your own pace...safe for all ages and genders...\n....achievable goals.....great results....get out what you put in......", "pics": null, "resp": {"time": 1621952850029, "text": "Thank you so much for the kind review!  We appreciate you very much.  You do a great job!"}, "gmap_id": "0x88882af3ccd589c9:0x620c4bcece82c1a3"}
{"user_id": "113869759988134890875", "name": "Marlee Owens", "time": 1615806517981, "rating": 5.0, "text": "Great class. I do karate, and the 5 am Fight Fitness Class. Great for all ages, definitely recommend JMK:)", "pics": null, "resp": {"time": 1615808302371, "text": "Thank you for the kind review!"}, "gmap_id": "0x88882af3ccd589c9:0x620c4bcece82c1a3"}
{"user_id": "101013710241904151035", "name": "vols _ume", "time": 1583637042651, "rating": 5.0, "text": "I signed up for an 8-week bootcamp with fight-fitness workouts. The instruction was motivating and easy to follow. I have increased my endurance and gained new skills. JMK is always a clean, family environment. I look forward to more classes! My kids also loved the ninja camps last summer.", "pics": null, "resp": {"time": 1583716528525, "text": "Awesome!  Thank you so much for the kind review!  We are so glad you’ve enjoyed the courses!"}, "gmap_id": "0x88882af3ccd589c9:0x620c4bcece82c1a3"}
{"user_id": "110781739765466246813", "name": "Lexy Langston", "time": 1584215341580, "rating": 5.0, "text": "I have attended the Defensive Handgun Training twice now and I thoroughly enjoyed every minute! The first time I was scared to death and had shot a pistol one time in my life. The course is very beginner friendly and will help you learn the basics, be more confident with your pistol, as well as challenge you with different drills if you are already comfortable with your gun. I highly recommend!", "pics": null, "resp": {"time": 1584224198909, "text": "Thank you so much!  We are so glad you enjoy the courses!"}, "gmap_id": "0x88882af3ccd589c9:0x620c4bcece82c1a3"}
{"user_id": "107301857782209154039", "name": "Kim Robertson", "time": 1582949445490, "rating": 5.0, "text": "I took part in a self defense class for women taught by Charles Owens. The class was very informative and hands on. I definitely recommend it and plan to attend additional classes for more training!", "pics": null, "resp": {"time": 1582981931292, "text": "Thank you!  You all did a wonderful job and I appreciate the feedback!"}, "gmap_id": "0x88882af3ccd589c9:0x620c4bcece82c1a3"}
{"user_id": "111137677177400259118", "name": "JC Isme", "time": 1584216454081, "rating": 5.0, "text": "I am 52 and having been shooting a pistol since I was 18. Today I attended my first Shooting class ever. The Defense Shooting class that JMK offers is very good. I learned a lot and  this class taught me how to improve on my skills", "pics": null, "resp": {"time": 1584224237418, "text": "Thank you so much!  We are so glad you enjoyed the course!"}, "gmap_id": "0x88882af3ccd589c9:0x620c4bcece82c1a3"}
{"user_id": "105919671213268384597", "name": "Richie Nagel", "time": 1583765457973, "rating": 5.0, "text": "The 5am Fight Fitness Boot Camp has been awesome! I'll definitely sign up for the next round.", "pics": null, "resp": {"time": 1583875515540, "text": "Thank you!  Can’t wait for the next one!"}, "gmap_id": "0x88882af3ccd589c9:0x620c4bcece82c1a3"}
{"user_id": "115809091727709961086", "name": "Kasey Badger", "time": 1561249755122, "rating": 5.0, "text": "I have taken Krav Maga here and really enjoyed it! The prices are fair and the training is top notch. It’s a great workout and I would definitely recommend!", "pics": null, "resp": {"time": 1561251054652, "text": "Thank you so much!  We are so glad you enjoy the courses!"}, "gmap_id": "0x88882af3ccd589c9:0x620c4bcece82c1a3"}
{"user_id": "115626069669466784433", "name": "Daniel Crowe", "time": 1528558746482, "rating": 5.0, "text": "Awesome instructor and Christ centered! Great for kids and adults of all ages! Plus Krav Maga", "pics": null, "resp": {"time": 1528821530102, "text": "Thank you so much for the kind review Daniel!  We are very glad you enjoy the classes!"}, "gmap_id": "0x88882af3ccd589c9:0x620c4bcece82c1a3"}
{"user_id": "118421753765425023233", "name": "Katie Hall", "time": 1528557945485, "rating": 5.0, "text": "Excellent class selection, great prices that cannot be beat ! They have an awesome summer schedule that cater to all age groups (3y-adult). My husband and I did the Kickboxing and probably the best workout ive had since highschool sports!! Also learned so many useful defense tactics!! Super friendly christian people I love they incorporate God into their business!", "pics": null, "resp": {"time": 1528821479079, "text": "Thank you so much for the kind review Katie!  We are so glad you've enjoyed the classes and the workout!"}, "gmap_id": "0x88882af3ccd589c9:0x620c4bcece82c1a3"}
{"user_id": "108107332347284709042", "name": "Isaiah Johnson", "time": 1528557970625, "rating": 5.0, "text": "Really helps with self defense and other techniques and very friendly", "pics": null, "resp": {"time": 1528821564711, "text": "Thank you very much for the kind review Isaiah.  You're doing great!  Keep it up!"}, "gmap_id": "0x88882af3ccd589c9:0x620c4bcece82c1a3"}
{"user_id": "103806851345709793444", "name": "Tony Carleton", "time": 1611851214103, "rating": 5.0, "text": "If you are close to Cullman Al this is the place to train.  Daniel will not only challenge you he will teach you to become the best practitioner you want to become.  He travels and teaches seminars across the county.  Great Instructor/Shihan/Sandan and runs a professional school. *****", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "117642242968361388982", "name": "Kyna Sterling", "time": 1508979176867, "rating": 5.0, "text": "My girls have been training here for a few years. The Sensei's are knowledgeable and sincere. They have created a family that you'd want to be a part of.  I've watched my girls' become more disciplined, excited about learning new techniques, and their confidence has grown.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPP8vCjjkL1Ht206-8i8LmXMVCqfYXcYhYOajr5=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "112762590676449094971", "name": "Trip Kirby", "time": 1513388634111, "rating": 5.0, "text": "An awesome gym to learn martial arts.  Highly recommended.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMk6d2XDWVrck775u6xxm4TGnHMjE4ekaWdmZ1B=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "115087903054384611166", "name": "Clay Malone", "time": 1547576774540, "rating": 5.0, "text": "This is definitely the best Martial arts school in the area. It is run by high level and knowledgeable instructors who always seem to take time out of their day to help and answer questions even outside of class time. From the instructors to the students, it is a friendly and safe training environment. I  have been training at Triad for 14 years and I have no complaints. The school has helped me grow not just by teaching me karate, but also by teaching self discipline and respect. I would recommend this school to anyone, children and adults!", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "110836414028038495505", "name": "Ryan Newman", "time": 1547581415188, "rating": 5.0, "text": "I trained here for over a year, and I can’t speak highly enough about this group. Instructors are very knowledgeable and the atmosphere is welcoming, even if you’ve never studied martial arts. It’s important to train somewhere you will progress and learn, but it’s just as important to enjoy the process and the people you train with day in and day out. I trained at the Madison location several times a week, and was always looking forward til the next time. Environment was very easy going and everyone was always willing to teach share info, new techniques, and answer my seemingly endless amount of questions. If I hadn’t moved away, I would still be rolling with this crew. Miss you guys!", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "116152850948805601556", "name": "Madison Clapp", "time": 1547942169134, "rating": 5.0, "text": "This best place to learn martial arts and self defense! I have trained at trained at Triad for three years going on four and I couldn't be happier! I started training just to learn self defense and I got so much more, I gained so much confidence in myself not just in defending myself but in everything. Everyone at Triad Martial Arts are always respectful, kind and very supportive and are like a second family to me! I would recommend them to anyone!!", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "117576647325055707835", "name": "Seth Nugent", "time": 1546356471043, "rating": 5.0, "text": "I highly recommend! All the instructors are extremely knowledgeable and they go above and beyond to help if you don't understand.  I've been training here 4 months and have seen a great deal of improvement in fitness and my understanding of martial arts. They also offer quite a few classes so you can train multiple times a week.", "pics": null, "resp": {"time": 1547574896516, "text": "Glad to have you here Seth! You're a great addition to the team!"}, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "117566300244063024262", "name": "K Yarbrough", "time": 1547590629774, "rating": 5.0, "text": "Both of my daughters trained at Triad.  I cannot say enough about the training they received.  I feel that they both left the school (for college) prepared and able to defend themselves if necessary.  The curriculum developed by Johnny Lee Smith is second to none.  I will always send students to Triad.  Sensei Danny has been so good to my family and we really love this school", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "104539179201859638095", "name": "maiko beeson", "time": 1547579744636, "rating": 5.0, "text": "They have high quality and detail oriented adults and kids classes. Kids programs allow a child to acquire the skills of not only how to protect themselves, but also how to be respectful to others. Training here is one of the best decisions I’ve made.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "109869679939005542865", "name": "Andrew Z.", "time": 1513207192199, "rating": 5.0, "text": "A fantastic place to learn the martial arts. You not only gain knowledge of the arts themselves, but strength and discipline as well. The environment is extremely welcoming and everyone will help you succeed. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "114159614683055438421", "name": "Faith Nugent", "time": 1549499527894, "rating": 5.0, "text": "My husband trains here 3-4 times a week and comes home with so much excitement (and sweat). He's always wanted to get into martial arts and I am so happy to see him exploring something he's really passionate about.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "104157028964801969004", "name": "Jessica Martin", "time": 1490614494060, "rating": 5.0, "text": "I can't say enough about how great Triad is. I had my son's birthday party here. Daniel and the entire staff is exceptional. They had great activities planned and lots of patience for this young age group. We also had our cake made through them and it was fantastic and beautiful! One stop shop for the best party!! After having the party, we are definitely enrolling our son in Triad. If you're considering Martial Arts for your kids or yourself, please check them out first! You won't be disappointed. The facility is huge and really seems to offer alot. Great experience.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "114917354331544039919", "name": "Matt Bynum", "time": 1578967844383, "rating": 5.0, "text": "I signed up for a free class. The folks there were extremely welcoming!", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "111252892361307983882", "name": "Deafening Silence", "time": 1510442816630, "rating": 5.0, "text": "I have been a part of the Triad family for the majority of my life. For 11 years I have trained and taught at Triad, learning about responsibility, leadership, loyalty, and the importance of a positive role model other than one's parents in shaping the character of the individual. My instructors have shaped who I am for the better and the family atmosphere at Triad extends beyond the bounds of the dojo. If you train here, you will have people who will support you and care about your development, inside and outside of class.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "100105157771675406553", "name": "John Alred", "time": 1547606939119, "rating": 5.0, "text": "I have trained there a few times traveling in out of the area.  They are a well organized group of professionals who take their craft very serious.  They make you feel welcomed and accommodating to whatever skill level you are at.  I have had nothing but the highest respect for the dojo and it’s staff.  Very well respected in the Dallas Texas area and spoke of highly by the Machado’s!  Hit them up if you are in the Alabama area for the best training you can get.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "107827901105616942664", "name": "Michael Borden", "time": 1547575365805, "rating": 5.0, "text": "Wonderful gym with a great family atmosphere.   I have trained at several gyms around the southeast over the past 29 years and Triad is on the best I have ever been involved with.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "113625723869816514699", "name": "John O'Brien", "time": 1547578370708, "rating": 5.0, "text": "Sensei Danny and the other instructors are world-class martial artists and even better people. Home away from home and the best in the area, hands down.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "114123841112986002256", "name": "Alan Hunt", "time": 1547591864286, "rating": 5.0, "text": "I have trained Jiu Jitsu at Triad for 3 1/2 years now. When I started I had zero background in grappling or wrestling. I got lots of mat time and even though I was submitted more times than I could ever hope to count, I never felt in danger or got injured. Every instructor and training partner I've ever grappled with at Triad has an amazing attitude. They are looking to make you better as they better themselves.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "110245680004955120856", "name": "Zack Henry", "time": 1355129348294, "rating": 5.0, "text": "This place is amazing. Most knowledgeable staff in the state, and they are wonderful people as well! Triad really has a welcoming environment and the people there support each other like a family. If you are considering martial arts for you or your children do yourself a favor and give Triad a shot.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "114784049229163176373", "name": "William Terkeurst", "time": 1490709734092, "rating": 5.0, "text": "My daughter has been training with Triad Martial Arts for 5 years now. We love the family atmosphere and the quality instruction. My daughter loves this place and looks forward to each class.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "109363863906108947308", "name": "Cooper Lawrence", "time": 1506552850802, "rating": 5.0, "text": "I've been training at Triad for over half my life. It's not just some martial arts school where they hand out belt everything is earned. And it's more than just a group of people it is a family.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "104820139102751920153", "name": "Erin Kramer", "time": 1547587318267, "rating": 5.0, "text": "Wonderful family atmosphere with knowledgeable and respectful instructors and training partners who always go above and beyond to help each other grow as martial artists.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "111082809827370284127", "name": "Carlile McCoy", "time": 1355148505397, "rating": 5.0, "text": "This is the best dojo in Madison.  They are family oriented.  Danny and the other instructors teach disciplined and respect of others in addition to martial arts.  Once you join you become part of the Triad family.  The staff is also wonderful in keeping the facility clean well organized.  It is also a very large facility so there is plenty of room for classes.  We love this dojo!", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "102578683668322820844", "name": "Chris Kramer", "time": 1547582910026, "rating": 5.0, "text": "Amazing crew of instructors and training partners.  Respect, discipline and safety are always priority.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "108443733504982758610", "name": "John Rogers", "time": 1547831412116, "rating": 1.0, "text": "Abosultely terrible this place.  I have been in dojos all around the world.  I have competed in cage matches, in tournaments.  I have my own dojo in California and I am telling you right now, this place is absolutely awful.  As soon as I went in I knew I was in for a ride.  The place is so boring.  There are no workout instruments or anything.  The only thing there is a broken, anticuated workout room upstairs.  The lessons ae horrible.  I have seen many of these techniques and trust me, these do not work.  Avoid this place.  I have already told all my friends and family to not go here.  I have many students who spread the word of this place.  If you're wise you will choose another place.", "pics": null, "resp": {"time": 1547832319332, "text": "Hi John,\nI'm sorry you did not like the facility. I don't recall you coming in not do I have your name on any release but I could be making a mistake. I will stand by our training as we have professional fighters from our school as well as people competing in and winning at the highest levels of JiuJitsu. I hate that you didn't enjoy the training though. Where is your dojo in California at? I'm out that way often and am always looking to learn new technique! Thanks for your review!"}, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "102934861959970554103", "name": "Manilla Gorilla", "time": 1501698801833, "rating": 5.0, "text": "A very traditional approach to martial arts, with respectful staff, I am so glad I came across this dojo.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "117021142286141185731", "name": "Marcus Kirby", "time": 1513388672511, "rating": 5.0, "text": "Excellent Martial Arts school. I highly recommend Danny!", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "104902705755016840241", "name": "Elizabeth Peltola", "time": 1547580963264, "rating": 5.0, "text": "Best martial arts place around!", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "111652741340334319750", "name": "kellie kirby", "time": 1355172046646, "rating": 5.0, "text": "My son has been taking karate with Triad for about 2 1/2 years and he looks forward to classes each week. His skills have improved along with his respect, control and dedication to a goal. In addition to the regular karate and jiu-jitsu, he is motivated to earn the money to pay for monthly private lessons. Sensei Danny has been an outstanding role model for my 11 year old.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "110284834471676637274", "name": "Joe Parrish", "time": 1547588974833, "rating": 5.0, "text": "Awesome instructors and training partners!", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "109648389146014581505", "name": "Eric Meckl", "time": 1343236421645, "rating": 5.0, "text": "Triad Martial Arts is the school of Johnny Lee Smith. Triad features traditional karate, kobudo, Brazilian jiu-jitsu, Equalizer women's self defense, and a Vale Tudo program ideal for those interested in mixed martial arts competition.\n\nI began training at Triad in May, 2010. At the time, I was 33 years old, obese, suffering from high blood pressure, and badly out of shape. Training in their BJJ program has helped me to lose over 40lbs, and at age 36 I am now in better health than I was at 26. They have a great family atmosphere, ego-free training environment, and truly world class instruction.\n\nIf you have any interest in learning martial arts in northern Alabama, this is the place to be. Largest martial arts facility in the state. Highest ranked BJJ black belt in the state. Most BJJ black belts of any dojo in the state. Only Pan Am champion in state history. Vale Tudo program has already produced MMA pros Daniel O'Brien, Stephen Wilhite, and Matt Ward with more on the way.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "111399543972801352719", "name": "Alan wilson", "time": 1434025464880, "rating": 1.0, "text": "I do not and will not support Mr. Smith because he wrongfully supports Officer Parker.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "117825125475423350760", "name": "Dan Griffiths", "time": 1495492727501, "rating": 1.0, "text": "This gym lacks respect... Find a different gym to train at.", "pics": null, "resp": null, "gmap_id": "0x886267e51630ca11:0x8a47ecef971b0170"}
{"user_id": "111332906279131039006", "name": "Gina Daniel", "time": 1628037224694, "rating": 5.0, "text": "Gracie my instructor is knowledgeable and awesome!!  Facility is very nice! I enjoy very much taking classes here.", "pics": null, "resp": {"time": 1628038051859, "text": "Thank you, Gina! We enjoy working with you and are glad you're enjoying your training. Keep up the hard work!"}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "107997324537257648177", "name": "Laura Rivers", "time": 1604869005730, "rating": 5.0, "text": "I am ecstatic for the opening of this local Madison “gem”! Gracie and Isaac truly go above and beyond. They are both, very knowledgeable and very passionate about the self-defense style that they teach.\n\nIf you are expecting this to be a “wax on, wax off” type of karate, think again! The personalized lesson was practical and relatable without having to paint a fence. And a HUGE bonus, both instructors are patient and encouraging! It’s absolutely all you could ask for in when it comes to learning self-defense!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO_L8ri0cRA5trF_XDCrkVmQcHPnfsdZd0fjH5g=w150-h150-k-no-p"]}], "resp": {"time": 1604869727698, "text": "Thank you Laura! We enjoy having you in the studio and know you'll do great things."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "103047355424581508878", "name": "Bart Roegner", "time": 1626136203327, "rating": 5.0, "text": "Isaac is an excellent teacher. He approaches teaching martial arts with patience and dedication. I highly recommend trying Kenpo with MadCity.", "pics": null, "resp": {"time": 1626139160695, "text": "Thanks, Bart! We really enjoy teaching you and appreciate your dedication."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "107529617076208577491", "name": "Matthew Eady", "time": 1604596816606, "rating": 5.0, "text": "An amazing school that teaches a very effective system of self-defense.  Patient, caring instructors who take time to pay the necessary attention to each individual student.  Great for people of all ages and all levels of physical fitness.  I could not recommend a better Kenpo in the North Alabama area.", "pics": null, "resp": {"time": 1604601015859, "text": "Thanks, Matt! We really enjoy teaching you and love getting to share our art with this area."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "110646145441436298162", "name": "Randall Rivers", "time": 1601309518840, "rating": 5.0, "text": "Great experience.  I wanted personal training, not a big group.  They offer several different options so you can find the one that works for you.  Good central location, nice facility and friendly, experienced trainers. I really like their focus on practical self-defense.", "pics": null, "resp": {"time": 1601310257812, "text": "Thanks, Randall! We think you'll excel quickly in our private program. We can't wait to see your progress."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "113963061688585154564", "name": "Christopher Weaver", "time": 1615331608713, "rating": 5.0, "text": "Amazing place! The instructors are friendly and very detailed in what they reach you.", "pics": null, "resp": {"time": 1615334204302, "text": "Thanks Christopher! We're glad you're enjoying your training so far - we appreciate all the hard work you put in."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "114157347272356245455", "name": "Farida Rennie", "time": 1602706889412, "rating": 5.0, "text": "I just took my first self defense lesson and I absolutely loved it. I felt that the lesson was not only fun but also practical. I was able to get a good workout while leaving with skills and improving my balance. I've already signed up for my next session!", "pics": null, "resp": {"time": 1602708043656, "text": "Thanks, Farida!! We appreciate your desire to learn and can not wait to see your growth in Kenpo."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "117966643045464477767", "name": "George Green", "time": 1609280661091, "rating": 5.0, "text": "I came over from England, and asked to join a session and absolutely loved the place. It has a fantastic atmosphere, lovely people, and has a warm family environment. Professor George, is friendly, and articulates drills & movements very well. I felt extremely welcome! unfortunately I was only able to train a month, and was incredibly sad to stop!\n\nI plan to return as soon as possible, it is a fantastic place.", "pics": null, "resp": {"time": 1609393275438, "text": "Looking forward to your return George!!!\n\nSee you soon!!!"}, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "108181608335289813046", "name": "John Willis", "time": 1602039553101, "rating": 5.0, "text": "This place has literally helped me change my life for the good. Mind body and soul are all worked on here. The Professor, George Wehby, is very skilled and knowledgeable and has helped guide me on the way to becoming the best version of myself!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "104290684489297892170", "name": "Maria Gilbert", "time": 1469309402597, "rating": 5.0, "text": "Had a fantastic birthday party for Jack at Lionheart today. All the kids were engaged, busy, and loved the obstacle course. Thank you George, Dustin and J.D. for making this a fun event for everyone!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNqfM4eRr2I6UGg5PxG0rkxXIfS6ZY8FRZ5fHYm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOwj4VkFix1-88HCQzZF8WdPUiz_6L845TEublU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "106020725954275620872", "name": "John McLemore", "time": 1596902738190, "rating": 5.0, "text": "I've been a member of Lionheart for around 2 years now, and I can't say enough good about it. I've been around combat sports and martial arts for some time now, and Professor Wehby is by far the most superior instructor that I have had the pleasure of learning from.\nThe atmosphere that's been created at this academy allows beginners to learn without feeling uncomfortable while also pushing the  more advanced students to improve.\nAwesome place.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "117854971485866066388", "name": "Aaron Travis", "time": 1595691757677, "rating": 5.0, "text": "Great place with a great atmosphere.  George is truly passionate about the art and takes a principle approach to teaching.  Perfect environment for the beginner or advanced student.  Become a part of the Lion Heart family!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "101886573294471056100", "name": "Matthew Denaburg", "time": 1602184167616, "rating": 5.0, "text": "This school provides the perfect blend of a fun, welcoming environment and quality instruction. I have trained in eight different styles at various locations over the past 21 years, and Professor Wehby is by far the most accommodating instructor I have ever had the pleasure of training under. Whether you’re an experienced grappler, a striker who struggles with grappling (like me), or new to martial arts all together, this is the place to be. I truly can’t speak highly enough of Professor Wehby and his academy.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "103178900164268678950", "name": "Kirk Knudsen", "time": 1595429610209, "rating": 5.0, "text": "Great family atmosphere, wonderful place to train.  Instructors teach the Jujitsu concepts like no where else I’ve been.  I’d give it ten stars if I could.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "112385525376590742634", "name": "jeremy giadrosich", "time": 1595456777738, "rating": 5.0, "text": "I am a new student and can't say enough good things about both the instructor(George Wehby) or the people/enviroment at this school. George and the class have welcomed me open arms and made my first uncomfortable classes of not knowing anyone both inviting and accepted. I look forward to every class I attend not for just the teaching but also the camaraderie.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "105942575142355293612", "name": "Randall Phillips", "time": 1595386572814, "rating": 5.0, "text": "George Wehby is a true jiu jitsu gentleman. I have had him down to my school in Auburn to teach a seminar and every student loved having him. He teaches  jiu jitsu concepts that have lasting impressions on students. His character and professionalism in the jiu jitsu community is unrivaled.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "100534784673471152872", "name": "MrRshirley4", "time": 1598234178412, "rating": 5.0, "text": "Good instruction in jiu jitsu and in our spiritual life also.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "102724745932866278002", "name": "chris elms", "time": 1566666156791, "rating": 5.0, "text": "Every single person there was very friendly and welcoming. They all came up, introduced themselves, shook my hand unprompted.\nGreat place to train.\nThey even had a blue belt that looked exactly like Brad Pitt with a beard named david.", "pics": null, "resp": {"time": 1566667684792, "text": "😂 @ Brad Pitt look alike\n\nGlad you had a great time.\nSorry I missed training with you."}, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "117233433322048451922", "name": "Jody V", "time": 1478751059651, "rating": 5.0, "text": "I walked into this gym to just check it out 1 day. I have no prior experience with any martial arts. I like the way George broke every move down step by step & explained why it was done this way. He makes sure all levels of experience are understanding each move. Great place. Very friendly environment from the time I walked through the door. Students & instructor are great. I've been to a few class now & can't wait to go to the next.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "112025566894159895513", "name": "Nathan Fisher", "time": 1565478915233, "rating": 5.0, "text": "My son and I have both been training under Professor Wehby for about 9 months. Not only have we improved our fitness, but BJJ challenges each of us every session. This allows us to grow together as we each walk our walk in the gym. The instruction is top notch and the culture of the gym is very welcoming and accepting. Please come out and join us!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "106845757624994192712", "name": "Patrick Norman", "time": 1461040218589, "rating": 5.0, "text": "Hands down the best thing I've ever done for myself! George is a fantastic teacher and really knows how to help you as an individual. Most fun thing you can do to lose weight and learn a skill. It has helped change my life and it can definitely do the same for you!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "112531383566222456489", "name": "Eddy Parsons", "time": 1468437336989, "rating": 5.0, "text": "My daughter and I trained with Coach George for about a year. We both really enjoyed it and I feel like he helped advance the skill level of both of us. I hope to be able to train with him more in the future.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "102939123891104856574", "name": "Austin Dobbs", "time": 1511931421224, "rating": 5.0, "text": "Going to Lionheart Academy is one of the best decisions I've made. Really good atmosphere, and a great coach! Its definitely worth looking into.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "105073071856461247977", "name": "Howard Kersh", "time": 1461278007788, "rating": 5.0, "text": "The Lion Heart Academy has a very welcoming atmosphere and the majority of the students are working professionals.  There is a good mix of male and female students as well as ages and experience levels. I am 42 years old and I am not the oldest or the youngest. The instructor (George) is one of the best BJJ teachers that I have ever trained with.  I travel all over the country for work so I say this having had the opportunity to train at many well-known BJJ schools.  The big difference with George is that he spends a lot of time covering the body mechanics of the technique.  This teaching style makes it very easy to adapt the techniques discussed in class to different scenarios.  The class sizes are small so there is a lot of individualized instruction.  My game has completely evolved since training there.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "103777319471303701820", "name": "Doug Smith", "time": 1461103279196, "rating": 5.0, "text": "Professor George is an experienced Jiu Jitsu black belt with  the heart of a teacher. Quite a bit of individualized instruction even in group class setting. Everyone is welcomed, and very diversified classes with different sexes, conditioning and experience allows everyone to learn at their own pace without intimidation. Professor George is the best I have trained with. The training facility is new and clean and the rates are very affordable.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "111666963606185507472", "name": "Ben Jackson", "time": 1461116951483, "rating": 5.0, "text": "George is hands down the best BJJ instructor around. His teaching style is straightforward and easily understood. All of the people at the gym are extremely welcoming and helpful.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "107397303564790513887", "name": "Josh Taylor", "time": 1539918537180, "rating": 5.0, "text": "George Wehby is one of the best in his craft of Jiu Jitsu! The lessons of character and discipline he has instilled in my son are priceless!!!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "104054365753629255678", "name": "Kuni Scissum", "time": 1524690242300, "rating": 5.0, "text": "George Wehby is a great instructor with a wealth of knowledge in BJJ, and trains a great group of people that I've been fortunate enough to meet and roll with. Every day I walk in is a challenge to myself to learn, to train hard, and to look for ways to improve. Lion Heart Academy is the place to go to if you want to develop in Jiu-Jitsu and as person overall.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "117189871459397081732", "name": "Judy Gibb", "time": 1549076919863, "rating": 5.0, "text": "Don't know all that I should know about this faculty trying to get more info", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "105637432171083816712", "name": "Jennifer Kersh", "time": 1461419833612, "rating": 5.0, "text": "As a 40 year old woman who is not and has never been an athlete or sporty or even graceful, I am astonished at how much I enjoy learning a martial art, and specifically, training at the Lion Heart Academy.  I have never done anything like this in my life, even as a child, so it took me years to get up the courage to give this a try and now I sincerely regret not having embarked on this journey much earlier in my life.  Coach George has created an inviting atmosphere of learning, where being open, friendly and respectful is the norm.  He is an extremely good teacher who knows his stuff which is important to me - if I am going to invest in myself and invest in a new skill, I want to learn it correctly and trust that my teacher knows what he is talking about.  There are many schools of BJJ out there and they are not all created equal.  BJJ is an excellent activity for women, I have learned tricks for defending myself against larger men, I am improving my coordination and core strength and I have met new friends.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "102286971270201316398", "name": "Dustin Gilbert", "time": 1461383665773, "rating": 5.0, "text": "George at the Lion Heart Academy has had a profound effect on the way that I view and practice BJJ (Brazilian Jiu Jitsu). He is a gifted instructor, breaking the subject matter down into ideas and principles, instead of trying to have his students memorize dozens of techniques like the steps to an overly elaborate dance. Great for over 40, out of shape guys like me to get back into shape and have fun doing it. You won't find better martial arts instruction in the Birmingham, Hoover, and Alabama area!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "116105036524558654876", "name": "William Boutwell", "time": 1462653282592, "rating": 5.0, "text": "Professor George Wehby is one of the most amazing instructors that I have met in my martial arts journey. His ability to understand and communicate the principles and concepts of Jiu Jitsu are unparalleled. If you are in the Birmingham area this is were you need to train. If you are not in the area make the drive. You will be glad you did.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "102139492260978477404", "name": "Keith Wilson", "time": 1471712444211, "rating": 5.0, "text": "Awesome guy!!! Awesome place!!!!!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "104552545058395716550", "name": "Aaron Lutz", "time": 1503010778435, "rating": 5.0, "text": "Really nice people to work with. They are very easy going and more than willing to show you exactly how to do so! Hopefully we can come back for some more Yoga!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOIH2zeG73nHaw4R29PFTfTdRgG9PThyHLdBnEn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN4ulhrglEqsT-R8uAJzKRe7heB8LKOLDHdAsXB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO-ZyPH-mJBY-t83qvPyn7CJFXblfVFUnil0myC=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "105093094740110958398", "name": "Steven Steiner", "time": 1607062857812, "rating": 5.0, "text": "My children take Karate with Jamue Webster. He is great with children and adults alike, and makes learning self defense fun to learn.", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "112709150805705693364", "name": "Laura Furnas Cannady", "time": 1620279073928, "rating": 4.0, "text": "Generation after generation...this place speaks volumes.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOr_01j9dNA5Wk1AJiVg-SqjGlhNJrbC3YSWwA9=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "105676387951128507895", "name": "MARIE JOHNSTON (SHAMAR)", "time": 1591891941516, "rating": 5.0, "text": "My nieces and nephews love it. And the teachers there are great with the kids!", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "108766839587455522939", "name": "Brandi Blankenship", "time": 1494557623068, "rating": 5.0, "text": "My children and I have been actively involved in classes at Webster's Karate Studio for several years, and we've enjoyed every minute of it. The children's classes are structured, yet fun and engaging. The adult classes are also amazing, and provide a excellent workout in addition to it's conceptual framework. All of the instructors are great with kids, and extremely knowledgeable about martial arts. I would absolutely recommended Webster's Martial Arts Academy to anyone interested in martial arts training.", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "111270885731656711454", "name": "Jana McGuire", "time": 1496695939735, "rating": 5.0, "text": "Webster's karate studio is wonderful! Pat Underwood & Jamie Webster are just 2 of the phenomenal instructors. Before my son began karate, he was an extreme introvert. Webster's karate has not only taught him respect & discipline, but also confidence & courage! I fully believe karate also contributed to his academic achievements.", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "101131797480521148755", "name": "kim Deese", "time": 1494435672252, "rating": 5.0, "text": "The best thing I have done for my son. Webster karate has taught him perseverance and compassion and kindness. The character and qualities of a good man.  The teachers are great. They always give 100%.", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "118098547417055014340", "name": "Ellen Cumbess", "time": 1599012684788, "rating": 5.0, "text": "Great family atmosphere.", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "103681760624738526522", "name": "John Stallions", "time": 1495410573825, "rating": 5.0, "text": "In full disclosure, I am the same John Stallions that is part owner in the Webster Martial Arts school in Madison.  However, I don't think I should recuse myself from reviewing the Decatur school - my home school and the school where my children train.  I have a 30+ year relationship with the Webster family and I couldn't be more proud to be a part of it.  Jamie has been at the helm since the mid 90s and has improved and expanded the curriculum year after year to make it the premium brand it is today.  It has shaped my character and instilled many core values (key concepts) in me that I am grateful to have instilled in my children today.  I am proud to have Pat Underwood as our head instructor in Madison and as his employer can attest to his honorable character, gentle demeanor and amazing teaching acumen.", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "113097516471145796517", "name": "Janice Huff", "time": 1518739062341, "rating": 5.0, "text": "I watched my daughter Cassie & her daughter excel.   I wish they would finish what they started and get their black belts.  Webster's welcomes you as if you were all Family.!", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "114608334343561776213", "name": "Dena Griffin", "time": 1495146130388, "rating": 5.0, "text": "Webster's Martial Arts has made a HUGE difference in my life, as well as in my daughter's life. All of the instructors are top notch, and really care about martial arts, as well as the students. Webster's Martial Arts has become family to me.", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "105376778805935064880", "name": "Madison Parker", "time": 1497395940549, "rating": 5.0, "text": "My son Devon has been at websters karate for a couple of months. We absolutely love it and everyone there. He has learned discipline and respect since being there. This is the best place if anyone wants to learn karate.", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "107125586397567743732", "name": "Donald Graham", "time": 1495149724429, "rating": 5.0, "text": "My Grandson Grady takes karate at Websters studio and he has learned so much. He has learned to have respect for everyone and has so much confidence in himself.\nHe loves the competition and the friends he has made there.\nThe instructors at the studio are very knowledgeable and makes each student feel special.", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "107195308924397196407", "name": "MachineBeast", "time": 1494976233146, "rating": 5.0, "text": "Excellent unified family environment. Very good with kids. Ideal for learning respect and discipline.", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "109977252551276831437", "name": "Clara Bushnell", "time": 1497479332625, "rating": 5.0, "text": "My absolutely loves Webster's Karate.  She has been enrolled since March and has learned so much.  If you are looking for a karate studio that teaches, discipline, strength, balance, weapons, and build self esteem, all in a fun environment, then  this is the studio for you.", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "100860054523797625797", "name": "Ever Wright", "time": 1497457158815, "rating": 5.0, "text": "We highly recommend Webster's.  The instructors are very knowledgeable.  Our son loves training here!", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "107554892027735486649", "name": "cory mcvay", "time": 1494971576830, "rating": 5.0, "text": "Websters Karate is a wonderful place for kids and adults alike ! My daughter and I started taking lessons at around the same time and we love it ! The head instructor Jamie Webster is awesome and has the ability to keep the children busy learning and having fun at the same time ...", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "100758260381732966130", "name": "Britany Pilgrim", "time": 1495150313793, "rating": 5.0, "text": "My son loves taking lessons at Websters. The instructors are great and very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "113786501339683210039", "name": "Autumn Howard", "time": 1495038651079, "rating": 5.0, "text": "Webster's is excellent with kids of all ages and adults . The classes are simply exquisite ! I'm really happy I've found such a good place to learn and grow in a good and healthy environment.", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "104194802253808785141", "name": "Vikki Pitz", "time": 1495681094807, "rating": 5.0, "text": "I am so proud of my granddaughter jayce we put her in in January and she has done so good and it helps with such a wonderful staff that take the time to teach the young children and make such a amazing impact on their lives", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "114980508696786738457", "name": "Jack Marks", "time": 1493498430077, "rating": 5.0, "text": "I took karate here when I was a child. Everything I learned I still use today. Definitely one of the best places to take karate in the decatur/Huntsville area. Sbn Pat and Greg are great with all ages.", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "103637738944761028460", "name": "Joshua McGuire", "time": 1496694539988, "rating": 5.0, "text": "I cannot say enough good about our experience with Webster's. My son has grown leaps and bounds at both the Moulton and Decatur studios. Pat Underwood did a fantastic job with the Moulton studio, unfortunately it closed. He was very forthright and open about the reasons why it closed. All of which were very understandable.\nSince coming to Decatur my son has grown immensely in his martial arts level. He competes on the competition team and has done fantastic everywhere we've went. Jaime Webster is a great instructor. I would highly recommend Webster's for karate instruction. The best thing is that it isn't just forms and stuff. It is sparring and jiu jitsu as well. In short it is practical and high level. It is top notch.", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "101697030259592752757", "name": "Ken Flemons", "time": 1494543061205, "rating": 5.0, "text": "Have been taking at Websters for years now, the classes are excellent, especially the Jiu Jitsu class.", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "103360085423893009133", "name": "Wyatt Payton", "time": 1435848083261, "rating": 1.0, "text": "The Moulton SBN is not a man of his word he told my son a full refund would be given for a grappling inner School tournament that he did not finish because he had a asthma  attack    he waited until he seen he was not coming back and choose a different Martial Arts Studio to attend and then he cashed the check 3 weeks later, now the Decatur Studio is better with more experienced teachers but Moulton not so good he has his picks and everyone should be treated the same, also he talks about other parents be hide there backs and tells things about their kids and what is going on in their family.", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "104807127517871988989", "name": "Constitution Defender", "time": 1565724397557, "rating": 5.0, "text": "Jamie Webster is a phenomenal teacher to people of all ages. He was taught by his Dad, Jimmy, along with his sister and best friend, Johnny Lee Smith. His Mom was also active in the art of Tang Soo Do Moo Du Kwan. Suffice it to say, for that household and Johnny, Tang Soo Do training was like eating. You just did it. I know Jamie's father, Jimmy was highly skilled and well respected in the martial arts community. Perhaps his Mom and sister, but I don't know. Jamie certainly is, and so is Jimmy Lee Smith. If you're in Decatur or Moulton, go to Webster's Karate. You won't find better training. If you're in Cullman or Madison, go to Triad Martial Arts. That's Johnny's. Or, if you're looking for a specific branch of martial arts, research and CALL both businesses and see what they have to offer, because each is fluid in their differing styles. For the record, Chuck Norris is a Tang Soo Do guy. You can't go wrong with Jamie or Johnny.", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "117034345423445314628", "name": "Jewel Graham", "time": 1495158421242, "rating": 5.0, "text": "Awesome studio! Love the instructors!", "pics": null, "resp": null, "gmap_id": "0x8862867fd1410347:0x718092451b1fbe99"}
{"user_id": "113301832737629340657", "name": "Brittany Satterfield", "time": 1485721216998, "rating": 5.0, "text": "My son had anger and confidence problems before I signed him up. He has been going for several months now and his confidence is better so he has started making friends and his anger is better controlled. The staff is friendly, professional and truly cares about their students. I love that my son is learning the skills to defend himself and that he is making friends at the same time. I would definitely  recommend Premiere to others!", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "108812738542797002001", "name": "Ernestine Adkins", "time": 1457647898396, "rating": 5.0, "text": "Great school! The instructors are awesome and my daughter loves it!", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "113447560659704317625", "name": "Ashley McGowan", "time": 1486239601905, "rating": 5.0, "text": "Just finished My first Womans self Defense class and Oh My Goodness...I learned alot and signing up..it's a bit of a drive for me but it is well worth it BC it will help save my life and my daughter's life!! Y'all get signed up and learn all that you can !!\n\nChloe had fun and learned alot herself, hoping to get her signed up for classes too!!\n\nThank you Michael Vick and Kelsie Mcgowan !!!", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "110514188316197063843", "name": "Jerry Chenault", "time": 1446938272993, "rating": 5.0, "text": "Highly skilled instructors and great, caring people who run a professional school where self-development is incorporated into every physical movement. The instructors are very skilled in tournament weapons and skills as well as those super important, reality-based, self defense skills through Krav Maga.  Master Vick is an experienced trainer in Krav Maga, and even conducts seminars at other schools.", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "112413977118004466142", "name": "Rikki Tha M'Fkn Tikki (LadyArtemiss)", "time": 1385096633710, "rating": 1.0, "text": "This is by far the worst martial arts school I have ever attended. I joined Premier in October 2012 with Oct-Dec free. I enrolled on the family plan with my 3 children. My children quickly became bored with the short 30 minute classes that they could only attend twice a week. The instructors were good with the kids, it was just the rushed format that was bad. By January only one was left attending. I wasn't any happier with the jujitsu, Krav Maga, or Muay Thai classes. All classes were only 30 minutes as well. This means practically no warm up, rushed instruction, and little to no time to practice technique or spar. To make it worse, because I had some experience in jujitsu ( my main area of interest when I joined) I was handed a book with the curriculum for the night and left to teach students who had attended Premier longer than me on several occasions. So not only was I losing my training time, I was left in an awkward situation. At this point I figured I would just deal with it and not renew my contract when the 6 months were up. In January the owner sold me on joining the Certified Instructor Training Program with promises of additional training outside of normal class times, seminars that would be paid for by my tuition, weekly CIT meetings, and eventually running my own school under the premier name. There were about 4-5 other adults that signed up for this as well. We changed my contract to reflect that my monthly payments would now go to paying the $10,000 tuition for this course. Between signing up in January till April there were only a total of 3 CIT meetings, far from the weekly meetings I was promised. There was no additional training offered. The seminars were all held in either Kentucky or Texas so to attend you had to drive there and get a hotel. That's not so bad I suppose, but then I was told that there would be an additional fee of several hundred dollars to attend. Also I would have to buy all the equipment required for the seminars (which had to be Premier brand). To purchase all of this equipment added approximately $400 (that's with the CIT discount). By March I had come to accept I had been suckered into a joining a McDojo and was now stuck in a contract. I was going to make the most of it. A month or so later the lead instructor came to teach class intoxicated. To the point he was slurring and falling asleep mid sentence while sitting up. After attending the jujitsu class he taught, several of us informed the owner of the instructors condition. He allowed him to continue teaching the remaining classes (Krav Maga and Muay Thai) while he sat in the back and watched. After this I told the instructor that I wanted to cancel my contract. I expressed all of my concerns and disappointments. He assured me that he was going to improve everything and make good on his promises. He asked me to give him another chance and a little time to get things the way they should be. 2 months later the only thing that had changed was that he fired the instructor that was intoxicatedd. There were only 2 CITs left, including me. Everyone else quit showing up. I informed the owner via E-mail, multiple voicemails, and Facebook messenger that I was dropping out. I listed all of the reasons and was very polite. I received no response. I also contacted the billing company, Member Solutions, as per my contract, to cancel. I explained my multiple reasons for wanting to cancel, and they informed me that I could not cancel. The new contract I signed for the CIT program was counted as a loan for $10,000 that I had to pay back before I could cancel. I attempted again, multiple times, to contact the owner about this issue and once again received no response. I am fortunate enough to have a lawyer as a friend to help me beat this scam. However, I would strongly recommend you stay away from this \"school\".\n\nSincerely,\nChris Allen", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "103136168224154012801", "name": "Destiny Fitch", "time": 1474313544775, "rating": 5.0, "text": "Great instructor", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "108082394769142241006", "name": "Kristina Adkins", "time": 1466777339442, "rating": 5.0, "text": "my sis loves it", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "107914370840418842944", "name": "Lori McGowan", "time": 1416521275121, "rating": 5.0, "text": "Great Kids and adult classes!!!", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
