{"user_id": "108883590610715436613", "name": "Cathy Young", "time": 1622342000320, "rating": 5.0, "text": "We drove 2.5 hours to purchase our beautiful, new Can Am Spyder RT Sea to Sky from this dealership and it was well worth it. From the very get go, Bree was amazing and straight forward.  We knew what we needed and wanted and she was able to give us it at a price that worked for us. Bree and the team here give: 1) true up front, out the door pricing, 2) a fair amount for trades, 3) no hassle financing and 4) great service all the way around. We appreciated the honesty she gave us from the get go knowing we had been working with another dealership. She never bad mouthed them or tried anything sneaky (can’t say the same for the Big #1) to win our business. She beat them in price and overall customer service. Casey, in finance, was able to get us a deal we could work with, warranties and services we needed and our financing approved quickly. When we arrived everything, to include our bike, was ready to go. When parts we were expecting were not immediately found, Tim, the General Manager, stepped in and started looking and found the part. From first phone call to driving away on our bike, it was a wonderful experience.", "pics": null, "resp": null, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "106241217057016831175", "name": "Doug Loveless", "time": 1613843572135, "rating": 5.0, "text": "The staff are wonderful, Bree was very professional and knowledgeable enjoyed working with her. Casey was witty and made the financing quick and easy. The whole process was slick. Would recommend them to anyone who wants a quick and painless transaction. Thank you", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPu8xMpPRX8NBCHJCNOizVd20gIKuAaYZRWx5j9=w150-h150-k-no-p"]}], "resp": {"time": 1614014665361, "text": "Hi Doug Loveless, thank you for taking the time to leave a review for us at Motorcycle Sport. We're happy we could meet your expectations! Mr. Loveless, reviews like this give us motivation and help us ensure we provide high-quality care.\r Your recommendation means so much to us and we're so happy to have earned it. Thank you again for taking the time to let the world know about your positive experience. Have a great day!\rWelcome to the largest family in the Southeast the Motorcycle Sports Family."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "105931572962626369800", "name": "kenneth mote jr", "time": 1620834168613, "rating": 5.0, "text": "Very pleasant experience!!  The lady at the parts counter is top notch!   She was very friendly and knowledgeable.   She knew exactly what I needed and had it waiting for me when I got there!!   Excellent customer service!!!   I will definitely be back!!   I highly recommend them to everyone!", "pics": null, "resp": null, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "116110650769048544704", "name": "Kendall Welch", "time": 1619436778302, "rating": 5.0, "text": "Thankful I chose to purchase our 2019 Canam Defender from them.   Everyone I spoke with was so nice and helpful.  Bree and Casey were a pleasure to work with, even tho this process was a little more difficult than the usual, they were patient and made things quick and easy.  Thank you to all! We are enjoying our ride.", "pics": null, "resp": {"time": 1620054244748, "text": "Thank you, Kendall! We work hard to provide our amazing customers with a seamless buying experience. Hope to see you again soon!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "108000662799752695598", "name": "Bud der", "time": 1615570365489, "rating": 5.0, "text": "Took great care of us. Price was better that all 10 other places I looked! Got exactly what I wanted.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOIbucJpl7QzlTWEFlAYcisuYw7a4NzRvKsuZap=w150-h150-k-no-p"]}], "resp": {"time": 1618841595349, "text": "Thanks for the kind words, Bud! We work hard every day to provide the best customer service experience. Thanks again for trusting us to be your powersports dealer."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "116128964467651176365", "name": "Michael Stevens", "time": 1623121168613, "rating": 2.0, "text": "A place called motorcycle sports should probably have more than a couple bikes to choose from. Seems like they only focus on off road vehicles now. The last 2 times I've been here there selection was awful and their prices were like 20 percent above retail. It's a shame considering what this dealership used to be. Won't be back.", "pics": null, "resp": null, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "104039132383829380438", "name": "Dwayne Oden", "time": 1617812455722, "rating": 5.0, "text": "I had a great experience at Motorcycle Sports. Bre is a truly awesome sales person. She helped me and made sure I was truly happy with my 2021 Can Am Ryker 900.", "pics": null, "resp": {"time": 1617891555181, "text": "Hi Dwayne Oden, thank you for taking the time to leave a review for us at Motorcycle Sport. We're happy we could meet your expectations! I will make sure Bree gets this fabulous review and we share it with the team. We're glad to hear we delivered such a great experience. If there's anything further we can do for you, we are happy to help! Welcome to the Motorcycle Sports family!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "115074976624088181989", "name": "Gabriel Ivan", "time": 1615646322660, "rating": 5.0, "text": "Wonderful staff, best prices to buy! Definetly worth driving from Georgia to buy from them!\nJody was the best salesman i ever meet.", "pics": null, "resp": {"time": 1615921968740, "text": "Thank you so much for the kind words, Ivan!! We appreciate you being a part of the Motorcycle Sports family!! Enjoy the new Maverick!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "109785634870851990685", "name": "Dawn Russell", "time": 1618608326595, "rating": 5.0, "text": "Just wanted to Shout Out April in parts!  Amazing gal - friendly, patient and got me all the info I needed to get an accessory for my new Sea Doo!", "pics": null, "resp": {"time": 1618683287156, "text": "Dawn Russell, thanks for your praise and comments about our team. We will pass along your kind words to April! We sincerely thank you for the positive review, and look forward to seeing you again soon! Welcome to the Motorcycle Sports family."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "116922923881531554058", "name": "Levy Lawson", "time": 1617752388506, "rating": 5.0, "text": "Motorcycle sports have outstanding staff.Bre is the best salesman I know.she was always there from the beginning to the end.Thanks Bre", "pics": null, "resp": {"time": 1617808264609, "text": "Hi Levy Lawson, thank you for taking the time to leave a review for us at Motorcycle Sport. We're happy we could meet your expectations! I am happy to hear Bree took care of you from start to finish. If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day also welcome to the Motorcycle Sports Family."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "100048761325860203170", "name": "ROBERT PATRICK", "time": 1606318146751, "rating": 5.0, "text": "Best motorcycle and recreational vehicle business on the planet. I've made ATV, Jet-Ski, and multiple motorcycle tire purchases over the years. Sales staff, parts staff, and service staff all professional, accommodating, and friendly. Love witnessing their huge expansion and continued growth.", "pics": null, "resp": {"time": 1606485266715, "text": "Robert Patrick, thank you for your kind review; we are happy to pass along your comments to the team here at Motorcycle Sport! We always strive to provide top quality service to every guest, and are pleased to hear that you enjoyed your experience here at Motorcycle Sport!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "116722868265776415925", "name": "Briana Sawyer", "time": 1615662256501, "rating": 5.0, "text": "Casey was fantastic! She got us in and out so quickly. Great customer service.", "pics": null, "resp": {"time": 1615922868731, "text": "Thank you for the awesome review, Briana!!! We hope you and Joseph are enjoying the new ride!! We appreciate your business."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "112596110347375276550", "name": "lilmama 44", "time": 1571427122128, "rating": 5.0, "text": "Great sales agents, good prices and friendly service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPdHgS5jLp7-mZjx11QRIEEKYmNw-EgK7MXTPcq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNOPIkC8S8u4j2mhh0AMwftXPgC27Eyw6J8qZUy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNTFD5FUxEu0QBJlE2BYnTzfpnc5gq4qW9NTwZK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPAi7esFWalrsoaeCvYANg_O-2tooslb9YFAYXt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMORWG5g6F1P6K_fLi8VA4tZDzmIAwov7OZ0VkB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMbBUj-t35esrb27GJzh_Pq32QCM4M7KMfOhVNh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNhCWEcuNczDig6aziqGQQ-n1Y_uN44g9ltxBx-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMSrznMgM1x8E6R3qI14Ke5XF3H4jlfhQc4PBEd=w150-h150-k-no-p"]}], "resp": {"time": 1571499791934, "text": "Hello, we are glad we could help! We look forward to your next visit! Take care!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "104689553960878305227", "name": "Richard Taylor", "time": 1615921186793, "rating": 5.0, "text": "Great people and service will definitely be back for another sxs", "pics": null, "resp": {"time": 1615925389099, "text": "Mr. Taylor, thank you for your kind review; I would be happy to pass along your comments to the team here at Motorcycle Sport! Your recommendation means so much to us and we're so happy to have earned it. Thank you again for taking the time to let the world know about your positive experience. Have a great day! Welcome to the Motorcycle Sports family!!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "103470361927139628564", "name": "Mac Jemison", "time": 1606519105028, "rating": 5.0, "text": "Picked up a 2018 Suzuki BOULEVARD M109R from Motorcycle Sport and the Customer Service was excellent! I would recommend to anyone! Smooth, easy, and quick process!!!", "pics": null, "resp": {"time": 1606575438467, "text": "Mac Jemison, thank you for your kind review; we are happy to pass along your comments to the team here at Motorcycle Sport! We always strive to provide top quality service to every guest, and are pleased to hear that you enjoyed your experience here at Motorcycle Sport! Enjoy the new bike and welcome to the largest family in the southeast the Motorcycle Sports Family!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "117623102554006539157", "name": "Mark Brown", "time": 1602939945631, "rating": 5.0, "text": "Professional, courteous and friendly staff. Great facility with plenty of inventory to choose from. Would highly recommend. Ask for Bree, she's the best!", "pics": null, "resp": {"time": 1603116022275, "text": "Mark Brown, thank you for your kind review; we are happy to pass along your comments to the team here at Motorcycle Sport! We always strive to provide top quality service to every guest, and are pleased to hear that you enjoyed your experience here at Motorcycle Sport!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "105135521848199511104", "name": "Deb", "time": 1590789669767, "rating": 5.0, "text": "We were very happy with Dwight and bought a Polaris ranger.  He helped us with out being  pushy as some sales people are. He seemed very honest and got us what we wanted at a fair price. We recommend Dwight. What a great place to shop.", "pics": null, "resp": {"time": 1595524131435, "text": "Thank you, Deb!!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "106581585101460586556", "name": "Billy Hall", "time": 1604609392277, "rating": 5.0, "text": "I have bought 2 Can Am Outlander machines from the folks in the last 2 years. Always a friendly staff waiting to help meet my needs. I can really suggest working with these guys!", "pics": null, "resp": {"time": 1604675081169, "text": "Hi Billy Hall, thank you for taking the time to leave a review for us at Motorcycle Sport. We're happy we could meet your expectations! We always strive to provide top quality service to every guest, and are pleased to hear that you enjoyed your experience here at Motorcycle Sport!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "111756127828910160551", "name": "Mike Coleman", "time": 1616527994360, "rating": 5.0, "text": "Very friendly and helpful people.", "pics": null, "resp": {"time": 1616596676534, "text": "Mike Coleman, we strive for 100% satisfaction, and it is great to see you had such a positive experience at Motorcycle Sport. Please don't hesitate to reach out if there's anything additional we can do for you. Welcome to the Motorcycle Sports family."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "116521149163905302303", "name": "arthur hoover", "time": 1603941115923, "rating": 5.0, "text": "great place to shop staff was friendly and there to answer any questions  you would have would recommend to anyone", "pics": null, "resp": {"time": 1604357906718, "text": "Arthur Hoover, we're happy you found our staff to be so supportive during your experience here at Motorcycle Sport. We always strive to provide top quality service to every guest, and are pleased to hear that you enjoyed your experience here at Motorcycle Sport! Welcome the Southeast largest family the Motorcycle Sports family."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "100054743734990089951", "name": "Susan Brown", "time": 1593719105810, "rating": 5.0, "text": "Love this place! I have bought 4 units and have always had a great experience! The service is truly the best!", "pics": null, "resp": {"time": 1594830949318, "text": "Thank you, Susan! We appreciate your business!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "112596110347375276550", "name": "lilmama 44", "time": 1571427122128, "rating": 5.0, "text": "Great sales agents, good prices and friendly service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPdHgS5jLp7-mZjx11QRIEEKYmNw-EgK7MXTPcq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNOPIkC8S8u4j2mhh0AMwftXPgC27Eyw6J8qZUy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNTFD5FUxEu0QBJlE2BYnTzfpnc5gq4qW9NTwZK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPAi7esFWalrsoaeCvYANg_O-2tooslb9YFAYXt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMORWG5g6F1P6K_fLi8VA4tZDzmIAwov7OZ0VkB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMbBUj-t35esrb27GJzh_Pq32QCM4M7KMfOhVNh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNhCWEcuNczDig6aziqGQQ-n1Y_uN44g9ltxBx-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMSrznMgM1x8E6R3qI14Ke5XF3H4jlfhQc4PBEd=w150-h150-k-no-p"]}], "resp": {"time": 1571499791934, "text": "Hello, we are glad we could help! We look forward to your next visit! Take care!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "100418586885987487154", "name": "Todd Reid", "time": 1585603472392, "rating": 5.0, "text": "I had the most incredibly positive experience buying my motorcycle from Dwight at M.S.  I made an offer over email from a listing I saw in Cycletrader.  He accepted my offer.  I paid exactly what my offer amount was with no junk fees.  Even the back office was incredibly helpful with the forms for titling in GA.  5 star experience all the way!", "pics": null, "resp": {"time": 1595524306635, "text": "Thank you, Todd!!!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "107207176741835092677", "name": "William King", "time": 1596141532653, "rating": 5.0, "text": "Bought my 570 sportsman from Jody and Kim ! Real down to earth folks to deal with. I feel like I got a good product for a fair price and very reasonable payments!", "pics": null, "resp": {"time": 1603114228020, "text": "Thank you for the awesome review, William! We appreciate your business!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "109569108845002789131", "name": "Thomas Stapp", "time": 1590941604573, "rating": 5.0, "text": "I had been dealing with another dealership in AL but I could never get the salesman that I was assigned to on the phone. He was always busy but would text me and then not respond for hours at times. I started looking elsewhere and came across Motorcycle Sports and gave them a call and talked to Dwight and he had what I was looking for. Within a few hours Dwight and Kim had me ready to go. They held the unit for me until I could there. I made a 2.5 hr drive and Kim had all paperwork ready to go. Dwight showed me the unit and explained the features and I was ready to go. I also found out 2 days before heading out that a friends uncle has purchased a unit from here a few weekends prior and had a great experience. Dwight and Kim and a few other staff members told me a about a few local riding spots. I highly recommend this dealership and will go back when its time for another one.", "pics": null, "resp": {"time": 1620054051126, "text": "Thank you so much for the kind words, Thomas!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "105135689729486813668", "name": "V Z", "time": 1591421847115, "rating": 1.0, "text": "**SHADY EBAY SELLER**\n\nThis outfit does not honor binding pricing agreements. They cancelled my order because the selling price was apparently too low, only to turn around and relist the same part for much higher. They also took it a step further and FALSIFIED the reason for cancellation, stipulating that it was buyer's request (it was not). Further requests for explanation went ignored.\n\nI can only imagine what goes on inside the business if the dishonesty pervades the online portal.\n\nConsider yourself warned.", "pics": null, "resp": {"time": 1591504657189, "text": "V Z, we pride ourselves on providing exceptional service, so we are disappointed to hear that your visit with us was anything less than satisfactory. Please call me and we can discuss further. we can not fix the issue without knowing more.  Thanks,"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "112304156881143069163", "name": "Tiffany Thompson", "time": 1595962859095, "rating": 5.0, "text": "Great service and super friendly staff. Two of our friends have recently made purchases and had the same experience.", "pics": null, "resp": {"time": 1595963718852, "text": "Thank you for the review, Tiffany!! We appreciate your continued business over the years."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "106416963101575470417", "name": "Terry Payton", "time": 1603824582851, "rating": 5.0, "text": "Great selection and very nice folks.", "pics": null, "resp": {"time": 1603825724270, "text": "Thank you, Terry! We appreciate your business and hope your son enjoys his go cart!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "105248736788572307945", "name": "Tiffany Adkins", "time": 1619822208265, "rating": 5.0, "text": "Motorcycle sports is awesome !!", "pics": null, "resp": {"time": 1620053786633, "text": "You're awesome, Tiffany!!! Thank you for your business!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "100065327823670993999", "name": "Mandy Whitson", "time": 1595956560697, "rating": 5.0, "text": "We could not be happier with our purchase from Motorcycle Sports! Great service and great people!", "pics": null, "resp": {"time": 1595957690576, "text": "Thank you, Whitson family!!! We hope you're enjoying your Polaris Sportsman!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "101451856812777011760", "name": "jan hurd", "time": 1596053312344, "rating": 5.0, "text": "The employees are so helpful and the service department is superior.", "pics": null, "resp": {"time": 1603114343026, "text": "Thank you, Mrs. Hurd! You all are certainly part of our MS family!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "111802949849375094648", "name": "Hannah Lively", "time": 1593321676134, "rating": 1.0, "text": "If there was an option for no stars I’d definitely put it... This place is over priced on used and new items, and their employees obviously don’t care if they sell you anything or not. They are rude and we will not be doing business with them again. Go to Speedzone in Gadsden if you want to buy anything and not get ripped off.", "pics": null, "resp": {"time": 1593440929568, "text": "Hannah Lively, we pride ourselves on providing exceptional service, so we are disappointed to hear that your visit with us was anything less than satisfactory. Motorcycle Sports was built on top notch customer service, competitive prices, and after the sale service. We are a family owned business that prides itself on taking care of each customer. Here at Motorcycle Sports, we are always looking for ways to improve; we appreciate your input. If you would be willing, we would like to have you contact our manager Tim  at (256) 831-6495 to discuss ways we can better serve you in the future."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "100304825037913256814", "name": "Peyton Hall", "time": 1619822103979, "rating": 5.0, "text": "Awesome place", "pics": null, "resp": {"time": 1620053920864, "text": "Thank you again for taking the time to let us know how we did. We hope you have a great day! We look forward to your next visit! Take care!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "115036543434564119895", "name": "Mary Catrett", "time": 1592618304995, "rating": 5.0, "text": "Great service I in getting the deal and contract ready so fast.", "pics": null, "resp": {"time": 1595524055584, "text": "We appreciate you taking the time to leave us a review, Mary. Thank you for your business!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "104036076210689586707", "name": "Randy Moore", "time": 1597506659504, "rating": 5.0, "text": "Great folks to do business with,very friendly and helpful", "pics": null, "resp": {"time": 1597510433404, "text": "Thank you so much for the review, Randy!!! We appreciate your business."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "102325678096447042035", "name": "Patrick Neeley", "time": 1600905911851, "rating": 5.0, "text": "Great experience on my new purchase", "pics": null, "resp": {"time": 1601414287348, "text": "Thank you for the kind words, Patrick!! We hope you’re enjoying your new Can Am Defender!!!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "110595145357561349219", "name": "April Duke", "time": 1595952908490, "rating": 5.0, "text": "Great deals and the best parts department anywhere!", "pics": null, "resp": {"time": 1595957769756, "text": "Thank you , April!! Yes, our Parts Department ROCKS!!!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "100948028514725053684", "name": "Jamie Camper", "time": 1619821983191, "rating": 5.0, "text": "They are the bomb!!!", "pics": null, "resp": {"time": 1620054003530, "text": "Jamie Camper, we strive for 100% satisfaction, and it is great to see you had such a positive experience at Motorcycle Sport. We hope to see you soon!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "107226694798510708626", "name": "Joseph Smith", "time": 1592343681810, "rating": 1.0, "text": "Lairs and damaged my new saddle bags on my bike.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPezU4jd15aakEA2AJGW7_kw1TsoPY13pHaaQyK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPftSU9hsgoUz0d3CDlvTys2eELAccwvX4XK6JD=w150-h150-k-no-p"]}], "resp": {"time": 1592401807646, "text": "Joseph Smith, we regret to hear that you had a negative experience with us, but would appreciate the chance to turn your experience around. Please contact Tim at (256) 831-6495 when you have an opportunity, and we will be more than happy to try and turn your experience around."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "114036775820130912776", "name": "Tommy Hunter", "time": 1570664902043, "rating": 5.0, "text": "Just bought Can Am defender from this place! They tell you the price and that is what it is, I checked all over the southeast for months and no one can compare to these guys!!!! Thanks again Dwight and staff for making this purchase so easy!!!", "pics": null, "resp": {"time": 1570665827357, "text": "Thank you so much for the kind words, Tommy!!!! Welcome to our Motorcycle Sports family. We appreciate your business!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "104275673963254012683", "name": "benny ogles", "time": 1507159659716, "rating": 5.0, "text": "Thay went all out for my family we have boult 4 Polaris from them and we are very happy with them Grate people and GRATE Place of business VERY friendly people", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPwptpI0fCshA77VlCeuQPYEYF4mEt2sFlM3yIp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNLyNy1-LZQYfYUH0_I7ADD20A3W_afzN--9cBT=w150-h150-k-no-p"]}], "resp": {"time": 1549299298777, "text": "You're awesome, Benny! Thank you for your business!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "102457324278991471679", "name": "Jasper Bonner", "time": 1586465898317, "rating": 5.0, "text": "Great place, great people, they are polite an will help you in anyway they can! My boy Ashley got it done for me. If your looking for an sxs or atv. Goo see ashley at motorcycle sports", "pics": null, "resp": null, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "104951066241705196546", "name": "Larry Phillips", "time": 1587576998810, "rating": 5.0, "text": "The more I drive my new Ranger XP 1000 the more I love it! Thanks Motorcycle Sports!!!", "pics": null, "resp": {"time": 1595524117165, "text": "So glad you're enjoying your Ranger, Larry!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "108849831976062179854", "name": "Thomas Quest", "time": 1582849431760, "rating": 5.0, "text": "Got my parts a day early and in the condition promised! Thanks again.", "pics": null, "resp": {"time": 1583265765571, "text": "Thomas Quest, we strive for 100% satisfaction, and it is great to see you had such a positive experience at Motorcycle Sport. If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "116880038874461818440", "name": "Snoopy Walden", "time": 1576984001412, "rating": 4.0, "text": "Nice Store! Great Inventory! for your color and choice of side by side CanAm's!", "pics": null, "resp": {"time": 1576988123881, "text": "Thank you, Snoopy!!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "113271622595705274251", "name": "j smith", "time": 1596650848580, "rating": 1.0, "text": "had a windshield when bike went in for tire change bike fell over in their shop broke windshield and would not honor their shop mishap oh they order one and replace it at your expense which was total bs\nso be careful when you have to have service on your ride", "pics": null, "resp": {"time": 1596744874344, "text": "Here at Motorcycle Sport, we strive for excellence, and are disappointed to hear that you received anything less. We wanted to clarify the shop did not damage the windshield and it was not a shop mishap. We felt like we gave you many options for the windshield that was damaged due to you parking the bike improperly. We offered you multiple options to help you replace the windshield and all the options you choose to deny. We are a family owned business that has built its reputation for 20 years on doing the right thing and taking care of the customer in all situations. Our manager Tim would really like to speak with you more regarding this matter. Please reach out to us at (256) 831-6495. We look forward to hearing from you."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "113545109884551969828", "name": "Ha'kim Josey", "time": 1567872910148, "rating": 5.0, "text": "I bought my 2nd RZR today from MC Sports and the experience couldn’t have been any better.  Vic and Ashley made my trade-in simple and gave me a fair value.  They were friendly and made the whole experience fun!  I will be back and I recommend everyone to buy from these folks!", "pics": null, "resp": {"time": 1568047055665, "text": "Thank you, Ha’kim!!! It was a pleasure doing business with you. We appreciate you being such a loyal customer with our dealership."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "101124469375526003683", "name": "Pat Mason", "time": 1535626038407, "rating": 5.0, "text": "A great company to deal with. I bought my Polaris side by side from them a year ago. Best prices in the south. Excellent service. The staff is excellent, friendly, and helpful. I would definitely buy from them again.", "pics": null, "resp": {"time": 1534789505611, "text": "Your recommendation means so much to us and we're so happy to have earned it. Thank you again for taking the time to let the world know about your positive experience. Have a great day!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "114192423544973690490", "name": "Bradley Barker", "time": 1584985601978, "rating": 5.0, "text": "They was quick to help and easy to deal with made the buying process quick and easy. Even stay after hours to help me out!", "pics": null, "resp": null, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "113798785795279233857", "name": "Kristie Roper", "time": 1574510352878, "rating": 5.0, "text": "Awesome place got our new 4 wheeler there", "pics": null, "resp": {"time": 1574536476329, "text": "Kristie, thanks for choosing us for your motorsport needs! We hope to be of service to you again in the future.  Best wishes,  Motorcycle Sports."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "101758739267928914372", "name": "John Durham", "time": 1541717203522, "rating": 5.0, "text": "Just bought my 3rd and 4th Polaris Ranger from these guys. That says it all. Class act from top to bottom. Thanks, Mark and team.\nKeep up the good work.\nJohn Durham", "pics": null, "resp": {"time": 1541778370714, "text": "Hi John, thank you so much for your positive comments about Motorcycle Sport! Please let us know if there is anything else we can do for you; we are more than happy to help!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "116227252378014779123", "name": "Scott Wages", "time": 1561686216691, "rating": 5.0, "text": "Dwight is the man! Really enjoyed working with him again!! I have sent all my buddies to them and will continue to!! Thanks guys!", "pics": null, "resp": {"time": 1561687409553, "text": "Thank you for the awesome review, Scott!! Dwight and everyone here at MC Sports appreciate you."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "117474177116805331822", "name": "The Johnson's", "time": 1587057212574, "rating": 4.0, "text": "Sales manager reached out to me. We cleared up any miscommunication.", "pics": null, "resp": {"time": 1586873752405, "text": "The Johnson'S, we pride ourselves on providing exceptional service, so we are disappointed to hear that your visit with us was anything less than satisfactory. We would like to have a better understanding about your experience. Please reach out to the General Manager at (256) 831-6495 at your earliest convenience and we will do our best to resolve this with you."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "114112738206586089453", "name": "chrish toffa", "time": 1583267494194, "rating": 1.0, "text": "I came early one morning and they seemed shocked that I was there. However I had 20k dollars to blow glad I didnt spend it there", "pics": null, "resp": {"time": 1583261486382, "text": "Chrish Toffa, thank you for leaving us feedback. We are disappointed to hear that your experience was not a positive one. Here at Motorcycle Sport, we are always looking for ways to improve; we appreciate your input. If you would be willing, we would like to have you contact Tim at (256) 831-6495 to discuss ways we can better serve you in the future."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "117602866426604065291", "name": "FordTough Lady", "time": 1546789646521, "rating": 2.0, "text": "Always have to order what we need!! Nothing ever in stock but they do have fair prices and nice staff!!", "pics": null, "resp": {"time": 1546790506175, "text": "Thank you for the review. Sorry you had a bad experience. We always strive to serve our customers and give them a 5 star experience."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "113961674504135353356", "name": "Marty Mangham", "time": 1576844122428, "rating": 5.0, "text": "Good service,  good folks.", "pics": null, "resp": {"time": 1576891790031, "text": "Marty, thank you for your kind words and this wonderful review! Thank you, and have a fantastic day!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "102300706278601839104", "name": "Taz Branch", "time": 1595948977710, "rating": 3.0, "text": "Was lied to by salesman to my wife & myself ! Got it home & found several screws loose on front plastics.Ive spent over 50k in last year BET I don’t buy another one from them !!😡", "pics": null, "resp": {"time": 1595968067283, "text": "Taz thank you for the feedback. I wanted to make sure we took care of your issues once you brought them to my attention. The center cap I handled the next day and now that I am aware of the other issue we have it handled. If you have any other issues or concerns that come up please don't hesitate to reach out.  Thanks for your business."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "117954174449388600235", "name": "Brent wheat", "time": 1538169023130, "rating": 5.0, "text": "Called and told them what I wanted and they had it and all the paperwork ready for me when I got there great service", "pics": null, "resp": {"time": 1538271238905, "text": "Brent, we are very happy we could provide you with a positive experience! Feel free to reach out to us if you need anything. Have a wonderful day."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "109656055212756631145", "name": "Jason Cook", "time": 1538566286302, "rating": 5.0, "text": "Broke a tie rod on a Friday night, called Saturday morning right at 8, talked to Christy in parts, they had replacement in stock, she set it aside for me.  No price gouging, awesome customer service, go see them.", "pics": null, "resp": {"time": 1538849325756, "text": "Jason, we are glad we could help! We are always more than happy to assist you if anything else comes up. Take care!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "117067616823193344241", "name": "Lacy Kuenzel", "time": 1523108237851, "rating": 5.0, "text": "It was so easy to make a purchase. Great staff! Friendly faces and attitudes!", "pics": null, "resp": {"time": 1522942507399, "text": "Thank you for taking the time to leave us a stellar review, Lacy!!! We appreciate you being a part of the Motorcycle Sports family!! Don't forget to like us on Facebook to stay up to date on new products, sales, events, etc.!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "117485579893878149449", "name": "Hannah Tolbert", "time": 1568474364388, "rating": 5.0, "text": "Such great people and very helpful.", "pics": null, "resp": {"time": 1568475645042, "text": "Thank you, for the kind words, Hannah! We appreciate you being a part of MC Sports family!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "104655649512308667850", "name": "stan jones", "time": 1533338781499, "rating": 5.0, "text": "Very helpful every time I have done business with them", "pics": null, "resp": {"time": 1533679923264, "text": "Thank you, Stan!! We appreciate your business."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "104601801342625828621", "name": "Billy Wood", "time": 1564786356643, "rating": 5.0, "text": "If I need a new Polaris this is the only place I would go to buy. Get all of my parts there", "pics": null, "resp": {"time": 1564789125329, "text": "Thank you for the kind words, Billy. We appreciate your business!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "106332479236336061186", "name": "Kim Fisher", "time": 1559248408973, "rating": 4.0, "text": "Alex was very friendly and helpful.", "pics": null, "resp": {"time": 1559416676121, "text": "We're happy to hear Alex was able to provide you with a positive experience. Thanks again for taking the time to leave us this information about your recent visit. Take care!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "113497659263630150146", "name": "Daniel Rollins", "time": 1524349894165, "rating": 5.0, "text": "Great staff that treats you like family they go the extra mile to help", "pics": null, "resp": {"time": 1524362077733, "text": "Thank you for the kind words, Daniel! We have awesome customers and love them all!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "105323410513682676288", "name": "chad morris", "time": 1524681614743, "rating": 5.0, "text": "GREAT PLACE TO SHOP.FRIEDLY STAFF.HAD A GREAT EXPERIENCE WHEN PURCHASING MY RZR AND SALES EVEN STAYED LATE TO WAIT ON ME.SERVICE DEPARTMENT AND CHRIS ARE GREAT TO DEAL WITH.JUST HAD A REPAIR DONE AND THEY DID GREAT.CHRISTY IN PARTS HELPED ME GET A PROBLEM RESOLVED WITH SOME TIRES AND WAS GREAT TO DEAL WITH.I WOULD SAY IF YOUR WANTING A SIDE BY SIDE OR ATV THAT THIS IS THE BEST PLACE TO SHOP.", "pics": null, "resp": {"time": 1524683175458, "text": "Thank you for taking the time to leave us a review, Chad!! We appreciate you and your business. If you ever need anything else, you know we will always be here for you. Also, don't forget to follow us on Facebook to stay up to date on events and promotions! ;)"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "107148224241086119695", "name": "Eric Hawkins", "time": 1511231442435, "rating": 2.0, "text": "If you are wanting to purchase a motorcycle or ATV, this may be the place to go. If you are wanting someone to repair your motorcycle or ATV, KEEP SHOPPING AROUND. I took my motorcycle to have the carburetors rebuilt. After spending about $700, the bike spewed fuel from a ruptured fuel line all of the way home. The service manager said that it must have leaked before it was dropped off. It didn't. The mechanics do not stand behind their work and the labor prices are outrageous.", "pics": null, "resp": null, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "113511470729329490746", "name": "Dan Rains", "time": 1524927189470, "rating": 5.0, "text": "Very good . I'll do business with them again.", "pics": null, "resp": {"time": 1524927985051, "text": "Thank you, Dan!! So happy to hear you had a great experience. We appreciate your business!!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "111437908668848224823", "name": "heath smith", "time": 1521204290470, "rating": 5.0, "text": "Fantastic people,  always a very helpful  place with all my RZR wants and needs!", "pics": null, "resp": {"time": 1522952838833, "text": "Thank you, Heath! As always, we appreciate you!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "108366051964873281667", "name": "Brandon Paulk", "time": 1522497325523, "rating": 5.0, "text": "Great Customer Service. Great turnaround time in service.", "pics": null, "resp": {"time": 1522953350227, "text": "Thank you, Brandon!!! Customer service is our #1 goal!! Don't forget to like us on Facebook to stay up to date on new products, sales, events, etc.!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "104688956203717834170", "name": "shawn franks", "time": 1567867963454, "rating": 5.0, "text": "Loved it nice friendly and professional service", "pics": null, "resp": {"time": 1567869260867, "text": "Thank you, Shawn! We appreciate your business!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "113722932962902794108", "name": "James Moore", "time": 1497062021292, "rating": 4.0, "text": "Very knowledgeable and friendly. Best service prices around.", "pics": null, "resp": {"time": 1549299780430, "text": "Thank you, James!!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "106251511293341970899", "name": "beardenjim", "time": 1505440453922, "rating": 4.0, "text": "Good selection, cool sales guy. Plenty of used quads and utvs as well.", "pics": null, "resp": {"time": 1549299351689, "text": "Thank you for the review!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "106877475715358589508", "name": "Cindy Chandler", "time": 1552099645771, "rating": 5.0, "text": "Nice people. Very understanding.", "pics": null, "resp": {"time": 1552167301283, "text": "Thank you for your business, Cindy! We appreciate you!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "111652193642698530993", "name": "Daniel Mathews", "time": 1564254903926, "rating": 5.0, "text": "They worked well with me to get the bike i wanted. Willing to fix problems as well!", "pics": null, "resp": {"time": 1559599818247, "text": "Hi Daniel! Thank you for review!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "111148899454537881486", "name": "Steve Sanders", "time": 1498862060392, "rating": 5.0, "text": "Excellent Service!! Went in for new tire on a Friday. Out in 45 minutes....", "pics": null, "resp": {"time": 1549299459659, "text": "That's what we like to hear! Thank you, Steve!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "100045119981043128804", "name": "Richie Goodman", "time": 1506873693050, "rating": 5.0, "text": "Always got treated on sales and service, great place to shop", "pics": null, "resp": {"time": 1549299324754, "text": "Thank you for the review, Richie! We appreciate you!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "115575059244131563293", "name": "Kaitlyn Scott", "time": 1533406065683, "rating": 5.0, "text": "OUTSTANDING customer service!!! Fast and eager to help!! HIGHLY recommend!!!!", "pics": null, "resp": {"time": 1533680008005, "text": "You are greatly appreciated, Kaitlyn!!!! Thank you for taking the time to leave us an awesome review!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "104680268567761918595", "name": "Johnny Denson", "time": 1618528529119, "rating": 4.0, "text": "Great Selection!!!!!", "pics": null, "resp": {"time": 1618683225434, "text": "Thank you again for taking the time to let us know how we did. If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day! Welcome to the Motorcycle Sports Family."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "108348304299108276988", "name": "Michael Carpenter", "time": 1524941717073, "rating": 5.0, "text": "Covered my misadventures without any issues.", "pics": null, "resp": {"time": 1524943888722, "text": "Thank you, Michael!!!!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "115194688671237554427", "name": "Johnny Whitman", "time": 1501884674853, "rating": 5.0, "text": "Very helpful and great place to do business", "pics": null, "resp": {"time": 1549299399460, "text": "Thank you, Johnny! We appreciate your business!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "116078076495006865158", "name": "Robert Crist", "time": 1564344513357, "rating": 1.0, "text": "I don't know  I was not there...how was it...", "pics": null, "resp": {"time": 1564387735553, "text": "Hello Robert, we appreciate your feedback. If there is anything that we may do to assist you in the future, please reach out at  (256) 831-6495 and we will do our best to help."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "100136351237878612946", "name": "Jewition", "time": 1501266005373, "rating": 5.0, "text": "Great very quick to help", "pics": null, "resp": {"time": 1549299442636, "text": "Thank you, Bradley!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "114890842716101671492", "name": "Lonnie Barnett", "time": 1534892110522, "rating": 5.0, "text": "Good service", "pics": null, "resp": {"time": 1527014092984, "text": "Thank you for the review, Lonnie! We appreciate you and hope to see you again soon."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "112413751328603209779", "name": "Tim Jones", "time": 1497099248164, "rating": 2.0, "text": "Unhelpful and rude as hell", "pics": null, "resp": {"time": 1549299766349, "text": "We always strive to give our customers a 5 star experience every time they visit. Sorry we did not meet your expectations, but we appreciate you taking the time to leave us a review."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "108485693288193910138", "name": "coppa c", "time": 1522532244052, "rating": 3.0, "text": "Don't have a large selection of parts for can am.", "pics": null, "resp": {"time": 1522953239312, "text": "Sorry to hear that you are unsatisfied with our selection of Can-Am parts. Being a new Can-Am dealer, we don't have a huge selection of parts right now. We understand your concern and we are working on this issue diligently. Thank you for your patience!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "114118334133145228213", "name": "Brian Peppers", "time": 1505236898809, "rating": 4.0, "text": "Very helpful and knowledgeable", "pics": null, "resp": {"time": 1549299366112, "text": "Thank you, Brian!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "108207823365190866846", "name": "Rodney Govens", "time": 1479661816529, "rating": 5.0, "text": "Quick and reliable service", "pics": null, "resp": {"time": 1549299801116, "text": "That's what we like to hear! Thank you, Rodney!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "101797264974499360806", "name": "Jeremias Duarte", "time": 1383767167598, "rating": 5.0, "text": "Mark and Nick are an absolute pleasure to be around. I couldn't believe the amount of pride they take in their establishment!", "pics": null, "resp": {"time": 1549299865561, "text": "YES!!! We love what we do and our customers. Thank you, Jeremias!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "111756221796426435762", "name": "Jon Madrigal", "time": 1463191431227, "rating": 5.0, "text": "Mark and Nic = awesome", "pics": null, "resp": {"time": 1549299827249, "text": "You're awesome! Thanks for the review, Jon!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
