{"user_id": "111332906279131039006", "name": "Gina Daniel", "time": 1628037224694, "rating": 5.0, "text": "Gracie my instructor is knowledgeable and awesome!!  Facility is very nice! I enjoy very much taking classes here.", "pics": null, "resp": {"time": 1628038051859, "text": "Thank you, Gina! We enjoy working with you and are glad you're enjoying your training. Keep up the hard work!"}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "107997324537257648177", "name": "Laura Rivers", "time": 1604869005730, "rating": 5.0, "text": "I am ecstatic for the opening of this local Madison “gem”! Gracie and Isaac truly go above and beyond. They are both, very knowledgeable and very passionate about the self-defense style that they teach.\n\nIf you are expecting this to be a “wax on, wax off” type of karate, think again! The personalized lesson was practical and relatable without having to paint a fence. And a HUGE bonus, both instructors are patient and encouraging! It’s absolutely all you could ask for in when it comes to learning self-defense!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO_L8ri0cRA5trF_XDCrkVmQcHPnfsdZd0fjH5g=w150-h150-k-no-p"]}], "resp": {"time": 1604869727698, "text": "Thank you Laura! We enjoy having you in the studio and know you'll do great things."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "103047355424581508878", "name": "Bart Roegner", "time": 1626136203327, "rating": 5.0, "text": "Isaac is an excellent teacher. He approaches teaching martial arts with patience and dedication. I highly recommend trying Kenpo with MadCity.", "pics": null, "resp": {"time": 1626139160695, "text": "Thanks, Bart! We really enjoy teaching you and appreciate your dedication."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "107529617076208577491", "name": "Matthew Eady", "time": 1604596816606, "rating": 5.0, "text": "An amazing school that teaches a very effective system of self-defense.  Patient, caring instructors who take time to pay the necessary attention to each individual student.  Great for people of all ages and all levels of physical fitness.  I could not recommend a better Kenpo in the North Alabama area.", "pics": null, "resp": {"time": 1604601015859, "text": "Thanks, Matt! We really enjoy teaching you and love getting to share our art with this area."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "110646145441436298162", "name": "Randall Rivers", "time": 1601309518840, "rating": 5.0, "text": "Great experience.  I wanted personal training, not a big group.  They offer several different options so you can find the one that works for you.  Good central location, nice facility and friendly, experienced trainers. I really like their focus on practical self-defense.", "pics": null, "resp": {"time": 1601310257812, "text": "Thanks, Randall! We think you'll excel quickly in our private program. We can't wait to see your progress."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "113963061688585154564", "name": "Christopher Weaver", "time": 1615331608713, "rating": 5.0, "text": "Amazing place! The instructors are friendly and very detailed in what they reach you.", "pics": null, "resp": {"time": 1615334204302, "text": "Thanks Christopher! We're glad you're enjoying your training so far - we appreciate all the hard work you put in."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "114157347272356245455", "name": "Farida Rennie", "time": 1602706889412, "rating": 5.0, "text": "I just took my first self defense lesson and I absolutely loved it. I felt that the lesson was not only fun but also practical. I was able to get a good workout while leaving with skills and improving my balance. I've already signed up for my next session!", "pics": null, "resp": {"time": 1602708043656, "text": "Thanks, Farida!! We appreciate your desire to learn and can not wait to see your growth in Kenpo."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "113301832737629340657", "name": "Brittany Satterfield", "time": 1485721216998, "rating": 5.0, "text": "My son had anger and confidence problems before I signed him up. He has been going for several months now and his confidence is better so he has started making friends and his anger is better controlled. The staff is friendly, professional and truly cares about their students. I love that my son is learning the skills to defend himself and that he is making friends at the same time. I would definitely  recommend Premiere to others!", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "108812738542797002001", "name": "Ernestine Adkins", "time": 1457647898396, "rating": 5.0, "text": "Great school! The instructors are awesome and my daughter loves it!", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "113447560659704317625", "name": "Ashley McGowan", "time": 1486239601905, "rating": 5.0, "text": "Just finished My first Womans self Defense class and Oh My Goodness...I learned alot and signing up..it's a bit of a drive for me but it is well worth it BC it will help save my life and my daughter's life!! Y'all get signed up and learn all that you can !!\n\nChloe had fun and learned alot herself, hoping to get her signed up for classes too!!\n\nThank you Michael Vick and Kelsie Mcgowan !!!", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "110514188316197063843", "name": "Jerry Chenault", "time": 1446938272993, "rating": 5.0, "text": "Highly skilled instructors and great, caring people who run a professional school where self-development is incorporated into every physical movement. The instructors are very skilled in tournament weapons and skills as well as those super important, reality-based, self defense skills through Krav Maga.  Master Vick is an experienced trainer in Krav Maga, and even conducts seminars at other schools.", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "112413977118004466142", "name": "Rikki Tha M'Fkn Tikki (LadyArtemiss)", "time": 1385096633710, "rating": 1.0, "text": "This is by far the worst martial arts school I have ever attended. I joined Premier in October 2012 with Oct-Dec free. I enrolled on the family plan with my 3 children. My children quickly became bored with the short 30 minute classes that they could only attend twice a week. The instructors were good with the kids, it was just the rushed format that was bad. By January only one was left attending. I wasn't any happier with the jujitsu, Krav Maga, or Muay Thai classes. All classes were only 30 minutes as well. This means practically no warm up, rushed instruction, and little to no time to practice technique or spar. To make it worse, because I had some experience in jujitsu ( my main area of interest when I joined) I was handed a book with the curriculum for the night and left to teach students who had attended Premier longer than me on several occasions. So not only was I losing my training time, I was left in an awkward situation. At this point I figured I would just deal with it and not renew my contract when the 6 months were up. In January the owner sold me on joining the Certified Instructor Training Program with promises of additional training outside of normal class times, seminars that would be paid for by my tuition, weekly CIT meetings, and eventually running my own school under the premier name. There were about 4-5 other adults that signed up for this as well. We changed my contract to reflect that my monthly payments would now go to paying the $10,000 tuition for this course. Between signing up in January till April there were only a total of 3 CIT meetings, far from the weekly meetings I was promised. There was no additional training offered. The seminars were all held in either Kentucky or Texas so to attend you had to drive there and get a hotel. That's not so bad I suppose, but then I was told that there would be an additional fee of several hundred dollars to attend. Also I would have to buy all the equipment required for the seminars (which had to be Premier brand). To purchase all of this equipment added approximately $400 (that's with the CIT discount). By March I had come to accept I had been suckered into a joining a McDojo and was now stuck in a contract. I was going to make the most of it. A month or so later the lead instructor came to teach class intoxicated. To the point he was slurring and falling asleep mid sentence while sitting up. After attending the jujitsu class he taught, several of us informed the owner of the instructors condition. He allowed him to continue teaching the remaining classes (Krav Maga and Muay Thai) while he sat in the back and watched. After this I told the instructor that I wanted to cancel my contract. I expressed all of my concerns and disappointments. He assured me that he was going to improve everything and make good on his promises. He asked me to give him another chance and a little time to get things the way they should be. 2 months later the only thing that had changed was that he fired the instructor that was intoxicatedd. There were only 2 CITs left, including me. Everyone else quit showing up. I informed the owner via E-mail, multiple voicemails, and Facebook messenger that I was dropping out. I listed all of the reasons and was very polite. I received no response. I also contacted the billing company, Member Solutions, as per my contract, to cancel. I explained my multiple reasons for wanting to cancel, and they informed me that I could not cancel. The new contract I signed for the CIT program was counted as a loan for $10,000 that I had to pay back before I could cancel. I attempted again, multiple times, to contact the owner about this issue and once again received no response. I am fortunate enough to have a lawyer as a friend to help me beat this scam. However, I would strongly recommend you stay away from this \"school\".\n\nSincerely,\nChris Allen", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "103136168224154012801", "name": "Destiny Fitch", "time": 1474313544775, "rating": 5.0, "text": "Great instructor", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "108082394769142241006", "name": "Kristina Adkins", "time": 1466777339442, "rating": 5.0, "text": "my sis loves it", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
{"user_id": "107914370840418842944", "name": "Lori McGowan", "time": 1416521275121, "rating": 5.0, "text": "Great Kids and adult classes!!!", "pics": null, "resp": null, "gmap_id": "0x8889720dd9ebefeb:0x8c472225533f0464"}
