{"user_id": "108640041363496634275", "name": "Daniel Porter", "time": 1569498204695, "rating": 5.0, "text": "Nice place nice people", "pics": null, "resp": null, "gmap_id": "0x888a3eea5c347f99:0x8044ed73ea2a8cdd"}
{"user_id": "109244627684413946731", "name": "Justin Long", "time": 1617564008934, "rating": 5.0, "text": "There 2021 Easter Service was so awesome. The place was busy but the staff and volunteers made everything comfortable. They had photo booths set up for Easter photos as well.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMNKGX2zmb1vdZznApSRsSz8XzlzOtuD1w9haKC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOW8ar9PWp8CUV-ojOKxW1XMYOrXf0gRPeHAypb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPkwk4VsD42bx23P0MfwWOSj2GJNkmxyYkHBClY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOnWp-dkK8rTlocks1rq5hRRcVCvMaV0yBMFiZo=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e851ee712800d:0x4d5b15e89ab619d8"}
{"user_id": "114385292564918077768", "name": "Todd Hollis", "time": 1578857329364, "rating": 5.0, "text": "Biblically teaching church. Strong leadership, the turning point of my life and the beginning of a ministry that God placed not just in my heart but my wife Allison and my entire family. We love them and they will love you!", "pics": null, "resp": null, "gmap_id": "0x888e851ee712800d:0x4d5b15e89ab619d8"}
{"user_id": "100240364987610274644", "name": "Marc Matney", "time": 1576270777935, "rating": 1.0, "text": "Biblical living seems lost on them (pastoral staff). It seems like what they say is pretty correct, but when faced with putting their words into action, well, let's just say a rather massive let down. Communication from the staff also lacks much luster and follow through. I will NOT go into why, however, a big disappointment none the less. Actions are disobedient to The Word of God. Not often in line with Godly concepts.", "pics": null, "resp": null, "gmap_id": "0x888e851ee712800d:0x4d5b15e89ab619d8"}
{"user_id": "103598311967445476993", "name": "Paul Spencer", "time": 1565492127718, "rating": 5.0, "text": "Really enjoyed Pastor Mike teaching over the years!!!!\nWe moved away last year and I miss Pastor Mike very much. He had really deep messages.", "pics": null, "resp": null, "gmap_id": "0x888e851ee712800d:0x4d5b15e89ab619d8"}
{"user_id": "106362633253189940238", "name": "Debi Goodman", "time": 1515029713639, "rating": 3.0, "text": "This is an inclusive contemporary Christian Church. They have many programs throughout the week. If you are military or new to the area, check it out. We were members a few years ago but have since found a church that fits us better.", "pics": null, "resp": null, "gmap_id": "0x888e851ee712800d:0x4d5b15e89ab619d8"}
{"user_id": "103956679856601238893", "name": "Susan Stimpson", "time": 1426440150573, "rating": 5.0, "text": "Messages are spot on! Come-as-you-are environment. Exuberates Christ's love. Very warm. Dynamic. Wanting genuinely to be a place people want to come, belong. Straight from the Bible but like the pastor is talking to you in your own living room. Goal is to help you along your spiritual journey, whether it is that first step in believing Christ is who he said he is and starting that friendship to Christ lovers wherever they are in their life journey. Thus, the name Journey (my opinion.) My husband is the one who discovered Journey, wanted to go and also join a life group. He's never done that before.", "pics": null, "resp": null, "gmap_id": "0x888e851ee712800d:0x4d5b15e89ab619d8"}
{"user_id": "109300652675326801105", "name": "Brady Simpson", "time": 1478789399667, "rating": 5.0, "text": "WOW! Such a friendly and family oriented environment. My wife and I felt warmly welcomed on our first visit! Now we can't wait for every service!! This church is quickly becoming a big part of our famliy!!", "pics": null, "resp": null, "gmap_id": "0x888e851ee712800d:0x4d5b15e89ab619d8"}
{"user_id": "116484811260651285214", "name": "Tammy Klimek", "time": 1540854649111, "rating": 5.0, "text": "We absolutely love it. The love from everyone was outstanding and bv the sermons were great.", "pics": null, "resp": null, "gmap_id": "0x888e851ee712800d:0x4d5b15e89ab619d8"}
{"user_id": "101657322087289053525", "name": "Roger Cleckler", "time": 1505670704739, "rating": 5.0, "text": "Awesome praise and worship service with bible based teaching and preaching from the pastor. A great place to worship the one true God", "pics": null, "resp": null, "gmap_id": "0x888e851ee712800d:0x4d5b15e89ab619d8"}
{"user_id": "112417535504761989068", "name": "Dustin Creel", "time": 1478790748134, "rating": 5.0, "text": "Great church with awesome music! It's such a great atmosphere with the true word of God being taught!", "pics": null, "resp": null, "gmap_id": "0x888e851ee712800d:0x4d5b15e89ab619d8"}
{"user_id": "103587277709478070660", "name": "Aisha LovelyMe", "time": 1512336914958, "rating": 5.0, "text": "Beautiful church! Friendly people and great message.", "pics": null, "resp": null, "gmap_id": "0x888e851ee712800d:0x4d5b15e89ab619d8"}
{"user_id": "111141508604997910893", "name": "Christina Wyatt", "time": 1496934987703, "rating": 5.0, "text": "What a wonderful church filled with God's presence 😍🤗😊", "pics": null, "resp": null, "gmap_id": "0x888e851ee712800d:0x4d5b15e89ab619d8"}
{"user_id": "106000375525625101375", "name": "jj99toys", "time": 1504123547914, "rating": 5.0, "text": "Wonderful Church Very Friendly and Great Preaching about the Word of God.", "pics": null, "resp": null, "gmap_id": "0x888e851ee712800d:0x4d5b15e89ab619d8"}
{"user_id": "103944288012154277880", "name": "Wilson Christa", "time": 1502039885070, "rating": 5.0, "text": "Wonderful service, friendly and warm congregation.", "pics": null, "resp": null, "gmap_id": "0x888e851ee712800d:0x4d5b15e89ab619d8"}
{"user_id": "116488767738772485532", "name": "Tonya Morris", "time": 1509319800258, "rating": 5.0, "text": "Always a good time,very friendly", "pics": null, "resp": null, "gmap_id": "0x888e851ee712800d:0x4d5b15e89ab619d8"}
{"user_id": "100414522668597585262", "name": "Chuck Coburn", "time": 1520297176055, "rating": 5.0, "text": "Celebrate Recovery!", "pics": null, "resp": null, "gmap_id": "0x888e851ee712800d:0x4d5b15e89ab619d8"}
{"user_id": "106851874867244368450", "name": "Sup Boi", "time": 1621866649574, "rating": 1.0, "text": "IDK.  I have simply lost my will to coexist here.", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "110779025736028459122", "name": "Carie A.", "time": 1616517913995, "rating": 5.0, "text": "Love this place!!! The people are really nice and the service is awesome!", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "116113831825916372152", "name": "Jamie Peacock", "time": 1490307782046, "rating": 5.0, "text": "Houston Academy is our home away from home. You feel like family when you enter the school. Everyone is warm and inviting. You are called by name from the faculty and administrators. We have two children that are pushed academically and we feel certain will become successful adults. This is a college preparatory school and your children are well prepared for college. We love being a part of the Houston  Academy Raiders.", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "114095879062936286015", "name": "Jenna Kate Strickland", "time": 1610646468009, "rating": 5.0, "text": "great school, just absolutely great", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "114402691413494063168", "name": "Erin Kelly", "time": 1489679009094, "rating": 5.0, "text": "More than anything, I feel like Houston Academy teaches your children to strive for excellence academically.  It is the only college preparatory school in our area. The faculty, parents, and students strive for excellence collectively in all areas, teaching our children integrity and to be well-rounded individuals that are ready for college and the rest of the world when they finish!  It is a family and there is NO place like it!", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "103951504986830348711", "name": "Charlie Knowles", "time": 1557332832447, "rating": 5.0, "text": "Amazing School! Teachers are amazing! Shawna=BOT!", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "107641974063814518822", "name": "Austin Washington", "time": 1542065230269, "rating": 5.0, "text": "Good school and make sure you get Mrs. Dean!", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "117420994188911385977", "name": "Bloom Mint", "time": 1538229003162, "rating": 1.0, "text": "Worst school I have ever put my children into. I have 2 boys who are part of Houston Acandemy, and they’re both asian. I can’t even tell you how much they come from this “College Prep School” crying, because of bullying. They tell me “Why can’t I do that”, or “Why can’t they pick me”. It just breaks my heart from the racially comments spoke from this school. My children are now part of Providence Christian School, and I don’t regret a thing. Highly don’t recommend HA if you come from a different origin, and your scared of your child getting bullied. Recommend Provi or Northside for you. Thank you.", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "108039609466303422774", "name": "Jameson Flowers", "time": 1539042724773, "rating": 5.0, "text": "Great school!", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "109359793597032427391", "name": "Zehnz", "time": 1445026161018, "rating": 5.0, "text": "It's freaking HA what do you expect", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "104098638407107190480", "name": "Prerna Suradkar", "time": 1479312835950, "rating": 5.0, "text": "I love this map", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "106560514686285920019", "name": "Dale Williams", "time": 1525205339830, "rating": 5.0, "text": "Home of the lil leopards. I love the dedicates work I see from the prinpical Ms. Smith. She runs a tight ship and likes for the compliance of her staff. They have a friendly staff. They believe in promptness so no education time will not be lost.", "pics": null, "resp": null, "gmap_id": "0x889a522d301c5b13:0x17315571e55f84dd"}
{"user_id": "108303115050676650738", "name": "Cameron Bass", "time": 1515542816563, "rating": 5.0, "text": "Love my years going there all last year and before that I think your children should go to Robbins", "pics": null, "resp": null, "gmap_id": "0x889a522d301c5b13:0x17315571e55f84dd"}
{"user_id": "112946409388836580290", "name": "Ann Morris", "time": 1473423228681, "rating": 5.0, "text": "I love this school and so does my fourth grader", "pics": null, "resp": null, "gmap_id": "0x889a522d301c5b13:0x17315571e55f84dd"}
{"user_id": "117288742390188316750", "name": "Lauren D", "time": 1621905773567, "rating": 5.0, "text": "We enrolled our son in sugar and spice at 5 months of age after being denied by 3 other daycares (closer to us and WAY MORE expensive) due to COVID19 making most places \"half capacity.\" Well, we couldn't have been more blessed. The staff at sugar and spice are incredibly nurturing and caring. They absolutely love the kids. I never doubted my son wasn't taken care of. We are incredibly grateful to have found sugar and spice and are thankful to Sybil, owner, for running such an amazing establishment at an affordable price. Thank you for my son's happiness, all the beautiful hand made crafts we got to bring home, and all the friends we made. We are only leaving due to another job opportunity out of state. We highly recommend this place. We will miss you all!", "pics": null, "resp": null, "gmap_id": "0x88891f33442888f5:0x78b5a80f33f6ac46"}
{"user_id": "114438123508120345391", "name": "Michael Jones", "time": 1591318997228, "rating": 5.0, "text": "Hands down an excellent place. They have been so reliable. The children seem very happy. Big playground and frequent recess. They have great success prepping the children for school, and they obviously care about the children and families.", "pics": null, "resp": null, "gmap_id": "0x88891f33442888f5:0x78b5a80f33f6ac46"}
{"user_id": "111221075117093834098", "name": "Karen R", "time": 1597327193795, "rating": 5.0, "text": "Lots of reviews by people who are emotional and not critical thinkers, and have never even been to S&S, but feel entitled to post negative comments based off a FB post (and even then, they are making all sorts of other assumptions as well). I've had kids attending since 2014 and every one of them has loved it and loved their teachers.", "pics": null, "resp": null, "gmap_id": "0x88891f33442888f5:0x78b5a80f33f6ac46"}
{"user_id": "108213775447919099162", "name": "Paola Myers", "time": 1522971750822, "rating": 1.0, "text": "Statement from my sister in law: On February 26, 2018, I was relieved to be off work and on my way to pick up my children. I walked up to the daycare office and my children burst out of the door to greet me. Hellos, hugs and kisses were shared. I shuffled them to the car as usual, trying to hurry home. I asked them how their days were and the news I would receive from my children would change my outlook on the world. My son, who is 5, stated he had good news and sad news. (This is a usual statement. He like to say something sad and good that happened during his day. He said his teacher pushed him down. Taken aback, I inquired what happened? I had thought for sure I misunderstood. He repeated himself in more detail that she had taken her hand to the back of his head and pushed him off of the picnic table. He continued that he had fallen on the rocks of the playground and hurt his hands and knees. I checked his hands and knees, but there were minor indications of trauma. The owner of the daycare assured me she would get to the bottom of it and let me know. She expressed how much she loves my children and cares for us like family. Trying to reassure myself, I say how maybe he was mistaken, because his sister had said stuff before and recanted. Surely, I told myself, there has to be some mistake. My children have attended this daycare for over 4 years, and we have not had major incidents in that time.....Boy, was I wrong....\nThe owner of the daycare gave me her phone the next night, so I could feel better about the situation and know that my children are safe. She stated how my son was mistaken and that the teacher had caught him from falling, etc.. I was left to watch the video in slow motion to find out what happened....Shocking!  I took my children out of this place immediately. The teacher pushed down my son and I have it on video. I advice you to stay away from this place!", "pics": null, "resp": null, "gmap_id": "0x88891f33442888f5:0x78b5a80f33f6ac46"}
{"user_id": "106516886678315836311", "name": "Taneshia Pendleton", "time": 1446576782501, "rating": 1.0, "text": "I don't even know where to begin. My child attended this place for less than a month. The teachers clearly are not trained. On several instances I walked into the building and heard teachers yelling at kids. No positive reinforcement at all only negative. I don't yell at my child and don't expect a teacher to either. Next, there was a security concern. No formal system of regulations to keep intruders out. Plus, on instances I have walked into a classroom to see the teacher's boyfriend I presume just hanging out. That was the Big oh no for me. Then I have seen the teacher's send 2 year old girls into the bathroom together, no supervision and some of the girls were pushing and hitting others, which is the same thing I witnessed during nap time. Not sure why they let kids be on someone else's sleep mat either. For a place that claims to be \"more than a babysitting service\" they get a F from me. My babysitter are more qualified then these people.", "pics": null, "resp": null, "gmap_id": "0x88891f33442888f5:0x78b5a80f33f6ac46"}
{"user_id": "101692042645044912594", "name": "Kaitlin S", "time": 1562425042608, "rating": 1.0, "text": "This place has turned DRASTICALLY. 5 years ago it wasnt bad but now its just a monster house. Please please please dont take ypur kids here, especially for the price. I had my child here and the bullying between kids is kinda bad but the adults are very hit and miss. Not worth it, got somewhere else", "pics": null, "resp": null, "gmap_id": "0x88891f33442888f5:0x78b5a80f33f6ac46"}
{"user_id": "100043059207302503824", "name": "Ashley Lovell", "time": 1565292847096, "rating": 5.0, "text": "The staff have been so great to my kids after a horrible experience with another daycare. We love it at Sugar and Spice!", "pics": null, "resp": null, "gmap_id": "0x88891f33442888f5:0x78b5a80f33f6ac46"}
{"user_id": "109024269947870514212", "name": "Ahmad said", "time": 1392673165077, "rating": 5.0, "text": "I have a 3 kids that go here , they been going here for 3 years and counting this is one of the best day cares If not the best. great staff would recommened this day care to anyone its a great day care you wont be disappointed .", "pics": null, "resp": null, "gmap_id": "0x88891f33442888f5:0x78b5a80f33f6ac46"}
{"user_id": "108897493192774710473", "name": "Candlewood Suits", "time": 1389083071754, "rating": 1.0, "text": "PLEASE, PLEASE, PLEASE DON'T SEND YOUR CHILD HERE!!!!!!  THEY DON'T TAKE CARE OF CHILD AND EVERY CHILD DESERVES TO BE TAKEN CARE OF WHEN YOUR NOT THERE.  THEY NEED TO BULLDOZE THIS PLACE TO THE GROUND!!!!!", "pics": null, "resp": null, "gmap_id": "0x88891f33442888f5:0x78b5a80f33f6ac46"}
{"user_id": "112554992326868700494", "name": "Jobs Bham", "time": 1580837030791, "rating": 5.0, "text": "We have been here almost a year and LOVE it. My son started when he was just over a year old in the Starfish class. Hannah, Haley, Olivia, Stephanie, Brittany,Nate, Kelsey, Melissa, are all so responsive. Everyone is very nice, they have a great curriculum and my son has learned SO much since he has been here. He just transitioned to the next class, and has done great. Miranda is so sweet and loving to all her children in the class. Can't say enough good things about this place.  Only downfall is that tight parking lot.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "115711114034754827075", "name": "Shyesa Granger", "time": 1531835316904, "rating": 5.0, "text": "Where do I begin to express the level of love, passion, and appreciation not only as parents I have for this school but our has daughter too! They are hands down the best place for your babies. From infant to school age care, they are well equipped for the academic, cognitive,emotional, and world adventures ahead of them. My daughter has been here since 1.5 yrs old and she’s well prepared for Kindergarten, as she asks to be quizzed in the car daily on math, science, spelling, and most importantly her facts on the Lord!! Thanks to all the staff and their love for our precious little ones, we as parents never had to worry a day she’s there. Thank you!!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "111525890168679962999", "name": "Catherine", "time": 1551399125597, "rating": 5.0, "text": "My son has been going to this school since he was 11 months old, he’s been in 3 classrooms and all the teachers have been incredible. The staff is so kind and sweet, they always let us know when something happens to him. He’s so well taken care of, I wouldn’t want him to be anywhere else!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "112147048019439728339", "name": "Adam Owens", "time": 1551380197758, "rating": 5.0, "text": "My son has been going to this daycare for over 2 and a half years and we love it. I have always enjoyed spending time with my son so it is not uncommon for me to him off in the morning and stay for 20 minutes or longer to hang out with him and his friends in his class.  The teachers have always been appreciative of me spending time with him and when he was younger, I would stop by at random times without warning just to check on him, to see him and was always greeted and got a chance to know his teachers. I have appreciated the curriculum because my son always comes home having learned new words, colors, shapes or just singing a new song. He loves to go to school and loves to be with his friends. All the kids I see usually are really happy and smiling. He moved up into classes with older kids at times which I appreciated because in order for him to learn to crawl or even walk, it was helpful for him to see other kids who were already doing those thing so he could mimic what they did. We love the staff and the hours and I feel confident that he is taken care and truthfully the teachers as a whole are not appreciated as much as they should be because it's a hard job and not everyone can handle that stress. We have recommended this school to numerous friends who have their kids now and it is nice for us to watch them grow up together.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "110056607960264182440", "name": "Latraunda Smith", "time": 1500390052723, "rating": 4.0, "text": "My Daughter has been here since she was 8 months old.  She likes it and enjoys her little friends. I can tell she is learning so many different things. I really appreciate the meals they provide they are well balanced and fresh!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "103454785843009009204", "name": "Rachel Samuel", "time": 1465785111671, "rating": 5.0, "text": "Wonderful people, excellent school. Both our kids went there for 3 months and loved it. We had to change only because it was way too far for us and if they open a branch in Hoover, it would be amazing.\nMr. Chris is very supportive and really good with kids. They personally know each kid and how their day was. A special mention and a big thanks to both teachers, Miss Kendrika and Miss Taylor. Our babies still miss you guys. God bless you people for all the good work you do. Thanks", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "108549760505356603610", "name": "Joshua Perry", "time": 1570222968254, "rating": 1.0, "text": "This daycare is below standards in the personnel running this daycare and its staff. Unprofessional and unclean. This is more like a place to drop off your children to be babysat than to learn and grow. The rooms are small and the building is old and the staff is very young and unprofessional.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "110769963648522258386", "name": "Stacey McIntyre", "time": 1464285953813, "rating": 5.0, "text": "Great school for many reasons:  they teach children in a loving way to read,, write, exhibit good character traits, have a love for learning Biblical lessons along with wonderful teachers, staff and owners.  And the cherry on top....at a reasonable price for what all you get!!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "118248202318085508053", "name": "Autumn Hiett", "time": 1551286822188, "rating": 1.0, "text": "My son is 10 months old now and started at Grace in the guppy class at the Ridge location. We loved the teachers and that class so much. One morning when he was in the guppy class I was dropping off my son and the lead teacher of sea turtles was opening that class. My son had a blow out so the teacher was changing him and I was standing there helping her. As I’m talking to her she is taking his clothes off and then begins to use his outfit to wipe his stool off his entire body. His outfit ended up having to be thrown away because after three washes it was stained. I mentioned it to the admin and the director and nothing was done. Everything was great until he moved up to the sea turtle class. We did not want him moving up to that class because he was only about 7.5 months old. He wasn’t even crawling, but was attempting to crawl. They kept pushing me to move him up even though I expressed my feelings towards it several times. They stated he was “too big” for the guppy class and he couldn’t fit in the swings anymore. He was a 7.5 month old who couldn’t even crawl, in a class full of 1 year olds who are walking. After he moved up to the sea turtle class we started having issues instantly. The lead teacher would tell me what to do and not to do with my son. He came home with three knots on his head over the period of time from when he moved up until this week. Nobody called me to inform me that he had hit his head either. When I picked him up the teachers or admin staff would state they didn’t know how he got the knots and bruises on his head. Also, every day when I pick up my sons nose is crusted with snot. It clearly hadn’t been whipped off all day. His clothes would be covered in the foods they had eaten that day too. Several times I would have to change his clothes and clean him up before leaving because he looked so bad. On many occasions he came home with 3 out of 4 bottles still filled with formula that I had pre made that morning. The teachers would state he refused to eat. Let me mention that my now 10 month old is 27 lbs, he doesn’t miss a meal. When I would pack his bottles up to leave he would get so excited like he wanted one, so I would give him one and he would drink it so fast like he hadn’t eaten all day because he hadn’t. They only gave him one bottle for an entire 10 hours. When my son was close to 9 months old he came home for a week straight throwing up randomly and having bad stools. I finally took him to the doctor thinking he was sick. I came back to the daycare the following week and told his teacher that his doctor said he was fine. That is when I find out that his lead teacher had been giving him whole milk with his formula without asking me or even telling me for an entire week. What if my kid was allergic or I didn’t want him to have milk? The doctor even recommends children not have whole milk till they are a year old. I expressed my feelings towards her stating all my concerns about it and she states in that class they train the children on whole milk. I told her not to give it to him anymore but I would find out from the other teachers that she continued to give it to him. One day I had to pick my son up during nap time for a doctors appt and she told me to shhh that I would wake the children up. Let me mention I was whispering asking how my son was that day. The same teacher has gotten a stern tone with two of the other kids in his class while I was in there talking to her during drop off, so it makes me wonder how she is talking to my son without me there. These are only a few things that have happened. The director was aware but never did anything about it.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "114329012990978862549", "name": "Jenifer Phelps", "time": 1472481050331, "rating": 5.0, "text": "Wonderful place! Our daughter loves it here. She is always talking about her school now. She's learned so much since she started. She talks about all her friends, water day, her teachers, and about the songs and lessons she's learned at school.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "103030316341926541305", "name": "Melissa Jackson", "time": 1551402400626, "rating": 5.0, "text": "Great place to work!!!! Great place for your child/children!!!!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "105425576353833329898", "name": "Brody Dreher", "time": 1596720557428, "rating": 5.0, "text": "New Market was a wonderful place for me I enjoyed every second of it! Teachers are kind and  always welcoming to help students, the staff is great and makes sure every child is safe.-Brody Dreher (Now in 8th Grade)", "pics": null, "resp": null, "gmap_id": "0x88623b51f95ce57f:0x4cdeddf200c0149e"}
{"user_id": "110258216269884191190", "name": "Crystal Preston", "time": 1459479612037, "rating": 5.0, "text": "Awesome staff! My son has a speech problem  and did not do well with his first speech therapist. We enrolled him into their awesome pre k program and he has done awesome with their speech pathologist! I love the school and their staff!", "pics": null, "resp": null, "gmap_id": "0x88623b51f95ce57f:0x4cdeddf200c0149e"}
{"user_id": "105343930438137069315", "name": "Amanda Gabhart", "time": 1499283639932, "rating": 5.0, "text": "We absolutely love New Market School! Hands down the best decision we've made when it comes to their education. Small town school where children are called by their names not a number.", "pics": null, "resp": null, "gmap_id": "0x88623b51f95ce57f:0x4cdeddf200c0149e"}
{"user_id": "117953170341936611370", "name": "Bambi Reeves", "time": 1553595925106, "rating": 5.0, "text": "My oldest start at New Market Elementary in 2007 for Pre-K, and he is now in high school. I also have a daughter in middle school who started New Market for Pre-K, and my youngest daughter who started in Pre-K is now a Kindergarten student at New Market Elementary. It has been a great school for my kids the last 12 years. We love New Market Elementary School.", "pics": null, "resp": null, "gmap_id": "0x88623b51f95ce57f:0x4cdeddf200c0149e"}
{"user_id": "106580603185504173026", "name": "FaZeClAnFail - Slither.io, Agar.io, and Anything", "time": 1483837734793, "rating": 5.0, "text": "I go to this school and its Pretty nice. I get Straight A's, just think the curriculum could be better. Ugh... Common Core and IXL...", "pics": null, "resp": null, "gmap_id": "0x88623b51f95ce57f:0x4cdeddf200c0149e"}
{"user_id": "103058056167446618145", "name": "Misty Miller", "time": 1445541743116, "rating": 5.0, "text": "New Market has been so patient with my son and my daughter loves her first year!! I'm so thankful for new market school... it's small and everyone knows everyone and I like it like that!!", "pics": null, "resp": null, "gmap_id": "0x88623b51f95ce57f:0x4cdeddf200c0149e"}
{"user_id": "104658162122919928891", "name": "Lance G", "time": 1543685075787, "rating": 5.0, "text": "These folks are awesome Christian teachers.  Outstanding learning environment, with knowledgeable, professional staff. It's clear they truly love what they do. Highly recommended for education of children of various ages.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "114697395845187932043", "name": "Daniel Stephens", "time": 1505341664159, "rating": 5.0, "text": "Huntsville Christian Academy is an exceptionally amazing school. The individual attention that each child receives is extremely valuable to me as a parent. You can really tell that the teachers love the children and get excited when they succeed and excel in their studies. The volleyball, basketball and other athletic programs are just as good, if not better, than public school. Additionally, the children are encouraged to be respectful, obey their parents and live with integrity. What more could you ask for...?", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "110647012684728898899", "name": "Saul Fitzgerald", "time": 1424099762732, "rating": 5.0, "text": "My son is in his 1st year at Huntsville Christian Academy. The teachers really do a great job of keeping me informed on all of his classes and everything like that. His core courses are good and he also takes art as an elective and really enjoys it. I'm very happy with the school.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "116002341872662978518", "name": "Vanessa Holland", "time": 1396300191905, "rating": 5.0, "text": "I love Huntsville Christian Academy, because they allow my son to work at his own pace. We have tried other private schools and HCA has been the only school that can challenge him academically. The classes are small and the students really look out for one another. Pastor Reggie is a great mentor and is always willing to the take time to help his students and pray with them whenever needed.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "102137991271732428918", "name": "benonai", "time": 1485191667500, "rating": 4.0, "text": "School is great for the price. The Pace format makes it tailorable to individual needs. The atmosphere is good for the kids., and they get a strong, biblical message and instruction as well. As they continue to grow, hopefully more extracurricular will be offered.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "112134165085323540080", "name": "Joshua French", "time": 1426101502509, "rating": 5.0, "text": "I very much like the curriculum here. The school does a good job of instilling a strong Christian learning in their students. The class sizes are nice as well, it doesn't let the kids get lost. Praise God for this school!", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "106974976728860557246", "name": "Marie Glor", "time": 1441049972776, "rating": 5.0, "text": "The positive atmosphere at Huntsville Christian Academy is truly inspiring. My son feels so comfortable and loves going to class everyday. They are doing everything right there, so keep up the good work!", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "116707279910971296921", "name": "Mary McNairy", "time": 1523471347979, "rating": 5.0, "text": "HCA has been a blessing to our family. Our daughter's teacher is wonderful, and the staff is very supportive. Absolutely love it!", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "106864711352567201092", "name": "Thomas Patrick", "time": 1431098319555, "rating": 5.0, "text": "They are serious about instilling discipline and integrity right away. The courses are good, and they actually will take the time to listen to the parents if you have any input on something you think could be done better.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "108635924084678946297", "name": "Katie Harris", "time": 1400254003175, "rating": 5.0, "text": "My daughter is very happy. But what I really like is that she is getting the best education and that's what matters. She will be thanking me later.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "115575135178038828992", "name": "Iris Johnson", "time": 1411150827130, "rating": 5.0, "text": "The BEST place for a child to grow as an individual and as a child of God, through daily chapel. Love how the build character, love for our country, morals and standards where needs to be, creating godly leaders for generations to come.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "100803192768332534137", "name": "XEX archive", "time": 1518126660000, "rating": 5.0, "text": "Hi, im Maddox in 7th currently, I LOVE this school and have been here two years now. I really encourage going to this school.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "116027043720397694974", "name": "Tina Polk", "time": 1447363745363, "rating": 5.0, "text": "While academics are important, so is the love every staff member has for Christ and the students at Huntsville Christian Academy.  The school has a great atmosphere.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "112050126462076021683", "name": "Lashay Amore", "time": 1479777899661, "rating": 5.0, "text": "My nephew attended HCA for four years beginning in the 3rd grade, before relocating to California. From the initial meeting with Pastor Reggie, my family knew this was \"home.\"  My nephew felt immediately comfortable with Pastor Reggie, and we knew he would feel happy and safe here. This was of upmost importance, and HCA did not disappoint.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "107413490365086332014", "name": "Bryan Jennings", "time": 1509851351293, "rating": 5.0, "text": "Im one of the students, and this is probably the best thing that has ever happened to me.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "117213496544206557870", "name": "Faith Williams", "time": 1505921743096, "rating": 5.0, "text": "This place has been nothing but a blessing to our family!! The school has challenged my son and he has rose to the challenge and excelled!!!", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "104641135686480045396", "name": "Milissa Gainey", "time": 1461426172361, "rating": 5.0, "text": "Love!!!!!", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "104313749927466992488", "name": "Max Reese", "time": 1416345314067, "rating": 5.0, "text": "Huntsville Christian Academy is a school where a student can feel safe without peer pressure of being in unwanted groups; therefore, he or she can concentrate on their academics.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "102263245791242472070", "name": "Cam Newton", "time": 1603164486335, "rating": 5.0, "text": "I went here 5 years and it is looking good as the day I left it.", "pics": null, "resp": null, "gmap_id": "0x88891c330f97e457:0xc21c3bed7020fe2d"}
{"user_id": "105009069663296496987", "name": "T “Lady T” CL", "time": 1562534753993, "rating": 3.0, "text": "Descent school", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMpXBtDHBGoSkbmUQ5Zy5BE11hI-k8c3IYOs9sT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNDuJz6GyVHSFH3wQpmAOE-3wF3TrIX_IMl9mM1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMeRvnvtDHtehZyGWGx7INvv6Et1BaN4DC_Our5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOtkWSSAOhezHZ8reI3SVe_Etqxr9RiX-fPS22I=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMcw2ERVM6gLS2VVaFqcb-aG9lXbm1rMWfHKINL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipONg6isw0fESrNtjxruTU0nOB9uWynp3v5TABtD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMe3Kpw7X7dWV2PdbKiKEpy5K_Hwjj9ahLPkulq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNoK1wi1CEEXzaG_QaWWTJAudCX0BDn8DI1ZgyO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPoLlspViUOE7NfyfdR8Ke51Gq4JxJrKRe7V0jU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO78mXqpJ8zaxeOzvdMhFlXljUaAx02E2Qe8_qr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOD2HYVvrUpF57SzszNvpywIiU2XLFLuiaiHYsC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNll_ekjE8onsMoR0Zz1T6Q_9gJ9WSPK9VX1Fp5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNe_f4kIkzdGI-AFtgz-1rp_CUWptAQjytjLBfg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPNwFtIdTbXKVGxcQpFqCkX07Axa6wmDOeNyY1W=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNg5SGNN64ytA2B-dhF8IN7xXErGgYlxBjuP3B1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMr7CGz7nRSY0THBh60uD-1T7EkTyFPccj-p-ra=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOnhuFe5xy0Q09GjH1t8Wr8HhL4AqVltyhg8EVe=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPfOsyF0ztG-DcsXXwvhqpryAzm5ckwvEuspNE5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPV9DlUE_QOMld5tPZgi39bPw-3iakEwuCM9mUt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMuYEIEtOOYqJdgiZ8gOQ9WsrNDPppIRIt1IuJS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP5dwx_DrMZu9wSlutMYm8YBB0pLN7sBiYxFwBv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMfJHRYHR2kStgdL8So3dDAb9T92BCMFietRDjq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMqOCf-0Mb47YvX_fte9kYdX8Sgt04wOnEw-yvU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPo74Ej1CokuY79lH7zJKqef_g3RaVr6XtKP752=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPIviD3MB0qRYv8z_ujhkSXz_PdUdh1Fp-PrVMs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMY533ICFXI5qpsNoSN01uErh8KcudLZMnuz4g3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMF2Cqf03ZeLt7tWikY6cX6nDXoWa9gprt6c9hQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP25xhJu2L_sl8S2fY_L96czC0BAS9-Y7krmUKp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOK8YU8HBBU0p8yMgJ16n7K96EwaV_pAKvwhMZ-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOnnxwsqMSQqPqIJl2nRaIFb5-Hbd8YznvVwBp5=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891c330f97e457:0xc21c3bed7020fe2d"}
{"user_id": "111538694261336554385", "name": "Jeri C Baker", "time": 1582749034159, "rating": 5.0, "text": "The best Elementary school in the Birmingham school system. Teachers who care. You always have one bad apple in the barrel. But keep loving on that person and God will make a change in their life.", "pics": null, "resp": null, "gmap_id": "0x88891c330f97e457:0xc21c3bed7020fe2d"}
{"user_id": "112404580050564050023", "name": "SKYLAR SMITH", "time": 1569509209542, "rating": 5.0, "text": "I went here for 5 years straight amazing teachers and amazing principals they will have children ready and ahead of there game !!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88891c330f97e457:0xc21c3bed7020fe2d"}
{"user_id": "102781154153415021526", "name": "Stinson Twins", "time": 1568938052574, "rating": 5.0, "text": "I still go to school at Princeton  and it is a  great  school", "pics": null, "resp": null, "gmap_id": "0x88891c330f97e457:0xc21c3bed7020fe2d"}
{"user_id": "114093591729555384034", "name": "gabbby B", "time": 1554376012474, "rating": 5.0, "text": "Great School", "pics": null, "resp": null, "gmap_id": "0x88891c330f97e457:0xc21c3bed7020fe2d"}
{"user_id": "104430364901857761233", "name": "Sandy Smith", "time": 1438656296924, "rating": 5.0, "text": "My child loves it", "pics": null, "resp": null, "gmap_id": "0x88891c330f97e457:0xc21c3bed7020fe2d"}
{"user_id": "104912427177748669924", "name": "Serena Jones", "time": 1368696514921, "rating": 5.0, "text": "Awesome school!", "pics": null, "resp": null, "gmap_id": "0x88891c330f97e457:0xc21c3bed7020fe2d"}
{"user_id": "102662366211891945424", "name": "Desminique Rowell", "time": 1532645333534, "rating": 5.0, "text": "Great place for your children. Mrs.Adams and Mrs. Debbie were so sweet to my baby. Kayden fell in love with being around the kids as his first time.", "pics": null, "resp": null, "gmap_id": "0x888cf2e0bd02a041:0x2c146979ede24227"}
{"user_id": "100749967659467766357", "name": "F. Slate", "time": 1537926925579, "rating": 5.0, "text": "I absolutely love the Montessori Learning Center. Ms. Charlotte and Mrs. Amanda are the best teachers you could find for your children. They are so sweet and kind to children and their parents. My son has attended two years now and has learned so much! My son started counted his toys in Spanish last night. They offer one on one learning. They have animals and learn how to take care of a garden in the back. They teach the children the most important facts and truly care about the children. I would recommend The Montessori Learning Center to anyone with daycare age children up to 1st grade. They are wanting to expand to 3rd grade students and I really hope they do.", "pics": null, "resp": null, "gmap_id": "0x8862134da073a3bf:0x87d7f84ae67a656f"}
{"user_id": "109589772433324157073", "name": "Rick Fisher", "time": 1473179120009, "rating": 5.0, "text": "Best place for your child besides home! The staff is wonderful. The method is great! Don't send your children to the horrible government run schools. The individual attention helps every level of child and you can't and won't get that at public/government school.", "pics": null, "resp": null, "gmap_id": "0x8862134da073a3bf:0x87d7f84ae67a656f"}
{"user_id": "102496161002306910888", "name": "M3Studios", "time": 1415833537481, "rating": 1.0, "text": "My 3 year old son went for three months. They kicked him out because they said he was too hard to deal with. They said he may have autism but had no evidence other than \"he was hard to deal with\".  He is now in Premier Preschool in Research Park and is much happier. They help him and have professionals come in and evaluate the children. He is a normal 3 year old boy with no problems. The Montessori Learning Center just did not know how to handle him. They are looking for easy kids to watch so they can sit around and collect checks. Would not recommend them after my experience.\n\nI assume the 5 star ratings you are giving yourself are in response to my review. I am sorry if you do not know how to handle children.\n\nIf you are reading this and looking at schools please don't take convenience into account when choosing a school. I drive across town every day to take my son to Premier Preschool and it is 1000 times better for him.", "pics": null, "resp": null, "gmap_id": "0x8862134da073a3bf:0x87d7f84ae67a656f"}
{"user_id": "111483122094619910905", "name": "Lauren Dauro", "time": 1501862465620, "rating": 5.0, "text": "Fantastic teaching staff with a wonderful curriculum.  The Montessori method is truly amazing - it's impressive to see children teach and learn from each other, just like a family.  They serve healthy snacks and use non-toxic cleaning choices.  I am so glad I chose this preschool!", "pics": null, "resp": null, "gmap_id": "0x8862134da073a3bf:0x87d7f84ae67a656f"}
{"user_id": "105475328010119681209", "name": "PT Dudley", "time": 1406490072261, "rating": 5.0, "text": "My child just graduated from Montessori Learning Center and we just LOVED It!! I can't say enough about the outstanding and professional staff at the school.  My child now is very well prepared for his new school and I would highly recommend the school to parents who want a small private school where your child gets a lot one on one attention, love and care.", "pics": null, "resp": null, "gmap_id": "0x8862134da073a3bf:0x87d7f84ae67a656f"}
{"user_id": "112555036034384766136", "name": "Jacqueline Baldone", "time": 1406564343722, "rating": 5.0, "text": "Both of my children attended Montessori Learning Center.  The teachers were wonderful and kind.  They were well prepared to enter kindergarten.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8862134da073a3bf:0x87d7f84ae67a656f"}
