{"user_id": "112260713015793965381", "name": "Twyla Stallworth", "time": 1625794759198, "rating": 5.0, "text": "Great service got approved with credit score 500....They took the time to help me and was very patient In me picking out my furniture.....Got it delivered for 80 dollars same day....", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMGMKHNsdVwluEE4PdTrL3u_z0bgH2P374zOZ1-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOSeUH-XMJ6A4svnQ8v-yDa-Zn2uCCIQrOkvv-Q=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "112921820443814013523", "name": "Cates Cube", "time": 1621568292538, "rating": 2.0, "text": "Looks like really really cheap furniture even for people on a budget. Kind of like Goodwill furniture. Was located in a run down warehouse which is easy to drive by it without knowing it exists. The samples of the bedroom sets had poor workmanship on the sets so much so if a floor display is not properly constructed what about something that you pay good money for delivered to your home.", "pics": null, "resp": {"time": 1621588295473, "text": "Thank you for bringing this to our attention. We apologize for any inconvenience. Please reach out to the Store Manager at 334-271-9949 to discuss your experience."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "114247221201560287260", "name": "Jovanda Sankey", "time": 1625349079017, "rating": 5.0, "text": "Special thanks to Ojay, Kris and the crew for an awesome job and great customer service. I really appreciate it.", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "110437716463336004335", "name": "leah godwin", "time": 1622897634418, "rating": 4.0, "text": "Nice young man named Chris waited on us....although they did not have what we were looking for in the moment, I would go back and yes id look for Chris again.....good customer service always makes you want to go back!", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "100203364973467066960", "name": "Johnae Anthony", "time": 1616459025189, "rating": 5.0, "text": "A couple of months ago I visited the store the service  was Great, very helpful, quick and easy shopping. Delivery was A+ the guys respected my home and was very professional.  I'll shop there again.", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "106481614607947202489", "name": "JD Ingram", "time": 1625788942972, "rating": 5.0, "text": "Outstanding customer service and excellent prices!", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "113967669625184961391", "name": "Joe Robinson", "time": 1622413167610, "rating": 5.0, "text": "Get customer service, we were able to take our furniture same day .", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "105953617378028271780", "name": "Tamekia Johnson", "time": 1616354951627, "rating": 1.0, "text": "Poor customer service. Prices online do not match prices in store. Ratchet people let you play for furniture and sale it before you can pick up. Do not recommend!!!", "pics": null, "resp": {"time": 1616438688759, "text": "Hello Tamekia, we are sorry to hear about your recent shopping experience. Input about our stores and employees helps improve customer satisfaction and we aim to please. Please call (740)833-6396 so we can put you in direct contact with the Regional Manager of the store location you recently visited. Thank you."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "102280550531962809133", "name": "Cammie Porter", "time": 1616429927573, "rating": 5.0, "text": "Friendly service loved the store oj and nick were SUPER! I’ll definitely be back", "pics": null, "resp": {"time": 1616438399441, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "102641344038015286242", "name": "Nefertiti Lebeaux", "time": 1616362370317, "rating": 5.0, "text": "Found a dresser to match my sons bed online. It matched perfectly and has served its purpose.", "pics": null, "resp": {"time": 1616438525073, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "111720214111408772344", "name": "Mason Miller", "time": 1616248280392, "rating": 1.0, "text": "TERRIBLE CUSTOMER SERVICE! EMPLOYEES ALL TALK ABOUT EACH OTHER INSTEAD OF FINDING A SOLUTION! WILL SELL YOUR PRE-APPROVED FURNITURE YOU HAVE ((PAID))FOR!!!", "pics": null, "resp": {"time": 1616438813137, "text": "Hello Mason, we are sorry to hear about your recent shopping experience. Input about our stores and employees helps improve customer satisfaction and we aim to please. Please call (740)833-6396 so we can put you in direct contact with the Regional Manager of the store location you recently visited. Thank you."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "104451436958127661904", "name": "David Hixon", "time": 1604998222084, "rating": 1.0, "text": "Their place was so disorganized when we went in July. I couldn't tell if it was purposeful or not. The price stickers were put on the wrong beds, so you're like, \"oh what an amazing deal.\" Then you get a salesman over and he's like, \"oh that price is for these\" pointing to some shoddy mattresses, they wouldn't make a convict sleep on. We got out of there immediately. Prices aren't that much better than Amazon and on Amazon there's no question on pricing or a awkward experience to be had.", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "106830616258219972461", "name": "Love It", "time": 1617023571711, "rating": 1.0, "text": "Overrated prices for fake wood the wall paper on the dresser pealed off when u touch put they want top dollar it not worth it unless u buy furniture every year this ur store if u want something to last years to come this not ur place to go this stuff form China", "pics": null, "resp": {"time": 1619633362906, "text": "Hello Love it, we are sorry to hear about your recent shopping experience. Input about our stores and employees helps improve customer satisfaction and we aim to please. Please call (740)833-6396 so we can put you in direct contact with the Regional Manager of the store location you recently visited. Thank you."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "116922950804319657437", "name": "Peter Fannin", "time": 1625845771944, "rating": 2.0, "text": "Gave me the wrong sofa one brown and other one black", "pics": null, "resp": {"time": 1625928527988, "text": "We apologize for any inconvenience. Please reach out to the Store Manager at 334-271-9949 to discuss your experience."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "105248331782630788073", "name": "Chandra LeBeaux", "time": 1614291100340, "rating": 5.0, "text": "The Manager was very helpful and I was very satisfied with my purchase", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "117501216890675168238", "name": "Mason Miller", "time": 1616173598969, "rating": 1.0, "text": "Very Terrible Service Will Sell Your Furniture. All the employees call each other slow. Bad Business", "pics": null, "resp": {"time": 1616238951304, "text": "Hello Mason, we are sorry to hear about your recent shopping experience. Input about our stores and employees helps improve customer satisfaction and we aim to please. Please call (740)833-6396 so we can put you in direct contact with the Regional Manager of the store location you recently visited. Thank you."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "108360205504012786440", "name": "Allison G", "time": 1592349052470, "rating": 1.0, "text": "I purchased a mattress last Tuesday they said it would be in that Wednesday, so instead of making another trip I went ahead and paid for it they told me they would hold it as long as they needed to until I got there to pick up the mattress. I called up there they told me the mattress was there I told them I couldn’t pick it up that day because of the weather. So my boyfriend went Thursday to get the mattress and they had sold it after I had ALREADY PAID FOR IT. Called back today and they told me it would be 2 weeks before another one would come in. Never once did they offer to make it right or offer me a different mattress. Spoke with the supervisor about the incident he said he would call them and call me back, 5 days later and 3 messages and still no response from him.", "pics": null, "resp": {"time": 1592838933431, "text": "We are sorry to hear you are having troubles with your purchase and would like to help as best we can. Please call 1-866-388-6333 so we can put you in direct contact with the Regional Manager of the store location you purchased from.\n\nThank you."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "102641716218738457659", "name": "Shawniya", "time": 1626386470245, "rating": 3.0, "text": "Good selection.", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "115691804177158651700", "name": "Bertha Dozier", "time": 1593917146451, "rating": 1.0, "text": "LONG POST ALERT\n\nI ordered a king size bedroom set and was told it would be arriving in 3 1/2 weeks.   The week of delivery I received a phone call from Miguel stating the bedroom set had arrived minus the dresser and mirror.   He went on to say that another set that was similar to the one I ordered was available.   I told him I would come in the store to look at it.  I ordered a grey bedroom. The one that was available was black.   Two different colors.   Told them I would take the one that I ordered and wait for the dresser and mirror.   Day of pick up, load the headboard, footboard and chest.  They tried to get me to sign the paperwork accepting delivery.   Refused because I was missing 2 nightstands and the rails.   They found the rails but no nightstands.   Was told the missing items were in the Mobile store.   I was promised that I would receive the items early Saturday. It's now 9:45 pm and still no delivery.   I have sat at home all day waiting on a non existent delivery.  Not a good way to conduct business.", "pics": null, "resp": {"time": 1594046319215, "text": "Hello Bertha,\n\nWe are sorry to hear about any troubles receiving your purchase as expected and would like to help as best we can. Please call 1-866-388-6333 so we can put you in direct contact with the Vice President of the store location you purchased from.\n\nThank you."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "110760795524067133755", "name": "Alexis Boyd", "time": 1595440210226, "rating": 2.0, "text": "The furniture I received itself is fine . Customer service is horrible. I had to call and remind them about my delivery. When they did deliver , They delivered my bed late at around 6 pm and said they had to return the truck by 7 so they will come back tomorrow to put it together. Never came back. I called to remind them , the young man said they would come after they made deliveries. Never showed up or called so I just put it together myself .", "pics": null, "resp": {"time": 1595510309763, "text": "Hello Alexis,\n\nWe are sorry to hear about your recent shopping experience.  Input about our stores and employees helps improve customer satisfaction and we aim to please. If you have a specific complaint or compliment, please call 1-866-388-6333 so we can put you in direct contact with the Regional Manager of the store location you recently visited.\n\nThank you."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "100351436104355645013", "name": "jason eldridge", "time": 1594646397440, "rating": 1.0, "text": "The prices look great, however the furniture is junk!\nNot to mention if you don't pay this off before the 3 month mark you'll accrue a \"leasing fee \", that's double the amount you paid for the furniture. Don't be fooled by these guys!!", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "107946385339033465054", "name": "Darrell Lebeaux", "time": 1616359441715, "rating": 5.0, "text": "Very professional and quality service.", "pics": null, "resp": {"time": 1616438554652, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "117086256824869985904", "name": "Kia Sneed", "time": 1611878538942, "rating": 1.0, "text": "Terrible customer service, double charged for furniture, also charged for some other various items and never received. DONT SHOP THERE!", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "103930819422884904962", "name": "Beverly Howard", "time": 1627865591709, "rating": 4.0, "text": "The workers was very friendly", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "112139293031305382053", "name": "jada agee", "time": 1578178046459, "rating": 5.0, "text": "service was amazing, william was an excellent guy who helped from start to finish. the set up guy was amazing and very much understanding and reasonable to our needs. i would highly recommend this to others.", "pics": null, "resp": {"time": 1578329154429, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "116121309191687631267", "name": "johnny", "time": 1596390768643, "rating": 1.0, "text": "Time was wasted. I did get my refund back. However, they sold me something that was out of stock. Next day to come pick up my merchandise they said they didn’t have it. Another guy said there’s 5 in stock but not in the warehouse. So I requested a refund. Told a co-worker about the issue and he said that happened to him as well. I’d triple check everything before you buy with their Inventory system base and for them to check before purchasing.", "pics": null, "resp": {"time": 1596467613801, "text": "We are sorry to hear about your recent shopping experience.  Input about our stores and employees helps improve customer satisfaction and we aim to please. If you have a specific complaint or compliment, please call 1-866-388-6333 so we can put you in direct contact with the Regional Manager of the store location you recently visited.\n\nThank you."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "109910568403221514995", "name": "Whitney Carter", "time": 1596330153936, "rating": 1.0, "text": "I had an horrible experience with the manager (Ojay) very rude and unprofessional!!!! I had to get a refund due to a delay in delivery which I had to way a well for because Ojay was on vacation. My reason for waiting was because She used her personal cash app to to take my order over the phone i went to American Freight once to try to receive my refund when I got there everyone act lost as if they had no clue how what was going on or how to refund due to the cash app. I then waited that following Monday for Ojay to call me like she said for my refund and of course no call. I waited later that Monday and called for them to tell me that “Ojay said that i will have to let money go back to her card to pay be since it was cash app... I told the workers that it was fine i just wanted my refund. Still no apology or anything just a run around . I finally called the store today to speak with Ojay where i was put on hold for more than 20 min which made me go to the Montgomery location. When i got in the store i spoke with a guy and told him my reason for coming, he went to the back got Ojay and when she came to the from she never even addressed me just continued her phone conversation and talking to her team. Needless to say I finally got my refund after about 30 min. Ojay was very rude and NEVER even offered an apology!!!! Poor customer service", "pics": null, "resp": {"time": 1596468071437, "text": "We are sorry to hear about your recent shopping experience.  Input about our stores and employees helps improve customer satisfaction and we aim to please. If you have a specific complaint or compliment, please call 1-866-388-6333 so we can put you in direct contact with the Regional Manager of the store location you recently visited.\n\nThank you."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "112719079708358955398", "name": "G. Taylor", "time": 1596754597400, "rating": 1.0, "text": "Horrible customer service and very untimely. They lie about delivery dates and times until the answer becomes “I don’t know”. I will not be purchasing anything else from this company.", "pics": null, "resp": {"time": 1597066625676, "text": "We are sorry to hear about any troubles receiving your purchase as expected and would like to help as best we can. Please call 1-866-388-6333 so we can put you in direct contact with the Regional Manager of the store location you purchased from.\n\nThank you."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "107588735166786834995", "name": "Pretty BlueBird", "time": 1611888304946, "rating": 1.0, "text": "With \" Warehouse \" as a part of the name one would assume that you're getting cheaper than retail, but that is not true. The furniture is not well made. Cheap quality.", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "107202250300224884989", "name": "Eric Lee", "time": 1576714008127, "rating": 5.0, "text": "THIS PLACE IS THE BEST. THEY WORKED WITH ME AND THEY WERE VERY NICE. . if you want a great deal come here and talk to OJ. SHE IS THE ONE I WILL TALK TO WHEN I COME BACK. AND I WILL BE BACK. JUST GOT FURNITURE FOR MY LIVING ROOM. I AM WELL PLEASE", "pics": null, "resp": {"time": 1576763893861, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "105728658244725247073", "name": "MR. Truth", "time": 1620083719916, "rating": 4.0, "text": "Chris was helpful", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "105065963181830006431", "name": "Lisa Lipson", "time": 1616861643893, "rating": 4.0, "text": "I got everything you need", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "110074716269967313038", "name": "Mary Middleton", "time": 1510351740001, "rating": 5.0, "text": "Went with a friend to find her a recliner. The people there are very polite and helpful. Also very good prices. I will be going back to get me a king size mattress set for only $589, and its not a cheap made, its a memory foam. By the way my friend found a recliner for less than $400. Love this store!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "102839473138799376791", "name": "shanice hayes", "time": 1590881015567, "rating": 1.0, "text": "Spent three hours in the store just to get a mattress and headboard got home rails didn’t match the bed and the box frame was already broken not a good experience", "pics": null, "resp": {"time": 1591030656618, "text": "Hello Shanice,\n\nWe are sorry to hear you are having troubles with your purchase and would like to help as best we can. Please call 1-866-388-6333 so we can put you in direct contact with the Vice President of the store location you purchased from.\n\nThank you."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "102287942459035984281", "name": "Mike Jones", "time": 1452913115743, "rating": 5.0, "text": "I have been doing business with American Freight for over 2 years now. I haven't had any complaints with them at all. My experience with all of them has been great. I especially want to recognize Rodney, he is super sweet to his customers and goes above and beyond his duty to help you with your purchase. I would recommend American Freight to any one in need of new furniture. I will continue to give them my business, as long as there is a need for furniture in my home. Thanks, for such wonderful service from all of you at \"AF\".", "pics": null, "resp": {"time": 1453153194535, "text": "We're so happy you continue to come back to us, Mike! We hope you continue to choose AF, we greatly appreciate your patronage!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "108145551728652488428", "name": "Melissa Wooten", "time": 1564529471659, "rating": 5.0, "text": "Wiley was awesome!! The process was quick and easy and the staff was very friendly! I definitely recommend", "pics": null, "resp": {"time": 1564574315231, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "101977308534558765548", "name": "Josh Yates", "time": 1494701832553, "rating": 3.0, "text": "Overall, I'm satisfied with my purchase at the Montgomery, Alabama location.  Management was very good.  Prices seemed to be excellent.  Quality seemed to be excellent.  Selection was very good.  The -2 star is because of my delivery.  I paid $75 cash for delivery, which is fine.  But, after all my furniture was placed inside my apartment and the delivery men left, I failed to check to make sure everything was delivered correctly.  The next day I open the box that contained my headboard and it was the wrong size and color.  Management had a new headboard delivered to me, but the delivery man refused to take back the incorrect headboard because he said, \"I don't have the paper.\", so I took the headboard back to the American Freight warehouse.\n\nWithin the next few days, I opened the mirror to my dresser and it was the wrong color.  I took the mirror back to the American Freight warehouse and management swapped it out for me.  In the end, I happy with my furniture but it appears my $75 delivery cost was wasted on my end due to the driving back and forth a few times to fix a few mistakes the delivery men made with my purchase.  Before the delivery men leave your location, double check your furniture.", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "117161491047100686746", "name": "Hollewood45", "time": 1614291199975, "rating": 5.0, "text": "Always a friendly environment great. Had a big misunderstanding about when the furniture I ordered will be in even though I was assured that it will be in about four weeks. After a few phone calls and no furniture I decided to pay them a visit. The store manager Rodney went above and beyond to make sure that I got my furniture the following week. Was shock to find out the he actually drove 2 hours to get my furniture. Even though it took a week later I appreciate him going out his way. Will definitely be shopping here again.", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "108844097314006610103", "name": "Amber Grahsm", "time": 1592362056869, "rating": 1.0, "text": "Bought a bedroom suite and mattress and box spring box spring was no good had the bedroom suite for 3 weeks and already need a new boxspring happened to get my receipt out come to find out the box spring was 98 dollars that’s why it’s no good it’s cheap not pleased with service at all", "pics": null, "resp": {"time": 1592413879809, "text": "Hello Amber,\n\nWe are sorry to hear you are having troubles with your purchase and would like to help as best we can. Please call 1-866-388-6333 so we can put you in direct contact with the Vice President of the store location you purchased from.\n\nThank you."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "106332894342491748159", "name": "Ashley Cook", "time": 1554837242709, "rating": 3.0, "text": "I purchased a bed and mattress. The bed head board and footboard was grey and the side rails were cherry oak (the color I ordered). Delivery is very slow, best to pick up yourself and check the material before you leave. This is my last time dealing with them.", "pics": null, "resp": {"time": 1554897968420, "text": "Hello Ashley,\n\nWe are sorry to hear about any troubles receiving your purchase as expected and would like to help as best we can. Please call 1-866-884-6178 so we can put you in direct contact with the Vice President of the store location you purchased from.\n\nThank you."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "105585101799402940808", "name": "Tammy Driver", "time": 1460916941899, "rating": 5.0, "text": "Service and prices were excellent. They welcomed us when we entered and gave us all the details to everything we purchased. Great prices and service. If you are looking for furniture, reasonable prices and great service. I highly recommend them.", "pics": null, "resp": {"time": 1461010484460, "text": "Thanks for your review, Tammy! We appreciate your recommendation!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "108656114887095974288", "name": "Phan Vong", "time": 1570508214941, "rating": 1.0, "text": "I came here and bought a bed, but when I got home, the shop would show up just like I saw it. I needed to pay more than $ 500 with no value.I’m so mad", "pics": null, "resp": {"time": 1570624234684, "text": "Hello,\n\nWe are sorry to hear you are having troubles with your purchase and would like to help as best we can. Please call 1-866-884-6178 so we can put you in direct contact with the Vice President of the store location you purchased from.\n\nThank you."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "114910706560528224594", "name": "Sydney Smallwood", "time": 1451419255010, "rating": 5.0, "text": "I really liked this place. We were greeted by Eric immediately. We found everything we were looking for plus some. Prices were very reasonable. Some of the lowest prices in town. I would definitely use them again. Same day delivery is a bonus.", "pics": null, "resp": {"time": 1451943145051, "text": "We're so glad Eric was helpful and that you were able to find what you were looking for, Sydney! Hope to see you for all your future furniture needs!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "112115253408676971605", "name": "Latonya Dupree", "time": 1449271896597, "rating": 5.0, "text": "I really enjoyed the service I received at American Freight. The employees assist me with picking out my dinette set. They was well spoken and helpful. I highly recommend  this furniture to anyone that's looking for affordable  furniture while receiving excellent  service. Something you rarely find these days.", "pics": null, "resp": {"time": 1449514466940, "text": "Latonya, thank you so much for your kind words, which is something you rarely find on the internet these days! We appreciate it, and hope to see you again for any of your future furniture needs."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "117616215562628105574", "name": "Lora Clark-Schumacher", "time": 1506290649087, "rating": 5.0, "text": "What a wonderful first-time experience at American Freight Furniture. The young lady that helped me was super sweet and so helpful. I'll be back soon to pick up the mattress and box springs I ordered for my son. And hopefully they'll get in some living room furniture colors that I will like.", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "100431665375370050816", "name": "Delisha Newsome", "time": 1568060181107, "rating": 5.0, "text": "I love America Freight store you get good price deals.", "pics": null, "resp": {"time": 1568116530467, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "108191432423334086804", "name": "Kori Anderson", "time": 1528757259272, "rating": 1.0, "text": "DO NOT BUY FROM AMERICAN FREIGHT IN MONTGOMERY! They are very unprofessional and unorganized. We bought basically a whole house worth of furniture, when it was time for delivery they informed us that our sectional was not in stock and that it’ll be in stock in 2 weeks and that they’ll deliver it out to us with no delivery fee but we could still get our bedroom suite that we ordered.\nIncident #1: On delivery day I had to call and ask what time would the furniture be in because we were out running errands. They forgot to put our furniture on the truck and the delivery people had to come back and get it🙄 (I’m sure if I had not called I would not have known)\nIncident #2:Two weeks later, which was on yesterday (Sunday) at around 12pm I called and spoke with OJay and asked was our furniture in. She told me yes(why didn’t they call?) and that they can deliver it out same day. Okay cool. She then called back and said that we didn’t pay all of our delivery fee which in fact when they delivered our furniture the first time my boyfriend gave them the delivery free PLUS A TIP. She then told me that it was okay and that they would take care of it. Later that day, at 4pm, I called again just checking to see what time they would be coming. The guy I spoke with asked would I be okay with getting it delivered first thing Monday morning. Uhh no. (My problem with this was WHY DIDN’T ANYBODY CALL, I would be okay if they had the common courtesy to inform me of any issues instead of me having to call them.) The guy told me my furniture should be at my house no later than 10:45AM(I didn’t know how if they opened at 11am) I asked was he sure and he said yes.\nSO THIS MORNING MY FURNITURE WAS NOT AT MY HOUSE AT 10:45! I called promptly AT 11am and spoke w/ the manger Rodney and he informed me that a driver was on the way to get my furniture to deliver it. If my furniture was not able to be at my house at 10:45AM they should have communicated that with me. I received my furniture at 12pm after all the mess I had to go through. I appreciate it if you guys would be more professional with your customers and communicated more with your drivers. I should not have to go through this hassle of getting furniture delivered and I WILL NOT shop with you guys again. Have a good day!!", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "104377343889313114160", "name": "Kaelaa Waelaaa", "time": 1564529481279, "rating": 5.0, "text": "Amazing service , the guy Wiley was so HELPFUL explained things to the T", "pics": null, "resp": {"time": 1564574312248, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "113422923339531008940", "name": "Chelsea Vance", "time": 1449947373525, "rating": 5.0, "text": "I had an amazing experience. There were prices that were unbelievable. They delivered my things and moved it in the same day that I brought it at a very reasonable price. The store was in Montgomery, AL and I live in Selma, AL! I didn't think they would deliver that far.", "pics": null, "resp": {"time": 1450116175067, "text": "We're so happy you had an amazing experience, Chelsea! Thank you for your review!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "102902713599046561176", "name": "Aulisha Fields", "time": 1545417913709, "rating": 1.0, "text": "I purchased 2 bedroom suits September 6 and here it is December I have yet to receive it. It went from it’ll be here in two weeks to oh we will call when it comes. No one never called me or anything. This place should really get SHUT DOWN!!! Prior to this on last year I got a BLACK bedroom set from them they sent out brown items with the black set. Smh! I walked in on yesterday for my refund and I’m just hoping it pops up on my account tomorrow. Cause I will take legal actions!!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "114064156056528925112", "name": "Glennetta Davis", "time": 1458951311516, "rating": 5.0, "text": "My experience at American Freight was awesome.  My sales  lady  Brittany  was very  knowledgeable and stayed with us through the whole  process.  The manager  on duty Rodney  was able to assist  with closing the deal. It was a great  experience  and we will\nbe back.", "pics": null, "resp": {"time": 1459959858791, "text": "We're so happy you had such a great experience! Thank you for your review, Glennetta!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "116934078240169976347", "name": "Ramona Washington", "time": 1442336982110, "rating": 5.0, "text": "This was my first visit to American Fright Furniture and I just had to let the world know, if you haven't tried them for your home needs, you must!\n\nI went in with a budget of $500.00 dollars. The service attendant (Eric), greeted me and my family with a smile and asked if he could help? I explained to him what we were looking for; he helped us and we were able to leave with all of our home needs and more.\nThanks\nWe will be back!", "pics": null, "resp": {"time": 1443030981165, "text": "We're so happy to hear you found what you were looking for within your price range, Ramona! Thank you for shopping with us!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "104668575038868021660", "name": "Rachel Bu", "time": 1517792431691, "rating": 1.0, "text": "TL/DR: furniture took more than 2 months to arrive, company was no help over the phone, leather sectional arrived with corner scuffed. DO NOT RECOMMEND.\n\nFull story: I shopped at American Freight on Black Friday 2017 with high expectations after reading these reviews. And the experience in the store was fine. No pressure to buy, but a helpful staff answering any questions my husband or I had. We bought a sectional and ottoman set we liked even though they weren't available for delivery for 2-3 weeks. We were fine with the delay and left looking forward to it arriving in a few weeks (more time to find homes for our old stuff).\n\nThat's when the trouble started. Fast forward 4 weeks, no sectional and no call/news at all. I call the store and was told that my purchase wasn't on the truck as expected, but they would be calling other stores to see of they had it and we should hear something the next week.\n\nLife was busy so I didn't check again for another 3 weeks. This time when I called I was told they didn't know why, but it was on back order. But it would for sure be in the next week. I again expressed by hope that it would arrive as I very much looked forward to using my furniture.\n\n2 weeks later, no furniture.  At this point, 2 months after purchasing the furniture and as my husband and I are both active duty military and didn't have the time to go to deal with it, my mother-in-law visited the store on a Friday. She made a bit of a scene stating the facts in front of other customers, and wouldn't you know it our sectional and ottoman arrived on rush order the following Monday. Corners were scuffed in some areas, and a few tears from packing staples, but at that point we were so glad to have the furniture  and tired of dealing with the company that we accepted it anyway. I will never shop there again  and highly recommend you don't either.", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "100325564783345001707", "name": "Wes Stigsell", "time": 1471780980169, "rating": 2.0, "text": "We decided to shop here due to the great reviews and the quality furniture and a great prices . However the great reviews must be only for furniture that they have in stock. The couch and love seat we really liked was not in stock and we were told it would be two weeks until our furniture would arrive This was 15th of July. It even said August 1st on the sales receipt.  Two weeks go by and we heard nothing. We called American Freight and we were told that they don't have a date that the truck will show up it will just show up one day. Three weeks out we had heard nothing and we're told it would take 2 to 4 weeks. At this point we would of asked for a refund and shopped somewhere else but their policy states you can get a refund after 4 weeks from purchase.  Now four weeks arrives still no furniture still no date a truck will arrive.  We call on Monday with all intentions to ask for a refund and were told there is a truck and the Manger will be in on Thursday for us to get a refund. Thursday comes no phone call from American Freight we call on Friday and we're told oh your couch is here. Alot of effort on our part to find the status on our order. So after 4 weeks and several days of a family of 5 sitting on the floor since we just moved to Montgomery we have our couch and love seat. When we picked them up we told them we were still in the market for furniture and we were told to come back and they will give us a good deal for being so patient  well why not give us a deal while we were there. We won't be back.\nGoing back to the day we purchased the furniture the couch and love seat we wanted they actually had in the back but it was already sold to a customer who was waiting for it to be delivered some sales people were telling our sales person to just give us that one but we would not do that to someone else. So it puts into question did our furniture arrive weeks ago and they sold it to someone else it's possible especially since they could never give us a date our furniture would arrive.\nWe do like the furniture but if you shop here and they don't have it in stock BEWARE you will never know when you will get it.", "pics": null, "resp": {"time": 1471896687656, "text": "We do apologize for the inconvenience, Wes. If there's anything we can do to rectify the situation, feel free to send us an email to social@ameircanfreight.us. Thanks!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "117471425651249582778", "name": "Angela Bowie", "time": 1454884657412, "rating": 5.0, "text": "I had a really fantastic experience. This was my very first time visiting and Mr.Gary made it very painless. I would definitely recommend this store to my friends...p.s. Gary had me like.\"Jodi...please believe me!😁", "pics": null, "resp": {"time": 1454964292699, "text": "We're so happy you had such a fantastic experience! We appreciate your review and recommendation, Angela!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "107649388390626610469", "name": "Sarena Smith", "time": 1438287194444, "rating": 4.0, "text": "I was in need of a couch and I was new to the area and I came in to American Freight to look around and the employees were very helpful in helping me pick out the couch I wanted.  They delivered my furniture in a timely manner.  I was very pleased with the company.", "pics": null, "resp": {"time": 1438890785103, "text": "We're so happy to hear you are pleased with your experience! Thank you for shopping with us, Sarena!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "117587921626378510685", "name": "R. McGee", "time": 1452198435812, "rating": 5.0, "text": "Good clean furniture and nice service. Jay was welconing, Julia very knowledgeable and Gary very warm and fun... Good inventory and great prices!", "pics": null, "resp": {"time": 1452279978786, "text": "Thanks for your review!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "110075781785838391776", "name": "Quinterria Rowe", "time": 1459635897050, "rating": 5.0, "text": "Rodney did an exceptional job assisting me. He provide great customer service. I would definitely recommend anyone to shop there.", "pics": null, "resp": {"time": 1459961440854, "text": "We're so happy Rodney did such an exceptional job! Thank you for your review, Quinterria!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "111745598723248225151", "name": "Chris Pomeroy", "time": 1449874712739, "rating": 5.0, "text": "Loved the customer service! Quick, easy, and great prices! I would absolutely recommend American Freight to all of my friends! Ou guys are the bomb and thank you for my free lamp!!!", "pics": null, "resp": {"time": 1450116230220, "text": "Thank you for your recommendation, Chris! We appreciate it!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "114421644915975514454", "name": "Almeter Thompson", "time": 1459526658041, "rating": 5.0, "text": "My experience at America Freight of Montgomery was the best. The sales clerk was professional and very helpful. Thanks for helping pick the best couch and loves eat for my house.", "pics": null, "resp": {"time": 1459961412466, "text": "Thank you for your review, Almeter! We hope you love your new furniture!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "107207491612253124351", "name": "REE Carden", "time": 1459019877501, "rating": 5.0, "text": "Go see Eric at American Freight! He is Awesome! Knows what he is talking about, supper nice, and beautiful smile:) Great Prices God Bless", "pics": null, "resp": {"time": 1459959998383, "text": "Thank you for your review, REE!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "100698124641560501833", "name": "Dustin Watson", "time": 1538669738694, "rating": 1.0, "text": "By far the worst place to buy furniture. They will lie to your face and tell you the furniture will be there in 2 weeks. I ordered mine almost 2 months ago. Decided to go and get my refund and now they keep on giving me some lame excuse everytime or go up there (the times they tell me too). Im still waiting on my money. Save some time and money and go somewhere else. The hassel and unprofessionalism isnt worth it. I honestly have no idea how they are still in business", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "103358693590288354705", "name": "Steven Jemison", "time": 1453307394750, "rating": 5.0, "text": "I walked in and was greeted like the president of the United States. I was assisted and got exactly what I wanted with an even better deal than I could have imagined. Thx", "pics": null, "resp": {"time": 1453492068266, "text": "We're so glad you found exactly what you wanted, Stoney!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "105382462152125390036", "name": "Kaneshia Sellers", "time": 1454957470534, "rating": 5.0, "text": "American freight is the best furniture. They have great customer service and nice furniture. I would recommend all my family and friends to shop here.", "pics": null, "resp": {"time": 1454964328518, "text": "Thanks for your review, Kaneshia! We appreciate your recommendation!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "105341797276604918692", "name": "Evania Palacio", "time": 1459713139450, "rating": 5.0, "text": "American freight is the best. The service is great and the furniture is of good quality. I would recommend American freight for all your furniture.", "pics": null, "resp": {"time": 1459961456272, "text": "Thank you for your review, Evania! We appreciate your recommendation!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "101596808467337799932", "name": "Lisa Malone", "time": 1434394020341, "rating": 1.0, "text": "The worst customer service ever.  The employees did not even acknowledge my existence.  So I went down the road and received excellent service from a competitor.  Definitely will not be stepping foot in this store again.", "pics": null, "resp": {"time": 1436378052979, "text": "Hi Lisa - This is not the type of customer service we would have wanted you to receive and understand your frustration. We truly appreciate your feedback and have shared it with upper management to be reviewed and addressed."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "111193772100177281031", "name": "Glenda Harris", "time": 1500047052330, "rating": 1.0, "text": "Words along can't tell how I feel right now about this company and the warranty they sell you. All I can do is Bless them and pray for them and forgive.  I learn my listen.", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "113785867528857202786", "name": "Leo Da Lion", "time": 1444346690974, "rating": 5.0, "text": "The service was great, I will most definitely be shopping here agin. Shots out to Julia and her co workers for making this experience fun.", "pics": null, "resp": {"time": 1444683362669, "text": "Thank you for shopping with us and leaving a review, Leo! We're happy to hear Julia and the team made your experience a great one!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "109207535005931211948", "name": "tina kine", "time": 1459035976681, "rating": 5.0, "text": "This furniture company is A1 or in other words extra AWSOME I  would recommend it to anyone. They also have great specials!!", "pics": null, "resp": {"time": 1459960013456, "text": "Thank you for your review, Tina! We appreciate your recommendation!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "114949215704179869851", "name": "Kee", "time": 1459799306304, "rating": 5.0, "text": "Oh this place is great...... The young men and women there have good customer service skills. ...Love it!!!", "pics": null, "resp": {"time": 1459961469723, "text": "Thank you for your review, Lakisha!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "103930884181695059364", "name": "Pumpkin Bryant", "time": 1565755151329, "rating": 1.0, "text": "Worse time ever i would not recommend this place for anyone very unprofessional", "pics": null, "resp": {"time": 1565783904708, "text": "Hello,\n\nWe are sorry to hear about your recent shopping experience.  Input about our stores and employees helps improve customer satisfaction and we aim to please. If you have a specific complaint or compliment, please call 1-866-884-6178 so we can put you in direct contact with the Vice President of the store location you recently visited.\n\nThank you."}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "100283103864778772299", "name": "Carla Muhammad", "time": 1438008977462, "rating": 4.0, "text": "Great Service. I only wish payments can be done over the phone or online because I live almost 2hrs away. Anyway, thanks RODNEY and GORDON! See you all again soon!", "pics": null, "resp": {"time": 1438105257326, "text": "Hi Iman - We're happy to hear Rodney and Gordon took great care of you and appreciate your feedback on layaway! Thank you for leaving us a review!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "109105589843051223243", "name": "Wendy Gortney", "time": 1474926764014, "rating": 5.0, "text": "Beautiful furniture, great prices and excellent service.. Will definitely be back!!!", "pics": null, "resp": {"time": 1475243058193, "text": "Thanks for your review, Wendy!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "114838963034473304271", "name": "Kendra Rolle", "time": 1449855037041, "rating": 5.0, "text": "We love u brittaney!. Thanks for all the help. The store has great and colorful stuff!. Great prices!!!", "pics": null, "resp": {"time": 1449856011947, "text": "We love YOU, Kendra! Thanks for leaving a review!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "111131328588148162535", "name": "Anthony Stojak", "time": 1474998909488, "rating": 5.0, "text": "First visit went exceptiionally well.  Brittney met us at the door. Took us immediately to see item we wanted and stayed with us through whole proces of purchase.\nWill definitely shop at this store again when we need more furniture", "pics": null, "resp": {"time": 1475243064480, "text": "Thanks for your review, Anthony!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "102299805169198008369", "name": "London Doll", "time": 1474404668960, "rating": 5.0, "text": "BEST PLACE TO BUY FURNITURE IN MONTGOMERY THERE PRICES ARE VERY REANSONABLE . HUGE SELECTION TO CHOICE FROM", "pics": null, "resp": {"time": 1474642634825, "text": "Thanks for your review, Julie!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "109809275761215592926", "name": "Amoree Brackins", "time": 1460499269689, "rating": 5.0, "text": "Rodney was great and worked with us to see what would meet our needs for a bedroom set. We'll definitely be back for our furnishing needs!", "pics": null, "resp": {"time": 1461010417507, "text": "Thanks for your review, Amoree! We're so happy Rodney was so great!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "113514791159394486606", "name": "Annette Pearsall", "time": 1448135417953, "rating": 5.0, "text": "The salesperson was very helpful. They have a wide variety of items to choose from. Very good experience", "pics": null, "resp": {"time": 1448295277310, "text": "That's wonderful to hear, Annette!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "115213782734298570830", "name": "Keenetha Birge", "time": 1508202923541, "rating": 4.0, "text": "Helpful,  knowledgeable staff,  good selection and if not in stock they'll get it.", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "114391650617284521938", "name": "Haily Jane", "time": 1452214327201, "rating": 5.0, "text": "Customer Service was awesome, Eric was very helpful and patient. Prices were reasonable & they had a wide selection of furniture options!", "pics": null, "resp": {"time": 1452279996187, "text": "We're so happy Eric was so helpful! Thanks for your review, Haily!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "114914237734729753885", "name": "Ronak Patel", "time": 1458066724399, "rating": 5.0, "text": "American fright is a great store. Nice people. I love it.", "pics": null, "resp": {"time": 1458330864521, "text": "Thanks for your review, Ronak!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "116230789051169230865", "name": "Sylver Hooks", "time": 1482734678476, "rating": 2.0, "text": "A few months ago, my husband and I purchased a dinette set from this location. When it was delivered, the delivery guy Preston had noticed they sent the wrong chairs but I had noticed the box with the table looked as if it had fallen off of the truck or dropped from a distance. After bringing in the table, they left and came back with the correct chairs. After putting together the chairs, I opened the box containing the table and it had indeed been dropped. It was well after store hours at this point but I still called the delivery guy with my issues. The next morning at 11 sharp, I got a call from the owner. Like he has obviously done before, apologized for it and said that he's send another out by the end of the day. TWO DAYS later, the table finally arrived. They opened the box to make sure that nothing is busted up and I was very pleased with the way it was handled. I was so pleased that we decided to order two more chairs from them. We were told that it took 2 weeks for the chairs to arrive. It was November 27th and we needed them before Christmas. Before they ordered the chairs, we had to pay and that wasn't an issue for us. We paid the full balance of nearly $180 for two Madrid. counter height chairs. Two weeks go by and no chairs. I was told that the truck hasn't come in but I'll definitely have them before Christmas. December 22nd, I gave them another call and I was told that I could pick them up the next day. I was overjoyed to hear that. On the 23rd I got a call from the manager telling me to not come because they wasn't there and he didn't want me to ride there for nothing. He said that he was just have them delivered when they came in. The delivery guy Preston brought to our home at 6pm that night. He told me that they were in a different box because they opened it to make sure that they sent the right chairs because of what happened the first time. Trusting his words, i signed for it then took them upstairs myself. I placed them in a closet, grabbed my things and left home until Saturday night. Christmas morning I pulled out the box, opened it and removed all of its contents. I then took the box to the dumpster. When I returned, I settled myself down to begin assembling the chairs only to find that the chairs HAD ONCE BEEN ASSEMBLED. There were marks on the chairs, the screws were stripped and rusty. and the floor protectors were very worn. There were also four screws missing as well. There were hand smudges all over the wood. There was nothing about those chairs that said NEW. In complete disbelief that Rodney the store manager for charge me full price for two chairs off the showroom floor then have me wait nearly a month to receive them made me a bit irate. Without thinking, I called the store on Christmas morning. After realizing, I messaged the delivery asking for the cell number of the manager and I've yet to receive an response. So as a result, I feel it's very necessary to be waiting in the parking lot with two unassemble Madrid counter height chairs and several questions that gonna require an answer as well as a solution. Until this, I thought very highly of American Freight and its coworkers. Now it's BUYERS BEWARE... there's a reason they say that all sales are finals. For me, I don't want my money back because I do want the chairs. I just want what I paid for and I DID NOT pay for recycled chairs", "pics": null, "resp": {"time": 1483030131860, "text": "We're very sorry to hear this happened to you, Sylver. If there's anything we can do for you, feel free to email us at social@americanfreight.us. Thanks!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "110736619758529634387", "name": "Kids' Videos", "time": 1508753643519, "rating": 5.0, "text": "They have a nice selection and cheaper prices compared to other stores.", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "114562436719694124083", "name": "Darline Jones", "time": 1517871204821, "rating": 1.0, "text": "HORRIBLE FURNITURE! We got a sectional back on August 6th of 2017. As soon as we unwrapped it, one side was already broken. We called and asked for a replacement. Our replacement took almost two months to come in. Beginning of October the other side slowly started breaking apart. Springs were coming out and eventually the whole bottom fell onto the floor. We called and asked for a replacement in October. We just got the new replacement in yesterday. Which they never called my husband and told him... It is already falling apart!!!! After sitting on it two times! The expensive warranty does not cover anything other than spills and tares. It does not cover anything structural about the furniture... This furniture is only for looks not for actual use!", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "102592763860856574132", "name": "Elba Solano Cordoba", "time": 1453486681686, "rating": 5.0, "text": "I love that the salesman here are very sweet and nice i do have my favorite which is rodney i go to him for almost all my furniture!  I always come back because of there deals they have here plus i get free stuff", "pics": null, "resp": {"time": 1453492367847, "text": "We're so happy you keep coming back to us, Elba! Please continue to do so!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "111744977725848929873", "name": "Tiffany G", "time": 1460413321265, "rating": 5.0, "text": "I had the best experience withall of the staff. They were so friendly and helpful.", "pics": null, "resp": {"time": 1461010400057, "text": "Thanks for your review, Tiffany!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "100838410678856448024", "name": "Morgan Dale", "time": 1460236519382, "rating": 5.0, "text": "Excellent service and great prices. Will definitely recommend.", "pics": null, "resp": {"time": 1460406411241, "text": "Thanks for your review, Morgan! We appreciate your recommendation!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "109784906002474406846", "name": "Kristie Davis", "time": 1460233808371, "rating": 5.0, "text": "Great Service and we found a beautiful Soda sectional. and customers service was wonderful.", "pics": null, "resp": {"time": 1460406384746, "text": "Thanks for your review, Kristie!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "104447213566090513816", "name": "Nisha Robinson", "time": 1454614834440, "rating": 5.0, "text": "This furniture warehouse is great! Shout out to Rodney for being a good saleperson.", "pics": null, "resp": {"time": 1454702866250, "text": "Thanks, Nishw! I'll let Rodney know!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "113478874623239968735", "name": "Jared Stewart", "time": 1449963452052, "rating": 5.0, "text": "Great service and prices.  Julia Gunn was extremely helpful and patient during our mattress search.", "pics": null, "resp": {"time": 1450115924021, "text": "We're so happy Julia was so helpful! Thanks for your review, Jared!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "102655655028842173414", "name": "Celita Ware-Thomas", "time": 1452646788365, "rating": 5.0, "text": "I love the people ! They are super nice. I would definitely shop there again.", "pics": null, "resp": {"time": 1452876980001, "text": "Thanks, Celita! We appreciate your review!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "102482589065915945104", "name": "Janice Dixon", "time": 1449941549996, "rating": 5.0, "text": "Fast friendly service and price of items. Love it!", "pics": null, "resp": {"time": 1450116193960, "text": "That's great, Janice!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "105813370043676540808", "name": "Ashley Martin", "time": 1464554836439, "rating": 5.0, "text": "My experience here was the best . And they had wonderful service and very good deals.", "pics": null, "resp": {"time": 1464729256861, "text": "Thanks for your review, Ashley!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "116395925918036879891", "name": "Mary Smith", "time": 1464285232616, "rating": 5.0, "text": "Excellent and speedy service. Very friendly staff and great music vibe!!", "pics": null, "resp": {"time": 1463766457545, "text": "Thanks for your review, Mary!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "103084788797107539532", "name": "Kristina Hill", "time": 1456616825403, "rating": 5.0, "text": "It was a great experience. Very helpful and excellent customer service", "pics": null, "resp": {"time": 1456847993477, "text": "Thanks for your review, Kristina!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "111994838786003455171", "name": "Barbara Bailey", "time": 1459809638929, "rating": 5.0, "text": "I really enjoyed the service everyone were very friendly. I have told my family about the service.", "pics": null, "resp": {"time": 1459961484766, "text": "Thank you for your review, Barbara! Thanks for spreading the good news!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "116360874868288180729", "name": "Derrick Paschal", "time": 1459374485539, "rating": 5.0, "text": "Awesome experience at American freight recommend this to all my friends much better prices and customer service than other places definitely will be back", "pics": null, "resp": {"time": 1459961183135, "text": "Thank you for your review, Derrick! We appreciate your recommendation!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "102937592061917750345", "name": "Candy Lockamy", "time": 1458942659494, "rating": 5.0, "text": "Gordon and Brittney were so helpful. Great Experience!", "pics": null, "resp": {"time": 1459959484996, "text": "We're so happy Gordon and Brittney were so helpful! Thank you for your review, Candy!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "106979149559681703193", "name": "BYRDIE Yeah", "time": 1462456067468, "rating": 2.0, "text": "My eldery mother and i were just there yesterday looking at some furniture and i did\nNot like our experience there at all. The salesman who served us had these real long dreadlocks and his salesmanship skills were the pits...he did not sale my mom and i what we wanted, what we liked nor did he offer to\nShow us anything decent that would also fit\nIn our budget. Yes thats right he never showed us anything on sale nor did he bother to ask what our spending limit was so he know what to work with. Instead he just showed us around the store that highlighted\nThe furniture with the 699 and up prices.\nWe spotted a black leather sofa that had 398 price tag on it, sat on it to try it out, and as we began to show insterest in it and began discussing to each other about maybe we should get this or not. Thats when the salesman kinda brushed us away from the actual sofa set that we were sitting on that was 398 and started reverting us back toward that 699 plus tax sofa set. Smh thats not the sofa set we wanted or was discussing.we felt that the salesman wasnt offering us what we wanted but yet offer us what he wanted us to buy.....and we are the customers...its our money not his....we felt like our wants were disreguarded so we decided to check another store, told the guy we were gonna check somewhere else also before we decide. Asked him for a bussiness card and of course he didnt want to give us one and by him doing so gave us even more reason to be absolutely sure that we dont want to shop there now.\nSo as we started to walk out the door the guy then decided to offer us a deal on a sofa set\n...A BETTER PRICE is what he said so im like oh ok he wants to work a deal on the actual leather sofa we were sitting on with the 398 price tax. So im like ok turn around and ask what are you offering...he reply...600 right now walk out..we refused and left and went somewhere else because once agin the guy was still attempting to sale us what he wanted us to buy rather than what we the customer wanted to spend our money on...", "pics": null, "resp": {"time": 1462553897247, "text": "Hi Byrdie, I am so sorry to hear that you had this experience. I'd like to help make this situation right. If you would, could you send me an email to social@americanfreight.us? Thanks!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "108721010000056084904", "name": "Charity Thompson", "time": 1460065173280, "rating": 5.0, "text": "RODNEY WAS A AWESOME SALESMAN...I WILL BE BACK.", "pics": null, "resp": {"time": 1460134795148, "text": "We look forward to seeing you again, Charity! Thanks for your review!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "118292323420374088494", "name": "Cade Wood", "time": 1450638913977, "rating": 5.0, "text": "Julie and Eric are the best ever. Go see them for your furniture needs.", "pics": null, "resp": {"time": 1450729786962, "text": "We're so happy Julie and Eric were the best! Thanks, Tyrone!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "118438760912371730415", "name": "Grant Purvis", "time": 1451677776199, "rating": 5.0, "text": "Very helpful and knowledgable staff. Excellent customer service", "pics": null, "resp": {"time": 1451943160734, "text": "Thank you, Grant!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "116490400619455834006", "name": "N Smith", "time": 1455140642082, "rating": 5.0, "text": "My experience was great customer service was excellent everyone had a smiling face!", "pics": null, "resp": {"time": 1455312336741, "text": "We're so happy you had a great experience, Nikia!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "103769324125959727124", "name": "lois hays", "time": 1449004293914, "rating": 5.0, "text": "Luv it and the price.Julia and Rodney so helpful and attentitive ro my needs.", "pics": null, "resp": {"time": 1449244023317, "text": "We're so glad to here Julia and Rodney were so helpful, Lois! Hope to see you back again soon!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "116634556880325666718", "name": "Randall Robinson", "time": 1452981970645, "rating": 5.0, "text": "Fast service straight to the point financing.. love it", "pics": null, "resp": {"time": 1453153207928, "text": "Thanks, Randall!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "100548354353083874401", "name": "Rhonda Richardson", "time": 1450896039548, "rating": 5.0, "text": "The customer service was great! Rodney was very nice and helpful!", "pics": null, "resp": {"time": 1451335029881, "text": "We're so glad Rodney was so helpful, Rhonda! Thanks for your review!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "113957554429574055393", "name": "martin ashley", "time": 1464555081945, "rating": 5.0, "text": "This place is the best they have wonderful service and very good deals", "pics": null, "resp": {"time": 1464729296029, "text": "Thanks for your review, Martin!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "113917984522257129030", "name": "Justina Mcelrarh", "time": 1459465964154, "rating": 5.0, "text": "I bought my couch and sofa today with the help of jullian. He was amazing he helped me make the beat decision.", "pics": null, "resp": {"time": 1459961395397, "text": "Thank you for your review, Justina!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "100715794040655452921", "name": "chucky moore", "time": 1450978608331, "rating": 5.0, "text": "JULLIAN Has good customer service I can recommend him.", "pics": null, "resp": {"time": 1451335044320, "text": "We appreciate your recommendation, Chucky!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "114197874824738815370", "name": "Andra Williams", "time": 1452379401152, "rating": 5.0, "text": "Our experience with Rodney  was excellent we will definitely buy here again", "pics": null, "resp": {"time": 1452546034633, "text": "We're so glad Rodney provided you a great experience! We look forward to seeing you again!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "110179224667719555991", "name": "Damian Lewis", "time": 1463143332403, "rating": 5.0, "text": "Rodney was awesome we got what we came for everything went smoothly. We will be back for the next move!!!!!", "pics": null, "resp": {"time": 1463167827655, "text": "Thanks for your review, Damian! We look forward to seeing you again!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "106259384443868058626", "name": "Leann Marion", "time": 1454175700904, "rating": 5.0, "text": "We just purchased a mattress and dresser at the montgomery location.  Gary our salesman was friendly, helpful and very easy to work with.", "pics": null, "resp": {"time": 1454360883744, "text": "That's great, Leann! Thanks for your review!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "118246955925247717672", "name": "L Gee", "time": 1460837076939, "rating": 5.0, "text": "Rodney is the best! Very professional and friendly service!", "pics": null, "resp": {"time": 1461010447506, "text": "(Translated by Google) Thanks for your review, Levette!\n\n(Original)\nThanks for your review, Levette!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "118190069025310510540", "name": "Corey Day", "time": 1455226902690, "rating": 5.0, "text": "Brittney in Montgomery, AL was an excellent salesperson! She was very patient and helpful!", "pics": null, "resp": {"time": 1455312356855, "text": "We're so happy Brittney was so patient and helpful, Corey! Thanks!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "103102430239953307005", "name": "Miranda Lewis", "time": 1474750721013, "rating": 5.0, "text": "Great customer service with Brittney! Many furniture options and pricings.", "pics": null, "resp": {"time": 1474902789176, "text": "Thanks for your review, Miranda!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "106686792864180639447", "name": "Ethan Colley", "time": 1448228125135, "rating": 5.0, "text": "Great service and a great selection for the perfect price.", "pics": null, "resp": {"time": 1448295259164, "text": "Thanks for sharing a review, Ethan!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "103529591084493388983", "name": "Greg Walters", "time": 1460843178487, "rating": 5.0, "text": "Great service.  Fast and easy to deal with.", "pics": null, "resp": {"time": 1461010459014, "text": "Thanks for your review, Greg!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "102289239718939143498", "name": "Richie Goodson", "time": 1538263837917, "rating": 1.0, "text": "Will not be buying from this establishment. Walked in and browsed for 20 minutes, passed employees and never once received a greeting from any individual. Will take my business elsewhere.", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "107485938857466285551", "name": "Garitza Antonetti", "time": 1448641896067, "rating": 5.0, "text": "They have great customer service and  aproachable atmosphere! I'll be back for the rest of my furniture!", "pics": null, "resp": {"time": 1448906871690, "text": "Thanks, Garitza! We look forward to seeing you again soon!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "108303098754896073359", "name": "channing Allen", "time": 1450735818907, "rating": 5.0, "text": "Rodney is absolutely the most ridiculously awesome manager out there!!!", "pics": null, "resp": {"time": 1451335010046, "text": "You're the most ridiculously awesome customer out there, Channing! Thanks for your review!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "108198211783544258700", "name": "Robert Smith", "time": 1441819969918, "rating": 5.0, "text": "Great service. Affordable prices!", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "109318284998365758952", "name": "Shawanda Jenkins", "time": 1519379783453, "rating": 1.0, "text": "Please be aware.....Wish I had read the reviews before entering American Freight doors.It has been 4 weeks no furniture.First it will be here in 2 weeks...I had to call them.Person on the phone it's here.Next day we go yo pick it up,Only half is their,another 2 weeks before the other half arrive,me in the process of moving just keep it until the entire purchase arrive.Will give me time to get things moved around .2 weeks go by go to American Freight to get my furniture that is paid in full....Nothing.Nada....not even the half that I was told was there.I try not to discredit local,business....American Freight is a horrible business.Here is your warning .Stay away.", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "117216812303294660231", "name": "Adreana Thomas", "time": 1441386079076, "rating": 5.0, "text": "i had great service and quality shopping with brittney.....THANKS", "pics": null, "resp": {"time": 1441733587845, "text": "Thank you for your review, Adreana!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "108139283803043439577", "name": "Rebecca", "time": 1464463956814, "rating": 5.0, "text": "Chris is an awesome salesman, and I look forward to future purchases!", "pics": null, "resp": {"time": 1464729274815, "text": "Thanks for your review, Rebecca! We look forward to seeing you again soon!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "111068468996417374787", "name": "Eugene Collier", "time": 1449433623633, "rating": 5.0, "text": "Great customer service great prices", "pics": null, "resp": {"time": 1449514388739, "text": "Thanks, Eugene! You're great!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "112866627836911361464", "name": "Deidrenee Williams", "time": 1460235401128, "rating": 5.0, "text": "Service was great...Romney was very professional and nice.", "pics": null, "resp": {"time": 1460406396202, "text": "Thanks for your review, Deidrenee!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "117678707516386575638", "name": "cory johnson", "time": 1494012073001, "rating": 1.0, "text": "Horrible service took us over two months to get what we ordered", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "108960503783524589785", "name": "Jakeeta Hall", "time": 1519352667921, "rating": 1.0, "text": "Would never buy from these people ever again", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "102176819119348023273", "name": "Gabrielle Pritchett", "time": 1452621290306, "rating": 5.0, "text": "Great prices, and also great service", "pics": null, "resp": {"time": 1452876936731, "text": "Thanks, Gabrielle!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "102615025777345906011", "name": "Herman Abbey", "time": 1454777868754, "rating": 5.0, "text": "Great Customer Service and prices", "pics": null, "resp": {"time": 1454964222182, "text": "Thanks Herman!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "109870975680430842170", "name": "brandon singleton", "time": 1463945699597, "rating": 5.0, "text": "Excellent service!, come here to get your furniture!!", "pics": null, "resp": {"time": 1464031144988, "text": "Thanks for your review, Brandon!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "102894006458990398747", "name": "Dueronica Harrington", "time": 1451595008158, "rating": 5.0, "text": "Excellent customer service! Quality furniture!", "pics": null, "resp": {"time": 1451943153147, "text": "Thanks, Dueronica!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "101091300866764204780", "name": "Destiny Neal", "time": 1460823467589, "rating": 5.0, "text": "Great service today and very helpful from Rodney", "pics": null, "resp": {"time": 1461010438903, "text": "Thanks for your review, Destiny!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "114007866576535696923", "name": "Beverly Byrts", "time": 1452378189122, "rating": 5.0, "text": "I love Jay. He was great.", "pics": null, "resp": {"time": 1452546012208, "text": "We love Jay too! Thanks for your review, Beverly!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "103195288808958271840", "name": "Jesus Coloa", "time": 1450132518152, "rating": 5.0, "text": "Awesome service. That's it.", "pics": null, "resp": {"time": 1450454031154, "text": "Thank you, Jesus!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "117837025044590067064", "name": "Debra Rumph", "time": 1459375915106, "rating": 5.0, "text": "Always seen this place on TV but I never new that everything they advertised was true had no intentions of coming here until I was treated so unfairly at rooms to go very unprofessional and disrespectful there came here to better prices and get customer service  Rodney was great and professional", "pics": null, "resp": {"time": 1459961246686, "text": "Debra, we're so happy you decided to stop in and check American Freight out! Thank you for your review!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "111493900178792500382", "name": "Sammie Phelan", "time": 1453586028872, "rating": 5.0, "text": "Great customer service Britt", "pics": null, "resp": {"time": 1453753100750, "text": "Thanks, Sammie!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "117963216586035668018", "name": "Chase Fulford", "time": 1463266039752, "rating": 5.0, "text": "Great customer service, and great deals!", "pics": null, "resp": {"time": 1463425146320, "text": "Thanks for your review, Chase!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "116112687021726093585", "name": "Sash hsaS", "time": 1492965091575, "rating": 5.0, "text": "Great deals available", "pics": null, "resp": null, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "112127011575053161746", "name": "rosetta brock", "time": 1464382168924, "rating": 5.0, "text": "Shop soon shop early, enjoy", "pics": null, "resp": {"time": 1464729249065, "text": "Thanks for your review, Rosetta!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "111128211823435178994", "name": "Corine Dunaway", "time": 1450481674427, "rating": 5.0, "text": "The associates were very friendly and they assisted me very much", "pics": null, "resp": {"time": 1450729768592, "text": "We're so happy our associates were so helpful for you!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "116304214875311084877", "name": "Teresa Chisholm", "time": 1455139928050, "rating": 5.0, "text": "Love it customer service was awesome", "pics": null, "resp": {"time": 1455312321425, "text": "Thanks for your review, Teresa!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "117691163180881817266", "name": "Ed Hicks", "time": 1459622739122, "rating": 5.0, "text": "Excellent service from Julian.", "pics": null, "resp": {"time": 1459961419196, "text": "Thank you for your review, Ed!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "101561186978660553638", "name": "Lamar Jackson", "time": 1448335001463, "rating": 2.0, "text": "Seems like s bad idea.", "pics": null, "resp": {"time": 1448906881682, "text": "Why do you say that, Lamar?"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "101173212250546629037", "name": "Bertha Baker", "time": 1460670686902, "rating": 5.0, "text": "Good experience with Eric and Rodney", "pics": null, "resp": {"time": 1461010426702, "text": "Thanks for your review, Bertha!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "101314356527591106708", "name": "David Mann", "time": 1454108473668, "rating": 5.0, "text": "Awesome service Eric!", "pics": null, "resp": {"time": 1454360890563, "text": "Thanks, David!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "110421189814143184771", "name": "Regina Moses", "time": 1463267928310, "rating": 5.0, "text": "Good customer service", "pics": null, "resp": {"time": 1463425152806, "text": "Thanks for your review, Regina!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "117392310698424747333", "name": "Saira Mateo", "time": 1448069688182, "rating": 5.0, "text": "very good service 👍👍👍👍", "pics": null, "resp": {"time": 1448295345350, "text": "Thank you, Saira!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "101112719201907462889", "name": "Donna Bozeman", "time": 1470564362960, "rating": 5.0, "text": "Love the stuffs", "pics": null, "resp": {"time": 1470679933765, "text": "Thanks for your review, Donna!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "111380986300124177878", "name": "Alice Jenkins", "time": 1465155953035, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1465246117894, "text": "Thanks Alice!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "110387764091870196435", "name": "Nikki Coleman", "time": 1459812265634, "rating": 5.0, "text": "Great prices", "pics": null, "resp": {"time": 1459961490298, "text": "Thank you for your review, Nikki!"}, "gmap_id": "0x888c2bce410ad21f:0xb1653e3c3ad41741"}
{"user_id": "111193636858711076692", "name": "Kayla Tillman", "time": 1613594162572, "rating": 5.0, "text": "I've been shopping for a couple new mattress sets trying to find the best deal. Went to several places and was about to give up and just break the bank, until I saw Alabama Overstock in Hartselle. Chris Moore, the owner helped me find the right mattress to fit my preferences. The money spent was a fraction of the other stores I went to. They carried the cooling bamboo pillows, cooling mattress protector, and sheet sets. Highly recommend them for your home furnishings and mattress needs!", "pics": null, "resp": null, "gmap_id": "0x88882bbd2ce67267:0x942e36ac2946410f"}
{"user_id": "105666305968026165423", "name": "Teri Watson", "time": 1591310722145, "rating": 5.0, "text": "Great mattress store! Go see Chris Moore!", "pics": null, "resp": null, "gmap_id": "0x88882bbd2ce67267:0x942e36ac2946410f"}
{"user_id": "101583054406505936506", "name": "Cheri Sellers", "time": 1532040557744, "rating": 5.0, "text": "We LOVE Alabama Overstock!!! They are very friendly and helpful and have great quality furniture and mattresses! We’ve bought a mattress and box springs, a master bedroom suite and bedroom furniture and mattress for our teenage son! Can’t beat their prices  for the quality anywhere!", "pics": null, "resp": {"time": 1533957792765, "text": "Thank you for your business and we hope you enjoy your bedroom group for years to come."}, "gmap_id": "0x88882bbd2ce67267:0x942e36ac2946410f"}
{"user_id": "106610256349089378172", "name": "chris pike", "time": 1532042306604, "rating": 5.0, "text": "Great products, prices and service.\nIf you need furniture or mattress go by and see them. It will be well worth your time.", "pics": null, "resp": {"time": 1533957758531, "text": "Thank you"}, "gmap_id": "0x88882bbd2ce67267:0x942e36ac2946410f"}
{"user_id": "108939639516184364459", "name": "Anthony Bradford", "time": 1532040831592, "rating": 5.0, "text": "If you are in need of furniture this is the place to go. Chris and his staff are awesome and very knowledgeable of the products they sale. Easy to work with on purchases.", "pics": null, "resp": {"time": 1537271419946, "text": "Thank you and we appreciate your business."}, "gmap_id": "0x88882bbd2ce67267:0x942e36ac2946410f"}
{"user_id": "118007570016659814508", "name": "Demaris Johnson", "time": 1591293098133, "rating": 5.0, "text": "Very nice people to buy from", "pics": null, "resp": null, "gmap_id": "0x88882bbd2ce67267:0x942e36ac2946410f"}
{"user_id": "114772866502597071008", "name": "Anna Boger", "time": 1532040539741, "rating": 5.0, "text": "I’ve bought several mattress here always great quality and great service!", "pics": null, "resp": {"time": 1533957838766, "text": "Thank you for your business and we hope you are still enjoying your mattresses. Call us anytime if we can ever be of service to you."}, "gmap_id": "0x88882bbd2ce67267:0x942e36ac2946410f"}
{"user_id": "107457191681754866952", "name": "Krissi Harpel", "time": 1615079865019, "rating": 1.0, "text": "All the reviews were great so I was excited to get started with this company.  Their representative came to the house and brought a contractor, I was told it would take about a week to generate an estimate of materials.  During that week I sent some colors I liked and a couple of questions and I was not getting any response from the designer .  Once the week was up I sent an email to the designer and told her I needed someone who was going to be responsive to emails .  She immediately responded saying that she could not get my cabinets to meet our timeline and I would have to find someone else ...which if she had paid attention I had asked for an estimate on painting and replacing .  I then left a message for someone from management. to call me and got no response.  Very very disappointing", "pics": null, "resp": {"time": 1615218145501, "text": "I spoke with Krissi and explained a few items to her concerning her project and attempted to assist her with her project even though Coastal is not performing the project.  Hopefully this will help.  We do not paint cabinets and recommend under normal conditions that this not be done.  Typically, a paint job will have to repeated in the near term due to underlying issues with cabinets themselves."}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "114603038191907151231", "name": "Hilton Perry", "time": 1573564502962, "rating": 5.0, "text": "For many months my wife and I  have wanted to remodel our bath but finding some one that was knowledgeable and and responsive was impossible and had almost given up. A friend told us to call  Coastal Kitchen & Bath and with in just a few days we were set up to meet and go over what we wanted and measure. The next week we were picking out the flooring, cabinets and fixtures we wanted. Today we have the bath that we had visioned for moths. Very responsive and courteous.", "pics": null, "resp": {"time": 1573573023136, "text": "Thanks for the review.  It can be amazing what a kitchen remodel can do for the appearance of your home and your piece of mind."}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "108897730871088696735", "name": "Chelsie Sotero", "time": 1574281502709, "rating": 5.0, "text": "I have had the pleasure of working with Jill here and she is a delight! This company should be proud to have her as an employee. She is very knowledgeable, helpful and very friendly. I will tell everyone I know to make sure to stop in!!!", "pics": null, "resp": {"time": 1574288926555, "text": "you're going to love your new mud room"}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "104699544827960283655", "name": "me to you", "time": 1574134170180, "rating": 5.0, "text": "The lady, Jill, was very helpful.  If you go there you have to order what you see on display.  Ordering means a 3 or 4 week delay.  They have a variety of everything related to the bathroom.  My apologies because I did not take photos.\n\nMy contractor wants it yesterday. Seems the stuff is never there fast enough for them. They want to go to Lowe's, pick it up, and install it the same day.", "pics": null, "resp": {"time": 1574200935354, "text": "Thanks for the opportunity.  We do not keep cabinets in stock since there are so many options, sizes and colors.  Unfortunately, contractors can experience delays and then want everything yesterday, like you said."}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "110753572483752767778", "name": "Shawn Taylor", "time": 1621512617423, "rating": 5.0, "text": "Great food", "pics": null, "resp": {"time": 1621515947484, "text": "Thanks for the great review on food...we'll take the 5 star review but don't serve food.  :)"}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "100457384833095958705", "name": "Mike Tate", "time": 1573486255221, "rating": 5.0, "text": "Everything turned out GREAT!  The few minor issues were promptly taken care of and the project was completed on time! Love it!", "pics": null, "resp": {"time": 1573490094987, "text": "Sometimes a kitchen remodel becomes an art and not a science but we stick with the job until you're happy."}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "108822151236828360941", "name": "Julie Bertolla", "time": 1573693040936, "rating": 5.0, "text": "I had a fantastic experience with my recent remodel. Jill is very knowledgeable and went above and beyond to make sure I was happy.", "pics": null, "resp": {"time": 1573745174151, "text": "Great to hear.  I hope you enjoy your new cabinets and kitchen remodel"}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "115691192153731140332", "name": "Michael Leserra", "time": 1612144898853, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": {"time": 1612189232773, "text": "Thanks for the review.  Hopefully we can assist with your kitchen remodeling project."}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "110614324176303234809", "name": "April Morris", "time": 1573243616765, "rating": 5.0, "text": "Awesome job on our kitchen counters! Defiantly recommend for quality work!", "pics": null, "resp": {"time": 1573247783868, "text": "you can't go wrong with granite counter tops, easy close cabinet doors and drawers and a tile back splash"}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "103643447602756643677", "name": "justin hamilton", "time": 1573241937157, "rating": 5.0, "text": "Top notch service and quality.  They're certified designer was a great help", "pics": null, "resp": {"time": 1573246504933, "text": "Impact windows are a great replacement to protect against storms"}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "109286991881960179651", "name": "Alla Nikitina", "time": 1619699391885, "rating": 1.0, "text": "Out of business", "pics": null, "resp": {"time": 1619704017274, "text": "Actually, we are not out of business.  We have a new location that we are working on opening up after the Hurricane Sally destruction to our old building but we have been working from remote locations since Sally.  Our website, Facebook page, Pinterest, Google My Business page, etc. all reflect we are open for business and have been open for business.  Our phone number is active as well so feel free to contact us if you have a project you are interested in us quoting for you.  251-943-5358."}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "108864938595675145850", "name": "ted croft", "time": 1567218518238, "rating": 1.0, "text": "They dont stand behind their products! Bought a marble vanity top and they installed two sinks (undermount) and the silicone bled through to the surface of the top and stained it where the silicone was applied for the sinks. The top is ruined! After sending pics Mike told me to call the manufacturer of the silicone to get it fixed or remedied. What terrible customer service. Good thing he sold the company!", "pics": null, "resp": {"time": 1567608529770, "text": "Ted is correct, the business has been sold to the owner of Folkers Window Company.  The marble vanity top Ted purchased was a old remnant from the warehouse and was \"sold as is\" for a very cheap price.  Unfortunately with remnants and very low prices, these things happen.  This was communicated to the customer at the time of the sale.  The best way to avoid issues with products and expired warranties is to purchase new products instead of remnants."}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "103433390816042629995", "name": "Anisha Penton", "time": 1573243082367, "rating": 5.0, "text": "Amazing company to work with! Very friendly, knowledgeable and helpful staff.", "pics": null, "resp": {"time": 1573247620965, "text": "Great choice with Silestone quartz counter tops"}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "117979887436607881612", "name": "Gayle Patterson", "time": 1573670732299, "rating": 5.0, "text": "Jill Kinard is very knowledgeable and helpful.", "pics": null, "resp": {"time": 1573674860598, "text": "Thanks much.  Hopefully we can assist with your remodeling project"}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "107308814377170470836", "name": "Cheryl McCoy", "time": 1567735492714, "rating": 4.0, "text": "Good products, pricey", "pics": null, "resp": {"time": 1567789053581, "text": "Thanks for the business and the review.  No, we are not the cheapest because as you said \"good products\".  We do not sell junk and we use professional installers and not sub contractors.  In addition, we use stainless steel fasteners, high grade caulks, etc. all which lead to a higher price and a higher quality installation.  Thus, we will typically not be the cheapest...but we're the best."}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "104917469339821283557", "name": "Denise Brown", "time": 1624901942930, "rating": 5.0, "text": "Marcus was awesome at helping us with our purchase", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPlvHZzndxiV24ruSkYCkVhwsciTt-2zYuWo75L=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "116476061663449313665", "name": "Camerisa Harris", "time": 1624322988012, "rating": 5.0, "text": "I went into the Helena, AL store and Marcus was really helpful by assisting me with finding exactly what I  was searching for. He also helped me pick out accessories to compliment my sofa and chair. If you are searching for furniture at a reasonable price, go see Marcus in Helena.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "109231535135988551938", "name": "Anquenetta Mcadams", "time": 1625068526840, "rating": 5.0, "text": "Walked in to get my son a bed and mattress, this was not my first time purchasing from A F. I also have my king size bedroom set from them. Excellent customer service, very friendly staff and fast service. Thank you American Freight in Helena.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "102496062556788283447", "name": "KRISSY HIGGINS", "time": 1624758219007, "rating": 1.0, "text": "I ordered furniture at Helena store around end of April 2021. Told furniture would be in May 28. Well May 28 and no furniture. They told me truck does not even deliver until June 9. Finally got order a few days after and it was missing a dresser. I was told it is in Tuscaloosa by mistake. They will go get it. When I get home 1 dresser is damaged. I send pictures to email per Marcus requested. 2 weeks later still no missing dresser or reply about damaged dresser. They tell me that the Forest dale store location has 2 dressers I can go there and get them and bring damage dresser to them. Chasity at Forest dale store is amazing. She was a great help to get this taken care of for me. Although when I get home 1 of the 2 dressers is damaged. Now what? Guess I have to figure how to make defective dresser be ok. I'm not driving a hour back over there for more defective furniture. Never settle for the cheaper price. My granny always said you pay for what you get..", "pics": null, "resp": {"time": 1624957568509, "text": "We apologize for any inconvenience. Please reach out to the Store Manager at 205-624-4444 to discuss  your experience."}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "106714554464290247532", "name": "Gwendolyn Ivy", "time": 1624150801598, "rating": 1.0, "text": "I purchased a sectional for my den and sofa and love seat for my living room. All pieces were supposed to be delivered on 6/19/2021. I was quoted a delivery fee of 175 because it was coming from Tuscaloosa. Well due to the weather, I received a call at 7pm stating my sectional would be delivered between 12-6on 6/20/2021. When I required about my sofa and loveseat...it's not on this delivery. I was informed I would have to pay another delivery fee for something I had no control over. I have been calling the Helena store since 7:02pm and the line has been busy. I am beyond upset and I am not happy.", "pics": null, "resp": {"time": 1624200626487, "text": "We apologize for any inconvenience. Please reach out to the Store Manager at 205-624-4444 to discuss your experience."}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "116017451494380650450", "name": "Emily Conklin", "time": 1622063048254, "rating": 5.0, "text": "Great, friendly service and I'm always immediately greeted as I come through the door! Everyone is very helpful, and the prices are well worth it. Will definitely make them my go-to :)", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "117837465282383304073", "name": "OtterFaceGirl", "time": 1622137685268, "rating": 5.0, "text": "Marcus Reaves is a great store manager who maintains professionalism while offering impeccable customer service. He is extremely knowledgeable on all of the products offered and answered all of my questions thoroughly. I was able to get everything I needed quickly and easily. I will definitely return in the future.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "112450658267257458286", "name": "Jacinta Brock", "time": 1623204005060, "rating": 5.0, "text": "Marcus is the absolute best. I came in to the store with an idea of what I wanted. He lead me in the right direction. He even got all of my items deliverd the same day before closing. Best customer service. I will continue to use him for all my furniture needs.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "103032567195114761478", "name": "Jason Ford", "time": 1618691026289, "rating": 2.0, "text": "Service was great, until they got my signature on everything. We were ASSURED that they can get it on the car and make sure that it wasn't going to move...AT ALL. After I signed for everything, everyone walked away. I had to ask for help to put the mattress on the car and then had to tie it down by myself. Not sure that we will be back for a second experience at this place. Honesty goes a VERY long way with me.", "pics": null, "resp": {"time": 1619634401989, "text": "Hello Jason, we are sorry to hear about your recent shopping experience. Input about our stores and employees helps improve customer satisfaction and we aim to please. Please call (740)833-6396 so we can put you in direct contact with the Regional Manager of the store location you recently visited. Thank you."}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "113085537957630900175", "name": "Latoya Eaton", "time": 1616215973916, "rating": 5.0, "text": "I bought my daughter a bedroom set, and it’s perfect! Marcus was really helpful and knowledgeable in helping us choose the right one for her. He made sure the delivery and setup was on time and efficient. I have told my family and friends if they need furniture to go see Marcus at American Freight in Helena, he’ll take good care of you!", "pics": null, "resp": {"time": 1616238724015, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "111497178210038878039", "name": "Sierra Cordrey", "time": 1623686887484, "rating": 5.0, "text": "Marcus was an absolute pleasure to work with. He assisted me with my financing app as well as any questions I had. If you want great customer service this is the place to come!", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "113269746028471024619", "name": "Phillip Gillen", "time": 1622571055571, "rating": 5.0, "text": "Awesome group to work with. Good prices and quick service! Even loaded everything for me.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "116812293581577348095", "name": "Brittney Young", "time": 1623808989175, "rating": 5.0, "text": "Marcus showed great patience with us all while still handing what he currently had going on. He is awesome and great representation of your company.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "101262870122560435899", "name": "Margaret Parrish", "time": 1623876413783, "rating": 5.0, "text": "Marcus was a tremendous help in choosing a recliner for a friend who was injured in a fall. I will definitely be back again.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "113375195088641014068", "name": "Shaun Thomas", "time": 1623956364722, "rating": 5.0, "text": "The customer service I received at the Helena store was nothing less than exceptional. I would recommend anyone to visit the store.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "114860533627869192958", "name": "Valencia", "time": 1623892037146, "rating": 5.0, "text": "Great experience! Marcus has excellent customer service; helped me with everything I needed!", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "116983506120506590196", "name": "Brooke Hayes", "time": 1623096898087, "rating": 5.0, "text": "Marcus and Xavier were so welcoming and helpful and got us exactly what we wanted ! Thanks guys for such friendly service .", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "108903665045786223538", "name": "cory Johnson", "time": 1625073337642, "rating": 5.0, "text": "Easy process and Marcus was friendly and very knowledgeable.. Highly recommended", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "113064005304333660044", "name": "Webbie Long", "time": 1621966483806, "rating": 5.0, "text": "Best Experience Ever... Marcus was very friendly, helpful and professional... He wouldn’t let me leave unless I was 100% Happy Greatly Appreciated The Service", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "101242960567651308131", "name": "Shamonni Buckhalter", "time": 1620317402192, "rating": 5.0, "text": "The manager Marcus was very helpful! After speaking with the customer service line I was a bit frustrated from the back and forth. However he understood and assisted me best he could & resolved my issue!", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "112790517863221891428", "name": "Corey Wilkins", "time": 1622248008266, "rating": 5.0, "text": "Marcus Reaves was very helpful in our order. He was quiet and he know what he was talking about.  Faster than fast food. Lol.", "pics": null, "resp": {"time": 1622283111480, "text": "Thank you for your feedback on your experience! Hope to see you in the store again soon!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "114323782673037635752", "name": "ashley pleasant", "time": 1622677482518, "rating": 5.0, "text": "I appreciate how patient Mr. Reaves was in helping me find the perfect table! Great quality furniture and people!!!", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "102279810651313722586", "name": "Javion Williams", "time": 1616276059306, "rating": 5.0, "text": "My experience was great! I. I normally visit the Trusville Al location but decided to give the store a try! I can in and found exactly what I wanted Emily Black for my teenage daughter. Can’t wait to get it home and set up! Marcus Reaves, Xavier Winston were 100% helpful. Answered all me questions. My experience was great today so glad I visited this location. Definitely coming back to visit I guys.", "pics": null, "resp": {"time": 1616438732349, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "106827602554754436884", "name": "Michiese Lee", "time": 1621801606516, "rating": 5.0, "text": "Great customer service! Highly recommend this place to buy furniture ask for Marcus reaves.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "100500593824228105811", "name": "Roger Davis", "time": 1621712434752, "rating": 5.0, "text": "Marcus is da man want to talk to for service. He was on top of his game. Very informative and helpful.", "pics": null, "resp": {"time": 1621772628770, "text": "Thank you for your feedback on your experience! Hope to see you in the store again soon!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "114383302650504423537", "name": "Dana Baskin", "time": 1623802361444, "rating": 5.0, "text": "Marcus & Xavier were friendly attentive and very knowledgeable of products and pricing.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "117243885299626629955", "name": "Judy S.", "time": 1624746824102, "rating": 5.0, "text": "Marcus is the Best.  What more can I say.  This is the store I will deal with from now on!", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "109302847077274520693", "name": "Paula Jones", "time": 1621803178298, "rating": 5.0, "text": "Service great by sales representatives Marcus and Xzavier. Great products and merchandise!", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "111778470387652654481", "name": "Angel Carter", "time": 1616801783022, "rating": 5.0, "text": "Marcus was a great help. He was very patient with us and took his time to help us out. Definitely a wonderful manager and awesome people skills.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "105068221768437001187", "name": "janis anderson", "time": 1607130701634, "rating": 5.0, "text": "My husband and I were searching for some good quality furniture. A friend of ours recommended American Freight to us. We came in and saw several items that we were impressed with. We chose a living room set. there was no pressure to buy from Chasity, our salesperson. She was friendly, very knowledgeable and professional. Thanks American Freight in Helena!!!!", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "106433207361028430910", "name": "Shawna Pace", "time": 1621723921913, "rating": 5.0, "text": "Great place!!!  Marcus was nice and sweet and he delivered my furniture like he said!!", "pics": null, "resp": {"time": 1621772591475, "text": "Thank you for your feedback on your experience! Hope to see you in the store again soon!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "105189945218072481838", "name": "Rosie Rainey", "time": 1604546998531, "rating": 5.0, "text": "Kirsten was so polite, with excellent customer service, and so helpful.. I was able to get my king size bed and living suit thanks to her help she was not letting me leave unhappy... Thank You so much!! American Freight has everything your home needs with excellent reasonable prices", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "110407185344962465793", "name": "Terry Menger", "time": 1623350221217, "rating": 5.0, "text": "Great service. Prompt. Courteous.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "113230871625265993987", "name": "Erika Aponte", "time": 1622052238994, "rating": 5.0, "text": "Great experience and helpful service Marcus Chasedy  where a great help !!", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "101709119235749947624", "name": "Jerri Byers", "time": 1623096280729, "rating": 5.0, "text": "Marcus and Xavier were very helpful!  Thank you!", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "110913181981670105495", "name": "Julia Singleton", "time": 1607116138226, "rating": 5.0, "text": "Literally the easiest place to shop for a mattress and furniture. Great staff that did not make you feel pressured to buy anything but gave very helpful information about products. Very well priced", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "117067518872599212336", "name": "Jeremy Blalock", "time": 1613330100641, "rating": 5.0, "text": "Customer service is great...add that with the selection and prices and this place is hard to beat.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "107241315406813340526", "name": "Steven Knestrict", "time": 1601125433799, "rating": 1.0, "text": "BUYER BEWARE: When purchasing love seat and sofa a year ago we were told that the additional $100 protection plan would cover these couches for 5 years of ANY accidents (rips, tears, stains, from kids dogs, cats etc.) And that if any occur our living room set would be replaced. This was the main reason we purchased from this company.\n1 1/2 years later we find out that none of these things are actually covered under the plan.\n\nWe feel we were intentionally misled into paying for a useless service.\n\nDo your business with a company of integrity, but not American Freight of Helena.", "pics": null, "resp": {"time": 1601323778173, "text": "We are sorry to hear you are having troubles with your purchase and would like to help as best we can. Please call 1-866-388-6333 so we can put you in direct contact with the Regional Manager of the store location you purchased from.\n\nThank you."}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "103805784451835544195", "name": "Vivacious Criss", "time": 1593752179000, "rating": 1.0, "text": "I been a customer every since 2019. Back when Cory and delivery man Lorenzo was there. No problems. My husband purchased the Raspberry Bedroom set. He asked Marcus for the complete set. Marcus was too busy inquiring who my husband was buying the bedroom suit for. That he didn't disclose the set only includes one nightstand. Usually a Queen size bed set has two parties. My husband spent $1,333.16, plus $200.00 for delivery. Just to find out there's only one nightstand.  I called Darnell who accuses me of yelling and I can't fix it, if you don't stop. All bets were off when he made the comment that my husband and I should have looked online.  To see what the order details. Voices on both sides got loud, and Darnell laughs and hangs up. So, if you go to a restaurant, you should already know what's on the menu.  I will not be back and I'm telling my family members who shop here too. Don't!!\n\nJust want to inform the Regional Manager that a paid in full Bedroom Set and Set up, plus tip. A paid in full order that was supposed to be delivered all on Tuesday. The Chess part that they didn't have Tuesday 06/30/2020, and MARCUS said would come Wednesday 07/01/2020, the deliveryman told us 8:30p.m. he was still coming. Only not too show up. And my husband and I didn't get to bed until 12:00a.m., and husband had to be at work 5:00 a.m. the next morning. So, we are going on the third day 07/02/2020, waiting on our $200.00 Raspberry chest, just to call all day. The deliverymen arrived 11:20 p.m., threw the chess down, that was paid to be assembled and left. Need I say more.", "pics": null, "resp": {"time": 1593628936592, "text": "We are sorry to hear you are having troubles with your purchase and would like to help as best we can. Please call 1-866-388-6333 so we can put you in direct contact with the Regional Manager of the store location you purchased from.\n\nThank you."}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "101608008923595748468", "name": "Shirley Cunningham", "time": 1593952661124, "rating": 5.0, "text": "I really like the furniture and the quality of service.  Even with the Pandemic they were open and ready to help.  Darnell said that it may take a little longer for some items to g e t it but for me it wasn't a problem.  I will be purchasing again.  I saw a really pretty rug that would match my furniture exactly.  Thanks American Freight. SD.", "pics": null, "resp": {"time": 1594043596237, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "107360909013155508171", "name": "Angie Pilkington", "time": 1624409708261, "rating": 5.0, "text": "Wonderful experience very helpful", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "112490274469881723929", "name": "Willian Benitez", "time": 1611430481797, "rating": 5.0, "text": "Well here you can find really good furniture for accessible prices", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "113429987769492174975", "name": "Hewy NoSleep", "time": 1604270722591, "rating": 5.0, "text": "Great place to grab an affordable piece of furniture if you aren't too picking. Delivery is a good price if you live nearby.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "106604110454666212073", "name": "Whitney Washington", "time": 1622686279044, "rating": 5.0, "text": "They never disappoint me", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "113085219448645604679", "name": "Randilynn Waterhouse", "time": 1608506047289, "rating": 5.0, "text": "Chasity was great!! She was great and made the whole process so easy.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "115801359481444724891", "name": "beth johnson", "time": 1595457693011, "rating": 5.0, "text": "We got a great deal on a set of couches and Kirsten was a huge help with selecting a couch. Great job loading the furniture for us, as well.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "111793162817788710627", "name": "Christina Williamson", "time": 1582750338035, "rating": 5.0, "text": "Definitely had a Great Experience here. Purchase my first set in November and because of the great service, timely delivery. I purchased and set in February. If you go ask for MARCUS, customer service is beyond excellent and assist to customer’s need. Gave him my budget and got everything I needed.", "pics": null, "resp": {"time": 1582819281276, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "109310160055495648372", "name": "Diana Sexton", "time": 1606172138104, "rating": 2.0, "text": "They had terrible delivery service 3  yrs ago, but I gave them a 2nd chance. Nothing has changed. Still terrible. They gave me a 8am-5pm delivery window. At 10am, they called to make sure I was home for delivery. They claimed they had my furniture on the truck for days (I bought it on Friday and they don't deliver on weekends). They said they had been calling me several times. I had 2 missed calls and 1 voicemail (I called back as soon as I got the voicemail). At 1pm, I called to get a status and they said delivery between 12pm-5pm. At 4pm, they called to see if they could deliver. They said they called several times, with messages and a text. 2 calls is not several, 1 voicemail which I returned promptly and no text. Furniture is nice enough, but will never use their delivery again.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "111500421607931351413", "name": "Sharon Lancaster", "time": 1600531559695, "rating": 5.0, "text": "Marcus was very kind and efficient in knowing the product he was saleing.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "111991086754889001149", "name": "rashauna carter", "time": 1597967725416, "rating": 5.0, "text": "I must say the staff at the Helena location were amazing. Specifically Darnell and Xavier. I had visited the trussville location and found the item I wanted wasnt in stock but was in Helena. Once I arrived, I found that I had been misinformed by Trussville and the sectional I wanted did not include the ottman as described by other location. After explaining to the Helena staff that I had incurred extra expense making arrangements for pick up and traveled 40min out of the way only to find out item was not sold as a set they went over and beyond to make it right. Xavier helped me find something in place of sectional I was so set on and a matching recliner all under the price of the one sofa I would have left with having to pay additional for ottoman. I came in frustrated and left with a smile. Darnell went the extra mile to accommodate the inconvenience and gained a customer for life. If ever in the market for furniature give these gentlemen a visit and know you will be well taken care of. Thanks guys!", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "118097712607175457860", "name": "Steven Debrow", "time": 1605989949952, "rating": 5.0, "text": "Chasity is the REAL DEAL!!!!!! This is my 2nd time coming to the Helena location and both times I was BEYOND satisfied with the service!!!!", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "114438931530821255554", "name": "Tracy Coyne", "time": 1578070128260, "rating": 5.0, "text": "Really surprised at how much furniture is in this store! We replaced a mattress at a terrific price and the staff was helpful and friendly loading it on my roof rack. Will definitely be back!", "pics": null, "resp": {"time": 1578082938185, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "107562532562424154738", "name": "Makeisha Yancey", "time": 1607209396239, "rating": 1.0, "text": "They delivered my furniture 11 o’clock at night to deliver The two guys that delivered my furniture took a straight razor to cut the plastic off the furniture now I have all kind of snakes in my furniture and they could not replace it because they could not find another one just like it also that 101 days same as cash you better make sure you pay it out they tried to charge me 6000 for interest rate which came up to 10,000 and some change wanted me to pay $435 a month so you better make sure you pay it out or you will pay double will never go back", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "111332083373927461262", "name": "Katrina Smith", "time": 1595721587492, "rating": 5.0, "text": "Really great customer service.  Darnell help us from beginning to end. Will be shopping with them again.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "105094006111756527168", "name": "Courtney Harris", "time": 1593774497950, "rating": 1.0, "text": "Terribly awful experience!! First off, if Marcus is your salesperson expect absolutely nothing to get done or be done right. I ordered a bedroom and living room set over a month ago to be delivered on June 26th. All of my furniture didn't arrive on time... I still haven't received my living room furniture nor an update on when it's expected to arrive. I finally cancelled the order and asked for a refund yesterday. When my bedroom furniture did arrive, the wrong chest was delivered. Also, Marcus claims he forgot to include my bedrails and I didn't have screws for my headboard. The delivery fee was $100, with no assembly. I had to drive back to the store for my bedrails. No considerations nor accommodations were made for me regarding my time or gas even though this order was paid in full and this was a mistake he made. As of yesterday, he still could not give me an update on the status of my living room furniture. I finally spoke with the manager who was unaware of this situation and told me that my complaint was one of many and that Marcus had been demoted. However, this doesn't change the fact that I've been in my house for almost a month with no living room furniture and they've had the payment in full long before I even closed on my house. DON'T ORDER ANYTHING FROM HERE!", "pics": null, "resp": {"time": 1594045904909, "text": "Hello Courtney,\n\nWe are sorry to hear about any troubles receiving your purchase as expected and would like to help as best we can. Please call 1-866-388-6333 so we can put you in direct contact with the Vice President of the store location you purchased from.\n\nThank you."}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "104788390068121816225", "name": "Liz V.", "time": 1577915574883, "rating": 5.0, "text": "Great Customer Service, VERY knowledgeable about their furniture and went the extra mile. Purchased New Year's Day AND delivered. Great Delivery crew - very professional and super careful. (Even took our old couch away for us!)", "pics": null, "resp": {"time": 1577993588143, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "114606965146139242736", "name": "EVELYN FURTADO", "time": 1576272604407, "rating": 5.0, "text": "I been here before and it's nothing like it is now, last management was horrible and the place looked a mess. Today my visit was very pleasant. Darnell, who is the current manager there was very sweet and kind. he even offered us hot chocolate because of how cold it was in there. If you have a chance to go there i would highly recommend you to ask for Darnell.", "pics": null, "resp": {"time": 1576515232792, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "114638323429379578024", "name": "Bernadette Garrett", "time": 1592156308330, "rating": 5.0, "text": "Great customer service, great help helping pick my granddaughter living room set out", "pics": null, "resp": {"time": 1592226052595, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "114597560609922670518", "name": "Checkmate Raye", "time": 1559595760270, "rating": 5.0, "text": "I just moved into my new apartment and was needing good quality furniture quick and at an affordable price. I found American Freight on Google and it reminded me of the furniture warehouse back home so i decided to give them a try. Darnell was my salesman and i MUST SAY DARNELL IS THE BEST SALESMAN IVE EVER DEALT WITH!!! He listens and is attentive to what the customer needs and wants. He works his magic to ensure you get exactly what youre wanting and stays within your budget! DARNELL IS AMAZING!!! I AM OVERLY PLEASED not only by the  products I've received but more so the level of customer service. Its hard to find great sales people these days that actually give good customer service! KUDOS TO YOU DARNELL AND THANKS AGAIN!!! i HIGHLY recommend American Freight to ALL! Just ask for DARNELL!!!", "pics": null, "resp": {"time": 1559651090154, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "104307887584847650198", "name": "Tonya Buendtner", "time": 1571078751616, "rating": 5.0, "text": "Two weeks ago my fiancé and I bought a living room suite from here and absolutely loved our experience. Olivia is amazing with a great personality! She was very helpful the entire time and today we bought a new mattress from her. The quality, pricing, and excellent customer service can not be beat!!!", "pics": null, "resp": {"time": 1571142296390, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "106792521964318203293", "name": "Adam Huddleston", "time": 1592410430519, "rating": 1.0, "text": "We bought a new sofa/loveseat combo from them. The pricetag was certainly lower than anywhere else we looked, and it looked like OK quality furniture.\nLess than 3 weeks after purchase, the sofa literally fell apart. We're pretty normal sized people and have treated it with care. I turned it over and opened up the upholstery to have a look.  The construction quality is the worst I've ever seen; low grade partical board, half-rotted knotty 1/2\" thick pine, and the whole thing is held together with staples.  I identified 6 separate joints that had come apart inside the couch due to the staples simply slipping out of the wood, and many more that were halfway undone.\nI ended up taking around 3 or 4 hours and meticulously replacing pieces, reinforcing joints with metal brackets and screws, and closing up places in the upholstery which were mysteriously split and leaking stuffing.\n\nThe furniture here is truly of the lowest quality, even if it appears fine on the surface.  If you buy from here, make sure you also purchase their ridiculously expensive warranty (that will tack on $100 - $200 to your purchase), because you're gonna be needing it a whole lot.  If you need cheap furniture, go to the thrift store or use Facebook marketplace. If you want new furniture, spring for something more expensive.", "pics": null, "resp": {"time": 1592838868666, "text": "Hello Adam,\n\nWe are sorry to hear you are having troubles with your purchase and would like to help as best we can. Please call 1-866-388-6333 so we can put you in direct contact with the Regional Manager of the store location you purchased from.\n\nThank you."}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "101773841376737457453", "name": "Traci Smith", "time": 1569526376190, "rating": 5.0, "text": "I absolutely love the hospitality that's at this store! Olivia is outstanding! She personally helped me pick out every single piece of furniture for my home & she gave me every discount that I qualified for. I am so very happy & satisfied with my purchase for ALL my rooms.", "pics": null, "resp": {"time": 1569588892155, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "107240393310098856180", "name": "Ashley Elizabeth", "time": 1572231185676, "rating": 5.0, "text": "To God be the Glory!\n\nAmazing experience today at Amercian Freight in Helena. Sales Manager, Darnell was extremely helpful to me and my little one. Will be receiving my new furniture and lamp set sometime this week; will update you guys afterward.", "pics": null, "resp": {"time": 1572271048383, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "110229495586060243006", "name": "Pierre Hutchins", "time": 1602813024992, "rating": 5.0, "text": "Great customer service, great crew , very patient and helpful.....", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "116342349789712536001", "name": "Jennifer McLin", "time": 1562953689982, "rating": 5.0, "text": "I had a AWESOME experience here! Came in looking for a couple of pieces and as soon as I walked in I was welcomed by John. He was super attentive to all of my questions and concerns.  He made sure he fully understood what I was needing and executed! I HIGHLY recommend!", "pics": null, "resp": {"time": 1563193338492, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "101645255708824979980", "name": "Sydney Woodsum-Finnell", "time": 1533595528542, "rating": 5.0, "text": "Had the most amazing experience at American Freight! Jason was amazing, gave us a great deal on all of the furniture and was very personable. We never felt pressured, but that he was just trying to help us in the best way he could. Truly one of the greatest workers my mother and I have ever met. Would highly recommend American Freight and specifically ask for Jason. Only giving him 5 stars because google doesn’t let us give more!", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "106944850102255749004", "name": "Byron Taylor", "time": 1562358481754, "rating": 5.0, "text": "John was very hardworking. He took time to show me almost everything they had to offer that was in my price range. He was very patient and concerning when I was being very difficult changing my mind a lot. He made sure I was getting what I wanted not just what he could sell me. The other workers even took time to make sure I was comfortable and being helped. This store is a very friendly store and I would recommend shopping with them to anyone!", "pics": null, "resp": {"time": 1562587840359, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "103357904580330229696", "name": "real funguy", "time": 1563145215773, "rating": 5.0, "text": "Sales person, Darnell and Henry were courteous and professional and the delivery crew did a great job delivering our sofa/sectional. The same crew delivered our bed and dinette set before. They were professional at the time too! I will go again for our furniture. No hassle, no issues", "pics": null, "resp": {"time": 1563192585974, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "117749624369458227824", "name": "TAMMY JONES", "time": 1575924833601, "rating": 5.0, "text": "Darnell was a great help, he was so nice, helped me stay in my budget and even tied down my stuff for me. i highly recommend this store", "pics": null, "resp": {"time": 1575990435206, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "100084727121509159062", "name": "Ronnie Burpo", "time": 1562708047473, "rating": 5.0, "text": "My sales person Olivia was totally awesome. Not only was she very professional about the stores merchandise but, she gave me a great deal on the purchase that I made from American Freight. All I can is that I highly recommend American Freight and if you're lucky, you'll get Olivia as your sales person.", "pics": null, "resp": {"time": 1562760629449, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "104961784349868067870", "name": "Dawn Productions", "time": 1580684078771, "rating": 5.0, "text": "Came to this store to purchased a king mattress set, I already knew what I wanted, and most definitely couldn’t beat the PRICE. I was assisted by Martise. He was sooooooooo nice and his customer service was THE BEST I HAVE EVER RECEIVED AT A FURNITURE STORE IN MY LIFE. I wasn’t in a rush to get the set delivered but he made it his business to get it to me today. I mean “who offers same day delivery!!??” NOBODY. He called the delivery guy right away and when I say the delivery guy and his son was THE BEST I mean THE BEST. He called me and said that they would be to my house in 20 minutes. It felt like 15 minutes because as soon as walked in the door he called me and said they were outside!!! He was VERY PROFESSIONAL and moved VERY QUICKLY!!!  I purchased the set and got it delivered to my house app within AN HOUR !!! Im really going consider using this company to delivery my stuff from other places if it’s possible. Overall this was a GREAT experience. Top notch customer service from the store and delivery service!!! My mind is BLOWN!!! I highly recommend!!! THANK YOU AGAIN MARCUS AND THE DELIVERY COMPANY!!!", "pics": null, "resp": {"time": 1580757254050, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "106343441885451289064", "name": "Nikki James", "time": 1564700016081, "rating": 5.0, "text": "Olivia was awesome! She helped us pick out a really nice set and explained the pros/cons when we couldn’t decide. Great customer service!!", "pics": null, "resp": {"time": 1564747122047, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "106856016533467274602", "name": "Cassandra Campbell", "time": 1553713966974, "rating": 5.0, "text": "I am a very pleased customer at American Freight in Helena Al. John sales associate and Martise the manager took very good care of me on purchasing my new kitchen table which I love.\nVery nice, helpful and respectful place to shop for amazing furniture. Good prices as well.\nA big thumbs up to you all  at American Freight", "pics": null, "resp": {"time": 1553774237922, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "101305953964607072655", "name": "Keshia Flowers", "time": 1563751077621, "rating": 5.0, "text": "I absolutely love the service that I received here! Darnell was very helpful with helping me with my purchase! Jeremy and Henry were great with delivering and putting everything together!!", "pics": null, "resp": {"time": 1563796797707, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "105578439720279811687", "name": "Annette Walters", "time": 1562976301568, "rating": 5.0, "text": "Darnell was the best! He was so helpful even after 2 hours of us trying to make up our mind on what we wanted. Great choices!", "pics": null, "resp": {"time": 1563193176968, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "100445865761642203434", "name": "Juli Young", "time": 1568653888293, "rating": 5.0, "text": "American Freight was wonderful. They went beyond selling us furniture, and Olivia especially made the whole experience enjoyable! With American Freight and CJ. With ISG transportation made sure we got our furniture, with a prompt delivery\nIt was. A very easy Process.", "pics": null, "resp": {"time": 1568730720857, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "103968906988755482905", "name": "Faithful Workz", "time": 1559949468018, "rating": 5.0, "text": "Wow. John did a GREAT job with making sure I had everything I needed to move into my new home! I can't thank him enough for taking the time out to deal with me and my pickiness. He was VERY patient and pleasant and I couldn't be happier!!😀😀\n\nThanks John Boston!!!", "pics": null, "resp": {"time": 1560168881358, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "113607604264997227123", "name": "Melony Ware", "time": 1576698526212, "rating": 5.0, "text": "Darnell was very helpful with my sale and he also helped me stay within my budget. I would definitely come here again!!", "pics": null, "resp": {"time": 1576763826257, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "111689821911175314429", "name": "William Parker", "time": 1611261388446, "rating": 3.0, "text": "Don't have very many appliances", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "106519220998226613940", "name": "Contanika JOHNSON", "time": 1554327430992, "rating": 5.0, "text": "Martise and staff is awesome!!  Great customer service, great personality and great prices over here. I highly recommend everyone to come to this location in Helena.", "pics": null, "resp": {"time": 1554379658636, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "115137030408953765305", "name": "Briana Banks", "time": 1563491718393, "rating": 5.0, "text": "Darnell was absolutely amazing! I went in not knowing what I was gonna get and he led the way to get me everything I needed. Absolutely amazing service!", "pics": null, "resp": {"time": 1563537806613, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "117821439778895286198", "name": "Joshua Schaffer", "time": 1611343621420, "rating": 4.0, "text": "Decent selection", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNYMTW7pdxJtYBK2qCQfwzAxt0Cew_Vtgwo9K1V=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "106169381409979640298", "name": "Raymond Price", "time": 1560036579064, "rating": 4.0, "text": "This is an awesome furniture place, you guys come on in & see Darnell he'll surely make your day. The best there is", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP4SL3GPfUmsdLWS63eRQwFoqUH32b9_cP-av3u=w150-h150-k-no-p"]}], "resp": {"time": 1560168567388, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "107562844264596236379", "name": "walter staten", "time": 1564247578241, "rating": 5.0, "text": "John Boston was excellent! He did a wonderful job taking care of my needs. Give that man a pay raise!", "pics": null, "resp": {"time": 1564402514073, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "106963222999780649382", "name": "Joy Mcrae", "time": 1564759368085, "rating": 5.0, "text": "jeremy delivered my order and it was a wonderful experience. all my furtnite came\nin great condition and he even helped move it in the right rooms for me. thank u!", "pics": null, "resp": {"time": 1564772121595, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "111971604847573993599", "name": "Pat Garrett", "time": 1614294282069, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "115291139595596960140", "name": "Shaun Mcbay", "time": 1564338906596, "rating": 5.0, "text": "American freight in Helena are awesome. Olivia is great super awesome customer service very thorough and knowledgeable go by and see them for any of your furniture needs ask for olivia!", "pics": null, "resp": {"time": 1564402313662, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "114709586658389146261", "name": "myandrea crosby", "time": 1592156092505, "rating": 5.0, "text": "Great customer service , such a great help", "pics": null, "resp": {"time": 1592226059529, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "114351536137198519940", "name": "Lisa Ledbetter", "time": 1458152526083, "rating": 5.0, "text": "Our family purchased a new couch and love seat over the weekend from American Freight. Love, love, love what we found, and it looks so good in our living room. It was very affordable. What made the whole experience so positive was our salesperson, Trent Brasher. Trent was so friendly, helpful, knowledgeable...we enjoyed meeting him most of all. When the set was delivered, there was a minor issue and I called Akera, one of the managers, who genuinely cared and  helped fix our problem immediately. Within 30 minutes, Trent himself was standing in my living room resolving the issue and making everything perfect. That is exemplary customer service, and it made us feel that we could really trust purchasing from this company again. We will definitely be repeat customers, and will be asking for Trent again!", "pics": null, "resp": {"time": 1458324498739, "text": "We're so happy Trent was so friendly and helpful! Thanks for your review, Lisa!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "110906884422325869840", "name": "Telisha Pickens", "time": 1537407761873, "rating": 5.0, "text": "Quality furniture at a reasonable price. Mr.Martise’s customer service skills are also noteworthy. I recently had an issue and he went above and beyond to assist me. Great store, great prices and great employees; always a winning combination!", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "103941910452852912088", "name": "Trent Martin", "time": 1552620866902, "rating": 1.0, "text": "Purchased a bedroom set and a sectional for my living room. Waited all day for furniture to be delivered. After I have already left my unfurnished apartment for the night because I don’t have a bed, my furniture finally arrives at 10:00pm, paid $100 (which had to be in cash) to the delivery guys... only for them to not assemble the furniture. $2,000.00 later, I am still sleeping on the couch, that I assembled myself, until my friends are available to help me assemble my furniture.", "pics": null, "resp": {"time": 1552661668207, "text": "Hello Trent,\n\nWe are sorry about your experience with the delivery of your merchandise and would like to help as best we can. Please call 1-866-884-6178 so we can put you in direct contact with the Vice President of the store location you purchased from.\n\nThank you."}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "107248791327263572124", "name": "Givon Wayne Gilliam", "time": 1527810994778, "rating": 1.0, "text": "We bought a floor model and learned a valuable lesson. The couch with chase looked great on the showroom floor and we were very excited to get what we thought was a good deal.\n\nIn less than a year the cushions started to shred.  We do not have children and very few guests.  We are very gentle on our furniture.   To our dismay and surprise the couch covering started to disintegrate before our very eyes.   The middle cushion does not even get used at all and it was the first one to split and fray. See photo for what your couch will look like if you buy it from American Freight.\n\nWe took the cushions into the store thinking they would honor a 1 year warranty.  Unfortunately because the couch was a floor model it was an “as-is”purchase  and we were out of luck.  American Freight said that there was nothing that they could do.\n\nHere is a warning for you.  If you decide to purchase a floor model, do not be surprised if it does not last one year.  You are buying disposable furniture.  Lesson learned.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNJKeG4z2Vt-lSxbX0YnA_rRnXCk9vYlxNWIWYW=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "113539571737959841703", "name": "Lauren Moore", "time": 1554844522594, "rating": 5.0, "text": "Friendly, helpful staff- prices are the best I could find and I am very pleased with the quality- plus I got delivered the same day. Highly recommend!", "pics": null, "resp": {"time": 1554898013095, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "118021013134676952686", "name": "Samantha", "time": 1498696842312, "rating": 5.0, "text": "My roommate and I had a wonderful experience today! We were greeted as soon as we walked in, and the customer service was unbeatable. Joel and Ryan took care of us; they were helpful and informative. They made our experience easy, quick, and pleasant. We will definitely be back with future furniture needs.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "114995912471640359409", "name": "Robert Borre", "time": 1562699854894, "rating": 5.0, "text": "We came to american freight and we saw Darnell, he was very friendly and helpful. Great service, will come again!", "pics": null, "resp": {"time": 1562760655419, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "117195542542050165168", "name": "Connor Gaston", "time": 1520609119392, "rating": 2.0, "text": "Didn't have the best experience here.  Found a couch I liked and paid for it. Came to pick it up a week later on a Saturday. I was getting the fabric protection also and they told me to call a day or two before I wanted to come pick it up so they could have it all done and dried.   I called 2 days before and they told me to call on Saturday when I wanted to pick up.   So I call on Saturday morning when they opened telling them  I wanted to pick up and 1pm.  They told me to call 30minutes before I came so they could spray it.    Got there and the couch they had ready for me was not even the correct couch.  On top of that it had not been sprayed with the fabric protection.  No one there really knew what was going on or who had done what with the couch.  Thankfully the couch I did buy was still there and had not been sold to anyone else.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "103602839486659872322", "name": "Charity Buggs", "time": 1563409648247, "rating": 5.0, "text": "First of all my brother DARNELL is the bomb! My purchase was actually from the Trussville location, and my experience with them has been far below professional. They did not provide me with the information I needed to know for my furniture to be delivered. I paid ONE HUNDRED FREAKING DOLLARS for them to literally drop the box off at my house. That is a LOT of money for a box to be dropped off regardless of the location. So I spoke to Darnell at the Helena location who very kindly listened to me rant about this experience is resolved the matter in much less time than the Trussville location. Seriously, he's your guy. He's amazing!!! I cannot thank him enough for what he is done. While I will never go to Trussville again, should I find anything else I want from American Freight, I will most certainly do my business with the Helena location!", "pics": null, "resp": {"time": 1563451868098, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "114753478923066091388", "name": "Dakota Kerth", "time": 1555372887508, "rating": 5.0, "text": "They were very helpful and extremely nice. Would definitely recommend!\nMarquis and Phanesia were great!", "pics": null, "resp": {"time": 1555503900453, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "104392181794534467819", "name": "michael crowley", "time": 1553808215207, "rating": 5.0, "text": "Bought a sofa and love seat. Didn't notice the colors were slightly uneven. Martise took great care of us and remedied the problem. Great crew at the Helena Store. I will be shopping there again. 5* for Martise and the rest of your crew.", "pics": null, "resp": {"time": 1553862179936, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "101348522569674154784", "name": "Jefferson Spencer", "time": 1577595702930, "rating": 1.0, "text": "You get what you pay for. Cheap stuff.  Also, the delivery company told me they'd deliver and set up. Instead, they dropped it and got out of there as quick as they could.", "pics": null, "resp": {"time": 1577715317436, "text": "Hello Jefferson,\n\nWe are sorry about your experience with the delivery of your merchandise and would like to help as best we can. Please call 1-866-884-6178 so we can put you in direct contact with the Vice President of the store location you purchased from.\n\nThank you."}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "109680821146198685827", "name": "Lisa Willis", "time": 1448843959681, "rating": 5.0, "text": "Joey and Josephine took great care of us. Joey gave us a great deal on leather chairs that are gorgeous! Just in time to have family over for the holidays. American Freight beat the competitor's price and their chairs were nicer! We will definitely be back for future furniture purchases.", "pics": null, "resp": {"time": 1448903440408, "text": "Lisa, we're so glad that Joey and Josephine took care of you! We're happy that you're pleased with your purchase!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "105664708160333806948", "name": "Semone Williams", "time": 1557489656120, "rating": 5.0, "text": "Olivia is GREAT!!! Thanks for the great customer service. Definitely recommend asking for her next time you visit the Helena location!!\n-Bri", "pics": null, "resp": {"time": 1557490621954, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "106403017449962196553", "name": "Ana Caballero", "time": 1538249916440, "rating": 5.0, "text": "Had an awesome sales person, Martise  helped me with all the decisions and had a wonderful personality. Thank you for all your help. Will definitely come back.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "116820841196472742985", "name": "Loo Poo", "time": 1564715193212, "rating": 5.0, "text": "They have very good service and reasonable price and also good quality", "pics": null, "resp": {"time": 1564747146938, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "118255666134850127544", "name": "Benjamin Martinez", "time": 1448247938494, "rating": 5.0, "text": "New warehouse location convenient to Shelby County.  Appreciated the friendly and relaxed atmosphere--Joey took care of us.  We knew exactly what we were looking for from the website and were in and out quickly.  William was awesome in delivery and set up of our furniture same day.  Have already been back for another piece.", "pics": null, "resp": {"time": 1448292786558, "text": "Hey Benjamin - we're so glad to hear that you had such a great experience and that you've already been back! We hope to see you again soon!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "116777808622312908696", "name": "jose manuel moreno", "time": 1554070973580, "rating": 5.0, "text": "Great service really recommend this place to everyone. Shout out to Martsie for giving me a great deal thanks man.", "pics": null, "resp": {"time": 1554121584398, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "100067760866183497633", "name": "mariam ladhani", "time": 1454790686320, "rating": 5.0, "text": "Had a great experience! Trent helped me out. He was very nice to work with. He helped me find what I needed and was very patient. Never did I felt pushed to purchase the sofa and media stand that I looked at. He also knew his product knowledge making the decision easy for me. I will for sure send friends and family to see Trent.", "pics": null, "resp": {"time": 1454962069437, "text": "We're so happy Trent provided you with a great experience! We appreciate your review and recommendation, Mariam! Thank you!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "105152877536698779855", "name": "Steph the baller", "time": 1565364548151, "rating": 5.0, "text": "John Boston provided great customer service and was very helpful!", "pics": null, "resp": {"time": 1565611208845, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "113902160880144578657", "name": "Francoise Reaves", "time": 1454280548001, "rating": 5.0, "text": "I wish there were more than five stars cause this place deserves it. They have great quality furniture for amazing prices and also great customer service. I will most definitely  be shopping with them more in the future. Thank you so much for everything guys!!!!", "pics": null, "resp": {"time": 1454358542124, "text": "Wow! Thank you so much, Francoise! We really appreciate your review!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "111895853454946304251", "name": "Theotis Hudson", "time": 1608846654079, "rating": 4.0, "text": "It was great", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "101044995168392253124", "name": "Jennifer Carlson", "time": 1525795791120, "rating": 1.0, "text": "Bought 3 piece living room set. The seam on one of the arms came open where it was stitched too close and 2 of the recliners have stopped functioning completely. I called (we bought the lifetime guardian plan) to see about getting it fixed (NOT REPLACED) and they said I had to send an email with pictures. It’s been over a month. I have sent 5 emails and called at least as many times. I get told someone will call me back and yet no one ever does. Buyer beware!!", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "112954657644688195301", "name": "J J", "time": 1462829626706, "rating": 5.0, "text": "I received excellent customer service from Wesley . He took his time with me and my husband to make sure we were ok and comfortable with our purchase.   The prices are awesome and the furniture is beautiful! Definitely ask for him when you arrive.", "pics": null, "resp": {"time": 1463163677541, "text": "We're so happy Wesley was so helpful! Thanks for your review, Jessica!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "101402752093056665329", "name": "Teresa Mckay", "time": 1562526349614, "rating": 5.0, "text": "Helped by John. Wonderful service! Great selection. Very friendly!!", "pics": null, "resp": {"time": 1562587488759, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "106617219904014148542", "name": "Nicholas Crumbley", "time": 1565395356236, "rating": 5.0, "text": "Oliva helped out a lot! She was very patient when it came to my decision making and made sure I made the best choice!", "pics": null, "resp": {"time": 1565611415173, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "111627979382545032603", "name": "Ashley Mills", "time": 1452022428328, "rating": 5.0, "text": "We were able to get in and out quickly with what we needed.  The prices are great and the staff is friendly, knowledgeable and helpful!  The item we purchased was not available in our size at the Helena store, but Joey called the Trussville store to verify they had it in stock.  We were able to pick it up the next day, and everything went smoothly!  We will definitely be going back the next time we need furniture!", "pics": null, "resp": {"time": 1451932407079, "text": "That's great, Ashley! Thanks for your review!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "101546405875777719057", "name": "Greta Whitfield", "time": 1460153773392, "rating": 5.0, "text": "Tasha was my Sales  Representative today.   She very knowledgeable of the store items and layaway plan.  She has a sweet spirit and will go far as a Sales Rep. for all of your customers.   Great experience.  Keep up the good work Tasha.", "pics": null, "resp": {"time": 1460405572618, "text": "Thanks so much for your review, Greta! We really appreciate your kind words about Tasha!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "114716744405038949911", "name": "Kyle Dowell", "time": 1445642931724, "rating": 5.0, "text": "Great deals on great furniture, all the staff are great to work with and very friendly. Is definitely worth stopping in and seeing if they can help you with what your looking for. Will be going back any time I need furniture and sending everyone I know!!!!!!!", "pics": null, "resp": {"time": 1446838395996, "text": "Thank you for sharing your feedback and for your recommendation, Kyle!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "116644595530341827886", "name": "Keki rowe", "time": 1448148310103, "rating": 5.0, "text": "Today my hubby and I went into American Freight upon walking in we were greeted with a smile by Trent. Trent was a great salesman and I would recommend anyone to go American freight in Helena the staff as a whole is great. THANKS TRENT FOR YOUR COMMITMENT TO  SATISFY OUR NEEDS.", "pics": null, "resp": {"time": 1448292822769, "text": "Hey Keki, we're so happy you had such a great experience and that Trent was so helpful! We look forward to seeing you again!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "109255271375902168566", "name": "Shenita Morrow", "time": 1454980010365, "rating": 5.0, "text": "I've shopped around quite a bit over the past week, but couldn't find just the right pieces for just the right prices. Glad I came here!!!!! There was a variety of items to look through, and the sales associate was oh so helpful. If Joe-Joe isn't the owner, I can't tell. He takes his position and the happiness of the customer personal.", "pics": null, "resp": {"time": 1455310352303, "text": "That's awesome, Shenita! We're so happy you stopped in!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "107895733435162300858", "name": "Matt Hadaway", "time": 1445693624687, "rating": 5.0, "text": "Great quality furniture! Located right in Helena! Manager Joey and salesperson Akera were amazing!! Have bought furniture from AF before and will continue too! Our leather sofa and love seat look and feel amazing! Great people! Must go see!!", "pics": null, "resp": {"time": 1446838455134, "text": "It's great to hear you're pleased with your purchase and experience, Matt! Thank you for your review!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "100338913044289142958", "name": "Stephanie Martin", "time": 1445642129201, "rating": 5.0, "text": "Joey and the warehouse guy were awesome. They helped us pick out the right furniture for our rooms and the delivery guys were amazing. Definitely would refer my friends and family to this location. (Trussville location is no where near as nice and helpful FYI.)", "pics": null, "resp": {"time": 1446838312008, "text": "We're happy to hear you found what you were looking for, Stephanie! Thank you for shopping with us!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "116845197969241631190", "name": "Brittney Wallace", "time": 1583782953668, "rating": 5.0, "text": "I want to thank Marcus at Helena American Freight Furniture for taking their time to help me today to get everything I needed for my new house!!!", "pics": null, "resp": {"time": 1583849135692, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "108599455296967722093", "name": "Omari Grimes", "time": 1463231533655, "rating": 5.0, "text": "Cole (Wesley) was simply amazing! He was extremely nice, helpful, and patient with me! He helped me chose an entire bedroom set and mattress. I couldn't be happier! So glad I came here and now I won't be going anywhere else for furniture. Customer service is everything to me and he went above and beyond! Request Cole for your sales representative!", "pics": null, "resp": {"time": 1463420968630, "text": "We're so happy Cole was so amazing and helpful! We appreciate your review and look forward to seeing you again, Omari!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "101972857684156957052", "name": "Jason Chamblee", "time": 1448658833242, "rating": 5.0, "text": "I loved everything about my experience at American freight in Helena! The customer service and selection were great. The quality of everything in stock was amazing, and best of all my wife got exactly what she wanted without being pressured into buying something more expensive.", "pics": null, "resp": {"time": 1448903470591, "text": "A happy wife is a happy life, Jason! We're glad you found what you were looking for!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "115339507326119036534", "name": "Chandler Rose", "time": 1452658362131, "rating": 5.0, "text": "We had a great experience while purchasing a sofa. Joey and the sales agent were extremely friendly, helpful and took great care of us. Had many great products as well. Would highly recommend checking out what they offer.", "pics": null, "resp": {"time": 1453151388963, "text": "We're so happy you had a great experience, Chandler! We appreciate your recommendation!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "114318696216311791908", "name": "Jay BIshop", "time": 1450648565164, "rating": 5.0, "text": "Really great selection and the prices cannot be beat. Great customer service as well and professional delivery literally the same day or the very next day… Hard to beat.", "pics": null, "resp": {"time": 1450727678948, "text": "Thank you, Jay! We appreciate your review and are happy you had a great experience!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "117517465349379803012", "name": "Anna Jones", "time": 1558370342002, "rating": 5.0, "text": "I recently purchased a mattress for my daughter’s birthday. Martice was phenomenal!!! On my first visit he helped me compare products to select the best one for me - extremely knowledgeable!!! On my second visit (the day I made my purchase and needed to take it home) the mattress was sold out  at the Helena location.  Martice actually drove to the Trussville location to pick up the mattress I needed and brought it back to Helena so I could surprise my daughter with her new bed on her birthday. Now THAT is CUSTOMER SERVICE at its best!!!! Thank you Martice!!", "pics": null, "resp": {"time": 1558380244964, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "112496982860845715297", "name": "Clarese Smith", "time": 1608169920638, "rating": 5.0, "text": "Chasity was great", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "110570297926285857639", "name": "Garrett Bates", "time": 1564444026402, "rating": 5.0, "text": "Headed to school and John Boston took care of us. Did an exceptional job on finding the right sofa for my first apartment", "pics": null, "resp": {"time": 1564488007552, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "109183838483009406013", "name": "Ashley Clark", "time": 1448147166059, "rating": 5.0, "text": "Joey, William & Trent were very helpful. They took the time to make sure I got what I needed. and wanted.I'm happy with my selections & will recommend their services to everyone.", "pics": null, "resp": {"time": 1448292854138, "text": "Thanks for your recommendation, Ashley! We're so glad you had a pleasant experience!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "104359354944783385975", "name": "Rikki Srivastava", "time": 1452204980830, "rating": 5.0, "text": "Great prices and service! Trent was great to work with and even went out of his way to personally deliver a headboard I ordered. We'll definitely be back!", "pics": null, "resp": {"time": 1452278227220, "text": "We're so happy Trent was so helpful, Rikki! Thanks for your review!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "100870654734531474469", "name": "Sondra Meadows", "time": 1518206139542, "rating": 1.0, "text": "They delivered the wrong product then what I paid for.  The store was very unprofessional when dealing to the third party delivery person although it was clearly the stores error.  They still made ME pay for delivery even though it was the wrong item and their mistake.  My furniture was hauled off and I have yet to hear from the Manager Alex as to how he plans on resolving this AND he still has my money!  Do NOT WASTE YOUR MONEY WITH THIS COMPANY. They are nice but do not deliver on their promises or merchandise. It’s simply a ploy to take your money then give you the round around. I left messages for the regional Manager as well with no return call either. Bad news all the way around.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "102643523385913511570", "name": "Keanna Hood", "time": 1459185229193, "rating": 5.0, "text": "Great customer service from Akera and Wesley. They had great knowledge of their furniture. The prices are really good and they had a good variety of everything. Would recommend to anyone.", "pics": null, "resp": {"time": 1459195105705, "text": "Thanks for your review, Keanna! We appreciate your recommendation!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "100561498965088407277", "name": "Cynthia WASHINGTON", "time": 1567277763440, "rating": 5.0, "text": "Olivia is Awesome! Go check her out!", "pics": null, "resp": {"time": 1567517362687, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "113369972784897088112", "name": "Joshua Pinaire", "time": 1451155534566, "rating": 5.0, "text": "This is the best place to buy your furniture!  Talk to Joey ,he will work with you and and make sure your happy with your purchase. He is very helpful, and at the same time gives you room to shop.", "pics": null, "resp": {"time": 1451330802740, "text": "We're so happy Joey was so helpful and that he helped you find what you were looking for! Hope to see you again soon, Joshua!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "117504592733163045820", "name": "JOSE ANTONIO VELAZQUEZ ENCINAS", "time": 1449074091268, "rating": 5.0, "text": "Joey was awesome. The delivery was quick as promised: no issues. Great service and assistance. A very good (and cheap) choice if you are looking for some furniture in the BHM area.", "pics": null, "resp": {"time": 1449243146821, "text": "Thanks for your review, Jose! We're glad everything went smoothly for you and you had a great experience! Hope to see you again for any and all furniture needs!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "110965092206016374030", "name": "Kaila Morales", "time": 1451491453359, "rating": 5.0, "text": "Awesome place to get furniture!! They were great! They helped us get what we wanted and for a great price too! ;) I would definitely recommend them to everyone! Thanks Joey & Trent!!", "pics": null, "resp": {"time": 1451932324696, "text": "We're so happy you found what you were looking for, Kaila! We appreciate your recommendation!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "104696941166279012454", "name": "Amy Richey", "time": 1567902475780, "rating": 1.0, "text": "The OPEN warehouse wreaked of cigarette smoke.  I walked in and right back out.  Not interested in bringing that smell home.", "pics": null, "resp": {"time": 1568031894579, "text": "Hello Amy,\n\nWe are sorry to hear about your recent shopping experience.  Input about our stores and employees helps improve customer satisfaction and we aim to please. If you have a specific complaint or compliment, please call 1-866-884-6178 so we can put you in direct contact with the Vice President of the store location you recently visited.\n\nThank you."}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "113859385253849490765", "name": "seth beisher", "time": 1449178612488, "rating": 5.0, "text": "Very helpful staff and they negotiate fairly. Quality furniture from North Carolina and 1 yr guarantee on all items. Can't beat the price or the same day delivery. We will be back and sending our friends!", "pics": null, "resp": {"time": 1449243076798, "text": "Thanks for the review, Seth! We definitely look forward to seeing you again soon!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "108132519611093624426", "name": "Samuel O'Hara", "time": 1445731170766, "rating": 5.0, "text": "I had great service from Akera and Joey today.  They were both very helpful and professional, and the same day delivery was an added bonus. I will definitely be back!", "pics": null, "resp": {"time": 1446838567131, "text": "Thank you for your feedback, Isaiah! We look forward to seeing you again in the future!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "105499541347672342971", "name": "stacey unger", "time": 1452203886602, "rating": 5.0, "text": "Excellent customer service from Joey and Trent! Great value for the money! Thanks for a great experience!", "pics": null, "resp": {"time": 1452278175640, "text": "We're so happy Joey and Trent provided great customer service, Stacey! Thanks for your review!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "115951642624254440195", "name": "Gini McGlothin", "time": 1457388101841, "rating": 5.0, "text": "This place literally has everything! Akera was so helpful and even explained everything twice (once to my husband when he was there and again when I came in to look). We got great furniture for a great deal, and we'll definitely be back when we need something else.", "pics": null, "resp": {"time": 1457728951566, "text": "Thanks for your review, Gini! We're so happy Akera was so helpful!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "106959200186260781478", "name": "Jamie Wade", "time": 1458417724812, "rating": 5.0, "text": "My husband and I purchased a new couch/ love seat and kitchen table from American Freight in Helena. We are soo excited to get our peices in. We have purchased from there before and love the products. It is a very affordable place to shop. What made the whole experience so positive was our salesperson, Trent Brasher. Trent was so friendly, helpful, and knowledgeable...we enjoyed meeting him most of all! Thank you again Trent! :)", "pics": null, "resp": {"time": 1458588548639, "text": "Thanks for your review, Jamie! We're so happy Trent was so helpful!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "104639413092895116488", "name": "christine hall", "time": 1582737306519, "rating": 1.0, "text": "Paid alot of money for them to deliver me something missing piece's  then go tell me o have to pay for someone to come out here to look at it like i cant read directions  still the wrong part", "pics": null, "resp": {"time": 1582746886840, "text": "Hello Christine,\n\nWe are sorry to hear about any troubles receiving your purchase as expected and would like to help as best we can. Please call 1-866-884-6178 so we can put you in direct contact with the Vice President of the store location you purchased from.\n\nThank you"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "116209747112237535919", "name": "Jenny Parrott", "time": 1454631264011, "rating": 5.0, "text": "Akera was very helpful!  She helped me and my daughters pick out mattresses.  She was very patient and let my girls feel like they were part of the purchase.", "pics": null, "resp": {"time": 1454701887188, "text": "We're so happy Akera was so helpful, Jenny! Thanks for your review!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "107699542682471956007", "name": "Kimberly Adams", "time": 1456200410763, "rating": 5.0, "text": "I received great service from Joey and Jo Jo. Very friendly atmosphere. I love my Prefect Care mattress. I will definitely go back", "pics": null, "resp": {"time": 1456507726304, "text": "We're so happy Joey and JoJo provided you great customer service! Thanks for your review, Kimberly!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "105247342698285858801", "name": "Francesca Sanders", "time": 1496163392200, "rating": 5.0, "text": "Mr. Joel helped me saved a ton of money for good quality furniture. I have really enjoyed the experience and will definitely be back for my next future purchase .", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "103938608265349060971", "name": "Bob Tillman", "time": 1476477509366, "rating": 2.0, "text": "I really like the store.....prices were great....but ill never shop there because of the way the woman in a blue shirt acts.  Very disrespectful and poor communication skills.  Customers ask questions. Seems she doesn't understand basic customer service.  Asked a young man in the warehouse who she is and he said the manager.  Not good.  Wont be back.", "pics": null, "resp": {"time": 1476714155019, "text": "We're very sorry to hear this, Bob. We've passed your review on to upper management to take care of the matter appropriately. Thanks."}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "101611376878914917331", "name": "Nicole Moorer", "time": 1454188627581, "rating": 5.0, "text": "Great prices!!!! Josephine was very patient and Helpful both times I came. The manager Joey is great go see them for the best customer service ever!", "pics": null, "resp": {"time": 1454358484327, "text": "Thanks, Nicole! We're so happy Josephine was so helpful!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "104067780522164046585", "name": "Kimberly Jennings", "time": 1453088897791, "rating": 5.0, "text": "We purchased a bedroom set and when we opened the chest, it was damaged. We called and were told to bring it back for an exchange... it's never that easy. But here, it was! The customer service is wonderful, the salespeople are all courteous, professional, and friendly. We will be return customers in the near future. Thank you, American Freight.", "pics": null, "resp": {"time": 1453151436849, "text": "We're so happy you had a wonderful experience and we look forward to seeing you again, Kimberly!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "101147257426328314800", "name": "Amy Thompson", "time": 1545157631371, "rating": 1.0, "text": "Bought (and financed) two matching recliners on July 21st of 2018. The Helena store only had one so we picked up the other from the Trussville location. Get home to find the Trussville store had given us a broken chair. We return it to the Helena store a few days later and were told they would have to order it and it could take up to 3 weeks to receive the replacement.\nWe have been very patient, probably to patient...Because here we are 5 months later paying on a chair/recliner that we don't have!\nThrough these past 5 months there have been countless attempts to reach out to the Helena location, only to be blown off by staff that insist they are oblivious to what is going on and leave me with, \"I will have to call you back.\"\nNever to be heard from again until the next time I call or reach out via the American freight website.\nThis situation has gone on entirely long enough! I personally do not suggest doing business with this company and if you so choose to, just remember, \"buyer beware!\"", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "113889945385113094016", "name": "sheree jeff", "time": 1455284379782, "rating": 5.0, "text": "Great experience.  Trent helped me pick out the perfect mattresses. Will definitely be back to shop again.", "pics": null, "resp": {"time": 1455310416004, "text": "We're so happy Trent was so helpful, Sheree! Thanks for your review!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "105972051901398710542", "name": "Amy Moore", "time": 1450742300693, "rating": 5.0, "text": "We went tonight looking for a new mattress.  Trent was very helpful.  We made our purchase and the delivery truck followed us home. Within minutes after purchasing the new mattress was in!  The delivery service was fantastic!!", "pics": null, "resp": {"time": 1451330625615, "text": "That's great, Amy! We're so happy you found what you were looking for and that you had a great experience!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "117414238293967348024", "name": "tamitam09", "time": 1447531395594, "rating": 5.0, "text": "Loved our experience at this store everyone was so sweet the sales lady that helped us,Josephine,was very nice and helpful and the manager Joey was great he made sure we got the best deal on what we wanted and the same day delivery was awesome the delivery guys were great and very gentle moving the funiture in through our kind of difficult doorway would without a doubt recommend this place to anyone and we will be back for any of our furniture needs 😊", "pics": null, "resp": {"time": 1447867036015, "text": "We're so happy you had a wonderful experience! Thank you so much for your review and recommendation! We hope to see you soon!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "117123133470400197599", "name": "Dalton Baldwin", "time": 1453940634074, "rating": 5.0, "text": "Akera was our sales person today. She was very kind and helpful. And helped me find a mattress I really love. All the people on staff today were friendly and had wonderful manners!", "pics": null, "resp": {"time": 1454358327488, "text": "We're so happy Akera was so helpful, Dalton! Thanks for your review!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "117560026587492520031", "name": "pat grady", "time": 1450844444649, "rating": 5.0, "text": "Akera was very helpful. The price was very great. I recommend everyone and anyone who's looking for furniture to go to American freight and Ask for Akera", "pics": null, "resp": {"time": 1451330717661, "text": "Thanks so much for your recommendation, Pat! We appreciate you!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "114589496239145234828", "name": "Tax Professional", "time": 1537442995352, "rating": 5.0, "text": "Great working environment, great customers and a great place for furniture shopping!", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "110665603661410964278", "name": "brittany fitts", "time": 1457485746513, "rating": 5.0, "text": "Wonderful experience with great deals. Alex and Trenton are wonderful very helpful and knowledgeable. Thanks guys!", "pics": null, "resp": {"time": 1457728978119, "text": "Thanks for your review, Brittany! We're so happy Alex and Trenton were so helpful!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "110511609592129910774", "name": "Tamela Miller", "time": 1560449874838, "rating": 5.0, "text": "Great place to shop good prices good associates", "pics": null, "resp": {"time": 1560455383336, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "102310454353450652099", "name": "Chandra Sparks Splond", "time": 1451698587767, "rating": 5.0, "text": "American Freight in Helena had great prices and quality furniture. Akera was knowledgable and helpful. I highly recommend you check it out.", "pics": null, "resp": {"time": 1451932375658, "text": "Thanks, Chandra! We appreciate your recommendation!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "105274596261893874852", "name": "Crystal W", "time": 1455973269056, "rating": 5.0, "text": "Awesome experience. Purchased a king sized bed, great customer service. I will be returning.", "pics": null, "resp": {"time": 1456178044163, "text": "Thanks for your review, Crystal!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "117444969153576600209", "name": "Bryan Harrison", "time": 1453429952965, "rating": 5.0, "text": "Everyone was very helpful and friendly that works there.  They have great prices on their furniture and a large selection to choose from.", "pics": null, "resp": {"time": 1453750831494, "text": "We appreciate your review, Bryan!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "110999314007355702604", "name": "TP", "time": 1502907266815, "rating": 4.0, "text": "Great price.  Same day delivery.   Scratched my wall delivering couch a and gave me a $75 credit to compensate.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "101592183023536175055", "name": "Curlie Thomas", "time": 1453672114025, "rating": 5.0, "text": "Josephine and Joey we're awesome. They tell you the truth and keep you posted on the deals within the store. We will be life long customers.", "pics": null, "resp": {"time": 1453751012950, "text": "We're so happy Josephine and Joey were so helpful and we can't wait to see you again, Curlie!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "103926064684749914850", "name": "Jasmine Pruitt", "time": 1453607226488, "rating": 5.0, "text": "The service was great everyone pleasant and knowledge. Got what I was looking for!! I'll definitely be shopping again!", "pics": null, "resp": {"time": 1453750981633, "text": "We're so happy you found what you were looking for, Jasmine!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "113527882684717514716", "name": "AgapeSZN", "time": 1520357184829, "rating": 5.0, "text": "Come visit the Helena location and make sure you ask for Martise Rousseau!!! I went online before I came in the store but I had all types of options to choose from that I didn’t see online. Martise helped me narrow down what I liked best and what I wanted for my style in my home. He took the time to analyze my style and my needs and I appreciate any salesman that puts that much passion into their work! With his help, I was able to find options that were both beautiful and on budget! Thanks Martise, my fiancé and I will definitely be back in the near future", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "105918663510479917123", "name": "Tyea Johnson", "time": 1460257862600, "rating": 5.0, "text": "My guest and I walked in and were immediately greeted! Customer service here was awesome, Cole helped us pick one of the best sofas there and even shared some valuable information about the fabric as well!!loved it!!", "pics": null, "resp": {"time": 1460405693638, "text": "Thanks for your review, Tyea! We're so happy Cole was so helpful!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "109063880016293754148", "name": "Adam Alfano", "time": 1445724739084, "rating": 5.0, "text": "Amazing service (ask for Akera) and great prices! Highly recommend!", "pics": null, "resp": {"time": 1446838500849, "text": "Thank you for your recommendation, Adam!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "109929023417472601189", "name": "Troy Mann", "time": 1445555500581, "rating": 5.0, "text": "Much easier to deal with and much better lay out than the Trussville store. Joey and the warehouse dude was awesome.", "pics": null, "resp": {"time": 1446838256965, "text": "Thank you for sharing your feedback with us, Troy!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "102392332613257482379", "name": "kristyn ruiz", "time": 1455990278914, "rating": 5.0, "text": "Trent was a really big help he is a great guy and helped us with all our question thanks again Trent", "pics": null, "resp": {"time": 1456178067867, "text": "We're so happy Trent was so helpful! Thanks for your review, Kristyn!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "102041562064933184306", "name": "Derek Hill", "time": 1488135264637, "rating": 5.0, "text": "The staff was very attentive, helpful,and I look forward to purchasing from you all in the future.Great job ladies and gentlemen.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "104935658894810834540", "name": "Charlie Harper", "time": 1469388995898, "rating": 5.0, "text": "Akera gave great customer service.....Very nice attitude.....Same day delivery with good prices, you can't beat it.....Bought on my first visit to the store......", "pics": null, "resp": {"time": 1469467587734, "text": "Thanks for your review, Charlie!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "104648384035916384281", "name": "JENNIFER NICHOLE TERRY", "time": 1460253029172, "rating": 5.0, "text": "Great customer service . They stayed late to help us with our needs and if they don't have what you want in stock, they will compromise.", "pics": null, "resp": {"time": 1460405670997, "text": "Thanks for your review, Jennifer!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "106627585721403989498", "name": "Keturah Thomas", "time": 1552231464474, "rating": 1.0, "text": "They have all the wrong prices on there furniture do not buy there false advertising sorry you get a 1star pictures coming soon", "pics": null, "resp": {"time": 1552307081773, "text": "Hello Keturah,\n\nWe are sorry to hear about your recent shopping experience.  Input about our stores and employees helps improve customer satisfaction and we aim to please. If you have a specific complaint or compliment, please call 1-866-884-6178 so we can put you in direct contact with the Vice President of the store location you recently visited.\n\nThank you."}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "107720534088738540379", "name": "Lovve Pooh", "time": 1517347280966, "rating": 5.0, "text": "Joey was Amazing! Great Customer Service and very knowledgeable!", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "112369676591637093451", "name": "POWERCHICK", "time": 1459632189851, "rating": 5.0, "text": "I received excellent service from Cole and Akera. They were extremely helpful and accomodating. 👍", "pics": null, "resp": {"time": 1459957602970, "text": "We're so happy Cole and Akera were so helpful! Thanks for your review, Tanya!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "113032705856813079900", "name": "Josh Garrison", "time": 1456342268737, "rating": 5.0, "text": "Trenton Brasher and Akera Christian were such a great sale team. Very helpful.", "pics": null, "resp": {"time": 1456507737517, "text": "Thanks for your review, Josh!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "100896790286485872407", "name": "Harmony Lu", "time": 1455157493354, "rating": 5.0, "text": "I came in late, but got concierge service & a great deal from Akera & the super talented loading crew.", "pics": null, "resp": {"time": 1455310390518, "text": "That's great, Harmony! Thanks for your review!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "117045926607751030936", "name": "breagan davenport", "time": 1453868982531, "rating": 5.0, "text": "great layaway plan and all the employees are super friendly I highly recommend them!", "pics": null, "resp": {"time": 1454358307509, "text": "Thanks so much, Breagan!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "115388943035869376187", "name": "Lipsa Rani", "time": 1454123501066, "rating": 5.0, "text": "Very good ,   Well behaved staff ( Akera and Joey ) and good understanding people . Best place to get furniture 😊. Thank u so much Akera and Joey .", "pics": null, "resp": {"time": 1454358353984, "text": "Thanks for your review, Lipsa!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "104038986388853967300", "name": "Reba Cunningham", "time": 1450805857078, "rating": 5.0, "text": "Akira was very professional  and helpful. I give her a 5 star.", "pics": null, "resp": {"time": 1451330648200, "text": "We're so happy Akira was so helpful! Thanks for your review, Reba!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "100905426639211233254", "name": "sir calman", "time": 1495043882955, "rating": 5.0, "text": "We walked in and we're immediately greeted by Joel. He found us exactly what we wanted at a steal of a price. My wife and I will definitely be returning here for all of our furniture needs.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "113473464984167352950", "name": "North “Chief” Shelby", "time": 1457630462300, "rating": 5.0, "text": "Akera the manager was a great help, very patient and helpful and made it a great experience and was very helpful in my furniture shopping experience.", "pics": null, "resp": {"time": 1457729030679, "text": "We're so happy Akera was so helpful! Thanks for your review, North!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "109765597291538497081", "name": "keaton jefferson", "time": 1463633687623, "rating": 5.0, "text": "i really enjoyed the excellent customer service with Akera and Kelsey they are great business woman", "pics": null, "resp": {"time": 1463759657747, "text": "Thanks for your review, Keaton!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "109806386026564447210", "name": "M R King", "time": 1485188895285, "rating": 5.0, "text": "Good quality at affordable prices plus friendly and helpful employees.", "pics": null, "resp": {"time": 1485200877739, "text": "Thanks for your review, Marilyn!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "104609725128311891209", "name": "Mi Chelle", "time": 1519537503446, "rating": 1.0, "text": "So today i purchased living room set and dining room set went that morning did not receive my things until after mid night the delivery poeple are very rude shopping was there was great dealt with garry do not use there delivery people they are awful", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "108488998477060348492", "name": "Jonathan Jones", "time": 1453524708690, "rating": 5.0, "text": "The staff is very nice and especially Trenton and joey they were very helpful and honest and I feel like I got a really good deal and the bed is very comfortable thanks again! I look forward to doing business with you again soon.", "pics": null, "resp": {"time": 1453750954914, "text": "We're so happy Trenton and Joey were so helpful, Jonathan!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "111632889178459103122", "name": "Jillian Shields", "time": 1568579482814, "rating": 5.0, "text": "Olivia was a great help!", "pics": null, "resp": {"time": 1568635821117, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "104593450916628273303", "name": "Marlene Carver", "time": 1461123899012, "rating": 5.0, "text": "Cole was excellent in his knowledge of products and number 1 in customer service.", "pics": null, "resp": {"time": 1461339074719, "text": "We're so happy Cole provided you such great customer service! Thanks for your review, Marlene!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "112839943897225386213", "name": "A H", "time": 1453855979474, "rating": 5.0, "text": "Great layaway plan! Nice and affordable furniture! Helena needed this!", "pics": null, "resp": {"time": 1454358296256, "text": "Thank you, Jami!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "108274781276647408974", "name": "Rose Harden", "time": 1453147181448, "rating": 5.0, "text": "Very friendly atmosphere. Joey was courteous and helpfull.", "pics": null, "resp": {"time": 1453151453695, "text": "We're so happy Joey was so helpful, Rose!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "102423015875337783827", "name": "L. Schneider", "time": 1457021804868, "rating": 5.0, "text": "Akera is the best! Excellent customer service.", "pics": null, "resp": {"time": 1457113297746, "text": "Thanks for your review!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "112722977184992561739", "name": "April Howard", "time": 1453747618745, "rating": 5.0, "text": "Great customer service and deal from Joey!  Thanks!!  We'll be back for a bedroom and dining room suite!!", "pics": null, "resp": {"time": 1453751049096, "text": "We're so happy Joey provided great customer service, April!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "102673482871302614014", "name": "mary morris", "time": 1451150129879, "rating": 5.0, "text": "Excellent service provided by Josephine and Akera at Helena location. Thank you ladies so much!!", "pics": null, "resp": {"time": 1451330748561, "text": "We're so glad Akera and Josephine were so helpful and that you had a great experience!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "106184766689981933643", "name": "brandon carson", "time": 1567289067368, "rating": 5.0, "text": "Great service!", "pics": null, "resp": {"time": 1567516911075, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "105673040141667410688", "name": "Patricia Montgomery", "time": 1551560946092, "rating": 1.0, "text": "False advertised for mattresses", "pics": null, "resp": {"time": 1551706646186, "text": "Hello Patricia,\n\nWe are sorry to hear about your recent shopping experience.  Input about our stores and employees helps improve customer satisfaction and we aim to please. If you have a specific complaint or compliment, please call 1-866-884-6178 so we can put you in direct contact with the Vice President of the store location you recently visited.\n\nThank you."}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "117137847160739138361", "name": "Terria J. Brown", "time": 1454264951405, "rating": 5.0, "text": "Akera gave nothing but excellent customer service once I walk in the building, I was out about 10-15 mins later. Will come back again for more!!!", "pics": null, "resp": {"time": 1454358515108, "text": "We're so happy Akera provided excellent customer service, Terria! Thanks for your review!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "111218410118328629486", "name": "Adam Travis", "time": 1559429897808, "rating": 5.0, "text": "Great service  John", "pics": null, "resp": {"time": 1559568075023, "text": "Thank you for your review. We appreciate your business!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "111899010949377204425", "name": "Cass Russ", "time": 1553989215698, "rating": 1.0, "text": "This place sucks and they lie to their customers. I will be reporting them to the BBB and calling the corporate office. The manager is not available and will not return my call.  I am trying to cancel my account because he lied on when my product will be delivered.", "pics": null, "resp": {"time": 1554122485061, "text": "Hello Cassandrea,\n\nWe are sorry to hear about your recent shopping experience.  Input about our stores and employees helps improve customer satisfaction and we aim to please. If you have a specific complaint or compliment, please call 1-866-884-6178 so we can put you in direct contact with the Vice President of the store location you recently visited.\n\nThank you."}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "113814422268200970346", "name": "suzy qt", "time": 1498494831819, "rating": 5.0, "text": "Professional and on time.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "101076593826939617779", "name": "Qwsa Yayo", "time": 1488088897698, "rating": 5.0, "text": "Great experience", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "104323237481383014490", "name": "Ista Elliott", "time": 1515527162751, "rating": 1.0, "text": "I have been to the store in Helena twice today. The sign says it is open 11-7, but doors are all locked pup with no explanation as to why they are not open or when they will be open.", "pics": null, "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "116985790512666743556", "name": "Patricia Gilbert-Lythcott", "time": 1456014829910, "rating": 5.0, "text": "American freight is the absolute best‼️", "pics": null, "resp": {"time": 1456178075059, "text": "Thanks for your review, Patricia!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "109389155234357978445", "name": "Ashley Witherspoon", "time": 1451432890729, "rating": 5.0, "text": "Joey is awesome!", "pics": null, "resp": {"time": 1451931932056, "text": "You're awesome, Ashley!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "112093063162798877055", "name": "Mildred Langford", "time": 1446593577100, "rating": 5.0, "text": "Was  amazing", "pics": null, "resp": {"time": 1446838596818, "text": "Thank you for your review, Mildred!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "116938219764999622439", "name": "His Grace Saves", "time": 1451509400234, "rating": 5.0, "text": "Awesome service from Trent.", "pics": null, "resp": {"time": 1451932335415, "text": "That's great, Don!"}, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "104340281623722602688", "name": "Carolina Lecaros", "time": 1515970926555, "rating": 5.0, "text": "(Translated by Google) I had an excellent experience in this store. They have very nice models in bedrooms, living and dining rooms. New items every two weeks and if in the web you find some model that in the store there is not, they can order it for you. Excellent customer service.\n\n(Original)\nTuve una excelente experiencia en ésta tienda. Tienen modelos muy bonitos en juego de dormitorios, sala y comedor. Nuevos ítems cada dos semanas y si en l web encuentras algún modelo que en la tienda no haya, ellos lo pueden ordenar para ti. Excelente customer service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOamxWzQ8fVYSr66_d0HpRixn1B1utB7cwoZ3YJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM-srYx8ifmGhqKrmmHAUA5AwLL1bgPv5K0_7bo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNUCoWkbaOu1_fbaAJt_df4HwnCSWINtlDDew0t=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNZEjN7nPNel69hABdh_tqAU1A2TzTvq1-ssEuq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP0HG0yWNoIyGx0z72oLZDfXs-jfZC_jKS8n-VK=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888926e71f395913:0xac5904c3b32b67d7"}
{"user_id": "100614351892959277109", "name": "Lucas Gambino", "time": 1616943308033, "rating": 5.0, "text": "We hired this company to remodel our kitchen. We did not have much knowledge about these types of projects, so we really needed someone who could provide us with insight and direction. This company was everything we could have asked for. They provided a step-by-step instructions on how to think about our remodel project, and offered continuous support and great ideas along the way. We never felt like we were asking too many questions. They were extremely easy to work with. We receive personal attention from the owner and his wife. And even better than the service perhaps was the great price.  We receive tremendous value and would hire them over and over again. After having looked around before hiring them, I feel confident that there is no other kitchen remodel company in the state that is even close on service, price or quality.", "pics": null, "resp": null, "gmap_id": "0x88891bba11dee7db:0xcff8856ed11b5705"}
{"user_id": "115773609517933847607", "name": "Aaron Waters", "time": 1619795068752, "rating": 5.0, "text": "I have purchased appliances from European Kitchens of Alabama twice and would not hesitate to purchase again.  Loay and May are tremendous to deal with and have always put our needs above theirs.  I cannot say enough good things about them.", "pics": null, "resp": null, "gmap_id": "0x88891bba11dee7db:0xcff8856ed11b5705"}
{"user_id": "115403229510293909478", "name": "Misty Fontenot", "time": 1598621948829, "rating": 5.0, "text": "We love Loay and his amazing showroom and products. When we renovated a historic home in Highland Park, we went to visit him for our entire suite of kitchen appliances. I found the stove of my dreams (a Bertazzoni) that he had in the back and gave us an amazing deal on it - and on everything. My spouse is an Architect and works with him a lot because he’s awesome and so is the business!", "pics": null, "resp": null, "gmap_id": "0x88891bba11dee7db:0xcff8856ed11b5705"}
{"user_id": "103868470619748563661", "name": "Rachel Petry", "time": 1567801548966, "rating": 5.0, "text": "Great experience! We just bought our appliances for our kitchen - I shopped online and this place is competitive! Plus amazing service and hospitality! Great selection and beautiful kitchens!", "pics": null, "resp": {"time": 1568046545091, "text": "Thanks Rachel! Glad you found appliances that worked for you with your taste and aesthetics. Don't hesitate to reach out if we can do anything else for you. -Loay A., Principle"}, "gmap_id": "0x88891bba11dee7db:0xcff8856ed11b5705"}
{"user_id": "104657315330213178045", "name": "Eleanor Collins", "time": 1484249976442, "rating": 1.0, "text": "Took my money.  Have not had the Christmas present delivered yet.  Plenty of excuses and no refund yet.  The present was for a handicap mother.  Do not shop here.  Phone call to handicap mom stated you would refund credit card and you want to add it to the list of lies? First week, chair was not in the warehouse in Atlanta.  Second week it was raining.  Third week excuse was death in the family.  Fourth week no delivery no phone call.  You never contacted the buyer which was me.  Just made stress on the handicapped mom.  You can call me names.  I in turn will not call you names.  I will wait for the refund on the card and you have my phone number since you will not answer my call.  I will pray for you also.", "pics": null, "resp": null, "gmap_id": "0x88f333433646516b:0x4d6a49b20bf770f4"}
{"user_id": "106599796570026497181", "name": "evan stevens", "time": 1467059523468, "rating": 5.0, "text": "They made my wife happy and that makes me happy! Thank you furniture and mattress outlet! We love our new bedroom set! You guys rock!", "pics": null, "resp": null, "gmap_id": "0x88f333433646516b:0x4d6a49b20bf770f4"}
{"user_id": "103559526549904758781", "name": "Lisa Garrett", "time": 1472767399797, "rating": 5.0, "text": "We have bought two mattress sets from Furniture and Mattress Warehouse, and we LOVE both!!! We will definitely be shopping for living room furniture soon from them!", "pics": null, "resp": null, "gmap_id": "0x88f333433646516b:0x4d6a49b20bf770f4"}
{"user_id": "105772463158192205034", "name": "Cheryl Smith", "time": 1486664519147, "rating": 1.0, "text": "My husband and I went by Furniture and Mattress warehouse at the suggestion of my parents. They had a good experience with the owner/manager Josh Johnson so we decided to check the store out. Our visit went great, we ordered a Stearns and Foster mattress, a couch, and a chair. $1500 including delivery. Josh told us he would be going out to Atlanta the following Thursday, February 2nd, to pick up our couch and chair and have it delivered Friday or Saturday. He'd call to set up the final details. The mattress, however, he could get to us by Monday the 30th. We set up a delivery time for 3:00. Josh stated he would call me the morning of the 30th as a reminder. Up to this point, everything was great. Until Monday the 30th rolls around, it's 3:00 and there's no reminder phone call or delivery person. I call Josh and he asks if the delivery could be changed to 5:00. OK. Fine. No problem. Five o'clock rolls around. Nothing. Six o'clock. Seven o'clock. Finally, after being stood up repeatedly, my husband (the second of the two men delivery...That we paid for) helped Josh load the California-king mattress into the house. My husband is a disabled veteran and large part off his disability is his back. It is now the 9th of February and we have not received a single phone call from Josh about our couch and chair. I've called him nine times. Once while standing in front of him yesterday. He informs me that their number has changed as of that morning. Mine hadn't. He never called me. Though it expressly states, via their own contract, that if there are any shipping or delivery set backs they will contact me immediately to let me know. So, on Monday, February 6th my husband goes to the store to inquire as to what is going on. Josh tells my husband that they're having some delivery issues but we'll definitely have our furniture by Friday. He'd be giving us a call to set up a time. However, by Wednesday afternoon still no call. So, I went to the store Wednesday afternoon and Mr. Johnson tells me that we 'should' have our furniture by Tuesday. When I asked him why he hadn't kept me informed he said he was busy keeping up with his other customers and if he neglected to call he was sorry. I asked him why he hadn't returned my calls when the number has only recently changed. Surely he got them. No. He says he never got a single one of the many phone calls I made. Then I ask him if he has my number. He says he wrote it down wrong. That's funny, because he knew it when he was talking to my husband, and it's clearly written in our contract/receipt. Oh. And he tells me they're getting out of the furniture business. Be WARY, folks. Be VERY wary. All I'm asking for is common courtesy. Keep me in the loop. I'm not unreasonable. At this point, however, if I do not receive my furniture by this Tuesday I will proceed to take civil action through litigation if I am not given a full refund of the cost of the delivery fees, couch, and chair that I have paid.", "pics": null, "resp": null, "gmap_id": "0x88f333433646516b:0x4d6a49b20bf770f4"}
{"user_id": "112816720007746911355", "name": "Amanda Johnson", "time": 1477601205883, "rating": 5.0, "text": "Awesome people and great service ... great quality furniture and mattresses", "pics": null, "resp": null, "gmap_id": "0x88f333433646516b:0x4d6a49b20bf770f4"}
{"user_id": "109191018947570519076", "name": "Jennifer Martin", "time": 1456193980441, "rating": 1.0, "text": "Best staff in town wonderful customer service", "pics": null, "resp": null, "gmap_id": "0x88f333433646516b:0x4d6a49b20bf770f4"}
{"user_id": "104372683538962936559", "name": "Artful Dobson Photography", "time": 1399321301211, "rating": 5.0, "text": "Friendly knowledgeable people and lots of stock to look at at.", "pics": null, "resp": null, "gmap_id": "0x88f333433646516b:0x4d6a49b20bf770f4"}
{"user_id": "107271517859449854400", "name": "EVERYTHING CHILDERS", "time": 1596619307738, "rating": 1.0, "text": "On Tuesday, my last shopping Pier 1 businesses ended in Jones Valley.\nGave both locations great support.  However...the Jones Valley stop CSR's had been polite & answered questions...but wouldn't help gather my large quantity of items. I had to gather, lift, & carry them.\nFollowing Spine & Hip injections, this was strain to my back & painful. Afterwards, I struggled walking. The associate permitted me to use their plastic cart. After leaving, I was complaining to myself, as I crossed the street to my car. A lady, carrying Bath & Body bag, crossed as well. I commented about the associates at the store being lazy.\nAs that person went on. I loaded my things & was leaving the cart on the grass.  The lady in the parking area yelled & demanded I return the cart. I didn't fully understand. So, I asked again what she said. She made her demand on me about 3 times.\nI asked her if she worked there? She said yes.  I asked if she was a Manager? She said Yes!\nI tried to tell her about the laziness I was dealing with.\nShe became irritated with me. No peaceful problem solving was enacted.\nShe came hurriedly at me. I asked her to stop. I warned her, she was crossing the line.  She came anyways, within inches of me, calling me lazy, grabbed my cart without my permission, & proceeded to the store, being loud, calling me lazy repeatedly, & told me to never step foot in her store again!\nShe definitely broke the Covid rules, & came to close to me besides, causes me to feel uncomfortable.\nI requested the 911 service & filed a report.\nThe Manager, should have been more professional.  She ordered me to never come back & she don't have to worry.  I don't want to!!!\nAll I can say is remember when shopping at the Jones Valley location, to take help for you, because they are not much help.  And watch out for the Quick Tempered Manager.\nIt's 4 AM & my Spine & hip still hurt.  This  is a shame!\n🥺😢", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "107071317459739365418", "name": "Joshua Trotter", "time": 1575858426985, "rating": 1.0, "text": "Was not able to purchase my items. Store did not have sufficient change for my transaction so I was told to come back at a later date. So what your telling me is that it is two weeks before Christmas, the store has been open for several hours and you don't have change for a hundred dollar bill? Why would you even open up for business without change to operate with? How many other paying customers were unable to make a cash purchase?  Staff was rude and the store manager would not even come out of the back room to talk with me? Good luck Pier 1...", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPU0jlwfSM3zhaT1N32nTJqVDZ9o_07eMFxbPMN=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "103282598827344575069", "name": "Pixie Lent", "time": 1584115022995, "rating": 4.0, "text": "I love the home items but it's a little pricey.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "110679681946722723452", "name": "Sheri Spuhl", "time": 1553832266995, "rating": 4.0, "text": "We like this store. When they have a sale, it's fun to add a colorful \"something\".  The staff is welcoming.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "109876929732465867477", "name": "Paula Lindon", "time": 1538497314620, "rating": 5.0, "text": "My happy place! Love it!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO_kINjf6QEtPZ0mamrFtOoQvxkW4_JweODiERE=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "111103448624712417306", "name": "Tim Harrison", "time": 1556914868568, "rating": 3.0, "text": "So-so store. You can get some great deals on sale items. Full price is usually kind of expensive.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "117593790248128865682", "name": "Christina Morgan", "time": 1531663067134, "rating": 5.0, "text": "It's everything you expect forom pier one regarding selection and quality products. No better place for fun and tasteful holiday decor.\n\nThis particular location has really stood out in terms of helpful staff. Several times I have gone in not sure of exactly whathat I wanted, and the staff had gone above and beyond helping me find just the right thing. I'm not very creative and they have helped my 'create' pieces, step by step. When looking for decor, I head to them first due to the phenomenal staff!!", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "115497722345361542884", "name": "Lester Pettigrew", "time": 1534275848508, "rating": 5.0, "text": "The coolest home decor ever.  Great quality, and the management and staff are unbelievably nice, helpful, friendly, and knowledgeable!  You can tell they love what they do!  5 stars!", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "116375795311771033205", "name": "Larry Trotter", "time": 1575836704248, "rating": 1.0, "text": "Left without purchasing anything! Very Rude employees and Manager did not care less! We went around the corner to Kirkland's and purchased what we needed. Pier 1 will not be around much longer with this kind of service and a manager ( Mrs. Pearl) with this kind of attitude.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "112157942195524329589", "name": "B Gram", "time": 1539199256397, "rating": 3.0, "text": "Stuck up and snobby staff if you don't look or dress a certain way. What a shame I'm getting a new house and have to buy all new things that I CAN afford. Oh well", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "103636341865003541787", "name": "Jamie Martin", "time": 1524249447264, "rating": 5.0, "text": "Fun place to shop. Cool things for the home.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "100900673476076835592", "name": "Brenda Estes", "time": 1538677091388, "rating": 5.0, "text": "Its was great. Love to shop there.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "106962621146393133463", "name": "Tammy Willard", "time": 1565218913434, "rating": 4.0, "text": "This time they didn't have I was looking for!", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "100660789357925265329", "name": "Cathy Clayton", "time": 1545174916712, "rating": 1.0, "text": "Service at this store is pathetic. I will NEVER go back.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "116431655015737564777", "name": "Kelli T", "time": 1560896843697, "rating": 5.0, "text": "Great customer service!", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "111660817966346698445", "name": "Jenny Michell", "time": 1537488615930, "rating": 5.0, "text": "Great ideas for the fall season.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "100386425429642777456", "name": "Sharon D", "time": 1541441399896, "rating": 5.0, "text": "Love everything about this store!", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "104419054227614586866", "name": "McH", "time": 1573512537789, "rating": 3.0, "text": "Poor signage for pickups.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "104419054227614586866", "name": "McH", "time": 1573512537789, "rating": 3.0, "text": "Poor signage for pickups.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "105734570444463276438", "name": "Sabrina Presto", "time": 1557152347096, "rating": 5.0, "text": "Good inventory", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "115528406213882565351", "name": "Kenneth Goodman", "time": 1577955505250, "rating": 2.0, "text": "Prices are absurd", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "115402112087852377407", "name": "Kim Bell Schneider", "time": 1526109977647, "rating": 5.0, "text": "I bought some candles for my den.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "112063266865011896466", "name": "Asher Berry", "time": 1567529080541, "rating": 3.0, "text": "sort of uninspiring", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "102278539317649006143", "name": "Matt G Alabama", "time": 1582057961628, "rating": 5.0, "text": "Look this place!!!", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "104508602908151275721", "name": "Nancy Stein", "time": 1540525618201, "rating": 5.0, "text": "Love!", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "114406275812554411386", "name": "Jeanice Bengen", "time": 1578609069256, "rating": 4.0, "text": "Took advantage of their clearance sale by getting 4 place mats and a wicker, center mat for $10!! Looks perfect for a simple, country dining table. I love it!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPeXPoq_CFLNPUHH8Rj45WuUb1x06iDa0qARM1V=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "107107739156534720158", "name": "tammy myrick", "time": 1564794645330, "rating": 5.0, "text": "I usually shop at the Pier 1 in Mobile so this was my 1st time there. The store was really neat and the staff are very friendly and helpful!", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "104937206293796425931", "name": "Laurie Watson McKay", "time": 1551983901040, "rating": 4.0, "text": "Got a wedding gift here. Lots of options. Good service and great suggestions from this team.", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "113047294319066253355", "name": "KG Gregory", "time": 1581193897577, "rating": 5.0, "text": "Great selection of out of the ordinary!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOqCvNNx70qTyKyfcm59gfEhA62l_7x0T7uPE1x=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "104182078409804619282", "name": "3 4", "time": 1537392510642, "rating": 5.0, "text": "Always having what I need with great deals and many sales going on, with candles 2 for $20 couldnt ask for a better deal this season I'm never disappointed when going to pier 1 there my to go store and always finding exactly what I need for any occasion!!", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "105016602552113881222", "name": "Yancey Burnett", "time": 1568480785826, "rating": 2.0, "text": "Apparently one must be Buddhist to visit. . .i was unaware of this requirement", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "115822886348509515283", "name": "Alisha Rogers", "time": 1557787630214, "rating": 5.0, "text": "Love the decor they sell here.", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "112977397783382884839", "name": "Kim Tracey ella", "time": 1507423098297, "rating": 4.0, "text": "Really like pier one good selection seasonal sales and stuff is great", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "104612904390308305955", "name": "S.T.", "time": 1582268294457, "rating": 5.0, "text": "Pier 1 is the best!!", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "103246143089647318058", "name": "Susan Fonger", "time": 1527377558186, "rating": 5.0, "text": "Terrific staff", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "103684200412476034323", "name": "terry bassett", "time": 1532317495468, "rating": 4.0, "text": "Nice variety, great sales", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "103497753982844813125", "name": "Joanne Wilson", "time": 1533434539056, "rating": 5.0, "text": "I love this store.", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "102147192039150348754", "name": "Tommy Robinson", "time": 1494548991234, "rating": 5.0, "text": "Great stuff but prices are high", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "106382018876201438337", "name": "Jo-Amrah Dillingham", "time": 1622929902882, "rating": 4.0, "text": "Great folks. Great products.", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "112356973833227714412", "name": "Glenn Byrum", "time": 1608315315264, "rating": 5.0, "text": "Great place to shop for furniture. Friendly staff and very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "108467101914049692248", "name": "Jarrod Pickett", "time": 1565025652901, "rating": 5.0, "text": "Wonderful business. With generous spirits this family welcomes all customers with gratitude and kindness. I'd recommend Shumake furniture to any and everyone. GOD BLESS YOU AND YOUR BEAUTIFUL FAMILY.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO1KcTfOdFp0JpA8T_NAq0mZGUV-Nl95YmmP2Tb=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "117177041892050452149", "name": "Jean Thompson", "time": 1610827927564, "rating": 4.0, "text": "Loved the show cases. A huge place.", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "100983391713924196991", "name": "Roy Parrott", "time": 1616502084761, "rating": 5.0, "text": "Very nice stuff and friendly staff", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "104032130813831683492", "name": "Jimmy Ray Smith (JRay)", "time": 1620509671291, "rating": 5.0, "text": "Always a Great experience", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "114935365508513969525", "name": "Casey Thompson", "time": 1596231989376, "rating": 2.0, "text": "We will not be back or recommend this place to anyone. When we got there the lady helping us really didnt seem to want to help us. We picked out a couch and they were trying to talk us into getting it a different day bc the loading or  delivery guys were not there. I told her my husband and I would load it bc we wanted it that day. They still wanted us to let them deliver  2 days later. It was getting close to closing time but we ran home got our trailer, loaded it and was pulling out of the parking lot at the exact time they were closing. 4 people helped us with the cushions but it was more like to get us gone. We paid over 1,000 and hate the couch. The cushions have to be adjusted EVERY TIME u sit on it.", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "110353406261446861999", "name": "Joseph Martin", "time": 1578692067973, "rating": 4.0, "text": "Friendly staff, decent prices. The staff allows you to look without hovering. Our particular salesperson took notes as to what we looking for and assisted in recommendations based on our likes. Will purchase again from them.", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "104006445910363339137", "name": "Andrea Matovina", "time": 1571629011005, "rating": 4.0, "text": "Very helpful, beautiful, modern furniture and decorations. A little pricey but not to unreasonable", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "102728450790143536902", "name": "Demian Pearce", "time": 1508436688476, "rating": 5.0, "text": "Buying furniture at Shumake Furniture is one of the better retail experiences in Alabama. Jerry Shumake is knowledgeable, fair dealing and good people. I’d recommend buying a sofa or chair here before anywhere!", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "111059903245875784987", "name": "Jeannabeanna Stephens", "time": 1544119266056, "rating": 5.0, "text": "Very friendly and knowledgeable. If it's not in the store, they can get it for you quickly. Best furniture store ever!", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "105696775137482807939", "name": "Sue Mitchell", "time": 1449679502765, "rating": 5.0, "text": "Shumake Furniture has provided furniture for my home for over 40 years.  The staff is great.  Prices are great.  Free delivery in North Alabama is appreciated.  I will continue to purchase quality furniture from Shumake Furniture in the future.", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "106548974358121441924", "name": "Rose Davis", "time": 1505615371184, "rating": 5.0, "text": "Got a really good  deal  on a sofa, love  seat, beautiful  dinner table.", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "115627596100762279714", "name": "Mike Price", "time": 1500053020155, "rating": 5.0, "text": "Huge selection great pricing very competitive for your business.", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "111588396565209426053", "name": "Gheymarne", "time": 1542137334364, "rating": 5.0, "text": "Love the furniture and staff was extemely helpful.", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "104971962578873841610", "name": "Jason Roden", "time": 1486255526136, "rating": 5.0, "text": "Very nice staff and a good place to order furniture.", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "118239672340452478021", "name": "Jerry Shumake", "time": 1610721443953, "rating": 5.0, "text": "Tries hard to please and us 84 yrs old.", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "114832451787642463340", "name": "John Zink", "time": 1561917540900, "rating": 5.0, "text": "Very nice 👍👍👍👍👍", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "108327196582976773194", "name": "Melissa Knighten", "time": 1542320103957, "rating": 5.0, "text": "They were wonderful to work with", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "116562572913917888657", "name": "Dana Barton", "time": 1558830850455, "rating": 4.0, "text": "Very nice", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "110912008410745217495", "name": "Tim Cadman", "time": 1547949009030, "rating": 4.0, "text": "Great furniture store.", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "113943640968508469192", "name": "Auston Davis", "time": 1557004807984, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "116783420279535556784", "name": "JD Thorne", "time": 1515104288843, "rating": 5.0, "text": "Huge selection", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "106074272060054718964", "name": "Daron Winsett", "time": 1494456596118, "rating": 5.0, "text": "Great folks good furniture", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "107212337553056573441", "name": "Brad McClellan", "time": 1490229976825, "rating": 4.0, "text": "They even have a little place for kids to play. Furniture is okay", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "110004620699551652606", "name": "Micah Rice", "time": 1490472820043, "rating": 2.0, "text": "Over priced. Creepy-pushy staff.", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
{"user_id": "112468411765209665811", "name": "Kim", "time": 1623935606572, "rating": 4.0, "text": "The sales lady was real sweet and kind. And times have been tough business wise on everyone, prices were a little higher. Tan most places but she worked on price with us a bit. Supply and demand was evident throughout the store.\nI didnt however like the fact, the finance part of it was a surprise. And i will pay off early due to it being on a card and not really thru shumake or a local finance company. And my downpayment ended up being more than i wanted to place down, that should of factored in during financing.", "pics": null, "resp": null, "gmap_id": "0x886286afc3bf049d:0xb5755f1ee60a2218"}
