{"user_id": "113387965465072167795", "name": "Wanda Smith", "time": 1613415668249, "rating": 5.0, "text": "Great lawyer merrill VERY willing to help in any situation,and VERY CARING about what your going through 👏", "pics": null, "resp": null, "gmap_id": "0x888bb3befe31c2e5:0x6ec0d055da097452"}
{"user_id": "107935249538157259915", "name": "ken moore", "time": 1600969486770, "rating": 5.0, "text": "Good people.   Would recommend to anyone", "pics": null, "resp": null, "gmap_id": "0x888bb3befe31c2e5:0x6ec0d055da097452"}
{"user_id": "100677240391595878739", "name": "rachel reynolds", "time": 1519162934122, "rating": 3.0, "text": "Everything went fine until a year later and I find out the lawyer I used here did not get the papers signed by the judge. I had to drive 2 hours to get it signed and the clerk at the courthouse took pity on me and had it signed", "pics": null, "resp": null, "gmap_id": "0x888bb3befe31c2e5:0x6ec0d055da097452"}
{"user_id": "117589882664973447529", "name": "Amanda Kerr", "time": 1542893273403, "rating": 5.0, "text": "Very informative", "pics": null, "resp": null, "gmap_id": "0x888bb3befe31c2e5:0x6ec0d055da097452"}
{"user_id": "103370171029155604273", "name": "Kareem McNeal", "time": 1627620767453, "rating": 5.0, "text": "First of all, I can't thank Heather Leonard enough for representing me concerning a serious matter.  She was so professional, thoughtful, caring and hard working on my case.  I could not have had better representation.  I would highly recommend her for anyone that needs representation regarding discrimination  issues in the workplace.", "pics": null, "resp": null, "gmap_id": "0x88892275ceaf6fb3:0x7b1df3061b14954f"}
{"user_id": "116591767391018907917", "name": "Glenda Taylor", "time": 1626440751853, "rating": 5.0, "text": "Heather is a very knowledgeable employment law attorney who works diligently for her clients and does not stop until there is a resolution.  She is kind, intelligent and a hard worker. I highly recommend Heather for your employment law issues.", "pics": null, "resp": null, "gmap_id": "0x88892275ceaf6fb3:0x7b1df3061b14954f"}
{"user_id": "106698333494008360820", "name": "Allen Arnold", "time": 1623081906010, "rating": 5.0, "text": "Heather Leonard is one of the most respected employment law attorneys in the State of Alabama.  She is passionate about pursing her client's claims and one of the most knowledgeable and conscientious attorneys' I know.", "pics": null, "resp": null, "gmap_id": "0x88892275ceaf6fb3:0x7b1df3061b14954f"}
{"user_id": "110655717319314538695", "name": "Ken Thomas", "time": 1606915061747, "rating": 5.0, "text": "If you haven't been down this path before you will be filled with questions.  With Heather, she is very responsive and takes time to answer your phone calls, emails and questions.  Her emphasis in her response is to educate you as to what she is doing and why.  She was always prepared for every meeting that we had but also made sure that I was fully prepared.  Her confidence, experience and knowledge are reflected in everything that she does and allowed me to be very appreciative of her representation.", "pics": null, "resp": null, "gmap_id": "0x88892275ceaf6fb3:0x7b1df3061b14954f"}
{"user_id": "106522503992420325190", "name": "Edward Thomas", "time": 1480434961578, "rating": 5.0, "text": "On a mission to satisfy her clients", "pics": null, "resp": null, "gmap_id": "0x88892275ceaf6fb3:0x7b1df3061b14954f"}
{"user_id": "114304613011332178479", "name": "Joy Steiner", "time": 1565539010033, "rating": 5.0, "text": "Jason is the best of the best! He goes above and beyond for his clients. He is not only the definition of professionalism but compassion. He treats his clients with respect and understanding. I recommend Jason to anyone who is looking for an attorney who will give them 110% of his attention and see the case through till the end.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "116183860817643019519", "name": "Meredith Gonzales", "time": 1562425179011, "rating": 5.0, "text": "After my auto accident, I needed help dealing with the insurance companies and healthcare providers.  I'm glad I chose The Hadley Law Firm as they went above and beyond.  Jason never backed down, stuck with it to the end, and made sure I was given the facts to make informed decisions during the whole process.  There's no doubt he has your best outcome in mind when handling your case.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "115903811930070579191", "name": "mauricedallastx", "time": 1547407100842, "rating": 5.0, "text": "The Hadley Law Firm was very professional, friendly and honest when I used them for two traffic violations I received in Bay Minette.  Jason and his staff were dependable and able to get done what I requested with ease.  I give Jason and his team two thumbs up.  FIVE STARS", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "116508195431461017782", "name": "Lee Lee", "time": 1598919882827, "rating": 5.0, "text": "He has been good to me", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "117529433990824390027", "name": "Kim Sinclair", "time": 1571716593387, "rating": 5.0, "text": "Jason is very professional and has provided excellent service! I would highly recommend The Hadley Law Firm.\nThanks again for doing a great job!", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "116227572432356133996", "name": "danny cox", "time": 1562812152126, "rating": 5.0, "text": "Jason handled a very difficult motor vehicle accident for my family. What a great man and attorney. I would not hesitate to recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "100365515552180493794", "name": "Ashley Tuberville", "time": 1546999957177, "rating": 5.0, "text": "Very Professional! Best all around Attorney in the area! He sincerely cares about each of his clients and not just his payment for your case like most Attorneys. If you are looking for the best and most honest Attorney , Mr. Hadley is the one!!!", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "100628431226722367255", "name": "Janna Mosley", "time": 1561954823923, "rating": 4.0, "text": "I really  like them there,they all are nice  and friendly  and they  have a nice  office.I really  hope he can help me.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "116737967030244112660", "name": "Jody Conway", "time": 1529443783641, "rating": 5.0, "text": "Very nice,  handled my vehicle accident claim very well.  Keep me update on what was going on and always responded to my emails when he could.  I would use Jason again if I ever need (and I hope I don't)  a attorney again, he will be the one I call.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "107672768044917480399", "name": "BLAKE COLEMAN", "time": 1536934908442, "rating": 5.0, "text": "THE ABSOLUTE BEST!!! I COULD NOT HAVE BEEN HAPPIER WITH MY CASE! THIS MAN CARES ABOUT HIS CLIENTS AND GOT ME WAYYY ABOVE AND BEYOND WHAT I WAS ANTICIPATING THE OUTCOME TO BE!!", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "116778476373173714145", "name": "Mark Link", "time": 1530043530900, "rating": 5.0, "text": "Jason handled a personal injury case with me and I found that he was very knowledgeable about the legal issues involved in the case.  Mr. Hadley was very attentive to our particular needs and I would highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "115783283928509425387", "name": "Rocky Langham", "time": 1529447333307, "rating": 5.0, "text": "Jason was very detailed in handling my claim he gave me a lot of useful information I thought I had no leg to stand on he let me know he was going to do everything he could to help me ! I would recommend him to anyone with an accident claim", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "103935127809470610959", "name": "Ernest Walker", "time": 1529378699815, "rating": 4.0, "text": "Very professional and helpful staff there. Mr. Hadley is currently representing me in a vehicle accident claim and as of date I am very pleased with everything.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "113536626796489248141", "name": "Stephen Williams", "time": 1528488715181, "rating": 5.0, "text": "Outstanding Attorney.  Impressive record.  Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "114388024242109666645", "name": "Freda DuBose", "time": 1589771974362, "rating": 5.0, "text": "Nothing bad to say", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "103764959238313961608", "name": "Joyce Lambert", "time": 1550716784275, "rating": 5.0, "text": "Very honest. Trustworthy.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "117366158679796009563", "name": "C Riddick", "time": 1524881959932, "rating": 5.0, "text": "Professional, reliable & organized. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "118410199404825866695", "name": "Patti Anderson", "time": 1514013196148, "rating": 5.0, "text": "Great first meeting. Conscientious attorney.", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "108890373709654654689", "name": "Connie Whatley", "time": 1565984923801, "rating": 5.0, "text": "Best Law Firm in Bay Minette I recommend it", "pics": null, "resp": null, "gmap_id": "0x889a04b3f711bff5:0x5b6ca58ee8532930"}
{"user_id": "103422731649240496676", "name": "Donna Dew", "time": 1613868510695, "rating": 5.0, "text": "Professional, and reliable.  They don't mind you calling them anytime and they are all straightforward.   I would highly recommend any attorney with this firm.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "117106067095096920217", "name": "Natalie Schibell, MPH", "time": 1564877685609, "rating": 1.0, "text": "I would give no stars if I could as I have made three calls over the course of two weeks seeking representation without a response. The answering service used is either not recording messages or the attorneys are being selective. I realize my matter is a small one; however, a return phone call within a reasonable amount of time is the bare minimum expectation this firm could not meet. I have worked in a prominent law firm for nearly a decade and know the value of customer service with every client, both large matters and small. I unfortunately cannot use that law firm as I moved a great distance away. Parkman and White, please return your phone calls, whether you can take the case or not. No firm is too big or an attorney too important to make a courtesy return call or email, at a minimum. You can even have your staff perform the task for you. This way a potential client cannot waste additional time and effort and can call someone else who cares enough to provide the service.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "111156296796968826477", "name": "Ryan Blanch", "time": 1546987508231, "rating": 5.0, "text": "We’ve litigated and tried several major cases together.  What a team.  These guys are simply awesome.  Jim Parkman captivates juries and judges alike with his humor and courtroom presence. Will White’s no-nonsense cutting cross examinations destroy government witnesses.  No one I’d rather go to trial with.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "106165058868512638419", "name": "jonny harvell", "time": 1396642946579, "rating": 5.0, "text": "To describe the ability of these men in their element is nearly impossible. I could not imagine a better team of attorney's to handle any civil, state or federal case. The honesty and determination showed during my case was, in one word, \"AMAZING!\" The experience and expertise displayed inside and outside the courtroom was outstanding. These guys are professionals on every level. If you are reading this and have a loved one in need of an attorney or need one yourself, Parkman & White is where your research should end!", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "114035976289212752360", "name": "Victor Revill", "time": 1522376972046, "rating": 5.0, "text": "These are outstanding attorneys at this firm!!!   I was wrongfully arrested and charged in Blount County.  Attorney Clayton Tartt represented me and he did an AMAZING JOB.  He was prepared, professional, persistent, caring, compassionate, and an outstanding litigator!!! I am a Criminal Defense lawyer that was charged with a crime. I went to Clayton.  If a Criminal Defense lawyer chooses a Criminal Defense lawyer, then he will only choose the best.  I chose Clayton because I knew he cared about his clients and I knew he would be willing to fight. He fought to get me acquitted and I am forever grateful!!!  Trust me, Clayton is an outstanding attorney!!!", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "114179602382429607670", "name": "Jenn Carroll", "time": 1505733591701, "rating": 5.0, "text": "By far the best!  William White and Jim Parkman are amazing at what they do. Anyone that ever asks me about a lawyer, I would refer them to Parkman and White, LLC. Best decision I have ever made.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "105896313030068805818", "name": "Mike R", "time": 1544203239922, "rating": 1.0, "text": "Mr. Parkman charged me tens of thousands of dollars.  I am convinced that he deliberately undermined my case. I had to hire another attorney to defend my case. I found Mr. Parkman to be insufferable,  highly inflammatory, arrogant and strikingly incompetent.  I really like William White.  He deserves a medal of honor for tolerating Jim Parkman.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "100546642756578913720", "name": "Krystal Dixon", "time": 1424197208723, "rating": 5.0, "text": "We hired Parkman and White after my husband was accused of a crime that could have landed him in jail for many years. He had done nothing wrong and unfortunately in our world of technology a computer virus was almost our undoing. We were told that if we wanted the best we should hire Parkman and White. We met Jim Parkman face to face a couple of times and though I did not have the pleasure of meeting William White, I had numerous phone conversations with him. They worked diligently to clear my husband's name. It took almost two years but the night before we were to go to court Mr. White called to inform us that all charges had been dropped. They fought to prove his innocence and I am so thankful that we were sent their way. Mr. Parkman and Mr. White definitely lived up to their reputation of being the best. If you have a legal issue I would highly recommend you get in touch with their law firm.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "118421791758961523093", "name": "S Cole", "time": 1389135539421, "rating": 5.0, "text": "When the stakes are the highest, and your personal reputation, recieving professional, educated, tanacious and agressive defence are of paramount importance . Parkman and White are the ONLY law firm to TRUST and RELY on.  William White and his team assisted me in a time of great legal need with my reputation, financial security, and potential criminal charges against myself. William White was tenacious, exposed the truth and my case was dropped in a Grand Jury Investigation.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "109234907529080186731", "name": "Amanda Griffin", "time": 1527468335058, "rating": 5.0, "text": "Best attorneys in the southeast.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "105250244298431966835", "name": "Roderick Covington", "time": 1436988398230, "rating": 5.0, "text": "During a time when I sought justice and it was nowhere to be found, I found Parkman and White.  And trust me, they helped me find justice.   At the end of my trial, justice prevailed and I was found not guilty on two counts of charges which ended my career.  If you are looking for justice, if you are looking to make a wrong right, look no further than Parkman and White.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "100545436300754474026", "name": "Clark Thompson", "time": 1422991621951, "rating": 2.0, "text": "Firm was unable to help with my case.  May have been isolated to my situation though.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "115688964345782374995", "name": "heath wright", "time": 1615988272038, "rating": 1.0, "text": "I LOST money by retaining Lindsey Simmons. She didn’t even increase my WC settlement for as much as she charged in fees. However, she was kind enough to send someone to intercept my settlement check on the day of court so she could get paid first.\nBAD EXPERIENCE ☹️☹️☹️", "pics": null, "resp": null, "gmap_id": "0x8889179814ed4fe9:0xa8b3e661cf8e4531"}
{"user_id": "104821561651341518868", "name": "Taylor Hayes", "time": 1575994291901, "rating": 1.0, "text": "Spent 4 hours with Larry, he gave me a game plan, fed me tons of false hope, told me I have a great case, got extremely excited, signed papers with me, and said he'd represent me. Told me to keep living my life and he had everything under control. Didn't respond to phone calls and emails for a month. Then sent me a letter saying they wouldn't represent me in any of my cases but recommended I file with the EEOC and seek further legal counsel elsewhere but gave me no recommendations. I feel like I was enthusiastically lied to and now I'm at square one. Makes no sense. Very unprofessional.", "pics": null, "resp": null, "gmap_id": "0x8889179814ed4fe9:0xa8b3e661cf8e4531"}
{"user_id": "104754238100313209315", "name": "Ada Alabama", "time": 1547784068238, "rating": 1.0, "text": "Run as fast as you can away from this law firm.   If you are using them fire them right away.  They do not understand what it  is like to live in constant pain from an injury.  They are not aggressive but are the biggest wimps when it comes to standing up for their clients.   Once you are away from them you will find out all of the things they did not bother to find out or perhaps purposely did not tell you.   Again, they will not stand up for you.   Find a better law firm.  They are useless when you need them the most.", "pics": null, "resp": null, "gmap_id": "0x8889179814ed4fe9:0xa8b3e661cf8e4531"}
{"user_id": "102932560093225843725", "name": "Christopher Calvin Reid", "time": 1523544004142, "rating": 5.0, "text": "Alex is the best Attorney in his field. He is a genius in the courtroom and he finds a way to win when other attorney's call it a day. He was an excellent Attorney back in law school and has only improved! #reidlawalabama fully and completely endorses him. Anyone who would give him less than 5 stars has no clue what they are talking about.", "pics": null, "resp": null, "gmap_id": "0x8889179814ed4fe9:0xa8b3e661cf8e4531"}
{"user_id": "100913928216304870316", "name": "Donald Wise", "time": 1578979166888, "rating": 1.0, "text": "I had hired them I have left 15 messages no return calls totally disrespectful people", "pics": null, "resp": null, "gmap_id": "0x8889179814ed4fe9:0xa8b3e661cf8e4531"}
{"user_id": "103093421134046720055", "name": "Janey Whitney", "time": 1523595751937, "rating": 5.0, "text": "Love King Simmons, P.C.! This is a great and trustworthy firm. Alex Ealy does great work!", "pics": null, "resp": null, "gmap_id": "0x8889179814ed4fe9:0xa8b3e661cf8e4531"}
{"user_id": "107470153095142478972", "name": "Dowdell Dowdell", "time": 1478473609845, "rating": 5.0, "text": "They love people not color treated me like family...", "pics": null, "resp": null, "gmap_id": "0x8889179814ed4fe9:0xa8b3e661cf8e4531"}
{"user_id": "102801205968130077081", "name": "Mary Amerson", "time": 1583728788636, "rating": 5.0, "text": "Friendly", "pics": null, "resp": null, "gmap_id": "0x8889179814ed4fe9:0xa8b3e661cf8e4531"}
{"user_id": "102932560093225843725", "name": "Christopher Calvin Reid", "time": 1584589989146, "rating": 5.0, "text": "William white was one of the most helpful attorneys I have met and had a profoundly positive impact on my legal career. Every attorney associated with this firm is the best of the best and that comes from a competitor .", "pics": null, "resp": null, "gmap_id": "0x889292f8b79b0a37:0xa4e18dd5affce3d5"}
{"user_id": "113647078620422091334", "name": "Alan Hovexak", "time": 1620444511727, "rating": 2.0, "text": "It's best to ask the important questions first..", "pics": null, "resp": null, "gmap_id": "0x88626b253bc1048f:0x2785bce9c0a3787f"}
{"user_id": "117855936913871316166", "name": "Kim shelton", "time": 1522193078184, "rating": 5.0, "text": "I hired him to appeal my disability application.  Had to wait three years for a hearing date, but we got the scariest judge and he walked in and proved I was disabled.  It was pretty cut and dry, but he had all my medical records and was ready for everything.  Definitely recommend him.", "pics": null, "resp": null, "gmap_id": "0x88626b253bc1048f:0x2785bce9c0a3787f"}
{"user_id": "101473299481745838986", "name": "Anna Ryan", "time": 1555688135439, "rating": 5.0, "text": "Good lawyer. Very helpful. Straight and to the point.", "pics": null, "resp": null, "gmap_id": "0x88626b253bc1048f:0x2785bce9c0a3787f"}
{"user_id": "115776356813940993555", "name": "Frank Wagner", "time": 1543619887798, "rating": 5.0, "text": "Great job on a tough case.", "pics": null, "resp": null, "gmap_id": "0x88626b253bc1048f:0x2785bce9c0a3787f"}
{"user_id": "103539711681091475585", "name": "Nicky Hardin", "time": 1474472282073, "rating": 5.0, "text": "Great attorney! He will fight for you persistenly!", "pics": null, "resp": null, "gmap_id": "0x88626b253bc1048f:0x2785bce9c0a3787f"}
{"user_id": "102793879381636661444", "name": "Jacob", "time": 1520579363485, "rating": 5.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x88626b253bc1048f:0x2785bce9c0a3787f"}
