{"user_id": "114720194413747308763", "name": "R T", "time": 1614901009216, "rating": 1.0, "text": "I went by there to find out the cost to mail something simple 9 x 6 envelope with papers enclosed. I was given a price of $4.36 to mail it. I asked what the store store was (Surcharge) and the lady did not know. I left and did not mail it there. I took it to the post office downtown Decatur, Alabama and the Total cost was only $2. What kind of extra charges is this place charging?", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "114441491131382657787", "name": "Kris Small", "time": 1595953548046, "rating": 1.0, "text": "I've never once been asked what I am shipping ever by any company. I was attempting to ship some very valuable items to my brother in Ca. today and was asked what I was shipping, I stated personal items nothing hazardous. She asked me to describe the item.... that's how they figure out what packages to steal I guess.  because I've had plenty of packages go missing in the mail. if it's hazardous sure I understand but it's not and not on the prohibited list. so they don't need to know. I'll take it to UPS or Fedex next time directly.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "113782076434936919802", "name": "Joey Anderson", "time": 1581617285842, "rating": 5.0, "text": "I am very impressed with this store and their employees. I was greated before I made it completely through the door. The staff is upbeat and professional. They were able to service all of my needs and super knowledgeable. I will definately be going back. Thank you for such a wonderful experience.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "105894517387541931417", "name": "Jason Jameson", "time": 1571417959113, "rating": 5.0, "text": "Amazing store, most polite employees, FedEx shipping. Ignore other reviews where people are not posting honest information. The Shipping Store & More offers FedEx shipping and has amazing employees!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "108084887572777496456", "name": "Jay Boyd", "time": 1581458906888, "rating": 5.0, "text": "The employees are very friendly and helpful at this esablishment. I am exteremly satisfied with their professionalism and expertise. I appreciate their services and friendly smiles.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "100483729770111816809", "name": "Glen Hunter", "time": 1576823465784, "rating": 5.0, "text": "The 2 clerk's working today were very helpful and professional and handled my packing and shipping needs very quickly. I would definitely recommend this store for all your packing and shipping needs.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "107824479444157216157", "name": "Bill Jehle", "time": 1440517629378, "rating": 5.0, "text": "As the chief cook and bottle washer of my own business, the kind folks at The Shipping Store are my staff. I could not run my business without them. Shipping and receiving, not a problem. Notary, not a problem. Photocopies, packing material, anything an average office would need, not a problem. Blueprints, full-sized plans that require a plotter, again, not a problem. Plus, it's great to walk in and folks know me by name. Let The Shipping Store be your secret weapon to make your life or business life a little bit easier.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "109508137692215896816", "name": "Captain_Redpill", "time": 1553722820451, "rating": 1.0, "text": "Won't be going back to this place ever.  The lady working there completely refused to serve me.  Went two miles down the road and had the service performed at the ups store,  without question.   Continue to watch your business fail.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "116113654703355588114", "name": "Alexa Womack", "time": 1462886507362, "rating": 5.0, "text": "Such a welcoming store! I was greeted by every person in the store upon entering and leaving. They were even willing to get my package ready to go even though it was UPS. I was only there for a few minutes but I really felt that the employees enjoyed their job! Definitely recommend using them.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "105389454577494015329", "name": "Brian Moran", "time": 1448147712160, "rating": 5.0, "text": "I have to say that I've never been taken care of in the way this team takes care of my needs. As a small business person myself, I appreciate the attention to detail, warm environment, and sincerity I receive when I walk into with The Shipping Store. I've read some of the other reviews and I would have to say that their prices are very fair. They provide a service that I have not seen matched with other big company chain stores. It is an absolute pleasure to do business with these guys!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "107847402129431752361", "name": "Sandra Austin", "time": 1594243283093, "rating": 1.0, "text": "Anytime I mail from here it takes many days for the package to get anywhere.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "106934267714093912358", "name": "Christina Morse", "time": 1463755936331, "rating": 5.0, "text": "The employees at The Shipping Store were super friendly and helpful! They did everything they could to save me money on shipping. If you have anything to ship, I would definitely recommend The Shipping Store. They made shipping a breeze!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "100668768891717817680", "name": "Jennifer Melcher", "time": 1464146531134, "rating": 5.0, "text": "We took in a fragile item and they packed it for us wonderfully. They were super nice and not just to us but to everyone that came in. They also showed us ways they could help our small business save money on shipping and printing. We will definitely use again!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "110547199723346370010", "name": "John Wallace", "time": 1563465552462, "rating": 1.0, "text": "They do not ship fedex, waste of my, yours and everyone's time.  Fedex sign in window, rude lady behind the counter..DO NOT GO HERE IF YOU ARE TRYING TK SHIP A FEDEX PACKAGE, FALSE ADVERTISEMENT..!!!!!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "106542589286602344651", "name": "jose villa", "time": 1575930733783, "rating": 1.0, "text": "Waste of time they say they ship fedex but they don't they are limited so you have to go to the one in Madison. Why even call it the ship in store where they can't ship nothing", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "118445472702982105366", "name": "susan hassett", "time": 1441054295523, "rating": 5.0, "text": "I have used The Shipping Store for many years to mail packages, have copies made and faxes sent. I appreciate the professional and friendly staff. Their packaging services help me save time and enable me to send packages hassle-free.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "109596769324101350077", "name": "Tracy Roberson", "time": 1463225262109, "rating": 5.0, "text": "The staff are always professional and courteous when I bring things in to have shipped.  I wish the same was true of USPS. The Shipping Store has never lost any of my parcels with the many dealings I have had with the business. You can probably guess who has. I will continue to bring my business here as long as they are here. Thank you.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "115160726920482923383", "name": "Jenna Burfield", "time": 1558036223914, "rating": 1.0, "text": "Store staff was very rude. TERRIBLE CUSTOMER SERVICE!! I brought in a package to be shipped and asked for documentation stating that I dropped a the package off. The lady behind the counter stated that if I wanted a receipt that I could wait until FedEx picked it from their location and scanned the barcode (who is to say they wouldn't loose my package) or I could drive to Madison.\n\nEdited to inform that I was able to take my package to Walgreens for drop off. The Walgreens staff were friendly and promptly emailed me a recept for my records. THERE IS ABSOLUTELY NO EXCUSE for the pushback I received when I asked for a simple drop off receipt from The Shipping Store.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "104087776520124817766", "name": "Mary McMahan", "time": 1440260718055, "rating": 5.0, "text": "Amanda saved me from losing my $4900.00 ring to a scammer on Craigslist.  I am so grateful to her and to this store for hiring her.  This experience has brought renewed faith that there are still people who work for businesses that genuinely care about their customers !!  Amanda, you are an angel, I will always be grateful for you and I pray blessings upon you and your family !!  The Shipping Store....don't ever let her go !!!!!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "106889816728629286135", "name": "Laron Hardy", "time": 1462390895397, "rating": 5.0, "text": "Great people, great service!  The Shipping Store is a place where you will be taken care of.  Great folks!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "117270700978745782182", "name": "AK Lee", "time": 1495585833241, "rating": 5.0, "text": "They offer a great service and and I even paid for the tape it was worth it", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "117701923495067398210", "name": "L D", "time": 1377130186414, "rating": 2.0, "text": "Way overpriced. $0.75/each for stamps! Their shipping costs are also astronomical. I went there to ship a package and was quoted an amount so high that I thought it was a joke. It wasn't. I then went to Staples right down the street to get a quote from their shipping center and it was 50% less. Stay away from this place!", "pics": null, "resp": {"time": 1493327901599, "text": "Jill,\n\nFirstly, thank you for patronizing our business.  We take great pride in our friendly, high level of customer service.  As to your comments about our service charges,  If we weren't able to realize some level of margin over our costs, we would not be able to maintain a viable business or be able to offer the level of service that we so pride ourselves in.\n\nThanks sincerely,\nDon Cantrell\nThe Shipping Store and more..."}, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "101710291188347059144", "name": "cassandra chittam", "time": 1447866224969, "rating": 1.0, "text": "Closest shipping place to our company.  We will be driving the extra distance to find an actual post office from now on.  Pricing is extremely high to send out items USPS.  When I called asking why they charged my assistant 10.74 for a small FLAT RATE box, I was told they do not honer flat rate shipping.  I then asked why did they not inform my assistant of this and they stated because all she said was she needed to ship these items. The lady behind the counter didn't know what she was doing.  First time she rang up the bill the total came to $4000 for USPS shipping. Wanting to use USPS services for your packages stay away from this place unless you want to pay double what you would if you went to the post office.", "pics": null, "resp": {"time": 1493328931183, "text": "Ms. Chittam,\nFirstly thank you for patronizing our store.  We take great pride in deliverying friendly, high quality goods and services.  As to your comments about USPS flat rate boxes, we do not offer them as they simply aren't big enough for average small shipments.   Per your comment about the cash register misring, we are sorry but we as humans are not infallable.  Fortunately, our system will catch any errors before the transaction is complete.  We apologize for the momentary delay.   Regarding your comment that our USPS prices are double the Post Office,  yes, we do charge a nominal service charge to cover our overhead and the ability to maintain a viable business thereby offering our customers a level of service they might not realize at the Post Office.    In fact many of our USPS prices are actually lower than the Post Office as we realize volume discounts that an individual would be unable to quality for.\n\nThank you again for your comments.\nSincerely,\nDon Cantrell\nPresident,\nThe Shipping Store and more..."}, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "114990420188726533020", "name": "Daryl Piner", "time": 1441294603051, "rating": 5.0, "text": "Excellent service and very friendly people who will go the extra mile to help you.  I reccomend this place to everyone.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "117049772022464651991", "name": "Lee Bates", "time": 1452354104733, "rating": 5.0, "text": "Always friendly service and they do the job right. I drive extra miles for this quality.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "105075834732383199786", "name": "Elise van zandt", "time": 1464366522941, "rating": 5.0, "text": "A+++ service! Very friendly staff and super helpful!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "112593356385282467328", "name": "Rodrigo Banzon", "time": 1464385634824, "rating": 5.0, "text": "Excellent service.  Outstanding staff!", "pics": null, "resp": {"time": 1493327616424, "text": "Thank you. We take great pride in our level and quality of service."}, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "111708991384449542120", "name": "Brenda Caudle", "time": 1448047458517, "rating": 3.0, "text": "Fast and friendly service. The cost was higher than expected.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "108899288135944656892", "name": "Misty Myres", "time": 1470087060480, "rating": 1.0, "text": "Very rude staff. I called ahead to verify all details and was told something different when I got there leaving me to rush to FedEx in Madison to ship my packages.", "pics": null, "resp": {"time": 1493327550562, "text": "Ms. Myres,\nFirstly, thank you for patronizing our business.  We pride ourselves in deliverying friendly,  high quality goods and services.  However, we are unable to access your or any other customers FedEx account number to charge shipping to.  We gladly accept FedEx prepaid packages at no charge, which have the shipping label already affixed.  Otherwise we are glad to create a label for you for which there would be a charge.\n\nRespectfully,\nDon Cantrell\nThe Shipping Store and more..."}, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "112071219118800431716", "name": "Karla Gibson", "time": 1463250306071, "rating": 4.0, "text": "People were Very nice and helpful.  Thank you!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "104660907043666156150", "name": "John Buckelew", "time": 1496504042314, "rating": 5.0, "text": "I use them for my mailbox, shipping, and FAX service. Professional in every way. Very friendly.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "109557001826874830430", "name": "Jim Nichols", "time": 1463653639672, "rating": 5.0, "text": "Its like when Butch said to Sundance, \"Who ARE those guys?\"", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "109658838689981900939", "name": "Rodney Scott", "time": 1464175044310, "rating": 5.0, "text": "Had a legal document that had to be handled asap and the store more than exceeded.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "116022121710779188150", "name": "Teresa Hutto", "time": 1464316250880, "rating": 5.0, "text": "They are great people!!!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "106368295851836027360", "name": "Paul Stahl", "time": 1527797354323, "rating": 5.0, "text": "This company has the most amazing service and professional assistance of any copy shop I have every worked with.   I needed a rapid turnaround order, bound and hand delivered in downtown with a 45 minute deadline.  This was for a large government bid.  They made my deadline with 15 minutes to spare!  I can't recommend them highly enough!", "pics": null, "resp": null, "gmap_id": "0x888e816948b5bb47:0xf72f69265cba865"}
{"user_id": "111487703116601419659", "name": "Southern Stream Live", "time": 1565023111756, "rating": 5.0, "text": "Kwik Kopy is definitely Kwik! They provide excellent customer service. We have always been overly satisfied with every order. Southern Stream Live definitely recommends Kwik Kopy for all your printing needs! Thank you guys!", "pics": null, "resp": {"time": 1595256112259, "text": "Thank you for your recommendation! We are delighted to have such an amazing customer."}, "gmap_id": "0x888e816948b5bb47:0xf72f69265cba865"}
{"user_id": "116431725098501731927", "name": "Destiny Williams", "time": 1522103094797, "rating": 5.0, "text": "Kwik Kopyshop is an outstanding business! We needed work done with a 2 day turn around time. Mark not only ensured that Kwik Kopy could do it, but he also offered recommendations that would save us money without compromising the quality of our product.\n\nIt was great working with Keri as well! She was always kind and calm, communicated effectively, and overall offered quality customer service.\n\nNot to mention, our signs look great!\n\nThank you, Kwik Kopyshop, for providing such great services!", "pics": null, "resp": null, "gmap_id": "0x888e816948b5bb47:0xf72f69265cba865"}
{"user_id": "105931976750454029240", "name": "Bryan Carter", "time": 1547757969539, "rating": 4.0, "text": "Excellent service. \"Kwik\" and quality work. I use them all the time.", "pics": null, "resp": null, "gmap_id": "0x888e816948b5bb47:0xf72f69265cba865"}
{"user_id": "115167867017837569190", "name": "Ronald White", "time": 1539870161622, "rating": 5.0, "text": "They are convenient, quick, and very polite and professional. if you need something taken care of in downtown Montgomery this is the place to go. I would highly recommend them for all of your needs.", "pics": null, "resp": null, "gmap_id": "0x888e816948b5bb47:0xf72f69265cba865"}
{"user_id": "111932578819044089775", "name": "Delores Hornsby", "time": 1516982991191, "rating": 5.0, "text": "Quick friendly service very sweet ladies", "pics": null, "resp": null, "gmap_id": "0x888e816948b5bb47:0xf72f69265cba865"}
{"user_id": "118226834310070090372", "name": "Sable Marston", "time": 1616096518026, "rating": 5.0, "text": "Grace was amazing to work with! Very professional, and great creativity went towards our project request! I would recommend them again!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "108201553788060631812", "name": "Cecelia Asberry", "time": 1618960350031, "rating": 5.0, "text": "Helpful and kind people. Ready to help your shipping needs through FedEx.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "104097605628754816777", "name": "Crystal Bailey", "time": 1620240714116, "rating": 5.0, "text": "My number 1 place for all my organization personalized needs, great service and friendly staff!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "112584179374515529130", "name": "Tony Smith", "time": 1612545719352, "rating": 2.0, "text": "I have used The Plot Shop in Daphne for dropping off my FedEx packages several times but recently come across a rude young man behind the counter. He seemed a bit entitled and above helping me with my request. I barely ever leave reviews but this felt like it should be addressed. Customer service has gone downhill in the past several weeks no doubt. Hope customer service gets back on track.", "pics": null, "resp": {"time": 1612550509322, "text": "So sorry to hear of your experience! Please call the shop & ask for the manager so I can fully understand what happened & make it better! We don't have record of purchases under your name so would appreciate your time to let us know what service you have received from us in the past."}, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "103143961733238989245", "name": "Tensawlakerunner", "time": 1612296612925, "rating": 1.0, "text": "I place a call to them and asked could they ship my uverse equipment back.. I told them I had shipping label....they said they could no problem. so after a 30 mile drive when I got there... they said it could not be shipped", "pics": null, "resp": {"time": 1612288115304, "text": "Please let us know why there was 1 star review so we can improve!"}, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "118372879005998032714", "name": "Bridgette Hill", "time": 1606239192118, "rating": 5.0, "text": "Today I had some packages to send off through FedEx, a nightmare because my ink was too light. Daniel Bertagnolli was so patient in helping me get the labels done. It should have been an easy technology task but oh no, I'll say my computer was not wanting to cooperate but I'm sure it was probably operator error lol! Thank you, thank you Daniel for being so patient and understanding with me today.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "115449505856744315265", "name": "garrett cox", "time": 1612827549974, "rating": 5.0, "text": "Great experience every time I come to the plot shop. The workers are excellent.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "116642314849585408962", "name": "Gabe Gonzalez", "time": 1605720239401, "rating": 5.0, "text": "Everyone is very nice and super helpful.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "102694171092648940942", "name": "dianne bernasconi", "time": 1500557240301, "rating": 5.0, "text": "In the past I used Plot Shop for my house plans.  This year, after meeting with Julie, I found a new great use!  I am an avid sewer.  I often order patterns online.  Instead of taping together 25 pieces of paper to make the pattern, I send the files to Julie and my patterns are printed on the large format paper.  Plot shop is efficient, well priced, and easy to work with!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "100361363644659820807", "name": "cheryl johnson", "time": 1499734274949, "rating": 5.0, "text": "Truly grateful for this business which is extremely convenient for me to frequent. This team provides the ultimate customer service with a contagious attitude.  I bet you would have a good experience if you visited THE PLOT SHOP.  Check it out soon!\nCheryl S. Johnson", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "108862083814163193279", "name": "joe hurd", "time": 1499738255021, "rating": 5.0, "text": "Laura and her staff are superb professionals that go above and beyond to make each customer feel special. Their turnaround time on blueprints is amazing. It's always a pleasure doing business with The Plot Shop. It's my go to, one stop, shop.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "114796316661742113647", "name": "Firej6460", "time": 1499721545773, "rating": 5.0, "text": "Super friendly staff and really fast turn around times. Great prices too. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "110560678539813251609", "name": "Dexter Curry", "time": 1498592176404, "rating": 5.0, "text": "Laura and her staff are the best! I have been going to the Plot Shop for my printing needs for 10+ years. They know me (and my family) by name and are always a pleasure to do business with.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "115990197552452325065", "name": "Simmie Yarborough", "time": 1570554188156, "rating": 5.0, "text": "Super SUPER nice people!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "101152165329252335299", "name": "Becky Whiteside", "time": 1500475653203, "rating": 5.0, "text": "Great personal service and professional staff that provide high quality large document printing in a timely manner.  Works with the customer to provide desired artistic reproductions and documentation.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "108206602411194150261", "name": "Daphne Stainbrook", "time": 1572528090568, "rating": 5.0, "text": "Awesome experience! Fast, friendly service!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "109405513757014622141", "name": "Tyler Horton", "time": 1548198464856, "rating": 5.0, "text": "Every time I visit, they’re always courteous and professional. I’d recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "110959842379632018615", "name": "Jennifer Farlow", "time": 1533864610102, "rating": 5.0, "text": "We always receive excellent and fast service. Our orders are always correct.  The staff is always friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "106812646897319878864", "name": "Patrick McNellage", "time": 1500478823709, "rating": 5.0, "text": "Fast, friendly, and easy.  We use The Plot Shop for our business and we know we can count on them to get our work done in a fast and efficient way.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "107342085872270006464", "name": "Brian Donelson", "time": 1555097692361, "rating": 5.0, "text": "Great customer service - I would definitely use them again.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "117196197927978829943", "name": "Lauren Arington", "time": 1500472851856, "rating": 5.0, "text": "The Plot Shop makes my job easier. They can handle anything, and everything! They have a convenient location, and a very knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "101635032099896825910", "name": "Logan Robinson", "time": 1598465648597, "rating": 5.0, "text": "A awesome store", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "100083643519971243458", "name": "Becky Lentz", "time": 1500477526989, "rating": 5.0, "text": "Laura and her staff have always been so helpful and courteous.  I will recommend The Plot Shop to anyone and just want to say Thank You for all you do.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "102822235855218646771", "name": "Karla Mason", "time": 1497459063807, "rating": 5.0, "text": "Great service,  quick and easy. In my experience they were very helpful,  I would definitely recommend it.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "109525179512976524447", "name": "Michelle Langley", "time": 1500479781388, "rating": 5.0, "text": "Such a pleasure to deal with!  Always has stuff ready when you need it, and will go the extra mile for you.  Wouldn't go anywhere else!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "115952594432401139353", "name": "Randy Crocker", "time": 1500503573803, "rating": 5.0, "text": "The Plot Shop is the best place for your printing needs. Great service and a wonderful staff!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "111839397626664674177", "name": "Pam Curry", "time": 1499717405220, "rating": 5.0, "text": "Laura and Staff are super friendly, professional and take care of our needs in a timely manner!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "104122808007802038608", "name": "Deidra Dueitt", "time": 1507558301423, "rating": 5.0, "text": "Laura is the best.  Staff is wonderful and all are very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "100425708489393795711", "name": "Ruddmaster kirktnt@centurylink.net", "time": 1499745897331, "rating": 5.0, "text": "I have been a client of the plot shop now for well over 10 years. The Team and thier leader Laura, are at the top of the service industry.\nFriendly, quick turn arounds, knowledgable, staff. Printing needs on any level. Plans can be printed same day if needed, or within a few hours for a walk in turn out emergency need. They are high quality bounded edge prints. There's no place I rather do business with that the plot shop in Daphne,\nFor my business needs. Great job to Laura and her Team. Thanks for 10 great years.\nSincerely,\nKirk Thomas\nk.a.t Designs Inc.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "109816014716310510842", "name": "Jim Smith", "time": 1499720669625, "rating": 5.0, "text": "Best customer service anywhere!!!  Knowledgeable staff and smiling faces.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "107978154272017999342", "name": "Wanda Houston", "time": 1599844675507, "rating": 5.0, "text": "Great to have", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "107886442678411213560", "name": "Daniel Wagner", "time": 1470165492410, "rating": 5.0, "text": "Quick and easy drop off. Will be coming back in the future.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "111755415063618219939", "name": "Amy Brown", "time": 1499782246172, "rating": 5.0, "text": "Great service!   Very quick turn around!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "117490914467863309813", "name": "K.T. Thornton Icons Sport Mobile Region Media", "time": 1531345667155, "rating": 5.0, "text": "They are awesome and have great prices! Check them out!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "108126427130815183911", "name": "Lene Legrone", "time": 1501027576351, "rating": 5.0, "text": "Need to mail package, need to get there in a hurry? Our local FedEx can get there for you.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "116675815643794483268", "name": "Kenny Marmar", "time": 1546541063921, "rating": 5.0, "text": "Great people,everything went well,thank you all", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "111627690934526997298", "name": "David Lindsey", "time": 1500474164545, "rating": 5.0, "text": "The Plot Shop staff are not only nice to me, but to everyone that comes into their business.  Always one of the bright spots in my day.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "102155597352811376235", "name": "Boise BMDMILTON", "time": 1500661020823, "rating": 5.0, "text": "These guys are great! ...and they're prices too!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "109144599423611958127", "name": "Miyuki F.", "time": 1502290788138, "rating": 5.0, "text": "Friendliest owner ever!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "102632414601158435958", "name": "Good Citizen (Good Citizen)", "time": 1531706297578, "rating": 5.0, "text": "Very convenient.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "105142050938273994298", "name": "Fred Butler", "time": 1506518148834, "rating": 5.0, "text": "Fast service", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "113228339283766094318", "name": "C.C. Long", "time": 1500570628915, "rating": 5.0, "text": "Awesome customer service", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "107725480381763351929", "name": "Jeff Windham", "time": 1499715997038, "rating": 5.0, "text": "Fantastic personalized service!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "104555613191518730912", "name": "John Petersen", "time": 1498592547148, "rating": 5.0, "text": "Great service!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "109269707208110694985", "name": "Randal Rocker", "time": 1471951908827, "rating": 3.0, "text": "The place doesn't have a sign up to notice it but the gps is correct, turn on and go to the front parking lot.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
