{"user_id": "105707603109419331726", "name": "Dorothy", "time": 1622906114115, "rating": 1.0, "text": "If you have all the time in the world to wait for them to come out, then this is the perfect company for you. If you want things done in a fair amount of time, you should probably look elsewhere for surveying service. It took SEVERAL months to get them to even get started on surveying our land. We would call and call and the owner just kept putting us off. Was not easy to get ahold of them either. When we would call his office number, the lady answering was not very polite. We just wanted updates, and she flat out told us that they had too many customers to be able to do that for us. Do not recommend.", "pics": null, "resp": null, "gmap_id": "0x8889fb5b3ae848f7:0x9c524f6e4dcbc434"}
{"user_id": "116354383363932308326", "name": "LaDonna Musson", "time": 1616166732533, "rating": 5.0, "text": "Mr. Snider went above and beyond to survey and perk the property we tried to purchase. Great people. Would recommend him highly to anyone. Thank You Mr.Snider for all your work and time spent with us. Mr. And Mrs. Musson.", "pics": null, "resp": null, "gmap_id": "0x8889fb5b3ae848f7:0x9c524f6e4dcbc434"}
{"user_id": "108859647785200805632", "name": "thomas dunnavant", "time": 1605048111998, "rating": 5.0, "text": "Jeff and his crew did such good work, I hired him to do another piece of property near the Tennessee Alabama line.  We are in the middle of a real estate boom right now and everyone is busy and surveyors are scarce, and while I would have preferred a quicker process, i sure can't complain about the quality of the work.  Standing in line has become part of life.  Few do the quality at an affordable price but Jeff does.  5 stars!", "pics": null, "resp": null, "gmap_id": "0x8889fb5b3ae848f7:0x9c524f6e4dcbc434"}
{"user_id": "111743740461879097988", "name": "Chris McLagan", "time": 1614185914974, "rating": 1.0, "text": "So I will start by saying, they are great people. But extremely unorganized. I hired them for a perc test they were in and out extremely fast, but their attention to detail was absolutely horrible. They wrote my number down wrong on forms, when I said something the lady laughed. On my drawing from board of health, all my information is incorrect because of how it was given to them. Took an extra week to turn my drawings in according to board of health. According to the board of health I may have to re get my permit and get a new perc test. If you want a stress free job and done right the first time, do not call them!!", "pics": null, "resp": null, "gmap_id": "0x8889fb5b3ae848f7:0x9c524f6e4dcbc434"}
{"user_id": "112084974638582773969", "name": "Angela Taylor", "time": 1604868187943, "rating": 1.0, "text": "First, we tried for MONTHS to get him on the phone just to schedule a day for the survey. Had to call MANY times and leave many messages. Then once we finally had a date he said he would be there at 9 and showed up at 12p, he did not finish the survey that day so said he would come back the next day at 9a and as of 2:40 pm we still haven’t seen him. Tried to call, no answer. Tried to text, no reply. Very unresponsive and very unprofessional. Seems like a nice guy IF you can ever talk or see him but not reliable, prompt or responsible.", "pics": null, "resp": null, "gmap_id": "0x8889fb5b3ae848f7:0x9c524f6e4dcbc434"}
{"user_id": "104969152991866196810", "name": "Ryan Newbern", "time": 1526827225198, "rating": 5.0, "text": "Jeff was great to work with.  He gave me a reasonable quote and stuck to it.  He also had the survey done when he said he would.  My only complaint is that he misspelled my name on the survey.   Still giving 5 stars because everything else was great.", "pics": null, "resp": null, "gmap_id": "0x8889fb5b3ae848f7:0x9c524f6e4dcbc434"}
{"user_id": "103103693094952267560", "name": "Noel Roe (Noel)", "time": 1459206980866, "rating": 5.0, "text": "great company very professional and friendly. will be happy you went with them. official documents. reasonable rates.", "pics": null, "resp": null, "gmap_id": "0x8889fb5b3ae848f7:0x9c524f6e4dcbc434"}
{"user_id": "108174802565840178787", "name": "Charlotte White", "time": 1550178103016, "rating": 5.0, "text": "Very professional", "pics": null, "resp": null, "gmap_id": "0x88929261ce3dc3a7:0xe282944c248f0d92"}
{"user_id": "108174802565840178787", "name": "Charlotte White", "time": 1551643262134, "rating": 5.0, "text": "Professional", "pics": null, "resp": null, "gmap_id": "0x88626b5723fd2d3f:0x201005fe904e80de"}
{"user_id": "110737873435550247799", "name": "ronnie clark", "time": 1478805058243, "rating": 5.0, "text": "Hood away from the hood", "pics": null, "resp": null, "gmap_id": "0x888990f5ec38dce5:0x5e03f1d848a268f0"}
{"user_id": "107713093748506115468", "name": "chris wortz", "time": 1549162291545, "rating": 5.0, "text": "Robert McGowan is the top surveyor", "pics": null, "resp": null, "gmap_id": "0x888d478440d415b7:0x4914d9ead7ffe466"}
{"user_id": "102879888456449537198", "name": "J Parker", "time": 1602854453197, "rating": 1.0, "text": "They completed a survey on my new home (it’s an irregular lot so the property lines aren’t crystal clear) when I asked them to come mark the left side of my home like they did the right they said it would be a $250 charge...they just did the survey 3 weeks earlier! Do not use!! Also this is the first time I have ever written a review, so that should tell you something.\n\nI have also sent a letter to the Alabama board of engineers and land surveyors.", "pics": null, "resp": null, "gmap_id": "0x88891ec925a688ab:0x63df9eb51ca40662"}
{"user_id": "107616017556204496664", "name": "Fr Ca", "time": 1536155001771, "rating": 5.0, "text": "We just simply put in an inquiry and they showed up the next day without ever confirming or to discuss the quote or what we wanted done. We were never called or emailed. Will be reaching out to them but previous reviews say that is almost impossible...will update if communications are good.\nUPDATE---They did call and apologize! Needs were met and will come back to mark line boundaries. Fast and prompt call! Highly recommend!!!\n\nFair pricing!!! Gave me a military discount!!! Thanks", "pics": null, "resp": null, "gmap_id": "0x88891ec925a688ab:0x63df9eb51ca40662"}
{"user_id": "110890072862633771040", "name": "Tyler Volz", "time": 1579124887762, "rating": 1.0, "text": "Left flags and other markers all over the property. Could not accurately describe what they were doing at my home except it was \"for the mortgage.\"", "pics": null, "resp": null, "gmap_id": "0x88891ec925a688ab:0x63df9eb51ca40662"}
{"user_id": "102124967881503056439", "name": "tubyrusedays", "time": 1543250407653, "rating": 5.0, "text": "The guys at Waygand took care of me. The two guys who came onsite to do the work were leaving as I was pulling up but took the time to walk me around the properly and show me the corner post. They did a good job marking the corner post for me and answered other questions about the properly line. I spoke to the receptionist before and after the work was done and they were very kind and professional. I was more than happy with the work done and will give them my business in the future.", "pics": null, "resp": null, "gmap_id": "0x88891ec925a688ab:0x63df9eb51ca40662"}
{"user_id": "112456001364820274305", "name": "Chris Hammond", "time": 1475689469558, "rating": 5.0, "text": "Great to work with.  They came out even faster than I anticipated and charged a fair fee.\nGood people to work with.", "pics": null, "resp": null, "gmap_id": "0x88891ec925a688ab:0x63df9eb51ca40662"}
{"user_id": "115818962322461272594", "name": "chris freeman", "time": 1465330314895, "rating": 2.0, "text": "Getting information and return phone calls is nearly impossible with this crew. They used to be very good but for my last project I'm sorry I started down the path with them. They literally never returned any phone calls after promising to do so. I had to call them multiple times per week to get updates/information.", "pics": null, "resp": null, "gmap_id": "0x88891ec925a688ab:0x63df9eb51ca40662"}
{"user_id": "108499541977609253056", "name": "Ronald Redd", "time": 1594066747052, "rating": 4.0, "text": "There were a couple bumps in the road, but none the less resolved.  Everyone was very professional during all conversations. Would use again. Thanks!", "pics": null, "resp": null, "gmap_id": "0x88891ec925a688ab:0x63df9eb51ca40662"}
{"user_id": "105745254852643268907", "name": "Mark Byers", "time": 1532621289415, "rating": 5.0, "text": "Needed a survey by closing on a Friday. Called on Monday and they were able to get it done no problem", "pics": null, "resp": null, "gmap_id": "0x88891ec925a688ab:0x63df9eb51ca40662"}
{"user_id": "100775364483160832998", "name": "Janie Langdale", "time": 1532905911408, "rating": 5.0, "text": "Great to work with, they have years of engineering and surveying experience that shows. I would definitely use them again.", "pics": null, "resp": {"time": 1532906096988, "text": "Thank You Mrs. Langdale"}, "gmap_id": "0x888923aded1af2c3:0xe6fbd9bc99a5d92c"}
{"user_id": "103132397536401487135", "name": "Mary Williamson", "time": 1532898346150, "rating": 5.0, "text": "Excellent group of professionals with a wide range of skills. Highly recommend!", "pics": null, "resp": {"time": 1532900982328, "text": "Thanks Mary"}, "gmap_id": "0x888923aded1af2c3:0xe6fbd9bc99a5d92c"}
{"user_id": "101180913335636251742", "name": "KR Manier", "time": 1532890476312, "rating": 5.0, "text": "They surveyed my property, their crew was very friendly and professional, and completed the job quickly.", "pics": null, "resp": {"time": 1532901015151, "text": "Thank you"}, "gmap_id": "0x888923aded1af2c3:0xe6fbd9bc99a5d92c"}
{"user_id": "101695382141699218725", "name": "Brian Kirk", "time": 1548964383973, "rating": 5.0, "text": "Wonderful to work with!  Thanks for all you do.", "pics": null, "resp": null, "gmap_id": "0x888923aded1af2c3:0xe6fbd9bc99a5d92c"}
{"user_id": "104349448523639886320", "name": "Tim Arrington", "time": 1532887206531, "rating": 5.0, "text": "Excellent company, very responsive and does a great job with all my Surveying and Engineering needs..", "pics": null, "resp": {"time": 1532901050898, "text": "Thanks Tim we appreciate your business"}, "gmap_id": "0x888923aded1af2c3:0xe6fbd9bc99a5d92c"}
{"user_id": "113921957650279870687", "name": "Aaron Williamson", "time": 1532959888137, "rating": 5.0, "text": "They've done multiple surveys for me.  Service was excellent.  Will use again.", "pics": null, "resp": {"time": 1532960641676, "text": "Thank you Aaron. We appreciate your buisness"}, "gmap_id": "0x888923aded1af2c3:0xe6fbd9bc99a5d92c"}
{"user_id": "107169161494843556430", "name": "ConstructNoden", "time": 1550515539876, "rating": 5.0, "text": "Great Group of people", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP7FHOA1uK0iqczZEw6EAF4hOX6fN9nRyYSquRM=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888923aded1af2c3:0xe6fbd9bc99a5d92c"}
{"user_id": "109609302908048435942", "name": "D Nunn (Big O)", "time": 1503065458017, "rating": 1.0, "text": "Very UNresponsive, I contacted this establishment to get a survey done on my property...after several emails and phone calls...haven been promised a price quote some 5 weeks ago, I have yet to get a call from the representative (I will withhold her name).", "pics": null, "resp": null, "gmap_id": "0x888923aded1af2c3:0xe6fbd9bc99a5d92c"}
{"user_id": "111434398011570527959", "name": "BILLY INGRAM", "time": 1601388781454, "rating": 5.0, "text": "A very good and very friendly bunch of people here that know their stuff and are happy to help you with whatever you need. They have the best prices around and if they don't have it in stock they will get it asap if not overnight with in a day or two. They really know their business and it shows. Respect honesty and courteous these people are.  Great tools great prices and great service.  You just cant beat that. Julie Ingram is also the most helpful person when it comes to sourcing anything that you need.", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "105452770736076689062", "name": "cj curtis", "time": 1601393770014, "rating": 5.0, "text": "We use these guys to get our equipment. They really go above and beyond standard customer service. Any questions big or small they are always ready to help with. I deal mainly with Holland and Bucky but expect everyone that works there would do the same. Love the service. Thank you", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "115560798490343209561", "name": "Brandon Butler", "time": 1601378100746, "rating": 5.0, "text": "I love the determination and spirit of the young lady. One could only hope to see a business like this match the spirit and determination with professionalism and quality not just in product, but the value in the people, as well. I wish all the best for this business.", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "105322197025026836920", "name": "Randy Phillips", "time": 1601307064176, "rating": 5.0, "text": "Holland provided me top shelf service. He works hard and easy to talk to. Has answers I need if not he gets the answer. Always picks up the phone and/or calls back promptly. Couldn’t find a better rep.\n\nAlabama Surveying &Mapping", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "103445481395853634808", "name": "William Jones", "time": 1601521614711, "rating": 5.0, "text": "The young lady named Julie that works there was awesome!!  She asked all my questions and was very professional.  I will definitely be using them when I'm ready. Ask for Julie when you call or go there!!", "pics": null, "resp": {"time": 1602096669237, "text": "Thank you William.  Julie is a great asset for our team.  We appreciate your support."}, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "105490563272168623907", "name": "john tester", "time": 1601600130465, "rating": 5.0, "text": "I love Leica equipment because it is fast, reliable, and easy to use. The men and women who work here also give a great experience and have the ability to teach well and help out in anyway possible! I highly recommend them!", "pics": null, "resp": {"time": 1602096616746, "text": "Thank you John for the positive review and the business.  We believe Leica continues to exceed  the rest of the industry.  Thank you for your support!"}, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "102243161440761086734", "name": "Libby Warren", "time": 1601392624384, "rating": 5.0, "text": "Ms. Julie always has everything organized! She is a perfectionist which I love and she puts others before herself. She is very nice and she is amazing at what she does. Overall I think this is a great place and has great workers!", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "102952870682040766065", "name": "Wesley Hicks", "time": 1601397905700, "rating": 5.0, "text": "I recently used Transit and Level out of Birmingham for the first time due to my past supply and repair company being temporarily closed because of Covid.  I was in need of a hard to find instrument that one of my oldest and most valuable employees requested.   My previous supplier had not had any luck in finding it.   Upon contacting Transit and Level my new sales rep, Julie, said she would make it happen.  I really had my doubts but to my surprise I got a phone call a couple of days later saying she had it.  It was exactly what we had been searching for.  I've never met Julie but she has gotten a customer for life.  Thank you Julie and look forward to dealing with Transit and Level in the future.", "pics": null, "resp": {"time": 1602096730917, "text": "Thank you Wesley for your positive review and your business.  We love being part of the Birmingham landscape!"}, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "109944661172011069605", "name": "Garrett Schaner", "time": 1601601034005, "rating": 5.0, "text": "Holland Noden is the man! Super quick to respond and always has a great attitude. Love the service Holland and Transit and Level provide", "pics": null, "resp": {"time": 1602096563367, "text": "Thank you Garrett for the positive review.  So happy we've been able to help!"}, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "107189203486629204720", "name": "Katie Trammell", "time": 1601384964560, "rating": 5.0, "text": "Great Customer Service! Was able to get everything I need without any problems and Julie was a wonderful help and made sure I was satisfied with the equipment I was interested in. Will recommend!!!!", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "107081229327291055576", "name": "Kyle Davis", "time": 1601388554107, "rating": 5.0, "text": "Very excellent service and would definitely recommend the service for all your surveying needs. 10/10. Julie was a very great help", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "115988404814600018419", "name": "Weasley Young", "time": 1601390855353, "rating": 5.0, "text": "Wow I was Impressed with the overwhelming support this establishment gave me. Julie was very amazing and it was great experience.", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "114955980283922153448", "name": "Andrew Lee Bedwell", "time": 1601605998266, "rating": 5.0, "text": "Holland  is the man. Very helpful guy don't buy Leica products from anyone else. You will not be sorry great customer service", "pics": null, "resp": {"time": 1602096540599, "text": "Thank you for the positive review Andrew.  Holland is truly a valuable asset for our company.  Thank you for your support.  Please let us know if we can help further."}, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "107439745731620506016", "name": "dellon aderhold", "time": 1601342080682, "rating": 5.0, "text": "I'll call Holland about any questions I have about my new icon leica system he's got it down! And is great at problem solving and helping over the phone.", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "102731072782066416105", "name": "Gracen Powell", "time": 1601380146109, "rating": 5.0, "text": "Julie Ingram was extremely helpful and accommodated to everything I needed. Very impressive service!", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "110189806234605029316", "name": "Bryan Powell", "time": 1601388057989, "rating": 5.0, "text": "Great business. Thanks to Julie Ingram for her professional support while I was there.", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "103901933905961320697", "name": "Samuel Jones", "time": 1601390501547, "rating": 5.0, "text": "GREAT SERVICE!!! Julie was so helpful and I would definitely recommend this to anyone who needs anything with surveying!! 10/10", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "118214731849917047490", "name": "Madison Moon", "time": 1601414077601, "rating": 5.0, "text": "Julie Ingram was very helpful and such a sweetheart! My family loves her!", "pics": null, "resp": {"time": 1602096750461, "text": "Thank you Madison.  Julie is truly an asset to our company!"}, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "117347642724516724156", "name": "Hannah Ferguson", "time": 1601381722885, "rating": 5.0, "text": "Julie Ingram has the best customer service skills with the knowledge you need to find the right products!!", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "116388924896341984567", "name": "Jackie Padgett", "time": 1601395573113, "rating": 5.0, "text": "Julie Ingram has great customer service. Very professional and helpful!", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "104004637247105226932", "name": "Amanda Floyd", "time": 1601397760954, "rating": 5.0, "text": "Julie is the best to work with. Thank you for great service!", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "101852264883772648501", "name": "Jkline32", "time": 1601414274167, "rating": 5.0, "text": "Julie Ingram was very very helpful and very professional I am very pleased and impressed with the service and quality I got.", "pics": null, "resp": {"time": 1602096761892, "text": "Thank you for your review and your support!"}, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "111870315003892807572", "name": "American Beauty", "time": 1601419988421, "rating": 5.0, "text": "Holland was great at walking us through the purchasing process and even asked if we needed help using it. We will be back again!", "pics": null, "resp": {"time": 1602096691563, "text": "Thank you for your review.  Holland is awesome!"}, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "104757846796215115451", "name": "Matt Dutton", "time": 1602091515106, "rating": 5.0, "text": "Very quick turn around on repairs. Looking forward to working with this company in Birmingham.", "pics": null, "resp": {"time": 1602096487274, "text": "Thank you for the positive review Matt and for the opportunity to earn your business.  We love our small part in the Surveying Community there in Birmingham.  Please let us know what we can do to help!"}, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "113276507325976044710", "name": "Michael Coker", "time": 1601394826108, "rating": 5.0, "text": "Julie was professional and knowledgeable.  Will do business here again", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "112964815896450640447", "name": "Nichole Boothe", "time": 1601391659347, "rating": 5.0, "text": "Ask for Brad McConatha he will help with anything that you need!! Awesome guy great work ethic!!!", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "110353173372189088662", "name": "Reagan Powell", "time": 1601377355347, "rating": 5.0, "text": "Julie answered all my questions and helped me with what I needed. 10/10 would recommend!", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "109783147339480266437", "name": "Abby Akers", "time": 1601389666945, "rating": 5.0, "text": "julie is a very sweet and kind lady! She always helps me with whatever i need!", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "100193920368370532239", "name": "ii_sonny_ii ROBLOX", "time": 1601377175847, "rating": 5.0, "text": "Julie was incredibly helpful and answered all my questions!", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "112349342718709854796", "name": "Gary Duckworth", "time": 1601381907630, "rating": 5.0, "text": "Julie was very knowledgeable and very accommodating! 10/10", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "103892894092285728086", "name": "Carla Ellis", "time": 1601308295571, "rating": 5.0, "text": "Holland has great customer service!", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "107412109757126209050", "name": "Dwayne Robert", "time": 1601392298790, "rating": 5.0, "text": "Julie, the manager was fantastic!!!", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "107169161494843556430", "name": "ConstructNoden", "time": 1599568694339, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x88891f88a616349d:0x7771f2269892abce"}
{"user_id": "108278260922029593613", "name": "B Smith", "time": 1558719791814, "rating": 5.0, "text": "Best engineers in Jefferson County. Friendly staff. Extensive knowledge of Birmingham. Swift and accurate. They also work well with city, county and all utilities. Don't even waste your time with any other company. Schoel should be your only option.", "pics": null, "resp": null, "gmap_id": "0x88891bc5d518a011:0xa93b5760c9da8066"}
{"user_id": "106958358025434070649", "name": "2Face Joker", "time": 1591803873830, "rating": 5.0, "text": "They do great work and have a awesome reputation over a hundred plus years and going strong.", "pics": null, "resp": null, "gmap_id": "0x88891bc5d518a011:0xa93b5760c9da8066"}
{"user_id": "112787817221465959617", "name": "Cc Tt", "time": 1510186653213, "rating": 1.0, "text": "All they worry about is charging more than anyone else in Alabama. Save yourself 10 times the money and go elsewhere. Their engineering skills are no better than anyone​ else's. The quality of your services are based on how well the men in the field doing the manual labor are doing their job. The engineers don't step foot out of their air-conditioned offices and the men in the field are rushed, underpaid, and half of them unqualified while having to use outdated, worn out, uncallibrated instruments. And this is what you will find at any surveying company. So when you're choosing who to write your check out to, maybe think about getting some estimates, because the outcome will be the same. Your land isn't gonna change, the same measurements you're over paying them to make will be the same measurements you can have done by any other company for less than half the price. Good luck. They will never have my business.", "pics": null, "resp": null, "gmap_id": "0x88891bc5d518a011:0xa93b5760c9da8066"}
{"user_id": "115856704806025612483", "name": "Bill Stevens", "time": 1566090097264, "rating": 5.0, "text": "Top rate civil and surveying", "pics": null, "resp": {"time": 1570827224863, "text": "Thank you for the 5-star rating!"}, "gmap_id": "0x88891bc5d518a011:0xa93b5760c9da8066"}
{"user_id": "100609289629996583677", "name": "Eric Graham", "time": 1478199962103, "rating": 5.0, "text": "Real pros.", "pics": null, "resp": null, "gmap_id": "0x88891bc5d518a011:0xa93b5760c9da8066"}
{"user_id": "104918300513174124134", "name": "Jake Widmer", "time": 1627491784904, "rating": 1.0, "text": "Absolutely HORRIBLE! 1 Star is too much.\n\nI called 2 weeks ago and spoke with Guthrie. He assured me a closing survey would be completed last Wednesday. That day, I received an email from him stating weather set them back. I replied that I understood, and asked when he thinks it would take place.\n\nHe never responded.\n\nI've sent him 3 additional emails and have called numerous times. Every time I call, he's always out of the office and the woman who answers is absolutely clueless about everything. She offers no help, and isn't concerned 1 bit about us needing the survey for closing coming up.\n\nDO NOT call or try to use this company, they are HORRENDOUS.", "pics": null, "resp": null, "gmap_id": "0x888e810c21f11947:0xe48830beb1ca8a30"}
{"user_id": "113218684721078998652", "name": "Jeannette Ladnier", "time": 1619207567274, "rating": 1.0, "text": "Jeffcoat Engineers and Surveyors LLC prepared a survey even though they were not authorized to do so because my real estate agent had already sent a copy of the existing survey to them… twice.  Next thing I know I receive a bill for double the quoted price for flagging the property.  When I telephoned Osceola Guthrie Jeffcoat regarding the bill, he was extremely condescending and dismissive and behaved in a very unprofessional manner. First, he conducts an unauthorized and unnecessary survey and then has the gall to cop an attitude when I dared to question him about it!  Unethical and unprofessional, do not recommend.", "pics": null, "resp": null, "gmap_id": "0x888e810c21f11947:0xe48830beb1ca8a30"}
{"user_id": "106432325178532837921", "name": "Sara Phillips", "time": 1622252613105, "rating": 5.0, "text": "Professional service and nice people to work with.", "pics": null, "resp": null, "gmap_id": "0x888e810c21f11947:0xe48830beb1ca8a30"}
{"user_id": "111381375353753525846", "name": "Valarie Chappelle", "time": 1597156951937, "rating": 1.0, "text": "Scheduled two appointments with the business and workers did not show. I called several times and the owner made excuses as to why no one called to reschedule. This is not a professional business...Do not recommend!", "pics": null, "resp": null, "gmap_id": "0x888e810c21f11947:0xe48830beb1ca8a30"}
{"user_id": "106247032229679706082", "name": "Napoleon Goodson", "time": 1600177626145, "rating": 4.0, "text": "Prompt service!", "pics": null, "resp": null, "gmap_id": "0x888e810c21f11947:0xe48830beb1ca8a30"}
{"user_id": "112608659488825820130", "name": "Bobby zensu", "time": 1560445890054, "rating": 5.0, "text": "Excellent reliable surveyors.", "pics": null, "resp": null, "gmap_id": "0x888e810c21f11947:0xe48830beb1ca8a30"}
{"user_id": "106298083338108036831", "name": "C CC", "time": 1472160017288, "rating": 5.0, "text": "love it", "pics": null, "resp": null, "gmap_id": "0x888bc772970c0983:0x20f7717579e1908e"}
{"user_id": "100684405713762522020", "name": "Susan Smith", "time": 1620844969617, "rating": 1.0, "text": "My sister and I had some land  Surveyed by this company several months ago. We still have not got the information from them much less the price for the survey. My sister (who called to have survey done)has called multible times with NO RETURN PHONE CALLS!!!", "pics": null, "resp": null, "gmap_id": "0x886214b3c7dfd8bd:0xebcb8f13e4e34164"}
{"user_id": "101825009488096048784", "name": "Amie Rivera", "time": 1621355845668, "rating": 2.0, "text": "They are very slow in getting back to people. It has been over a month since they were last at our property and still have not heard from them an I have called several times and left messages.", "pics": null, "resp": null, "gmap_id": "0x886214b3c7dfd8bd:0xebcb8f13e4e34164"}
{"user_id": "110716353825185496745", "name": "JDawn Work", "time": 1612218068374, "rating": 1.0, "text": "I have reached out numerous times regarding the survey map and have been told each time it’d be the following weekend. It’s been over four months since the survey and going on 3 weeks since I was last told I’d receive the paperwork. I can’t recommend this company.", "pics": null, "resp": null, "gmap_id": "0x886214b3c7dfd8bd:0xebcb8f13e4e34164"}
{"user_id": "115745774942892056135", "name": "John Bearden", "time": 1597788673429, "rating": 5.0, "text": "I like these people. They found my property corners. I received a pdf plot as well as an AutoCAD drawing. Good job Thaf.", "pics": null, "resp": null, "gmap_id": "0x886214b3c7dfd8bd:0xebcb8f13e4e34164"}
{"user_id": "117903910650852625177", "name": "Taylor H", "time": 1465531505861, "rating": 5.0, "text": "These guys do great work. Very easy and professional to deal with. When buying my property I had a boundary and placement survey conducted, and was in somewhat of a time crunch. Big springs was great about fitting me in their schedule for a very reasonable price and delivering everything to my attorney. If I ever need additional work I will be back!", "pics": null, "resp": null, "gmap_id": "0x886214b3c7dfd8bd:0xebcb8f13e4e34164"}
{"user_id": "114667135542744389626", "name": "Keia A", "time": 1546958163995, "rating": 1.0, "text": "I recently worked with this company to conduct a survey for some land I wanted to purchase. Upon finding out the title wasn’t available for the land, I called to cancel the survey. No one answered, so I left a voicemail. The next day I received a call that the survey had already been conducted without ever getting any prior notification from Big Spring Surveyors. Even though I didn’t want the survey any longer, I still had to pay the 400.00. 😔 When getting a survey from here be careful, the communication isn’t the best!!", "pics": null, "resp": null, "gmap_id": "0x886214b3c7dfd8bd:0xebcb8f13e4e34164"}
{"user_id": "113254885280662693913", "name": "jon agrelius", "time": 1561559817455, "rating": 5.0, "text": "Best priced surveyors in town...Thad ,Gloria and Aaron are extremely nice ,knowledgeable and always ready to help . I dont use anyone else after my many great experiences at Big Springs", "pics": null, "resp": null, "gmap_id": "0x886214b3c7dfd8bd:0xebcb8f13e4e34164"}
{"user_id": "100613867023971661401", "name": "Sandy McCormick", "time": 1539712539673, "rating": 5.0, "text": "Very nice folks! Fast accurate and very good job! I would recommend them to anyone! Thanks guys for a job well done!!!!", "pics": null, "resp": null, "gmap_id": "0x886214b3c7dfd8bd:0xebcb8f13e4e34164"}
{"user_id": "101678957798766834266", "name": "J.W. McFarland Jr", "time": 1597018926827, "rating": 5.0, "text": "Experienced and knowledgeable!", "pics": null, "resp": null, "gmap_id": "0x888602e668a3ef03:0x382925256f17f845"}
{"user_id": "105382310830634280422", "name": "Pam Lindsey", "time": 1564529346787, "rating": 5.0, "text": "Laura the receptionist is amazing!", "pics": null, "resp": null, "gmap_id": "0x888602e668a3ef03:0x382925256f17f845"}
{"user_id": "114513602691117239032", "name": "Jay Levasseur", "time": 1619751581781, "rating": 1.0, "text": "Never even bothered to contact me.  Guess my business doesn't matter.  Take your business elsewhere.", "pics": null, "resp": null, "gmap_id": "0x886213e0e13fb795:0x5aa38b9476e75fb8"}
{"user_id": "103584889778077678204", "name": "Josh Bell", "time": 1565219720202, "rating": 3.0, "text": "Contacted about residential services and never got a response.\n\nUpdate: I appreciate your thoughtful and polite response and will increase my star rating just for your courtesy. I wish you the best of luck in finding someone to assist you in managing your workload. Having more work than you can handle is the best sort of problem to have and may it continue to plague you.", "pics": null, "resp": {"time": 1565216536323, "text": "I apologize you did not receive a response from your submission form email within the 24 hours requested.  Customer satisfaction is my top priority.  I am a small local business and as such have been managing all aspects of the business.  Unfortunately gaining potential new clients sometimes comes at a cost, as we are trying our best to maintain current client obligations.  I am in the process of hiring an office administrator to assist in rectifying this situation. As a side note, always feel free to call the number listed on my webpage for an immediate response."}, "gmap_id": "0x886213e0e13fb795:0x5aa38b9476e75fb8"}
{"user_id": "102465201625970993026", "name": "Joshua Villa", "time": 1603200768684, "rating": 1.0, "text": "Answered the phone with \"yeah\". I don't know about any one else but if you're running a business might want to answer with name and business.", "pics": null, "resp": {"time": 1603238359394, "text": "At Halliburton Surveying we strive for professionalism and exceptional customer service, as evidenced by our multiple 5 star reviews.   We apologize that we did not meet your standards with the way we answered the phone, and hope you were able to find the surveying services you needed."}, "gmap_id": "0x886213e0e13fb795:0x5aa38b9476e75fb8"}
{"user_id": "110157188396422566618", "name": "Tina Wilkerson", "time": 1523974809669, "rating": 5.0, "text": "My company has worked with HSM on several occasions and have really appreciated the quality and punctuality of their work. Troy Halliburton is very knowledgeable about his field and has become a trusted business partner for us.", "pics": null, "resp": null, "gmap_id": "0x886213e0e13fb795:0x5aa38b9476e75fb8"}
{"user_id": "103387020421448794855", "name": "C Beamer", "time": 1526050998417, "rating": 5.0, "text": "Troy and his team are extremely knowledgeable and easy to work with. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x886213e0e13fb795:0x5aa38b9476e75fb8"}
{"user_id": "116009207595278446855", "name": "Jacob Davenport", "time": 1523542109601, "rating": 5.0, "text": "Troy and his team do an exceptional job and I appreciate their service.", "pics": null, "resp": null, "gmap_id": "0x886213e0e13fb795:0x5aa38b9476e75fb8"}
{"user_id": "108137918404692939538", "name": "Anne Lawn", "time": 1524964014385, "rating": 5.0, "text": "Troy and his team are great. Great find!", "pics": null, "resp": null, "gmap_id": "0x886213e0e13fb795:0x5aa38b9476e75fb8"}
{"user_id": "108735626124200366464", "name": "Kimberly Holland", "time": 1523373909457, "rating": 5.0, "text": "Very impressed with the professionalism and knowledge of Mr. Halliburton.", "pics": null, "resp": null, "gmap_id": "0x886213e0e13fb795:0x5aa38b9476e75fb8"}
{"user_id": "117576877925673881749", "name": "Onnie Miller", "time": 1602909318630, "rating": 1.0, "text": "I called Tommy on two separate surveys and I guess he picks and choose the easy surveys!\nHe gave me the story that it would cost about $4000 on a half acre lot it was so hard to do! Call Macanally and they did it for $600!", "pics": null, "resp": null, "gmap_id": "0x88628b69d240dc1d:0xdc8050e6debb40ab"}
{"user_id": "102284827331416442899", "name": "Cindy Downs", "time": 1619567165002, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x88628b69d240dc1d:0xdc8050e6debb40ab"}
{"user_id": "115981313106955572678", "name": "Andrew Chancellor", "time": 1439483352222, "rating": 5.0, "text": "Great company to work with.  Called them for some information a few months ago and the owner was very helpful in answering my questions and provided some insightful information which other surveyors didn't mention.  Arranged to have them do the work and they were out within two days to perform the survey and all the paperwork necessary to submit to city planning for my project.  I would highly recommend them for your surveying needs!", "pics": null, "resp": null, "gmap_id": "0x88628b69d240dc1d:0xdc8050e6debb40ab"}
{"user_id": "111008122047704437292", "name": "christina bardos", "time": 1552424548178, "rating": 1.0, "text": "My mother called to find someone who will survey land for her and he told her she “had a freaking mess and good luck” and hung up the phone on her. Will never do business with him.", "pics": null, "resp": null, "gmap_id": "0x88628b69d240dc1d:0xdc8050e6debb40ab"}
{"user_id": "101885483787200345460", "name": "Kay B", "time": 1505496629604, "rating": 5.0, "text": "Good job", "pics": null, "resp": null, "gmap_id": "0x88628b69d240dc1d:0xdc8050e6debb40ab"}
{"user_id": "101411273176589867075", "name": "debra graham", "time": 1624983748660, "rating": 1.0, "text": "I have been calling this man for over four weeks now and leaving messages and when He has answered the phone, he keeps telling me he will look into my survey immediately  ...but then he doesn’t. I called him for the seventh and last time today and ask him why he kept telling me he was going to help and then not helping me… And he said that he was short staffed.  The professional way to have handled it was for him to tell me right away that he did not have time to help me. So, I have wasted a month waiting for him.", "pics": null, "resp": null, "gmap_id": "0x8862f6b7576f935f:0x898e06e38621317d"}
{"user_id": "104174970356407191645", "name": "BamaDave G", "time": 1617993599381, "rating": 1.0, "text": "AVOID THIS GUY - DO NOT USE!!! What a joke this guy is. Told us he would have us what we need on Monday it's now Friday. Won't answer the phone or return calls. One of the worst people we have ever worked with. he has now held up our home for 2 weeks of almost perfect weather. Absolutely no excuse for this kind of behavior.", "pics": null, "resp": null, "gmap_id": "0x8862f6b7576f935f:0x898e06e38621317d"}
{"user_id": "113933829238983675524", "name": "Gene Martin", "time": 1574877593951, "rating": 5.0, "text": "I have used Northstar on more than one occasion . Very professional and thorough. My family used them when our lake cottage suffered  damage during Hurricane Michael and their report on the lack of true structural damage allowed us to rebuild instead of bulldozing it down. I use them for all my engineering needs as a real estate agent and highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x889292a2895ed2bf:0x123be9efbf2f829a"}
{"user_id": "115949087426971088998", "name": "Steve Lowe", "time": 1563280724318, "rating": 1.0, "text": "Crooked!! They keep poor records, bully their customers and don't provide a good service. I Highly advise choosing another engineering company.\nPrice gouging is a crime, especially during a natural disaster.", "pics": null, "resp": null, "gmap_id": "0x889292a2895ed2bf:0x123be9efbf2f829a"}
{"user_id": "104021413187598327538", "name": "Doodle Doodle", "time": 1555683947612, "rating": 5.0, "text": "Very helpful and the staff is really nice.", "pics": null, "resp": null, "gmap_id": "0x889292a2895ed2bf:0x123be9efbf2f829a"}
{"user_id": "107363342776740055370", "name": "Rodney Wheeler", "time": 1622810869925, "rating": 5.0, "text": "Great to work with, and great work.", "pics": null, "resp": null, "gmap_id": "0x8861ffad5d986f0d:0x547d56c20d5bbca6"}
{"user_id": "107139689302312576415", "name": "Grayson Gilliland", "time": 1498089428028, "rating": 5.0, "text": "They installed a French drain at our house, they did a great job.", "pics": null, "resp": null, "gmap_id": "0x8861ffad5d986f0d:0x547d56c20d5bbca6"}
{"user_id": "103793864888512136312", "name": "Dusty Nix", "time": 1511718652073, "rating": 5.0, "text": "Great people to work with.", "pics": null, "resp": null, "gmap_id": "0x8861ffad5d986f0d:0x547d56c20d5bbca6"}
{"user_id": "103030408937727485969", "name": "Lori Seaborg", "time": 1592427773528, "rating": 5.0, "text": "We needed an elevation certificate done on our property for FEMA's flood insurance program. Mr. Raber was very quick at answering questions via email. Within 3 days of requesting service, he had a crew on our property taking measurements. Within 3 days of that, we received three sealed elevation certificates in our postal mailbox. All work was done in much less time than his estimate of two weeks. We were able to successfully use his Elevation Certificate with both FEMA and our insurance agent.", "pics": null, "resp": null, "gmap_id": "0x889a1b4c4e8e68bd:0x5593fac8929b3f66"}
{"user_id": "102959335131119596516", "name": "David Rittenhouse", "time": 1540336290721, "rating": 5.0, "text": "Class Act... had a small but very important job (for us) . Spoke with owner and he was more than accommodating but suggested another alternative  to save ME $$$.  to obtain boundary lines prior to starting a residential landscaping project. He was correct and saved us several hundred dollars.  WOW He choose customer service over his personal pocket..  RARE Honest company...  Top Rating and I don't give those away easily...", "pics": null, "resp": null, "gmap_id": "0x889a1b4c4e8e68bd:0x5593fac8929b3f66"}
{"user_id": "101097068440454140824", "name": "Shadavea Morrow", "time": 1531750958822, "rating": 5.0, "text": "Know this man personally. He knows his stuff... check him out...", "pics": null, "resp": null, "gmap_id": "0x889a1b4c4e8e68bd:0x5593fac8929b3f66"}
{"user_id": "116611285268320686603", "name": "Alex Smith", "time": 1548277816859, "rating": 1.0, "text": "Never returned my call.. went to another company and they were awesome!", "pics": null, "resp": null, "gmap_id": "0x889a1b4c4e8e68bd:0x5593fac8929b3f66"}
{"user_id": "102873784553806987050", "name": "USA NORTE AMERICA", "time": 1570650258691, "rating": 5.0, "text": "exelent", "pics": null, "resp": null, "gmap_id": "0x888a3ea32d5eda8d:0x252b9544e1ad7d29"}
{"user_id": "110576081629011195073", "name": "ALAN STEPHENS FALLETTA", "time": 1611358537264, "rating": 5.0, "text": "The andor Equal to the Best Architectural Firms in the Universe!", "pics": null, "resp": null, "gmap_id": "0x88891bba5c9f0eb7:0x59ed822ecb44b69c"}
{"user_id": "105041599367663082940", "name": "Ashley Wiley", "time": 1523470172885, "rating": 5.0, "text": "toured the firm on a field trip. the office is beautiful and the firm has done some amazing projects.", "pics": null, "resp": null, "gmap_id": "0x88891bba5c9f0eb7:0x59ed822ecb44b69c"}
{"user_id": "115247920295980873895", "name": "Adam Cornelius", "time": 1566418248917, "rating": 5.0, "text": "Great engineering and architecture firm", "pics": null, "resp": null, "gmap_id": "0x88891bba5c9f0eb7:0x59ed822ecb44b69c"}
{"user_id": "107254403120027757775", "name": "T. O.", "time": 1548335011434, "rating": 5.0, "text": "great place to work", "pics": null, "resp": null, "gmap_id": "0x88891bba5c9f0eb7:0x59ed822ecb44b69c"}
