{"user_id": "118282753136650315537", "name": "Sullivan Edwards (Sully)", "time": 1592187325175, "rating": 5.0, "text": "Abraham and his crew were professional, courteous, and performed everything that I expected, while keeping me informed if anything unexpected came up.\n\nThey fixed some major drainage and erosion issues in the back yard (see before and after photos) by burying downspouts, building a French drain that went out to the road, and tying the downspouts into the drain. It is super satisfying to watch tons of water just pouring out of the drain into the street after a heavy rain.\n\nThey also graded and re-sodded the yard with Zoysia for less than it would have cost me to personally buy the Zoysia and lay the sod myself. I highly recommend Legacy for your personal landscaping project.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOP9LLSa1FkSJ1SEPZpCGsOwAl6myjUPrUxR1F0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN98dNwL0edkoD6b89zP9wyvyor9iFBLkHJENx4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOcwqfMq36dQbjBEMG-GqPL2swoLWdU3AmyRSHr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO99bXwaTyRCuh9LNFMCJmsZDz1rJYqdFCWDXsF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPCymUBkm2VhA4pNs7oSkMAuAvH0JvuOHZkssMb=w150-h150-k-no-p"]}], "resp": {"time": 1595192916558, "text": "Mr. Edwards,  We would like to take the opportunity to thank you so very much for the positive review.  Abraham enjoyed working on your drainage project and we are truly blessed to have such great people working with us to help solve issues that our customers may be having.  Have a great summer!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "100681058269140551242", "name": "Rene' Holt", "time": 1599235633883, "rating": 2.0, "text": "I never like to leave bad reviews and always try to keep them positive, but I contacted this company to help with some backyard design and remodel. I had a meeting scheduled with Jacob this past Wednesday and when he was 30 minutes late, I called the office to make sure nothing was wrong. Jacob called back and offered no apology for being a no-show but we rescheduled for today. It's a hour last our appointment time and he didn't show up again with no call and didn't answer his phone. If you can't be professional enough to keep scheduled appointments, twice, you're not a company I want to work with.", "pics": null, "resp": {"time": 1599268358031, "text": "Rene', thank you so very much for letting us know about the appointment issues.  This rarely happens, let alone 2 times.  Jacob inadvertently kept the same time from last week's appointment on his calendar and received a notice this morning that you cancelled the appointment, assuming it was this afternoon.  We regret that we were not able to be of assistance with your backyard project and appreciate again the review so that we can strive to do better, even in such a crazy year!    Tami"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "104106105688529962394", "name": "Neva Turner", "time": 1593643378877, "rating": 5.0, "text": "Our experience with Legacy truly deserves 10 stars. From first contact they have been the best company we have ever worked with. Everything was done timely and professionally. Quality is top notch. They have shown quality of work ethic beyond measure. We highly recommend this company. During this difficult time with Covid 19, working with everyone at Legacy has been inspiring and uplifting.\nGreat company !!", "pics": null, "resp": {"time": 1595192603424, "text": "Neva, getting to know you and your husband has been one of the highlights of our year.  You are such a pleasure to work for and your appreciation and kindness have not gone unnoticed.  The crew always enjoys working with you on your projects and we look forward to seeing what else you may have in store for your beautiful home!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "101345560364732262291", "name": "Heather Meacham", "time": 1606402094566, "rating": 5.0, "text": "Paul and Tami are so great to work with.  They pay attention to every detail and our patio is just perfect.  Very professional!!!", "pics": null, "resp": {"time": 1606504910070, "text": "Heather, it was such a pleasure to work with you on your patio project.  I absolutely love the color of the concrete,  it was an excellent choice.  Thank you again and enjoy your new patio!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "113215240688685991775", "name": "Jason Comfort", "time": 1595108518120, "rating": 5.0, "text": "First let me say that my wife and I are extremely pleased with the work.  More importantly, Abraham and his crew were phenomenal.  They were cognizant of the fact that my neighbors and I are all working from home and kept the noise at a minimum.  They went out of their way not to leave a mess after the first day after asking what our HOA restrictions were.  When they were finished, they had filled in the large hole my dogs had dug and placed down a few pieces of sod to cover some bare spots.  Truly outstanding service.\n\nLastly, when they were finished, and before they left, your team saw one of my neighbors struggling to unload a trailer.  They offered to help unload the heavy item for him.  They were truly great ambassadors for the company.\n\nWe have some pretty grand plans for our back yard that will stretch over the next couple of years.  After this experience, I guarantee that we will be reaching back out to Legacy Outdoor Services.", "pics": null, "resp": {"time": 1595192427066, "text": "Jason, Thank you ever so much for the review!  Your patience as we worked on your project was very much appreciated as the wet weather  makes drainage work even more challenging.  We are very blessed to have great teams working with us and we can't wait to see what else you have in store for your home.  Have a great summer@"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "112641626804551730969", "name": "debi frankowski", "time": 1566673144178, "rating": 5.0, "text": "We are so pleased with the work that Legacy Outdoor Services just completed at our house.  They installed and sculpted the most beautiful waterfall feature in our mountainside back yard, along with up-lighting that really looks awesome in the evening.  Additionally, they put in a flagstone patio with a gas fire pit, with beautiful natural landscape features and mulch beds all around.  We have had many compliments on it, and it is surprisingly low maintenance too!  We just love it!\nWe had several unforeseen complications which were out of Legacy's control, related to our gas line installation and inspection,  that Legacy patiently and proactively worked through.  We appreciated their high level of customer service and commitment, and will certainly use them again in the future!", "pics": null, "resp": {"time": 1567096986076, "text": "Debi, We absolutely loved working with you both!  You have such a nice home and we were so happy to be able to help you design an outdoor living area that accented your already existing hillside.  You have been so very patient as we worked towards getting your gas issue resolved.  Now you can sit back and enjoy all the elements together that make for a very relaxing getaway!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "111137092066572068365", "name": "Jacquelyn Pletcher", "time": 1592770708261, "rating": 1.0, "text": "Make sure your quote is EXTREMELY detailed, and that you’re home and watching every step they take for quotes involving construction. Otherwise you’ll end up with new concrete that is uneven (that will forever pool water TOWARDS your home), concrete paint that is already permanently stained with mud BEFORE they leave/finish, deep tracks in your sod because they will drive a concrete truck in your backyard, ground/grass that isn’t graded back the way it was before construction and therefore leaving extremely uneven muddy hills all over your yard, nails and cigarettes in your yard WEEKS after they leave, and a final structure that is uneven, sealed poorly, with paint drips that have dried.\n\nWould not refer.", "pics": null, "resp": {"time": 1595193209813, "text": "Jacquelyn,  We just wanted to thank you for taking time out of your busy schedule to leave us a review.  It is always important for a business to strive to grow in their professionalism and communication skills.  That growth is hindered if someone does not express their concerns that arise during and after a project.  Thank you again!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "113838961780293246456", "name": "Aurora Marmolejo", "time": 1598412397716, "rating": 5.0, "text": "I had some pavers placed around my back screen porch and a flower bedding put in front of my home. They did awesome work always done within two days and they cleaned the area really good. I highly recommend Legacy outdoor services.", "pics": null, "resp": {"time": 1596206972369, "text": "Aurora, Thank you so much for taking the time to leave us a review!  The crews commented on how very kind you were to them while they were working and that means a lot.  We are excited for you to be able to use your new space and look forward to helping you in the future!\nTami"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "100748477103684685549", "name": "Susan Tuck", "time": 1549400602185, "rating": 5.0, "text": "We hired Legacy Outdoor Services for a drainage issue.  We quoted several other companies as well.  Not only did Legacy provide a detailed quote with the scope of work to be performed it was very priced very competitively.  The entire staff is to be commended.  I was kept informed as to when the job would be started without having to follow up.  When the crew arrived they were well prepared and ready to work.  This is by far the best crew I have seen.  They worked extremely well as a team.  This was a messy job to say the least.  The clean up was amazing.  When they left you couldn’t even tell they had been there!  I would highly recommend Legacy for your outdoor needs.", "pics": null, "resp": {"time": 1549428935298, "text": "Susan, thank you ever so much for the positive feedback.  We appreciate greatly the opportunity to help you with your drainage issues and we are glad that we were able to meet your expectations!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "109072573966849415490", "name": "Madeline Ortiz", "time": 1579308883532, "rating": 5.0, "text": "Great experience, really pleased with the result Good communication and work complete on time. Definitely will do business again. Highly recommend this business", "pics": null, "resp": {"time": 1579384645515, "text": "Madeline,  thank you so very much for the positive review.  It was such a pleasure to meet with you and to design a landscape you can enjoy for many years to come!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "115955243844226744303", "name": "Diane Cooper", "time": 1568841843519, "rating": 5.0, "text": "Legacy Outdoor helped me get a couple of trees planted in my bare back yard.  They look nice and the hummingbirds are already checking the Japanese Maple out.  Tammy and I worked together to find the perfect trees, exactly what I wanted.", "pics": null, "resp": {"time": 1595193111358, "text": "Diane, you have been so great to work with over the past several years.  We appreciate the opportunity to help you with new projects and look forward to many more in the future.  Thanks again!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "101461821337101273629", "name": "J M", "time": 1597024440968, "rating": 3.0, "text": "My yard is really uneven in places after having new sod laid and the length of time for them to get my project done is what gives them three stars. Otherwise, they did a good job.", "pics": null, "resp": {"time": 1597526895729, "text": "Your feedback is greatly appreciated!  This year has been rather frustrating as covid, weather, and supply issues have caused delays that we have not had to deal with in the past.  Nonetheless, we are grateful for your patience and we wish you a safe and healthy rest of the year."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "109396638207751190191", "name": "JB Robins", "time": 1560557782341, "rating": 5.0, "text": "Legacy Outdoor Services did a most beautiful job landscaping my front yard.  They installed a stone border around my flower beds and perfectly matched the stone with the stone on my house.  They added so much color to my yard with yellow, red and green shrubs and added even more color with flowers.  It is outstanding and I am extremely pleased.  The landscape workers are very professional and polite.  They were always on time and did what they promised each day.  The owner, Tami, came by most days to ensure that I was happy with the way the job was going.  They are very flexible and allowed me to do add-ons as we progressed.  I plan to re-landscape the back yard next and I will be using Legacy.  Their work is excellent!!!!", "pics": null, "resp": {"time": 1560657270577, "text": "Ms. Jan, thank you so very much for the great review!  We very much enjoyed helping you with your landscape project and we can't wait to see what new ideas you will have for us in the future!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "108150526745578549771", "name": "Patrick Miller", "time": 1567880827619, "rating": 5.0, "text": "We are very happy with the work that was done. Owners and workers were extremely professional and courteous. Work was done on time and within budget. We can highly recommend this company.", "pics": null, "resp": {"time": 1567988196795, "text": "Patrick,  it was such a wonderful experience to work with you and your wife on this project.  To be able to add more outdoor area for you to enjoy while adding a functional walkway was our goal.  It was rather hot and your attention to our crew was appreciated.  Again, thank you for your review."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "109547156616978257415", "name": "Joy Fitzpatrick", "time": 1565783180842, "rating": 5.0, "text": "Loved working with Legacy on my landscaping and hardscaping.  They have a lot of creative ideas and deliver as promised. Their employees were respectful and pleasant to work with. I'll be contacting them again when I install a pergola and some additional projects.", "pics": null, "resp": {"time": 1567097194046, "text": "Joy,  Thank you so much for the encouraging review!  You had such great ideas that were not like most cookie cutter landscapes you might see.  It was so much fun finding unique plants and I have to admit there are more \"tropical\" options for this area than I thought.  You are great to work with and I hope that we have the opportunity to help you again in the future."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "116412605110655843432", "name": "Carol Johnson", "time": 1537409321880, "rating": 5.0, "text": "We chose Legacy Outdoor Services to implement the first phase of a multi-year landscape plan for our new house. It was an excellent experience all around and we are very, very pleased with the results. Everyone there is a pleasure to work with. Paul walked through the project with us when he did our estimate, and proposed several changes to our designer’s plan that were improved solutions to fix our yard’s drainage challenges. Jessica, the office manager, was always responsive to questions, and Tami did a great job hunting down the plants we selected — which wasn’t that easy in September. When they couldn’t find the specific plants on our plan, she collaborated with us to select acceptable substitutes.\nAustin, our project manager, and his crew were wonderful. They are great guys, hard workers, and do an amazing job. Even the installation was a collaborative experience. Austin suggested an additional dry creek bed on the side of the yard to deal with the excess water that funnels into our yard from the neighbor’s driveway. We are looking forward to working with Legacy again next year when we install the next phase of our landscape plan!", "pics": null, "resp": {"time": 1537447808248, "text": "Carol, you were such a pleasure to work with and everyone agreed that your design was just beautiful!\nWe can't wait to see what the next phase has in store.  Thank you again."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "112026042859733791059", "name": "Dana Williams", "time": 1551914985325, "rating": 5.0, "text": "I had drainage work done and these guys did great. Paul and his crew got on the work quickly and worked hard to complete the job through some very difficult conditions. Austin ran the crew and he was an expert at his work and went well beyond to finish a french drain, grading and downspout pipes to the street. Austin is a fine person to work with as well as his second in charge Abraham.", "pics": null, "resp": {"time": 1551985735501, "text": "Dana, thank you so very much for the encouraging words!  You are right, sometimes the wet weather makes drainage work rather challenging.  You were both so very patient and helpful during the whole process and we are so very thankful for the opportunity to help you with your drainage issues."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "113949714652133284084", "name": "Joey Borders", "time": 1554999936331, "rating": 5.0, "text": "If you need landscaping done give Legacy a call. They do all kinds of work, but we personally had hardscaping done. They came out, viewed our patio, designed a new layout, tweaked it a few times to get it within our budget, and completed the work. I even reached out to several other companies in the beginning stages. Legacy gave us the best design with the best cost. We worked with David the majority of the time. He and the company are professional. Extremely courteous and will answer any questions/concerns. Two thumbs up.", "pics": null, "resp": {"time": 1555079634538, "text": "Joey,  We absolutely loved your design, it was unique and functional for your family.  You were such a pleasure to work with and we appreciate the opportunity to help you with your hardscape project.  Have a great spring!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "103767282675903416009", "name": "Diane Moore", "time": 1547788128837, "rating": 5.0, "text": "Legacy Outdoor Services has a great team of people and are so easy to work with.  We hired them to do some ground prep work before we installed our above ground pool.  The workers were very courteous, polite, and always showed up on time.  We couldn’t have asked for a better job and highly recommend them!", "pics": null, "resp": {"time": 1547827275608, "text": "Diane, thank you ever so much for letting us know about your experience!  As always, it was a pleasure working with you and we look forward to more projects in the future!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "102804315426935822342", "name": "Lisa", "time": 1460758438235, "rating": 5.0, "text": "Legacy Outdoor Services is the only service of this type that I will use.  They have done multiple projects for me over the course of the last few years.  Their workers are always respectful and courteous. As a woman with workers on my property, that is very important to me.  They truly go the extra mile in making sure that I am completely satisfied with their work.  Whenever the opportunity arises, I am happy to recommend Legacy to anyone who needs work done, and I do so with the utmost confidence in the caliber of work that they will provide.", "pics": null, "resp": {"time": 1463678866334, "text": "Ms. Lisa,\nIt has been the utmost pleasure to work with you on all of your projects.  Your ideas are unique and beautiful and it has been a wonderful experience bringing those ideas to life.  Customer relations is very important and we are so grateful for the opportunity to be involved in meeting your expectations."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "108483660875607420822", "name": "Tami McGhee", "time": 1538179639652, "rating": 5.0, "text": "I chose Legacy Outdoor Services for a flower bed landscaping project last year and recently for a drainage project.  The owner, office staff and workers were all very knowledgeable, professional and a pleasure to work with.  I was very pleased with the work as well as the follow-up to ensure my satisfaction with the projects.", "pics": null, "resp": {"time": 1538412473747, "text": "Tami,  It was such a pleasure helping you with your project!  Drainage issues can be overwhelming and costly if not taken care of, we are so very pleased that we were able to help you with your issues and look forward to any future projects you may have."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "115395017058219405457", "name": "Ch Carter", "time": 1536679832009, "rating": 1.0, "text": "Called and tried to get an estimate to install landscaping in the rear of our newly purchased home and we're told we're outside \" Legacy's service area\" I wasn't looking for weekly lawn service I was searching for a one time landscape install.  Their website says they provide this type of service, and their office says they service parts of Owens Cross Roads, but don't cover where  I live in Meridianville.  A check of Google maps shows it's basically the same travel distance.  Must be nice to be doing so well that Legacy can afford to turn down a job, sight unseen.", "pics": null, "resp": {"time": 1536691877822, "text": "Thank you for your response.  You are correct in that we have a set distance of service from our location.  When our office is given an address of service, we then check to see if that address is within the distance we have set for our service area.  Each address is unique and may fit into our service area whether it be in Owens Cross Roads or Meridianville.  It is necessary to have perimeters in order to provide the most cost effective price for both our potential customers and our company.  Good Luck on your project."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "112498271920360270383", "name": "Mike Gordon", "time": 1547498421601, "rating": 3.0, "text": "Don't bother calling them if you are locating over the mountain in the Hampton Cove area. They even say they serve the \"Huntsville\" area, but I guess not. I'll take my business elsewhere.", "pics": null, "resp": {"time": 1547506880999, "text": "Mike, thank you for your feedback. You are correct in that we have a set distance of service from our location. When our office is given an address of service, we then check to see if that address is within the distance we have set for our service area. Each address is unique and may fit into our service area whether it be in Huntsville or Hampton Cove. It is necessary to have perimeters in order to provide the most cost effective price for both our potential customers and our company. Good Luck on your project."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "116464768980852366180", "name": "Grant Patten", "time": 1493326199889, "rating": 5.0, "text": "Amazing work! Went above and beyond, we were very satisfied. We had them come out for lawn service / hedge trimming / tree trimming / bush removal as well as lawn mowing, and we would definitely use Legacy Outdoor Services again in the future.", "pics": null, "resp": {"time": 1515601890434, "text": "Thank you so much for allowing us to help you with your project!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "102247343157860787735", "name": "Mark Bailey", "time": 1537295229665, "rating": 5.0, "text": "I had Legacy install a partial fence for our backyard.  The work was performed quickly and well done.  Very satisfied.", "pics": null, "resp": {"time": 1537448121165, "text": "Mark,  Thank you ever so much for allowing us to help you with your fence project.  We know you will enjoy the privacy for many years to come!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "102613479039580587098", "name": "Wes G Smith", "time": 1459540121771, "rating": 1.0, "text": "I would not use this contractor again, nor would I recommend them to anyone else.  They did a drainage project for me where I explicitly described the design I wanted and it incorporated solid PVC pipe.  On the day of the job, the workers showed up with corrugated pipe.  When I called the owner, he stated that PVC would be $800 more, so feeling like I didn't want to start over with another contractor, I told him to go ahead.  Then I found out that a portion of the water to be drained to the street running from the downspout  was going through perforated corrugated pipe (pipe with holes).  They assured me that the water would be moving and would not leak out into already saturated ground (yeah, right).  Then I came home to find that the grate to catch water coming off the sidewalk was about 1 and a half to 2 inches away from the sidewalk, requiring the water to run over dirt before entering the grate.  The owner tried to tell me that it would be no problem and the bare dirt would not erode despite water constantly running over it.  I insisted that concrete be put between the sidewalk and grate to keep the water from washing out the dirt.  When I came home, I found they had used a type of caulk between the grate and the sidewalk, and had done a messy job of it, I don't know if that much caulk will ever cure.  After two days it is still soft.  Additionally, where they cut through the curb, the re-concreting was extremely poorly done.  It looked like they didn't even use a trowel, much less a curbing tool.  It looked like they basically packed the concrete on with their fingers and left it.  Part of the contract called for doing a brick border along the sidewalk.  After I paid them for the portion of the contract for the drainage, they informed me that they were waking away from the contract and that I needed to find someone else to do the edging.  The pity is, the subcontractor they had lined up to do the masonry work actually sounded very competent.  Bottom line, this is a company that, in my opinion, cut corners at every opportunity, poorly designed the project, provided shoddy workmanship, and then walked away with nearly half of the contracted work unperformed.", "pics": null, "resp": null, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "112627625497851587477", "name": "Matthew Buxton", "time": 1540823978606, "rating": 5.0, "text": "My experience with Legacy Outdoor Services was great from start to finish. Austin and his crew did a great job, furthermore everything was cleaned up before they left.", "pics": null, "resp": {"time": 1542752671590, "text": "Matthew,  It was such a pleasure working with you on your project!  Austin and the crew were so very thankful for your help during the process and we are so happy we were able to help you with your drainage issues!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "114140904219899268546", "name": "Cindy McCrary", "time": 1539029376692, "rating": 5.0, "text": "Very satisfied with the landscaping and drainage work Legacy has done at our house.  Their honest and friendly crew was always a pleasure to work with.", "pics": null, "resp": {"time": 1539279886556, "text": "Cindy, thank you so much for allowing us to help you with your projects.  It has been such a pleasure to be able to work with you over these past several years!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "109399262948912963856", "name": "Carey Rosenblum", "time": 1465960466598, "rating": 5.0, "text": "Legacy outdoor has serviced my home grounds for several years. They installed a designed row of arborvite trees along my rear property line that are very healthy and provide a natural green screen of privacy. Otherwise they have come out annually to do some re-mulching in my flowerbeds and have given them thst extra spark in appearance. If you have some landscaping issues or need suggestions I would recommend them. They are honest and do good work.", "pics": null, "resp": null, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "117947770864316007014", "name": "Jennifer Benavides", "time": 1537324665297, "rating": 5.0, "text": "Dependable, honest and hardworking! Thank you Legacy for a great job once again.", "pics": null, "resp": {"time": 1537447929235, "text": "Jennifer, thank you so much for allowing us to help you with your project.  Can't wait to see what your next project will bring!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "101586645822953159514", "name": "matt demuro", "time": 1532362506140, "rating": 1.0, "text": "This company gave me probably the worst experience that I have had with a company that has done work for me. I contracted with them to do drainage work, a sprinkler system and landscape lighting.\n\nI was told this would take 3 weeks to complete, with each phase occurring on consecutive weeks. The project as a whole took almost 12 weeks to complete, and this was only because I hounded them with calls multiple times per week.\n\nThe drainage work was the first part, it seemed to be fine, though the French drain was not placed the complete length that was discussed originally. Also the fingers of river rich were put in to stop erosion, but almost no grass seed was put in afterwards, so nothing but weeds grew in between the river rock.\n\nThe second piece was the sprinkler system. This was put in during a day, but the ground was not backfilled properly and they needed to come back out to fix it. We were told that they would put down grass seed after the lighting job was completed. The lighting work was not completed for another 8 weeks, and there wasn’t any seed put down afterwards. They were also supposed to aerate and oversees the lawn, but since they could not get their mower into our backyard, they told us they would come back with a smaller mower to pull the aerator later. This never happened.\n\nI had to call them 2-3 times a week for 8 weeks to get them to complete the lighting. Part of it was landscape lighting, the other portion was putting in a fan and spotlight in/on our screened patio. The wiring was placed so shallow, that it came out of the ground within a week and they had to come back to fix. The light and fan was supposed to be put in by an electrician, but was just put in by the owner and his friend. They put a cheap conduit over the electrical wire that didn’t even cover the wire.  They sent an electrician out to fix the wiring, but he just rigged another kind of conduit on the bare wire to cover it up.  The uplighting for the trees was sold to us at $65 a light. I just found the lights online for $45 for a 4-pack of lights.\n\nWe just gave up with this company and figured we would just be stuck with this work. Over the last year, I kept burying and covering up the wire as it came out of the ground and have been trying to repair the grass in the area where they did sprinkler and drainage work. We are still fighting massive weeds from the lack of follow through on planting grass after their work was completed.\n\nI am writing this review today after I just finished replacing 3 lights that stopped working and half of the wiring that was put in for the landscape lights. Turns out they believe that wire nuts are not necessary and you only need to tape wires together with electrical tape before putting it in the ground.\n\nIf you are looking for a company to do landscaping work for you, stay very far away from this company. You will only be sorry if you choose them.", "pics": null, "resp": {"time": 1533529694432, "text": "Thank you for bringing all of this to our attention.  Unfortunately scheduling can be a challenge when dealing with different elements and sometimes issues arise.  For example the drainage was delayed due to an unmarked water pipe, flooding the drainage trenches.   The ceiling fan was installed by a certified electrician, as was the wiring for the fan, flood lights and outdoor switch.  We would be more than happy to provide the name of the electricians that provided these services.   The contract states that there is a year warranty covering defects in workmanship and materials.   Is regrettable that we did not have the opportunity to fix the issues that you were having with your lights, thus alleviating some of your frustration.  If we had only known of the issues we would have been more than happy to fulfill the contact’s one year warranty.  Again thank you for your comments and we will take them all into consideration to better our services."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "108670955347642886754", "name": "Stephen Rice", "time": 1463175075861, "rating": 5.0, "text": "I highly recommend Legacy Outdoor Services. Our neighbors compliment our yard all the time and these guys have helped with minor and complex issues on our property. We trust them 100% and most of all, they are super professional for a service company.", "pics": null, "resp": {"time": 1463678652280, "text": "Mr. Rice,\nIt has been a pleasure working with you and we appreciate the opportunity to meet your lawn care needs."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "106141751648914846395", "name": "Jim Wittenborg", "time": 1524758298468, "rating": 1.0, "text": "I would like to have used this company for a drainage installation job, however, when I called and gave my address (near Hampton Cove), I was told that I lived too far away for their business.  I guess companies just don't go that \"extra mile\" for business anymore.", "pics": null, "resp": null, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "105383289762301934437", "name": "Richard Brown", "time": 1592346320110, "rating": 5.0, "text": "Good company to work with", "pics": null, "resp": {"time": 1592496094177, "text": "Thank you so much for allowing Legacy to help you with all of your projects.  It is always a pleasure to spend time with you both!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "116286265246138571995", "name": "Elle Johnson", "time": 1628530762019, "rating": 1.0, "text": "Well look what popped up to be reviewed. I was going to roll with the punches since the company was a sub under Woodland Homes but since old Google wants to know...my opinion. Horrible company!!!! If I could give it a negative star I would. This company has no pride in their work. They laid our sod all kind of crazy in the dead of winter and didn't roll it properly. If not careful one could easily break an ankle. They turned our sprinkler heads against the house and garage like idiots and quite a few were broken. It's the work of 2 year olds. And, it's a non warranty service so there lies the problem. If most are doing a job they never have to return to then they are not going to put too much pride in doing the job. Every home in this subdivision has issues with the sprinkler systems Largen installed. Company and companies who use and treat people unfairly...well we all know what happens. I would never recommend a company who lacks integrity and customer satisfaction. They are horrible!", "pics": null, "resp": null, "gmap_id": "0x886200e09e5cdb09:0xec31a4310d788318"}
{"user_id": "116740596698882077742", "name": "Dan Lambert", "time": 1619097852959, "rating": 1.0, "text": "Called and made an appointment for the next morning for service, between 8 and noon.  Got a call later in the morning from office manager  that the serviceman wouldn't make it until that afternoon.  Waited around all day.  Not another call.  Nothing.  Next day, nothing.  Literally just dropped their commitment without so much as phone call or a \"Sorry!\"  Really poor.", "pics": null, "resp": null, "gmap_id": "0x886200e09e5cdb09:0xec31a4310d788318"}
{"user_id": "107350781980902401806", "name": "Kimberly Sexton", "time": 1605730190993, "rating": 1.0, "text": "We had a horrible experience with Largen. They just didn’t show up serval times when they were scheduled to install sod and irrigation for us. After about three weeks of not showing up or calling to cancel, we told them we no longer needed their services. However, they put us in a terrible bind for the company that was scheduled to install our fence! The landscaping they did complete- flower bed- the bushes are wrong and the mulch is skimpy! Parts of the area isn’t even covered. I would not recommend using Largen for any of your landscaping needs.", "pics": null, "resp": null, "gmap_id": "0x886200e09e5cdb09:0xec31a4310d788318"}
{"user_id": "102663003469304580903", "name": "Cody Smith", "time": 1620047602783, "rating": 5.0, "text": "Awesome company, great irrigation service...", "pics": null, "resp": null, "gmap_id": "0x886200e09e5cdb09:0xec31a4310d788318"}
{"user_id": "114647430719493616704", "name": "Stacy Mcbride", "time": 1624574257650, "rating": 4.0, "text": "It was a great place to work", "pics": null, "resp": null, "gmap_id": "0x886200e09e5cdb09:0xec31a4310d788318"}
{"user_id": "118369867995449046285", "name": "Kathleen Burns", "time": 1596547613126, "rating": 1.0, "text": "Just purchased a home whose owners used Largen Landscape for irrigation installation and repair.  There is an irrigation leak that Largen was asked to inspect numerous times without resolution and because the previous property owners have an outstanding bill, Largen will not service the new owners.  So as the new owners who have inherited an irrigation system with a major break/leak, we are forced to find another service provider who does not have historic knowledge of the system.  Not a good business plan and Largen just lost this customer and anyone who seeks a referral from us.", "pics": null, "resp": null, "gmap_id": "0x886200e09e5cdb09:0xec31a4310d788318"}
{"user_id": "115051857275815814299", "name": "Carissa Clay", "time": 1549641930542, "rating": 5.0, "text": "The guys at Largen always do a great job! They are always professional. I definitely recommend them!", "pics": null, "resp": null, "gmap_id": "0x886200e09e5cdb09:0xec31a4310d788318"}
{"user_id": "109330293979145609721", "name": "Christopher Stewart", "time": 1564582269779, "rating": 5.0, "text": "Responsive and professional And always willing to go above and beyond to ensure customer satisfaction.", "pics": null, "resp": null, "gmap_id": "0x886200e09e5cdb09:0xec31a4310d788318"}
{"user_id": "105095734393443967003", "name": "Earkley Frazier", "time": 1548195687082, "rating": 5.0, "text": "Excellent service, great job", "pics": null, "resp": null, "gmap_id": "0x886200e09e5cdb09:0xec31a4310d788318"}
{"user_id": "118219639489422403462", "name": "Activated Channel", "time": 1627583101369, "rating": 5.0, "text": "My wife and I are very pleased with our spotlights! They look great and really make our home stand out at night! Cliff was informative,responsive and easy to work with. Daniel and John did a great job with the install. Thanks fellas!\n\n- Jarad", "pics": null, "resp": {"time": 1627584830790, "text": "Thank you so much, Mr. Roberts, for your review and again for your business! We agree! Your new landscape lights are absolutely beautiful! We will continue to be available for whatever you may need. Thank you again!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "106418706644355862432", "name": "Matthew Glidden", "time": 1621008470842, "rating": 5.0, "text": "Cliff and his crew did an AMAZING job making our backyard come to life.   We had a meeting with Cliff to discuss lighting up the backyard while our pool construction was still going on.  He listened to the design I had and then he did his magic and came up with a design that when it was completed looks like a resort.  Absolutely blown away at the difference it made to the back yard.  His cost matches his work, service and quality of their products.  If you’re going to invest in this do it right the first time and enjoy it.\n\nHe’s been the only contractor I’ve had in these past 3 months that has actually communicated and showed up when he said he was going to and got his job done.\n\nI will recommend them to anyone that needs landscape lighting/design!\n\nThanks Again!!", "pics": null, "resp": {"time": 1621260013887, "text": "Thank you, Mr. Glidden, for you review and again for your business! It was our pleasure every step of the way. You are right, your lights turned out to be absolutely beautiful! We will continue to be here for whatever you may need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "114127030031119884607", "name": "David Burton", "time": 1622249042127, "rating": 5.0, "text": "Cliff and his team were outstanding in every way. When we contacted Cliff he walked us through our options and made recommendations to help us decide on the type of lighting fixtures we would use. His personal care and obvious expertise is what led us to decide on PRO-CUT and Cliff. They agreed to travel over an hour to our location. The lighting system was installed ahead of the promised schedule. His workers were both courteous and conscientious. The quoted price was almost half of what other companies quoted us. We are extremely satisfied with the finished lighting system and cannot say enough good things about PRO-CUT, Cliff McGinness and his team. I would highly recommend using this company to help you with your choice and installation of your lighting system. They are truly outstanding in every way!!", "pics": null, "resp": {"time": 1622587460817, "text": "Thank you so much, Mr. Burton, for your business and your review! Your words were so kind! We are so happy that you are happy and it was our pleasure every step of the way! We will continue to be here for whatever you may need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "118177394177396758988", "name": "Colleen Buckner", "time": 1627581888652, "rating": 5.0, "text": "We are very pleased with our decision to do our landscape lighting with Pro-Cut and Cliff McGinness.  His professionalism was reenforced by the fact that he showed up on time, spent a great deal time reviewing our landscape and talking with us for our wants and needs.  After making his assessment and before he left, he outlined a complete and detailed plan including various options for either doing everything at once, or picking and choosing what best fit with what we wanted and our budget.  Cliff also followed up twice by coming by at night and checking to see if everything was operating correctly and making a few minor adjustments.  And BTW, the crew he sent for the installation were competent and professional.  We would have absolutely no problem in highly recommending Cliff and POR-CUT for any of your landscape lighting needs.", "pics": null, "resp": {"time": 1627585086893, "text": "Thank you so much, Mrs. Buckner, for your kind words and compliments! We appreciate your business! All of your new lighting is absolutely beautiful, especially the lights on the waterfall! What a cool feature and now you can enjoy it at night too! It was our pleasure every step of the way and we will continue to be available for whatever you may need. Thank you again!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "104886795989879964392", "name": "Nancy", "time": 1619807433247, "rating": 5.0, "text": "We have just had landscape lighting installed at our house by PRO-CUT. Cliff and his team did a wonderful job and everything looks so beautiful. We are enjoying the lighting so much! They are very professional and knowledgeable about everything, especially in the layout and design. Would definitely recommend them for your landscape lighting needs.", "pics": null, "resp": {"time": 1619809718678, "text": "Thank you so much, Mrs. Whitmire, for you business and your review! Your lights are beautiful and really make such a difference! We will continue to be here for whatever you may need. Thank you again!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "100504835212803375489", "name": "Shanna Ndong", "time": 1624092432913, "rating": 5.0, "text": "I’m very happy with our landscape lighting.  Cliff was professional and did an excellent job.  Highly recommended!", "pics": null, "resp": {"time": 1624294518327, "text": "Thank you so much for your review and again for your business! We appreciate you and will continue to be available for whatever you may need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "105692429440508185744", "name": "Judith Laferriere", "time": 1624617794651, "rating": 5.0, "text": "Cliff & his team did an absolutely amazing job we are so happy with our landscape lighting and highly recommend them. We can't say enough how happy we are with the way our landscaping looks.", "pics": null, "resp": {"time": 1624638902332, "text": "Thank you so much for your review and again for your business! Your new lights are absolutely beautiful! We will continue to be here for whatever you may need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "104197475563893568606", "name": "WinHuntsville", "time": 1611539139888, "rating": 5.0, "text": "Had a relatively small job (color gels for holiday lighting).  It was handled quickly, on schedule, and at a good price.  Will definitely use them again.", "pics": null, "resp": {"time": 1611592592158, "text": "Thank you so much for your review and again for your business! We appreciate all of our customers!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "106694256935832540868", "name": "David Bell", "time": 1609268139372, "rating": 5.0, "text": "The owner said he would show up for initial consultation at 1:00 pm and he drove up at 1:00 pm. I was sold on this company at that time. Nobody shows up on time anymore.Very professional throughout the process. Great quote and completed project when they said they would. I would give them 10 stars if I could", "pics": null, "resp": {"time": 1609273037855, "text": "Thank you so much for the review and your compliments! We greatly appreciate you and your business!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "117231774604453790220", "name": "Tina Caudle", "time": 1609264384170, "rating": 5.0, "text": "They were professional and timely. The owner came back twice to adjust the lights once they were installed. His standard not mine. 5 stars and would highly recommend.", "pics": null, "resp": {"time": 1609273350682, "text": "Thank you so much for the review and your compliments! We will continue to be here for whatever you need. We greatly appreciate you and your business!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "105290387339619681737", "name": "Junior Smith", "time": 1625226939197, "rating": 5.0, "text": "Cliff and crew were A++. Recommend Highly!!", "pics": null, "resp": {"time": 1625503665409, "text": "Thank you, Mr. Smith, for your review and again for your business! We appreciate you and will continue to be here for whatever you may need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "113825956556837121721", "name": "Fran Nicholson", "time": 1613066455001, "rating": 5.0, "text": "Love, love my lights. Very professional, courteous people. Highly recommend this company.", "pics": null, "resp": {"time": 1613148196960, "text": "Thank you so much for your review and again for your business! It was our pleasure every step of the way and we will continue to be here for whatever you may need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "113547841471297387079", "name": "Saylor Games", "time": 1610395054963, "rating": 5.0, "text": "Cliff and his team did an excellent job, were accommodating, and we highly recommend their service. Will definitely use again when/if we decide to update or add onto our outdoor lighting.", "pics": null, "resp": {"time": 1610467669751, "text": "Thank you so much for your review and compliments! It turned out beautiful! We appreciate you and your business!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "105655216381357319521", "name": "Bliss Burton", "time": 1590698802823, "rating": 5.0, "text": "THE ABSOLUTE BEST DECISION YOU CAN MAKE! My husband and I are newer to the Huntsville area, so we began the journey of finding someone to do our landscape lighting. We initially started small - just wanting to highlight a few larger trees in our backyard. However, after seeing the end product from Cliff and the Landscape Lighting by PRO-CUT team, we were hooked!!! We love it so much we have actually had 3 separate installations already - one for our trees, another for our sidewalk areas, and the last to highlight our front yard and house. It's really given our entire property a \"resort\" type of feeling and added so much to the enjoyment we experience.Visitors constantly comment on the lighting / vibe in general when coming over in the evening, too which has been a total plus. It's been a GAME CHANGER for us and worth every penny.\n\nOur experience with Cliff has been so phenomenal. I am a very type-A personality, and if we hire something to be done, I really only want to work with the best in the business. I actually interviewed 8 people about the landscape lights, and found Cliff to be by far the most professional, on time, and highest quality company in the North Alabama area. There are SO many people who can install a light for you...don't fall into that trap. The difference between that and what you will get with Cliff and team is the QUALITY. Your house won't be lit up like a 7/11 quickstop with \"cheap\"   light quality. Cliff gives a great deal of consideration for the shadows, angles, and fixture placements. The lighting is very strategic and intentionally placed, similar to what you would see at a 5 star resort.\n\nI am telling you, if you are looking for landscape, tree, area, house, or any exterior lighting, don't look any further than Cliff and team!! You won't regret it, I can promise you that!", "pics": null, "resp": {"time": 1590708821165, "text": "You are AWESOME! Thank you so much for your kind words! It has been our pleasure every step of the way. We pride ourselves at giving a different level of service and doing things better than everyone else. We are so happy to hear that you have been so happy! We will continue to be here for whatever you need and appreciate you and your business."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "103853077928625350389", "name": "Joe Parker", "time": 1605240572868, "rating": 5.0, "text": "Pro-Cut installed front and rear indirect lighting at my home and did a great job.  crew was very professional and did the job in timely manner and at a reasonable cost.", "pics": null, "resp": {"time": 1605285616641, "text": "Thank you so much, Mr. Parker! We appreciate your business and review! Please let me know if you ever have any questions or need anything at all."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "102028710637736451406", "name": "Suzanne Edmondson", "time": 1576018756295, "rating": 5.0, "text": "I had a wonderful experience from start to finish! I felt fully informed about “Everything” and the job they did was excellent in every way! Cliff was very knowledgeable and the price was better than several other quotes I received. He even gave me see several addresses that I could go see where they had installed their lighting so we would be sure that I got the look I was after. He also gave several options to choose from as how few or how many lights i wanted to achieve what I wanted. I couldn’t be happier and I would highly recommend this company!  I will also add that I am very picky!! Ha!! Excellent job!!", "pics": null, "resp": {"time": 1576076141050, "text": "Yes, Ma'am. Thank you so much for your kind words and your review! It was our pleasure every step of the way. It turned out beautifully and we are so happy that you are happy! We will always be here for whatever you may need. Thank you again!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "104983959432521451932", "name": "Diana Davidson", "time": 1584303560927, "rating": 5.0, "text": "Cliff designed and implemented my landscape lighting several years ago. I trusted him implicitly on the work - I wasn't even in the country when he did the job. So, what a wonderful surprise when I came home - a beautiful, subtly lit landscape that makes me feel safer and more secure on my own property. When I installed a bubble rock for all my wild birds, Cliff designed lighting in the trees directed to the bubble rock, so that at night it looks like it is lit by the moon!  Recently, I had some construction done and they were a bit careless with my landscape lighting, damaging many of my lights. When I notified Cliff, he had someone in to repair the work within 48 hours, reestablishing my lighting and restoring my sense of security. I trust this company for their expertise, their professionalism, and they're responsiveness to my needs. As my landscape evolves, I will always trust Pro-Cut to provide for any changing requirements. This company has earned my respect and my highest recommendation.", "pics": null, "resp": {"time": 1584365856576, "text": "Thank you so much for your compliments! We have greatly appreciated you as a customer and a friend for several years now. It is truly our pleasure! Thank you so much again for everything!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "108313127233936142546", "name": "Donnell Curry", "time": 1590201027362, "rating": 5.0, "text": "We had been waiting for a long time to put some finishing touches on the landscaping of our yard.  Landscape Lighting by Pro-Cut definitely gave us the night time lighting effect that we had always loved to see, when taking vacations to our favorite resorts.  The service was outstanding, and during the consultation, Cliff provided ideas and insight that we totally weren't aware of, or knew would make a difference with lighting effects.  Everything from the installation of new power outlets outside the house, concealing the power cables, positioning of the lights, and even cleaning up the yard afterwards, was done in such a professional way.  We were truly satisfied with ALL aspects of the service.  I highly recommend Landscape Lighting by Pro-Cut to anyone, who wants to have that professional landscape lighting effect, to compliment your landscape elements!", "pics": null, "resp": {"time": 1590419368211, "text": "Thank you so much, Mr. Curry, for your review and your business! We are so happy that you are happy! It turned out beautifully!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "114554072408172723248", "name": "James VanderWier", "time": 1592309799982, "rating": 5.0, "text": "Very rarely do you find a company like this. Do what they say they are going to do, when they are going to do it. Exceeded my expectations. I could not even find where they buried the lines or disrupted our landscaping.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNHTgjqmR4J8UngfzXTg-BUE0KJ-ObVRJlPtlOv=w150-h150-k-no-p"]}], "resp": {"time": 1592319373409, "text": "Thank you so much for your review and your business! We pride ourselves in being the best, doing things the right way and exceeding expectations. We could not be happier that it shows! It was a pleasure dealing with you and your family and we are very proud of the results. We will continue to be here for whatever you need. Thank you again!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "109020272756155152762", "name": "Emery Lang", "time": 1559666863673, "rating": 5.0, "text": "We used them to light the front of our house. They did an amazing job. Not only was the price fare they were very professional. I highly recommend these guys! I ran over one of the lights and called Cliff that night and the next morning he was here fixing the lights. Talk about fast service. This company takes customer service to a new level. I highly recommend using this company. I can't wait to use them for our back yard once we get our pool installed. He is always looking out for the best interest of the customer.", "pics": null, "resp": {"time": 1559607356485, "text": "Thank you so much! You and your family have been so easy to get along with over these past couple of years. We are so happy that y'all are still enjoying your lights! We are always here for whatever you may need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "108768920920779748435", "name": "Carrie Rogers", "time": 1558737192961, "rating": 5.0, "text": "We had a lighting package installed about three years ago and have been thrilled with it! We get tons of compliments and love how the lights enhance our home. We definitely got our money’s worth. Cliff was truly a professional from start to end and was dedicated to working with us and tweaking everything until it was just right. He is quick to respond to follow ups when we have needed to replace bulbs or had other questions. I wouldn’t think of calling anyone else for beautiful lighting!!", "pics": null, "resp": {"time": 1558745462431, "text": "Thank you so much for your kind words, your review and again for referring us to your neighbors! It has been our pleasure working with you and your husband over the years. We will continue to be here for whatever you need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "100515806494687739193", "name": "Andy Benefield", "time": 1592264092538, "rating": 5.0, "text": "Cliff did an amazing job with our lighting in the front and back of our house. He has such an artistic vision and we couldn’t be happier with what he did to help our home look even more beautiful.", "pics": null, "resp": {"time": 1592319166851, "text": "Thank you so much for your review! Y'all are the best! I have appreciated your business and our working relationship all these years. We were so happy to get lights in at your new house. It is all so beautiful! Thank you again for everything and I will continue to be here for whatever you may need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "101799081377772065339", "name": "Nolan Denton", "time": 1567039513337, "rating": 5.0, "text": "Highly recommended. I worked with Cliff via email starting with some photos and ideas. He rapidly helped get to a really good concept then came and did a site visit for final dimensions and budgeting.\n\nCliff was prompt and courteous with the installation. He was very professional even when I called back and asked him to come back and modify my design to  basically what he recommended in the first place. He knows what he's doing. You will be happy with the work he does and working with Cliff.", "pics": null, "resp": {"time": 1581470454131, "text": "THANK YOU!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "102580637386039769041", "name": "Amelia Ragland", "time": 1584235674727, "rating": 5.0, "text": "My outdoor lighting was just installed and I couldn’t be happier. Cliff was easy to work with and collaborated with me to achieve the best design to highlight the beauty of my yard.\nI’m a very happy customer 😊", "pics": null, "resp": {"time": 1584365389083, "text": "We are so happy that you are happy! I love how it turned out and how much safe it feels trying to navigate your property at night. Thank you so much again for your business and we will always be here for whatever you need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "111718901124118627879", "name": "Kliph Love", "time": 1596808315102, "rating": 5.0, "text": "Good people, good work. Yard looks like a resort! Very satisfied.", "pics": null, "resp": {"time": 1596812385643, "text": "Thank you so much for your review and again for your business! And YES, it turned out amazing and exactly like a resort! We are so happy that y'all are happy and will continue to be available for whatever you may need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "113240298176418978320", "name": "Susan Siniard", "time": 1559657378636, "rating": 5.0, "text": "Pro-Cut installed our landscape lighting a couple of years ago and we love them!  Cliff was very easy to work with, had great ideas as to placement and did the installation in a very timely and manner.  We even had him come back and add more lights to our backyard after we saw what a great job he did with the front.  Highly recommend this company!", "pics": null, "resp": {"time": 1559670878886, "text": "Thank you so much for your kind words and business over the years! We really value you as a customer and are so happy that you are happy! We will continue to be here for whatever you may need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "100881904110839990117", "name": "Ryan Brown", "time": 1558534726661, "rating": 5.0, "text": "We had landscape lighting installed a couple of years ago by Cliff and his team at Pro-Cut and we couldn't be happier with the result. They came out and discussed with us what we were looking to do, made professional suggestions based on their extensive experiences on how the lighting would look, and offered a fair price. The kicker is that once installed, they are always available to answer questions, come check on things, and solve any issues that may arise. I recommend Cliff and this service to anyone who needs landscape lighting hands down. The best in Huntsville.", "pics": null, "resp": {"time": 1558570712556, "text": "Thank you so much again for everything! It has been our pleasure every step of the way and we are always here to help with whatever you may need!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "114878426078165626600", "name": "Robert Smith", "time": 1561053336152, "rating": 5.0, "text": "Landscape Lighting was asked to install a complex array of walkway and accent lighting on a large property with various challenging situations.  The results were excellent.  Cliff and his team took the necessary time to make sure things were perfectly placed and esthetically pleasing.  Overall, it was very well done.", "pics": null, "resp": {"time": 1561080467379, "text": "Thank you so much, Mr. Smith, for your review and your business over the past couple of years! All of your lights turned out beautifully! Whenever I am driving in your area at night, I love being able to look out across the lake and see your house and all the lights! We will continue to be here for whatever you need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "106159500989647900197", "name": "Roger Breece", "time": 1592339622965, "rating": 5.0, "text": "Highly recommend, give them a call if you want your house to POP with landscape lighting!", "pics": null, "resp": {"time": 1592419627248, "text": "Thank you for your review and your business! We will continue to be here for whatever you need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "110923247677901751179", "name": "Aron Williams", "time": 1570206695794, "rating": 5.0, "text": "I am very pleased with the Landscape Lighting installed by PRO-CUT. The job was done very professionally, and they use quality lighting and products. The front of my house at Dusk absolutely \"pops\"...the Lighting is simple and beautiful. It really changed the appearance of my house at night.", "pics": null, "resp": {"time": 1570718216307, "text": "Thank you so much Mr. Williams! We appreciate you, your business and your compliments! Your lights turned out beautifully, especially the Koi pond! It makes our work easy when lighting such an awesome feature. We are always available if you ever have any questions and we will talk to you soon about your next project. Thank you again!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "103468658566792448346", "name": "Jeff Tannehill", "time": 1567039507575, "rating": 5.0, "text": "The work was performed just as quoted, and quickly.  The end product is a very attractive lighting on our home.  I highly recommend Pro-Cut for landscape lighting.", "pics": null, "resp": {"time": 1581470486439, "text": "THANK YOU!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "110500953609970754461", "name": "uAlexander Williams", "time": 1567039518670, "rating": 5.0, "text": "We are extremely pleased with the look of our home with your stellar exterior lighting system. We chose a dark gray brick for our custom home which was beautiful during daylight hours but lost its charm at night.  Cliff McGuiness offered us the perfect lighting solution to bring our brick to life during the twilight hours.  The quality and placement of the lights are beyond measure.  We are glad we saw your advertising commercial and gave you guys a call.  You have truly helped to add tremendous value to our home.  We would highly recommend your services to anyone looking to create beautiful nighttime exterior lighting  curb appeal.\nWe thank you!!!\nCarl and Jodi Williams\nLake Forest --- Huntsville, Alabama", "pics": null, "resp": {"time": 1581470412745, "text": "THANK YOU!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "117176917136471059164", "name": "August Roesener", "time": 1559761048356, "rating": 5.0, "text": "PRO-CUT installed the home and sidewalk lighting at my house in March 2019.  They were courteous and professional, and the lights look great!  They ensured we were fully satisfied before considering the job \"complete.\"  I highly recommend them!", "pics": null, "resp": {"time": 1559782887291, "text": "Thank you so much for your review and again for your business! Your lights turned out great! We will always stand behind what we do and will always be here for whatever you need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "102863497448033680660", "name": "Alan McCrory", "time": 1567039509755, "rating": 5.0, "text": "We were extremely pleased with our landscape lighting.  Cliff was very professional, and his work was completed efficiently and as promised.  We would be happy to engage his services again in the future, and we would recommend him without reservation.", "pics": null, "resp": {"time": 1581470470611, "text": "THANK YOU!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "102547799118138622663", "name": "Kathy Nerger", "time": 1559652481566, "rating": 5.0, "text": "The best part of working with PRO-CUT is the service. They are very responsive, neat, and follow up to make sure you are happy. They offer great advice in highlighting the best features of your landscapes. Highly recommend!", "pics": null, "resp": {"time": 1559670422729, "text": "Thank you so much for your kind words and business over the years! It is always so nice to see you. We are always here for whatever you need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "109820827433175141429", "name": "Linda Crumbley", "time": 1567039509725, "rating": 5.0, "text": "This is actually Linda's husband, Russell. These guys went way beyond what they had to do to take care of me and my wife. Great work at the house. I was a little more difficult at my place of business and the building was a little more demanding. I could not have wanted anyone to be more gracious and determined to have a happy & satisfied customer. And, we are happy and satisfied customers. Thank you guys ... for exceptional service. You earned every one of these 5 stars and I will refer you to each and every friend and family member I have.", "pics": null, "resp": {"time": 1581470478835, "text": "THANK YOU!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "104283519640736455111", "name": "Tyler England", "time": 1581715748519, "rating": 5.0, "text": "Excellent service and speed. Quality work, and easy to work with. A great experience!", "pics": null, "resp": {"time": 1581732515361, "text": "Thank you, Mr. England! We greatly appreciate you and your business!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "116752407431504026628", "name": "Chris B", "time": 1581455453370, "rating": 5.0, "text": "I highly recommend Landscape Lighting by PRO-CUT. They did an outstanding job with the design and installation of my landscape lighting. Cliff and his team were extremely professional from beginning to completion and kept me informed throughout the entire process. I contacted Landscape Lighting by PRO-CUT on a Friday and to my surprise I received a response later that day stating I would be contacted early the following week to set up a consultation to review my needs. The following week I was promptly called as promised and an appointment was set up for the following day. Cliff showed up when he said he would ON TIME and looked over my landscape, he gave me several options to choose from and did not try to upsell me on anything I didn’t want or need or the most expensive option. He listened to exactly what I wanted and made very professional recommendations for the look that I was chasing. Once the options were presented, I identified what I wanted, and he got me on the schedule. He informed me that he had a few jobs before me and that it would be a few weeks weather dependent on when they would get me installed. Cliffs professionalism and consideration to my schedule at this point already far exceeded my expectation. On the week of my installation, I was contacted a few days prior to inform me that he would have a crew out on my lawn to start my install and this required nothing from me but more of a courtesy. WOW! Customer service and courtesy again on point. His guys showed up as stated he got the job done over the course of a few days which was quick considering the inclement weather going on that week. The design was as stated, he used quality fixtures that complimented the stonework on my home and added a sophisticated ambiance to my landscape. Once the install was complete, they went above and beyond to ensure that my yard was left just as they found it if not better. Once the installation was complete Cliff returned in the nighttime hours to verify that everything was working properly and to further finetune the placement of the lights, not necessary but just another testament to the professionalism of this company and the degree of work that they perform. At this time, he also gave me the opportunity to go over the operation of the lighting and because I was not present, he explained it to me over the phone. I am beyond satisfied with the finished product and I can tell that my neighbors are as well. The prices were in my opinion incredibly reasonable for what they provide, and the quality of work is second to none. If you too want to give your yard that WOW factor, I highly recommend the services of Cliff and his team at Landscape Lighting by PRO-CUT. They provide great pricing and great results. DO NOT SECOND guess this, Landscape Lighting by PRO-CUT can too make you the envy of the neighborhood.", "pics": null, "resp": {"time": 1581470313982, "text": "You are awesome! Thank you so much for your kind words and for taking the time to leave a review! We appreciate you and your business and will always be here for whatever you need! Thanks again!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "112890452738421392986", "name": "Gary Jerauld", "time": 1583379872969, "rating": 5.0, "text": "Easy to work with, very responsive. Great job, professional and competent workers. Highly recommend.", "pics": null, "resp": {"time": 1583420119360, "text": "Thank you so much for your compliments and your review! We will always be available for whatever you may need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "108714063895794225907", "name": "Glenn Starnes", "time": 1616182273291, "rating": 5.0, "text": "Awesome design and install!", "pics": null, "resp": {"time": 1616184975312, "text": "YOU are Awesome! Thank you so much for your review and again for your business! We will continue to be available for whatever you need!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "108815954973968572525", "name": "Lynne Hoxha", "time": 1567039509768, "rating": 5.0, "text": "Excellent service. Lights around my pond look fabulous. Cliff is easy to work with. Would definitely use him again for my outside lighting needs.", "pics": null, "resp": {"time": 1581470462526, "text": "THANK YOU!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "106371606971622748956", "name": "Amy Tanner", "time": 1567039515185, "rating": 5.0, "text": "Cliff and his company did a great job with the installation of our landscape lights.  They were very professional, friendly and easy to work with.  We are enjoying the lights Immensely.  Very good job.  I'd recommend them for any Lighting or Landscape needs.", "pics": null, "resp": {"time": 1581470445972, "text": "THANK YOU!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "103518607743889972753", "name": "Anne Bell", "time": 1559082476859, "rating": 5.0, "text": "I recently had lights installed by ProCut. Cliff was a total  professional through the entire process. He has a great eye for design and ensures that you are completely satisfied with every aspect of his work. The end product is elegant and the process was truly enjoyable !", "pics": null, "resp": {"time": 1559138585470, "text": "Thank you for your review and again for your business! We are so happy that you are happy! We are always here for whatever you may need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "105592991171998906390", "name": "Janis Williams", "time": 1561585659744, "rating": 5.0, "text": "We called Pro-Cut based on an ad on TV and our desire to have nightscape lightinf.  We found Cliff and his company to be professional, creative, and attentive.  Cliff talked with us as long as we had questions.  When we were ready, Cliff and team did the work to illuminate the exterior of our home.  We have found Cliff responsive in recent days when a landscaper caused one of the lights to go out.  Our neighbors and friends have admired the aesthetic upgrade of nighttime lighting, and we enjoy the confidence of seeing what's outside.  We recommend Cliff and Pro-Cut!", "pics": null, "resp": {"time": 1561602464530, "text": "Thank you, Mrs. Williams, for your review and for your business! I am so happy that we were able to come together and give you a lighting design that you, your family and your friends have enjoyed so much! We will continue to be here for whatever you need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "109132734431717141769", "name": "Scooter Rambo", "time": 1567039518536, "rating": 5.0, "text": "Cliff McGinnis at Landscape Lighting by Pro-Cut is very professional. He showed up on time for all appointments and gave us accurate and reasonable estimates for all work to be performed. The work was done on time and looks awesome. The lighting they installed tastefully compliments our home and landscaping. Cliff and his whole staff were very pleasant to work with and I would highly recommend him and his company.", "pics": null, "resp": {"time": 1581470426714, "text": "THANK YOU!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "108343155198456587885", "name": "Ted Williams", "time": 1573861333892, "rating": 5.0, "text": "Beautiful job done on time and at their quoted value.  Thanks so much!", "pics": null, "resp": {"time": 1573869075750, "text": "We are so happy that you are happy! Thank you for your review and again for your business."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "116311624459009490926", "name": "Stephen Youngblood", "time": 1567039502339, "rating": 5.0, "text": "Cliff and his team are the best.  Even with their busy schedule they fit me in.  He doesn't try to oversell you, and the lights look amazing.  Not to mention he was more than a thousand dollars less than other qoutes.  I would not recommend anyone else.", "pics": null, "resp": {"time": 1581470493296, "text": "THANK YOU!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "115860375306941182203", "name": "Ryan Foy", "time": 1560532358158, "rating": 5.0, "text": "Cliff and his team were easy to work with. They did an excellent job on my front landscape lighting and I do plan to use them in the future!", "pics": null, "resp": {"time": 1560534941366, "text": "Thank you so much, Mr. Foy, for your review, your business and for referring your friends to us! We are so happy that you and your family are enjoying your lights! We will always be here for whatever you need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "102320101804960964038", "name": "Robert Tanner", "time": 1559597188733, "rating": 5.0, "text": "Cliff and his guys did a great job at my house and my Mother-n-law’s home.  I would definitely recommend them for your lighting needs.", "pics": null, "resp": {"time": 1559607032346, "text": "Thank you so much, Mr. Tanner! It has been a pleasure working with you and your family over the years! Thank you so much for recommending us to your family, friends and neighbors! We are always here for whatever you may need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "111503905568328073417", "name": "Valerie Sease", "time": 1559591999679, "rating": 5.0, "text": "Cliff has consistently provided outstanding and prompt service for the past two years. Our landscaping lights look great!!!!", "pics": null, "resp": {"time": 1559593066745, "text": "Thank you so much! We are so happy that you are happy! It has been a pleasure dealing with you and your husband every step of the way. All of your lighting systems turned our beautifully! We will always be here for whatever you may need."}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "106168037349408163757", "name": "Virginia Barnes", "time": 1559670196088, "rating": 5.0, "text": "We couldn't be happier with our landscape lighting by Pro-Cut.  Cliff worked with us to understand all our options and to design the right approach for our yard.  He knocked it out of the park!", "pics": null, "resp": {"time": 1559672244285, "text": "Thank you so much for your kind words and your business! We were so happy to be able to bring your old system back to life as well as the addition of some new fixtures. It turned out beautiful front and back!"}, "gmap_id": "0x886213852ac2701d:0x3aff976eaa2974ad"}
{"user_id": "112321116800020524958", "name": "Alexandra Murray", "time": 1619443435853, "rating": 5.0, "text": "David S**** the owner inspected a drainage easement on our property and was able to advise us as homeowners the steps to correct drainage and erosion control issues. He provided several ideas and advised us to contact the county and builder to have these issued corrected. He has all the technology to take aerial footage and soil samples to obtain accurate information and is incredibly knowledgeable! He went above and beyond for us and I know he truly had our families best interest. I would recommend DSLD to anyone without a doubt.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "106801910992134550072", "name": "Laura Witcher", "time": 1597937382685, "rating": 5.0, "text": "I called several companies about an immediate project and possible other projects. When David Sharp showed up at our door we had a pleasant surprise. Not only is he a great person, but he was my husband’s youth director years ago and they got to have a little reunion. DSLD filled in and tiled a front porch that was formerly a long planter box. We had previously spoken to many others about the project and never was happy with the response, the quotes, or how the others listened to what we wanted. We are so pleased with DSLD’s work, how quickly they completed the project, how well they communicated with us, and the quoted amount for the work that they have us as customers from now on! Plus all the staff are very friendly and helpful!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPiOrz67YeLntYUbtci-smb2K2iw7MyOJvzpr0K=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPgms5sKlWZTGAZ-G5BOb5dlpOc0KWNa5A_XflF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNBaaiYMsfZ3rS0WwsVTBgFbl0G3ParxvFZ2Gm7=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOF4jWsYmHAno_fxzhKOpi7aNbTkAVf0l36F_gn=w150-h150-k-no-p"]}], "resp": {"time": 1598882241879, "text": "It was so good to meet you Laura and catch up with James!  Thank you for your kind words and we look forward to working with you in the future."}, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "113033204294121397297", "name": "Chase Carter", "time": 1619392035988, "rating": 5.0, "text": "This review is kind of overdue,  but getting the pool ready for this season reminded me I’ve yet to write one.  DSLD installed a Desjoyaux pool at our house last spring.  From design work (Stephen) to the crew that installed our pool (PM Austin) we were very pleased and our backyard was completely transformed.  Their vision for our backyard and the product they delivered completely surpassed (in a good way) the one we thought possible.  Our project consisted of not just the pool install, but rerouting/hiding a drainage ditch that went through the middle of our yard, regrading the entire backyard, sprinkler install and pouring a parking pad.  DSLD was capable of handling the entire project without having to contract out things here or there so it was nice only having to deal with one company from start to finish.\n\nAnd probably most importantly David and his team are good people.  5 stars and highly recommended.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "117581098683132876007", "name": "Robert Anaforian", "time": 1601215160112, "rating": 5.0, "text": "DSLD has earned our highest recommendation. Throughout our project David and the entire team demonstrated integrity, creativity, top notch customer service, professionalism, and premier craftsmanship.\nYou will not be disappointed!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPsf7_9PmJ5GyVgi24A7060n_vXDTuSmB0q4NM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMUcZvjMYUDoo551scqgaXW9YN9p1u-jE1n0Nc=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "105156255194838739170", "name": "Rob Sharp", "time": 1618932465987, "rating": 5.0, "text": "DSLD traveled to mine and David’s mom’s house. The backyard was approx 110 ft and open to all, no privacy. I watched the crew scalp the old lawn and graded down to a more level surface. Then they planted about 20 trees which served as a privacy fence. Mixed in a variety of bushes and plants. I could only imagine how it would look when all planting matured. They laid new sod and it looked like a picture from Home and Garden magazine.\n\nThrough the years I have visited my brother and his family and he’d take me on job sites with him. I was amazed to see the complexity of installs he was undertaking. The attention to detail David gives to each install is second to none. I could write a few pages just on that subject. (But I won’t) His new store AquaScapes was an overnight success. I tribute this to David’s insight of products as well as knowledge of the industry. Offering fountains, fish ponds, fish of course and swimming pools from the store, has only broadened the DSLD complete landscape portfolio.\n\nI have to tip my hat to my brother and his team of professionals. His sons Zachary, Miles and Cole play a major part in this well oiled machine as they each have a part in most every install. They are dependable, punctual and treat each job as if it were being installed on their property.\n\nRather you have DSLD perform their expertise on your yard or not, you have to admire how far they have come.\n\nWishing you all continued success!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "115887581742208407752", "name": "Daisy Hawkins (Hope Series)", "time": 1619634636150, "rating": 5.0, "text": "The most professional one stop shop for all that I needed.  This team landscaped the front and back, built a screened in patio.  Created and installed all new flagstone walkway and side patio and surrounding my new beautiful water fountain from their Aquascapes location at Hanna's Garden on 280.  Then painted my entire exterior on my house and addition.  Very professional, hard-working, and eager to accommodate any requests I had.  Highly recommend this group for your outdoor hardscape and landscape.  I loved not having to be the contractor on all these things.  They handled all for me.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "105412446339422660363", "name": "Laerke Costov", "time": 1627438401718, "rating": 1.0, "text": "Run as fast as you can in the opposite direction! Avoid at all costs!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "117060964320707968870", "name": "R Daniel Chang", "time": 1621267414548, "rating": 5.0, "text": "David came by for our consultation on time. He was very attentive to our questions and concerns. We're still in the process of making final decisions on contractors and builders but dsld is certainly at the top of the list.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "113482551053842444997", "name": "Steve Skelton", "time": 1616113682517, "rating": 5.0, "text": "I could not be more pleased with this company! They are professionals in every sense of the word.\nThey have done multiple projects for myself and my wife. They are what I would call...outdoor wizards!\nThey have installed amazing landscape lighting for us, completely redesigned our shrub and flower beds, and installed the most awesome landscape masonry borders I’ve ever seen. I have a large fountain in one of the shrub beds in the front of my house. Mind you, this thing weighs like a bazillion lbs. I was recently trying to clean it out and get it ready for Spring and Summer. I accidentally let the bowl tip off the pedestal. Well, I tried to lift it up and get it back on the pedestal. I suppose I’m not as young as I used to be, because I couldn’t budge it. I really didn’t know what to do, so I called DSLD and asked if they could come by and get this monster back on the pedestal. It wasn’t more than a day later, when I got in from work when I noticed that my fountain was sitting upright, filled with water, just waiting to be plugged in. When I called Zach Sharp, ( a great young man by the way) to ask what I owed them, he absolutely refused to take a cent, saying it only took a few minutes and I could not get them to take anything for their time and trouble. In today’s world, qualities like that are rare. If you ever need any type of landscape architecture, a pool, anything “outdoorsy”,\nThese are the guys. They are 5 stars in every category and I could not give them a higher recommendation.\nDon’t waste your money on shoddy work! Call DSLD . They are definitely the best!\n\nSteve Skelton\nDunnavant Place at Highland Lakes", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "113809371975189393006", "name": "Jason Hall", "time": 1603288247089, "rating": 5.0, "text": "DSLD does excellent work. It’s almost hard to believe it’s the same yard from before to after. The yards they have worked on and completed are the type of yards you would see on TV or magazines the quality is so good.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "116480513897387240618", "name": "Heather Brown", "time": 1604092705117, "rating": 5.0, "text": "DSLD rescued our backyard garden! In March, we used another landscaping service to prepare landscaping beds and plant hydrangeas, roses, azaleas, camellias, gardenias, etc. The beds were not properly prepared, and the plants became diseased, stressed, and began to die very quickly. We also had a serious drainage problem.\n\nDSLD determined why our new plants were failing, recommended solutions, and implemented their plan; amending the soil and replanting the plants we already had. They also solved our drainage problem. Now, we have a gorgeous backyard!!!\n\nWe highly recommend DSLD!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "105850376186232250078", "name": "Lauren Clemons", "time": 1599147058436, "rating": 5.0, "text": "Great communication and presentation of information on their entire pool building and landscape design process!  I appreciate the quick responsiveness and the professionalism so far.  Excited to get started on our back yard transformation project!!", "pics": null, "resp": {"time": 1599685499771, "text": "Thank you for your kind reply. Look forward to working with you on the design."}, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "102795393070692604561", "name": "Hughes Home", "time": 1606076537427, "rating": 5.0, "text": "DSLD repaired our pool and got it running before spring was over. They did an outstanding job and were generous with their time and efforts. They have also provided valuable ILP lessons for the youth on our camous that will help them get started once they graduate HS.", "pics": null, "resp": {"time": 1606169363914, "text": "Thank you very much for your kind remarks. Our owner David Sharp enjoys teaching the independent living classes at kings home, and we were all happy to rebuild your swimming pool and wish you many years of swimming recreation and enjoyment."}, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "105513441949920977034", "name": "Drew Ellis", "time": 1591413965210, "rating": 5.0, "text": "Genuinely good people and very good at what they do. Arturo and his crew were very professional and made sure everything was done right. Stephen was easy to communicate with and a pleasure to work with. You get what you pay for with this crew.  We love our new backyard and patio.", "pics": null, "resp": {"time": 1591731612400, "text": "Thank you for the kind words Mr. Ellis. From design to implementation, It was a pleasure working with you and your family to bring your backyard living space to life!"}, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "109885379475406676216", "name": "Joe Limbaugh", "time": 1617741295033, "rating": 5.0, "text": "Even though we did not select them as part of our bid process, they were very professional to deal with.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "101214040991855745332", "name": "Lester Ruttka", "time": 1599606798046, "rating": 5.0, "text": "DSLD does exceptional work, is efficient, fast, and reliable. Whether it is general landscaping or custom design they can't be beat.", "pics": null, "resp": {"time": 1599685608487, "text": "Thanks for the kind words Mr. Ruttka. It was a pleasure working for you!"}, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "117356515438974984803", "name": "Annilaurie", "time": 1598713009635, "rating": 5.0, "text": "DSLD did a great job on are yard.  We love our beautiful new beautiful back yard and lighting.", "pics": null, "resp": {"time": 1598882379426, "text": "Thank you for your kind words. It was a pleasure working with you to transform your backyard!"}, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "113495610356696334467", "name": "William Gilley", "time": 1556572920185, "rating": 5.0, "text": "DSLD sets the standard for professionalism and integrity in creating amazing outdoor spaces. Their team works with you to create designs using the best quality products available. Their crews are efficient and well organized. They are honest and dependable and the quality of their finished work is second to none. I highly recommend using them for your next outdoor project.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "112716414007080434744", "name": "David & Ann Swanson", "time": 1594319839169, "rating": 5.0, "text": "Very knowledgeable and professional. Great job.  Pool and landscape look fantastic. Would highly recommend", "pics": null, "resp": {"time": 1590502708546, "text": "Thanks for the kind words Mr. and Mrs. Swanson."}, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "103550641931716815370", "name": "Alene Morgan", "time": 1584233475919, "rating": 4.0, "text": "If you are looking for a landscaping company that will give you good professional advice in addition to responding to your specific request, DSLD would be a good bet.  Perhaps the best quality is the attitude of those involved in which you sense they really care to do a good job for you.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "115624569660376036855", "name": "James Graham", "time": 1598991102384, "rating": 5.0, "text": "I really enjoyed the planning process that DSLD took us through.", "pics": null, "resp": {"time": 1599660870599, "text": "Thank you! It was a pleasure working with you and your family!"}, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "100666153079763170689", "name": "Jason Carpenter", "time": 1535508718720, "rating": 5.0, "text": "I have used DSLD numerous times and I am always 110% satisfied with the attention to detail and the final product of their work.  The DSLD team is always courteous, professional and respectful.  If your like me and don't have a vision for your lawn, call DSLD and let them handle it - you will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "117889529628916507797", "name": "Script Inspired", "time": 1574701167606, "rating": 5.0, "text": "Very knowledgeable staff. Great care and attention to detail was taken when installing sod in my yard. Fantastic finished product!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "108489985414334381857", "name": "bill rodgers", "time": 1546467798023, "rating": 5.0, "text": "Did what they said they would. Mason is a true artist. Offered great design and additions as we went. Jason was a wonderful asset to have on my job. Will mark them as KEEPERS.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "100352823394783090579", "name": "qb1_7 Wanderful1", "time": 1611170303043, "rating": 3.0, "text": "A little arrogant if you ask me", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "100507286865342211235", "name": "Bryan Chace", "time": 1576724362702, "rating": 5.0, "text": "Knowledgeable, professional, and excellent workmanship. Attentive service and estimates. They do what they say, and do it very well.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "106802802850175093281", "name": "Jamie Berry", "time": 1556932323261, "rating": 5.0, "text": "Great company to work with. Very knowledgeable and efficient. All around great group, I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "108060663797590743204", "name": "mary pickett", "time": 1546732043908, "rating": 5.0, "text": "We had just moved into our new custom home but had questions about some of the builder's construction decisions.  We wanted a neutral opinion.  We called DSLD and they promptly came to access our questions and did a complete review of the home.  Afterwards, we were provided a concise review of construction and systems.  They explained why the builder did certain things and advised on how to get things investigated/repaired.  I recommend DSLD.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "116239773308142999133", "name": "tim roberts", "time": 1527724178617, "rating": 5.0, "text": "I have performed a lot of work around these guys and they are the best in the business. I am an electrician and many time other trades only care about thier part  job. Their masons work with all the trades to make sure the customer gets the best project possible. I have never seen anything but  jobs of the highest quality around these guys and look forward to working around them again down the road.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "113439479955876951729", "name": "Lou Eppolito", "time": 1540774441933, "rating": 5.0, "text": "Design work was functional and attractive. Implementation was first rate. DSLD stands behind its work. Overall, a great experience!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "101816095609575616469", "name": "Ron Boisclair", "time": 1564760743123, "rating": 5.0, "text": "Exceptional client service, workmanship and a great team. Working with DSLD owner David Sharp was a pleasure. He responded to my inquiry within a day and met with me within a week to discuss options for landscape and drainage work on my Highland Lakes home--the $100 up-front consult fee was a worthwhile investment, and was applied to to the cost of my project. Work included expanding, grading, and sodding (Zoiysa) the backyard, which included construction of a 70 foot concave curved/step-graduated wall, installing a new drainage system along and under the driveway, and adding an external sump pump well and pump to move water from a tied-in roof downspout and overhead deck drain. DSLD completed the project in approx. 2 weeks.  Good communications throughout, with detail breakdown of proposal costs.  Definately recommend.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "114008116624620607805", "name": "Stan Ingram", "time": 1577116217024, "rating": 5.0, "text": "Pleasure to work with.  They did everything they promised in good time.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "116807137217355113357", "name": "Jim Mason", "time": 1554746540301, "rating": 5.0, "text": "Very professional staff. They assisted me in any way possible and were sure to follow up on my inquiry to see if I needed any additional help.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "112455983675959806081", "name": "Brian Parrish", "time": 1570670353104, "rating": 5.0, "text": "Professional, respectful, hard-working team that delivers top notch service! You will be happy with the results and so will your neighbors!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "108025899390725273835", "name": "Justin Abercrombie", "time": 1518549609820, "rating": 5.0, "text": "DSLD takes pride in the quality of work for each and every job. The company as a whole is very friendly, and makes the experience welcoming as well as rewarding.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "103161347841108485095", "name": "Tim Kirksey", "time": 1557860271456, "rating": 5.0, "text": "Staff is very courteous and professional. A fun place to shop!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "107704469215962647631", "name": "David Sharp", "time": 1523724033093, "rating": 5.0, "text": "As an owner/operator I enjoy meeting new and old clients and working with some of the finest people I know.  Our employees stay put!  We have folks here going on three decades and and counting.\nDon't take my word for it, call us today and put our professional team on your next project!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "106549235233377848473", "name": "Russell Baker", "time": 1577717639598, "rating": 4.0, "text": "Knowledgeable crew always showed up as scheduled and happy to coordinate their work with other Contractors. Pricing is not the cheapest but you get what you pay for", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "101364454963043619171", "name": "Nelson TAYLOR", "time": 1583890505616, "rating": 1.0, "text": "Terrible follow up!!! I contacted DSLD for a replacement pool liner after visiting Aquascapes store. They would not provide photos of their work, references etc. Very obvious they are unqualified for such projects!", "pics": null, "resp": {"time": 1591303088105, "text": "Mr. Taylor, we apologize for our untimely follow up on your request.  You caught us at a very busy time and we have since hired the requisite personnel to ensure this does not happen again. At your inconvenience, please stop by AquaScapes anytime for a $25 credit on anything in our store."}, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "110433171724283695337", "name": "Ed Bartlett", "time": 1538787660424, "rating": 4.0, "text": "Extremely professional.  Cutting edge designs.  Top quality construction.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "104646490926883103594", "name": "Lester Colindres", "time": 1518567188975, "rating": 5.0, "text": "It's been great working for DSLD\nfamily oriented company.\nLots of opportunities to learn new skills.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "109666238525128245108", "name": "Brady Pugh", "time": 1518556541202, "rating": 5.0, "text": "DSLD is a dependable family owned and operated business that has unmatched customer satisfaction. Attention to detail, knowledge, and integrity are some of the values that this quality landscape company prides themselves in.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "103246960820633226748", "name": "Griffin Hansen", "time": 1561242396982, "rating": 5.0, "text": "Great landscaping company, and their chicken yard on Dunnavant is a lot of fun to see every day.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "110203558856388388546", "name": "Leo Hernandez", "time": 1518634092254, "rating": 5.0, "text": "Dsld gave me a great introduction to customer service and taught me about the workings of a successful small business. the company is family owned and operated, and it feels like you are with family when you are at work. Love Dsld and would recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "116365118937523404051", "name": "markus frederick", "time": 1518542715841, "rating": 5.0, "text": "Love working here! I get time off for my school and i like how it's family operated!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "111769733770875919062", "name": "James Martindale", "time": 1518551658784, "rating": 5.0, "text": "Great family owned business, very professional work!! Quality at its finest!!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "110381893035475669378", "name": "Kelly Matthews", "time": 1548116454768, "rating": 5.0, "text": "Great Administration and an Excellence Driven Team", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "109597840293051631711", "name": "Michael Crump", "time": 1536107231583, "rating": 5.0, "text": "We love how the project turned out and highly recommend DSLD.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "104746524828206144737", "name": "Greg James", "time": 1538335668884, "rating": 5.0, "text": "Great guys.  They do fantastic work!!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "114052142898458635700", "name": "Frank McClure", "time": 1552256604046, "rating": 5.0, "text": "Very professional, fixed my drainage issues, and repaired landscaping to desired condition.  Would use again.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "104408424798035797493", "name": "KEITH JEWELL Straight-Line PARKING LOT MAINTENANCE", "time": 1475423579683, "rating": 5.0, "text": "Great service good people to do business with", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "104936519051582804225", "name": "Cooper White", "time": 1560449043189, "rating": 5.0, "text": "Very professional and got the job done quickly!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "114703962043272744489", "name": "R Heffner", "time": 1570752724074, "rating": 4.0, "text": "Phillips", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "108296892814372360666", "name": "Colby Knox", "time": 1617908550233, "rating": 1.0, "text": "Don't bother calling. They won't answer.", "pics": null, "resp": null, "gmap_id": "0x88891ee18c30a291:0xaf61122d8e0f14b2"}
{"user_id": "108458250213235576961", "name": "Juan Hernandez", "time": 1600017670819, "rating": 5.0, "text": "Good place,you can found everything.", "pics": null, "resp": null, "gmap_id": "0x88891ee18c30a291:0xaf61122d8e0f14b2"}
{"user_id": "113143203623649209432", "name": "Scott S", "time": 1584046580549, "rating": 5.0, "text": "Guys know their stuff. Excellent", "pics": null, "resp": null, "gmap_id": "0x88891ee18c30a291:0xaf61122d8e0f14b2"}
{"user_id": "111148693260340572573", "name": "Dean Krulac", "time": 1528289553379, "rating": 1.0, "text": "I have called this company for 2 days now and have left a message.  They do not answer their phone.  Normally when customers call your number it is a good idea to pick up the damn phone.  I will get my stuff else where thanks.", "pics": null, "resp": null, "gmap_id": "0x88891ee18c30a291:0xaf61122d8e0f14b2"}
{"user_id": "102690159189133605491", "name": "McCormicks Hidden Homestead", "time": 1564061595940, "rating": 5.0, "text": "Very helpful and pleasant people. Very knowledgeable about the products they sell.", "pics": null, "resp": null, "gmap_id": "0x88891ee18c30a291:0xaf61122d8e0f14b2"}
{"user_id": "105839403101443204895", "name": "Montrell Miller", "time": 1561738194705, "rating": 4.0, "text": "Great prices !", "pics": null, "resp": null, "gmap_id": "0x88891ee18c30a291:0xaf61122d8e0f14b2"}
{"user_id": "113505744917783803280", "name": "Mary Kimbrough", "time": 1553225634185, "rating": 4.0, "text": "Good service", "pics": null, "resp": null, "gmap_id": "0x88891ee18c30a291:0xaf61122d8e0f14b2"}
{"user_id": "104860846401461641263", "name": "Popi Bear (PopiShop)", "time": 1565060100515, "rating": 5.0, "text": "It was straight, friendly, and to the point", "pics": null, "resp": null, "gmap_id": "0x88891ee18c30a291:0xaf61122d8e0f14b2"}
{"user_id": "111022823856562138716", "name": "Keith Krininger", "time": 1500837713933, "rating": 5.0, "text": "We would like to acknowledge what a wonderful experience we had working with Alabama Landscape Creations.  Their management is knowledgeable, friendly, and prompt.  We had a large project with a large seawall, double waterfall, and 2 flagstone decks, not to mention the beautiful  landscaping job they did.  We get compliments every time someone visits, even from boaters passing by.    Most importantly, they stand behind their work and if you have a problem, they will fix it.  We highly recommend them!!  Keith and Kay K.", "pics": null, "resp": null, "gmap_id": "0x888ecde8558086ab:0x4b420a673611a607"}
{"user_id": "116138046102982294502", "name": "David Wilson", "time": 1423276199903, "rating": 5.0, "text": "ALC came up with a plan that solved a very challenging erosion problem on my steeply sloped lot that fit my budget, looks fantastic and was completed ahead of schedule.  Jake and everyone I met was very professional and I recommend them highly.", "pics": null, "resp": null, "gmap_id": "0x888ecde8558086ab:0x4b420a673611a607"}
{"user_id": "102031356801333376703", "name": "marion OGETTAS", "time": 1619636381145, "rating": 5.0, "text": "Greer Gardens did a complete revamp of our back yard.  Installing a drainage system..  Then laying sod. Adding shrubs and flowers and flowering shrubs.  FINALLYS mulch and pine straw.  The yard is worthy of a spread on HGTV backyard paradise.  Thank you so much.  PS  even the rain didn't stop them.", "pics": null, "resp": {"time": 1619723652524, "text": "We really appreciated the opportunity to work with you Marion and are so happy to hear you are satisfied! It means a lot to us that you took the time to share your opinion with others about our services. Thank you!"}, "gmap_id": "0x889a4055293ae717:0x7368de89d6feab41"}
{"user_id": "113584230551202012553", "name": "Susie Forkum", "time": 1607989283312, "rating": 5.0, "text": "We lost many large trees to Hurricanes Sally and Zeta in the fall of 2020. After the large stumps were ground and fallen trees removed, our yard was a mess. Greer Gardens planted trees, graded and re-sodded the yard. I'm very pleased with the work they did and my yard looks nice again!  Very professional and knowledgeable employees. Highly recommend Greer Gardens for your landscape needs.", "pics": null, "resp": {"time": 1614374482558, "text": "Thank you for taking the time to write that thoughtful review, Susie! We were more than happy to help you and look forward to working with you again."}, "gmap_id": "0x889a4055293ae717:0x7368de89d6feab41"}
{"user_id": "100519936747793951087", "name": "Sue Windham", "time": 1592487218064, "rating": 5.0, "text": "Thank you for the superior  service your crew provided this week to improve the landscaping of my yard.\n\nYour crew was very professional in their approach to the job and ensured that I was informed every step of the way on what was being done. They put in many hours in the hot sun to ensure the work was completed in a timely and excellent manner. Their work exceeded my expectations and I am very pleased with the results.\n\nYou estimate was precise and our agreement was followed to the letter. When we asked to add to the job your crew responded immediately to ensure our desire was met.\n\nBe assured that the next time I need landscaping services your company will be my only call.", "pics": null, "resp": {"time": 1592492387436, "text": "Thank you, Sue! It is an honor and a pleasure to provide you with landscaping service that makes you feel positive about sharing with your friends and neighbors. Our goal is to give every customer that same level of service. We appreciate your taking the time to review Greer Gardens and look forward to helping you with all of your future landscaping needs!"}, "gmap_id": "0x889a4055293ae717:0x7368de89d6feab41"}
{"user_id": "106817761397011649906", "name": "Steve", "time": 1596207941816, "rating": 5.0, "text": "Our hedges and shrubs where is dire straits after 4 months of growth. As I am new to the area, I contacted Greer Gardens, I liked the Companies values listed on their Website along with the prior reviews.  The crews performance was excellent in all aspects.   A very professional business who performed exactly what I requested for the quoted price, no issues at all. Would highly recommend and I will be using Greer again in the future.", "pics": null, "resp": {"time": 1596478529302, "text": "We really appreciate the kind review, Steve! It's our goal to make every client feel just as satisfied as you are with the landscaping services we provide. We are thankful for the opportunity to serve you and look forward to doing so again!"}, "gmap_id": "0x889a4055293ae717:0x7368de89d6feab41"}
{"user_id": "104313971365860942329", "name": "Maria C. Cardoso", "time": 1623948388704, "rating": 5.0, "text": "The best lawn care out there. They always go above and beyond!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4055293ae717:0x7368de89d6feab41"}
{"user_id": "110177793392471581499", "name": "Travis Long Jr", "time": 1612190641031, "rating": 5.0, "text": "Austin and Hunter helped remove several fallen trees from Hurricane Sally making my property safe and usable again. They had the right equipment for the job. Thank you for the professional help.", "pics": null, "resp": {"time": 1614374563236, "text": "Travis, it was our pleasure to help you! And thank *you* for the opportunity to do so. We were happy to be able to service you. We look forward to helping you again in the future. Thanks for leaving us a review!"}, "gmap_id": "0x889a4055293ae717:0x7368de89d6feab41"}
{"user_id": "101984926805526538732", "name": "Joe East", "time": 1601652409476, "rating": 5.0, "text": "EXCELLENT! - great working with this company - Very professional, knowledgeable, and timely!. Not only working with planning, layout, and proposal, but the crew is impeccable - on time, hard working, friendly, and very professional!. All work was completed on time, and clean up was excellent. HIGHLY recommend doing business with Greer Gardens.", "pics": null, "resp": {"time": 1601902429505, "text": "Thank you so much for your kind review, Joe! We appreciate that you took time out of your day to share your experience with others. It's our pleasure to do business with you and we look forward to helping you again in the future."}, "gmap_id": "0x889a4055293ae717:0x7368de89d6feab41"}
{"user_id": "112200330433335895372", "name": "April Barrow", "time": 1614534446424, "rating": 5.0, "text": "Xeriscape backyard design and installation turned out beautifully!", "pics": null, "resp": {"time": 1619021582858, "text": "Thank you for the positive review, April! We are so glad you are happy with how the xeriscaping project turned out--we really enjoyed the project and appreciate the chance to install it for you. Please don't hesitate to contact us with any of your future landscaping needs!"}, "gmap_id": "0x889a4055293ae717:0x7368de89d6feab41"}
{"user_id": "104513503444278903483", "name": "Trenia DeSimone", "time": 1591023045757, "rating": 4.0, "text": "Austin Greer and his team at Greer Gardens was an answer to our prayers!! Our front yard has fairly large flower beds which were in desperate need of an overhaul and our sprinkler system needed to be extended..... they took care of it all!  Now our flower beds are gorgeous!! We especially appreciate how responsive this company is...they always returned our calls promptly!", "pics": null, "resp": {"time": 1591128019465, "text": "Thank you for your review, Trenia! We appreciate the opportunity to assist you and we're happy to hear that you are so satisfied with our work! We look forward to working with you again."}, "gmap_id": "0x889a4055293ae717:0x7368de89d6feab41"}
{"user_id": "103224676191948998812", "name": "Bob Walsh", "time": 1570543807442, "rating": 5.0, "text": "I recently used Greer gardens to install a sprinkler system in my yard.  I am extremely pleased with the work that was done and rate the professionalism of the installation team a 10/10.  The team members were very courteous and kept me informed throughout the installation.  Austin kept reviewing the  progress several times during the day.  The design for my yard was done with cost efficiency and system performance as ultimate goals.  I couldn't be happier and highly recommend Greer Gardens.", "pics": null, "resp": {"time": 1578069420286, "text": "Thank you for your kind and honest review, Bob! It was our pleasure working with you, and we look forward to our next opportunity to assist you."}, "gmap_id": "0x889a4055293ae717:0x7368de89d6feab41"}
{"user_id": "110049883445803749665", "name": "Leslie Nettles", "time": 1563198967657, "rating": 5.0, "text": "Greer Gardens is an excellent company.  Austin Greer is very accommodating and helpful.  I am proud of my yard!", "pics": null, "resp": {"time": 1578069599692, "text": "We are thankful for the opportunity to help you, Leslie! Thank you for sharing your experience. We enjoyed helping you, and it makes us happy that you're proud of your yard!"}, "gmap_id": "0x889a4055293ae717:0x7368de89d6feab41"}
{"user_id": "115337004566024898489", "name": "Tony Bass", "time": 1564659497485, "rating": 5.0, "text": "Austin is creative, caring, and well-educated in the art of landscaping. I've known him for many years and find him always staying on top of the latest gardening trends.", "pics": null, "resp": {"time": 1578073172684, "text": "Thank you Tony! I appreciate your kind words."}, "gmap_id": "0x889a4055293ae717:0x7368de89d6feab41"}
{"user_id": "110480092180372547461", "name": "Office Administrator", "time": 1497893080999, "rating": 5.0, "text": "Quick turn around and brilliant design .  knows local plants well", "pics": null, "resp": {"time": 1578069762737, "text": "We really appreciate your taking the time to review our service, and are delighted that you had a good experience!"}, "gmap_id": "0x889a4055293ae717:0x7368de89d6feab41"}
{"user_id": "102737122641962149686", "name": "Debbie Brady", "time": 1509642466246, "rating": 5.0, "text": "My landscapeing looks awesome and the week to week lawn care is outstanding.", "pics": null, "resp": {"time": 1578069702566, "text": "Thanks for taking the time to share your experience working with us, Debbie! We appreciate the opportunity to help you, and are glad to hear you are satisfied with our services."}, "gmap_id": "0x889a4055293ae717:0x7368de89d6feab41"}
{"user_id": "114634726509797369707", "name": "Laura Bentley", "time": 1515548736290, "rating": 5.0, "text": "Greer Gardens is by far the best landscaping company i have ever used!", "pics": null, "resp": {"time": 1578069827945, "text": "Thank you so much for the kind words, Laura! We are proud to provide you with excellent service, and look forward to the next opportunity to do so. It means a lot to us that you're willing to share your opinion with your friends and neighbors!"}, "gmap_id": "0x889a4055293ae717:0x7368de89d6feab41"}
{"user_id": "117290443119391507697", "name": "Phillip Greer", "time": 1472839255036, "rating": 5.0, "text": "Amazing work & very professional!", "pics": null, "resp": {"time": 1578069857274, "text": "Thank you so much Phillip it is our pleasure to serve you!"}, "gmap_id": "0x889a4055293ae717:0x7368de89d6feab41"}
{"user_id": "109558446923870051142", "name": "sbjraley", "time": 1620772851636, "rating": 4.0, "text": "They have good reviews so I tried to get them to come out to do some repair work on our sprinkler system but I could never get them to show up. They told me three separate times that they would come out but each time they never showed up. So I guess if you can get them to actually show up it sounds like they'll do a good job, unfortunately I never could.\n\nUpdate: The owner contacted me and and explained that they were swamped with work and was very eager to make things right. So even though things didn't work out this time I would definitely call them again if I needed some landscaping or irrigation work done.", "pics": null, "resp": null, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "110883085503045329065", "name": "West Bay Landscape & Lawn Maintenance", "time": 1605843322687, "rating": 5.0, "text": "Awesome Service!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMZusXnOzX2Glwr4z2trF5cLXU6yU-o-X0PqQQb=w150-h150-k-no-p"]}], "resp": {"time": 1481738703610, "text": "Thanks!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "100107957332353639332", "name": "Kayla Outlaw", "time": 1621548349106, "rating": 5.0, "text": "Great Service! Always on time and professional. Awesome company to do business with! Prices are very reasonable!", "pics": null, "resp": null, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "111289579857277079602", "name": "Tim Miller", "time": 1620827199211, "rating": 5.0, "text": "Terry and his crew were hard workers and very careful that they did the job right and to my satisfaction. West Bay installed an irrigation system in my front yard, prepped the yard for sod, installed borders around flower beds,  and then laid five flats of Zoysia Palisade in my front yard. I love how my front yard looks now. Thank you West Bay Landscaping!!", "pics": null, "resp": {"time": 1620957598509, "text": "Thank you Mr Miller!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "105980869850876305220", "name": "chad rubira", "time": 1620828292910, "rating": 5.0, "text": "Terry and team were great from start to finish with all the services they performed for us.  Everything they did we were very pleased with and would highly recommend to anyone.", "pics": null, "resp": {"time": 1620957614002, "text": "Thank you !"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "103040575068831619087", "name": "Cindy Barnes", "time": 1620936789424, "rating": 5.0, "text": "We have been using West Bay for several years! We had them re-sod our front yard last year! Highly recommend!", "pics": null, "resp": {"time": 1620957657507, "text": "Thank you Mrs Barnes!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "101301790414866698169", "name": "Jerry Cowart", "time": 1620830054283, "rating": 5.0, "text": "Been using Westbay for several years.  Terry and the guys do great work for a reasonable price!", "pics": null, "resp": {"time": 1620957627993, "text": "Thank you Mr Cowart!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "115119229252188212886", "name": "Kyle Urrutia", "time": 1616538067391, "rating": 4.0, "text": "They where slow to respond  for a quote, but seem eager to make things right.", "pics": null, "resp": {"time": 1616537282410, "text": "Hi Kyle! I think we just spoke with you. Thank you!!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "106825364464371070984", "name": "Mayme Vestal", "time": 1488561472589, "rating": 5.0, "text": "I had a bit of an emergency to get my yard cleaned up on a big time crunch. Terry came out to the house, gave me a very reasonable estimate, and was able to squeeze me into their schedule and get the job done on time for me and salvage the total mess that was my yard. I'll absolutely be continuing to use them for regular maintenance now!", "pics": null, "resp": {"time": 1488562861998, "text": "Thank you Mayme!!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "104289261376495978649", "name": "All Weather Roofing and Construction", "time": 1488336371284, "rating": 5.0, "text": "These guys have been doing our lawn and maintenance for four years now.  They produce an excellent product and great customer service. Very convenient.  We have used him for lawn care, sprinkler system, new sod  and shrubs", "pics": null, "resp": {"time": 1488337009203, "text": "Thanks Chris!!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "103193693483774268080", "name": "The Tax Specialist “My Tax Professionals” Rachael Cain-Hilburn", "time": 1605842788551, "rating": 5.0, "text": "I highly recommend West Bay Landscape & Lawn. They always do an awesome job. Beautiful and creative landscaping designs. I'm very pleased with their work and customer service.", "pics": null, "resp": {"time": 1483503671407, "text": "Thank you!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "113852913662755170328", "name": "Danielle Mcpeak", "time": 1483416831637, "rating": 5.0, "text": "I called West Bay and spoke to a Mr Terry , nice guy with amazing workers. It looked like a tornado hit my yard and more. He came out gave me a wounderful price that was better than the others that came out. And a day or so later his guys came out and did wounders; I couldnt believe it was more than i imaged. You and your team are amazing and i will be referring you to all my family and friends again, Thank you!!", "pics": null, "resp": {"time": 1483503681998, "text": "Thank you!!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "117174068418916016745", "name": "Xtreme Turf Lawn Care", "time": 1464991065729, "rating": 5.0, "text": "Terry is one of the most knowledgeable landscapers around. Him and his team provide outstanding service.", "pics": null, "resp": {"time": 1465008253538, "text": "Thanks!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "116183279826596172022", "name": "Cory Walz", "time": 1483739720026, "rating": 5.0, "text": "Excellent business with a very professional attitude, my yard looks clean all the time thanks to West Bay.", "pics": null, "resp": {"time": 1483747686885, "text": "Thanks Cory!!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "112249087028949117720", "name": "K H", "time": 1555551640456, "rating": 1.0, "text": "Called for a bid on wednesday. Said they would come by by Friday. Never showed up. Tried to call back and went straight to voicemail. Unprofessional.", "pics": null, "resp": {"time": 1610344623916, "text": "I’m sorry I think you have the wrong company. Good luck to you."}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "104152812424341423284", "name": "Valentin Diaz", "time": 1501103735261, "rating": 5.0, "text": "The workers are very proffecional and the managers are great. I worked for them before and on friday july 24  2017 or close to that date on a friday i almost had a heat stroke and the manager right away knew what was going on with me and took care of me, gave me the right amount of gatorade and water mix to hydratate me, put me on the ac and keep an eye on me untill i was able to go home by my self. Not only that!!!! He drive me to the yard where i had my car and gave me enough hours on my ticket from labor finders. Great people very profecional and compacionate with the workers and costumers. I love them, you cant beat the system they got.", "pics": null, "resp": {"time": 1518572548422, "text": "Thank you!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "101926194667689072560", "name": "Richard Kuffskie", "time": 1479424462170, "rating": 5.0, "text": "Great service I've ever had thanks to West Bay Landscaping", "pics": null, "resp": {"time": 1479424705052, "text": "Thanks Richard!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "108826582431594221222", "name": "Landon Cooper", "time": 1480111646848, "rating": 5.0, "text": "Amazing, Cut's very clean and straight lines. Works with your schedule.", "pics": null, "resp": {"time": 1481738689058, "text": "Thank you!!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "108362703294568641052", "name": "Myron Grimes", "time": 1464832370745, "rating": 5.0, "text": "Awesome work !! My home has never looked so Great!! Thanks Terry and guys for all the hard work!! You guys Rock!!", "pics": null, "resp": {"time": 1464832939005, "text": "Thanks Myron!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "117534621382331232845", "name": "jerry laster", "time": 1483031139691, "rating": 5.0, "text": "Great Work!!", "pics": null, "resp": {"time": 1483059553321, "text": "Thank you"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "109866313010560371248", "name": "tony laster", "time": 1480111400172, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1481738673944, "text": "Thank you!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "115150081230797332342", "name": "Kyle P", "time": 1479424288967, "rating": 5.0, "text": "Great Service!!!", "pics": null, "resp": {"time": 1479424718609, "text": "Thanks Kyle!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "111345850715261427372", "name": "Brad Goddard", "time": 1622559413522, "rating": 4.0, "text": "A good selection of hardscape materials, loose stone, and plants.  Prices on par with other landscape supplies.  Usually just enough staff to help you out.  I have never had to wait more than 1 customer which I am good with.\nFair warning, 119 is becoming very busy these days and it can be very hard to turn left out of their drive at some times of the day, especially in a tractor trailer.", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "115655813923867593689", "name": "some body", "time": 1617993486748, "rating": 1.0, "text": "Don’t worry about good service here if you are of color. You will get overlooked. Doesn’t matter if you were there first.", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "116613214603802555016", "name": "Billy Newsome", "time": 1613681167096, "rating": 5.0, "text": "I come here on a regular, and every time, the crew there is helpful, and patient with me. Keep Up The Outstanding Work!", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "116745584489116932912", "name": "Terry Shadrix", "time": 1622325212161, "rating": 5.0, "text": "Great staff always friendly and eager to help", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "114111804865109551921", "name": "David and Chris Marshall", "time": 1614716776000, "rating": 5.0, "text": "Helpful and knowledgeable folks with very good inventory of plants, parts, and chemical supplies.", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "113725109047836682670", "name": "Dennis Held", "time": 1620835875139, "rating": 1.0, "text": "First and last visit to SiteOne. Left out back for someone to load and associate never called for anyone! Total time 1hour for 6 bags of mulch! Very unorganized and appeared not well managed!", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "113088676714990731966", "name": "yllib taog", "time": 1617976981040, "rating": 1.0, "text": "Terrible place to deliver. Plan on spending the day here waiting for them to unload.", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "107473796463993186300", "name": "rln Krutsch", "time": 1599502284295, "rating": 5.0, "text": "Employees are very helpful and knowledgeable. Good selections of plants. I love that place its like candy factory but plants.", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "111642804051114224826", "name": "Martin Bachtel", "time": 1615136529246, "rating": 5.0, "text": "Primarily they sell wholesale to landscapers but they also cater to retail customers.  The majority of their business comes from landscapers and contractors. The place is huge, about 10 acres, and you can drive the property in your vehicle instead of walking it.   The staff is mostly college horticulture graduates or seasoned veterans in the business, and very professional, as opposed to Hanna’s Nursery down the street, which is mostly teenagers still in high school hired as cheap labor to BS customers, with zero knowledge of horticulture. It all starts with the excellent leadership and the rest of the staff is reflected by that.   They sell: trees, shrubs, perennials, annuals, mulch, pine straw, bulk materials like top soil and sand, several types of stone and rock for hardscape projects, irrigation supplies, drainage supplies, construction materials like cement , a wide array of tools for landscaping and beyond, safety equipment, anything that has to do with agricultural chemical applications, bottled water and sodas!\nThey do close at noon on Saturdays so make sure you get up early that day so you don’t have to settle going to Hanna’s instead and cursing yourself as you spread their dirty, trashy pine straw", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "101343728171220059934", "name": "Jaden stidham", "time": 1616134295351, "rating": 5.0, "text": "Best overall selection", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "102700679102256503662", "name": "Dewayne Coleman", "time": 1590181142546, "rating": 5.0, "text": "Andy was great helping us pick out our plants and rocks", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "108233123939057495014", "name": "J L", "time": 1565295025109, "rating": 5.0, "text": "Outstanding is an understatement for Site One.  The staff is very knowledgeable, friendly and provide exceptional customer service.  A first-stop must for all landscape and irrigation needs.  They treat you right!", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "114553902320877177170", "name": "T - Ricks", "time": 1593470226659, "rating": 1.0, "text": "Awful experience. They told me I could load my truck with the stones I needed then when I was going to pay they said they sold them and the manager (Justin) said they would have to unload them. Worst service I’ve seen in my life. Buyer beware.", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "103162093657094396019", "name": "Kenneth Whitfield", "time": 1593585693259, "rating": 5.0, "text": "Fast and friendly service and very knowledgeable", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "115009559973030958511", "name": "Ron varner", "time": 1581199298407, "rating": 5.0, "text": "Good place to deliver to a lot of nice looking plants", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "104295320616052638280", "name": "JD Harper", "time": 1570802648595, "rating": 5.0, "text": "Very good supply store. Highly recommended", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "108657428958476759448", "name": "English Farms", "time": 1550585860899, "rating": 4.0, "text": "Well staffed location. Knowledgeable. Great selection of plants, stone chemicals and hardscape supplies. Set up for proffessional contractors. Easy in out loading, and they have delivery.", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "106742226197157060076", "name": "Marshall Tate", "time": 1556126046787, "rating": 4.0, "text": "Good place. Brought cross ties in from RxR. Very busy but I was unloaded quick", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "106742226197157060076", "name": "Marshall Tate", "time": 1556126046787, "rating": 4.0, "text": "Good place. Brought cross ties in from RxR. Very busy but I was unloaded quick", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "107734423526575651292", "name": "Scott Fuller", "time": 1566485624844, "rating": 5.0, "text": "Always very helpful and fast knowledgeable service.", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "111457215149226905470", "name": "Anna Harmon", "time": 1570068967212, "rating": 4.0, "text": "Nice selection and great service", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "104871021493267689622", "name": "Matti Daddy", "time": 1557344289287, "rating": 5.0, "text": "Great guys at the counter. Someone always meets me to help load product.", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "102843884744411803056", "name": "Corey Godwin", "time": 1541608881539, "rating": 4.0, "text": "Always beyond helpful minus the guys who dont know where the plants are.", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "111195308777536482118", "name": "lowndes whatley", "time": 1536711989903, "rating": 5.0, "text": "Very friendly, helpful staff, huge selection of landscaping supplies.", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "110931206204171523508", "name": "Billy Recknor", "time": 1530908318387, "rating": 5.0, "text": "Walked in, discussed what type of grass and issues I had and received perfect service.  Didn’t try to push unnecessary products.", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "105409380767193557120", "name": "Jeff Aiken", "time": 1597688606720, "rating": 5.0, "text": "Top Notch", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "104665353750019347880", "name": "alina krancer", "time": 1522354232928, "rating": 5.0, "text": "Wonderful and knowledgeable people!\nBeautiful fresh plants!", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "106751775178759739631", "name": "Raymond Dunn", "time": 1557239020399, "rating": 4.0, "text": "Excellent selection", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "106251511293341970899", "name": "beardenjim", "time": 1551587980147, "rating": 4.0, "text": "People are actually a little too friendly", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "113143203623649209432", "name": "Scott S", "time": 1584398826441, "rating": 5.0, "text": "Thumbs up", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "112064989452045165584", "name": "Patrick Gibson", "time": 1538853982835, "rating": 4.0, "text": "Good customer service", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "113060350434249234832", "name": "Preston Lee", "time": 1524517057539, "rating": 4.0, "text": "I delivered there friendly people", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "104105406584957159102", "name": "Major Henderson Jr", "time": 1558664883936, "rating": 5.0, "text": "Greats", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "106716895432523693542", "name": "LUCIO PEREZ", "time": 1602733460422, "rating": 5.0, "text": "(Translated by Google) MAGNIFICENT PLACE TO FIND PLANTS TREES AND STONE MATERIAL ETC\n\n(Original)\nMAGNÍFICO LUGAR PARA ENCONTRAR PLANTAS ARBOLES Y MATERIAL DE PIEDRA ETC", "pics": null, "resp": null, "gmap_id": "0x8889163fffffffdf:0xf751761183b6105c"}
{"user_id": "106418706644355862432", "name": "Matthew Glidden", "time": 1619464167785, "rating": 2.0, "text": "They were great and very responsive to get materials to the job site but hopefully you order EXACTLY what you need because I’m now on my fifth call trying to get a pallet of blocks picked up so I can pour a new driveway and have been told multiple times that I’d get a call when the driver was on his way to pick up the extra.  I’m now being ghosted when I call and I’ve yet to get a voicemail call back.  Last one I talked to was John.", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "103561462598836865692", "name": "JUAN MIGUEL DIAZ", "time": 1621455481497, "rating": 3.0, "text": "They don’t have good and safe delivery side, if you are a truck driver be careful", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPgqmC7uu8j5xXBHXrNrEmMIII9JAgeTWSJAlhY=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "113832621791821442337", "name": "Darrel McColgan", "time": 1597882234441, "rating": 5.0, "text": "Howdy.....I've been running an Irrigation Repair company in the greater Huntsville area for 20 years now.   I have been using Site One and it's previous name sakes (Century Rain Aid and John Deere) since 2000.  The name of the company (ownership) may have changed over the years but it has always consistently been my go to place.  Several of the current employees have been around for a quite a number of years.  The knowledge that they know and share is invaluable to the everyday needs of the landscape and irrigation industry layman.  If they don't have it they find a way to get it.  Their prices are competitive and they carry a variety of name brand parts.  During these trying times of COVID it's good to know that they are still trying to meet our demands and needs with the manufacturing industries struggles to keep up with new inventory.  Kudos to the whole staff at SiteOne for making it a little easier to continue to operate with limited resources at this time.", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "107336973616522134312", "name": "Tom Lamar", "time": 1616028089008, "rating": 5.0, "text": "Everything  for your yard. Very helpful staff", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "113132995215206287149", "name": "Micah Chambers", "time": 1600783134861, "rating": 5.0, "text": "Carter and his team at Site One are unparalleled; they go above and beyond to take care of my team's needs each and every time. Robert in the nursery will be one of the friendliest and most helpful individuals you will ever deal with in the commercial landscape world.", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "105487477783710481033", "name": "Jeremy Jones", "time": 1597869290239, "rating": 5.0, "text": "Always on top of your needs and eager to see them met asap. I dig these folks, should get the Michelin Star of Landscape Supply.", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "105223998275572775570", "name": "Rainflower", "time": 1597944684118, "rating": 5.0, "text": "Great store. Great customers service. Will surely be back", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "118344709086245108534", "name": "George Droukas (tvtechparts)", "time": 1577470653144, "rating": 5.0, "text": "Great service.\nSite One has professional products that can't be found on the big box stores also has knowledgeable staff that can help you on all lawn care needs. Will be back.\nThanks John.", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "101255596357335636215", "name": "Josh Sauls", "time": 1600962118658, "rating": 5.0, "text": "Very helpful!! Good service.", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "104379977836359126067", "name": "Gary Phillips", "time": 1579925186708, "rating": 5.0, "text": "Good workers very knowledgeable staff.  Dan is the go to man there with any problems.", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "115450773439644890604", "name": "Dale Webster", "time": 1571452032909, "rating": 5.0, "text": "AWESOME place to go see from ;\nPlants\nPavers\nIrrigation\nAnd lots more !", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "100201936299849941285", "name": "Bill Mills", "time": 1556297046240, "rating": 5.0, "text": "Excellent service. Staff even helped trouble shoot a problem with car trouble to get me back on the road quickly. Kudos to the management and sales staff!", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "117425025739074731312", "name": "Jacob Nykyforets", "time": 1602019061451, "rating": 1.0, "text": "Stupidest laziest people ever I called with delivery they refuse to take", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "107530485026851343816", "name": "Poppi Gee", "time": 1559241055633, "rating": 5.0, "text": "Love this place.  John, Todd, and Carter are great people and help out alot.", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "103382244509612032737", "name": "hendriks family", "time": 1564182787487, "rating": 4.0, "text": "Friendly staff, always have what I need. Very rarely have to wait. Conveniently located", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "101017738387242438890", "name": "Brian Moore (Armyballer)", "time": 1536874381256, "rating": 5.0, "text": "Great place, only place in town I could find baseball field marking chalk.", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "116165392726852265283", "name": "Rodney Panagiotoglou", "time": 1562196050476, "rating": 5.0, "text": "Professional and friendly service every time.", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "111149389151545082036", "name": "Momma Smoke", "time": 1539628886911, "rating": 5.0, "text": "Very helpful and extremely nice! Will be back", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "105201259512996433735", "name": "Alex Locks", "time": 1557186464999, "rating": 3.0, "text": "Have been waiting for my replacement plants.\nKeep being told ill get a call.", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "118046557610809298922", "name": "Troy Skinner", "time": 1519334778280, "rating": 5.0, "text": "Helpful and knowledgeable staff. Recommend.", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "101344881216069485902", "name": "David Mullins", "time": 1536533253431, "rating": 5.0, "text": "Very professional & extensive inventory. Knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "110437067672086036456", "name": "Jeff Payne", "time": 1536943163718, "rating": 5.0, "text": "Frindly and knowledgable always!", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "103848564432263322736", "name": "PATTY JOHNSON", "time": 1555955793296, "rating": 5.0, "text": "Always great customet service", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "112425615268478113928", "name": "Alan Davidson", "time": 1514318985746, "rating": 1.0, "text": "This is not the same store that it used to be on Leeman Ferry Road. For 2018 you should 1-answer the phone 2-don't look so unhappy or aggravated to see a customer come in. Upset that I am off this week and you are working? I won't be back.", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "103026927169268668533", "name": "FJ B", "time": 1540472735826, "rating": 5.0, "text": "Ideal place for your landscaping needd", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "102754743054435802905", "name": "Daniel Cooper", "time": 1525354637490, "rating": 5.0, "text": "Great customer service. Tory has really turned the place around.", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "109316698850301645386", "name": "Melissa Robley", "time": 1521055627772, "rating": 5.0, "text": "Salesmen were very nice and helpful!", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "100233516214158355964", "name": "Tyrone King", "time": 1557943984542, "rating": 4.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "112970413108880123840", "name": "Robert Davis", "time": 1538593248276, "rating": 5.0, "text": "Fast an convenient service", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "102951095933165150523", "name": "William R. Davis", "time": 1526048876171, "rating": 5.0, "text": "This is where we get all of our arborvitaes Maples and assortment of vegetation for the our lawn Service", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "115104040765554952792", "name": "Jerry O. Smith", "time": 1494417425184, "rating": 5.0, "text": "Great group of people. Very helpful.  !!!!!", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "112825435797373713280", "name": "Bruce Crawley", "time": 1492522900681, "rating": 1.0, "text": "Had a tax of for school system did not take it to lazy to do the paper work", "pics": null, "resp": null, "gmap_id": "0x88626b907e35b40b:0x4b2df210397c09a"}
{"user_id": "109882192729174165666", "name": "Angelica Garner", "time": 1617116495384, "rating": 5.0, "text": "Moved to a new house so wanted to leave another review. You should give them a try! Having new sod our yard looked horrible. Our yard technician, Antonio has done an amazing job at helping our weeds/grass get under control. They really have done an amazing job this year. They keep track of all  treatments and payments online. When we had a misunderstanding the receptionist was so pleasant we were able to resolve the issue, and I discovered that I was wrong, but her customer service was so exceptional that I feel comfortable to call them with questions. Great company👍👍", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "102715469934373219277", "name": "Betsy Gifford", "time": 1605731033011, "rating": 1.0, "text": "Do not waste your time or money here.  This review is coming at the end of the only season where I used Superior. Throughout the year I wasn't impressed with the invasive weeds that continued to sprawl in the back yard. Normally I was not home when the service was rendered, but one time I stop the person doing the application. He was rather dismissive and said they would get taken care in the future weed control applications. I am not a professional lawn person(hence the reason I pay them)so I had to assume he was telling the truth.\n\nToday, I was home when he came to do the final application. The truck was out front for less than 10 minutes. I have a reasonable sized lawn, front and back and a very difficult gate latch to contend with. There is a zero percent chance that he would have been able to disembark the truck, prep his application material, mange the gate, do a proper back yard treatment, latch the finicky gate latch, do the front and tag my door in that amount of time.  Suddenly then it clicked, this is likely why the back looks terrible - other than the one time I was here with the gate open, the work has never actually been done. (Included below crab grass photos taken today - after $432 in applications you should not see an increase in the amount of weeds - these patches are 2x what they were in the spring.)\n\nIt is evident that Superior does not instill in their employees a sense of pride in their work. I've had the same person so all the applications and a reputable business would develop a culture of doing the right thing. The application person should be invested enough to actually correct the problems a customer and ask for support if needed. Clearly this is not the case with Superior. The operations manager had the approach of blaming me for not bringing it to their attention at an earlier time and after consideration, I believe he couldn't be more wrong. If the applications aren't effective, his employee should be responsible and proactive enough to address this internally and find a solution for the customer.  Obviously these are not priorities for their organization.\n\nCaveat emptor.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMy4-LTuRrGXDNNTQpAp8cJeGNZM6R6wv4XCW6a=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMho-gmsg-5oiMvEhcU7dZYQQf60m_tBAUnM0Gp=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "106984570866937917389", "name": "Pat B", "time": 1621801591014, "rating": 2.0, "text": "Wasnt impressed with their cookie cutter maintenance schedule. More and more weeds kept growing and when calling they said they would take care of them the next round, yet as they came and treated no weeds ever died. Not sure what they sprayed but it sure didnt work. Switched lawn care companies and after first treatment 90% of weeds are gone!", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "110569303085937552028", "name": "Charlie Edwards", "time": 1621531704878, "rating": 1.0, "text": "This was my 4th lawn care business. I was clear when I hired this business if you do not do a good job I will terminte my service. Second month of servicing was put off for 7 weeks. 3rd treatment was put off because I was told they didn't have the products they had to order them. Although I was assured previously of date 3rd treatment would occur. On 3rd treatment date when I was informed they wouldn't be coming on the date scheduled, they were terminated, as I told them I would not hesitate to do. I've had to dig weeds out of my lawn anyway,  they weren't doing a good job at arriving at scheduled times, not removing the weeds. I've purchased my own supplies and will treat my own lawn on my own time and not wait for no show lawn tech and managled service appointments. By the wAy it's less expensive to just buy your own supplies", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "112968746162660000553", "name": "Erin Blevins", "time": 1600532108065, "rating": 1.0, "text": "Not good. One year they burned our grass. Graciously we a assumed it was a new technician and let them continue servicing our yard. Now we have terrible weeds. Called and requested a service call to come spray. With covid I'm home all day, but no one ever came. No call, no notice that they had been here, and weeds are still terrible. Will not use again.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNbdRooQ6Z4GjZLvPI4srwx8JuscA5RuZI4T120=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOwhmyDch7UjNA4c4xc1-pl-wKbm8dfPVc2wYBt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP21x7uxwor8XEN8bKCxUcu4jj8Y446nsPZbYv8=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "114211790789912700958", "name": "Jake Abernathy Fishing", "time": 1604349464865, "rating": 1.0, "text": "They would be a lot better if their drivers would learn not to drive under the speed limit in the left   Lane.", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "114274956632891634424", "name": "Jim Owens", "time": 1584819416399, "rating": 2.0, "text": "They billed me for a service that was NEVER EVEN PERFORMED on my lawn! I just payed it and then cancelled my service immediately...\nI used Wayne's Environmental before I moved here...I wasn't aware until today that they have an office in the Huntsville area! I will definitely be giving Wayne's a call this afternoon!", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "111415364281953054248", "name": "Angelica -Angel- Elizabeth", "time": 1582581989287, "rating": 5.0, "text": "We had bald spots and weeds that another company that we had for over a year didn't fix. We get Superior Lawn for about a year and our yard has done a complete 180. I'm really not sure why all the negative reviews, but our yard has never looked better.", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "115296259629570983030", "name": "Katie P", "time": 1569621897773, "rating": 1.0, "text": "Terrible service. Do not waste your time and money with them!!!  Missed areas; one side of the yard didn’t even get sprayed on several occasions. The final time was last Friday. A pre-emergent and a post-emergent were used. We have some small Japanese cedars that we planted this year that we’ve babied all summer. We noticed on Tuesday that the lower third to lower half of 4 out of 5 trees was brown. All summer these trees were green and showing new growth. I spoke with Brandon, who didn’t know what was in the post-emergent, about it. He saw pictures of the trees and said he thought it was due to drought. We have tended to these trees all summer.  It just so happens to turn brown a few days after they spray?!  I cancelled our service. They didn’t even offer to make amends.", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "102754742341179034510", "name": "Terri Davis", "time": 1562895133854, "rating": 1.0, "text": "I still have all weeds in my yard..there is no grass, and they must fertilize my weeds😳.\nSo I called them and asked them to pls burn the entire yard, so we can plant fresh new grass... well she said they will send someone to spray the  weeds wherever needed😥", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "105197784098306628547", "name": "Gloria Banks", "time": 1560451091829, "rating": 1.0, "text": "I’ve always taken care of my lawn on my own(and took great pride in doing so!). However, due to some recent health issues, I decided to give a lawn care provider an opportunity. Long story short ...on the first application my lawn was devastated by whatever chemicals they used (overused). I made several attempts to speak with the supervisor but he/she never returned my calls. Finally I managed to get in touch with said supervisor...expecting an apology of sorts. Instead, he was obnoxious and arrogant and refused to take responsibility for the damage to my lawn...these people are more like gangsters than professional businessman. Take your business elsewhere...you’ll be grateful that you did", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "106498167158456863543", "name": "Michelle Gonzalez", "time": 1588956921921, "rating": 3.0, "text": "Friendly guys but lawn still has weeds after a year of treatments.", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "108071134312115490971", "name": "drewaufan1", "time": 1548716004600, "rating": 1.0, "text": "Sales representative is rude and condescending. Services are extremely overpriced & results are extremely underwhelming. I recommend Wayne’s Environmental Services!", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "109126497160731443746", "name": "Chad Wilson,", "time": 1520276809553, "rating": 5.0, "text": "Easy to set up by calling.   My weeds are back and didn't realize how bad my lawn needed treatment.  The OTC stuff goes to a certain point.", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "109062480468990004407", "name": "Aaron Crawford", "time": 1488552319286, "rating": 5.0, "text": "They've done an excellent job and have great attitudes. Highly advised professional lawn care. I used them for anti rodent measures.", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "107988456583729359920", "name": "Timothy Montwood", "time": 1561628243732, "rating": 1.0, "text": "Poorly run company. Messed my yard up and then tried to tell me i dun it.", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "107688990926005847987", "name": "Mary Brandenburg", "time": 1561229161035, "rating": 1.0, "text": "Bare spots and weeds where I had a beautiful lawn last season.", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "111948546364560595621", "name": "Orlando X", "time": 1491336473252, "rating": 1.0, "text": "Never came by or called. I called for a lawn maintenance quote and they said they would call me back and never did. I thought they might just come by because I never received a call but that didn't happen either.  Disappointing!  I figured I would give them a try based on some reviews but they proved they are too busy. Called another company and they came two days later. (March 2017)", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "111450587871543792088", "name": "Rachel Hunter", "time": 1365131787772, "rating": 5.0, "text": "My lawn was full of weeds and ugly. I called Superior Lawn Care and received a friendly lawn expert who came the same day to look at my ugly lawn. I was happy with the knowledge and personal care towards my lawn needs and he explained weed control and fertilizer in a way I never understood. I signed up for an annual lawn care program and when the lawn guy came to treat my grass the first time, I watched him as he really took much pride in the visit. The results were clear within a few weeks that this really works. My weeds are dead now and I am anxiously waiting to see how beautiful it will look this summer. I will post again an update. I recommend Superior Lawn Care service to all my friends and neighbors now. Plus, if I refer someone that gets the lawn program, I get a treatment for 1/2 off! :)", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "107379349530081260834", "name": "Lakin Lovett", "time": 1526401042987, "rating": 1.0, "text": "Extremely overpriced, didnt show up on time, didnt call to informe that they would be late. Take your business elsewhere.", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "115566181599357499038", "name": "Steve Phillips", "time": 1471626717275, "rating": 5.0, "text": "Simply the best!!!", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "105795358977856460973", "name": "Tish Hazel", "time": 1623858566308, "rating": 5.0, "text": "Mosquitos gone in backyard thanks to Superior!", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "114455438284696149254", "name": "Eric I", "time": 1623871562277, "rating": 2.0, "text": "A well earned 2.9 average Google review, below average in every way.", "pics": null, "resp": null, "gmap_id": "0x88882b00ada4e425:0xca3738802127df8b"}
{"user_id": "114874743555248749283", "name": "Russell Aradine", "time": 1619785291592, "rating": 5.0, "text": "Excellent products along with expertise on providing guidance on which items will be best for the job.\n\nOutstanding support after the sale.\n\nThey are second to none.\n\nWhen you want top quality lighting products for your home, you’ll definitely find it here.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "117546514007480841550", "name": "Scott Muench", "time": 1619475183526, "rating": 5.0, "text": "Fantastic personal service and safe show room experience by appointment", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNY2UnqyQQPSnMyX0GEC526nkCsbReQg9ffI04E=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "111076187382419639275", "name": "Fernando Moreno", "time": 1615929751452, "rating": 5.0, "text": "Tara was great. She was so patient and helpful. Made the decision process so easy. Beautiful lights to choose from and if they don't have it, they'll find it. Wonderful experience.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "108730408179783249923", "name": "Scott Ratliff", "time": 1616270452758, "rating": 4.0, "text": "Sales lady came across as kind of cold and didn't want to be there. Understandable on Saturday but you can't let your customers know that. Took my special order for an item that I already had the order # for. I td her I wanted to look at floodlights also. She just said \"they are around the corner\" and pointed. Then she just left me on my own.\nOther than that they have tons of lights on display to look at as always.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "103399593414210718922", "name": "Daniel Callens", "time": 1522157349525, "rating": 5.0, "text": "Excellent attention and best post buy experience. High quality and huge variety of products. Highly recommended", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMlkA5DnSVot-q1WfLYIrUYmQHdpxiBVPNWmg4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO9h_JB33eMXp-gkL2rZlS9YQu8RXXbWQV7VAw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPYjlAMj6rYb4Ip4PSxnjFdWqrvX8EGyRY00Ck=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "103915312475822011571", "name": "Cynthia Buchheit", "time": 1619304713830, "rating": 5.0, "text": "Huge selection. Very nice staff who are knowledgeable and helpful. Great business.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "112558808135585421358", "name": "Brian Maxwell", "time": 1613400870960, "rating": 5.0, "text": "Very friendly staff helped me find just the right light. Thank you so much!", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "114162723736747499208", "name": "Tasha Wiley", "time": 1589835736063, "rating": 5.0, "text": "They are Super honest, and will bend over backwards to help you find a solution. I love that they can easily research and order any specialty bulbs you may need. They will always take care of issues that may arise (ie, a sconce breaks 4 years after you purchased it and you have no idea how to find replacement glass—they’ve got you in the system and they will order it for you!) Top notch service, and everyone is so friendly. You get what you pay for, and we are always happy with our purchases from Richards Lighting.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "108341711662008461816", "name": "Rod Powell", "time": 1578760103247, "rating": 5.0, "text": "Outstanding business.\n\nThey were the lighting provider for our newly constructed home.\n\nWe had a \"lighting allowance\" from our builder, so we went to pick out each and every light fixture for our home.\n\nExpecting this to be tedious at best, we were very pleasantly surprised by both the selection, and especially the young lady who assisted us.\n\nShe was very knowledgeable about every item we had questions about, and she was able to make many great recommendations based on our tastes.\n\nBest experience with the various vendors involved in our build.\n\nWould gladly do business with Richards again.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "107356129765733234422", "name": "Kristian Starlin", "time": 1604001286056, "rating": 5.0, "text": "Their technician is very knowledgeable,  annnddd he's pretty cute.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "109148996108359869673", "name": "Aaron Biggs", "time": 1581084219153, "rating": 5.0, "text": "Wonderful service and fantastic selection!!  My wife and I spent the evening with Terra who is amazing.  She helped us pick out the entire lighting selection for the farmhouse we are building.  Great experience and we couldn't be happier.  Thanks Terra!!", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "117764967617134523529", "name": "Kelley K", "time": 1577479733635, "rating": 5.0, "text": "Richards Lighting is always wonderful when we go in...no matter what you need they are always willing to help.  We personally work with Mike. His knowledge and expertise always makes us feel confident in the choices made!  Thank You!", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "101857377288975377508", "name": "Longbow Roasters Coffee", "time": 1592193510022, "rating": 5.0, "text": "Went to Richards Lighting for a new kitchen light and was amazing on the selection. They definitely have your lighting needs covered", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "103943833308327124610", "name": "Carolyn Pancharian", "time": 1567024573737, "rating": 5.0, "text": "Richard's is outstanding. They ask if you need help or prefer to browse. No salesman pressure. When we found what we wanted we told Sabine. Next we paid the bill & a gentleman was already there with our purchase and put it in our car. We appreciate how fast & smooth everything went.  So upon arriving at home we ordered a second lamp. Thanks for the fantastic service. Carolyn Pancharian.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "117624832043993703498", "name": "Kareen Goodwin", "time": 1606248566838, "rating": 5.0, "text": "Beth was great!!! Made it enjoyable.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "108113396767379328565", "name": "Terri Womack", "time": 1607205687338, "rating": 5.0, "text": "Very happy purchase today!", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "110411176543305550012", "name": "Jennifer Shepard", "time": 1553738728617, "rating": 5.0, "text": "We purchased all our lighting fixtures from Richard’s for our new custom house. They have a beautiful selection and their service is top notch. We had a few little issues, at no fault of Richard’s, but Mike and his staff took care of me every step of the way. They definitely understand customer service and the power of repeat business. When the time comes to finish our basement, we will definitely be using Richard’s again.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "117408338179106127260", "name": "BJ F", "time": 1535393587012, "rating": 1.0, "text": "Initially I thought this place was great. They had a huge selection. I paid a hefty price for several light fixtures and a fan. I didn't mind at all as I was supporting a local business. But that's where it went downhill! Customer service is definitely not their top priority once the transaction is complete.. Perhaps they're more inclined to accommodate builders, but they definitely didn't help solve my issue at all. Beth never called me back when she said she would. I've yet to speak with her again. I had to call about a light kit that I ordered a month prior and was told it would be another couple of months before it came in if that even happened at all. I was refunded the wrong amount initially and had to call again to get it corrected. I still need to order several more lights to complete our renovations, but I will definitely be taking my business elsewhere!", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "104378988863832968102", "name": "H B", "time": 1548272219874, "rating": 5.0, "text": "Awesome company to work with. Got our new house lighting from them with no issues.\n\nSelection is good but the real selling point is their service. Terry and everyone else there is helpful, nice and always willing to assist in any way.\n\nI definitely plan on using them for any future lighting we may have at the house.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "114917652610891722396", "name": "Alysha Bolin", "time": 1571083859978, "rating": 1.0, "text": "Terra is GREAT she helped me create a wishlist and narrow down which lights I needed for a new build. I bought all the lights for my new house here and after a transaction issue on their end I will not go back for how I was treated!! Teresa spoke very ugly to me over the phone about an issue that was their problem, so after supporting this business and being talked to like that I will not recommend this business!!", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "113275616139317404717", "name": "Brian Pouliot", "time": 1582157269549, "rating": 5.0, "text": "Huge selection of lighting fixtures and a knowledgeable and helpful staff. There are so many options when building a house, and Richard's made it easier for us to get what we wanted and stay in our budget.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "114492869619657836694", "name": "Nikki Elio", "time": 1574123410288, "rating": 2.0, "text": "OUTDATED showroom and if you want anything from the website, which of course you do because who wants 1990 looking light fixtures, just remember no returns!! You are better off ordering online from a store who will take returns. Outdated fixtures. Outdated practices. Would not recommend.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "103710934793649624349", "name": "Herb Hughes", "time": 1601149654218, "rating": 5.0, "text": "Great selection and best service in Huntsville!", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "113825012010518077747", "name": "Sarah Melendez", "time": 1605227953098, "rating": 5.0, "text": "They were amazing!", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "109866307934069569973", "name": "Candice Musgrove", "time": 1567870648508, "rating": 4.0, "text": "Excellent service! The fixtures are pretty pricey compared to other places but the staff is patient and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "117430324070085801236", "name": "Tom Moore", "time": 1557226691935, "rating": 5.0, "text": "Good people.  No wonder they have been a first class Huntsville business for all of my 50plus years here.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "108145227870582799479", "name": "Suezy Proctor", "time": 1514130943508, "rating": 5.0, "text": "Not only does Richard's lighting have an incredible variety of lighting options - I mean REALLY incredible, their staff is knowledgeable and friendly. One thing you might not know, is that they also do lamp repair, which was important to me when my vintage brass floor lamp's on/off dimmer control stopped working. They took it in, cared for it and returned it in great working condition at a great price. I love this lamp - it has been passed on to me from my family.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "118310378427339966706", "name": "Tyson DeAngelis", "time": 1571234751792, "rating": 5.0, "text": "Excellent selection of fixtures. Good variety, exemplary service.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "112540957990350114155", "name": "Lisa C.", "time": 1462031628115, "rating": 5.0, "text": "New to the area and have fallen in love with Richard's.  Have bought 5 fixtures thus far.  The staff is very friendly and knowledgeable and they are all so willing to answer questions and yet, give you space to look around.  If they do not have something in stock, chances are they can order it for you.   We will be repeat customers and will recommend to friends.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "117854446326977803434", "name": "JoN JoN Santiago", "time": 1509672780985, "rating": 3.0, "text": "This place has a great variety of indoor and outdoor light fixtures.  They are pretty expensive.  I had to use them because I was going through the Stoneridge builder.  They tried to make me feel special by saying we were getting a discount however all of the light fixtures and bulbs are much cheaper anywhere else even with the “discount”.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "107500604957864129079", "name": "Gary Holt", "time": 1557785210798, "rating": 4.0, "text": "Large inventory, some items unique high dollar, pleasant staff", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "102713544192777130917", "name": "Deanmu6uio Paulin", "time": 1547315697551, "rating": 5.0, "text": "Very professional. They have just about all kinds of lighting products.\nGreat showroom.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "108317150494741574615", "name": "Beth Beck", "time": 1386696372114, "rating": 5.0, "text": "We build a new home and purchased all of our light fixtures from Richards Lighting.  The staff are all very knowledgeable on scale, style, and the amount of light needed for effective lighting.   They offer great style at reasonable prices and excellent customer services.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "107787934727938286030", "name": "Chris Henke", "time": 1518966515659, "rating": 4.0, "text": "Ok, kind of pricey. Our builder uses them so we made our selections here. They are good about returns & trades after you close. We went 2K over the builders lighting budget.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "105706937445386229198", "name": "james starks", "time": 1555087986919, "rating": 5.0, "text": "Needed  parts  and received excellent  service  and parts needed\n.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "117740970427978280948", "name": "Claudia Rhen", "time": 1549501025280, "rating": 4.0, "text": "Very nice lighting.  Can be a little pricey.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "118337475855299129711", "name": "Alisha Arrington", "time": 1473965940434, "rating": 5.0, "text": "HUGE selection of lights in a wide variety of styles. The prices were great and everyone was very helpful.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "117903910650852625177", "name": "Taylor H", "time": 1475600873250, "rating": 5.0, "text": "Great customer service with a huge selection. I thought their prices would be much higher than the big box stores, but they are very reasonable and seems to stand behind their products.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "102552558160050804218", "name": "jeremy worland", "time": 1569698508186, "rating": 5.0, "text": "Very nice and very helpful", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "114853106411591296886", "name": "Scott Perry", "time": 1519150628482, "rating": 5.0, "text": "Terry is great to work with! So glad our builder, Murphy Homes, uses them.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "102632116672897332889", "name": "Anthony Francis", "time": 1557933438100, "rating": 5.0, "text": "Wide selection of lights. Great time killer is to go around turning all the lights off.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "109755762088297059728", "name": "steven horton", "time": 1528427086657, "rating": 5.0, "text": "Service was great and they knew just what I needed.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "114142218863090738361", "name": "Delora Prince", "time": 1515117775497, "rating": 3.0, "text": "Did not have exactly what I was looking for but did have a \"fix it\"........ Good thing I know what I'm doing.....lol", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "116136219614567476132", "name": "Tyler Prentiss", "time": 1515546415146, "rating": 5.0, "text": "Got my lamp fixed for a very reasonable price.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "108517223653549311108", "name": "Ryan Shipman", "time": 1579713491651, "rating": 5.0, "text": "Great Customer Service", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "106849292992552540355", "name": "Perry Buford", "time": 1552332285006, "rating": 5.0, "text": "Looking forward to doing business with Richard's as we pick lighting for our new home!", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "102170427349862271456", "name": "Charlie Wilson", "time": 1483373366666, "rating": 4.0, "text": "Nice showroom with large selection of light fixtures.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "110623999353787446205", "name": "Brian Burke", "time": 1559410173999, "rating": 4.0, "text": "Friendly customer service and plenty of options available.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "110038760722902610549", "name": "Yolanda S. Jones", "time": 1511884309692, "rating": 5.0, "text": "Beautiful lighting and friendly staff", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "101913591476602422509", "name": "John Bullard", "time": 1575358528976, "rating": 5.0, "text": "Put mpat", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "103478043714135915933", "name": "Cornita Allen", "time": 1524000565844, "rating": 5.0, "text": "Good service", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "103282598827344575069", "name": "Pixie Lent", "time": 1511629382271, "rating": 5.0, "text": "Amazing selection!", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "103226078036585855457", "name": "Lakshmi Inguva", "time": 1510254911145, "rating": 5.0, "text": "There is so much variety", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "109714748015811169209", "name": "Jesse Graham", "time": 1537216504917, "rating": 4.0, "text": "Nice store, good service", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "114366491353691806889", "name": "Angela Bowman", "time": 1515284198941, "rating": 4.0, "text": "Large selection of all kinds of style lighting.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "115085412934526999253", "name": "KEn JOHNSON", "time": 1511921874289, "rating": 5.0, "text": "Amazing helpful staff", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "104279765718443609433", "name": "John Schock", "time": 1406685086652, "rating": 5.0, "text": "I needed a particularly obscure electrical conduit for a hanging lamp and they went through quite a lot of trouble to find it for me and even cut it to a desired length and only charged me a couple bucks for it.", "pics": null, "resp": null, "gmap_id": "0x88626b430c1ba455:0xb77df1dfaf60d3cb"}
{"user_id": "100397103450225860174", "name": "niki ferguson", "time": 1613956793755, "rating": 4.0, "text": "Shayne and his crew did a great job building our retaining wall and walk way for us.  They showed up on time, clean up after themselves and were really nice. Our pavers that are around our pool got discontinued and Shayne went above and beyond to try to find pavers that matched as close as possible to what we had.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOV025KQeuvaOk0KauumTFTMDDOrh3wX1QIXj5s=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP9130OzM9oXsah7rEiJXXL3ZjT_ZkGzKhATAz8=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
{"user_id": "113428867666718924846", "name": "Alec Ross", "time": 1590804421340, "rating": 5.0, "text": "Needed a footer added on to my existing patio. Came in at a great price and quick response. Always friendly great quality of work. The team that came out was great and worked fast. Will use again! Give them a call!", "pics": null, "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
{"user_id": "117280148075030443179", "name": "LeWaire Waycaster", "time": 1576811336932, "rating": 5.0, "text": "Bayshore has completely landscaped our home including custom lighting and a circle drive. I wish I could give them the stars!! They always go above and beyond to provide excellence.", "pics": null, "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
{"user_id": "114486160015174910471", "name": "tiffany passarelli", "time": 1599528600564, "rating": 1.0, "text": "Very unhappy!  12 months later and we are still waiting on major warranty work to be performed.  Shayne will not return our phone calls, text messages or emails. He took our money and ran....", "pics": null, "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
{"user_id": "106905909530809960403", "name": "Steve Perry", "time": 1554678186925, "rating": 5.0, "text": "Shayne and the guys at Bayshore have done several projects (flower beds, fire pit, pergola, sod replacement, sod replacement and maintenance) at our house and have done a wonderful job. Shayne is great at providing attention to detail and ensures that you are pleased with the project. Highly recommended!!!", "pics": null, "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
{"user_id": "114012249527997396237", "name": "Amymarie McKnight", "time": 1554835121491, "rating": 5.0, "text": "Bayshore Landscapes has been maintaining my lawn for over 6 years. The guys are hard workers & always do a professional job!  They have great costumer service skills. I highly recommend Bayshore Landscapes!!\n\nAmy McKnight", "pics": null, "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
{"user_id": "100742908492112190911", "name": "Kevin Brane", "time": 1554514750690, "rating": 5.0, "text": "The folks at Bayshore Landscapes put in an outdoor kitchen for us. Excellent job, timely and professional. We were very pleased. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
