{"user_id": "110373041490788529306", "name": "John T", "time": 1569352760178, "rating": 5.0, "text": "Getting custom equipment certified can be a headache at the best of times, but the wizards at Mobile Instrument worked with me to streamline this process. They have some of the most knowledgeable and experienced employees I've ever had the pleasure of working with. If you're looking to have your equipment rebuilt, calibrated, certified by true professionals, look no further.", "pics": null, "resp": null, "gmap_id": "0x889a4daa3eb49ef7:0xb8ac38bea9008aa6"}
{"user_id": "111691170069269164333", "name": "Foxcrete Construction", "time": 1536705276480, "rating": 5.0, "text": "I came in to pickup our level, to find there had been a miss communication doubling the estimate of what our repair had projected to cost. These guys took the hit, apologized, and made right on the situation. 5 stars all day in my book. Thank you for the good service!\n\nIt isn’t always how often service goes right that grades a good company. It is when something goes wrong.\n\nThanks guys!", "pics": null, "resp": null, "gmap_id": "0x889a4daa3eb49ef7:0xb8ac38bea9008aa6"}
{"user_id": "115803087207918672257", "name": "BLISS AERONAUTICS", "time": 1379096998353, "rating": 5.0, "text": "These guys did a fantastic job of calibrating a wide variety of instruments for our ship.  They also did it fairly quickly.  The convenience of having their services near the port of Mobile can't be over-stated.  They did a great job all around and gave us the certificates that you just can't do without these days.\nThanks guys!", "pics": null, "resp": null, "gmap_id": "0x889a4daa3eb49ef7:0xb8ac38bea9008aa6"}
{"user_id": "108734302096448644959", "name": "Daniel Monie", "time": 1456945862543, "rating": 5.0, "text": "I only know about the surveying side, and I know they do it very well. They have or will find the answer to your question. They excel at customer service and are always competitive at their prices.", "pics": null, "resp": null, "gmap_id": "0x889a4daa3eb49ef7:0xb8ac38bea9008aa6"}
{"user_id": "112125421752882128214", "name": "Joey Funderburk", "time": 1581528032481, "rating": 4.0, "text": "Easy access and a friendly staff of professionals.", "pics": null, "resp": null, "gmap_id": "0x889a4daa3eb49ef7:0xb8ac38bea9008aa6"}
