{"user_id": "108744766922822959701", "name": "Steve Mid TN T-Trak / Chicago & SouthEastern MRR", "time": 1431896922347, "rating": 2.0, "text": "Potentially great suite of Laser Cutters & 3D Printers. However preventive maintenance was lacking, I talked with two of the owners about it , Rob & Tia.   Both seemed to accept the high down time as normal.    Rob terminated my membership because he said I had too high of expectation equipment being available.   Despite lack of operating equipment classes for laser cutter & 3D Printing were held with out hands-on experience for students.    On the positive side I was offered refund of the monthly membership fee of $60.", "pics": null, "resp": null, "gmap_id": "0x88626f9d88f8c5ff:0xb9035101853c3ea9"}
{"user_id": "110941287079191714191", "name": "D.R. Whitson", "time": 1438982104365, "rating": 1.0, "text": "We received our Astrolabes we ordered after it taking 4-5 weeks of waiting and then shipping.  They were made of cheap white plastic and were packed terribly. I actually had to put one back together because it was falling apart as i took it out of the package. There were ink smudges in numerous spots on both astrolabes.  They just looked cheap and I was definitely not going to give them as a gift.  Plus it didn't even come with any instructions on how to use it.  Overall they were very poor quality and I'm asking for my refund.", "pics": null, "resp": null, "gmap_id": "0x88626f9d88f8c5ff:0xb9035101853c3ea9"}
{"user_id": "105150269846117120355", "name": "Julie McClanahan", "time": 1628618395360, "rating": 5.0, "text": "I can’t say enough good things about 911 Lock & Key. I left a message on their web page about what I needed, and they promptly replied even though it was after-hours for them. Then this morning they showed up and the locksmith was very quick and efficient.  He made a door key and an ignition key for my son’s truck. I was amazed at how little they charged for the service! I highly recommend them. Great service at a very reasonable price!", "pics": null, "resp": {"time": 1628619218145, "text": "Thank you so much for your business! We are glad we could help. Thank you for the 5 star review."}, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "109599814716204101897", "name": "Mark Fonseca", "time": 1604531544781, "rating": 5.0, "text": "Absolutely outstanding customer experience! We lost our only key to our SUV - 911 Lock & Key made the whole process so easy - they came to us and were very professional and patient. Very reasonable pricing - I highly recommend 10/10!", "pics": null, "resp": {"time": 1604589244514, "text": "Thank you for your business!! We are so glad we could help you."}, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "106704695621624480102", "name": "Mohammadnaser Ansari", "time": 1597976290225, "rating": 4.0, "text": "The locksmith was really nice and professional. Right to the point with no wasted time. They were at the location (inside Auburn) within 20 minutes, as promised. The only reason for the 4 star is that it was really expensive. Although this was my first car key replacement, I expected like half the price (I was charged $165 for a truck key). Everything else was a definite 🌟 🌟🌟🌟🌟", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "115939995975972527262", "name": "Stephen Owen", "time": 1603389854612, "rating": 5.0, "text": "A very experienced locksmith who knows what he is doing.   Would highly recommend.", "pics": null, "resp": {"time": 1603757753874, "text": "Thank you for your review."}, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "104934090059342054435", "name": "Olivia Williams", "time": 1564157163792, "rating": 5.0, "text": "Great service! I called at 11 am on a Friday morning and they were able to come help me last minute to re key my apartment since they are closed weekends. Reasonable price and very friendly! Would definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "106247690737580373913", "name": "Kalecie Mcleod", "time": 1473165156058, "rating": 1.0, "text": "Completely rude and lack customer service skills. Used this company before.. his business partner was a nice guy, can't say the same about the guy who answers the phone. He is a complete jerk. Springs popped out of front and back door 6 months after installation. When called to have this issue corrected he spent more time trying to take the blame off their crappy job/materials used. Sir, I just wanted my door knobs fixed, it doesn't matter who is at fault. Spend your money with another company. 911 will never get another dollar from me or anyone i know personally or anyone on my street. I own a business and I will spread the word to everyone i come in contact with, I'm gonna make sure of that. I have never been so disrespected by a business owner. Spread the word, these guys are moody and rude.", "pics": null, "resp": {"time": 1473188544835, "text": "Would you please give me a text. @706-604-4080. I would like to see if i can resolve any issues. Thanks Shaun.  I can call u when i have your #."}, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "102923710621796186511", "name": "Lisa Marie", "time": 1464186096025, "rating": 5.0, "text": "I am the facilities Manager at RiverMill Storage and i want to say thank you to 911 Lock and Key. What an awesome service they provide. Fast, Courteous and professional. Always Johnny on the spot when needed and great work. Highly recommend!! We will always use you guys. Thank you so much!! Excellent company.", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "117604745582973391326", "name": "Jim Schneider", "time": 1480424457645, "rating": 5.0, "text": "Super nice guys that helped us with a new key for our Jeep. Great Service and very prompt. Fair price and did the job for what he quoted.  I would use them again and recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "102026823110103050051", "name": "Lem Harsh", "time": 1477089373041, "rating": 5.0, "text": "Super fast and efficient service, I called at 6:30 pm on a Friday and I was helped immediately. Jimmy was very professional and pleasant to work with. The fee charged for service was very affordable. I highly recommend 911 Lock and Key.", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "101508452785231154977", "name": "Patton Scales", "time": 1503522710037, "rating": 5.0, "text": "Fantastic service! Guy communicated well, met me were and when he said, and worked me through my key FOB ignition problem - definitely give them a call for you locksmith/automotive access needs.", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "104057782610589632663", "name": "Frankie Redmond", "time": 1448547615235, "rating": 5.0, "text": "Thanksgiving eve, I had an emergency at my office which required an immediate lock change. 911 Lock & Key met me after 9pm, changed all the locks, made keys and did it all in 25 minutes. Gave me an amazingly low price and just made my experience wonderful, despite the extreme circumstances. I would reccomend 911 Lock & Key to EVERYONE. Shaun, Jimmy & staff are AWESOME!", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "108295770098436757332", "name": "Brandi Sadler", "time": 1409703052601, "rating": 5.0, "text": "Very good experience. Trustworthy service and fast response. They made sure that I was able to get into my vehicle.", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "109179771015556664795", "name": "Element Zero", "time": 1465311278013, "rating": 5.0, "text": "Awesome service.\nIt good to know that there are still some good small businesses. Military discount friendly. That's Rare these days. 10 out of ten service", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "117227220459575973120", "name": "terri p", "time": 1450058448350, "rating": 5.0, "text": "Giving a 5 Star rating!!! Lightening speed response. Locked keys in 2014 Jeep and doors were unlocked ASAP. Highly recommend.", "pics": null, "resp": {"time": 1450059317255, "text": "Thank you for taking the time to do us a review."}, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "109996125752368394766", "name": "Brianna Jones", "time": 1475337036170, "rating": 5.0, "text": "911 Lock & Key was great! We tried pop-a-lock at first, only to receive a text message saying no one was coming. So inconvient and unprofessional. Luckily, 911 lock & key took care of us & were very professional and helpful. Should have called them first!", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "106193283994946694739", "name": "Alisa Sadler", "time": 1422319834455, "rating": 5.0, "text": "Wonderful company. Fast response time when a coworker needed a key made to her car. Very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "113981482113076939367", "name": "Samantha Huntley", "time": 1469394480925, "rating": 5.0, "text": "Greatest lock Smith I our area! Supper fast friendly service. Only lock Smith company I will call.", "pics": null, "resp": {"time": 1469407218225, "text": "Thank you"}, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "112209261539222134785", "name": "Latashia Caldwell", "time": 1471642323653, "rating": 1.0, "text": "Really rude!!!! They guy that answered my call didn't even want to listen to my problem kept over talking me. Without even trying to understand what I need responded \"I'm sorry ma'am I probably won't be able to help you\"", "pics": null, "resp": {"time": 1471652411734, "text": "Sorry you thought I would r thought I was rude\nIt Friday & hot been working all day in the heat\nI  cannot understand what you were saying about your goal\nSorry"}, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "101447080392188110260", "name": "Kaitlyn Woodard", "time": 1447603680591, "rating": 5.0, "text": "Really polite and super fast service. I called and requested service and was quoted about 20 mins but within 5 minutes I received another call saying they were already here and minutes later I had my key back in my hand. Only downer and not even bad was just being $60... But hey can't complain about that with them being the fastest locksmith I've ever dealt with. All in all excellent. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "103918899448275145370", "name": "Robert Hays III", "time": 1544844425290, "rating": 5.0, "text": "Highly recommend! The locksmith went above and beyond normal expectations.", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "103377357411645426832", "name": "Laila DIYS", "time": 1454889041195, "rating": 5.0, "text": "911 Lock & Key is the absolute best!!!  I called and requested services at 5:30 pm because my friend was locked out of their home (Super Bowl Sunday & the home was located in Fortson, GA...most companies don't service the area...they're nuts).\n\nA representative gave me a quote and told me someone would be at the home within 30 minutes. At 5:43 pm Mr. John, the locksmith, called to say that he was on his way and would be at there shortly. He arrived promptly at 5:56 pm. Talk about impressed!\n\nI highly recommend that you use 911 Lock & Key versus the competitors. Good customer service with A+ service, you won't find that anywhere else!!! Thank you 911 Lock & Key 🤗", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "106312850378747874178", "name": "William Moore", "time": 1422116699907, "rating": 5.0, "text": "Fast, Friendly, & knowledgeable.\nAble to make a special key when no one else could.", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "111510063744595968195", "name": "Shenghan Qiao", "time": 1539110113363, "rating": 5.0, "text": "Good sevirse， it was really helped, and it is not expensive! U can get u keys ASAP", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "102148156132834454455", "name": "S Singer", "time": 1449720591047, "rating": 5.0, "text": "Arrived faster than expected, super friendly and did a good job. That's a 5!", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "101371566460061098444", "name": "JD Roberson", "time": 1459780335277, "rating": 5.0, "text": "Locked my keys in the trunk, responded within 20 minutes and even made me a spare key to carry. Awesome Job!!!!", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "118087431453847841231", "name": "Maria Lopez", "time": 1469892184910, "rating": 5.0, "text": "So so so helpful. Seriously. I had the worst day yesterday and to top it all off, I locked my keys in my trunk, with absolutely no way to get into it without the actually car key. I searched and searched for help and Shaun and Jimmy seemed to be the only people who cared enough to fit me into their already busy schedule to come and help me. I am so thankful and Shaun was very quick and efficient. Also, he gave me all the information I would need in case this ever happened again. He really seemed to care and that's what makes them the best. Thank you Shaun and Jimmy and 911 Lock and Key!", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "116068156665615890075", "name": "Corey", "time": 1442812038817, "rating": 5.0, "text": "Great service! Responded within 15 mins to my apartment to unlock my garage. Only took 20 mins to complete.", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "109328573649069831251", "name": "Vanessa Gwin", "time": 1480165715532, "rating": 1.0, "text": "Down right rude whoever the guy was that answers the phone.  Super nice at first.  We scraped up 300$ for him to fix our car.  We were stuck on Fort benning.  When he was told he had to go to 8th division road to get a pass because he was in a company truck. He pitched an absolute fit.  Said he'd never go on Fort benning again and if we wanted him to. That it was going to be 500 instead of 300. We have 3 kids.  One being disabled.  So we need our car.  We chose to have our car towed home instead of dealing with that Jerk.", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "106079148516645062944", "name": "CE Mac", "time": 1422118735883, "rating": 5.0, "text": "Great service when I was in a pinch, Quick response and reasonable price, I recommend", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "110870148980854872247", "name": "Brandon Mack", "time": 1455035283036, "rating": 5.0, "text": "Great guys, went above and beyond to help me out after my key fob broke. Thanks", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "107645150128891882029", "name": "Ben Kinsman", "time": 1421597949493, "rating": 5.0, "text": "Quick to respond and excellent service...", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "112910864855099874264", "name": "Johnathan Fitzpatrick", "time": 1480093923081, "rating": 1.0, "text": "At first I was told they would come out to service my vehicle, but upon learning that the worker would have to enter fort benning and get a pass, he called me to refuse service and told me I would be charged an extra hundred dollars for his \"troubles and effort\"  I will be seeking another company", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "105718050909145968347", "name": "michael sadler", "time": 1421611339144, "rating": 5.0, "text": "Best Locksmith in Columbus, Ga.", "pics": null, "resp": null, "gmap_id": "0x88f33465d570d365:0x2adea388fdc34361"}
{"user_id": "112223113611159698831", "name": "Jay Johnson", "time": 1608062552583, "rating": 5.0, "text": "Awesome shop with awesome products.  Whats even better is the office staff... SJ is the bomb.  She answered my questions, and the ones she didn't know, she got answers for! If you want to take your jeep to the next level and want to do it with people that care... Call Motobilt. You can look down at my reviews and notice I don't take the time to pass out reviews unless the are 100% deserved.", "pics": null, "resp": {"time": 1608064068146, "text": "Awesome thank you Jay. SJ is a great asset to our company for sure!"}, "gmap_id": "0x889293039ac6e833:0x797dde600971c259"}
{"user_id": "113502834838368916370", "name": "Scout Bywater", "time": 1599000762825, "rating": 5.0, "text": "These Well built parts are definitely worth the money. Im going through this company for parts from now on.", "pics": null, "resp": null, "gmap_id": "0x889293039ac6e833:0x797dde600971c259"}
{"user_id": "103339342325970809083", "name": "Ed Geleski", "time": 1569024273376, "rating": 5.0, "text": "Great company w. awesome products for Jeep JL 2018 fits well and looks good!", "pics": null, "resp": {"time": 1582580516165, "text": "Thank you"}, "gmap_id": "0x889293039ac6e833:0x797dde600971c259"}
{"user_id": "114128628838799003288", "name": "Richard LaFleur", "time": 1580667953105, "rating": 5.0, "text": "Great but where can I get one of the Motobilt hats?", "pics": null, "resp": {"time": 1582580500597, "text": "Search “Hat” on the website\n\nhttps://www.motobilt.com/products?search_api_views_fulltext=Hat+"}, "gmap_id": "0x889293039ac6e833:0x797dde600971c259"}
{"user_id": "108750497058104384728", "name": "Deborah Isler Mercer", "time": 1503781306804, "rating": 5.0, "text": "I just bought my first Jeep and I'm in the process of doing a few things to it. I told Bobby kind of what I was wanting and he showed me several options. I just picked it up this afternoon, it looks awesome!! Great customer service too! 😀", "pics": null, "resp": {"time": 1516026221459, "text": "Thank you for the business.  We are here to assist with anything you may need"}, "gmap_id": "0x889293039ac6e833:0x797dde600971c259"}
{"user_id": "105452462464054648210", "name": "HELIMOTO", "time": 1482464694549, "rating": 5.0, "text": "Outstanding service. They always kept me up to date on my Jeep. They were extremely knowledgeable on Jeeps and what I should expect for certain mods. I'll be back for sure.", "pics": null, "resp": {"time": 1516026170285, "text": "Thank you for the review.  Let us know if we can ever help with anything."}, "gmap_id": "0x889293039ac6e833:0x797dde600971c259"}
{"user_id": "100361319008120660168", "name": "Jeffrey Spellman", "time": 1528848592960, "rating": 5.0, "text": "Customer service is second to none, they go way above and beyond to please the customer. Not to mention their craftsmanship is impeccable.", "pics": null, "resp": {"time": 1582580528765, "text": "Thank you for your business"}, "gmap_id": "0x889293039ac6e833:0x797dde600971c259"}
{"user_id": "114512251085420097850", "name": "Summer Black", "time": 1496199405689, "rating": 5.0, "text": "Great American made products. One of the best around!! Would recommend them to anyone!", "pics": null, "resp": {"time": 1516026241356, "text": "Thanks Summer!!! Let us know if you need anything."}, "gmap_id": "0x889293039ac6e833:0x797dde600971c259"}
