{"user_id": "104492392438110078099", "name": "AL Long", "time": 1620484173836, "rating": 1.0, "text": "Unprofessional and rude.\nIt took 2 hours just for a consultation! I arrived 15 minutes before my appointment with my paperwork already filled out. I waited in a small waiting room with no space between  chairs. When I was finally taken back I had to wait again because none of my info had been entered from the paperwork I brought when I arrived early. This took a while, but when completed, a different tech took me to a different section to check my eyes. She was rude and acted as though I was an inconvenience to her. I finally asked at one point how much longer it would be before I saw the Dr since I had to go back to work. She said it wouldn't be long and she would check on me in 5 minutes after she sent me back to the bright and packed waiting room with no eye protection after dilating my eyes.  About 30 minutes passed and she finally takes me back to another room. I ask again how long it will be because I HAVE to go back to work. She didn't like that but told me he would be in soon. He finally comes in the room and is in there less than 5 minutes to tell me I'm a candidate for lasik. I was also told that I would have to travel to their Columbus office for the surgery because the operating room there wasn't finished.\nMy wait was never acknowledged so of course I never received an apology for the 2 hours it took for a simple consultation. And the whole time I was waiting, the Dr was walking back and forth through the lobby as though he had nothing else to do.\nNot impressed.", "pics": null, "resp": null, "gmap_id": "0x888ced43e59c9777:0x107a2a5c25a859d2"}
{"user_id": "113247273180536074806", "name": "alfonzo murray", "time": 1611196888300, "rating": 1.0, "text": "Hororable appointment,no social distancing,more than one person in very small test rooms.\nWhen I saw doctor he didn’t have mask on and tried too diagnose my condition.\nI told him I was uncomfortable with him not wearing mask he had an off the wall excuse for not wearing one.\nI asked if it was protocol for not wearing mask I got no answer.\nSo ended my appointment then and walked out the door..", "pics": null, "resp": null, "gmap_id": "0x888ced43e59c9777:0x107a2a5c25a859d2"}
{"user_id": "107243283861095988498", "name": "Michael Minor", "time": 1599073265957, "rating": 1.0, "text": "Used this business for 4 years & my fiance broke her glasses recently so I sent her over. Complete disaster of a visit....Was there for a simple eye exam & glasses. The Surgeon pushed Lasik & even made her an appointment for Lasik @ the Columbus location. Not what she was there for at all. The concern for patients is more or less a concern for Money. Lost her business as well as mine today. Couldn't even provide her with disposable protective sunglasses after dilating her eyes before they got her out the door...I MEAN COME ON.", "pics": null, "resp": null, "gmap_id": "0x888ced43e59c9777:0x107a2a5c25a859d2"}
{"user_id": "102795557411169426193", "name": "Daniel Stevens", "time": 1503087815353, "rating": 5.0, "text": "Amazing place to go to! I highly recommend. All of the staff are great, welcoming, and personable! They did an amazing job with my surgery and made sure everything went well! You will not go wrong with this place", "pics": null, "resp": {"time": 1503092988951, "text": "Hi Daniel,\nGlad you are happy with your procedure. We  appreciate the positive review. Thank you!"}, "gmap_id": "0x888ced43e59c9777:0x107a2a5c25a859d2"}
{"user_id": "108275659552655245142", "name": "Randall Ferguson", "time": 1463785824872, "rating": 5.0, "text": "Everyone was friendly, Nice and Professional! They have and open clean enviroment you can't go wrong with these guy's!", "pics": null, "resp": null, "gmap_id": "0x888ced43e59c9777:0x107a2a5c25a859d2"}
{"user_id": "112927523325080331540", "name": "Melissa Heard", "time": 1478187244801, "rating": 5.0, "text": "The DOCTORS ARE \"EXCELLENT\" They explain everything that is going on and the \"DOCTORS\" are very informative!!!!", "pics": null, "resp": null, "gmap_id": "0x888ced43e59c9777:0x107a2a5c25a859d2"}
{"user_id": "105253665245309581595", "name": "Jason Thomas", "time": 1559668472595, "rating": 5.0, "text": "Great doctor, friendly staff", "pics": null, "resp": null, "gmap_id": "0x888ced43e59c9777:0x107a2a5c25a859d2"}
{"user_id": "106961625217758043753", "name": "Lisa Simmons", "time": 1499450966345, "rating": 1.0, "text": "Super unprofessional staff from step 1 -- I called about making an appointment during posted business hours and was told no one was there to schedule that appointment because they \"all left early today\" so no one could help me.", "pics": null, "resp": {"time": 1499456965605, "text": "Thank you for taking the time to share your experience. We appreciate all feedback. This is certainly not how we expect our patients to be assisted. Give us the opportunity to make a superb second impression."}, "gmap_id": "0x888ced43e59c9777:0x107a2a5c25a859d2"}
{"user_id": "107729449734328521274", "name": "Linda Paajanen", "time": 1629738106397, "rating": 5.0, "text": "I can not say enough good things about Dr. Foster and his team.  I had the cataract surgery on both eyes.  My eyesight has been really really bad my whole life. It's like a miracle that I can see without glasses or contacts.  I can now see how to walk in the morning when I wake. Dr Foster is the best.  I recommend him to everyone who needs eye care.  Thank you again Dr. Foster.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "105357937992071408461", "name": "Dennis Bulgatz", "time": 1621557079711, "rating": 5.0, "text": "I am a \"young\" cataract patient at 55, when the average age is 75.  I was pretty nervous about the procedure, though I clearly needed it.  Dr. Stephens was an awesome surgeon, and my result was a pain-free, 20/20, with little fuss.  The office runs like a factory, which can be a little off-putting, but is very efficient, and everyone was very nice- you just do not get a lot of time with your doctor.  I commend the office and Dr. Stephens for running a great practice.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "107609583040672059762", "name": "JP Tribble", "time": 1629141408660, "rating": 5.0, "text": "If you have a problem, let them know, and the practice manager, Tammy, should be able to help.", "pics": null, "resp": {"time": 1628988581565, "text": "Hello, it is always difficult to hear about a bad experience in our office as we are committed to providing our patients with the best possible care. We take these reviews and patient feedback seriously. Due to HIPAA regulations, we can’t discuss the specifics about your comments online, but if you call our office at 256-705-3937 we will be happy to address any concerns."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "114693799344660175939", "name": "Kayla Eckhardt", "time": 1615936011568, "rating": 5.0, "text": "This place is amazing & they are so sweet & well respected & caring for their patients. Doctor Calderwood has done amazing work with my eyes. She has changed my life & gave me more confidence in myself. My EYES are perfect 👌", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "106626061655094801473", "name": "Byron Brown", "time": 1614620039514, "rating": 2.0, "text": "I really like the Doctors in this practice.  They are very thorough and explain what is necessary to  know.  I feel the Doctors especially Dr. Frederick.  However, the front office staff are the cockiest, curt, and far from friendly as any doctor's office in Huntsville.  Makes me want to find a new Doctor just because of the rude office staff.", "pics": null, "resp": {"time": 1614633318595, "text": "Hello, it is always difficult to hear about a bad experience in our office as we are committed to providing our patients with the best possible care. We take these reviews and patient feedback seriously. Due to HIPAA regulations, we can’t discuss the specifics about your comments online, but if you call our office at 256-705-3937 we will be happy to address any concerns."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "101250000289632211880", "name": "Kelly", "time": 1606253241657, "rating": 5.0, "text": "My teenage son & I are both new patients here after having been patients at another practice in Huntsville. We changed to this practice because of negative experiences with contact fittings & education for my son and incorrect glasses for myself at the previous place. We truly love this office and the staff who have helped us. Denise Baldwin, COA, Contact Lens Specialist, in this office was incredible with my teenager! He has never had contacts before and she was very patient and kind with teaching him how to wear and take care of contacts. Our previous office was not so at all. We have had to wait a bit once or twice but not for too terribly long. (Most medical offices in Huntsville have a bit of a wait anyway because we're in need of more physicians.) But our brief wait here was definitely worth it due to the excellent care we received. The physician was quick & efficient, answered all of our questions, and wasted none of our time once we got to him. The front desk staff, although super busy and quite overwhelmed with taking temps and addressing non mask-wearing patients, stayed professional and kind and so did the employee at the checkout desk. We will absolutely continue to be patients here. As a nurse myself I am very particular about my family's and my medical office experiences so if I give a place a 5 star I really mean it.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "117278017687482604939", "name": "Lynn Sparks", "time": 1610230564299, "rating": 5.0, "text": "Dr. Hubickey's staff were so friendly and professional especially during these difficult times.  All were knowledgeable and could answer any question.  The thoroughness taken to determine which procedure was best for me was extensive and my appreciation for going above and beyond to help me make my decision for what was best for me.  Everything explained before, during and after the procedure was spot on so I knew what to expect.  I'm so thankful that I can see without the aid of glasses or contacts.  I just wish I had done it sooner.  Thanks Dr. Hubickey and Staff!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "107668992382558053108", "name": "Lori Hall", "time": 1599680112481, "rating": 5.0, "text": "Fantastic service from everyone I have ever encountered here. I’ve had cataract surgery by Dr. Derivaux and Lasek by Dr. Hubickey. I couldn’t see 1 foot in front of my face beforehand, and now after both surgeries, I do not need glasses for my near-sightedness. It has been a life-changing experience; hard to put into words. I would recommend both doctors 100%. My son recently had Dr. Hubickey perform his Lasek surgery as well, and my son is nothing short of amazed as well. Phenomenal, professional place.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "110693888255447195345", "name": "Mary Moore", "time": 1614638582450, "rating": 1.0, "text": "No stars people and staff hateful did not have time for me had to go back twice glasses still not right and after all of that they losted my co pay and telling me I need to pay the co pay again no way and the optical center made my glasses worng there mistake and I had to pay more money to fix them will never never never go back 😔", "pics": null, "resp": {"time": 1614706445726, "text": "Hello, it is always difficult to hear about a bad experience in our office as we are committed to providing our patients with the best possible care. We take these reviews and patient feedback seriously. Due to HIPAA regulations, we can’t discuss the specifics about your comments online, but if you call our office at 256-705-3937 we will be happy to address any concerns."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "108227167503909790684", "name": "Scott Moss", "time": 1596731748197, "rating": 3.0, "text": "The Doctors are great, the running of the office is a one star. Wife had to wait about an hour and 10 minutes past her appointment time. A person an HOUR late for their appointment was put ahead of her. Don't bother with contacts here, they are ridiculous. I would only recommend this place for eye emergencies or medical issues of the eye. Not any kind of eyeglasses or contacts. Going here though makes me feeling young and in great health.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "106791841688795242189", "name": "Pamela Whitman", "time": 1597239685848, "rating": 5.0, "text": "I am so glad I discovered The Eye Center!  I had been going to Birmingham to see an ophthalmologist for several years that I had been referred to by a now defunct optometrist office. That ophthalmologist just was bilking my Blue Cross and Blue Shield and my vision insurance.  I made an appointment with The Eye Center and was quickly seen by Dr. Frederick who scheduled back to back cataract surgeries and now I only need readers for reading small print.  After all my years of wearing glasses I love being able to just wear  regular sunglasses and OTC readers when I need them!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "104402465345396741388", "name": "Michele Comisky", "time": 1609783757971, "rating": 5.0, "text": "Great practice!  Very organized and friendly. Dr. Hubicky is a very skilled surgeon. He does an excellent Lasik procedure and I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "117590410468242497919", "name": "Derek Huff", "time": 1596660407252, "rating": 5.0, "text": "The staff is super friendly and thorough.  Dr. Foster is very knowledgeable and attentive.  They take great care of my eyes and have my glaucoma under control.  Would definitely recommend to anyone needing professional and courteous care.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "102649100599443551234", "name": "Paula Kraft", "time": 1596635314870, "rating": 5.0, "text": "Before I started working for The Eye Center my daughter was a patient of Dr. Malone since she was about 13 months now she is 13. Have always been professional and answered any concerns I may have had. When she needed to get in the staff was quick to set us up a appointment.Now that I have started working for TEC everyone has been welcoming and so friendly. They care about their patients and the staff. All of the Dr's are friendly and professional so you can't make a wrong choice when deciding who you want to see for your eye care.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "111866537399995923747", "name": "Kristie Smith", "time": 1610136062977, "rating": 1.0, "text": "My son was denied medical care due to him having a both a newborn sibling and a toddler sibling in which the office will not allow to come in due to the “coronavirus”.  I explained to them that we don’t not have any family that are able to keep the siblings while we attend the appointment.  I was told my son would not be allowed to come if the siblings came.  If masks work and we all live in the same household then what is the problem?  No child should be denied medical care under any circumstance.", "pics": null, "resp": {"time": 1610141484619, "text": "Hello, it is always difficult to hear about a bad experience in our office as we are committed to providing our patients with the best possible care. We take these reviews and patient feedback seriously. Due to HIPAA regulations, we can’t discuss the specifics about your comments online, but if you call our office at 256-705-3937 we will be happy to address any concerns."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "109363327383653926677", "name": "Ben Bowden", "time": 1606153614340, "rating": 5.0, "text": "I’ve been going here for years. Glasses, contacts and most recently Lasek surgery. I’ve always had a great experience. Dr. Hubickey is fantastic!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "104927935226561178883", "name": "Justin Nicholson", "time": 1596670668272, "rating": 5.0, "text": "The Eye Center has amazing doctors and staff. Very thorough exams and everyone I encountered was kind and knowledgeable. Would definitely recommend this office for any of your eye care needs.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "111709066283403691236", "name": "Thomas Benn", "time": 1596643125464, "rating": 5.0, "text": "I was very pleased with the care that I received from the staff and physicians at They Eye Center. The outcome resulting from the treatment plan has been spectacular! I also appreciate the attention given to safety and prevention during the pandemic.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "117540868641758165128", "name": "Ashley Michelle", "time": 1606362209014, "rating": 5.0, "text": "I had LASEK back in January and it was the best money I have ever spent. I was \"a little difficult\" and had only a couple of days to get the procedure done due to work, but Dr. Hubickey and his staff (April to name one) were so awesome and did the surgery a couple days after my evaluation.  When I say it was painless, it was!! I had a good recovery too. I also had to call April late one night for eye drops and she did not seem annoyed about the hour that the phone call came in. I never waited more than 15 minutes in the waiting room so I can not agree with the other comments. If you are thinking about getting Lasik, PRK, LASEK, or any other eye procedure done, I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "115745774942892056135", "name": "John Bearden", "time": 1627995103842, "rating": 5.0, "text": "Regarding Dr Hubicky, scroll down. he is an awesome doctor. We did have a little episode regarding my time sitting too long in the waiting room. .. I left. The next morning, a very sweet lady, Tammy Cantrell called, apologized, and explained that a storm had caused a server to go down resulting in equipment not working. By the way: I am very happy with my vision.\nDr. Hubickey was an instrument in the hand of The Lord that changed my life. 1. I had a reoccurring corneal erosion for 2 years.. that was painful and basically killing me because I couldn't sleep. 2. I was near sighted in both eyes. about -3.0 in contact lenses.\nDr. Hubickey did PRK on both eyes. I no longer have corneal erosion and I see really well.\nIn addition, April, Katelyn, and others were very professional and helpful. The only regret is that I waited so long to do it.", "pics": null, "resp": {"time": 1627961518145, "text": "Hello, it is always difficult to hear about a bad experience in our office as we are committed to providing our patients with the best possible care. We take these reviews and patient feedback seriously. Due to HIPAA regulations, we can’t discuss the specifics about your comments online, but if you call our office at 256-705-3937 we will be happy to address any concerns."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "117521711917813596433", "name": "Sylvia P", "time": 1606856529099, "rating": 3.0, "text": "Horrible wait time. Other than that it was an ok experience. Dr. Foster is very nice!", "pics": null, "resp": {"time": 1606858781471, "text": "Hello, it is always difficult to hear about a bad experience in our office as we are committed to providing our patients with the best possible care. We take these reviews and patient feedback seriously. Due to HIPAA regulations, we can’t discuss the specifics about your comments online, but if you call our office at 256-705-3937 we will be happy to address any concerns."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "114251245088332870695", "name": "Sheena S.", "time": 1578018137801, "rating": 5.0, "text": "Dr. Frederick is amazing. Very compassionate doctor and he’s been treating my eye issues for about a year now. Also, the tech. Ms. Penny Is a sweetheart. If I could give this place 10 stars I would. Very professional, polite and caring individuals...", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "102122544515881009493", "name": "Brigitte Komara", "time": 1596635622292, "rating": 5.0, "text": "I’ve had only the best experiences at The Eye Center!  The staff is friendly and extremely knowledgeable. I would definitely highly recommend this place.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "104442133661717850032", "name": "Peter Schmid", "time": 1602519167742, "rating": 1.0, "text": "Not covid safe crowded and do not encourage wait in car when they are behind.   Consistently behind on appointments. GROSSLY!", "pics": null, "resp": {"time": 1602525648434, "text": "Peter - It is always difficult to hear about a bad experience in our office as we are committed to providing our patients with the best possible care. We take these reviews and patient feedback seriously. Due to HIPAA regulations, we can’t discuss the specifics about your comments online, but if you call our office at 256-705-3937 we will be happy to address any concerns."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "111056405689174221015", "name": "Mary Jo Collins", "time": 1596645329007, "rating": 5.0, "text": "Just wan to say thank you to Dr Darren Malone an his office staff for a really great job an also say thank you so much to the surgery center all of theses are in Huntsville Al. So proud of my eyes y'all did such a great job so professional ,friendly an loving couldn't ask for a better place to go .5 stars is not enough in my book it's a 10 thanks again for all of yall may God bless this medical team", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "111868662845493367468", "name": "Kelly Clevenger", "time": 1596634395917, "rating": 5.0, "text": "The staff is so caring and thoughtful so attentive to your needs. I want to say that if you have any problems with your eyes from a scratch or if you want lasik these are the best doctors and staff around.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "109883511165795469106", "name": "James Wright", "time": 1596637350028, "rating": 5.0, "text": "Hi there I love coming here the staff always welcoming, friendly never had to wait long the atmosphere is just amazing I highly recommend the eye center!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "116551811552737571187", "name": "Matt Hudson", "time": 1593711429069, "rating": 1.0, "text": "3.5 hour long wait for the same capability of a regular optometrist. Single doctor facility that is not efficient. Highly advise going elsewhere. Not worth the time or resources.", "pics": null, "resp": {"time": 1593712022801, "text": "Matt - it is always difficult to hear about a bad experience in our office as we are committed to providing our patients with the best possible care. We take these reviews and patient feedback seriously. Due to HIPAA regulations, we can’t discuss the specifics about your comments online, but if you call our office at 256-705-3937 we will be happy to address any concerns."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "116230262092662921394", "name": "RENIKA MOBLEY", "time": 1596635725757, "rating": 5.0, "text": "This place has the best staff they took great care of my dad when he had his eye surgery and with making sure we knew how to do his aftercare", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "114979863549118732779", "name": "Carita Jones", "time": 1596634663726, "rating": 5.0, "text": "The Eye Center has excellent staff they are polite,  caring,  and knowledgeable. The doctors are experienced in the all aspects of the eyes from diseases that can affect your vision and truly want to help their patients have the best vision possible", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "101506045319153761341", "name": "Steven Shaneyfelt", "time": 1596643147694, "rating": 5.0, "text": "Overall the care is extremely thorough. They have the ability to take care of all of my eye care needs and strive to give the best care possible.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "101287986456351187094", "name": "April Towry", "time": 1575831007659, "rating": 5.0, "text": "I love this place. It’s completely worth being dilated for! From pediatrics to eye diseases to LASIK, they will go above and beyond to take care of your eyes! Everyone is so friendly, it is a GREAT experience! Can’t wait for my next eye exam🖤", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "114004077094065609238", "name": "Caroline Hoover", "time": 1596633762187, "rating": 5.0, "text": "The Eye Center is absolutely the best place in North Alabama for eye care.  The doctors are ALL wonderful at what they do and they treat every patient with kindness and compassion and give each of them a thorough examination and give them as much time as they need.  The technicians are all so kind and respectful to their patients, as well as proficient and knowledgeable at their jobs.  I recommend The Eye Center to anyone who is having any kind of problem with their eyes or their vision.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "108905052596651723285", "name": "Karen Duke", "time": 1582663963270, "rating": 5.0, "text": "The welcoming lobby with friendly employees is a good start and gets better. The tech/nurses are very efficient and Dr Stevens is terrific, ready to answer all questions. Excellent experience with only a short wait!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "103748001650315948205", "name": "Jessica Lastname", "time": 1596657643696, "rating": 5.0, "text": "The staff was friendly and nice. I hardly had to wait for my contact or eye exam. Since I went during Covid, everyone had masks on (staff and patients).", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "107740054427738666879", "name": "Kara Woosley", "time": 1597418394289, "rating": 5.0, "text": "There are not enough wonderful things I could say about Dr.Hubickey and his staff! They were all so educated,  patient, knowledgable and helpful for every question I had and every part of my consultation and also surgery ! I would highly reccomend him to anyone considering Lasik eye surgery with no hesitation!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "110325430327517104632", "name": "Linda Haybarker", "time": 1572455480397, "rating": 5.0, "text": "The Eye Center is amazing! This great group of doctors and staff really care about their patients and provide excellent care for your eyes. I have had appointments with several of the doctors and each appointment was thorough and all my questions were answered.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "115045198834390893203", "name": "cassandra broadway", "time": 1596634137880, "rating": 5.0, "text": "All of the doctors here are the best. They treat their patients with the best care and treatment possible. Considering how busy they are, the staff is quick and very efficient. I highly recommend any and all of the doctors here.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "113917474583182645566", "name": "Tonio Koger", "time": 1596674696816, "rating": 5.0, "text": "The family environment here is beyond amazing...to be employed by those that truly care is such a blessing!!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "100704531382105160748", "name": "Shaina Deal", "time": 1572439774407, "rating": 5.0, "text": "The Eye Center is a wonderful place for any eye care needs, these doctors have a fantastic reputation throughout North Alabama and it is well deserved. They are compassionate and thoughtful and the staff is all very polite and kind! I wouldn't hesitate to refer anyone to The Eye Center, my whole family goes there!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "104742625192708000239", "name": "Linsey Woods", "time": 1579900169922, "rating": 3.0, "text": "Alex was wonderful and timely. The exam seems to be extensive which is good. The only downfall for pediatrics is the extensive wait periods and going in and out of the waiting room multiple times, up and downstairs for different testing then being put at the back of the line again once arriving back from testing.  Children do not tolerate excessive wait times very well. Outside of that part seeming very unorganized, it seems to be a thorough exam. Just be prepared to be there for several plus hours would be advice I wished someone had informed me of.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "115840698088004892894", "name": "Lelah Patterson", "time": 1572400969926, "rating": 5.0, "text": "Such a positive environment from all the staff! The doctors are knowledgeable, thorough and always willing to answer any questions. The Eye Center sets a high standard for patient care!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "101246815266368139969", "name": "Meagan Brisendine", "time": 1572377266516, "rating": 5.0, "text": "The doctors are nice and personable! The staff through out the entire office are sweet and will help you in any way they can! I recommend The Eye Center to anyone that is having any kind of vision problems!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "115483014827930923565", "name": "Laurie Guido", "time": 1572378272035, "rating": 5.0, "text": "The Doctors at The Eye Center are the best!  So much experience and expertise in one practice.  I highly recommend The Eye Center physicians, the Optical Shop and Contact Lens Department", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "103219093655142201975", "name": "Bridget Cleghorn", "time": 1596637035498, "rating": 5.0, "text": "Very friendly staff and great doctors. I didn’t feel rushed and all of my concerns were addressed!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "108661985922088306495", "name": "Amber Jones", "time": 1572438942755, "rating": 5.0, "text": "The Eye Center is an amazing practice.  From the moment you call to make the appointment, thru the entire appointment with the staff and Physicians, and then to check out, It is a wonderful experience. Everyone is nice and very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "111859218114800500334", "name": "Abby Cantrell", "time": 1572473695163, "rating": 5.0, "text": "I recently had the most comprehensive eye exam by Dr. Foster! One of the things that impressed me most about the Eye Center was how kind the people were and I feel like I was in really great hands during my entire visit!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "103068565170577207704", "name": "Genie Padilla", "time": 1572369225988, "rating": 5.0, "text": "The staff is amazing and the doctors are wonderful. Everyone is so friendly, thorough, and they really care about your concerns. I definitely recommend them for all of your eye care needs.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "101959178729351028504", "name": "Blair Cain", "time": 1572287511087, "rating": 5.0, "text": "Fantastic doctors and staff that provide excellent care. I would recommend The Eye Center to all friends and family for their eye care!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "101401302157680259602", "name": "Kaitlyn Blansit", "time": 1572368820029, "rating": 5.0, "text": "Highly recommend this office. Everyone is so nice to work with. Love the staff! 💕", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "104639813230861065463", "name": "HZtricks 101", "time": 1572376994369, "rating": 5.0, "text": "I had a great experience at the Eye Center.  The staff is very friendly, efficient and knowledgeable. They doctor was very experienced and I got a very thorough exam.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "111968095291132205414", "name": "Caytlin Hopf", "time": 1571926327709, "rating": 5.0, "text": "The doctors here are very thorough. I feel very confident in knowing that the health of my eyes are in good hands when I am there for my appointments. The staff is knowledgeable and kind as well. I had LASEK done and had an amazing outcome. Would definitely recommend.", "pics": null, "resp": {"time": 1559933272680, "text": "Thank you for the kind words!"}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "110556208979425928264", "name": "Haley Thompson", "time": 1576726232413, "rating": 5.0, "text": "I am 100% pleased with my experience with Dr. Hubickey and his staff at The Eye Center! They were all very kind and helpful in educating me throughout the LASIK process. I am so glad I chose this group of people to perform my procedure and I highly recommend them to anyone seeking out this surgery!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "112504648547353942170", "name": "Ashleigh Hatfield", "time": 1572481115591, "rating": 5.0, "text": "The Eye Center has the best doctors in North Alabama for all your eye care needs. They, as well as their staff,  truly care about each one of their patients!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "112939930908380039088", "name": "Kate Cagle", "time": 1572539053776, "rating": 5.0, "text": "The doctors at The Eye Center are the best! I had LASEK 7 years ago by Dr. Hubickey. It was a great experience! My vision is still 20/20.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "110240733654748989287", "name": "Lisa Romano", "time": 1572451487999, "rating": 5.0, "text": "The EYE CENTER has the best Ophthalmologist in North Alabama, we have all specialties under one roof!!!!! Cornea,Glaucoma,Pediatrics and the 4th floor has retinal specialist. Employees are well trained with the knowledge to help you feel comfortable about your exam. All the physicians are great to work with and treat their patients with compassion and kindness and give the best care and treatment possible. I am proud to be a part of such a great group. Dr.Hubickey is a amazing Lasik surgeon!!!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "114078775790142131430", "name": "Kevin Rebman", "time": 1571259813885, "rating": 4.0, "text": "Helpful staff. Update after several months...... My vision is still perfect thanks to the appreciative doctors and staff.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "102019807721866830713", "name": "Meagan Rodriguez", "time": 1580925723148, "rating": 1.0, "text": "I got here 10 min early and no here we are 2 hours past my appt time and we still havent been seen. This is very unprofessional and rude. They arent busy we are the only ones here.", "pics": null, "resp": {"time": 1580931631389, "text": "Meagan- it is always difficult to hear about a bad experience in our office as we are committed to providing our patients with the best possible care. We take these reviews and patient feedback seriously. Due to HIPAA regulations, we can’t discuss the specifics about your comments online, but if you call our office at 256-705-3937 we will be happy to address any concerns."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "116870617838998801465", "name": "Amanda Drewnowski", "time": 1562935709247, "rating": 5.0, "text": "Dr. Hubickey is a wonderful physician!  He did my LASEK surgery and I recommend anyone I know who is interested in the procedure to have it their surgery with him.  He and his staff are great and extremely knowledgeable!", "pics": null, "resp": {"time": 1562956798602, "text": "Thank you for your kind words!"}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "111312236159326197478", "name": "Jackie Earhart", "time": 1572367897192, "rating": 5.0, "text": "I love the eye center. The staff are wonderful and the doctors are top notch!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "100070505803628906466", "name": "Lonzo Robinson", "time": 1510244831379, "rating": 5.0, "text": "I went to the Madison Office yesterday.  The staff was both friendly and professional.  I went early so there was no wait.  And Dr. Frederick was organized, methodical, and efficient.  He explained the issues and made suggestions to solutions.  Highly recommend.", "pics": null, "resp": {"time": 1541793985831, "text": "Lonzo, thank you for the 5 star review and kind words! We greatly appreciate you taking the time to leave a response."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "106437212333896322537", "name": "Don Coplen", "time": 1504636191946, "rating": 5.0, "text": "I've been going to Dr.Stevens for several years for my glaucoma. The doctor is brilliant! Very professional. It's hard to imagine that I could ever find a better person to manage my vision issues. If I ever do have to find a new glaucoma specialist, I pity that person, because he/she will have some difficult shoes to fill.\n\nAs to some reviews complaining about waits. The waiting time varies, depending on the time of day and the patient load for the day. I have never felt rushed by Dr.Stevens, and that's more important to me than shorter waits in the reception area if those are my two choices. I try to schedule early as possible, which normally results in the shortest waits. This is often true of ANY doctor appointment.", "pics": null, "resp": {"time": 1504638855352, "text": "Don, thank you so much for taking the time to leave a review! We appreciate your positive feedback!"}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "105072547496584833547", "name": "Lindsay Healy", "time": 1563035198793, "rating": 5.0, "text": "I had LASEK surgery with Dr. Hubickey several years ago and it was the best decision ever. I was very nearsighted and my poor vision is a distant memory! Dr. Hubickey is a very thorough physician and takes his time to make sure all the testing meets his high standards. Staff is great too!", "pics": null, "resp": {"time": 1564774041909, "text": "Thank you for the kind words!"}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "117437584788837136667", "name": "Audrey Johnston", "time": 1446238700515, "rating": 5.0, "text": "Most thorough eye exam I have ever experienced. Staff was professional, but still compassionate & caring.  I felt as if I could not have been in better hands or have gotten better care. I am an \"old\" ER RN, I trust Dr. Calderwood & her Staff completely.", "pics": null, "resp": {"time": 1542128358091, "text": "Hi Audrey - Thank you for your feedback!"}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "101878029710900334217", "name": "wes cash", "time": 1562888303186, "rating": 5.0, "text": "Great staff and Dr. Hubickey is a fantastic Dr.  I had LASEK done a couple years ago and it was the best decision I ever made.  I still see great, and am so happy with the procedure.   I recommend Dr. Hubickey and the Eye Center to everyone I know who needs vision correction!", "pics": null, "resp": {"time": 1562956810803, "text": "Thank you for your kind words!"}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "110200458794316723690", "name": "Nick Berry", "time": 1575793659280, "rating": 5.0, "text": "Dr. Stephen's and april towry really brightened my day! Wouldn't let anybody else touch my eyes.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "112301605393562173844", "name": "Donna Patterson", "time": 1536861464930, "rating": 1.0, "text": "The staff is very very unfriendly. No smiles. No hellos. No how is your day after surgery. NOTHING. you're a piece of paper and eyes and that's it.  Been multiple times and never a smile all frowns.😒", "pics": null, "resp": {"time": 1542126760931, "text": "Hi Donna - We appreciate you coming back and visiting us and are so sorry to hear about your experience. At The Eye Center we want you to feel like family and we apologize for you feeling anything other than that! Thank you for your feedback."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "110710344897675989378", "name": "Elizabeth Broadway", "time": 1611586848094, "rating": 5.0, "text": "The staff is so friendly and helpful. The doctors are professional and thorough when giving exams and listen to you when you have concerns.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "116769217857708145741", "name": "Heather Phillips", "time": 1521559511494, "rating": 1.0, "text": "I've been here three times with my young children. There is always a very, very long wait. They schedule multiple appointments per appointment time. Today I waited 40 minutes in the front lobby and walked out because I was tired of waiting. Waiting is hard for little kids and babies and my time is valuable. I will not be back.", "pics": null, "resp": {"time": 1542128054465, "text": "Hi Heather - I am sorry to hear about your experience with us. We are constantly working on providing the highest quality of service and appreciate your feedback."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "116889056326016997888", "name": "Dan Chitwood", "time": 1536702179320, "rating": 1.0, "text": "They may do a good job, but after waiting an hour after my appointment time, I will never know. There was no communication from the front office staff that they were running behind...in fact they left for the day while I was waiting.\nIf you're running behind schedule, then inform your patients before they arrive. My time is my most valuable resource and The Eye Center wasted it.", "pics": null, "resp": {"time": 1542127986256, "text": "Hi Dan - I am sorry to hear about the scheduling and communication issues that arose while you were waiting. We do value your time and apologize for any inconveniences we might have caused you. We are constantly working on providing the highest quality of service and appreciate your feedback."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "105934282562832120315", "name": "Scott Cantrell", "time": 1572613492194, "rating": 5.0, "text": "Great people that really care about helping their patients!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "110338018353757013677", "name": "Amanda Simpson", "time": 1611784377354, "rating": 5.0, "text": "Great place to work.", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "109814117263041363198", "name": "Chrina Serrant", "time": 1500322915664, "rating": 2.0, "text": "The staff are very nice and great with kids but the wait is awful especially when you show up early for your appointment an still your in the waiting room for an extra 45 mins to an hour. Like if your appointment is 2:00 be prepared to be called back about 30-45 later, which if your an on time person it wouldn't make sense to show up early cause you will not get seen on time. It's not fair when you show up on time an you have to wait, then once you get called back it's another waiting game an you wait forever an forever. If you have an appointment here don't have nothing else to do or have to pick anyone else up from work cause you won't get out on time. Especially with a small child they get very restless an irritated, an when they come in to see about your child your child isn't cooperating cause they have waited so long they are tired. Other than that the staff is friendly.", "pics": null, "resp": {"time": 1500324005917, "text": "Hi Chrina,\n\nThank you for taking the time to leave us feedback. We are always looking to improve our processes and provide the best possible care to our patients. We value all feedback and will take the steps needed to address these concerns."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "102253829233834499915", "name": "Robert Moore", "time": 1540928053076, "rating": 1.0, "text": "I have heard good things about Dr Diveraux. The staff however was unfriendly & arrogant. They take digital photos of all patients for \"their charts\". I don't enjoy visiting the DMV & am not about to trust an establishment with the customer no service displayed here.", "pics": null, "resp": {"time": 1542126649863, "text": "Hi Robert - I am so sorry to hear about your experience with us. At The Eye Center we always strive to provide the best quality customer service, but we aren't always perfect. Thank you for your feedback."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "107836477409791101851", "name": "roger curry", "time": 1547071358397, "rating": 1.0, "text": "the eye center charged me 35 bucks when I lost my glasses to get a copy of my prescription. They pretty much suck and hope everyone sees this review.", "pics": null, "resp": {"time": 1559933377534, "text": "It is always difficult to hear about a bad experience in our office as we are committed to providing our patients with the best possible care. We take these reviews and patient feedback seriously. Due to HIPAA regulations, we can’t discuss the specifics about your comments online, but if you call our office at 256-705-3937 we will be happy to address any concerns."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "116201542186029905022", "name": "Max Mitchell", "time": 1460470509913, "rating": 5.0, "text": "Dr. Calderwood and her staff are amazing! They are all extremely helpful, intelligent and organized. The office is also very clean!", "pics": null, "resp": {"time": 1541794154235, "text": "Thank you for the review and kind words, Max!"}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "118348237067488385175", "name": "Chris Carey", "time": 1504885600996, "rating": 5.0, "text": "Dr hubicky seemed very knowledgeable and took care of an eye issue very quickly and staff was friendly. Would recommend", "pics": null, "resp": {"time": 1504887399768, "text": "Thank you for your positive feedback Chris! We appreciate you taking the time to leave a review!"}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "106784726902901743392", "name": "sheila fatemi", "time": 1577463949978, "rating": 1.0, "text": "My husband went to doctor Foster, he wasn’t happy when the doctor wasn’t sure about the diagnosis and he wants him to follow up in less than 48 hours instead of week. My husband thought the doctor is a young inexperienced.", "pics": null, "resp": {"time": 1577991506102, "text": "Shelia, it is always difficult to hear about a bad experience in our office as we are committed to providing our patients with the best possible care. We take these reviews and patient feedback seriously. Due to HIPAA regulations, we can’t discuss the specifics about your comments online, but if you call our office at 256-705-3937 we will be happy to address any concerns."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "104014068888192372730", "name": "Daniel Jewell", "time": 1518822023690, "rating": 2.0, "text": "Don’t make any other plans after your appt. The wait is ridiculous. I understand being busy but 2.5 hours for one appt is absurd. Everyone’s time is valuable not just Doctors.", "pics": null, "resp": {"time": 1542128310153, "text": "Hi Daniel - I am sorry to hear about your experience with us. We apologize the the time delay while you were visiting us. We are constantly working on providing the best quality of customer service and appreciate your feedback."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "112094641725363314696", "name": "Sawsan S Williams", "time": 1480606667588, "rating": 5.0, "text": "Very thorough eye exam for Lasik/Lasek surgery. Staff was very nice and doctor was very patient and welling to answer all questions", "pics": null, "resp": {"time": 1541794044360, "text": "Thank you for the kind review, Sawsan! We greatly appreciate it!"}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "113770116163859328475", "name": "Tammy Cantrell", "time": 1611596498466, "rating": 5.0, "text": "Great doctors and professional staff!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "103095222992776635943", "name": "Queen B", "time": 1479826376838, "rating": 1.0, "text": "This was by far the worst experience my husband or I have ever had at a clinic. We were forwarded here by our pediatrician and i called a month and a half ahead to make our appointment. Our appointment was scheduled for 3:15pm and I showed up at 2:45pm to complete all of the neccessary paperwork. My husband and two kids, 3years and 10months showed up at 3:15. We waited and waited and waited. We were not seen until 4:30 (now mind you their office closes at 5pm). However I constantly see the doctor and her nurses talking and giggling at a computer in the hallway. So after finally being called in the nurse does some little eye tests and dialates my sons eyes. While waiting i spoke with another mother that said her duaghter was there for her appointment at that was at 4pm. We are then sent out to the waiting room and wait another 20min for them to pull us into the room to see the Doctor. So after being called into the room we again waited and waited and waited. We sait in there for 45MIN!!!! Now it is 5:45pm and my two children are hungry, tired and are frustrated at having to look at walls. So we finally looked out of the room to find out that the ENTIRE Office Staff had left and the doctor was in another room with the little girl whose appointment was at 4pm which was after my son's. When the Doctor FINALLY made her appearance she said my son was fine and we could go!!! 3 HOURS to tell us he was fine! Now mind you on the paper work they sent it said to prepare for a 30min appointment! This was by far the WORST experience we have EVER had and will NEVER return! This Staff does not care for its patients or what they have going on and only want your money and to waste your time! If I could rate them NEGATIVE stars I would!", "pics": null, "resp": {"time": 1542128339782, "text": "Hi RB - I am sorry to hear about your experience with us. We apologize the the time delay while you were visiting us. Thank you for your feedback."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "103526370452225656293", "name": "Ellen Cozelos", "time": 1543552022796, "rating": 1.0, "text": "I expect to have a long wait with a doctors' appointment occasionally, emergencies happen.  But this is an eye doctors' clinic!!  How many life or death situations can happen there?   Our appointment was set for 2:30, finally got out  after 5 p.m.!  Talked with other people waiting, 2 to 3 hours is the norm here....less than 5 minutes with the actual doctor.  Luckily, most doctors' offices no longer practice the the art of over booking like they do here.  Donna Patterson nailed it by stating that to the people of the Eye Center, you are only a piece of paper with eyes (or ears)\n\nUpdate:  Again they apologize, yet the complaints keep coming in for the same issues.  Me thinks the \"apologies sound a bit hollow\"", "pics": null, "resp": {"time": 1543509609728, "text": "Hi Ellen - We apologize for your bad experience with us and for the inconvenience your wait may have caused. At The Eye Center, we strive to give you the best customer service and are always striving to do better. Thank you for taking the time to give us your feedback."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "107782482023388402686", "name": "Julia Hall", "time": 1534305937404, "rating": 5.0, "text": "Wonderful staff and great service.", "pics": null, "resp": {"time": 1541793849530, "text": "We thank you for the 5 star review, Julia! We appreciate you taking the time to leave a response!"}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "103934930776023448710", "name": "Jeremy Lawson", "time": 1554852318293, "rating": 1.0, "text": "It's 2019, get a way to pay your bill online!", "pics": null, "resp": {"time": 1554911088369, "text": "We are committed to providing our patients with the best possible care. We take these reviews and patient feedback seriously. Thank you for the suggestion."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "102942475221162042445", "name": "Yolanda Toney", "time": 1564765339740, "rating": 1.0, "text": "Some of the staff is somewhat unprofessional and unwelcoming.", "pics": null, "resp": {"time": 1564774029087, "text": "Yolanda, it is always difficult to hear about a bad experience in our office as we are committed to providing our patients with the best possible care. We take these reviews and patient feedback seriously. Due to HIPAA regulations, we can’t discuss the specifics about your comments online, but if you call our office at 256-705-3937 we will be happy to address any concerns."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "104584346847123572893", "name": "STACEY KUZNIEWSKI", "time": 1572370247346, "rating": 5.0, "text": "The doctor’s go the extra mile!", "pics": null, "resp": null, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "109708850391340345036", "name": "Jake Hicks", "time": 1520282029015, "rating": 1.0, "text": "Took about 3 hours for a regular checkup. Ordered glasses and got the wrong frame and prescription. Unorganized.", "pics": null, "resp": {"time": 1542128268818, "text": "Hi Jacob - I am sorry to hear about your experience with us. We are constantly working on providing the best quality of customer service and appreciate your feedback."}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "105484738541129026305", "name": "Al Yates", "time": 1487614135704, "rating": 5.0, "text": "Always great care...", "pics": null, "resp": {"time": 1499713399862, "text": "Thank you for the feedback. We appreciate you taking the time to let us know how we are doing!"}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "104490994704574156699", "name": "DGS DGS", "time": 1559659463670, "rating": 5.0, "text": "Professional, clean, informative.", "pics": null, "resp": {"time": 1559933225571, "text": "Thank you for the kind words!"}, "gmap_id": "0x88626b51a5eed843:0xb421afa2376ebc2a"}
{"user_id": "107336281134679630008", "name": "everlina hervey", "time": 1445877722768, "rating": 2.0, "text": "My boys order for glasses was  09-10-15. Here it is the last week in October no glasses. The staff response to my questions was \"I am not sure\"  My boys was had to pick out glasses that they really didn't want but need. The last that rendered services to us was not interested in helping us at all.\nMy boyfriend went for glasses they was back within a week or less. However, she rushed him to pick out frames he didn't want. She didn't know the answer to question  nor did she try to find out. She was very pushy as if we was taking up her time. He walked away and we pick out his frames. She tried to get things added on that he didn't need.", "pics": null, "resp": null, "gmap_id": "0x88626bfcbe3e7b17:0x80d7f5a8d3ca1d16"}
{"user_id": "105847324804520415986", "name": "Eric Ibarra", "time": 1451604170761, "rating": 5.0, "text": "The doctor here is great. He is passionate about his work and delivers excellent service.", "pics": null, "resp": null, "gmap_id": "0x88626bfcbe3e7b17:0x80d7f5a8d3ca1d16"}
{"user_id": "104436376689934856523", "name": "jamie Chun", "time": 1374790779954, "rating": 1.0, "text": "I HATE HERE! They will never tell you how much they will charge you before you pay for it. Staff never knows about your insurance. I visited there just for buying contact lense, I got some tests, and they charged me $150...Also, they put some drugs in my eyes(I don't know what it is) and I cannot see close things for more than 30 min. They will not take care about you and explain any information to you. Never visit here. Terrible!", "pics": null, "resp": null, "gmap_id": "0x88626bfcbe3e7b17:0x80d7f5a8d3ca1d16"}
{"user_id": "108197759613734768525", "name": "Scott Harden", "time": 1449196819793, "rating": 4.0, "text": "They have a friendly staff and a good selection of frames.", "pics": null, "resp": null, "gmap_id": "0x88626bfcbe3e7b17:0x80d7f5a8d3ca1d16"}
{"user_id": "102659491159527375798", "name": "Melissa Walker", "time": 1409833366509, "rating": 1.0, "text": "A close friend took her son to Schaeffer recently. Due to his deadbeat dad not paying child support, the child is on Medicaid, and Schaeffer is supposedly one of only two places in Huntsville that offers eye glasses under Medicaid. The little boy was actually excited about getting glasses - about being able to see the board in his 2nd grade classroom. He was excited by all the cool frames he saw on display. When it was his turn to be seen, he and his mother were ushered to a small table, tucked away from the waiting area, with 3 red boxes sitting on top. In those boxes were dirty frames, with only a few sized for boys and not even a mirror to see one's reflection while trying on. The mother humbly asked a clerk if there were any other options for her son and was told \"what you see is what you get\" then dismissed as if her presence were a nuisance. The little boy was forced to pick out a pair of glasses that, although he needs, we're relatively certain he won't wear past the 2nd day he owns them due to the harassment he'll receive from bullies in school. So he won't be able to see the board, and his education and self esteem will suffer. His mother was understandably upset, but what can she do? She already works at least 3 jobs to pay for food and bills. Life can be hard. You do the best you can with what you have.\n\nBut did this mother and child have to be treated like dirt? No. Absolutely not. The behavior of Schaeffer's employee was abhorrent, at best.\n\nI, personally, have a great job with good insurance and can afford not only new glasses every two years, but new prescription sunglasses as well. Where do I go for my glasses? The WalMart vision center on University Drive. The doctor and staff there treat everyone equally well, no matter how they're dressed, how much they make, or what their insurance status is. I know other high-income families that prefer to go there as well.\n\nI will personally spread this story as far and wide as I can. Shame on you, Schaeffer, for treating ANYone like trash, especially an innocent little boy!", "pics": null, "resp": null, "gmap_id": "0x88626bfcbe3e7b17:0x80d7f5a8d3ca1d16"}
{"user_id": "114394819511478316378", "name": "Daniel Marchand", "time": 1374249225118, "rating": 2.0, "text": "This location is very busy, staff isn't as knowledgeable about insurances and what they cover.\n\nI've had issues with canceling/rescheduling appointments, canceled or called to move it when I received the post card, and a few weeks later I get a reminder call again for the appointment that I had changed.\n\nFYI for contact users they charge $75 for a fitting (with insurance), I made the mistake of coming here last year and got sticker shock at the register on the way out - my fault for not asking.  Walmart charges $30, and contacts are contacts are contacts...", "pics": null, "resp": null, "gmap_id": "0x88626bfcbe3e7b17:0x80d7f5a8d3ca1d16"}
{"user_id": "102359128565580489583", "name": "Jessie Crishon", "time": 1441289860797, "rating": 5.0, "text": "Love Dr. Paul!", "pics": null, "resp": null, "gmap_id": "0x88626bfcbe3e7b17:0x80d7f5a8d3ca1d16"}
{"user_id": "116762699932924416974", "name": "Becky Fuller", "time": 1629466251515, "rating": 1.0, "text": "I have always had good service here but yesterday was a different matter. I came in because my newer glasses didn’t work for me. I had an eye exam but when  the doctor(?) came in at the last part, everything he spoke and did was so fast, that I understood nothing. He recommended 2 products for my eyes but didn’t write the names down.  When I left. I got a piece of paper without any explanation or recommendation. I am 73 and not as quick as I used to be. I left feeling like I learned nothing and accomplished nothing.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "115686080869492796898", "name": "Woodward Lamar", "time": 1629239239722, "rating": 5.0, "text": "I arrived early and was received right away.  The staff was friendly and competent.  Dr Swan explained what was going on with my eyes and suggested a follow up appointment.  He answered all my questions.  I was in and out in just over an hour.  Great appointment.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "111490649812583817656", "name": "Anita Kelley", "time": 1629761233457, "rating": 5.0, "text": "Everyone is so nice and helpful and takes time with you.  I feel like I just got the most thorough eye exam I have ever gotten.  Everything is explained and they have patience when you ask a question.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "110977267204077588073", "name": "David Melton", "time": 1630075743804, "rating": 5.0, "text": "I had a nice visit there. Everyone was very helpful. Waiting time was short. Doctor and staff were very nice and informative.\nThanks", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "111240244830022945089", "name": "Theresa Chattman", "time": 1629167023538, "rating": 5.0, "text": "Always happy with Dr. McFaden. He’s very knowledgeable and friendly. The staff is very professional and efficient. Overall a great experience.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "109592976347071003023", "name": "Lynne Stokley", "time": 1628197653723, "rating": 2.0, "text": "After 90 minutes of not being seen by a doctor yet, I asked at the front desk about the time. I told her we’d have to leave in 45 minutes to be somewhere else. She shrugged her shoulders and said let me know if you leave. Really? Staff is not friendly or helpful. Routine eye exam took 2 hours - surely there’s a way to schedule better.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "112579800537368637874", "name": "Abundantly Blessed", "time": 1628382000311, "rating": 4.0, "text": "The entire staff were genuinely nice and professional in getting my problem solved. Thanks for helping me so quickly and efficiently. I am feeling much better.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "101127637606954077949", "name": "Sylvie S", "time": 1628708662406, "rating": 5.0, "text": "I had a great experience during my LASIK screening/consultation. They were efficient and friendly!", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "116179173192187334789", "name": "Rosetta Lovelace", "time": 1628285663561, "rating": 5.0, "text": "Every is professional and friendly.  I enjoyed my visit.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "117851218892922821831", "name": "Carla Meadows", "time": 1628865314502, "rating": 5.0, "text": "MEP is an excellent place for eyecare!", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "107816767508676370333", "name": "Savannah Stone", "time": 1617458806751, "rating": 5.0, "text": "They are AMAZING!! I was so nervous to have the LASIK procedure done but they walked me through absolutely everything and were constantly reassuring. Best procedure experience ever. I can not recommend them enough!! Dr. McFaden and Dr. Shin are the best!", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "116546538117635826914", "name": "Graham McGalliard", "time": 1619531522394, "rating": 5.0, "text": "I’ve been to both Prattville and Sturbridge locations for exams with contacts and glasses in the past. I had LASIK April 22 performed by Dr. Swan and the results have been incredible. I could see drastically better leaving the office 10 minutes after. At my post-op appointment the next day I could see almost 20/15 out of one eye. The other eye does have more irritation and dryness and is improving daily.\n\nDr. McFaden and the rest of the staff have been very helpful and friendly getting my procedure set up and during recovery to help with the irritation and minor swelling.\n\nI look forward to see how my eyes have healed at the 1 week follow-up. I highly recommend LASIK with Montgomery Eye Physicians. It’s been life-changing already.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "112513196799057901548", "name": "Valerie Turner", "time": 1629318108483, "rating": 2.0, "text": "I had to wait a long tome to see the doctor, over 2 hours.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "113763814071954488909", "name": "LInda Johnson", "time": 1629310802000, "rating": 4.0, "text": "Very good and friendly.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "117041069796952070065", "name": "Jenny Griff", "time": 1605543040611, "rating": 1.0, "text": "Took my brother with a disability to office saw Dr. Shin everything started smoothly until he started to examine him. He started yelling to look this way don't blink. I told the doctor he's not deaf and I'm translating no need to yell, well he needs to do want I'm asking. 🤨Really a person with down syndrome can't control the fact that he see's something coming at his eye. He was suppose to take a sample of whatever he had in his eye and the risk was if he moves or blink I could cut his eye. I call our mom and told her the risk and how this doctor acted towards my brother she was not happy nor was I we left but not before I told him that we would find someone that can have the patience and find a different way to do this procedure his response was well the other place you will find a specialist is in Bham and if you don't he will lose his eye. I told him don't worry I have driven to Bham before to take him to doctors and I will make sure he doesn't lose his eye unlike you.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "108148926999754209955", "name": "Sonja Ethridge", "time": 1583373252476, "rating": 5.0, "text": "Very friendly service and doctors will answer all your questions and give you just about all the information you need,  I especially liked that my doctor gave me sample eye drops to try and that I can get them over the counter or by prescription from my primary care provider.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "104052934677220799133", "name": "Shemaiah Campbell", "time": 1584122444138, "rating": 2.0, "text": "Most of seemed really nice. But, I came in March 3rd to order a contact lense. Dr. McFaden gave me a contact lense review. One had gotten broken 2 days beforeand. Dr. McFaden said it was ok to go ahead and order my lense now so I can have it on the way soon and if it needed to be changed they will do that on my regular schedule exam on March 13th. I was told by one of the nurses that the order for my contact was put in and there wasn't a payment for today and that they will call me when it came in. Forward to March 13th when it was time to have a regular full exam, I asked about the order, and then that's when I was told I had to make a full payment first before it was ordered. So what they told me the first time was a straight up LIE. My contact could've almost been here by now if they would've just told me that in first place!! Now I have to go with 1 freaking contact in for another 2 weeks because somebody don't know how to properly do their job!! This really pisses me off and Tiffany always have a rude demeanor.  My problem wasn't paying for the contact upfront! I could've done that March 3rd! It's the lie that I was told about the ordering! It's not fun going longer than what I have to with one contact!", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "106056427010577424479", "name": "Karen Harris", "time": 1564423626992, "rating": 1.0, "text": "When I scheduled my new patient appointment almost 2 months ago, I was adamant that I wanted to be seen by an ophthalmologist.  An appointment was made to see Dr. Mitchell and to also see Dr. McFadden for my contact exam.  Fast forward to today, when I arrived for my appointment, I'm informed that it has been cancelled.  No phone call, text, email...NOTHING!  As a matter of fact, I had to call the week before to confirm my appointment  because I had not received any form of confirmation.  Needless to say, I will not return or recommend this practice to anyone.  I did not appreciate having my appointment cancelled without any just reason and then only to arrive and have the lady at the reception desk continuously trying to get me to see another doctor.", "pics": null, "resp": {"time": 1564429974795, "text": "Karen, we are sorry to hear about your experience today. We are looking into the issue now and will call you shortly to review. Thank you for the feedback."}, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "117285476492956827129", "name": "Stephen Pierce", "time": 1496362585073, "rating": 3.0, "text": "This is my second review.  Plan to spend more than one or two hours there.  The last visit took three hours.  The previous visit Dr. Swan was two and a half hours LATE for my apt.  Next time I will allow a thirty minute wait then leave!", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "117726140986182573933", "name": "Keith Smith", "time": 1507598661866, "rating": 5.0, "text": "Dr. Mcfaden is a great doctor! Very thorough. Highly recommend him to anyone. The staff as a whole is awesome as well!", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "118151372225954810329", "name": "Brandon Stoudenmier", "time": 1533133935179, "rating": 5.0, "text": "The staff was very accommodating over the course of multiple appointments, answered all of my questions, and went above and beyond to assist with LASIK. Greatly appreciated!", "pics": null, "resp": {"time": 1534772181840, "text": "Thank you for the feedback, Brandon! We appreciate you taking the time to let us know about your experience."}, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "109301210742249634683", "name": "Misty Price", "time": 1515242822775, "rating": 5.0, "text": "Friendly staff & short wait time. I had lasik surgery performed here & they did a fantastic job. They were friendly before, during, & after the surgery, which helped tremendously. If you are considering lasik, give them a visit!", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "103406185166514174092", "name": "Cherokee Haynes", "time": 1534543405387, "rating": 3.0, "text": "Service was good but the receptionists were extremely rude and talking about people in front of their faces. Very disrespectful!", "pics": null, "resp": {"time": 1534772148222, "text": "Cherokee, thank you for sending us your feedback. We are sorry to hear we didn't exceed expectations during your visit. This information has been sent to our administrative team so we can make the proper adjustments. Your feedback is important to our practice, and we appreciate you taking the time to let us know about your experience."}, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "107711851460184472700", "name": "Matthew Brown", "time": 1368669720751, "rating": 2.0, "text": "When I showed up for my new patient appointment I was told the Dr. had left sick. That's understandable, but no one could give me an explanation as to why I wasn't called and told this before my appointment time.  I drove across Montgomery just for this appointment.  I was told they would call me to reschedule in the morning. No one called.\nI called them the next day and then I was put on hold and then hung up on.  It's very clear to me they don't need/want new patients. Moving on", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "109137129221092745491", "name": "Dick Martin", "time": 1521336636490, "rating": 1.0, "text": "I had the occasion to have a glaucoma test by Dr Shin which was with a hand held paortable device. It happened to be 10 points higher than a test administered to me days earlier by Dr . Izer.  He wanted to prescribe medication. When I said I just had the test 4 days ago by another doctor, he got very upset and told me there is no reason for me to come back since I saw the other doctor. Apparently he doesn’t like a patient getting a second opinion. He is insecure or threatened by a second opinion, especially when there is such a disparity in the result.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "115968231795772961279", "name": "Karl Smith", "time": 1519397298480, "rating": 2.0, "text": "I had a difficult time trying to find this office even with the GPS feature on my cellphone", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "105463305854057555511", "name": "Amy Mapp", "time": 1456227952688, "rating": 5.0, "text": "Excellent.    Friendly and caring staff", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "109007512367020248140", "name": "Carolyn Cason", "time": 1621898051456, "rating": 1.0, "text": "Went in for cataract surgery and Dr Lee put the wrong Len in. Now I’m so nearsighted in this eye I was better off with the cataract. I do not recommend this dr. He told me things like this just happen. He should ha e looked at my record.", "pics": null, "resp": null, "gmap_id": "0x88628697389e3bf7:0x77891ea281b38650"}
{"user_id": "105551036826714531730", "name": "Ellen Jones", "time": 1617208254364, "rating": 1.0, "text": "The receptionist is rude as hell especially to people of color!", "pics": null, "resp": null, "gmap_id": "0x88628697389e3bf7:0x77891ea281b38650"}
{"user_id": "110632171280231505874", "name": "Jeremy Alexander", "time": 1546615507387, "rating": 5.0, "text": "Dr. Ray Cain did my grandmother's cataract surgery and my great aunts too. He also implanted lenses in the eyes of my grandfather and did a great job! I would recommend him to anyone needing the specialty treatment that he provides!", "pics": null, "resp": null, "gmap_id": "0x88628697389e3bf7:0x77891ea281b38650"}
{"user_id": "106260559051964317294", "name": "Joy Laws", "time": 1553223418677, "rating": 5.0, "text": "I had Lasix last week and I am very pleased with the experience and results. Dr. Lee is the best!", "pics": null, "resp": null, "gmap_id": "0x88628697389e3bf7:0x77891ea281b38650"}
{"user_id": "102280976922240779936", "name": "Katrina williams", "time": 1550586088322, "rating": 1.0, "text": "What a quack. He ruined my sister's eye forever. Her eye cannot be fixed! He also ruined my mother's eye. It cannot be fixed! People beware of Dr. Lee. Also, you have to sign a form before surgery that you can't sue him if he destroys your eyes. He needs to be sued.", "pics": null, "resp": null, "gmap_id": "0x88628697389e3bf7:0x77891ea281b38650"}
{"user_id": "103861704263288480961", "name": "Serena Dotson", "time": 1472370796400, "rating": 5.0, "text": "Awesome Dr...my right eye I had just shadow vision since I was 7...After surgery I can see 20/30..out of it...thank you Dr Lee", "pics": null, "resp": null, "gmap_id": "0x88628697389e3bf7:0x77891ea281b38650"}
{"user_id": "117125999276774312153", "name": "Stephanie", "time": 1535984199991, "rating": 5.0, "text": "Dr. Lee & his entire staff are AWESOME 😎", "pics": null, "resp": null, "gmap_id": "0x88628697389e3bf7:0x77891ea281b38650"}
{"user_id": "112184798112915799108", "name": "Haleigh Anderson", "time": 1627649784697, "rating": 5.0, "text": "I would absolutely recommend this facility to ANYONE! They have turned my father's vision from being almost completely blind back to 100% vision and he is feeling like a new man. We have just had one successful cataract surgery and now awaiting the 2nd one. We're so blessed to have had the professionalism from the entire staff. They were wonderful with their customer service,and his doctor's,nurses,and all staff made us all feel very comfortable before they took him back for surgery. UAB Callahan Eye Hospital is one of the absolute BEST around!", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "109974287548410657399", "name": "D Hardy", "time": 1625377648122, "rating": 2.0, "text": "Came in to the center as a referral. Navigating through the parking garage was a confusing mess as they are working on the elevator service. Arriving to the eye specialist, new patients have to type and scan in their personal information. Arriving at my appointment with the Doctor, they had know idea why I was there. Unprepared staff and office pieced together my referral from my Doctor that I called three different times to confirm the appointment on both ends. 160 mile trip one way. Mostly a complete waste of time. Also with the parking voucher, only pay 5 dollers instead of the normal 20 dollers...Never again.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "103425213154568206384", "name": "Emelle Ramzee", "time": 1623756055691, "rating": 5.0, "text": "Dr Rosenstiel and her staff function like a well-oiled machine--very efficient. They are friendly and seem to genuinely care.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "105463770007828284242", "name": "filthy", "time": 1614560265525, "rating": 5.0, "text": "First i wanna say despite the bad reviews this ended up a great visit. My girlfriend had a problem with her eye for almost 2 weeks . i took her here even though i was iffy about the reviews. the staff was amazing . very welcoming. They assured us that everything would be fine. 3 doctors examined her thoroughly. They really cared and took the time to identify the problem. Highly Recommended.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "114795418579094001019", "name": "sliderman 21", "time": 1618329691617, "rating": 5.0, "text": "My son is a patient of Dr. Read.  I just had to give a shout out to Mrs. Veronica.   She is absolutely amazing and truly cares for her patients.   She has a heart to serve.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "102496705040113395330", "name": "Olla Powell", "time": 1618531008947, "rating": 5.0, "text": "My daughter has Psudotumor Cerebri also known as  IIH and Dr. Tavakoli and his staff took wonderful care of her throughout this.  Dr. Tavakoli saved my daughters vision and she even regained vision that she had previously lost.   He was here for us through it all and went out of his way to help.   His staff was impeccable and I can’t thank them enough. #Heros", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "117604248854332341436", "name": "Cheryl Mosley", "time": 1613526669651, "rating": 5.0, "text": "I love you eye foundation hospital.\nAll of my surgeries were done there since 1973 until present.\nDr.Joiner is Specialist for Glacumoa", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "117171190493851232205", "name": "Lisa Glover", "time": 1608564509441, "rating": 5.0, "text": "The doctor's are extremely knowledgeable and the staff is very friendly. I would recommend this hospital to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "110382879536540008581", "name": "Karen Glover", "time": 1621888993291, "rating": 5.0, "text": "Good care with nice staff", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "116858287179739105572", "name": "Kim Robertson", "time": 1604616281600, "rating": 2.0, "text": "I have been going lions clinic  for years  and I have always loved it but td was horrible and I mean horrible  rudest  dr I have ever seen  they done prob abt 5 min check up  and sent me on my way, it was abt time to close so they  were rushing  me out door would not give me chance to talk   he just kept shutting me down  or telling me he didn't know what to tell me  left so upset cause my eyes r really bad and I am trying to stay on top of things and he was just aweful", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "104317557187780141038", "name": "Mike Curtin", "time": 1598638642954, "rating": 4.0, "text": "They have very Good medical personnel ,go out of there way for ppl", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "105184420434020342111", "name": "Susan Crawley", "time": 1578313853220, "rating": 5.0, "text": "This concerns my husband, he started going to Dr. John Mason, when he started having problems with his right eye, to find out later when he was sent to Dr. Mason, he had a Retina vein ocullison in his eye, also better know as a stroke in his eye!  They have done several treatments to his eye especially this last September he had to have surgery when his eye started bleeding behind the eye, they repaired it through this surgery, he did lose partial sight in his eye when the stroke occurred but they have helped him so much to have a balance in his eye to and his other eye to secure that his sight will remain good! He goes for regular check ups about every four months! I would highly recommend these doctors to anyone that has eye issues beyond your regular eye doctor that you see yearly! I imagine you probably need a referral since they are specialist! Be sure and check with your insurance provider!", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "118361445966017667422", "name": "Julie Lance", "time": 1592754160964, "rating": 1.0, "text": "When to Eye Foundation ER today, on website states open 24/7.  My husband got piece of wood in his eye.  We waited an hour and told no physician was there.  I asked why would they not be physical/ resident to cover ER, they said he was somewhere else and a Resident would be here 20 minutes.  How can run an emergency ER with no physician.  We left untreated.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "111836455157542271584", "name": "Grammy Mejia", "time": 1572463256107, "rating": 4.0, "text": "Awesome place. Had 2 cataract surgeries and Dr. Swanner and staff and surgery were incredibly kind and professional.  The best I have ever been treated!!!", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "106809420568777935835", "name": "Me My", "time": 1580330960033, "rating": 1.0, "text": "Very arrogant and rude doctors and nurses, complete disregard to patient's well-being. It's impossible to find anybody, nobody is answering or returning phone calls, very difficult to have an answer to the simplest basic question. Better to use other hospitals.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "101965683473491171816", "name": "Beth Spitzley", "time": 1539192086304, "rating": 5.0, "text": "Had an amazing experience from the second we walked into the door to the very end as they helped her into the car. The staff was amazingly sweet and very helpful. Definitely the most positive and amazing doctor appointment I have ever experienced since moving back to Alabama.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "108051337680668230077", "name": "Elysia Bailey", "time": 1539189309587, "rating": 5.0, "text": "I have had to bring my mother-in-law to the eye center a fee times. They always make me feel welcome as well. The rooms are very comfortable. Their food is great. I am surprised by the food every time.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "112689215560380043236", "name": "Rachel Vega", "time": 1578343777129, "rating": 5.0, "text": "ER intake ladys were awesome. They help me get my 7 year old son with cornea abrasion seen asap.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "111408073398006813857", "name": "Barbara Wilson", "time": 1538890200314, "rating": 3.0, "text": "Dr was great, explained everything. Staff polite.  Time spent in ER, 11 hrs. Needs improving. Only 1 person in waiting room when I arrived.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "112708610594074732927", "name": "Will Slappey", "time": 1514422568698, "rating": 5.0, "text": "The other day my 16 month old son needed to be seen here. The nurses gave him a stuffed monkey and were so sweet. The doctor that saw William was thorough and communicated well. This was our third experience here in the last three years, and all of our visits have gone well.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "106193572977137979057", "name": "Mary Ladner", "time": 1515576890236, "rating": 5.0, "text": "I just left the emergency room and going in I was skeptical, mainly because I had read the other reviews.  I am so glad I didn't feed into the negativity and decided to judge for myself. Dawn was my nurse and so pleasant and patient with me.  I also was seen by Dr Juan? spelling may be incorrect but also very nice. I learned what my mother had already taught me, never assume you know based on the opinions of others, judge for yourself. Great advice momma R.I.P and thank you. I am still listening :)\n\nAlso the Dr. can really rock a handlebar mustache!", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "113394291096147168590", "name": "George Guilford", "time": 1576123279881, "rating": 1.0, "text": "First impressions are everything in repeat business! I am very disappointed in my \"very short\" visit with Dr. Rosenstiel and staff. (Well I didn't even meet Dr. Rosenstiel???!) Being that I live in Montgomery, I have to request a day off for ALL my eye appointment visits.  I am not new to UAB Callahan Eye Hospital as I've had multiple surgeries within the last three years there. As a matter of fact I just had an appointment there two weeks ago with the incredible Dr. Priscilla Fowler and staff.   I've been diagnosed with Kerataconus and Dr. Priscilla Fowler is my primary eye doctor.  Dr. Fowler and staff are some of the nicest people I've met in the eye care industry. Earlier this year and this past month I received the Cross-Linking  procedure.  I spent over $6000 within the last three years at Callahan eye.  Dr. Fowler and staff treat me with respect on EVERY visit,  yet on December 10 with Dr. Rosenstiel and staff I felt the lesser of.  This visit was scheduled to replace my old sclera lenses with new.  You would think before my arrival they would've did their research on my condition.  Upon my arrival in the room, Dr. Rosenstiel's nurse asked if I ever had sclera lenses?? (I'VE HAD SCLERA CONTACTS FOR THE LAST 6 YEARS??) From there, he goes straight into and I quote, \"before we even see you, you have to pay X amount of dollars!?. Furthermore, he adds, \"The Lenses will be an additional $XXXX.XX amount of dollars to get them?   Now at this point I was feeling as though they did not want to help me as Dr. Fowler and staff did you for the last couple of years.?  Now do mind you I've already spent thousands of dollars to get my eyes corrected.  The money is not an option, but I felt inferior to his demands.  I also wondered have they even looked in my charts from previous visits.? \"Have they even checked my insurance\" I thought to myself?  At that point I asked him a series of questions in terms of verifying my insurances and deductibles. To no avail he says nothing will be covered. Now as I mentioned money would not be a concern as I've spent a lot of money to fix my Eye disease. ( As well as the removal of an tumor in my eyelid two years prior ).  More questions came to mind in this parlay with Dr. Rosenstiel's nurse.  At this point I felt that the nurse is trying to rush me so he leaves then comes back with a business card and prices on it. He then states, \" if you have any questions please call Melissa\" on the business card. I agreed and proceeded to leave. Upon leaving, I felt very embarrassed to even be there. I rushed out and got in my car. I kept thinking to myself \"have they even check my insurance\". So I called my wife, and she confirmed we do have Eye insurance.  I decided I needed to call them back to confirm and verify with them that I have insurance, the same insurance I've used last three years. Two calls later and one left message, I still have not heard from Melissa, Dr. Rosenstiel , or the male nurse that was talking to me. I never even got to meet Dr. Rosenstiel??? I will still come up to visit Dr. Fowler but I will do my business elsewhere in finding new Sclera lenses!\nVery disappointing!!", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "109651150837403887379", "name": "John McDole", "time": 1529345168747, "rating": 5.0, "text": "Whether visiting the Emergency Room or scheduled surgery this is the place to be for anything eye related. Over the years we have never had a problem or bad experience or even an unpleasant encounter. Everyone is very professional. The doctors offices being within the complex make it convenient and the parking deck connects to the complex.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "107809703720848734263", "name": "April Mejia", "time": 1569080510708, "rating": 5.0, "text": "Staff was extremely nice and professional. Amazing doctors and nurses.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "107906207423807495627", "name": "Christy Pierce", "time": 1571509845928, "rating": 5.0, "text": "Awesome atmosphere. Friendly and professional staff. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "100417299333651078966", "name": "Ethan Vaughn", "time": 1569353412524, "rating": 1.0, "text": "I took the day off from work to drive 2.5 hours to take my son here. Apparently the optometrist had to take the day off the day before so she was seeing yesterday's patients as well as todays. Which is fine.\nWhat is not fine is the complete lack of foresight or common courtesy to call today's patients to inform them they may have to wait longer we have been waiting for 2 hours and are looking at atleast another hour wait before our son is seen. This office is a perfect storm of incompetence and disregard for their patients.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "113361947756770335420", "name": "Kevin G", "time": 1552086205818, "rating": 5.0, "text": "Had a major eye injury last week. The nurses and dr quickly relieved my pain and identified the problem quickly. Today I have most of my vision back due to them.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "114188836913162432429", "name": "Glenda Cook", "time": 1583250788383, "rating": 3.0, "text": "Spent time and alot of money on the doctors and prescriptions and with no answer about my eye pain.The doctors and staff were kind but it still didn't help in the end.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "117236138598602940287", "name": "Regina Lavender", "time": 1532719070627, "rating": 5.0, "text": "Best Doctors! Waiting time is cut in half! Diagnosis and exams are private issues. Insurance coverage is acceptable. Lots of parking space. Friendly employees and emergency care is available.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "113629965931340844214", "name": "Dawn Teeters", "time": 1528459619005, "rating": 5.0, "text": "The waiting room here is really nice. Phone charging stations, comfortable seating, large TV's, and a Starbucks coffee machine that unfortunately is not free. $2 for a small coffee", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "116794898271334198442", "name": "Teresa Hill Berry", "time": 1553790117276, "rating": 2.0, "text": "I hope you have better luck than I did. I prefer the clinic on the first floor the Lyons Clinic with Doctor Reid.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "100393139171448119314", "name": "Shawna Gomez", "time": 1522571717355, "rating": 1.0, "text": "Only because I can not put zero as an option! I spoke with a man ,who barely allowed me to even talk, and he kept telling me there's no way my daughter's appointment is there, I still have the letter as proof. My daughter is not even 2 and needs eye surgery badly. Her appointment is scheduled for 4/2/18 but as I said he told me there is no way she has one there.\n\nI have 2 kids they are my world. This issue needs to be resolved. If my daughter doesn't get her surgery because the man I spoke to is incompetent, I'm not going to be a very happy mom and if any of you are parents you'd understand.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "116932230839172833498", "name": "Chris Mahan", "time": 1564339515308, "rating": 5.0, "text": "It is very concentrated on helping people live better, and the medical staff is excellent.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "112911530786085368742", "name": "Miss Un-PC", "time": 1569301683352, "rating": 5.0, "text": "My mom and I were rear ended severely a while back by a young boy more interested in his cell phone than his driving.\nAt first, I didn't notice anything wrong. Later that night, my right eye had a shadow-like film over it. I didn't think anything about it at first. Later that week, I notice my vision was decreasing. I was half blind in my right eye. I went to my eye doctor. After a check-up, he said my retina was partially detached. And, had I waited a week or so longer, I would've have gone permanently blind in that eye. I got an appointment at the Callahan Eye Foundation.\nThe doctors, nurses and receptionist were very nice. The surgeon did a fantastic job reattaching my retina. The only thing that was a bit frustrating was that gas bubble. But, it kept pressure on my retina. Now, my vision in the right eye was like it was before the accident.\nIf you have a problem with your eyes that a regular eye doctor can't treat, then I highly recommend the Callahan Eye Foundation.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "100849225454309508419", "name": "Jay J", "time": 1467988597006, "rating": 1.0, "text": "I wish I could give a minus star. I stopped by here with a rash on my skin near my eye after hours. I was afraid that it might swell up and cause me further issue. They sent me to the ER. I asked could I see someone not in the ER so I would not have to pay so much, but they said no. So I saw a doc in the ER. He looked at my eye and said it was a common rash and said he would give me some antibiotics. He stepped out with the door open and talked to the nurse. I caught them laughing and looking back at me because I came in for a skin rash near my eye.  I believe I was in there for almost 2 hours and I did not see another patient. The lady at the front desk was rude, the staff was rude and even with insurance I still had to pay over $300 .", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "113355802255025407692", "name": "Josie Williams", "time": 1540245738474, "rating": 5.0, "text": "Very knowledgeable about everything i ask never left me wondering i never had any doubt about what was going to happen. Very professional teams", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "101898207450388871825", "name": "M Kennedy", "time": 1482533786787, "rating": 5.0, "text": "They were very nice and took the time to make sure my family got my phone and valuables before surgery. Very caring people.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "106579398329696991159", "name": "Andy Pesterfield", "time": 1489883158613, "rating": 1.0, "text": "Do not take your child here.  You can get the exact same care at children's hospital.  1)they use the same doctors 2) children's hospital has a lot more respect your time.  I've been to both....The eye clinic time was RIDICULOUS,  2) children's accepts more insurance providers like medishare.\n\nI spent a lot more money a LOT more time, and less customer service.\n\nThey couldn't even call in our prescription after being there for 5 hours!!!!!!\n\nWaited one hour for the nurse to come back with our prescription.  No call for that.\n\nVery disappointed.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "117150360082787545295", "name": "Sherry Ellis", "time": 1438039679503, "rating": 1.0, "text": "My daughter went to the ER there. He eye was red and she couldn't see threw it. The docs there said there was a white spot on her cornea but they didn't know what it was. Instead off calling in an attending doctor they sent her home work gel drops and told her to make appt with cornea doc the next week. She went in on weekend. Turns out she had a bad corneal infection.  For this I have to pay $100 copay didn't even treat her at all", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "102203860270172496063", "name": "Yolanda Scott", "time": 1464320611043, "rating": 5.0, "text": "My son had to have emergency eye surgery. Everyone was patience. By he grace of GOD, they decided to do a catscan and found tumors Iwould not have known about. Caring staff! My son has another surgery in the morning. I know he is in good hands.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "110778642645137495680", "name": "B Flows", "time": 1492752065882, "rating": 5.0, "text": "Everything was done as soon as possible when problems arose. Tried new dry eye alternative to help with eye drops and night lube. Thanking​ the community eye professional and staff. State of the art.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "103641379577235741133", "name": "Dani Perry", "time": 1454975906527, "rating": 1.0, "text": "Very rude and uninformed staff!!! When I made a appointment, the rep said my insurance was accepted. However, when I got there they said they only accepted VSP. I have the Federal Employees Program Vision insurance. When I showed them the Federal Vision Website listed them as providers, they told me it was wrong and the only insurance they took was VSP. So I went all the way down there and took off work for nothing! How does the biggest eye hospital in Birmingham, not accept federal insurance? Sounds fishy to me! Then they wanted me to pay $15 to park! Absolutely not!", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "102564257412115668337", "name": "Myah Phillips", "time": 1513967984787, "rating": 2.0, "text": "Horrible experience. Unfriendly staff. Extremely long wait and when you finally see someone they rush you and don’t take the time to really talk to you and explain anything.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "104580524240031639217", "name": "Tamara Hicks", "time": 1521925167308, "rating": 1.0, "text": "Extremely long wait for an \"ER\". staff is incredibly RUDE.  ZERO sense of urgency to treat patients!", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "103171469217405673144", "name": "Marcia Larson", "time": 1474294681426, "rating": 1.0, "text": "doctors were thorough, kind and personable while female members of staff at desk were very rude, condescending, overbearing - can't find enough adjectives to fully describe how they made me feel and also my family when they got there.  Not nice people in fact creepy", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "114237612115707589544", "name": "Queen railyn", "time": 1540148058373, "rating": 5.0, "text": "When you have eye trouble best place too go", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "118225675005029244876", "name": "Dusty Whitt", "time": 1532365211132, "rating": 5.0, "text": "I have keratocotus in my left eye for a couple years it's a condition we're the cornea has changed shape or has wore down the staff which cause your vision to only be corrected with a special made lense to fit your eye ,eye glasses nore regular contacts can fix this condition the  Dr and staff we're very polite and we're able to determine my condition and fit for one of these lense so after 2 yes of being blind in my left eye I can finally see again with the lense although I have learned of a proceedure called cornea cross link that can permanently fix my condition I am hoping to talk too the Dr about and have it done thank you UAB Callahan Hospital", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "114190130537220767166", "name": "Jeannie wright", "time": 1537981558452, "rating": 5.0, "text": "A wonderful place to work. One of very few Eye only hospitals in the US. One of two Eye only ERs in the US. Gold standard for Eye care.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "117348108561529782736", "name": "Luai Najim", "time": 1537450854153, "rating": 5.0, "text": "Professional service.  Excellent staff.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "108713015431419266837", "name": "Anniegg Howell", "time": 1453754329125, "rating": 1.0, "text": "Everyone was so nice and kind to my sister. She was the one that had surgery. They kept me updated on her progress.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "110199503438290573798", "name": "Rob D.", "time": 1578324064031, "rating": 5.0, "text": "Dr. Frazier is excellent!", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "107961834848792857913", "name": "J G", "time": 1517575669391, "rating": 5.0, "text": "The staff here is amazing! My husband has eye issues and we have been treated very well here by all of the Doctor's and staff.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMlzLZwiKovUphcKJ3bXZXxNHhubRh-xZJyN7xF=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "103866346824047118290", "name": "Nancy Hughes", "time": 1518996694827, "rating": 5.0, "text": "This facility was upscaled&Hi_tech professional from word GO.from Kay,calling to set-up surgery.To:Marge in recovery,Cynthia&Elizabeth,Pre-op with R.O..Brittney frontline receptionist Terry,Ashley upon arriving&departing.Dr.Bains extra extrodinary you all excelled&succeed the extra mile in care top quality May you all be richly blessed always.Thank You for the care you gave&showed to me&my Mother with forever grateful heart love you all!!!🌟🌟🌟🌟🌟", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "100269086341754271959", "name": "Amy Millette", "time": 1507888746425, "rating": 1.0, "text": "1 doctor and 1 nurse in emergency department, trauma emergency came in right before we were to be discharged, we could not be discharged until they were done with the trauma. Completely ridiculous.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "106679891537229808398", "name": "Alex Farris", "time": 1531832385384, "rating": 5.0, "text": "Great place to see the best eye doctors in the region", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "117606748136695482677", "name": "Bert Bloomston", "time": 1425680275353, "rating": 5.0, "text": "I was extremely pleased with the  personal care and attention provided me when I arrived at CEH. I arrived a few minutes prior to the appointed time and waited just a short time prior to be taken to a bed where I was prepped for my cataract surgery. I honestly did not have the feeling that I was in a medical facility, but a facility designed  for the extreme care and concern for a person. All of us, I believe, have anxiety prior to a surgical procedure, however the staff made me feel comfortable and relaxed. I took special note that Mr. Sprayberry was on the floor chatting with the patients and the staff. That is certainly a rarity in today's world of medicine and certainly could not be found in many or any facility today. Also, I learned that there was patient advocate on the floor.\nCongratulations to all and to Dr. Sara Mullins for the outstanding treatment and personal attention. Your hospital is way above just first class.\nThank you again and I told many of my friends about your outstanding service and personal care.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "108203394496014757417", "name": "jesse anderson", "time": 1493603939527, "rating": 5.0, "text": "Didn't  have  today wait  long  for  appointment   and  was very  impressed  by the way I was treated  and care for  while I was there. Staff  was very  helpful and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "102787951960613070722", "name": "Chantil Nasef", "time": 1502232101879, "rating": 1.0, "text": "Very nice nurses and doctors, however the hospital board and administrator Brian Sprayberry(sp) are very irresponsible and inconsiderate just to save money. Closed down 7 out of 9 operating rooms. Arrived 15mins early for my appointment. Ended up leaving after 6 hours of waiting with other patients still ahead of me waiting for surgery!", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "116239100778843059914", "name": "Kimberly Frost Barry", "time": 1565002388074, "rating": 1.0, "text": "This is for the parking at the hospital. Don't bother bringing a stroller for your children. Not every floor has a ramp to get in the building. It was very difficult lifting our double stroller up four stairs on Friday.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "109305359497836373261", "name": "Teresa Paquelet-Brown", "time": 1491248195109, "rating": 5.0, "text": "We are Montanans, visiting our daughter at U of AL in Tuscaloosa, when my husband had a partially detached, torn retina, that required a 1 hour drive and emergency surgery at Callahan. From the staff at the front desk, to the surgery nurses, and the entire surgery staff, I couldn't be more thankful! we received top notch care and customer service! Thank you! We are so fortunate for the outstanding care we received there! Thanks to Dr's. Sapp, Tabakoli,  NRSA McMullen,  Nurse Alice, Terry ( family aid) and anyone else I may have missed or whose name is misspelled!", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "109203262903864022482", "name": "Laura Jackson", "time": 1461341019894, "rating": 1.0, "text": "Great Doctors! Horrible Optical Shop!!! Waited  2months for glasses! The family just goes next door to UAB eye care for the glasses.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "106549464508749607807", "name": "Sharon Vasser", "time": 1571421493042, "rating": 1.0, "text": "Saw an eye Dr there who misdiagnosed my eye problem and now suffer vision loss.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "117596683619735780713", "name": "Deilia Hodgman (SandraDee)", "time": 1523464626130, "rating": 4.0, "text": "they were very sensitive to my mothers feelings and concerns", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "108863111382253544356", "name": "Robin Acre", "time": 1454444923269, "rating": 1.0, "text": "I went to the free Lion's clinic and I got a bill for $30.00 from them. They didn't even give me a prescription for glasses, but they said the fee was for the REFRACTION!!!", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "107314358995554574865", "name": "Gerardo Hernandez", "time": 1498439953380, "rating": 4.0, "text": "Some of the best ophthalmology physicians in the Southeast", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "104500439359643009265", "name": "Steve Hines", "time": 1497886380409, "rating": 1.0, "text": "Went to Ashley Dahl for eye exam.  Receptionist wouldn't speak until I got her attention. Waited forever and asked when I would go back and she said \"I only put the charts back there\". Bad experience for sure and I ended up leaving before even getting seen.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "102266905897000585533", "name": "Laura Whiting", "time": 1524185451890, "rating": 5.0, "text": "Very caring, qualified staff.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "102810121419999485049", "name": "Keyandrea Varner", "time": 1522849886426, "rating": 4.0, "text": "A lot of people don't know that they have a eye emergency.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "118078438045310432421", "name": "DIPYO Much", "time": 1536173759033, "rating": 2.0, "text": "The VA side is a nasty 3rd world style clinic", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "105887747131148157547", "name": "Christian Harris Flynn", "time": 1471116043827, "rating": 5.0, "text": "I love Dr V!", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "116696058602894741818", "name": "Sylvia Jemison", "time": 1520120424532, "rating": 2.0, "text": "I myself will never come here again.   I came to this location in 2015.  Was not pleased.   I am here now march 2018 and it is no better.  I have been here over 3 hours.   Mind you this is emergency!  I was the only person here and i was told to sit and wait.  After 20 minutes I asked how much longer.  I was called up 10 minutes later.  Put in room for 40 minutes.   Doctor finally came in.  I have and and am still sitting in room after doctor and this had been over 45 minutes.  Why?  I was only patient here.  No matter.  No more money from me.", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "112615976961212040385", "name": "BRADLEY VICKERS", "time": 1536090385712, "rating": 3.0, "text": "No one wants or likes going to a doctor,but if you need eye Care there's no better place", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "102021520350217895102", "name": "Christine Gibson", "time": 1528809240569, "rating": 5.0, "text": "Professional, Great Service & Clean", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "103497510540998458842", "name": "Scotty Blevins", "time": 1536586008664, "rating": 5.0, "text": "Professional courteous knowledgeable", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "112222436559275389497", "name": "Alexia Martin", "time": 1523279136357, "rating": 5.0, "text": "They're wonderful", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "114693176789237134429", "name": "Greg Smith", "time": 1521655945397, "rating": 5.0, "text": "Only 24hr eye hospital in the south", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "106890949766494997369", "name": "Nate Dunham", "time": 1438736471277, "rating": 1.0, "text": "Rude customer service!", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "116050365715546698400", "name": "Terry Priest", "time": 1426079507478, "rating": 5.0, "text": "EXCELLENT", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "112226203090500962281", "name": "Bennie Hale", "time": 1516970171385, "rating": 5.0, "text": "(Translated by Google) Top notch petsonnel\n\n(Original)\nTop notch petsonnel", "pics": null, "resp": null, "gmap_id": "0x88891bea1d7b458b:0x2741eb9855e3054"}
{"user_id": "102575898443385233052", "name": "Jim Hennessey", "time": 1615563200969, "rating": 1.0, "text": "Arrived for my appointment, lobby was empty. The woman at the counter shouted across the room that we needed to wait and she would get with us (me and my wife).\n\nShe then shouted across the room about who our insurance carrier was? My wife provided that information and the lobby “boss” we’ll call her because that is the nicest I can describe her attitude.\n\nThe Lobby boss then shouted we don’t accept that, my wife replied “yes, you do” my wife checked before making our appointment. The lobby boss then made us shout our  SSI numbers across the room so she could check. Violation of our privacy.\n\nLobby boss then ordered us to adjust our masks as they did not meet with her approval. Shortly thereafter the “lobby boss” then got into my wife’s personal space and the ordered here to replace her mask as it did not meet with the “lobby boss’s” approval.\n\nAt that point my spouse and  I elected to leave. We were going to have vision checks, buy glasses, purchase contacts and have lenses replaced buy two pairs of glasses. That was conservatively a $1,000.00 bill.\n\nGetting into paying customers personal space, treating them rudely, treating personal private information without care is unacceptable.\n\nAvoid this place at all costs.", "pics": null, "resp": {"time": 1615572728099, "text": "I apologize for your experience in our office.  We strive for excellent customer service.  Thank you for your feedback.  I will address these issues with our staff.  Please feel free to call me 205-949-2020 Tammy G."}, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "108119387158972902061", "name": "Mike Campbell", "time": 1621331459630, "rating": 3.0, "text": "Pros - great doctors and staff, polite and knowledgeable.  Excellent quality glasses (except for cons, see below)\nCons - I'm 61, worn glasses most of my life, and have had various coatings. These coating have never come off, not once.  It's happened with both sets of lenses from Vision First.  Now I just have annoying streaks across my lenses.  Don't know if I can get a pair without the coating because I can never get through to a real person and never a person from the Pell City clinic.  I've left messages but to no avail.  Very disappointed.\nUPDATE Apr 2021 - Went back for an exam and received the same excellent service.  They're just really good.  I also learned that the coating was an anti-glare coating that was coming off.  5 stars for the staff.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "109754142957604347065", "name": "Sondra Epperson", "time": 1579628727439, "rating": 5.0, "text": "Super easy to make an appointment. Great friendly staff. High tech equipment. Knowledgeable and cost effective. Works with Medicare and most insurance plans.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "118326678612195774067", "name": "Timothy Fulton", "time": 1558140007426, "rating": 5.0, "text": "It was an amazing experience. Lori is very polite and very thorough she made sure I got the perfect fit for my contacts. Definitely recommend going there", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "115332321543257822988", "name": "Jake Mollus", "time": 1544516205156, "rating": 5.0, "text": "The Doctor and staff are incredible. You can genuinely tell they have your best interest in mind. The staff friendly and helpful. I would highly recommend their office to anybody.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "111003603472686916090", "name": "Tyler Tidwell", "time": 1548170837321, "rating": 5.0, "text": "I chose this eye center because of the reviews on Google and I'm glad that I did! All of the staff was great and Dr. Clark explained everything to me in a way I could understand it. I highly recommend this facility!", "pics": null, "resp": {"time": 1548174085847, "text": "Thank you for choosing VisionFirst!"}, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "100141199844103596378", "name": "Tina Gann Fuller", "time": 1457992678908, "rating": 5.0, "text": "My husband and I are very pleased after our visit to Dr Clark's in Pell City office.  She and her staff were very professional and friendly.  I always need help picking out new frames and the lady that ordered them was extremely helpful and very patient with me as I probably tried on every pair in the office.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "103172286497919696286", "name": "John Kiker", "time": 1537472829364, "rating": 1.0, "text": "Treated my daughter in law as if she was a dead beat. ACTUALLY HAD GUTS ENOUGH TO PUT  SCOTCH TAPE ON GLASSES AND SAID IT'LL DO FOR NOW.\nOK ALL BECAUSE MY DAUGHTER IN LAW HAD MEDICAID.......\nAND BY THE WAY........\nIT WAS FOR MY 3 YEAR OLD GRANDAUGHTER....", "pics": null, "resp": {"time": 1538156236413, "text": "Sorry to hear about your experience in the office.  I did try to reach you or the contact that was giving to me but I was unsuccessful the day of your visit to the office.  If we can farther assist you please contact Vu Quang @ 205-949-2020"}, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "112981854608961843456", "name": "Karen Petersen", "time": 1456419867200, "rating": 5.0, "text": "I had an appointment with Dr. Clark for a blocked/infected tear duct & was so nervous that it would require surgery (doesn't look good on YouTube).  Everyone from the nurse to Dr. Clark was so very friendly & they answered all of my crazy questions.  I was reassured I was on the right track with the antibiotics & would not need surgery.  I felt very comforted & taken care of.  Thank you guys so much for the positive experience!\nK. Petersen", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "117697221363373854444", "name": "Joanie Killingsworth", "time": 1456955666231, "rating": 5.0, "text": "My 8 y.o. son and I both saw Dr. Clark in the Pell City office.  Wait time for appt., was 2 days.  Everyone in the office from front desk to Dr. Clark, amazingly friendly and very helpful..\nWe will continue seeing Dr. Clark.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "100283410438867218743", "name": "Brittany Sullivan", "time": 1466120923223, "rating": 4.0, "text": "First time going there, had to wait over an hour before I was seen but the staff was nice and took care of my vision needs.", "pics": null, "resp": {"time": 1466168007669, "text": "Brittany thank you for the review. We are glad you enjoyed your visit. However, we apologize for the long wait."}, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "113797861282849570283", "name": "Sandy Lawrence", "time": 1458748336935, "rating": 5.0, "text": "Great doctor and staff. They made me feel very much at ease.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "105709475249706143257", "name": "Randall Cox", "time": 1456446423886, "rating": 5.0, "text": "The doctor  was excellent and I was in and out in a hurry.  The staff was friendly and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "112551397185022632913", "name": "Leanne Etheridge", "time": 1456420334083, "rating": 5.0, "text": "Dr. Clark and her staff were courteous and professional. I would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "112729659746247947817", "name": "Jo Nell Powell", "time": 1456414106692, "rating": 4.0, "text": "Very friendly and helpful. Plan to return when needed", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "116613719331489469845", "name": "Sheri Williams", "time": 1456427174458, "rating": 5.0, "text": "The perfect combination of efficiency, expertise,  and caring", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "117780166433973214124", "name": "Sam Marquez", "time": 1623680817529, "rating": 5.0, "text": "Great experience here. My vision is basically perfect at this point. Great doctor, service, very professional. Would recommend!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "104134301324879604800", "name": "Bill", "time": 1579794922773, "rating": 5.0, "text": "Great experience from the initial consultation, surgery, and follow-up exams. Personable care which you may not find at the larger Lasik chains. Pro tip...tie your post op discs together with a shoelace. Easier and more comfortable than tape.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPmYx7XUfx_N1Z198CGiqAGDbszqcvzxM0TOL35=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "106314843145601547094", "name": "Joanna Bishop", "time": 1620401283660, "rating": 5.0, "text": "I was very impressed by the professional service and care. They took the time to thoroughly explain the LASIK procedure, recovery, care and expected results beforehand.  Dr. Jennifer Michelson also walked me through each step during the painless procedure which put me at ease.  The surgery took less than 15 minutes, and the downtime was minimal.\n\nI highly recommend them!  I'm enjoying my improved vision without contacts and glasses!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "117491150389127677245", "name": "Kristin Hankey", "time": 1618842602253, "rating": 5.0, "text": "I just had Laser Eye Surgery recently & I couldn't be more happier with my results. Dr. Michelson & the entire staff were extremely helpful & friendly. It goes a long way when you have the \"Best\" Eye Doctor & staff in the state of Alabama. 5 STARS from one happy patient!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "116000635281571451423", "name": "john underwood", "time": 1621620489151, "rating": 5.0, "text": "I was blind, but now I see!\n\nWhat a life-changing experience. Everyone was extremely knowledgeable about the LASIK procedure and gave multiple tips and suggestions for before, during, and after the surgery. Also, do not let me forget to mention the beautiful women of Michelson Laser Vision. Mandy and Laren are easy on the eyes (pun intended) as well as amazingly helpful and professional. I would recommend Michelson Laser Vision to ANYONE looking to see the world in a new way!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "103158040441731109648", "name": "Kyle Lynch", "time": 1624332629227, "rating": 5.0, "text": "I had a very good experience getting my corrective surgery here. I received PRK surgery rather than Lasik because of my dry eyes, and Jennifer and the nurses/staff did such a wonderful job. I definitely recommend you get your procedure here.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "100567804766967459895", "name": "Sarah White", "time": 1605310091665, "rating": 5.0, "text": "I had previously accompanied my husband to his eye appointment at this office and witnessed a very warm and welcoming environment. This is what led me to decide on having my own eyes taken care of here. My experience has been excellent. Everybody was friendly and made me feel well cared for. The process was thoroughly explained to me in a way that I could easily understand. The procedure was completed with swift precision. I am very happy with my results. I highly recommend Michelson Laser Vision to all of my friends, family, and anyone in need of corrective eye surgery.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "117795765756120164275", "name": "jim myers", "time": 1613754990356, "rating": 5.0, "text": "Was very, very pleased with the entire staff and Dr. Jennifer.  Very professional, very thorough and presented me with very clear options as to improving my vision.  I would highly recommend you schedule an appointment with these folks if you are considering laser vision surgery or for an eye exam in general.  Great experience.  An 11 on a scale of 10!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "107007438922560526189", "name": "Lana Robinson", "time": 1605049230920, "rating": 5.0, "text": "I’ve worn glasses since the 2nd grade and, at the age of 50, decided it was time to look into laser vision correction because my eyesight was getting progressively worse. I hadn’t been able to wear contacts for 10 years due to some previous eye problems, and I had really dry eyes. I selected Michelson Laser Vision because he is well-known and respected in laser vision correction. Dr. Marc Michelson spent a lot of time with me before the surgery evaluating the best way to proceed and explained the process and what I could expect after surgery. The surgery was over quickly, and I could see at great distances for the first time in my life! Over the next few days, my vision improved drastically. It’s now been 9 months since my surgery and I can honestly say that having laser surgery on my eyes is the best decision I’ve made! The entire staff is invested in making sure you have a great experience and great eyesight! I feel like I’ve gotten a part of my life back.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "101636648643375102148", "name": "Josh Kelley", "time": 1600448910404, "rating": 5.0, "text": "Dr. Michelson and her staff are the definition of professional and efficient. Don’t go see them expecting to spend the day. They have this down to a science. You will be in and out in the blink of an eye(see what I did there??). They are not only fast they are precise. Their dedication to excellence shines through the entire procedure. From the screening to the scheduling to the pre op and the post op. This crews knows what they are doing and is second to none. I’m kicking myself for not doing this sooner.\n\nAs far as the actual procedure goes, imagine walking into a room without being able to see anything and then 15 minutes later you can read the clock on the wall!! That’s literally the exact experience I had. I can’t recommend them enough. Don’t tell them I said this but knowing what I know now, I would have paid double.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "111450199886305741338", "name": "Bryan Knox", "time": 1610131371191, "rating": 5.0, "text": "Top notch professional service and care. Put me completely at ease and thoroughly explained the procedure, care, recovery and expected results. I highly recommend them and would do it again!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "101520745681047806470", "name": "Leah Gentry", "time": 1611068972660, "rating": 5.0, "text": "So thankful for my  PRK laser surgery. Dr. Michelson and his staff are awesome! Have the perfect vision i have always wanted! Great experience!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "109191269838461974113", "name": "Jake Campbell", "time": 1614611213157, "rating": 5.0, "text": "I Can See! I was legally blind and now I can see!  No Pain, Very Professional and phenomenal follow up!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "117210216443706952525", "name": "Brad Milner", "time": 1617298040891, "rating": 5.0, "text": "Loved Mr. Michelson.  He put me at ease.  I can see again!!!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "104197991841682247676", "name": "Rachel Johns", "time": 1612541035300, "rating": 5.0, "text": "I had thought about having a vision correction procedure for many years. When I finally built up enough courage to do it, I saw Jennifer Michelson MD and her team. Dr. Michelson and her team were very thorough. I ended up having PRK due to some abnormal scans. However, Dr. Michelson did several evaluations over a few months before making the recommendation for PRK instead of the LASIK. She did a wonderful job explaining the procedure, differences, and risks/benefits of each. She even came in to clinic on a Sunday to see me after surgery. From the time you check in to the time you check out, you will encounter happy smiling faces. I enjoyed my experience. I now can see 20/15 without any corrective lenses. I would highly recommend anyone to Dr. Michelson and her team.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "114748479050444292718", "name": "Rod Epperson", "time": 1605020319003, "rating": 5.0, "text": "Awesome staff ....Dr Michaelson is great I had lasic In march they did very extensive eye exams to get the right correction for my procedure ..  After my procedure I went home took a 2 HR nap and when I awoke my world had changed i could read small print i could see far away it was amazing everything looked so crisp..  By far the best money i have ever spent in my life...  It took me about 2 weeks to get out of the habit of reaching for glasses every time I got ready to read something..   Its been 8 months and life is great", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "112272385417939662126", "name": "Rivera Wheeler", "time": 1610131658340, "rating": 5.0, "text": "Dr. Marc Michelson and his staff are excellent and very professional and show care in their patients. I just had my Lasik Surgery done this past Wednesday morning and it was definitely a great procedure and the work was professional and handled with delicate care. I saw perfect vision the following day and now I’m seeing my best vision I’ve ever had living on this earth. I’m going to say this and it’s not me being overrating but Dr. Marc Michelson is the best doctor for the Lasik Surgery in the state of Alabama. I came all the way from Mobile,Al from start to finish and it was worth the time and efforts I put into investing in having the best doctor to preform the surgery and caring his staff gave me. Trust me you won’t be disappointed. I’d give 100 stars but Google won’t let me. Thanks Dr Marc Michelson and your professional caring staff. Don’t put it off if you seeking Lasik Surgery he is the answer.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "112970689749207460229", "name": "Mark Anderson", "time": 1614895911152, "rating": 5.0, "text": "Great staff! Very well organized operation.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "112117951187025834709", "name": "Greg Doss", "time": 1610760405009, "rating": 5.0, "text": "I have worn glasses for many years with terrible distance vision. I had LASIK and now my only regret is that I just wish I would have done it so much sooner! I went from 20/200 uncorrected vision to 20/25 day one post op! Both Dr Marc Michelson and Dr Jennifer Michelson were great, along with the staff! Definitely the place to go and doo ok it sooner rather than later!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "106944474197339866540", "name": "Nadine Jones", "time": 1591357768010, "rating": 5.0, "text": "I love me some Dr. Michelson.  He is professional and an excellent physician.  His staff is awesome.  I can see! I had LASIK surgery a week ago.  I can see things that I have not seen without glasses in years.  If I could give them 10 stars I would.  Hurry and schedule your appointment.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "110892948932866688932", "name": "Madison Damazio", "time": 1602783821879, "rating": 5.0, "text": "I got lasik about a month ago and I am so pleased with my results! Dr. Michelson & Mandy made time to talk to me every time I visited the office and addressed my concerns about the standard symptoms after the procedure. I 100% recommend them for lasik!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "115119172965704092149", "name": "Will White", "time": 1596745085129, "rating": 5.0, "text": "Dr. Michelson performed LASIK on my 18 year old son.  Within 48 hours, he went from horrible eyesight to 20/20 or better and had a great recovery.  Well worth the investment. I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "105751853607079839447", "name": "Tasha Nunnelley", "time": 1597673834120, "rating": 5.0, "text": "Despite how anxious I was to have the LASIK procedure done, Dr. Michelson and Mandy made the experience absolutely amazing! They talked me through every step of the procedure, and while the procedure was being done,  Dr. Michelson and his team kept me comfortable while talking to me every step of the way.  I'm so glad I had this procedure done, and by Michelson's wonderful team!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "107169042856773696802", "name": "Jennifer Childress", "time": 1596303641839, "rating": 5.0, "text": "I had an excellent experience with everyone in this practice. I saw Dr. Jennifer Michelson for my pre-op appointments and she performed my lasik surgery. I cannot speak enough about her thoroughness in all aspects and professionalism.  I am incredibly pleased with my results an would most definitely recommend her to anyone!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "116962700365251422797", "name": "Andrew Moak", "time": 1600441571046, "rating": 5.0, "text": "Fantastic experience with Michelson Laser Vision & I'd recommend Jennifer Michelson and her entire staff to anyone looking for laser vision correction.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "103971076655530525181", "name": "Jeremy Locklear", "time": 1584112959323, "rating": 5.0, "text": "I can see! I had LASIK surgery yesterday. I had a severe astigmatism and have been wearing glasses since I was five.\nIt's like I'm seeing in high definition. Three-dimensional. My depth perception is so much better. Wow. So much better. I'm a bit shocked, I didn't know it would be this good.  Don't put it off ...", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "113430313805156864480", "name": "Shannon Frazier", "time": 1590198582484, "rating": 5.0, "text": "I highly recommend. I enjoyed my time with them from the consultation to the very day of my surgery everyone was friendly and professional. This has been completely life changing and I love my results. Thanks again Dr. Michelson and team  🤩\n#ICanSeeClearlyNow", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "118226216173777757452", "name": "coleman sears", "time": 1605289577184, "rating": 5.0, "text": "Dr. Michelson and his staff were top notch.They explained everything extremely well and were very helpful throughout the process. I can’t thank them enough for their work and allowing me to be glasses free.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "105708785794736508455", "name": "Mary Taylor", "time": 1595348012527, "rating": 5.0, "text": "Dr. Michelson and his staff are amazing! I am blown away at my results and I am sad I did not do it sooner! I had a great experience!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "117856733219699941097", "name": "Laura Goodwin", "time": 1576198759930, "rating": 5.0, "text": "5 stars!! Beyond pleased with my experience at Michelson Laser Vision. Dr. Michelson did a fantastic job answering all my questions concerning lasik and putting my nerves at ease, Amy (the office manager) had great communication skills, was organized and caring, and lastly the nurses and staff were all so incredibly helpful and professional. I am seeing 20/15 and definitely wish I had done surgery sooner. I recommend Dr. Michelson to anybody who needs laser eye surgery.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "106096618930255604436", "name": "Mackenzie Turner", "time": 1590109660634, "rating": 5.0, "text": "I could not have imagined a better experience! I had Lasik done here last week and it has been life changing. The entire team was very hands on, informative, and friendly!! I have perfect vision and I could not be happier with the experience.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "110256907599517433223", "name": "Christine Webb", "time": 1596227255167, "rating": 5.0, "text": "My son got Lasik and is happy. The staff is very knowledgeable and courteous.If you are considering Lasik,  I would recommend Dr. Michelson Laser Vision.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "109561399827807179388", "name": "Henry Kay", "time": 1576772753526, "rating": 5.0, "text": "Incredible Experience!!!! Dr. Jennifer was incredibly helpful and personally walked me through the whole process. The staff is very friendly and helpful as well! I have 20/15 vision now and its been life-changing", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "110330081703827531736", "name": "Regina Adkins", "time": 1561566859301, "rating": 5.0, "text": "I highly recommend Dr. Michelson.  Best decision we have ever made.  The increase in my son's quality of life due to his improved vision is priceless.  Dr. Michelson and all his staff are kind, compassionate and brilliant.  They explained every step of the process and provided constant reassurance.  My son had PRK and we are over 2 months out and eyesight is amazing!  Looking forward to saving a fortune on glasses/contacts!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "103565567303383683350", "name": "Britni Liberton", "time": 1582911333452, "rating": 5.0, "text": "They made me feel so comfortable and at home here! I was super nervous for my Lasik procedure but they did everything they could to make me comfortable! If you’ve been wanting to get LASIK, go see them ASAP! You won’t regret making this decision for your life! I sat up and could see immediately after my procedure, it’s life changing! Thanks everyone at the clinic ❤️", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "112064303330970491674", "name": "Jacob Hall", "time": 1583293095673, "rating": 5.0, "text": "Had a wonderful experience with Michelson Laser Vision. It was a quick and easy procedure. The staff were great and very efficient to make the overall experience enjoyable.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "114343856300811986423", "name": "Sally Harrison", "time": 1581175041417, "rating": 5.0, "text": "Having worn contacts since the 5th grade, I can’t describe how amazing it was to have 20/20 vision <24 hours after surgery. Thank you, Dr. Michelson! The staff at Michelson Laser were super friendly, and great about working with my busy schedule.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "111573005617820405670", "name": "David Pair", "time": 1567363962712, "rating": 5.0, "text": "My wife and I had  lasix surgery with Dr. Jennifer Michelson about a year ago and it was the best decision we have made regarding our vision. We both have 15/20 vision and have had no complications. All of the staff there is great and I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "102824694372006837446", "name": "C D", "time": 1564970141781, "rating": 5.0, "text": "I have been leery regarding lasik surgery for several years.  A colleague of mine recommended Dr Michelson and I am forever grateful. The procedure was quick and with almost no discomfort. Dr Michelson is very thorough and comes with years of experience. In fact, Dr Michelson is one the first physicians internationally that has performed lasik. I am a 42yo medical provider and the procedure was worth every penny. I love waking up and walking around without glasses or contacts. Thanks Dr Michelson.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "103308772952608040201", "name": "Roger Wentowski", "time": 1578066296621, "rating": 5.0, "text": "They have the process down to a science and I now live life without glasses. The staff is friendly and the price given is exactly what I paid including all follow up visits. I would use them again.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "100732432808976000922", "name": "John Tomik", "time": 1572747957646, "rating": 5.0, "text": "These people are miracle workers!!\nI had PRK preformed on my eyes and I am seeing things like never before. Please consider this if you are like me and tired of wearing lenses on your face or plastic in your eyes. This is truly life changing and it's just freaking awesome! I had PRK  a week ago and can see perfect.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "110379234637788574201", "name": "Elise Tran", "time": 1559270005004, "rating": 5.0, "text": "I would strongly recommend both Dr. Michelson's.  They both took care of me very well and answered all of my questions.  They paid attention to every detail with their examination, giving me comfort that I was in good hands.  I have worn glasses and contacts for about 14 years, and my vision has gotten much better after lasik.  I just wish that I did this procedure sooner!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "105243291624504773660", "name": "Jessica Lee Ramos", "time": 1554048315409, "rating": 5.0, "text": "Had my Lasik surgery with Dr. Michelson on 3/28 and I am seeing perfectly!  The procedure was so quick and easy.  The staff at Michelson Laser Vision are all so friendly and welcoming.  Couldn't have asked for a better experience and would highly recommend Michelson Laser Vision.  My only regret is I didn't do this years ago.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "116870695068715268187", "name": "Marcus Castro", "time": 1562959486018, "rating": 5.0, "text": "I have thought about getting Lasik for years...I finally decided to move forward with it. I am so glad that I did and so happy that I chose Dr. Michelson. He did a fantastic job. 20/15 vision! I would recommended him 10 out of 10!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "117324374004403328645", "name": "Faraaz Salik", "time": 1545080397592, "rating": 5.0, "text": "Wonderful practice here in Alabama. Dr. Michelson was incredible. Answered all of my questions and reassured me the entire way. He schedule me immediately, within 2 weeks of my initial consultation. The entire staff is incredible and friendly as well. 10/10 would recommend.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "105241416867833007393", "name": "Brittany King", "time": 1549398078473, "rating": 5.0, "text": "Dr. Jennifer Michelson performed my surgery.  I actually came to Michelson Laser Vision because of a scheduling conflict that I had with Schaeffer.  I was so disappointed and made the last minute decision to change doctors.  I could not be more happy with the professionalism and true kindness of the staff.  I honestly was so nervous and had waited years to be able to afford this surgery.  I never felt any pain with the laser and Jennifer took so much care with me knowing how nervous I was.  The staff stayed right there with me and they did the countdown for surgery of while I was under the laser.  Everything about this experience has been so positive.  Simple things like being able to see even in the shower is just such a blessing and a quality of life thing for me.  I never realized how much I didn't see even with corrective glasses.  I could cry over my results because I'm so thankful for the results.  I do experience driving at night a halo effect on lights but honestly its not bad enough to effect my driving and the other benefit of seeing in general outweighs this one not so ideal part of laser correction.   I highly recommend anyone to come see this practice.  This surgery was worth every penny to me.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "106658430838072731529", "name": "Lamar Riley", "time": 1544724982077, "rating": 5.0, "text": "Last week Dr. Marc Michelson changed my life. I am so thankful to him and his entire staff. Everyone is very knowledgeable and so friendly. It made making the decision to have LASIK surgery an easy one. After being dependent on glasses or contacts for the last 35 plus years, I can now wake up every morning and be able to see the alarm clock without reaching for glasses. To say I am thrilled with the results is an understatement.  If you have ever thought about corrective eye surgery, Michelson Laser Vision is the only place to go.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "109685287392998895388", "name": "Brian Horn", "time": 1561404007033, "rating": 5.0, "text": "I feel like I received the best care available from  both doctors as well as their staff. Your eyes are not something to bargain shop with. Get the best with great doctors and a very kind and professional staff!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "105241416867833007393", "name": "Brittany King", "time": 1549398078473, "rating": 5.0, "text": "Dr. Jennifer Michelson performed my surgery.  I actually came to Michelson Laser Vision because of a scheduling conflict that I had with Schaeffer.  I was so disappointed and made the last minute decision to change doctors.  I could not be more happy with the professionalism and true kindness of the staff.  I honestly was so nervous and had waited years to be able to afford this surgery.  I never felt any pain with the laser and Jennifer took so much care with me knowing how nervous I was.  The staff stayed right there with me and they did the countdown for surgery of while I was under the laser.  Everything about this experience has been so positive.  Simple things like being able to see even in the shower is just such a blessing and a quality of life thing for me.  I never realized how much I didn't see even with corrective glasses.  I could cry over my results because I'm so thankful for the results.  I do experience driving at night a halo effect on lights but honestly its not bad enough to effect my driving and the other benefit of seeing in general outweighs this one not so ideal part of laser correction.   I highly recommend anyone to come see this practice.  This surgery was worth every penny to me.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "105401191999417495504", "name": "Eric Truitt", "time": 1550175636147, "rating": 5.0, "text": "It has been a little over a year since I received my Lasik.  My vision is great.  I think it has gotten better even in the last few months. They are really good.  I have had no problems.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "111177040283886012477", "name": "Angela Marchant", "time": 1547043210535, "rating": 5.0, "text": "I had LASIK eye surgery by Dr. Marc Michelson and it was the best decision I have ever made. The staff and doctors take time to make you feel comfortable and talk you through each step so you always know what is happening. They also have you come back for post-op the next day to make sure everything went as planned. I wouldn't go anywhere else to have any type of eye surgery.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "105131771096509936895", "name": "Vickie Wing", "time": 1515783864325, "rating": 5.0, "text": "THANK YOU!!! For the first time in my life I can see the alarm clock CLEARLY instead of a red blur!!! The entire staff is amazing and care about making your treatment a success!!! I cannot say enough good things about them! You definitely have me as advertisement to everyone in need of your great works!! 🎶 I CAN SEE CLEARLY NOW THE BLUR IS GONE🎵 👍🏼👍🏼👍🏼", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "114588241136107944371", "name": "Marilyn McCaleb", "time": 1536331934446, "rating": 5.0, "text": "I had Lasik eye surgery here & I couldn’t be happier with the results! I’m 22 years old and have worn corrective eyeglasses and contacts for about 15 years now. Before surgery my visibility was at 20/200 & today (the day after my surgery) I’m seeing 20/15 without corrective eyeglasses or contacts. Additionally, the entire staff at Michelson Laser Vision is very kind as well as professional & extremely thorough. Due to their exceeding level of competence I didn’t even experience nervousness before surgery. I’m so glad I went with Michelson Laser Vision! They’re truly a blessing.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "108675467054442706680", "name": "Monique Hill", "time": 1559317658081, "rating": 5.0, "text": "I had my LASIK surgery over 6 months ago and have 20/15 vision!  I highly recommend Michelson Laser Vision. They are very professional and caring.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "105525693923434821078", "name": "Ryan Colley", "time": 1477486648799, "rating": 5.0, "text": "I had a fantastic experience.\n\nAll the doctors were friendly and completely upfront about what to expect and what the process would look like.  They took the extra time to be sure I was comfortable and to ensure that the results would be as good as possible.\n\nI am now seeing 20/15 in both eyes and couldn't be more pleased!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "111440806636144192950", "name": "Rodney Pilkington", "time": 1505749681279, "rating": 5.0, "text": "Friendly and professional staff. ALL are very knowledgeable and answer any questions when needed. Michelson Laser Vision is by far the TOP notch for laser surgery!!! Dr. Michelson and his staff are amazing and caring and strive to give you the best vision and outcome of every procedure they provide!!! Dr. Michelson gave me my vision back of 20/15 in both eyes. I can not thank Dr. Michelson and his staff enough!!!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "117426409383383983420", "name": "Kim Hobbs", "time": 1532026651665, "rating": 5.0, "text": "I loved my experience at Michelson Laser Vision.  The staff was super friendly and always willing to make me feel comfortable and at ease.  When you think about eye surgery you want to feel 100% confidence in the team and doctors and I felt that way from the very beginning.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "117052447850172697226", "name": "Samantha Phelps", "time": 1502387527612, "rating": 5.0, "text": "Dr. Michelson and all of his staff are extremely friendly, skilled, and so amazing. They helped me feel completely at easy about the whole procedure and recovery afterwards. My vision is now 20/20 and I couldn't be more pleased. Loved everyone there and how easy I could talk to them and ask any questions without feeling dumb.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "109211301781778987357", "name": "Will Mustian", "time": 1561138411354, "rating": 5.0, "text": "Great experience with Lasik - Dr. Jennifer Michelson performed the surgery, but both doctors were involved prior to and after the surgery.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "100090789420087878709", "name": "Laura Twilley", "time": 1561127590654, "rating": 5.0, "text": "I cannot say enough about the supreme quality of care I received by Dr. M. Michelson and his staff. I highly recommend them for their efficiency, professionalism and precision in providing outstanding vision correction through laser vision surgery.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "113127078260523662599", "name": "Felicia Bailey", "time": 1440522085460, "rating": 5.0, "text": "Dr. Michelson and his team are wonderful. My vision was -10 in the left and -8 in the right and now I have 20/20 vision. I had worn glasses since I was 5 years old. It is so amazing to no longer need them!!! Go see Dr. Michelson. You will not be disappointed. 100% SUCCESS!!😀", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "117052447850172697226", "name": "Samantha Phelps", "time": 1502387527612, "rating": 5.0, "text": "Dr. Michelson and all of his staff are extremely friendly, skilled, and so amazing. They helped me feel completely at easy about the whole procedure and recovery afterwards. My vision is now 20/20 and I couldn't be more pleased. Loved everyone there and how easy I could talk to them and ask any questions without feeling dumb.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "115968590657681978278", "name": "Savannah Johnson", "time": 1544547673033, "rating": 5.0, "text": "I had my LASIK surgery done by Michelson Laser Vision almost 3 years ago now & it was one of the best decisions of my life! The staff are so kind & responsive. My vision is still great (even after being in medical school staring at a computer all day every day for the last 2 & 1/2 years!). I browsed around for other eye surgeons but I found that Michelson Laser Vision was the best option in Alabama. I’m very thankful to be done with the hassle of contacts. If you are even considering getting LASIK I would suggest you go for a consult— you won’t regret it!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "115925786661613344721", "name": "Raquel Mooney", "time": 1521945259306, "rating": 5.0, "text": "The staff was very friendly. Margaret answer my calls and emails in a very timely manner.  I was very nervous but the staff and Dr. Michaelson answered my concerns and made me feel very comfortable. I am very happy with my results and it feels very good not to reach for my glasses to read a clock or watch the television to name a few.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "114104998708258563356", "name": "Erin Merrion", "time": 1498253562945, "rating": 5.0, "text": "Very thorough staff that makes you feel comfortable. Dr. Gannon and Dr. Michelson really took the time to make sure all my eye measurements were exactly right. I can finally see!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "114744979410726730824", "name": "Preston Sims", "time": 1554215546756, "rating": 5.0, "text": "Great people, at every appointment they got me in and out and they try and get to know you beyond just being a patient", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "102790624104797513786", "name": "Beth Bradner Davis", "time": 1533673078377, "rating": 5.0, "text": "I had the PRK procedure done in June and have been very pleased with the results. After wearing glasses or contacts for over 30 years, it's still hard to believe I don't need them! The team at Michelson was professional, answered all of my questions and were wonderful from the initial consultation, during the surgery and my check-ups following the procedure. So glad that I decided to take the plunge and have LASIK!", "pics": null, "resp": {"time": 1534167420360, "text": "Beth, thank you so very much for your review! We at Michelson Laser Vision are thrilled we were able to help you lose your dependence on glasses and contacts. Enjoy your new vision!"}, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "111634762497152483856", "name": "Henry Burns", "time": 1509721916769, "rating": 5.0, "text": "They have earned the five stars! My vision is perfect(literally) now the I've gotten the LASIK from here, and I did so under the kindest and best staff I've ever met. The doctor was friendly and very skilled, and I will recommend them to anyone needing corrective surgery!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "106421008580304875808", "name": "Garrett Gamble", "time": 1482443310998, "rating": 5.0, "text": "Dr. Michelson and his staff are world class! Extremely skilled, friendly team using top notch equipment. I have moderate astigmatism in both eyes and they brought me to 20-15 vision with LASIK. I am recommending this team to all of my family and friends.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "115243172869994817477", "name": "Stewart Abrams", "time": 1496693341330, "rating": 5.0, "text": "Great staff and very informative. Answered all my many questions. Went from everything blurry beyond 3 feet to 20/15 vision. Pain was initially more than expected, but it went away after sleeping for a few hours. Pretty expensive but when you're dealing with your sight you don't want to cut any corners. Very happy with results!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "108003543825204960273", "name": "Brannon Quinn", "time": 1536941697212, "rating": 5.0, "text": "First off I want to thank Dr. Michelson and his staff.  They are great, I have been in glasses and contacts for 26 years. Now for the first time I can see 20/15 without either. This is the place you want to go.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "100897100227447601875", "name": "jowen245", "time": 1507654737364, "rating": 5.0, "text": "Best decision I've ever made. Wish I would have done it sooner. Dr. Michaelson does amazing work. Better than 20/20 vision in both eyes. Schedule a consultation today!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "114360383412846428664", "name": "Diem Huynh", "time": 1530908713246, "rating": 5.0, "text": "I just had my Lasik procedure done at Michelson Laser Vision for my farsighted problem  and had a wonderful experience. Thanks Dr Marc and the whole team . I never expected to see so clearly the day after , I’m just so happy that I got my vision back!!!! Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "112813880394633019134", "name": "Melissa Martin", "time": 1511364686818, "rating": 5.0, "text": "From appointment availability, courteous staff, and all the way through lasik surgery I would highly recommend Dr. Michelson & his practice. I had extreme anxiety going in wondering if this would be something I could even sit still for. They were extremely thorough in answering all my questions, describing the procedure and the after care and what it all would feel like. YOU DO NOT FEEL A THING IN SURGERY! I am now typing this with my new 20 15 vision, only 24 hours post op. If you are on the fence about it, or nervous at all...just go TALK to them! They will put you at ease, if i can do it... you can too.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "106164093772898133734", "name": "Emily Wood Bowron", "time": 1460396397240, "rating": 5.0, "text": "Just had LASIK surgery performed on 3/31 and I now have 20/15 vision! The entire staff was helpful, nice, and really helped calm my nerves. I was pretty uncomfortable and light sensitive for the first few hours after surgery, but went into work for a half day the next day. The recovery time is incredible and I could not be happier with my results so far.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "106167375682673811931", "name": "L H", "time": 1512607815322, "rating": 5.0, "text": "Dr. Michelson was wonderful and the staff is great. The team was very knowledgeable and professional. I had an awesome experience and would recommend Michelson Laser Vision to family and friends.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "116061432889781691466", "name": "Aleena Khan", "time": 1543278591310, "rating": 5.0, "text": "I had PRK surgery this past July and now have 20/20 vision in both eyes for the first time since before I was 5 years old! I would recommend Dr. Michelson, Dr. Michelson, and Dr. Gannon to anyone looking for eye care.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "115354300653819247634", "name": "Jami D", "time": 1434549941896, "rating": 5.0, "text": "Just had a complete eye exam 4 YEARS after my LASIK surgery and my vision is still 20/15!!!!\n\nThe staff and experience was great! If you are considering the procedure, please go discuss your options with them. I highly recommend Dr. Michelson and his practice to everyone in the market for corrective eye surgery.\n\nThank you so much to everyone at Michelson's Laser Vision!!!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "112813880394633019134", "name": "Melissa Martin", "time": 1511364686818, "rating": 5.0, "text": "From appointment availability, courteous staff, and all the way through lasik surgery I would highly recommend Dr. Michelson & his practice. I had extreme anxiety going in wondering if this would be something I could even sit still for. They were extremely thorough in answering all my questions, describing the procedure and the after care and what it all would feel like. YOU DO NOT FEEL A THING IN SURGERY! I am now typing this with my new 20 15 vision, only 24 hours post op. If you are on the fence about it, or nervous at all...just go TALK to them! They will put you at ease, if i can do it... you can too.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "112519470952898089200", "name": "Emily Bookout", "time": 1450727425634, "rating": 5.0, "text": "I had lasik on Dec 3, 2015. I love it! Dr. Michelson and his entire staff were wonderful! I have worn glasses since I was five and now I can see 20/20!\nThey made the entire process so simple. I went in on Tuesday to see if I was a candidate and had the surgery on Thursday. The surgery took about five minutes. After the surgery I felt slight discomfort but it was not near as bad as I had imagined. I am very pleased and so glad I had it done! Thank you Dr. Michelson!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "100089027889157133199", "name": "Kolton Burt", "time": 1513395172262, "rating": 5.0, "text": "Just had lasik yesterday, was back at work this morning at 6am. I have been thinking about lasik for years and now and really wish I had done this a long time ago.Me and my wife have both had our eyes done in the past 2 weeks and now we both see better than we did with our contacts. The doctors at Michelson laser vision were extremely thorough, they must have checked my eyes 6 times before surgery. Was really impressed with the staff also, we never waited more than 5 minutes past our scheduled appointment time. Would highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "101768211917690588214", "name": "Kendall Martin", "time": 1436302539545, "rating": 5.0, "text": "I was 100% happy with entire process and results of my laser eye surgery. The staff and Dr. Michelson are so nice, helpful, and made me feel so comfortable. The surgery was fast as well as my recovery! I would recommend Michelson Laser Vision to anyone!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "116061432889781691466", "name": "Aleena Khan", "time": 1543278591310, "rating": 5.0, "text": "I had PRK surgery this past July and now have 20/20 vision in both eyes for the first time since before I was 5 years old! I would recommend Dr. Michelson, Dr. Michelson, and Dr. Gannon to anyone looking for eye care.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "105912830163146973468", "name": "Trent Sandlin", "time": 1475869353016, "rating": 5.0, "text": "Dr. Michelson did an amazing job performing LASIK surgery on my eyes. When I visited the next day I had 20/15 vision. He was willing to take the time to answer any questions I had. Overall he is a great doctor as well as a great guy.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "106167375682673811931", "name": "L H", "time": 1512607815322, "rating": 5.0, "text": "Dr. Michelson was wonderful and the staff is great. The team was very knowledgeable and professional. I had an awesome experience and would recommend Michelson Laser Vision to family and friends.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "110615214719360131992", "name": "Drew White", "time": 1457545675491, "rating": 5.0, "text": "You get what you pay for! I had PRK and at my 3 month check up I am 20/15. The staff is amazing. They are friendly, courteous, and make sure you are well informed through the whole process. I am a pansy when it comes to eyes. I could never wear contacts because I shiver at the thought of touching my eye ball. The procedure was painless and recovery was not as bad as I anticipated. I was properly educated that PRK is a longer healing process and to expect to go from clear vision, to blurry, and back to clear. Everything I was told would happen did. I made sure to follow the prescriptions and eye care as directed. If you wear glasses you know the pains of wanting to watch TV in bed bit making sure to not fall asleep with your glasses on. Or going from one extreme temperature to another and your glasses fogging up. Having to pay extra for prescription sun glasses or dealing with horrible transition lenses. Getting this done has been the best decision for my health. Again, I cannot praise Dr. Michelson and his staff enough. I am more than pleased with my results.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "116920087583265783202", "name": "Sam Douglas", "time": 1479999691653, "rating": 5.0, "text": "Very professional. Quick Office visit. Great results, -6.25 to 20/15 Vision in both eyes. Very much appreciated that Dr. Michelson himself called in the evening after the surgery to check on me and make sure that everything was okay. Don't know many other surgeons that would do that. As a surgeon myself it was very important to go to the best, and I feel that I did. Would definitely recommend anyone considering Lasix or PRK.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "109470332076700387444", "name": "Angie Hartman", "time": 1518795773139, "rating": 5.0, "text": "Seeing perfectly on post-op day one!!  I highly recommend Dr. Michelson and his team.  They did an excellent job answering questions and making the LASIK procedure very comfortable.  Honestly, the most difficult part of the whole process was parking at UAB highlands!!  I wouldn’t hesitate to recommend Dr. Michelson...  My only regret is not having the procedure done earlier!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "102800916382912879654", "name": "Min Ding", "time": 1435601329637, "rating": 5.0, "text": "I had a good experience when I did LASIK surgery in this vision center last week. Dr. Tyler Hall performed the surgery for me, and it was great. He and the staff were very professional, and checked my eyes very carefully before the surgery. My vision is as good as 20/15 now, and I am very thankful to the team in this center.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "110615214719360131992", "name": "Drew White", "time": 1457545675491, "rating": 5.0, "text": "You get what you pay for! I had PRK and at my 3 month check up I am 20/15. The staff is amazing. They are friendly, courteous, and make sure you are well informed through the whole process. I am a pansy when it comes to eyes. I could never wear contacts because I shiver at the thought of touching my eye ball. The procedure was painless and recovery was not as bad as I anticipated. I was properly educated that PRK is a longer healing process and to expect to go from clear vision, to blurry, and back to clear. Everything I was told would happen did. I made sure to follow the prescriptions and eye care as directed. If you wear glasses you know the pains of wanting to watch TV in bed bit making sure to not fall asleep with your glasses on. Or going from one extreme temperature to another and your glasses fogging up. Having to pay extra for prescription sun glasses or dealing with horrible transition lenses. Getting this done has been the best decision for my health. Again, I cannot praise Dr. Michelson and his staff enough. I am more than pleased with my results.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "107896025462850764764", "name": "Connor Beacham", "time": 1553264448479, "rating": 5.0, "text": "Awesome staff and even better results!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "107849404844597947673", "name": "Dr R Jackson", "time": 1527866375285, "rating": 5.0, "text": "Had Lasik surgery yesterday, went back this morning and I’ve gone from vision so poor that I couldn’t read any letters on the chart and had to answer “how many fingers am I holding up?” to 20/20 vision! The entire staff is phenomenal! Very patient centered and patient friendly care! From The front desk staff who greet you to Terri, Lauren, Dr. Gannon, Dr. Michelson, and Pat, everyone is amazing! Can’t speak highly enough of the care I have received pre, during, and post procedure.\nAdded bonus-it’s also very easy to access the office at UAB Highlands-easy parking very close to University Blvd and 65. Unreservedly and highly recommend Michelson Laser Vision, Inc.!!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "111674300274490481435", "name": "Mazy Holiday", "time": 1422886122933, "rating": 1.0, "text": "2 hour and 10 minutes wait (for second surgery because the first was unsuccessful), and Michelson never bothered to even come in and discuss. Designated drive not aloud to leave facility for entire stay - it's an eyeball, not a black-market kidney. Clearly Michelson's time is extraordinary (self) important, much more so than his patients.", "pics": null, "resp": {"time": 1423142938859, "text": "Ms. Holiday, We at Michelson Laser Vision strive for the best in customer service and care for each of our patients. Since your comments here reflect a service level that we are not known for adhering to, we would very much appreciate an opportunity to assist you in achieving a better customer service standard by calling our office and speaking directly to our Refractive Coordinator, Audriano at 205-969-8100, who will be happy to discuss your experience and concerns with you personally. Again, thank you for writing to us to express your thoughts about your visit as it is our office policy to strive to be the very best in our patients' eyes."}, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "107005081166807809616", "name": "Prudence Kauffman", "time": 1521600253480, "rating": 5.0, "text": "Amazing Doctors and staff, highly recommend them!  Did cataract surgery on both my eyes and had wonderful results.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "105631403674676821461", "name": "Crystal Roberts", "time": 1461364432406, "rating": 5.0, "text": "ONE OF MY BEST DECISIONS Contacts or glasses have been a daily chore in my life for 17+ years. I began my LASIK search with another eye care provider. It did not occur to me that I would be rejected as a candidate, until the optometrist (not surgeon) noted a callus due to chronic contact use and subsequently rejected me. Thankfully my husband suggested Michelson where the doctor that would be performing surgery approved me. Dr. Michelson’s years of experience and expertise allowed him to see the callus was not a structural part of my eye and would not prohibit my benefiting from LASIK. Having a one on one with Dr. Michelson prior to the day of surgery was invaluable for me. The staff was very attentive and I felt as though I was in the care of a very competent work family. I felt informed and reassured throughout the process including during the surgery itself. No more foggy glasses, no more keeping a contact schedule or burning scratchy contacts. I would definitely recommend investing in a better quality of life through Michelson Laser.\nThanks to Michelson Laser my vision improved from relying on a -6.5 prescription to 20/15 in less than 24 hours!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "105413409635392701681", "name": "Rachel Dunaway", "time": 1451351026831, "rating": 5.0, "text": "In June, I had LASIK surgery, and I am so pleased with my results! I went from 20/800 vision to 20/15 vision! Although, I had halos and starbursts at night at first, they have gotten so much better as my eyes have healed. I am 100% satisfied with Dr. Michelson, his amazing staff, and the surgery overall. He and his staff answered every question I had and addressed every concern I had in a professional and confident way prior to my surgery. On the day of the surgery, they completely put me at ease. Then the night after the surgery, Dr. Michelson personally called and checked on me. That meant a lot to me and spoke volumes to me about how important his patients are to him. Overall, the entire experience was a blessing! Thank you!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "116180330025790554043", "name": "Murphy Sealy", "time": 1480338508821, "rating": 5.0, "text": "I was referred here for lasik  by my eye doctor. I had a great experience with the staff and doctor. My results were better than I could have ever imagined.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "107582728833281007457", "name": "justin terry", "time": 1456500875096, "rating": 5.0, "text": "WOW! I had such a fun experience with Dr.Michelson and his staff at the laser vision center before and after my PRK surgery I felt like i was family the whole time . Dr.Michelson even calls and checks in on you after surgery to make sure everything is going great and to see if there's anything he can do to help , there's not many Doctors of his expertise that care as much as he does about every single individual . A life with 20/20 vision and no astigmatism is truly a blessing   Thank You to all Staff and Dr.Michelson again for the fun and unforgettable experience.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "117000852943114124464", "name": "Lauren Mason", "time": 1485270389275, "rating": 5.0, "text": "Staff is wonderful! They accept you like family. The surgeon was excellent! I went from -8.5 to 20/15!!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "116180330025790554043", "name": "Murphy Sealy", "time": 1480338508821, "rating": 5.0, "text": "I was referred here for lasik  by my eye doctor. I had a great experience with the staff and doctor. My results were better than I could have ever imagined.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "102513970312683401498", "name": "Shawn Capital", "time": 1536245843585, "rating": 5.0, "text": "Staff is professional, yet personable and best of all...I had the best surgeon in Alabama successfully do Lasik on the most valued part of my body.   Wore glasses for 37 years, stigmatism and now...bam!!! crystal tight vision!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "104980672039021646356", "name": "Wendell Lawson", "time": 1525706525822, "rating": 5.0, "text": "These guys are awesome. I came in to get a consultation to see if they could help me, I was told 2 years ago from another lasik surgeon that my cornea were too thin for lasik surgery and I couldn't get the procedure done. I gave up hope and decided in November of 2017 that I needed a second opinion. I found Michelson Laser Vision the doctors and staff were extremely helpful and nice. Dr. Michelson and his team did extensive testing on my eyes and came to the conclusion that they could help me. I had the surgery done in November 2017 and I can see better than I could with glasses. Give this team of surgeons and staff a try they may not know who Lebron James is but they know everything about the human eye.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "107896025462850764764", "name": "Connor Beacham", "time": 1553264448479, "rating": 5.0, "text": "Awesome staff and even better results!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "114485760341216758454", "name": "Nick", "time": 1512087605046, "rating": 5.0, "text": "I highly recommend Dr. Marc Michelson for LASIK. I had the PRK and I am very pleased with the outcome. The recovery has been pretty much exactly like I was told it would be which has not been bad at all. All the people there are honest, friendly, and very accommodating. Dr. Michelson is very experienced and I would not trust anyone else when it comes to LASIK. He truly cares about his patients. 👍👍👍", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "110832532059246998019", "name": "Bridget Smith", "time": 1532541350763, "rating": 5.0, "text": "After wearing contacts for 25 years, my eyes became sensitive to them if worn for more than a few hours. I hated glasses, always felt dizzy in them and couldn't handle the loss of my peripheral vision. I decided to visit Dr. Michelson to see if I was a canadiate for Lasik surgery. Yesterday was my surgery and today, at my post-op appointment, I could read the letters on the 20/15 line! My prescription was a -5 in both eyes, I couldn't see letters on the tv 2 feet from me before. I've heard from numerous people this surgery was life changing for them, I now believe it! It feels like a miracle.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "106882905284990350003", "name": "Jordan Stanley", "time": 1487801696513, "rating": 5.0, "text": "Great experience. Nurses and doctor are all wonderful. 20/15 corrected vision!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "109235598426051428859", "name": "Debbie Hagan", "time": 1436280553270, "rating": 5.0, "text": "After wearing contacts for over 30 years, I decided to try Lasik surgery.  I am so grateful to Dr. Michelson and their staff for my overall experience. Very professional and caring!  My vision is now 20/15 and I can see much better than I ever did with contacts!  My only regret ... I didn't go see Dr. Michelson sooner!  If you are considering Lasik surgery, please, go see Dr. Michelson!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "114603998087429157480", "name": "jvicambro", "time": 1483114384878, "rating": 5.0, "text": "I am a young professional (surgeon) who just moved to the Birmingham area and decided to have lasik done before starting my job.  My main sources I used to decide who would do my surgery included asking people around town, browsing the the internet and ultimately the very positive reviews I read online from former patients.  I, too, am very satisfied I chose Dr. Michelson.\n\nAs I write this review, I am post-op day 1 and have minimal pain.  I was tested today and have 20/15 vision in my R and 20/20 vision in my L eye.  Needless to say, I am happy with my results just one day out from surgery and look forward to not relying on contacts or glasses anymore.  I was very impressed with how professional everyone was at Dr. Michelson's office.  Everything was explained to me in detail and all questions were answered to my satisfaction.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "111328925015855320234", "name": "Gavin Mikell", "time": 1515169668637, "rating": 5.0, "text": "It’s a Miracle! I can see again! The staff is amazing here!! Recommend to everyone!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "114948531245337605542", "name": "Jessica Bou Akar", "time": 1509114424177, "rating": 5.0, "text": "Very satisfied with my experience with this awesome group! By far the best place to get LASIK!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "118198427457401288043", "name": "Tyler Elliott", "time": 1512166759400, "rating": 5.0, "text": "It has been just over 24 hours from my surgery. I'm already seeing 20/20 and made it back to work the day after surgery. I am extremely pleased with the results. The amount of time the doctors and staff spent before my surgery going over every detail made me feel very comfortable. They were friendly, professional, and the results are phenomenal. My only regret is not doing this sooner. I contemplated LASIK 10 years ago, but backed out after feeling uncomfortable with the doctor who was going to perform the surgery. I had a completely different experience this time with Michelson Laser Vision which is what led me to go through with it. Everything went exactly how they described it to me in the pre-op exam. I highly recommend them to anyone who wants to have LASIK!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "118286840332809341720", "name": "Anna Khan", "time": 1503119147270, "rating": 5.0, "text": "I had a great experience with Dr. Michelson! I was really worried about getting laser corrective surgery, because I knew I would probably have to get PRK which  is supposed to have a long recovery time,, but my vision was practically perfect a week after my PRK surgery. The surgery itself was quick, and the recovery was a lot shorter than other experiences of PRK that I've heard of. I went from about a 20/300 to 20/15 vision. Dr. Michelson is great, and I would recommend him to anyone thinking about laser eye surgery.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "105090141697228082542", "name": "Yvonne Hardy", "time": 1483115207119, "rating": 5.0, "text": "I had my surgery yesterday for Lasik!!!  As of today I have 20/15 vision.  The staff and Dr. Michelson were very friendly and explained everything precisely!!!!  I have been wearing contacts and glasses for over 10 yrs!!!   Now I'm free of glasses and contacts!!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "106393763654556221291", "name": "Catherine Grizzard", "time": 1525740295595, "rating": 5.0, "text": "Having your eyes lasered is not something you go into lightly, so I decided I would consult with two different practices before picking a doctor.  I left the first office with a piece of paper that listed the price of the surgery.  I left Dr. Michelson's office with a folder full of valuable information, including statistics regarding the successful outcomes of his LASIK patients' vision.  While the price wasn't cheaper, I knew this was the doctor/staff that I wanted to operate on my eyes.  The surgery itself was just as amazing as the results.  The operation was completely pain free. The ride home was painful, but I took my Ambien and went to sleep as soon as I got home. After my four hour Ambien nap, I woke up completely pain free and have had no pain since.  I went back the morning after surgery for my post-op and had 20/20 vision.  I'm now eleven days post op and still getting used to the fact that I no longer have to depend on glasses or contacts after using them for 23 years.  I'm so glad I went with Michelson!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "108415827956008774579", "name": "Tony Maske", "time": 1491208019421, "rating": 5.0, "text": "My Lasik procedure went flawlessly and Dr. Michelson and his staff went above and beyond in every aspect. I wouldn't hesitate to recommend these guys for anyone thinking about Lasik.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "113809802175379127932", "name": "Ava Burt", "time": 1512141895759, "rating": 5.0, "text": "Staff is excellent and the experience is amazing! So glad I chose Dr. Michaelson. The #1 lasik Dr. in Alabama.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "102951610861507036152", "name": "S. Harrison", "time": 1502233312329, "rating": 5.0, "text": "I had LASIK done on both of my eyes about a week ago and went from being VERY near sighted (-5.00) to 20/20 vision :). Everyone was very friendly and Dr. Michelson did a great job!!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "112392896107568547002", "name": "Tristin Terry", "time": 1553094440551, "rating": 1.0, "text": "Had Lasik here a while back. They had to do it twice, and my left eye is still not 20-20.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "111281748381004836244", "name": "India Collins", "time": 1510242590824, "rating": 5.0, "text": "In the back of my mind, I had always thought about finding out more about lasik surgery and always said to people \" I would love to have lasik one day\".  I could kick myself for not having lasik done sooner! I am 51 years old and as I have gotten older, I began having more trouble with wearing contacts.  I could only wear them for a few hours before they would cause my eyes to get very dry, red and irritated.  Because of this, I reverted back to wearing glasses which I really didn't want to have to do but felt like I had no choice.  I was near-sighted, which meant that I had no significant problems seeing up close, but couldn't see things very clearly at a distance. About 15 years earlier, a supervisor of mine had lasik and mentioned that he had done an extensive amount of research on it and would be having Dr. Michelson perform his surgery. I kept Dr. Michelson's name tucked away in my memory and said that if I ever had it done, he would be the one that would do it.  I made the call to Michelson Laser Vision and couldn't get over how easily it all fell together after that call.  I went to my first appoinment and had several super-quick tests to see if I could actually qualify for lasik.  Margaret and Lauren ran the tests, then Margaret sat down with me and  told me that I qualified for the procedure. They were both great about taking the time to explain the tests and what to expect on the day of the surgery.  I was so excited to hear this news because my eyesight was so bad in one eye and I also have a history of diabetes in my family which I thought would completely rule me out for the surgery. Dr. Michelson asked me if  his daughter,Jennifer Michelson, M.D., who is also a practicing opthalmologist/cataract and laser eye surgeon there at the clinic,could perform the lasik surgery under his supervision. She has done many, many of these surgeries  and is very well qualified just as her father. I agreed, came in a few days later and had the procedure done  which only took about one minute to perform and I was in the office for about an hour total.  There was absolutely no pain involved and I didn't have any trouble whatsoever after the surgery.  The next day I was seeing perfectly with 20/15 vision in my eye that had before not been able to make out huge letters on the eye chart! I was sold! I drove to my appointment that very morning after surgery and  was driving and taking kids to cross-country practice that day as well. To be able to see so clearly things like car tag numbers, street signs and other things at a distance without the use of any kind of corrective lenses was so incredible! If you have ever thought about having this procedure you won't regret it.  It is truly a life-changing experience!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "112392896107568547002", "name": "Tristin Terry", "time": 1553094440551, "rating": 1.0, "text": "Had Lasik here a while back. They had to do it twice, and my left eye is still not 20-20.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "115100920198295243352", "name": "Ashlyn Rhodes", "time": 1460758070887, "rating": 5.0, "text": "I would recommend Michelson Laser to everyone! They have the friendliest staff and the best doctors!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "105096556931840780847", "name": "Emmanuel Ramos", "time": 1486158474357, "rating": 5.0, "text": "The best professional services in this place.\nI recommend to everyone......", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "110939359528497828129", "name": "JUSTIN MOORE", "time": 1522598544859, "rating": 5.0, "text": "Great staff of people who gives you the best experience possible.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "102193900259444168437", "name": "mark Cleveland", "time": 1481387307626, "rating": 5.0, "text": "Investigated Lasik last year as a solution to getting my Distance vision back.  After doing some research on internet and word of mouth I visited Dr. Marc's office for initial check-up and felt so comfortable with everyone involved I went ahead and had Lasik performed on both eyes at once.\nWhat a great experience from the immediate outcome to the follow-up care.\nI'd recommend Dr. Marc's practice to anyone looking into Lasik.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "115260300751197621381", "name": "Joey Mead", "time": 1581975537146, "rating": 5.0, "text": "Fantastic staff and doctors!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "107001478361495077627", "name": "T Lawley", "time": 1472222745536, "rating": 5.0, "text": "I am 26 years old and have had terrible vision my entire life. I always wanted to do lasik because contacts bothered my eyes and glasses provided no help with peripheral vision. I mentioned in passing to a family member that I was considering lasik and he referred me to Dr Michelson for a free consultation. I can honestly say from the first time I stepped into this practice that I genuinely felt that every employee cared about my concerns and my questions. Especially my lasik consultant Donna. Thanks Donna! I had lasik scheduled for 9:30 am. I arrived at 9:15 and within 5 minutes I was in the back getting started. After all of the final testing and surgery prep I was walked to the surgery suite and the procedure began. My wife recorded the entire surgery and from beginning to end was ten minutes. There was absolutely zero pain during any of it! It has now been 10 hours since the surgery and I can see better than ever before and I know it's only going to get better. I am amazed at how professional Dr. Michelson and his staff are. This has truly been a life changing experience. So thankful that I chose the best eye surgeon in the state to do my lasik. I wouldn't have trusted anyone else with my eyes! You guys are the best!\nUPDATE\nI had lasik on 8/25 and went in this morning 8/26 for post-op checkup. Before lasik I was legally blind. Now, less than 24 hours later my vision is 20/15 in both eyes! That is better than 20/20. I only wish I would have done it sooner! Thank you Dr. Michelson!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "111699092688339708653", "name": "Dana Bernardo", "time": 1503692061112, "rating": 5.0, "text": "Amazing experience! I went from legally blind (without correction) to 20/15!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "108101233603498832364", "name": "Powell Tyler", "time": 1481419016603, "rating": 5.0, "text": "Great Job!  Couldn't be happier.", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "115995061869898196515", "name": "Steven Janes", "time": 1533313594510, "rating": 5.0, "text": "Fantastic LASIK experience!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "115722516365281073317", "name": "S D", "time": 1491577746341, "rating": 5.0, "text": "Fantastic Vision - finally!", "pics": null, "resp": null, "gmap_id": "0x88891771d5bc1327:0xa9b2514c31329e4c"}
{"user_id": "117275601733325585826", "name": "M Miller", "time": 1558142537866, "rating": 1.0, "text": "Horrible, horrible, horrible. Had an eye exam and ordered glasses. First pair came in with the wrong prescription.  They redid my eye exam and said they made a mistake so they reordered my glasses. 2 weeks later I hadn’t heard a word so I called. Was put on hold for 20 min. I hung up at 20 min. Called back. Was put on hold for 7 min. Finally told my glasses had been shipped back with demo lenses installed. They apologized and told me when I came in I could select a pair of sunglasses as compensation for my trouble. Another 10 day wait. Glasses come in. I go to get them and ask about the offer of sunglasses. A nasty woman announces loudly from behind a counter that she’s the only person that can approve such an offer and she doesn’t know anything about it.  So I tell her, well, that’s what I was offered on the phone. She tells me she’ll have to investigate it. A little while later they call and tell me that they have “a” pair of sunglasses I can have. No choice allowed. I go to get them and they are a pair that was clearly returned by someone. I ask to speak to the “manager” and all of a sudden she’s unavailable.  These people lie. They are overworked and under supported by the company. I’ll never do business with them again. 36 days to get a pair of glasses is absurd and reneging on their offer is simply amateur.  So sad this is what this business has been reduced to.", "pics": null, "resp": null, "gmap_id": "0x88891bc4e5df2c01:0x5674ad0a3ec641d8"}
{"user_id": "107223234504109423562", "name": "Jackie Jackson", "time": 1556310283303, "rating": 1.0, "text": "Horrible experience.   This is NOT Schaeffer Eye Clinic! But, they don't tell you that.  I did not get what I asked for and  was told i could not get the custom  lenses I wanted.    Yet, the old pair  of lenses from Schaeffer were exactly what I wanted. Selection of frames, Limited, especially on the high end.  Their service is basic and over priced!", "pics": null, "resp": null, "gmap_id": "0x88891bc4e5df2c01:0x5674ad0a3ec641d8"}
{"user_id": "107485006876321986048", "name": "Debbie Simmons", "time": 1557152096998, "rating": 1.0, "text": "This was the worst Schaeffer experience I've EVER had. I arrived for my appointment a little early and filled out the paperwork to update my information. I was the only patient in the waiting room. I waited 50 mins before seeing the doctor. They directed another patient in to the room I was already in. On my way out after paying I asked for my prescription and they gave me my old perscription and not all of my personal information had been updated and it was not signed by the doctor - which I did not realize until I was ordering my glasses, elsewhere of course. A very unpleasant experience and waste of time. Very inefficient staff. I would not have given them one star but I could not post unless I did.", "pics": null, "resp": null, "gmap_id": "0x88891bc4e5df2c01:0x5674ad0a3ec641d8"}
{"user_id": "102788110498346192634", "name": "sara soltani", "time": 1536805162352, "rating": 1.0, "text": "I had a pair of glasses and got a second pair here, but the new prescription wasn't working fine for me so I had to go back to change the lenses. Everyone was nice during first visit, but when I returned, Dr. Benjamin was behaving very badly that I got stressed out. I even asked her about it, but she didn't seem to care and called me confused and said  I don't know what I want! (Of course, that's why we need help of a doctor!) I don't know if she had other problems or what but that's not a good excuse to treat a patient like that!", "pics": null, "resp": null, "gmap_id": "0x88891bc4e5df2c01:0x5674ad0a3ec641d8"}
{"user_id": "109343409469375548992", "name": "Wade Kwon", "time": 1358145824914, "rating": 5.0, "text": "For some 15 years, I've been visiting Schaeffer Eye Center under the care of Dr. Patricia Benjamin. She has been terrific: friendly, attentive and wry in making sure my eyes aren't suffering from the glare of all those screens.\n\nI see more clearly thanks to Schaeffer.", "pics": null, "resp": null, "gmap_id": "0x88891bc4e5df2c01:0x5674ad0a3ec641d8"}
{"user_id": "103635558180436812961", "name": "Tracy Jackson", "time": 1498958398264, "rating": 4.0, "text": "The staff here are very attentive and kind! Always willing to help", "pics": null, "resp": null, "gmap_id": "0x88891bc4e5df2c01:0x5674ad0a3ec641d8"}
{"user_id": "113175918307258611421", "name": "CAROL SKELTON", "time": 1564065780275, "rating": 1.0, "text": "Not the same service as I was used o with Schaeffer Eye Center, been waiting on the correct glasses since June 14, 2019 and  I am being told this morning (7-25-2019) they expect  them to be in by August 1, 2019.  Very strange.", "pics": null, "resp": null, "gmap_id": "0x88891bc4e5df2c01:0x5674ad0a3ec641d8"}
{"user_id": "107784520745296096957", "name": "Lindsey Cochran", "time": 1450479106278, "rating": 1.0, "text": "Worst experience ever and they don't even care. Told me I couldn't wear contacts (even though I have none to wear anymore) and I needed to wear glasses, except my glasses are broken and I can't see out of them. Bought new glasses told they would be in next week, but when I called they said it would be another week. I also have an eye condition that requires eye drops but they won't approve the insurance to cover them. So now I can't see, have severe migraines because of it and my eyes burn all the time. Every time I call for help and they speak to me as if I am stupid every single time. Don't waste your time here they don't actually help you they just want your money.", "pics": null, "resp": null, "gmap_id": "0x88891bc4e5df2c01:0x5674ad0a3ec641d8"}
{"user_id": "112915241468484876437", "name": "Miss Lan Pretty", "time": 1564426934105, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x88891bc4e5df2c01:0x5674ad0a3ec641d8"}
{"user_id": "104163910375454901967", "name": "Matthew O'Brien", "time": 1522936335376, "rating": 1.0, "text": "Doesn't open on time.", "pics": null, "resp": null, "gmap_id": "0x88891bc4e5df2c01:0x5674ad0a3ec641d8"}
