{"user_id": "118282753136650315537", "name": "Sullivan Edwards (Sully)", "time": 1592187325175, "rating": 5.0, "text": "Abraham and his crew were professional, courteous, and performed everything that I expected, while keeping me informed if anything unexpected came up.\n\nThey fixed some major drainage and erosion issues in the back yard (see before and after photos) by burying downspouts, building a French drain that went out to the road, and tying the downspouts into the drain. It is super satisfying to watch tons of water just pouring out of the drain into the street after a heavy rain.\n\nThey also graded and re-sodded the yard with Zoysia for less than it would have cost me to personally buy the Zoysia and lay the sod myself. I highly recommend Legacy for your personal landscaping project.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOP9LLSa1FkSJ1SEPZpCGsOwAl6myjUPrUxR1F0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN98dNwL0edkoD6b89zP9wyvyor9iFBLkHJENx4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOcwqfMq36dQbjBEMG-GqPL2swoLWdU3AmyRSHr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO99bXwaTyRCuh9LNFMCJmsZDz1rJYqdFCWDXsF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPCymUBkm2VhA4pNs7oSkMAuAvH0JvuOHZkssMb=w150-h150-k-no-p"]}], "resp": {"time": 1595192916558, "text": "Mr. Edwards,  We would like to take the opportunity to thank you so very much for the positive review.  Abraham enjoyed working on your drainage project and we are truly blessed to have such great people working with us to help solve issues that our customers may be having.  Have a great summer!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "100681058269140551242", "name": "Rene' Holt", "time": 1599235633883, "rating": 2.0, "text": "I never like to leave bad reviews and always try to keep them positive, but I contacted this company to help with some backyard design and remodel. I had a meeting scheduled with Jacob this past Wednesday and when he was 30 minutes late, I called the office to make sure nothing was wrong. Jacob called back and offered no apology for being a no-show but we rescheduled for today. It's a hour last our appointment time and he didn't show up again with no call and didn't answer his phone. If you can't be professional enough to keep scheduled appointments, twice, you're not a company I want to work with.", "pics": null, "resp": {"time": 1599268358031, "text": "Rene', thank you so very much for letting us know about the appointment issues.  This rarely happens, let alone 2 times.  Jacob inadvertently kept the same time from last week's appointment on his calendar and received a notice this morning that you cancelled the appointment, assuming it was this afternoon.  We regret that we were not able to be of assistance with your backyard project and appreciate again the review so that we can strive to do better, even in such a crazy year!    Tami"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "104106105688529962394", "name": "Neva Turner", "time": 1593643378877, "rating": 5.0, "text": "Our experience with Legacy truly deserves 10 stars. From first contact they have been the best company we have ever worked with. Everything was done timely and professionally. Quality is top notch. They have shown quality of work ethic beyond measure. We highly recommend this company. During this difficult time with Covid 19, working with everyone at Legacy has been inspiring and uplifting.\nGreat company !!", "pics": null, "resp": {"time": 1595192603424, "text": "Neva, getting to know you and your husband has been one of the highlights of our year.  You are such a pleasure to work for and your appreciation and kindness have not gone unnoticed.  The crew always enjoys working with you on your projects and we look forward to seeing what else you may have in store for your beautiful home!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "101345560364732262291", "name": "Heather Meacham", "time": 1606402094566, "rating": 5.0, "text": "Paul and Tami are so great to work with.  They pay attention to every detail and our patio is just perfect.  Very professional!!!", "pics": null, "resp": {"time": 1606504910070, "text": "Heather, it was such a pleasure to work with you on your patio project.  I absolutely love the color of the concrete,  it was an excellent choice.  Thank you again and enjoy your new patio!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "113215240688685991775", "name": "Jason Comfort", "time": 1595108518120, "rating": 5.0, "text": "First let me say that my wife and I are extremely pleased with the work.  More importantly, Abraham and his crew were phenomenal.  They were cognizant of the fact that my neighbors and I are all working from home and kept the noise at a minimum.  They went out of their way not to leave a mess after the first day after asking what our HOA restrictions were.  When they were finished, they had filled in the large hole my dogs had dug and placed down a few pieces of sod to cover some bare spots.  Truly outstanding service.\n\nLastly, when they were finished, and before they left, your team saw one of my neighbors struggling to unload a trailer.  They offered to help unload the heavy item for him.  They were truly great ambassadors for the company.\n\nWe have some pretty grand plans for our back yard that will stretch over the next couple of years.  After this experience, I guarantee that we will be reaching back out to Legacy Outdoor Services.", "pics": null, "resp": {"time": 1595192427066, "text": "Jason, Thank you ever so much for the review!  Your patience as we worked on your project was very much appreciated as the wet weather  makes drainage work even more challenging.  We are very blessed to have great teams working with us and we can't wait to see what else you have in store for your home.  Have a great summer@"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "112641626804551730969", "name": "debi frankowski", "time": 1566673144178, "rating": 5.0, "text": "We are so pleased with the work that Legacy Outdoor Services just completed at our house.  They installed and sculpted the most beautiful waterfall feature in our mountainside back yard, along with up-lighting that really looks awesome in the evening.  Additionally, they put in a flagstone patio with a gas fire pit, with beautiful natural landscape features and mulch beds all around.  We have had many compliments on it, and it is surprisingly low maintenance too!  We just love it!\nWe had several unforeseen complications which were out of Legacy's control, related to our gas line installation and inspection,  that Legacy patiently and proactively worked through.  We appreciated their high level of customer service and commitment, and will certainly use them again in the future!", "pics": null, "resp": {"time": 1567096986076, "text": "Debi, We absolutely loved working with you both!  You have such a nice home and we were so happy to be able to help you design an outdoor living area that accented your already existing hillside.  You have been so very patient as we worked towards getting your gas issue resolved.  Now you can sit back and enjoy all the elements together that make for a very relaxing getaway!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "111137092066572068365", "name": "Jacquelyn Pletcher", "time": 1592770708261, "rating": 1.0, "text": "Make sure your quote is EXTREMELY detailed, and that you’re home and watching every step they take for quotes involving construction. Otherwise you’ll end up with new concrete that is uneven (that will forever pool water TOWARDS your home), concrete paint that is already permanently stained with mud BEFORE they leave/finish, deep tracks in your sod because they will drive a concrete truck in your backyard, ground/grass that isn’t graded back the way it was before construction and therefore leaving extremely uneven muddy hills all over your yard, nails and cigarettes in your yard WEEKS after they leave, and a final structure that is uneven, sealed poorly, with paint drips that have dried.\n\nWould not refer.", "pics": null, "resp": {"time": 1595193209813, "text": "Jacquelyn,  We just wanted to thank you for taking time out of your busy schedule to leave us a review.  It is always important for a business to strive to grow in their professionalism and communication skills.  That growth is hindered if someone does not express their concerns that arise during and after a project.  Thank you again!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "113838961780293246456", "name": "Aurora Marmolejo", "time": 1598412397716, "rating": 5.0, "text": "I had some pavers placed around my back screen porch and a flower bedding put in front of my home. They did awesome work always done within two days and they cleaned the area really good. I highly recommend Legacy outdoor services.", "pics": null, "resp": {"time": 1596206972369, "text": "Aurora, Thank you so much for taking the time to leave us a review!  The crews commented on how very kind you were to them while they were working and that means a lot.  We are excited for you to be able to use your new space and look forward to helping you in the future!\nTami"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "100748477103684685549", "name": "Susan Tuck", "time": 1549400602185, "rating": 5.0, "text": "We hired Legacy Outdoor Services for a drainage issue.  We quoted several other companies as well.  Not only did Legacy provide a detailed quote with the scope of work to be performed it was very priced very competitively.  The entire staff is to be commended.  I was kept informed as to when the job would be started without having to follow up.  When the crew arrived they were well prepared and ready to work.  This is by far the best crew I have seen.  They worked extremely well as a team.  This was a messy job to say the least.  The clean up was amazing.  When they left you couldn’t even tell they had been there!  I would highly recommend Legacy for your outdoor needs.", "pics": null, "resp": {"time": 1549428935298, "text": "Susan, thank you ever so much for the positive feedback.  We appreciate greatly the opportunity to help you with your drainage issues and we are glad that we were able to meet your expectations!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "109072573966849415490", "name": "Madeline Ortiz", "time": 1579308883532, "rating": 5.0, "text": "Great experience, really pleased with the result Good communication and work complete on time. Definitely will do business again. Highly recommend this business", "pics": null, "resp": {"time": 1579384645515, "text": "Madeline,  thank you so very much for the positive review.  It was such a pleasure to meet with you and to design a landscape you can enjoy for many years to come!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "115955243844226744303", "name": "Diane Cooper", "time": 1568841843519, "rating": 5.0, "text": "Legacy Outdoor helped me get a couple of trees planted in my bare back yard.  They look nice and the hummingbirds are already checking the Japanese Maple out.  Tammy and I worked together to find the perfect trees, exactly what I wanted.", "pics": null, "resp": {"time": 1595193111358, "text": "Diane, you have been so great to work with over the past several years.  We appreciate the opportunity to help you with new projects and look forward to many more in the future.  Thanks again!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "101461821337101273629", "name": "J M", "time": 1597024440968, "rating": 3.0, "text": "My yard is really uneven in places after having new sod laid and the length of time for them to get my project done is what gives them three stars. Otherwise, they did a good job.", "pics": null, "resp": {"time": 1597526895729, "text": "Your feedback is greatly appreciated!  This year has been rather frustrating as covid, weather, and supply issues have caused delays that we have not had to deal with in the past.  Nonetheless, we are grateful for your patience and we wish you a safe and healthy rest of the year."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "109396638207751190191", "name": "JB Robins", "time": 1560557782341, "rating": 5.0, "text": "Legacy Outdoor Services did a most beautiful job landscaping my front yard.  They installed a stone border around my flower beds and perfectly matched the stone with the stone on my house.  They added so much color to my yard with yellow, red and green shrubs and added even more color with flowers.  It is outstanding and I am extremely pleased.  The landscape workers are very professional and polite.  They were always on time and did what they promised each day.  The owner, Tami, came by most days to ensure that I was happy with the way the job was going.  They are very flexible and allowed me to do add-ons as we progressed.  I plan to re-landscape the back yard next and I will be using Legacy.  Their work is excellent!!!!", "pics": null, "resp": {"time": 1560657270577, "text": "Ms. Jan, thank you so very much for the great review!  We very much enjoyed helping you with your landscape project and we can't wait to see what new ideas you will have for us in the future!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "108150526745578549771", "name": "Patrick Miller", "time": 1567880827619, "rating": 5.0, "text": "We are very happy with the work that was done. Owners and workers were extremely professional and courteous. Work was done on time and within budget. We can highly recommend this company.", "pics": null, "resp": {"time": 1567988196795, "text": "Patrick,  it was such a wonderful experience to work with you and your wife on this project.  To be able to add more outdoor area for you to enjoy while adding a functional walkway was our goal.  It was rather hot and your attention to our crew was appreciated.  Again, thank you for your review."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "109547156616978257415", "name": "Joy Fitzpatrick", "time": 1565783180842, "rating": 5.0, "text": "Loved working with Legacy on my landscaping and hardscaping.  They have a lot of creative ideas and deliver as promised. Their employees were respectful and pleasant to work with. I'll be contacting them again when I install a pergola and some additional projects.", "pics": null, "resp": {"time": 1567097194046, "text": "Joy,  Thank you so much for the encouraging review!  You had such great ideas that were not like most cookie cutter landscapes you might see.  It was so much fun finding unique plants and I have to admit there are more \"tropical\" options for this area than I thought.  You are great to work with and I hope that we have the opportunity to help you again in the future."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "116412605110655843432", "name": "Carol Johnson", "time": 1537409321880, "rating": 5.0, "text": "We chose Legacy Outdoor Services to implement the first phase of a multi-year landscape plan for our new house. It was an excellent experience all around and we are very, very pleased with the results. Everyone there is a pleasure to work with. Paul walked through the project with us when he did our estimate, and proposed several changes to our designer’s plan that were improved solutions to fix our yard’s drainage challenges. Jessica, the office manager, was always responsive to questions, and Tami did a great job hunting down the plants we selected — which wasn’t that easy in September. When they couldn’t find the specific plants on our plan, she collaborated with us to select acceptable substitutes.\nAustin, our project manager, and his crew were wonderful. They are great guys, hard workers, and do an amazing job. Even the installation was a collaborative experience. Austin suggested an additional dry creek bed on the side of the yard to deal with the excess water that funnels into our yard from the neighbor’s driveway. We are looking forward to working with Legacy again next year when we install the next phase of our landscape plan!", "pics": null, "resp": {"time": 1537447808248, "text": "Carol, you were such a pleasure to work with and everyone agreed that your design was just beautiful!\nWe can't wait to see what the next phase has in store.  Thank you again."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "112026042859733791059", "name": "Dana Williams", "time": 1551914985325, "rating": 5.0, "text": "I had drainage work done and these guys did great. Paul and his crew got on the work quickly and worked hard to complete the job through some very difficult conditions. Austin ran the crew and he was an expert at his work and went well beyond to finish a french drain, grading and downspout pipes to the street. Austin is a fine person to work with as well as his second in charge Abraham.", "pics": null, "resp": {"time": 1551985735501, "text": "Dana, thank you so very much for the encouraging words!  You are right, sometimes the wet weather makes drainage work rather challenging.  You were both so very patient and helpful during the whole process and we are so very thankful for the opportunity to help you with your drainage issues."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "113949714652133284084", "name": "Joey Borders", "time": 1554999936331, "rating": 5.0, "text": "If you need landscaping done give Legacy a call. They do all kinds of work, but we personally had hardscaping done. They came out, viewed our patio, designed a new layout, tweaked it a few times to get it within our budget, and completed the work. I even reached out to several other companies in the beginning stages. Legacy gave us the best design with the best cost. We worked with David the majority of the time. He and the company are professional. Extremely courteous and will answer any questions/concerns. Two thumbs up.", "pics": null, "resp": {"time": 1555079634538, "text": "Joey,  We absolutely loved your design, it was unique and functional for your family.  You were such a pleasure to work with and we appreciate the opportunity to help you with your hardscape project.  Have a great spring!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "103767282675903416009", "name": "Diane Moore", "time": 1547788128837, "rating": 5.0, "text": "Legacy Outdoor Services has a great team of people and are so easy to work with.  We hired them to do some ground prep work before we installed our above ground pool.  The workers were very courteous, polite, and always showed up on time.  We couldn’t have asked for a better job and highly recommend them!", "pics": null, "resp": {"time": 1547827275608, "text": "Diane, thank you ever so much for letting us know about your experience!  As always, it was a pleasure working with you and we look forward to more projects in the future!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "102804315426935822342", "name": "Lisa", "time": 1460758438235, "rating": 5.0, "text": "Legacy Outdoor Services is the only service of this type that I will use.  They have done multiple projects for me over the course of the last few years.  Their workers are always respectful and courteous. As a woman with workers on my property, that is very important to me.  They truly go the extra mile in making sure that I am completely satisfied with their work.  Whenever the opportunity arises, I am happy to recommend Legacy to anyone who needs work done, and I do so with the utmost confidence in the caliber of work that they will provide.", "pics": null, "resp": {"time": 1463678866334, "text": "Ms. Lisa,\nIt has been the utmost pleasure to work with you on all of your projects.  Your ideas are unique and beautiful and it has been a wonderful experience bringing those ideas to life.  Customer relations is very important and we are so grateful for the opportunity to be involved in meeting your expectations."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "108483660875607420822", "name": "Tami McGhee", "time": 1538179639652, "rating": 5.0, "text": "I chose Legacy Outdoor Services for a flower bed landscaping project last year and recently for a drainage project.  The owner, office staff and workers were all very knowledgeable, professional and a pleasure to work with.  I was very pleased with the work as well as the follow-up to ensure my satisfaction with the projects.", "pics": null, "resp": {"time": 1538412473747, "text": "Tami,  It was such a pleasure helping you with your project!  Drainage issues can be overwhelming and costly if not taken care of, we are so very pleased that we were able to help you with your issues and look forward to any future projects you may have."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "115395017058219405457", "name": "Ch Carter", "time": 1536679832009, "rating": 1.0, "text": "Called and tried to get an estimate to install landscaping in the rear of our newly purchased home and we're told we're outside \" Legacy's service area\" I wasn't looking for weekly lawn service I was searching for a one time landscape install.  Their website says they provide this type of service, and their office says they service parts of Owens Cross Roads, but don't cover where  I live in Meridianville.  A check of Google maps shows it's basically the same travel distance.  Must be nice to be doing so well that Legacy can afford to turn down a job, sight unseen.", "pics": null, "resp": {"time": 1536691877822, "text": "Thank you for your response.  You are correct in that we have a set distance of service from our location.  When our office is given an address of service, we then check to see if that address is within the distance we have set for our service area.  Each address is unique and may fit into our service area whether it be in Owens Cross Roads or Meridianville.  It is necessary to have perimeters in order to provide the most cost effective price for both our potential customers and our company.  Good Luck on your project."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "112498271920360270383", "name": "Mike Gordon", "time": 1547498421601, "rating": 3.0, "text": "Don't bother calling them if you are locating over the mountain in the Hampton Cove area. They even say they serve the \"Huntsville\" area, but I guess not. I'll take my business elsewhere.", "pics": null, "resp": {"time": 1547506880999, "text": "Mike, thank you for your feedback. You are correct in that we have a set distance of service from our location. When our office is given an address of service, we then check to see if that address is within the distance we have set for our service area. Each address is unique and may fit into our service area whether it be in Huntsville or Hampton Cove. It is necessary to have perimeters in order to provide the most cost effective price for both our potential customers and our company. Good Luck on your project."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "116464768980852366180", "name": "Grant Patten", "time": 1493326199889, "rating": 5.0, "text": "Amazing work! Went above and beyond, we were very satisfied. We had them come out for lawn service / hedge trimming / tree trimming / bush removal as well as lawn mowing, and we would definitely use Legacy Outdoor Services again in the future.", "pics": null, "resp": {"time": 1515601890434, "text": "Thank you so much for allowing us to help you with your project!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "102247343157860787735", "name": "Mark Bailey", "time": 1537295229665, "rating": 5.0, "text": "I had Legacy install a partial fence for our backyard.  The work was performed quickly and well done.  Very satisfied.", "pics": null, "resp": {"time": 1537448121165, "text": "Mark,  Thank you ever so much for allowing us to help you with your fence project.  We know you will enjoy the privacy for many years to come!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "102613479039580587098", "name": "Wes G Smith", "time": 1459540121771, "rating": 1.0, "text": "I would not use this contractor again, nor would I recommend them to anyone else.  They did a drainage project for me where I explicitly described the design I wanted and it incorporated solid PVC pipe.  On the day of the job, the workers showed up with corrugated pipe.  When I called the owner, he stated that PVC would be $800 more, so feeling like I didn't want to start over with another contractor, I told him to go ahead.  Then I found out that a portion of the water to be drained to the street running from the downspout  was going through perforated corrugated pipe (pipe with holes).  They assured me that the water would be moving and would not leak out into already saturated ground (yeah, right).  Then I came home to find that the grate to catch water coming off the sidewalk was about 1 and a half to 2 inches away from the sidewalk, requiring the water to run over dirt before entering the grate.  The owner tried to tell me that it would be no problem and the bare dirt would not erode despite water constantly running over it.  I insisted that concrete be put between the sidewalk and grate to keep the water from washing out the dirt.  When I came home, I found they had used a type of caulk between the grate and the sidewalk, and had done a messy job of it, I don't know if that much caulk will ever cure.  After two days it is still soft.  Additionally, where they cut through the curb, the re-concreting was extremely poorly done.  It looked like they didn't even use a trowel, much less a curbing tool.  It looked like they basically packed the concrete on with their fingers and left it.  Part of the contract called for doing a brick border along the sidewalk.  After I paid them for the portion of the contract for the drainage, they informed me that they were waking away from the contract and that I needed to find someone else to do the edging.  The pity is, the subcontractor they had lined up to do the masonry work actually sounded very competent.  Bottom line, this is a company that, in my opinion, cut corners at every opportunity, poorly designed the project, provided shoddy workmanship, and then walked away with nearly half of the contracted work unperformed.", "pics": null, "resp": null, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "112627625497851587477", "name": "Matthew Buxton", "time": 1540823978606, "rating": 5.0, "text": "My experience with Legacy Outdoor Services was great from start to finish. Austin and his crew did a great job, furthermore everything was cleaned up before they left.", "pics": null, "resp": {"time": 1542752671590, "text": "Matthew,  It was such a pleasure working with you on your project!  Austin and the crew were so very thankful for your help during the process and we are so happy we were able to help you with your drainage issues!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "114140904219899268546", "name": "Cindy McCrary", "time": 1539029376692, "rating": 5.0, "text": "Very satisfied with the landscaping and drainage work Legacy has done at our house.  Their honest and friendly crew was always a pleasure to work with.", "pics": null, "resp": {"time": 1539279886556, "text": "Cindy, thank you so much for allowing us to help you with your projects.  It has been such a pleasure to be able to work with you over these past several years!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "109399262948912963856", "name": "Carey Rosenblum", "time": 1465960466598, "rating": 5.0, "text": "Legacy outdoor has serviced my home grounds for several years. They installed a designed row of arborvite trees along my rear property line that are very healthy and provide a natural green screen of privacy. Otherwise they have come out annually to do some re-mulching in my flowerbeds and have given them thst extra spark in appearance. If you have some landscaping issues or need suggestions I would recommend them. They are honest and do good work.", "pics": null, "resp": null, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "117947770864316007014", "name": "Jennifer Benavides", "time": 1537324665297, "rating": 5.0, "text": "Dependable, honest and hardworking! Thank you Legacy for a great job once again.", "pics": null, "resp": {"time": 1537447929235, "text": "Jennifer, thank you so much for allowing us to help you with your project.  Can't wait to see what your next project will bring!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "101586645822953159514", "name": "matt demuro", "time": 1532362506140, "rating": 1.0, "text": "This company gave me probably the worst experience that I have had with a company that has done work for me. I contracted with them to do drainage work, a sprinkler system and landscape lighting.\n\nI was told this would take 3 weeks to complete, with each phase occurring on consecutive weeks. The project as a whole took almost 12 weeks to complete, and this was only because I hounded them with calls multiple times per week.\n\nThe drainage work was the first part, it seemed to be fine, though the French drain was not placed the complete length that was discussed originally. Also the fingers of river rich were put in to stop erosion, but almost no grass seed was put in afterwards, so nothing but weeds grew in between the river rock.\n\nThe second piece was the sprinkler system. This was put in during a day, but the ground was not backfilled properly and they needed to come back out to fix it. We were told that they would put down grass seed after the lighting job was completed. The lighting work was not completed for another 8 weeks, and there wasn’t any seed put down afterwards. They were also supposed to aerate and oversees the lawn, but since they could not get their mower into our backyard, they told us they would come back with a smaller mower to pull the aerator later. This never happened.\n\nI had to call them 2-3 times a week for 8 weeks to get them to complete the lighting. Part of it was landscape lighting, the other portion was putting in a fan and spotlight in/on our screened patio. The wiring was placed so shallow, that it came out of the ground within a week and they had to come back to fix. The light and fan was supposed to be put in by an electrician, but was just put in by the owner and his friend. They put a cheap conduit over the electrical wire that didn’t even cover the wire.  They sent an electrician out to fix the wiring, but he just rigged another kind of conduit on the bare wire to cover it up.  The uplighting for the trees was sold to us at $65 a light. I just found the lights online for $45 for a 4-pack of lights.\n\nWe just gave up with this company and figured we would just be stuck with this work. Over the last year, I kept burying and covering up the wire as it came out of the ground and have been trying to repair the grass in the area where they did sprinkler and drainage work. We are still fighting massive weeds from the lack of follow through on planting grass after their work was completed.\n\nI am writing this review today after I just finished replacing 3 lights that stopped working and half of the wiring that was put in for the landscape lights. Turns out they believe that wire nuts are not necessary and you only need to tape wires together with electrical tape before putting it in the ground.\n\nIf you are looking for a company to do landscaping work for you, stay very far away from this company. You will only be sorry if you choose them.", "pics": null, "resp": {"time": 1533529694432, "text": "Thank you for bringing all of this to our attention.  Unfortunately scheduling can be a challenge when dealing with different elements and sometimes issues arise.  For example the drainage was delayed due to an unmarked water pipe, flooding the drainage trenches.   The ceiling fan was installed by a certified electrician, as was the wiring for the fan, flood lights and outdoor switch.  We would be more than happy to provide the name of the electricians that provided these services.   The contract states that there is a year warranty covering defects in workmanship and materials.   Is regrettable that we did not have the opportunity to fix the issues that you were having with your lights, thus alleviating some of your frustration.  If we had only known of the issues we would have been more than happy to fulfill the contact’s one year warranty.  Again thank you for your comments and we will take them all into consideration to better our services."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "108670955347642886754", "name": "Stephen Rice", "time": 1463175075861, "rating": 5.0, "text": "I highly recommend Legacy Outdoor Services. Our neighbors compliment our yard all the time and these guys have helped with minor and complex issues on our property. We trust them 100% and most of all, they are super professional for a service company.", "pics": null, "resp": {"time": 1463678652280, "text": "Mr. Rice,\nIt has been a pleasure working with you and we appreciate the opportunity to meet your lawn care needs."}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "106141751648914846395", "name": "Jim Wittenborg", "time": 1524758298468, "rating": 1.0, "text": "I would like to have used this company for a drainage installation job, however, when I called and gave my address (near Hampton Cove), I was told that I lived too far away for their business.  I guess companies just don't go that \"extra mile\" for business anymore.", "pics": null, "resp": null, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "105383289762301934437", "name": "Richard Brown", "time": 1592346320110, "rating": 5.0, "text": "Good company to work with", "pics": null, "resp": {"time": 1592496094177, "text": "Thank you so much for allowing Legacy to help you with all of your projects.  It is always a pleasure to spend time with you both!"}, "gmap_id": "0x88626519de7ef85b:0x4b6cae1b92594858"}
{"user_id": "108640041363496634275", "name": "Daniel Porter", "time": 1551315357284, "rating": 5.0, "text": "Nice people nice place never been", "pics": null, "resp": null, "gmap_id": "0x888a476025a76729:0x8fc151bbcb9f640d"}
{"user_id": "116286265246138571995", "name": "Elle Johnson", "time": 1628530762019, "rating": 1.0, "text": "Well look what popped up to be reviewed. I was going to roll with the punches since the company was a sub under Woodland Homes but since old Google wants to know...my opinion. Horrible company!!!! If I could give it a negative star I would. This company has no pride in their work. They laid our sod all kind of crazy in the dead of winter and didn't roll it properly. If not careful one could easily break an ankle. They turned our sprinkler heads against the house and garage like idiots and quite a few were broken. It's the work of 2 year olds. And, it's a non warranty service so there lies the problem. If most are doing a job they never have to return to then they are not going to put too much pride in doing the job. Every home in this subdivision has issues with the sprinkler systems Largen installed. Company and companies who use and treat people unfairly...well we all know what happens. I would never recommend a company who lacks integrity and customer satisfaction. They are horrible!", "pics": null, "resp": null, "gmap_id": "0x886200e09e5cdb09:0xec31a4310d788318"}
{"user_id": "116740596698882077742", "name": "Dan Lambert", "time": 1619097852959, "rating": 1.0, "text": "Called and made an appointment for the next morning for service, between 8 and noon.  Got a call later in the morning from office manager  that the serviceman wouldn't make it until that afternoon.  Waited around all day.  Not another call.  Nothing.  Next day, nothing.  Literally just dropped their commitment without so much as phone call or a \"Sorry!\"  Really poor.", "pics": null, "resp": null, "gmap_id": "0x886200e09e5cdb09:0xec31a4310d788318"}
{"user_id": "107350781980902401806", "name": "Kimberly Sexton", "time": 1605730190993, "rating": 1.0, "text": "We had a horrible experience with Largen. They just didn’t show up serval times when they were scheduled to install sod and irrigation for us. After about three weeks of not showing up or calling to cancel, we told them we no longer needed their services. However, they put us in a terrible bind for the company that was scheduled to install our fence! The landscaping they did complete- flower bed- the bushes are wrong and the mulch is skimpy! Parts of the area isn’t even covered. I would not recommend using Largen for any of your landscaping needs.", "pics": null, "resp": null, "gmap_id": "0x886200e09e5cdb09:0xec31a4310d788318"}
{"user_id": "102663003469304580903", "name": "Cody Smith", "time": 1620047602783, "rating": 5.0, "text": "Awesome company, great irrigation service...", "pics": null, "resp": null, "gmap_id": "0x886200e09e5cdb09:0xec31a4310d788318"}
{"user_id": "114647430719493616704", "name": "Stacy Mcbride", "time": 1624574257650, "rating": 4.0, "text": "It was a great place to work", "pics": null, "resp": null, "gmap_id": "0x886200e09e5cdb09:0xec31a4310d788318"}
{"user_id": "118369867995449046285", "name": "Kathleen Burns", "time": 1596547613126, "rating": 1.0, "text": "Just purchased a home whose owners used Largen Landscape for irrigation installation and repair.  There is an irrigation leak that Largen was asked to inspect numerous times without resolution and because the previous property owners have an outstanding bill, Largen will not service the new owners.  So as the new owners who have inherited an irrigation system with a major break/leak, we are forced to find another service provider who does not have historic knowledge of the system.  Not a good business plan and Largen just lost this customer and anyone who seeks a referral from us.", "pics": null, "resp": null, "gmap_id": "0x886200e09e5cdb09:0xec31a4310d788318"}
{"user_id": "115051857275815814299", "name": "Carissa Clay", "time": 1549641930542, "rating": 5.0, "text": "The guys at Largen always do a great job! They are always professional. I definitely recommend them!", "pics": null, "resp": null, "gmap_id": "0x886200e09e5cdb09:0xec31a4310d788318"}
{"user_id": "109330293979145609721", "name": "Christopher Stewart", "time": 1564582269779, "rating": 5.0, "text": "Responsive and professional And always willing to go above and beyond to ensure customer satisfaction.", "pics": null, "resp": null, "gmap_id": "0x886200e09e5cdb09:0xec31a4310d788318"}
{"user_id": "105095734393443967003", "name": "Earkley Frazier", "time": 1548195687082, "rating": 5.0, "text": "Excellent service, great job", "pics": null, "resp": null, "gmap_id": "0x886200e09e5cdb09:0xec31a4310d788318"}
{"user_id": "117451265091161965586", "name": "Kenneth Smiley", "time": 1620349232323, "rating": 5.0, "text": "Thronzo and his team were responsive, professional, promptly detected and repaired the problem, and answered all of my questions.  I appreciate the quality work and excellent customer service.  I would definitely use them again.  Thank you.", "pics": null, "resp": null, "gmap_id": "0x886265c74864bd3d:0x5d1b40fd589f1f40"}
{"user_id": "107103058029679394030", "name": "Monica Pennywell", "time": 1618327746271, "rating": 5.0, "text": "I am so pleased with the work performed on my sprinkler system. I will definitely call them again.", "pics": null, "resp": null, "gmap_id": "0x886265c74864bd3d:0x5d1b40fd589f1f40"}
{"user_id": "103323310463922763623", "name": "F R", "time": 1596143619098, "rating": 5.0, "text": "I can’t say enough nice things about this business. I called yesterday afternoon and left a message inquiring about a repair. I received a call back the very next morning... but not just that, he was able to come out the same afternoon and take care of our problem. All other companies were unavailable for 2-3 WEEKS. The gentleman that came out was very thorough and professional. He took time to answer any and all of our questions. We will be recommending this business to others, as well as using again for ourselves in the future.", "pics": null, "resp": null, "gmap_id": "0x886265c74864bd3d:0x5d1b40fd589f1f40"}
{"user_id": "106102789553705040864", "name": "Judy Rudell", "time": 1598630488680, "rating": 5.0, "text": "Would highly recommend this company . When the need arises I will definitely use him", "pics": null, "resp": {"time": 1598645781468, "text": "Thank you! Glad you were pleased with your service."}, "gmap_id": "0x886265c74864bd3d:0x5d1b40fd589f1f40"}
{"user_id": "101573667230384220378", "name": "Eastwood", "time": 1570206831202, "rating": 5.0, "text": "I can’t say enough good things about BR Irrigation and Mr. Robinson. Very professional and knowledgeable. Went over and beyond my expectations and was fairly priced. I highly recommend using them for any irrigation repairs.", "pics": null, "resp": null, "gmap_id": "0x886265c74864bd3d:0x5d1b40fd589f1f40"}
{"user_id": "105004740675111610829", "name": "The_Red _Key", "time": 1588281833538, "rating": 1.0, "text": "These guys are hard to reach. Had to chase them down to schedule the work, then the day and time arrives for the work, no one here. Can't reach them. I'm the customer, should have to chase the business down. Plenty of other companies out there.", "pics": null, "resp": null, "gmap_id": "0x886265c74864bd3d:0x5d1b40fd589f1f40"}
{"user_id": "105842972940727316990", "name": "Brad D", "time": 1564017001418, "rating": 5.0, "text": "You'll notice a theme on this thread regarding BR Irrigation - speed, reliability, and quality.  In my time of need, they responded quickly and repaired a broken pipe and sprinkler head.  Responsive texts and emails before and after service highlighted their customer service approach and how seriously they take their business.  Call BR Irrigation for your irrigation needs - you will not regret.", "pics": null, "resp": null, "gmap_id": "0x886265c74864bd3d:0x5d1b40fd589f1f40"}
{"user_id": "102675714146398819308", "name": "Dedra Russell", "time": 1530142963727, "rating": 5.0, "text": "BR is very responsive and discussed all aspects of a broken line repair. I requested some easy access solutions and he implemented these successfully in quick order. Left the work area clean and put back together. Very professional persona and ease of doing business. I would highly recommend Thronzo.", "pics": null, "resp": null, "gmap_id": "0x886265c74864bd3d:0x5d1b40fd589f1f40"}
{"user_id": "100853670685145659222", "name": "G. Ald.", "time": 1564239063482, "rating": 5.0, "text": "Great, on time and completed the job with quality work and a fair price.", "pics": null, "resp": null, "gmap_id": "0x886265c74864bd3d:0x5d1b40fd589f1f40"}
{"user_id": "107149117735205436926", "name": "Jeffrey Wishik", "time": 1501875350570, "rating": 5.0, "text": "Made a appointment with BR irrigation and set a time. Thronzo was prompt and worked quickly to diagnose the problem that had plagued the sprinkler system this season. He was focused on the job at hand and wasted no time in executing the repair. Additionally, I had him replace the aged controller. He was patient to explain how to work the new controller and when complete , cleaned up the work area. He charged me a very fair price for the time spent and work accomplished. I would highly recommend this Veteran Owned Business and Navy veteran. I'll certainly use him again.", "pics": null, "resp": null, "gmap_id": "0x886265c74864bd3d:0x5d1b40fd589f1f40"}
{"user_id": "104363680724274460874", "name": "Abel Castillo", "time": 1488818551842, "rating": 5.0, "text": "Best irrigation company in town. Very reliable and knowledgeable. Very competitive prices as well.", "pics": null, "resp": null, "gmap_id": "0x886265c74864bd3d:0x5d1b40fd589f1f40"}
{"user_id": "113299786293958017792", "name": "Sonya Tejada", "time": 1539189643994, "rating": 5.0, "text": "He explained what was wrong was reasonable in the price and did the job in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x886265c74864bd3d:0x5d1b40fd589f1f40"}
{"user_id": "111393332280733106953", "name": "Robert Simpson", "time": 1551914816007, "rating": 1.0, "text": "I had and appt. With This company and Thronzo did not show up. It was very difficult to even contact him about his bid.", "pics": null, "resp": {"time": 1551928280688, "text": "Good evening, I apologize if that was your experience. However, I recall accommodating you by coming out to do measurements of your yard and explaining the quote thoroughly to you. The fact of the matter is I could not beat the bid from my competitor but it would only make sense that you go with them if a cheaper price is what you desire and not quality work. Please feel free to contact us if you have irrigation needs in the future."}, "gmap_id": "0x886265c74864bd3d:0x5d1b40fd589f1f40"}
{"user_id": "115893013642561135997", "name": "Tom Boehm", "time": 1580173848542, "rating": 5.0, "text": "Great company!", "pics": null, "resp": null, "gmap_id": "0x886265c74864bd3d:0x5d1b40fd589f1f40"}
{"user_id": "105766894597384567503", "name": "Brandon Hiller", "time": 1533130347600, "rating": 1.0, "text": "I was looking for a new irrigation company after a bad experience with another company. BR Irrigation was a no-show for a 8am appointment. I waited around 30 minutes. Wish I could leave a rating of 0 stars.", "pics": null, "resp": {"time": 1533160244838, "text": "First, I would like to offer my apologies for your experience with the company. However, on the day in question it rained and email notifications were sent out to my clients with  appointments scheduled on that day. I would love to make this right. Please contact me if you are interested so I can rectify this issue."}, "gmap_id": "0x886265c74864bd3d:0x5d1b40fd589f1f40"}
{"user_id": "101511926889233436583", "name": "April Kindley", "time": 1623441951488, "rating": 5.0, "text": "I work there its great", "pics": null, "resp": null, "gmap_id": "0x887d4f0c893a4e7f:0x8161a07c32a20ef0"}
{"user_id": "107816208558184716209", "name": "Donnie Armstead", "time": 1612727484233, "rating": 2.0, "text": "I wouldn't rent on or let him cut my grass so unprofessional", "pics": null, "resp": {"time": 1612795008390, "text": "Hi, Donnie Armstead As a growing, local business, we take these matters very seriously. Our company does not rent properties, and we have no record or recollection of any customer interaction fitting this account description for lawn maintenance services. If this is not a true client account, we ask this review be removed promptly to ensure our true clients and employees can be a part of Coldwater Landscapes for years to come."}, "gmap_id": "0x887d4f0c893a4e7f:0x8161a07c32a20ef0"}
{"user_id": "110623204199900896045", "name": "GORDON HOOD", "time": 1608266081538, "rating": 5.0, "text": "Their staff is always friendly and professional.", "pics": null, "resp": null, "gmap_id": "0x887d4f0c893a4e7f:0x8161a07c32a20ef0"}
{"user_id": "112910023241090083448", "name": "Jenna Richardson", "time": 1605458121677, "rating": 5.0, "text": "Great company with fantastic employees!", "pics": null, "resp": null, "gmap_id": "0x887d4f0c893a4e7f:0x8161a07c32a20ef0"}
{"user_id": "103292918713278990202", "name": "Melissa Scofield", "time": 1592357464516, "rating": 5.0, "text": "They did a great job on our fence! I’m so glad we chose them and will recommend them from now on!", "pics": null, "resp": {"time": 1592400566701, "text": "Thank you, Melissa!"}, "gmap_id": "0x887d4f0c893a4e7f:0x8161a07c32a20ef0"}
{"user_id": "113888365716492352766", "name": "James Kaye", "time": 1522723197916, "rating": 1.0, "text": "The landscape designer and lawn care specialists came out to my home to go over what I was looking to do, but after going over the details nothing they came back with was even close to what we discussed. I told the lawn care guy that I wanted to fill in my grass with more St. Augustine, and do a more vigorous regimen to make it look like a golf course. All he sent me was the same thing trugreen did, but double the price. The designer told me she needed 2 weeks to get the plan together, but after 4 weeks she wouldn’t return my calls, and after finally getting her on the phone over a month later, acted surprised that I didn’t receive her email and said she’d resend, never received any email from her. Go somewhere else, because they must not be hurting for business.", "pics": null, "resp": null, "gmap_id": "0x887d4f0c893a4e7f:0x8161a07c32a20ef0"}
{"user_id": "107129421728918781728", "name": "Neel Shukla", "time": 1542636822993, "rating": 1.0, "text": "Did not provide service that was agreed upon.  Strung along with little to no communication for months, preventing me from using another service since the job can't be done during the wet fall/winter. As of now, I haven't heard from them for 4 months! Unacceptable!\n\nI'm surprised to see such good reviews based on my own experience. Probably fake reviews from employees or family.\n\nBecause they don't communicate and have screwed me over for the year,  I don't think I trust then for any future service", "pics": null, "resp": null, "gmap_id": "0x887d4f0c893a4e7f:0x8161a07c32a20ef0"}
{"user_id": "116170205953654729496", "name": "Josh Martin", "time": 1587707065092, "rating": 5.0, "text": "Great work those guys do", "pics": null, "resp": null, "gmap_id": "0x887d4f0c893a4e7f:0x8161a07c32a20ef0"}
{"user_id": "105734223164660320772", "name": "Michael Henderson", "time": 1576265415635, "rating": 5.0, "text": "Excellent service!", "pics": null, "resp": {"time": 1579554230165, "text": "Thanks, Michael!"}, "gmap_id": "0x887d4f0c893a4e7f:0x8161a07c32a20ef0"}
{"user_id": "109867373327648303697", "name": "Donna Robbins", "time": 1541541808693, "rating": 5.0, "text": "Huge professional co", "pics": null, "resp": null, "gmap_id": "0x887d4f0c893a4e7f:0x8161a07c32a20ef0"}
{"user_id": "106392566250398858561", "name": "cody butler", "time": 1530075595544, "rating": 5.0, "text": "Hard workers", "pics": null, "resp": null, "gmap_id": "0x887d4f0c893a4e7f:0x8161a07c32a20ef0"}
{"user_id": "114821182625171371221", "name": "Mario Cordero", "time": 1601298715159, "rating": 5.0, "text": "(Translated by Google) Good\n\n(Original)\nBueno", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP_0bdwStik8YSBfgVfawCfURSr9zye_PZcJ59-=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d4f0c893a4e7f:0x8161a07c32a20ef0"}
{"user_id": "105021170578529876646", "name": "Chase Nelson", "time": 1583948600685, "rating": 5.0, "text": "Exceptional service!", "pics": null, "resp": null, "gmap_id": "0x889a56932cd1e833:0xcc0b30178b288a19"}
{"user_id": "117800201747788959973", "name": "Perren king", "time": 1601254320323, "rating": 5.0, "text": "Blackman Plumbing consistently does a fantastic job and is beyond reliable!\nBeen a customer for over 10 years.", "pics": null, "resp": null, "gmap_id": "0x88891b90ffffffff:0x1d8b4d271414b610"}
{"user_id": "113565461842112789097", "name": "Eric Jones", "time": 1609270455987, "rating": 5.0, "text": "Honest pricing and great work.", "pics": null, "resp": null, "gmap_id": "0x88891b90ffffffff:0x1d8b4d271414b610"}
{"user_id": "100339561525188928549", "name": "Melissa Macon", "time": 1623682979820, "rating": 5.0, "text": "Great company", "pics": null, "resp": null, "gmap_id": "0x88891b90ffffffff:0x1d8b4d271414b610"}
{"user_id": "103850053257637043999", "name": "Doug Wylie", "time": 1492608210659, "rating": 5.0, "text": "I contacted Mark to help me move some sprinkler heads and help me plan out a new flower bed. His guys came by the next day to evaluate the situation. Mark quoted me a price quickly and they started and finished the job the Friday of the next week. Everything works well and they left the yard in great shape. I'm very pleased.", "pics": null, "resp": null, "gmap_id": "0x88891b90ffffffff:0x1d8b4d271414b610"}
{"user_id": "102483612864661563391", "name": "Ephram Hill", "time": 1603802765931, "rating": 5.0, "text": "Love working here", "pics": null, "resp": null, "gmap_id": "0x88891b90ffffffff:0x1d8b4d271414b610"}
{"user_id": "113620428100327439122", "name": "Matthew Kendrick", "time": 1440298604953, "rating": 5.0, "text": "Love working for Mr Blackman. He really a good guy and we try to do our best on every job", "pics": null, "resp": null, "gmap_id": "0x88891b90ffffffff:0x1d8b4d271414b610"}
{"user_id": "104860846401461641263", "name": "Popi Bear (PopiShop)", "time": 1616699648734, "rating": 5.0, "text": "Great company", "pics": null, "resp": null, "gmap_id": "0x88891b90ffffffff:0x1d8b4d271414b610"}
{"user_id": "111227672983476394963", "name": "patrick bradford", "time": 1564691457666, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x88891b90ffffffff:0x1d8b4d271414b610"}
{"user_id": "109763919170171023509", "name": "Wayne Blockel", "time": 1609251961638, "rating": 5.0, "text": "Always make time for emergencies and arrive on time and are very professional.  I've used them several time for both emergency and non-emergency calls and they have been great!  Highly recommend Sprinkler Medic for all your irrigation system needs.", "pics": null, "resp": null, "gmap_id": "0x88623d71d3116245:0x21416632d410be18"}
{"user_id": "104806980006771369341", "name": "Terry Brown", "time": 1589724396489, "rating": 5.0, "text": "They were quick reacting on a Saturday evening  to evaluate my leak and had it rebuilt by Sunday  morning,  830. The leak was after the main cutoff and before the sprinkler cutoff so the main would have had to be off to stop it from leaking. They also redesigned the the whole line from the main cutoff  to the sprinkler cutoff making it up to code and functionally perfect. You can barely tell they were there so clean up was excellent too. I will use them in the future.", "pics": null, "resp": null, "gmap_id": "0x88623d71d3116245:0x21416632d410be18"}
{"user_id": "112711788429308171953", "name": "Johnnie Grate", "time": 1605644687921, "rating": 5.0, "text": "Sprinkler Medic came to perform irrigation winterization.  They were prompt, thorough, and courteous.  The previous irrigation company (Raintree Sprinkler Systems) was just the opposite in every way.  I highly recommend Sprinkler Medic for your irrigation needs.", "pics": null, "resp": {"time": 1605646256620, "text": "Thank you for the great review! We look forward to working with you in the future and greatly appreciate your business!"}, "gmap_id": "0x88623d71d3116245:0x21416632d410be18"}
{"user_id": "115866229267767467874", "name": "Dissatisfied Customer", "time": 1601340777507, "rating": 2.0, "text": "Promptly paid for 10min service call. Representative failed  to provide a quote on ways to improve my current irrigation system. Called to follow up on the quote with no response.", "pics": null, "resp": null, "gmap_id": "0x88623d71d3116245:0x21416632d410be18"}
{"user_id": "112630775332757183551", "name": "John Jeffery", "time": 1592607198404, "rating": 5.0, "text": "Josh was on time, fast and professional.  Highly recommended!!!", "pics": null, "resp": null, "gmap_id": "0x88623d71d3116245:0x21416632d410be18"}
{"user_id": "108191505809021863012", "name": "Carlos M. Fernandez", "time": 1556107531597, "rating": 5.0, "text": "Awesome response time. Josh was super helpful, understanding and accommodating. Highly recommend. Thanks for your business ethics.", "pics": null, "resp": {"time": 1556234290828, "text": "Thank you Carlos! We appreciate the business and great review!"}, "gmap_id": "0x88623d71d3116245:0x21416632d410be18"}
{"user_id": "107787934727938286030", "name": "Chris Henke", "time": 1525907352366, "rating": 5.0, "text": "I called them because my system was constantly running if the water main was open. They came out the following day and had it running properly in just a few minutes. Their price is fair, and from my experience fast service and no hassle. I will call them again for future sprinkle system needs. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88623d71d3116245:0x21416632d410be18"}
{"user_id": "104607497191307776971", "name": "John", "time": 1558122680807, "rating": 5.0, "text": "Found problems with my system. Gave me details on what repairs were required. The price was great, the work was done quickly ,yard was left clean and I would use this company again if needed.", "pics": null, "resp": null, "gmap_id": "0x88623d71d3116245:0x21416632d410be18"}
{"user_id": "115628715030367909975", "name": "Aaron Atkins", "time": 1499367533881, "rating": 5.0, "text": "I had a non-functioning sprinkler system I was delaying on repair, and Chris and team had everything working in just a few hours!  I'm not sure why I even put it off...Excellent customer service, great price, very professional!  Highly recommended.", "pics": null, "resp": {"time": 1499375922543, "text": "Thanks so much for the kind words Aaron! Glad we could get your sprinkler system sorted out and back on track.\n\nLooking forward to working with you in the future!"}, "gmap_id": "0x88623d71d3116245:0x21416632d410be18"}
{"user_id": "104024989838879958310", "name": "Laura Seeber", "time": 1574187390871, "rating": 5.0, "text": "Can't say enough good things about Josh and Sprinkler Medic! I had a prob with another company that hit my sprinkler system and Josh went ahead and dealt directly with them since they were the ones paying. A LOT of calls and red tape. He got my sprinkler system all fixed and as a side effect a few other sprinklers weren't working because of dirt clogs from all the work and mishaps. He came back out and fixed everything. Great job and stands by their work.", "pics": null, "resp": {"time": 1574192680802, "text": "Thank you so much for the great review! We look forward to doing business with you in the future."}, "gmap_id": "0x88623d71d3116245:0x21416632d410be18"}
{"user_id": "105025129243569269540", "name": "Caren Bevill", "time": 1550176231697, "rating": 5.0, "text": "Called to locate valves lost by cable contractors and Josh was quick and professional.  Would call again if I needed sprinkler related assistance.", "pics": null, "resp": null, "gmap_id": "0x88623d71d3116245:0x21416632d410be18"}
{"user_id": "106031162732821150030", "name": "jarrod lancaster", "time": 1541650357493, "rating": 5.0, "text": "Josh and Chris went the extra mile to ensure a flawless repair. Highly recommend their services for anyone looking for irrigation repair or service.", "pics": null, "resp": {"time": 1541686984785, "text": "thank you jarrod, we look forward to working with you in the future!"}, "gmap_id": "0x88623d71d3116245:0x21416632d410be18"}
{"user_id": "104818228813439804237", "name": "Jeremy Owen", "time": 1554722967119, "rating": 5.0, "text": "Great group of people, fair prices and very professional.", "pics": null, "resp": null, "gmap_id": "0x88623d71d3116245:0x21416632d410be18"}
{"user_id": "111204950488114367741", "name": "Dallas Phillips", "time": 1508548220923, "rating": 1.0, "text": "This company came quickly but I made mistake of not asking for price. I figured at most it would be $100. The job was installing 1ball valve and about18 inches of pvc pipe.I already had the pipe exposed.I was charged $170. He said the rate was $85 a hour with a two hr. Minimum. At that rate this company should be rich. For 8 Hours of work that would be $680 a day. He worked about 15 minutes AND WAITED for 30 minutes for glue to set.Pretty good money for a sprinkler repairman. I don't know if doctors make that much?", "pics": null, "resp": {"time": 1508549220285, "text": "680$- parts, insurance(we do carry it unlike others), fuel, service van (with paint still attatched), service technicians (in uniform, not a “work for beer t-shirt”)  and a guarantee that is actually worth something... ? Sounds like you got a great deal. We aren’t doctors, we are great irrigation repair technicians. Thank you for the business. We hope to serve you in the future."}, "gmap_id": "0x88623d71d3116245:0x21416632d410be18"}
{"user_id": "104958206980022264663", "name": "Casey Perkins", "time": 1533309083128, "rating": 3.0, "text": "I used them in the past and the quality of the work was great. They did state they would tidy up some spaghetti wires on one of the sprinkler boxes that they did not do. I am assuming because the project was more labor intensive than he had expected so cut his loss. Tried to get them to come out to give me a quote to move some sprinkler heads. The appointment got cancelled then rescheduled by them. The 2nd appointment they was a no show and did not call to reschedule. I am assuming it is a busy time and probably forgot to put it on his appointment book since it was a Saturday quote. But still I felt it should be noted and after looking at other companies this appears to be a pattern for this time of the year (April-September).", "pics": null, "resp": null, "gmap_id": "0x88623d71d3116245:0x21416632d410be18"}
{"user_id": "115495312577891916402", "name": "Sherman Ellis", "time": 1627595043565, "rating": 1.0, "text": "The co owner has personal  problems.", "pics": null, "resp": null, "gmap_id": "0x88623d71d3116245:0x21416632d410be18"}
{"user_id": "114236143108032693595", "name": "Charles Moore", "time": 1592593692020, "rating": 5.0, "text": "Called Ray this morning for some work on our sprinkler system.  He said they were very busy and it might be a couple of weeks before they could get to us.  SURPRISE SURPRISE They just showed up @ 2:00 and fixed all of the issues.   Great company, respectful and competent.", "pics": null, "resp": null, "gmap_id": "0x8862815f0debfa05:0x1a286e0cff94132b"}
{"user_id": "104687289553243249959", "name": "Jimmy Ray Smith", "time": 1621386831054, "rating": 5.0, "text": "Got me hydrated Thank you Rea and Eric", "pics": null, "resp": null, "gmap_id": "0x8862815f0debfa05:0x1a286e0cff94132b"}
{"user_id": "110135168316881936853", "name": "Melissa Chatagnier Isaac", "time": 1533058546705, "rating": 5.0, "text": "Patrick with Water Water Everywhere is wonderful.  He did some repairs on the commercial sprinkler / irrigation system at my business.  He arrived when he said he would, did a great job and the pricing was fair.  We will use Water Water in future for all of our commercial and residential irrigation needs.", "pics": null, "resp": null, "gmap_id": "0x8862815f0debfa05:0x1a286e0cff94132b"}
{"user_id": "112755486782883809657", "name": "Lori Barlow", "time": 1588868720250, "rating": 5.0, "text": "The BEST!!! The most professional, dependable, quality landscaping company I’ve ever had and I’ve tried several! My turf, landscaping and hardscapes have never looked better!", "pics": null, "resp": null, "gmap_id": "0x888834d64fc7938d:0x5d2da587ff59b531"}
{"user_id": "109558446923870051142", "name": "sbjraley", "time": 1620772851636, "rating": 4.0, "text": "They have good reviews so I tried to get them to come out to do some repair work on our sprinkler system but I could never get them to show up. They told me three separate times that they would come out but each time they never showed up. So I guess if you can get them to actually show up it sounds like they'll do a good job, unfortunately I never could.\n\nUpdate: The owner contacted me and and explained that they were swamped with work and was very eager to make things right. So even though things didn't work out this time I would definitely call them again if I needed some landscaping or irrigation work done.", "pics": null, "resp": null, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "110883085503045329065", "name": "West Bay Landscape & Lawn Maintenance", "time": 1605843322687, "rating": 5.0, "text": "Awesome Service!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMZusXnOzX2Glwr4z2trF5cLXU6yU-o-X0PqQQb=w150-h150-k-no-p"]}], "resp": {"time": 1481738703610, "text": "Thanks!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "100107957332353639332", "name": "Kayla Outlaw", "time": 1621548349106, "rating": 5.0, "text": "Great Service! Always on time and professional. Awesome company to do business with! Prices are very reasonable!", "pics": null, "resp": null, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "111289579857277079602", "name": "Tim Miller", "time": 1620827199211, "rating": 5.0, "text": "Terry and his crew were hard workers and very careful that they did the job right and to my satisfaction. West Bay installed an irrigation system in my front yard, prepped the yard for sod, installed borders around flower beds,  and then laid five flats of Zoysia Palisade in my front yard. I love how my front yard looks now. Thank you West Bay Landscaping!!", "pics": null, "resp": {"time": 1620957598509, "text": "Thank you Mr Miller!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "105980869850876305220", "name": "chad rubira", "time": 1620828292910, "rating": 5.0, "text": "Terry and team were great from start to finish with all the services they performed for us.  Everything they did we were very pleased with and would highly recommend to anyone.", "pics": null, "resp": {"time": 1620957614002, "text": "Thank you !"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "103040575068831619087", "name": "Cindy Barnes", "time": 1620936789424, "rating": 5.0, "text": "We have been using West Bay for several years! We had them re-sod our front yard last year! Highly recommend!", "pics": null, "resp": {"time": 1620957657507, "text": "Thank you Mrs Barnes!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "101301790414866698169", "name": "Jerry Cowart", "time": 1620830054283, "rating": 5.0, "text": "Been using Westbay for several years.  Terry and the guys do great work for a reasonable price!", "pics": null, "resp": {"time": 1620957627993, "text": "Thank you Mr Cowart!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "115119229252188212886", "name": "Kyle Urrutia", "time": 1616538067391, "rating": 4.0, "text": "They where slow to respond  for a quote, but seem eager to make things right.", "pics": null, "resp": {"time": 1616537282410, "text": "Hi Kyle! I think we just spoke with you. Thank you!!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "106825364464371070984", "name": "Mayme Vestal", "time": 1488561472589, "rating": 5.0, "text": "I had a bit of an emergency to get my yard cleaned up on a big time crunch. Terry came out to the house, gave me a very reasonable estimate, and was able to squeeze me into their schedule and get the job done on time for me and salvage the total mess that was my yard. I'll absolutely be continuing to use them for regular maintenance now!", "pics": null, "resp": {"time": 1488562861998, "text": "Thank you Mayme!!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "104289261376495978649", "name": "All Weather Roofing and Construction", "time": 1488336371284, "rating": 5.0, "text": "These guys have been doing our lawn and maintenance for four years now.  They produce an excellent product and great customer service. Very convenient.  We have used him for lawn care, sprinkler system, new sod  and shrubs", "pics": null, "resp": {"time": 1488337009203, "text": "Thanks Chris!!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "103193693483774268080", "name": "The Tax Specialist “My Tax Professionals” Rachael Cain-Hilburn", "time": 1605842788551, "rating": 5.0, "text": "I highly recommend West Bay Landscape & Lawn. They always do an awesome job. Beautiful and creative landscaping designs. I'm very pleased with their work and customer service.", "pics": null, "resp": {"time": 1483503671407, "text": "Thank you!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "113852913662755170328", "name": "Danielle Mcpeak", "time": 1483416831637, "rating": 5.0, "text": "I called West Bay and spoke to a Mr Terry , nice guy with amazing workers. It looked like a tornado hit my yard and more. He came out gave me a wounderful price that was better than the others that came out. And a day or so later his guys came out and did wounders; I couldnt believe it was more than i imaged. You and your team are amazing and i will be referring you to all my family and friends again, Thank you!!", "pics": null, "resp": {"time": 1483503681998, "text": "Thank you!!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "117174068418916016745", "name": "Xtreme Turf Lawn Care", "time": 1464991065729, "rating": 5.0, "text": "Terry is one of the most knowledgeable landscapers around. Him and his team provide outstanding service.", "pics": null, "resp": {"time": 1465008253538, "text": "Thanks!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "116183279826596172022", "name": "Cory Walz", "time": 1483739720026, "rating": 5.0, "text": "Excellent business with a very professional attitude, my yard looks clean all the time thanks to West Bay.", "pics": null, "resp": {"time": 1483747686885, "text": "Thanks Cory!!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "112249087028949117720", "name": "K H", "time": 1555551640456, "rating": 1.0, "text": "Called for a bid on wednesday. Said they would come by by Friday. Never showed up. Tried to call back and went straight to voicemail. Unprofessional.", "pics": null, "resp": {"time": 1610344623916, "text": "I’m sorry I think you have the wrong company. Good luck to you."}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "104152812424341423284", "name": "Valentin Diaz", "time": 1501103735261, "rating": 5.0, "text": "The workers are very proffecional and the managers are great. I worked for them before and on friday july 24  2017 or close to that date on a friday i almost had a heat stroke and the manager right away knew what was going on with me and took care of me, gave me the right amount of gatorade and water mix to hydratate me, put me on the ac and keep an eye on me untill i was able to go home by my self. Not only that!!!! He drive me to the yard where i had my car and gave me enough hours on my ticket from labor finders. Great people very profecional and compacionate with the workers and costumers. I love them, you cant beat the system they got.", "pics": null, "resp": {"time": 1518572548422, "text": "Thank you!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "101926194667689072560", "name": "Richard Kuffskie", "time": 1479424462170, "rating": 5.0, "text": "Great service I've ever had thanks to West Bay Landscaping", "pics": null, "resp": {"time": 1479424705052, "text": "Thanks Richard!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "108826582431594221222", "name": "Landon Cooper", "time": 1480111646848, "rating": 5.0, "text": "Amazing, Cut's very clean and straight lines. Works with your schedule.", "pics": null, "resp": {"time": 1481738689058, "text": "Thank you!!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "108362703294568641052", "name": "Myron Grimes", "time": 1464832370745, "rating": 5.0, "text": "Awesome work !! My home has never looked so Great!! Thanks Terry and guys for all the hard work!! You guys Rock!!", "pics": null, "resp": {"time": 1464832939005, "text": "Thanks Myron!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "117534621382331232845", "name": "jerry laster", "time": 1483031139691, "rating": 5.0, "text": "Great Work!!", "pics": null, "resp": {"time": 1483059553321, "text": "Thank you"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "109866313010560371248", "name": "tony laster", "time": 1480111400172, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1481738673944, "text": "Thank you!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "115150081230797332342", "name": "Kyle P", "time": 1479424288967, "rating": 5.0, "text": "Great Service!!!", "pics": null, "resp": {"time": 1479424718609, "text": "Thanks Kyle!"}, "gmap_id": "0x889a4c593665a859:0x98a937201514a038"}
{"user_id": "116093588171461617329", "name": "Donna Dannelly", "time": 1584712821311, "rating": 5.0, "text": "Excellent crew, they show up ready to work with great attitudes and professionalism and do an excellent job, that exceeds the norm!", "pics": null, "resp": null, "gmap_id": "0x888e871fb397052d:0x34843ec88fb63153"}
{"user_id": "117582627411536480960", "name": "Bert Jackson", "time": 1559596050060, "rating": 5.0, "text": "These guys came out and repaired an irrigation system for me that busted suddenly and spewed out gallons of water per minute.  I called and informed the receptionist Connie that the irrigation system ruptured and due to this, I had to turn off the main water supply to my home.  Connie escalated the work order and sent a crew out the same day.  The men that came out were very professional and courteous. I must say that I am very satisfied with the work they did and with the professionalism and great customer service of this company.  I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x888e871fb397052d:0x34843ec88fb63153"}
{"user_id": "104124944625400244842", "name": "Thumper Thompson", "time": 1593912035107, "rating": 5.0, "text": "The best in the business!!", "pics": null, "resp": null, "gmap_id": "0x888e871fb397052d:0x34843ec88fb63153"}
{"user_id": "100397103450225860174", "name": "niki ferguson", "time": 1613956793755, "rating": 4.0, "text": "Shayne and his crew did a great job building our retaining wall and walk way for us.  They showed up on time, clean up after themselves and were really nice. Our pavers that are around our pool got discontinued and Shayne went above and beyond to try to find pavers that matched as close as possible to what we had.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOV025KQeuvaOk0KauumTFTMDDOrh3wX1QIXj5s=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP9130OzM9oXsah7rEiJXXL3ZjT_ZkGzKhATAz8=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
{"user_id": "113428867666718924846", "name": "Alec Ross", "time": 1590804421340, "rating": 5.0, "text": "Needed a footer added on to my existing patio. Came in at a great price and quick response. Always friendly great quality of work. The team that came out was great and worked fast. Will use again! Give them a call!", "pics": null, "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
{"user_id": "117280148075030443179", "name": "LeWaire Waycaster", "time": 1576811336932, "rating": 5.0, "text": "Bayshore has completely landscaped our home including custom lighting and a circle drive. I wish I could give them the stars!! They always go above and beyond to provide excellence.", "pics": null, "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
{"user_id": "114486160015174910471", "name": "tiffany passarelli", "time": 1599528600564, "rating": 1.0, "text": "Very unhappy!  12 months later and we are still waiting on major warranty work to be performed.  Shayne will not return our phone calls, text messages or emails. He took our money and ran....", "pics": null, "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
{"user_id": "106905909530809960403", "name": "Steve Perry", "time": 1554678186925, "rating": 5.0, "text": "Shayne and the guys at Bayshore have done several projects (flower beds, fire pit, pergola, sod replacement, sod replacement and maintenance) at our house and have done a wonderful job. Shayne is great at providing attention to detail and ensures that you are pleased with the project. Highly recommended!!!", "pics": null, "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
{"user_id": "114012249527997396237", "name": "Amymarie McKnight", "time": 1554835121491, "rating": 5.0, "text": "Bayshore Landscapes has been maintaining my lawn for over 6 years. The guys are hard workers & always do a professional job!  They have great costumer service skills. I highly recommend Bayshore Landscapes!!\n\nAmy McKnight", "pics": null, "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
{"user_id": "100742908492112190911", "name": "Kevin Brane", "time": 1554514750690, "rating": 5.0, "text": "The folks at Bayshore Landscapes put in an outdoor kitchen for us. Excellent job, timely and professional. We were very pleased. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x889a6b737cadc5fb:0x3fb5b0842092549c"}
