{"user_id": "111191887360296604052", "name": "Sanquinetta Sanford", "time": 1616389481214, "rating": 5.0, "text": "Mr. Richard Bite has helped my family through numerous occasions.  My brother was facing 34 years to life and he got it down to 3 years. I am grateful and thankful for his dedication, his loyalty, his passion, his truth, his understanding, and his never ending consistency in seeing the case through to the end. May God continue to watch over you and your family as you have watch over mine!!!", "pics": null, "resp": null, "gmap_id": "0x88891b9063d4869b:0x9463caa5d9aaf877"}
{"user_id": "106055721317178664699", "name": "Jerry Cornett", "time": 1611206238253, "rating": 5.0, "text": "You should retain him and keep him on speed dial . Remain silent when arrested ( always) and wait on the man to do his job . I know half dozen people that would be sitting out long prison sentences . M y brother faced 25 to life he did 2 years in the county jail waiting on the grand jury . Thanks to Mr. Bote my brother got time served and was set free . The 2 years in the county sucked but vs 25 to life it was nothing Richard also he gave us free advice that saved my family over 10 dollars on a properpty suit . He is by far the best attorney in this state . Sadly i know this through trial and error with other lawyers .", "pics": null, "resp": null, "gmap_id": "0x88891b9063d4869b:0x9463caa5d9aaf877"}
{"user_id": "103673778221183691056", "name": "Kim Beasley", "time": 1612873878190, "rating": 5.0, "text": "Richard Bite is the best! His assistant Vicki Moore is a sweetheart and very resourceful.", "pics": null, "resp": null, "gmap_id": "0x88891b9063d4869b:0x9463caa5d9aaf877"}
{"user_id": "108158776707202943378", "name": "Ted Tavel", "time": 1598881431243, "rating": 5.0, "text": "The best lawyer in the ham. No doubt.!", "pics": null, "resp": null, "gmap_id": "0x88891b9063d4869b:0x9463caa5d9aaf877"}
{"user_id": "107143180843019504344", "name": "Jen Roper", "time": 1539791921601, "rating": 5.0, "text": "This is one of the best attorneys I’ve ever met. Informative, smart, and actually cares about your circumstances.\nHighly recommended", "pics": null, "resp": null, "gmap_id": "0x88891b9063d4869b:0x9463caa5d9aaf877"}
{"user_id": "100898507935879770223", "name": "don't sub ok don't like ok", "time": 1569544021288, "rating": 4.0, "text": "Good service and honest ppl", "pics": null, "resp": null, "gmap_id": "0x88891b9063d4869b:0x9463caa5d9aaf877"}
{"user_id": "101989685145200575918", "name": "Donna Alexander", "time": 1529166167429, "rating": 5.0, "text": "Sweet man. Very knowledgeable!", "pics": null, "resp": null, "gmap_id": "0x88891b9063d4869b:0x9463caa5d9aaf877"}
{"user_id": "101285222423937990389", "name": "Elizabeth Floyd", "time": 1460108703773, "rating": 5.0, "text": "I was being charged with 2 felonies and had never been in trouble.. I was 23 and scared to death! I called Mr. Bite at 5:53 a.m. I knew the sheriff was there to take me in. I called and he answered and was right down to the county shortly after... To make a long story short the felonies are not on my record! ( Thank God). I had to do my part too now however Mr. Bite basically SAVED MY LIFE! It's not what you know it's who you know and this man knows the judges and the DA's.. They make the decision. I would absolutely recommend him for any type of trouble.", "pics": null, "resp": null, "gmap_id": "0x88891b9063d4869b:0x9463caa5d9aaf877"}
