{"user_id": "108744766922822959701", "name": "Steve Mid TN T-Trak / Chicago & SouthEastern MRR", "time": 1431896922347, "rating": 2.0, "text": "Potentially great suite of Laser Cutters & 3D Printers. However preventive maintenance was lacking, I talked with two of the owners about it , Rob & Tia.   Both seemed to accept the high down time as normal.    Rob terminated my membership because he said I had too high of expectation equipment being available.   Despite lack of operating equipment classes for laser cutter & 3D Printing were held with out hands-on experience for students.    On the positive side I was offered refund of the monthly membership fee of $60.", "pics": null, "resp": null, "gmap_id": "0x88626f9d88f8c5ff:0xb9035101853c3ea9"}
{"user_id": "110941287079191714191", "name": "D.R. Whitson", "time": 1438982104365, "rating": 1.0, "text": "We received our Astrolabes we ordered after it taking 4-5 weeks of waiting and then shipping.  They were made of cheap white plastic and were packed terribly. I actually had to put one back together because it was falling apart as i took it out of the package. There were ink smudges in numerous spots on both astrolabes.  They just looked cheap and I was definitely not going to give them as a gift.  Plus it didn't even come with any instructions on how to use it.  Overall they were very poor quality and I'm asking for my refund.", "pics": null, "resp": null, "gmap_id": "0x88626f9d88f8c5ff:0xb9035101853c3ea9"}
{"user_id": "116823831873546833476", "name": "Heather Mckee", "time": 1617843607240, "rating": 5.0, "text": "My children have attended daycare here for the past two years and now my daughter attends their preschool program. Each staff member has loved and treated them like family from the very beginning. Since changing jobs last year, I've added over an hour commute to my daily drive just to keep my children enrolled at Kiddie Care Learning Center. There isn't a daycare in the Wiregrass that could take Kiddie Care's place. If your children aren't enrolled here get them enrolled. If there's a waitlist secure a spot. Coming from a single mother of four, you won't regret it!", "pics": null, "resp": null, "gmap_id": "0x88928d81ba64b309:0xda10f5fbbeeb5258"}
{"user_id": "103822727042565062451", "name": "Angie West-Mendez", "time": 1607103106442, "rating": 5.0, "text": "I absolutely love Kiddie Care Learning Center. I never sent my oldest two children to daycare, so I was worried when I had to find a place for my third child. From day one, I fell in love with Kiddie Care. The staff has taken care of my daughter since she was six-weeks old and I have never had an issue. They are very caring and it shows since my daughter loves being there. I cannot recommend them enough.", "pics": null, "resp": null, "gmap_id": "0x88928d81ba64b309:0xda10f5fbbeeb5258"}
{"user_id": "103645414596335204810", "name": "Fran Ramsey", "time": 1612105504566, "rating": 5.0, "text": "I love this school! My kids have been going here since they were infants, and they are now 8 and 4! My kids feel safe, the teachers are great and they’re learning is phenomenal!", "pics": null, "resp": null, "gmap_id": "0x88928d81ba64b309:0xda10f5fbbeeb5258"}
{"user_id": "104401329224928516704", "name": "Trai-Vana Griffin", "time": 1560479971153, "rating": 5.0, "text": "Kiddie Care Learning Center is one of the best childcare facilities that I have worked at.\n\nAs a parent I know my children are safe, it was tough in the beginning because they have only stayed with my mom but now they love it and they come home everyday talking about their teachers, friends, and what all they have learned in class. You will not go wrong choosing Kiddie Care for your child(ren).", "pics": null, "resp": null, "gmap_id": "0x88928d81ba64b309:0xda10f5fbbeeb5258"}
{"user_id": "108822714133356805113", "name": "Allie Lam", "time": 1539881218844, "rating": 2.0, "text": "I just recently moved my child to a different daycare after being at this one for 9 months. And honestly it was the best thing for me to do and should have done sooner. I really did enjoy him going to Kiddie Care in the beginning. A couple of months into him going was when the problems started. Teachers were not consistent in the class rooms. It seemed like there was a new teacher in the class room every few weeks. The classrooms are over-crowded with kids. I had problems with a couple of his teachers. One of them told him that he could lay in his urine after he told her that he had wet himself at nap time. I told the co-director and she did write the teacher up and moved my child to a different class. And recently I learned that at times when kids are eating, if they talk, their food gets taken away. There is also a write up system which I think is ridiculous. Most of the write ups were things normal 3 year old boys do. Even his teacher said he’s just being a boy on most of them, yet they write them up anyways. His most recent teacher always seemed to have a bad attitude in the mornings and wasn’t a cheery person whatsoever. The co-director tried helping me with some issues I was having but in the end it just wasn’t enough. My child was not happy going to daycare anymore. He started his new daycare on Monday and I can already tell a difference in him. He’s so much happier when he gets home. I’m giving it 2 stars because the co-director was nice and there were a couple of teachers I did appreciate. I would not recommend this daycare to anyone.", "pics": null, "resp": null, "gmap_id": "0x88928d81ba64b309:0xda10f5fbbeeb5258"}
{"user_id": "106312789177278472233", "name": "Amber Mcclendon", "time": 1560287873254, "rating": 5.0, "text": "I highly recommend Kiddie Care Learning Center the staff there is very loving and caring I know they have taken care of my baby like he's their own the staff is amazing", "pics": null, "resp": null, "gmap_id": "0x88928d81ba64b309:0xda10f5fbbeeb5258"}
{"user_id": "106895934468775600585", "name": "Amanda Perez", "time": 1429200598873, "rating": 5.0, "text": "This is a wonderful place.  My daughter loves going here she loves all of the teachers.  She gets so excited to as soon as she sees the center.  Everyone is very kind and loving.", "pics": null, "resp": null, "gmap_id": "0x88928d81ba64b309:0xda10f5fbbeeb5258"}
{"user_id": "111103622398375067477", "name": "Keisha Sellers", "time": 1502456266592, "rating": 5.0, "text": "My daughter went to this center and they are wonderful. She attended the PreK program and when she did her kindergarten testing she scored 103 out of 105! It's an excellent place for your children to gain knowledge!", "pics": null, "resp": null, "gmap_id": "0x88928d81ba64b309:0xda10f5fbbeeb5258"}
{"user_id": "102386024241517614563", "name": "Tyler P", "time": 1393452129327, "rating": 3.0, "text": "The staff was generally nice and handled my kids very well but I cannot say the same for how situations are handled there. In short we had issues with everything from bullying to letting children listen to news in the van about rape or murder or listen to rap with language that isn't fit for me let alone my kids. Read your contract carefully. I wouldn't say i hated it or really disliked it but i can tell you I wouldn't recommend it. Loved Ms. Rochelle there tho. If she had her own place I would gladly take my kids to her anytime.", "pics": null, "resp": null, "gmap_id": "0x88928d81ba64b309:0xda10f5fbbeeb5258"}
{"user_id": "105161003340538974108", "name": "Gina Marie", "time": 1409003189676, "rating": 5.0, "text": "Kiddie Care has been a consistent source of education, love & patience for almost 2 years.  Our grandson, who lives with us, is now in the new Pre-K program inside the daycare & he's thriving!  There is very little turnover at this facility.  The Director and her staff are excellent listeners, patient with children that may not be \"cookie-cutter kids,' and are truly loving and caring toward every age of child.  I have & will continue to recommend KCLC as the BEST place we've found for the things that matter.", "pics": null, "resp": null, "gmap_id": "0x88928d81ba64b309:0xda10f5fbbeeb5258"}
{"user_id": "112217677753216500732", "name": "Cameka Beard", "time": 1560265208083, "rating": 5.0, "text": "A Great Place To Work!!! The staff are Amazing!!!", "pics": null, "resp": null, "gmap_id": "0x88928d81ba64b309:0xda10f5fbbeeb5258"}
{"user_id": "108643148870326843779", "name": "Rebecca Gross", "time": 1523549290601, "rating": 5.0, "text": "Thank you 🙏 Great center that works with the kids", "pics": null, "resp": null, "gmap_id": "0x88928d81ba64b309:0xda10f5fbbeeb5258"}
{"user_id": "105197909715746542878", "name": "Tina Bryant", "time": 1511917659550, "rating": 1.0, "text": "Terrible place for your newborn or baby.", "pics": null, "resp": null, "gmap_id": "0x88928d81ba64b309:0xda10f5fbbeeb5258"}
{"user_id": "107602840420322876740", "name": "Tiffany Dortch", "time": 1595003109525, "rating": 5.0, "text": "We had such a positive experience with Sylvan in Montgomery, AL. The owner, staff and teachers are all wonderful!", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "113003993805946009866", "name": "Cameron Sheffield", "time": 1565381020930, "rating": 5.0, "text": "Sylvan made school work during the summer fun!! The staff is very caring and friendly. They were able to accommodate our busy schedule and most importantly help our children master the needed course work.", "pics": null, "resp": {"time": 1569246851349, "text": "Thank you for your feedback, Cameron!  I'm so proud of your children and all of their hard work this summer!"}, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "117246863388269659024", "name": "Heidi Ingraham", "time": 1574127528428, "rating": 1.0, "text": "My children tried the after school Robotics program for 2 months. The concepts they learned had very little to do with robotics, mostly coloring sheets. Also, on the final day we intended to participate, the staff emailed at 1:45pm that they would not have the after school program due to staffing shortage and that parents should pick their children up at 3pm. When I inquired about my refund for that date they indicated  that there wouldn't be one because the program was a subscription. So even though they made it impossible for me to use my subscription for the day they refused me a refund for that day.  I do NOT recommend this location.", "pics": null, "resp": {"time": 1575326956218, "text": "Greetings Ms. Ingraham.  First of all, thank you for sharing your lovely children with us for after-school Robotics.  We had so much fun with that bright group of little learners!\nCoding is very heavily involved in Robotics.  It is important to introduce new skills and concepts in a way that is best for the students to understand and grow their basic working knowledge.  At times, it is necessary to use unplugged activities to set each student up for success in these new coding concepts, especially in such a young group of engineers.\nAs for the subscription / final session:  We have been conducting after-school programs since the beginning of the school year for this particular school.  We charge a flat subscription fee no matter the number of weeks included in the month.  Some months had 5 sessions and some had 4 making it even out in the end.  Canceling the last session in the month was a worst case scenario for us.  We regret it was unavoidable due to mass sickness, leaving us with no teaching options.\nI believe in what we do and I'm so proud of how we do it!"}, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "117129150128969149226", "name": "Joel Stephens", "time": 1569026744424, "rating": 1.0, "text": "They guaranteed that my son would receive one on one tutoring,  and he never ever received one on one tutoring at all. The people that work here are very pushy and rude. Every parent that I talk to that has used Sylvan states the exact same thing. Please save your money and time and headaches and go elsewhere. We were referred to Huntington Learning Center,  and they are absolutely the best ever. They are one on one as described and very professional.", "pics": null, "resp": {"time": 1569246788352, "text": "Good morning Joel.  Thank you for your feedback.  Will you please confirm this occurred at the Montgomery location on Lomac Street?  We strive to give the very best service and this doesn't sound like our level of service.  Please give us the opportunity to make this right if it is, in fact, us in Montgomery.  Please feel free to contact me directly.\nMisty Mitchell\nEducation Director\nSylvan Learning Center\n334-262-0043 md@montgomerysylvan.com"}, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "108952846401498897697", "name": "Delane Alexander", "time": 1610751726937, "rating": 1.0, "text": "No stars if I could ... Enough said", "pics": null, "resp": {"time": 1611069943345, "text": "Your student accomplished so much in her time here!  I am amazed at her progress and mastery of skills and concepts.  I have no doubt she will continue to be successful.  She overcame a substantial obstacle, and for that, I am extremely proud!  I am sorry you feel the way you do about our organization.  We give chances and options where there often aren't any options left.  I wish you shared the same positive feelings as us as we cheered her on during her time here.  Thank you for your feedback."}, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "104391823304518753595", "name": "Karen Jones", "time": 1606786233592, "rating": 5.0, "text": "Great tutoring facilities!", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "113848128360815880609", "name": "Misty Mitchell", "time": 1437496514212, "rating": 5.0, "text": "Both of my children took the Math EDGE course over the Summer.  They loved their teacher, Ms. Shan, and loved the math games they played as a group with their peers.  We are looking forward to the after school robotics classes coming this fall!  The newly renovated building is nice too.", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "103771973521769588525", "name": "Keith Wheeler", "time": 1520968257880, "rating": 5.0, "text": "Daughter really likes her teacher, flexible hours, great staff.", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "117978169329440241304", "name": "Andrea Cheatham", "time": 1497563444952, "rating": 4.0, "text": "The staff and teachers are amazing.", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "107145819377935563475", "name": "Ash Redmon", "time": 1613569964231, "rating": 5.0, "text": "Since my daughter restarted here she has thrived. She’s learning baby sign language and her ABC’s. She trying to speak in sentences and she’s only 17 months! We love her teachers and Mrs. Dorothany is so sweet and patient them! The Covid protocols her make me feel good about sending her!", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "105526535865470865373", "name": "T H", "time": 1578429460199, "rating": 5.0, "text": "Great center for any age. The staff are mostly elder aged women and are very sweet and patient. Been going there for 2years.", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "105472100687638951978", "name": "Edna Holley", "time": 1540239041215, "rating": 5.0, "text": "I give this daycare an A+, not only because of their excellent work with the children left in their care, but also for the exceptional customer service that they provide in order to assist/help families that some times fall on hard times.  The owner’s willingness to listen and assist when things are difficult goes beyond just a business relationship.  Kudos to the owner and staff at this daycare.", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "101860055553159395826", "name": "Jennifer Ashworth", "time": 1540245547545, "rating": 5.0, "text": "My twins having been going to this daycare since they were 3 months old. They are now 2 1/2. They love their teachers and are always showing us new things they’ve learned. We could not have asked for a better group of people to love our babies as much as we do.", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "108202992465986488558", "name": "Brandi L", "time": 1453407976331, "rating": 5.0, "text": "I love everything about this daycare. The ladies there are very kind and responsible. My son learns something new everyday and I can tell he's being well taking care of. I highly recommend this daycare.", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "104460363010035342690", "name": "Ashley Hickerson", "time": 1569500135767, "rating": 1.0, "text": "This daycare has multiple allegations of abuse.", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "107184831850587604212", "name": "D Robinson", "time": 1483562550805, "rating": 5.0, "text": "Great staff!", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "108355139047049249542", "name": "The Raging Potatoes", "time": 1622188438550, "rating": 2.0, "text": "very loud and obnoxious and everyone slams doors there", "pics": null, "resp": null, "gmap_id": "0x888601f02358f579:0xce014e9f84e941c4"}
{"user_id": "106816396734449417501", "name": "sam myrick", "time": 1573001788248, "rating": 4.0, "text": "Staff is friendly, my grandbabies like going", "pics": null, "resp": null, "gmap_id": "0x888601f02358f579:0xce014e9f84e941c4"}
{"user_id": "101457219148764461048", "name": "Tatum Butterfield", "time": 1600202487234, "rating": 5.0, "text": "I want to say thank you to the staff and management of Childcare Network who go above and beyond on a daily basis to make sure that my child’s needs are met. Lisa, Stepheni, and Tway insure that safety is a priority at Childcare Network. The teachers take their jobs as care givers to the children of our community very serious.  Every teacher my child has had (from infant room to the two year old room) has treated her like family. Childcare Network puts mind at rest and I find comfort in knowing that my child is safe and loved while I’m at work. Again, thank you for all you do.", "pics": null, "resp": {"time": 1600699197367, "text": "Hi Tatum, thank you for taking the time to leave us a positive review! We work hard to meet expectations like yours, and we are happy that you are satisfied with the care and education our teachers provide your child. Thank you for choosing Childcare Network, we are so thankful to have you and your family a part of our Childcare Network family."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "104168410981765307695", "name": "Audrey Johnson", "time": 1599846286448, "rating": 1.0, "text": "I’m going to start by saying the staff that works directly with the children are great! However the management such as corporate is awful! Not ms. Tway or Stephanie. I get childcare subsidy obviously because I can’t afford childcare on my own! They told me Friday that I have to pay childcare out of pocket because child care subsidy only pay it once a year! If childcare charges once a year then why would you guys charge twice a year? That is not a working moms best friend! That is a inconvenience and makes it impossible to go to work. So I’ll probably be missing a week of work because the company wants to make more money any way they see fit! Strongly recommend the staff definitely do not support the corporation rules as a whole! Lisa butler is rude and don’t care about people much like Donald trump a total tyrant!", "pics": null, "resp": {"time": 1600699769077, "text": "We appologize for the inconvenience. We are available to speak with you about any concerns you might have. Please call 833-407-6174 to speak to Corporate Customer Care to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "107699754980347841886", "name": "Mrs Russ", "time": 1602170297994, "rating": 1.0, "text": "Horrible Management. The director Stephanie was very  disrespectful. Just pulled my child out today. I do not recommend this location.", "pics": null, "resp": {"time": 1602176980516, "text": "It is only through feedback such as yours that we are able to maintain and improve upon the service we provide to our families. We would like to apologize for the experiences in your review and would very much like to follow up with you. If you wouldn’t mind giving us a call at 833-407-6174, we would like to have someone from the Corporate Customer Care department follow-up with you."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "114608540680499829506", "name": "Cierra Rodriguez", "time": 1502031119097, "rating": 4.0, "text": "So... first off I want to clarify the \"discount for review\" thing everyone is talking about. There isn't ANYWHERE on the flyer that states you have to give 5 stars in order to receive a discount for services, so some of the below listed reviews are being VERY dramatic on that standpoint. It's a nice center and my kids have really enjoyed their summer here.", "pics": null, "resp": {"time": 1504620883207, "text": "Thank you for your review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "100824425643397100780", "name": "Chad Millirons", "time": 1476292499052, "rating": 5.0, "text": "I absolutely love this facility. Our daughter is 16 months and love coming to school. In the infant class, she loved Mrs. Michelle and Ms. Emily. Now that she is in the Toddler class, she loves Ms. Chianti. You can tell they truly love kids and they treat your child as one of their own.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "105770043327052678250", "name": "Emily Gunter", "time": 1506826590216, "rating": 5.0, "text": "My niece has been going to childcare network #169 since she was 6 weeks old. She now currently 3 years old and we still absolutely love it! We know she is always safe and well took care of. The staff goes above and beyond to make sure the children are happy and that they are learning! It's amazing how much my nieces knows at only 3 years old! Not only are the teachers great! The director and the assistant director are awesome as well. They are always welcoming and helping solve any issue that may come up! Couldn't imagine my niece anywhere else! #169 rocks!", "pics": null, "resp": {"time": 1509047826570, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "107439376903288006210", "name": "Brittany Jenkins", "time": 1575650038335, "rating": 1.0, "text": "I called to see if there were openings for both of my children's ages, I was put on hold for 5 minutes to be told unfortunately there was a wait list for both of their age groups. I asked to be able to put my kids on the wait list. The first lady acted like she was annoyed that I asked. And put me on hold for another 5 minutes, and was transferred to the lady that handles the wait list. Of the 30inute phone call less than 5 minutes of the call was spent actually talking. I understand there is probably a high volume of calls, but even being put on a wait list I'm still a potential client/customer. Either one of those people could have taken their information down and just put them on the wait list.", "pics": null, "resp": {"time": 1575667693921, "text": "Hello Brittany, we apologize for the inconvenience this has caused you. However, after checking with the director, it looks like we do have some space available. If you would give us a call back, at 334-214-5273 and select option two and then press 1 to be transferred directly to the school. We will be happy to help get your little one enrolled!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "106419371562225867134", "name": "Jovan", "time": 1409781459748, "rating": 5.0, "text": "So far the experience has been great! My kids love it there! The staff is amazing! The facility is well kept and there is plenty of space. The summer program is great! I can't wait for the curriculum to start!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "113462493091324192784", "name": "Dana Love", "time": 1505920344827, "rating": 5.0, "text": "My daughters have been going to childcare network for almost a year. My oldest daughter is very shy, today i dropped her off, like every other day the teacher welcomed us but today was different. Shianti said good morning, got my daughter to talk to her and helped her get her favorite toys to play with. I'm so happy all the teachers at the daycare loves my girls like i do.", "pics": null, "resp": {"time": 1509047895512, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "109412919093052672197", "name": "Lanie Dale", "time": 1525701543849, "rating": 5.0, "text": "My son has been going to childcare network for over a year now. I previously had him enrolled in a daycare in Columbus because they had video cameras inside the facility and the place was absolutely awful . I had heard great things about this daycare and decided to give it a try. I am probably the most anxious person in the world and worry constantly about my child. I can honestly say I don't worry one bit when my son is here. The entire staff here are angels in my eyes. My son loves everyone of them and says it's his favorite place to be. He is always so happy to see them and has learned so much from this place. I would recommend them over and over again to anyone and I would never send my son anywhere but here. Thank you guys for everything you do and all of your hard work! This place has truly been a blessing in my life!", "pics": null, "resp": {"time": 1527192891537, "text": "Thank you for your review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "100331046499534639501", "name": "Sammantha Fietzek", "time": 1394756269298, "rating": 5.0, "text": "Love this place! The staff is loving and caring. The school age group has an amazing space upstairs including a beautiful basketball court. All three of my kids love going there and can't wait to return each day (which makes a huge difference to me)", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "103774541742903168684", "name": "Courtney Moore", "time": 1455298609373, "rating": 5.0, "text": "My daughter absolutely loves Childcare Network. It took only about a week before she was jumping into the teachers arms, which made me realize that it was an awesome daycare center. I love all the teachers, they always have smiles on their faces and positive attitudes!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "106355487220241390016", "name": "Joey Keyser", "time": 1506700330803, "rating": 5.0, "text": "Since my son has been going to child care network he has learned so many new things. The staff is excellent and responds quickly to any problems or any good things that happens at school. They treat my son and every child like it's there own. Thank you childcare network # 169 and staff for making my son and I feel like family!", "pics": null, "resp": {"time": 1509047795325, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "113478113579831077819", "name": "Jessica Koonts", "time": 1573551437192, "rating": 1.0, "text": "Beware! My son made it one day (only a few hours). When I picked him up all of the kids in the room were crying while the provider sat on her cell phone. The room was trashed, potatoe chips littered the floor (it was approximately 10am). My son sat in a chair, drenched in tears, and looked completely miserable. Before I went in the room, I went to the directors room to pay, she was rude, didn’t get up to greet me, and said she was busy and that she hadn’t added him to their system (they had his packet for over a week). The place felt like a holding cell for drunk inmates, total chaos and dirty.", "pics": null, "resp": {"time": 1573571429176, "text": "Hi Jessica, thank you for taking the time to share your review. It is only through feedback such as yours that we are able to maintain and improve upon the service we provide to our families. We would like to apologize for the experiences you detailed in your review, as it is not consistent with our company’s policy or standard of care. Please call 877-424-4530 to speak with our Corporate Customer Care Department to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "102733578205204750793", "name": "amy danny", "time": 1458786128352, "rating": 5.0, "text": "Absolutely love this place. All of the staff are amazing. Jeffrey loves the teachers that he's had. I would and do recommend this daycare to anyone. I hate we are leaving this summer. It's going to be hard to find another place like this.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "110168122037238350626", "name": "Jay Elliott", "time": 1506828393638, "rating": 4.0, "text": "Both my girls attend this center and their after school program and absolutely love it. And the staff is like family. Highly recommend Childcare Network #169", "pics": null, "resp": {"time": 1509047729893, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "107189216982052531231", "name": "P (Ed9arA11enPWND)", "time": 1492114341787, "rating": 5.0, "text": "Awesome daycare! Been using them for over a year. Very comfortable leaving my child in their care. The whole staff is awesome.", "pics": null, "resp": {"time": 1493732569640, "text": "Thank you for your response!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "114643715027830862706", "name": "Meka Johnson", "time": 1363373764017, "rating": 5.0, "text": "Childcare Network is a great center. My kids have being going there for 7 years. They have a great curriculum and summer program. My kids are in the afterschool program. The teachers make it fun. The Director is very friendly and goes ABOVE and BEYOND to truly be \"The Working Parents Best Friend\".", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "115286715098411149444", "name": "Tiffany Williams", "time": 1413289458299, "rating": 5.0, "text": "So glad that I moved my daughter to this school. She is so much happier going here and the personal relationships between parent and teacher is just priceless..I feel like she is with family and that is great for me. Absolutely love this school! Thanks for everything y'all do!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "108390911644580454484", "name": "debbie keyser", "time": 1506651109457, "rating": 5.0, "text": "My son Landon attends this Childcare Network & loves it! The staff here is amazing!!! Landon has learned so much over the last 2 years!! They are always so nice and friendly! I wouldn't want my son going anywhere else!!!!!", "pics": null, "resp": {"time": 1509047919332, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "104806860150022084336", "name": "Jenny Britton", "time": 1506828994754, "rating": 5.0, "text": "I have 3 amazing kids & I'm that momma who doesn't trust just anyone with them. My boys are school aged, & my daughter is almost 2. We've been with Ccni #169 for over 6 years off & on. I absolutely trust Stepheni Elliott the director with my children's life. She's an all around amazing lady. She treats the children as Her own.  Her staff is also very wonderful. & helpful.  Everyone is Very friendly, it's a clean facility, & has the best teachers in town. I highly recommend them to everyone I know. Price is great for the attention, love, learning & the care they give.  If I could I'd  give them 10 stars. Thanks ladies for always caring for my babies, protecting them & being there for us whenever we need y'all. #169 rocks.", "pics": null, "resp": {"time": 1509047691587, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "102068573566851062720", "name": "Erica Robinson-Hill", "time": 1410399552596, "rating": 5.0, "text": "I have not had to deal with childcare for 13 years. I was fortunate enough to be able to stay home with my little one for almost 2 years. Needless to say, I was extremely nervous about placing my child in someone else's care. My husband and I were welcomed from the moment we came to visit (unannounced) the center. Prior to meeting the director, other staff members were making us feel very comfortable. The director spent approximately an hour with us. We were impressed at the cleanliness of the center as well as how organized and structured the programs are.\n\nWe only need part-time care, but were still impressed at the affordability of full-time care and were advised that should our needs change we could obtain full-time care at any time. Payment options are great as well.\n\nIt is our plan for our child to spend many years here!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "104855126629260209208", "name": "Dylan Savage", "time": 1506828639566, "rating": 5.0, "text": "The teachers are great.  The director Mrs. Stephanie and her assistant is wonderful they go above and beyond to meet your needs. 😊", "pics": null, "resp": {"time": 1509047709578, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "103235426364552560482", "name": "Denise McWhorter", "time": 1412283117605, "rating": 5.0, "text": "Childcare Network is a great organization. This is my grand children's first experience at being away from home. They absolutely love it. Thank You Childcare Network for helping make the transition easier for my family.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "112035745007813061516", "name": "First name Last name", "time": 1491486822869, "rating": 1.0, "text": "Don't believe the hype with the reviews. They offer discounts if you give them five stars. It's a horrible feeling to pick up your kid with a pamper of of poop, dirty nose, and the room smelling horrible. They really need to tight up!", "pics": null, "resp": {"time": 1493732559874, "text": "We are interested in helping with any and all concerns regarding your experiences with our school. Please call 877-424-4530 to speak to parent services to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "101973606365972658821", "name": "Benjamin Heimstead", "time": 1476626353862, "rating": 5.0, "text": "Great place with lots of room. I have two children that attend and they are always well cared for. I highly recommend them to any parent.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "109216346628053368426", "name": "Labrisha hudgins", "time": 1446393239387, "rating": 5.0, "text": "Great center!! My kids loved going to the center!! The teachers are professional and  very caring. I highly  recommend them for your child care needs!!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "102351711852551824862", "name": "Rebecca Savage", "time": 1506826674973, "rating": 5.0, "text": "I am a mother of 3 wonderful children, I do not trust my kids with just anyone. I have had experiences with a few daycares and child care network was by far the best place I could have chosen for my kids to go. They are a very clean and friendly place. The teachers are great and very hands on with the children, and the director  Mrs. Stepheni is AWESOME and very helpful. If you have a problem she will go above and beyond to make it right.", "pics": null, "resp": {"time": 1509047838125, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "103985994571871773787", "name": "Facetime Terri", "time": 1533675561377, "rating": 1.0, "text": "i learned you cant always go off reviews. i say go visit your self, and ask around verbally, and believe them the first time. good luck", "pics": null, "resp": {"time": 1535490076044, "text": "We are interested in helping with any and all concerns regarding your experiences with our school. Please call 877-424-4530 to speak to parent services to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "115616847827434254267", "name": "Jessica Palmer", "time": 1413226102441, "rating": 5.0, "text": "My daughter is two and she absolutely loves going to see her friends and teachers at this CCN!  I am continually impressed by the staffs dedication to child learning, safety, and play!  I would give it six stars if I could!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "117802146329438379169", "name": "Krista Brown", "time": 1395223377838, "rating": 5.0, "text": "Been using THIS facility for almost 2 years now. I moved and pulled my daughter out for a while and then had my son. Since I was no longer near this one I tried putting my kids at a different daycare. That only lasted a couple weeks, I now drive about 25 mins out of my way each way everyday just so my kids can be at this daycare! This is the only daycare I can trust and feel good that they're being taken care of. My daughter loves her teachers and constantly talks about them at home and she is learning so much. All the staff are friendly and know your kids by names even if they're not in their class. Molly actually gets excited to go to daycare so she can play. Price is good and the only thing you have to supply is diapers. The director Stefanie and her assistant Loren are awesome, along with ALL the other staff, way to many people to name!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "113069187479871638866", "name": "Vidal Rodriguez", "time": 1502032018353, "rating": 4.0, "text": "Really nice place, my kids love it. They do a lot of different activities during the week to keep the kids entertained.", "pics": null, "resp": {"time": 1504620841273, "text": "Thank you for your review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "107067552357276901124", "name": "Hailey Harris", "time": 1448296561722, "rating": 5.0, "text": "I love Childcare Network. I feel safe when I drop my two babies off knowing that they both have wonderful teachers to look after them. The staff are all very nice. Both of my children have learned so many new things and they have only been attending a few months now so it's safe to say i'm a very pleased mother! I look forward to the years ahead of them attending here!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "107121782027184352770", "name": "Breanna Savage", "time": 1506828758421, "rating": 5.0, "text": "The director Stepheni and her assistant are amazing people. They do everything possible to make sure your kids are cared for. Couldn’t ask for a better daycare!", "pics": null, "resp": {"time": 1509047701022, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "111873776292630679900", "name": "Laquesha Sanders", "time": 1506828621423, "rating": 5.0, "text": "Childcare Network #169 is a awesome school.My children have been attending this facility since they were 6 weeks old.The staff is  professionally trained,very friendly and polite.I would highly recommend them to any working parent's.", "pics": null, "resp": {"time": 1509047750728, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "117473344090074990580", "name": "Markaya Tillery", "time": 1506653006429, "rating": 5.0, "text": "I have heard such great things about your school. Debbie Keyser has never had anything negative to say. Landon loves his school very much and has learned so much.", "pics": null, "resp": {"time": 1509047765609, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "111900377350133016334", "name": "Emily Murphy", "time": 1455244038075, "rating": 5.0, "text": "We have only been here a few weeks, but the staff is really nice.  I love his teachers and everyone I talk to are crazy nice", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "100273397424063345141", "name": "craig chapman", "time": 1394828194234, "rating": 5.0, "text": "For years Childcare Network has provided the best, and most professional of care to my grandchildren. The staff is always kind and caring, willing to assist in every way possible, thank you Childcare Network.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "101722058819039312398", "name": "Haley Kelcy", "time": 1506829883332, "rating": 5.0, "text": "Childcare network 169 is a wonderful school. The staff is so great and super friendly!", "pics": null, "resp": {"time": 1509047669972, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "103586207344466468637", "name": "shannon collier", "time": 1506651072292, "rating": 5.0, "text": "My nephew Landon Keyser goes here and he loves it and his teacher! Place is neat and clean!", "pics": null, "resp": {"time": 1509047908348, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "112470804804835729813", "name": "T Herring", "time": 1412110535561, "rating": 5.0, "text": "Being a working parent is hard.  You worry alot about your child.  You worry about their safety, and you worry about their day while  they are away from their family, in the care of others.  Since changing my daycare to Childcare Network, my worries have greatly decreased.  My mind is more at ease during the work day.  My child is happy when she is dropped off, this is what matters to me in a daycare.  Sometimes you think a newer building, a higher tuition, or an affiliation will make for better childcare.  You may have to re-evaluate how you determine good childcare.   If your child runs to their teacher, and all the other teachers know her name as she is leaving..... that is the sign of good childcare.\n\nThe school age program is very good as well.  The facililty's school age room is also very updated and very age appropriate.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "109946996148804562651", "name": "zachary christian", "time": 1506653213403, "rating": 5.0, "text": "Debbie Keyser's son Landon goes here and loves it. Highly recommend this place for your children!!!", "pics": null, "resp": {"time": 1509047774654, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "114489419511252273612", "name": "Lisa Singleton", "time": 1506652856427, "rating": 5.0, "text": "Childcare network 169 is the best!! Debbie Keyser's son goes here and loves it! Heard great things about Childcare Network 169!!!", "pics": null, "resp": {"time": 1509047983561, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "108711465469148690233", "name": "Debra Keyser", "time": 1506651222998, "rating": 5.0, "text": "My grandson Landon goes  here they are very loving and caring teachers  i would  highly recommend them.", "pics": null, "resp": {"time": 1509047932465, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "111724122616853462260", "name": "Christina Love Holmes", "time": 1506652700685, "rating": 5.0, "text": "Debbie and Joey Keyser love this place! I've heard nothing but great things!! Highly recommended 😊", "pics": null, "resp": {"time": 1509047971791, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "101614353680917904448", "name": "Chianti Thomas", "time": 1455203291617, "rating": 5.0, "text": "I love work here and my youngest daughter love coming here. It's a great place to be......", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "104307182280512490021", "name": "pamela kidd", "time": 1363355225501, "rating": 4.0, "text": "My son is not the type of kid that likes school but after I enrolled him at the Childcare network he loves going to school. I like the fact that he has homework every week. I feel it gives him a since of responsibilitly. Overall, I am glad I pick the childcare network for my son's first expericene of preschool.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "107627302866370449935", "name": "Daniel Britton", "time": 1506829108755, "rating": 5.0, "text": "Great place. Good people. Reasonable prices.", "pics": null, "resp": {"time": 1509047675300, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "115274757706770895378", "name": "Erica Hurst", "time": 1490393892268, "rating": 1.0, "text": "I don't like the idea that they offer a discount for writing a good review. I've had many problems since my son started attending. The following of policy and procedures are questionable. My child stays sick. I do like some of the teachers but again things are questionable.\nI've witnessed things that I know are not proper policy like changing children's diapers in the floor.\nI", "pics": null, "resp": {"time": 1491245409351, "text": "We are interested in helping with any and all concerns regarding your experiences with our school. Please call 877-424-4530 to speak to parent services to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "118248626441964847063", "name": "Constance J", "time": 1506652667386, "rating": 5.0, "text": "My friend Debbie Keyser takes her son Landon to Childcare Network on 169 & he absolutely loves it! Debbie & Landon both love the staff!!", "pics": null, "resp": {"time": 1509047946265, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "103808145144504545852", "name": "Wanky Thomas", "time": 1478449711526, "rating": 5.0, "text": "Outstanding after-school care for any parent considering to enrolled there child into this program with outstanding result!!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "104890901343860388153", "name": "Jerry lee Savage", "time": 1506827351101, "rating": 5.0, "text": "The faculty is very polite and professional, school is always clean and organized!!", "pics": null, "resp": {"time": 1509047720681, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "102990706181603890645", "name": "Wendy Cameron", "time": 1506808761294, "rating": 5.0, "text": "4 of my Grandchildren have went to this day care, the team work they have starting with there Director Mrs Stepheni is more than you could ever ask for, Mrs Stepheni is the most friendlest person I think I have ever met over the last 4 year's I've seen the way she is with her staff and Children at the daycare most importantly the children and you can tell how much those children love Mrs Stephanie as well as the parents and her staff I thank God that there is a daycare out there that has a director that cares about the Children and staff like Mrs Stepheni! and there are no discount for giving them a 5 star rating. Thank you Mrs Stepheni and staff at childcare Network #169", "pics": null, "resp": {"time": 1509047815860, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "111698858551078694409", "name": "Realtor Haley Adams", "time": 1506828438463, "rating": 5.0, "text": "Such a caring and dedicated staff!  As a local realtor, I am constantly recommending Mrs. Stepheni and her staff at CCNW 169 to my clients new to the area.\nWhen you choose CCNW 169, you aren't just putting your baby in someone's hands, you're putting your baby in someone's hands you can trust!!!", "pics": null, "resp": {"time": 1509047739060, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "108686196410113201274", "name": "Labrina Jones", "time": 1366118956393, "rating": 5.0, "text": "came to the states 2011 searched for a daycare for my son didn't really like to many than I came upon childcare network the teachers are the best they made me and my child feel like we was at home. they are very clean, organized and caring. my child been going here for 2 1/2 years and he  love it. the director Mrs.Kabrina she is the best she make sure her staff do their job and do it to the best of there ability, she walks around daily and check each and every classroom if there's a problem she will address it in a professional way. I love Mrs. Kabrina and her staff in her class its going to be sad to have my child go off to kindergarten when he loves this prek program.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "102467198449630806741", "name": "Bradley Lyons", "time": 1502921562294, "rating": 1.0, "text": "Don't send your child here. My daughter has been bitten three times by another child and the teachers have done nothing. I've heard a teacher tells kids to shut up while dropping off my daughter. They do not change diapers nearly as often as they should so my daughter has a constant rash. This place should be shut down. The teachers there don't pay attention and there are way too many children in one room at a time with one maybe two teachers. Worst daycare I've ever seen.", "pics": null, "resp": {"time": 1504620790601, "text": "We are interested in helping with any and all concerns regarding your experiences with our school. Please call 877-424-4530 to speak to parent services to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "110888813726953861614", "name": "Chris Johnson", "time": 1458226295694, "rating": 5.0, "text": "Such an awesome place for a kid to be! Great atmosphere, great teachers. I've been using this daycare for over a year now and havent had any reason at all to look for another daycare. Stephanie and Kelly are the best coordinators ever!! They work really hard to keep that place clean and safe also my son has CF and has special needs, has to take medicine and has to do therapy everyday and they make sure it gets done. My son, Kash, has learned so much and has met alot of new friends in the short time that ive been using this daycare. I love this place and so does my son! thank you guys so much!!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "112028605250662399315", "name": "Terran Nichols", "time": 1412220230185, "rating": 5.0, "text": "Great place! Loved the teachers and the curriculum", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "112475840415048354211", "name": "Shawn Johnson", "time": 1506652952810, "rating": 5.0, "text": "My nephew London keyser goes here and his parents speak so highly of this day care,im considering enrolling my twins here !", "pics": null, "resp": {"time": 1509047995294, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "102230131251676624290", "name": "Hyrel Walsh", "time": 1413569693922, "rating": 5.0, "text": "My Great grands tell me they <3 it!! :-)", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "100374613251113555965", "name": "Amanda Herbine", "time": 1533373276913, "rating": 2.0, "text": "They need to drug test their staff!!!", "pics": null, "resp": {"time": 1535490067602, "text": "We are interested in helping with any and all concerns regarding your experiences with our school. Please call 877-424-4530 to speak to parent services to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "117045102858677899679", "name": "Stepheni Elliott", "time": 1506827317778, "rating": 5.0, "text": "I love this school!!!", "pics": null, "resp": {"time": 1509047850432, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "117880498872792567250", "name": "Tyler Wilson", "time": 1618931410053, "rating": 1.0, "text": "They literally told me I had to get signatures from all 5 of my professors to withdraw and I seriously don’t have time to chase down 5 people. At Troy it was so easy. It’s like I’m jumping through hoops for a decision that’s mine anyways. My GPA is screwed, but I’ll know better next time.", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "118416147590237115054", "name": "Leticia Sutton", "time": 1603224551679, "rating": 5.0, "text": "Love 💗 love 💓 this school..... Everyone and everything about this school is amazing.... I feel like we are all family helping each other become better then we were before we started there!!!", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "103206374528460935112", "name": "Napalmbukake", "time": 1612305056254, "rating": 1.0, "text": "The welding program is a joke. You're better off saving the tuition money and buying your own welding box to practice with then find a different accredited tester on the AWS website to get your cert", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "110864783563202664686", "name": "Ashley Simmons", "time": 1611463880011, "rating": 4.0, "text": "Signed up for the welding class for women. It wasn't that bad as I thought it would be, enjoyed myself.", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "101461649048569225753", "name": "Adam Weaver", "time": 1610119733378, "rating": 5.0, "text": "Great atmosphere, friendly people, smart instructors. 10 of 10.", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "115359441413301436614", "name": "JAMES WILLIAMS", "time": 1592374879014, "rating": 5.0, "text": "I know this is a good college, but they do not offer the small engine class any longer. Wished they still had it for the public. Was told that class is now only taught for prison inmates.", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "118261013239890674535", "name": "Chris Hartley", "time": 1597347925841, "rating": 5.0, "text": "Instructors are interested in student success. They try to provide a great learning experience.", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "112822552453890617266", "name": "Wasted", "time": 1627587058025, "rating": 4.0, "text": "Ok school", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "112170786577049597426", "name": "Moth Balls", "time": 1478176557126, "rating": 5.0, "text": "Great place, helpful and understanding staff.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOfLvMJOK5hYZJ3KXJBLZ27mgUfPR_6OaYlirNa=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "113191331706409917714", "name": "Brandy Dowdey", "time": 1485373564008, "rating": 5.0, "text": "I am a current employee who graduated from Wallace Community College. As a student it was the best move for me to make immediately following high school as I was not socially ready to attend a major university. At Wallace Community College I learned how to study for collegiate level classes and manage my time in such a way that differed from high school. All of the courses I took transferred seamlessly to Auburn University which saved me money.\nNow as an employee I see all that goes on behind the scenes. I love my job and see all the time an effort faculty and staff put forth to make the learning environment and this college experience the best it can be.", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "112773563662860451733", "name": "Autumn Patterson", "time": 1490981740520, "rating": 5.0, "text": "I love Wallace!! The faculty are wonderful and really pushed me to do my best!  I could always go to them outside of class for help, and even faculty who weren't my teachers helped me on occasion. I will always highly recommend this CC to anyone!!", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "111701260111313365931", "name": "Gene and Marilyn McFalls", "time": 1535579502095, "rating": 5.0, "text": "Wallace Community College is one of the Best colleges in the world.  The advisors are excellent. The Professors are attentive and they genuinely want their students to succeed!  There are tutering available and very professional staff to accommodate the educational experience to success. I give this College a Five STAR rating.  I am happy to be a part of the Wallace family.", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "113280577246389894815", "name": "Heidi Dansby", "time": 1582691230166, "rating": 5.0, "text": "I love going to school here.", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "115385248520901550693", "name": "Summer Knight", "time": 1562205506833, "rating": 5.0, "text": "Can get a real job going to Wallace with a real skill.", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "113205043315157139754", "name": "Neshia Vickers", "time": 1468011790923, "rating": 1.0, "text": "It was a great school when I was attending but now I can't get back in because I left when had my baby and now I want to go back I can't get back in so 1star for them they could give me a second chance at my career in LIFE", "pics": null, "resp": {"time": 1468245890676, "text": "Hi Neshia,\nWe are sorry that you had to leave. Send us an email at wccdothan@gmail.com so we can get in touch."}, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "105029246873012545288", "name": "Anubus77", "time": 1571894712199, "rating": 5.0, "text": "They have a Chickfila! 🍗 I'm going to stop by just to eat!", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "109209742422304409124", "name": "Sharon Adams", "time": 1425095461330, "rating": 5.0, "text": "I was given the best foundation of my life to succeed . I'll never forget the experience and the professors that believed in me.", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "118143863945504642960", "name": "Justin Walker", "time": 1471537508916, "rating": 1.0, "text": "The staff never answers phones. I've been calling for weeks and can't never get in touch!!! Now school starts Aug. 22 and I think I'm to late for sign ups! I called again today and called every option just to speak to SOMEBODY there but, once again no answer. I heard great things about Wallace and that's why I choose to go there but, they are probably the worst in communication skills!!!!  my name is charity enfinger and I would really like to be in the nail tech program but, due to poor communication skills from ALL the staff I've missed my opportunity to get a better career for my two baby girls. One is 7 months and the other is 2. I wish I could get in if only they'd answer the phone!!! :(", "pics": null, "resp": {"time": 1471548545015, "text": "Justin/Charity! You aren't too late to sign up! You can sign up through Aug. 23.\n\nDuring registration, it is best to come in or send an email. We help students on a walk-up basis, so no appointment is needed, so we can't always answer the phone. Please know that we want to talk to you and we definitely want you in the nail tech program!\n\nPlease send an email to wccdothan@gmail.com with a telephone number and we will have someone call you ASAP!"}, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "108052208360368438069", "name": "Jennifer SCREWS", "time": 1481507337490, "rating": 5.0, "text": "Guided me thru my success", "pics": null, "resp": {"time": 1483478225718, "text": "Thanks Jennifer! Let us know if we can help you and good luck in everything you do!"}, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "114522993047926707615", "name": "Katelyn Hickmon", "time": 1483106349450, "rating": 1.0, "text": "Can't get the staff do to there jobs. No communication skills no help.", "pics": null, "resp": {"time": 1483478154141, "text": "Hi Katelyn\nWe're sorry that you're having problems getting something done. Can you send us an email at wccdothan@gmail.com so that we can help you get what you need?\n\nWCC was closed Dec. 23-Jan. 2 for Winter Break, but we are open Monday-Thursday, 7:30 am  to 4:30 pm and Friday 7:30 am to 2 pm.\n\nSend us a note and let us know what we can do to help!\n\nThanks!"}, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "118258354366434190685", "name": "Linessa Vickers", "time": 1460589455049, "rating": 5.0, "text": "Love the staff of Wallace college", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "108444953992810720168", "name": "Luhh Kelo", "time": 1475244214718, "rating": 1.0, "text": "you guys are the worst", "pics": null, "resp": {"time": 1475246318355, "text": "Keylan,\nWe're sorry you think that we're the worst.\nEmail us at wccdothan@gmail.com and let us know what we can do to be the best for you!"}, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "113966451336395084930", "name": "Grace French", "time": 1496966175956, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "113451542036615690158", "name": "Faleshia Griffin", "time": 1414768536964, "rating": 3.0, "text": "Work", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "107646458009158586857", "name": "Kenneth W Sanders", "time": 1568494740708, "rating": 4.0, "text": "Woman", "pics": null, "resp": null, "gmap_id": "0x88928e4cf4462c83:0xde966513d6a10ff8"}
{"user_id": "110013909868126552010", "name": "Braylon Moss", "time": 1624588771533, "rating": 1.0, "text": "Absolutely horrible experience with Proctor U this summer. Had an incident where I scheduled an exam for 8:20 pm. I come home from work its magically disappeared and there's no available time slots left. I try to call them on the phone for more than an hour for support and can't get one single real human to answer the phone to help me solve the issue. With that being said I hope this business fails miserably.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "118167582076386957541", "name": "Stephanie Moncrief", "time": 1619047438488, "rating": 1.0, "text": "I WISH I could give less than 1 star. I've had so many problems, just this semester.\nMy school, UAB has started using ProctorU due to the pandemic. Last semester, I had many professors use it, but I found it to be an invasion of privacy. They check your personal information and require you to unplug your second monitor if you have one. They also have asked me to remove items off my desk, such as calenders and even flowers.\nThis semester, the only class of mine that used it was my math class. I took an exam a few weeks back last month. The website my tests use for the class messed up and my professor allowed me to reschedule, and ProctorU said I could reschedule for free. They made me pay $12 to reschedule it. Upon rescheduling, they changed proctors in the middle of my exam, and the second proctor couldn't access my camera. They made me stop taking my test and wasted 10 minutes of my time on my test trying to fix it. I had 3 minutes left and almost a fourth of the test left, which resulted in my getting a 73 because I couldn't finish most of those that I had left. After telling my professor, he allowed me to retake it again and even extended the deadline a few days to make sure if I had any more problems, I could sort them out.\nI had my last math test of the year on Monday (not including my final). ProctorU wouldn't allow me to access my exam or anything. I had everything set up and everything, but it kept saying I had an exam in progress, and upon trying their live support, which is actually just a bot with pre-programed responses. It still didn't give me answers and they pretty much said \"You're SOL\" which wasn't nice to hear since it wasn't an issue on my end. I emailed my professor and he is allowing my final to replace that grade that I missed, but I'm scared ProctorU will screw up on my final, and make me fail the class.\nAVOID THIS PROGRAM AT ALL COSTS!!!", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "112400642634096656226", "name": "Anna Green", "time": 1619814801155, "rating": 1.0, "text": "2 years ago, I began using ProctorU. Never had an issue. They connected me and finished my exam within 30 minutes. Took a recent exam and they could not figure out the problem on my grandmother's mac. ( Used it 2 years ago without a problem). My sound on my hp only works with earphones, but those are prohibited even for sound purposes. The last attempt I tried to connect, it was taking a while so i kindly asked my proctor were there any issues I could fix on my end and she ENDED THE SESSION!! Traveled an hour to try my sisters chromebook, wasnt \"compatible\". My boyfriend's computer worked finally. Rescheduled several different times. Took from 4:30 p.m.- 11:30 p.m. to complete this exam. And here is the best part: They accused me of cheating when my periodic table was allowed during my test and in my professor's instructions it said \"periodic table/ calculator is allowed\". Took the entire test without periodic table in the middle of the night. Luckily, got a refund and my instructor is letting me take it face to face next week. Thank you for your kind service, proctor U.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "105797358421216485312", "name": "Steven Browning", "time": 1617759920521, "rating": 1.0, "text": "INVASION OF PRIVACY!!!\n\nHours after I took a test with this company, I noticed that I had a little light indicating that MY CAMERA and MICROPHONE were STILL IN USE!!! I feel so violated! I've been carrying on with my PERSONAL LIFE in the assumption that I was in the PRIVACY of my own HOME!! Once they end the session, all of their CONTROL OVER MY COMPUTER was supposed to be disconnected! I will be reaching out to an attorney to see what can be done to prevent this from ever happening to ANYONE ELSE!", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "106916505565179429532", "name": "Taylor Lissa", "time": 1619123528446, "rating": 1.0, "text": "ProctorU is a horrible website and I am NOT complaining to leave a negative review. I really hope they fix this website. The proctors come really late for your scheduled time which\nI understand but I think 45 minutes is too long of a wait. The customer service line is rude and they don't offer a lot of help when running into an issue. I really hope that college institutions stop using the website for online testing.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "100735306855002952030", "name": "Grant Carver", "time": 1618335747180, "rating": 1.0, "text": "This program is junk. Tech support suck. They hung up on me in the middle of helping me. Please stay away from this program.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "107654034449088490527", "name": "chandler stokes", "time": 1617831586544, "rating": 1.0, "text": "One of my many exams that I have been forced to take via proctoru the proctor forgot to mute himself while he was singing and playing music in the background as well as conversing with someone else. It was insanely distracting and ridiculous. Also, he was unresponsive to the messages I sent via the interface. 0/10 do not recommend.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "105050375411029305175", "name": "Tyler Zhou", "time": 1613586711151, "rating": 1.0, "text": "One of the Proctors costed me 10 minutes of the exam which resulted me into speeding up on my exam and guessing on questions due to the very little time I had left. ProctorU, fix it.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "106310420453355593388", "name": "Haillstorm Inc.", "time": 1610412681565, "rating": 1.0, "text": "Wow , is all I can say ! Just like the rest of you all only I’m trying to just get my Hiset they did nothing to help me ! Passed me around to 4-5 different techninians that were all obviously incompetent of doing their jobs ! Very pathetic especially when they’re supposed to be a leader in test proctoring. I definitely would never recommend them to anyone!!! Please anyone else with this issue YELP them to death!!! 😡", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "117247977692284234399", "name": "Leigh Wood", "time": 1606762975617, "rating": 1.0, "text": "They are horrible. I am reaching out to my University to see if they can use someone else. I had to change computers 3 times and tried different browsers and after 2 hours still haven’t taken my exam. Totally frustrating!!!", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "110613169962387052934", "name": "Grace Ward", "time": 1598575449315, "rating": 1.0, "text": "Absolutely awful! I just spent well over an hour trying to take an exam not even worth any points only to find out they suddenly want you to have an operating system called Bash! Bash is basically the same as macOS and is over 30 years old. I did not have to have this when I took finals last semester. I've also had a proctor just leave in the middle of my session one time. Terrible. Hope my professors see this and stop making us use ProctorU. There are other systems that are much more helpful and professional. If I could give them zero stars, I would.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "108173024466679228164", "name": "Ken O", "time": 1608481635534, "rating": 1.0, "text": "I used Proctor U for TOEFL home edition.\nWorst, Worst ever experience in my whole life when taking examination.\n\nFirstly, the contradictory instructions from Proctor U technician annoyed me.\nThey checks my device using my earphone and microphone but they asked me to take it off when taking exam.\nSecondly, the way they ask me to show the room was very weird, I had to turn around my laptop which was connected with rooter without using wifi and ai had to reregister the exam because my plug went off when I tried to turn my laptop to show my room through my camera.\nThirdly, they try suggest me to re-schedûle the exam whenever I ask any question.\nThey try to impose all the responsibilities to ETS. I followed their suggestion to re-schedule my exam but it was denied by ETS.\n\nI think they should not do a work which they cannot take the responsibility by themselves.\nI was very annoyed with everything this system has done to me.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "106195717374319716969", "name": "Samantha Singleton", "time": 1608488029168, "rating": 1.0, "text": "I needed to take my Praxis exam through this company because it wasn’t being offered in person. In the beginning of the exam, we got disconnected, and I then spent an hour watching support log in to the chat, leave the chat, and not do a thing to help me get reconnected. They then told me to call ETS to reschedule. Praxis exams are close to $200. This was a total waste of time and money.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "113962003233052350230", "name": "Benjamin Toum", "time": 1590016941829, "rating": 1.0, "text": "Absolutely terrible.  I did 2 tests with them some time ago and both had significant problems.  The first one went a better than the second; the exam started late, but we got through it.  The second one had tons of problems.  Late start - took a full 45 minutes to start the exam after proctor took over control of my computer.  Then my computer crashed (likely due to ProctorU connection; it never crashed before that) and I had trouble getting back in - the test was timed, and thank god the crash was near the end of the 2 hour time limit or I'd really have been screwed because once the clock starts, it can't be stopped. The proctor had to get permission from her boss to let me back into the test.\nAt that time, the company was very new and the security level was highly questionable at that time. You have to give them permission to take over controls of your computer, and you have to give them personal information.  The company was still in beta-testing phase, and I think my school (UCLA) was one of their first customers.  At one time, ProctorU had a Yelp page that was full of negative reviews (they are not listed on Yelp anymore.)  Basically, nobody likes this company and they are technologically impaired.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "110937584430978363379", "name": "Darrell McCool", "time": 1597912168542, "rating": 1.0, "text": "Everything about this service its trash. I have taken many exams with ProctorU and every time it is a bad experience. Please, do not force your student to use this horrible company. Taking exams is already not a pleasant process, adding ProctorU to the equation and its hell on earth. Currently, I am waiting to take my scheduled exam.... its been 45 minutes.    Why accept scheduled exams if your company cant support them.  The service provided by ProctorU can easily be replicated and there are many companies that treat their customers with respect. DO NOT USE PROCTORU!!", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "104353810080083324874", "name": "James Johnson", "time": 1600099735513, "rating": 1.0, "text": "Trying to take my finals since Saturday. I cant. Rescheduled taking fees and now I am broke. Just trying to take my exams to better my life and this system is total garbage.  I expect a full refund today!", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "115947835671623666833", "name": "Kiffany Porter", "time": 1607388976747, "rating": 1.0, "text": "Proctoru is Garbage please avoid at all cost. Customer service is non existant and they nagged the entire time of my test.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "101526696348776441885", "name": "kenny corle", "time": 1595008114386, "rating": 1.0, "text": "I’ve used proctoru twice and it was a miserable experience both times. The first time I used it the proctor didn’t know how to administer an exam so I waited for three hours to start my exam. That’s not an exaggeration. I’m actually trying to use it for the second time right now but I’m on hold, thirty minutes after my start time and can’t connect to a proctor. Can someone please help me understand?", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "117578510538167917884", "name": "Mitchell Carr", "time": 1598576984555, "rating": 1.0, "text": "Oh my lord, talk about a terrible experience. Every time I use proctor u I have an awful experience. I literally hate this program and do not recommend it at all. The problem is, they are the ONLY company that does this.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "104972927994356565954", "name": "Washington Jazz", "time": 1587234080595, "rating": 1.0, "text": "Honestly, this one has the worst experience to me, as a test-taker. I totally don't know what they are thinking. If I could say bad words, it could describe my feeling better. As others said, I really waited one hour and finally connect with one agent. However, due to my laptop does not use English as System Language, they asked me to change it. But once I change it, I need to restart my laptop, and then I will disconnect with them again!! Which means I need to wait another one hour or more to connect with another agent!! And due to my laptop was bought abroad, the laptop doesn't have English as System Language, and I have to download an English Version!! And due to the ProctorU, I can not take my exam!! You don't know how mad I am right now! I strongly recommend Proctoru shut down their company and rebuild again. Please!!!!", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "116183522238212889368", "name": "Greta Montgomery", "time": 1595691242759, "rating": 1.0, "text": "What a complete disaster this is... can’t connect to anyone, “customer service” hangs up on you... technical help is a joke! Been trying for an hour and a half to take an exam and nothing is working", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "102649109903559186478", "name": "Steven Abalos", "time": 1586109249771, "rating": 1.0, "text": "ProctorU has offered me the worst user experience I’ve EVER had. From taking forever to find a proctor, troubleshooting errors connecting me to the exam, then dropping connection to ProctorU mid-way through the exam, and then experiencing incompetent customer service (communicating was a challenge at times because their English wasn’t great), I’ve finally given up after 7 HOURS.\n\nI honestly felt like I was being scammed. If you ever unfortunately have to be in contact with them BEWARE because you’re about to waste your precious time.\n\nOtherwise, I hope you have more luck than I did.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "101912162293782207614", "name": "Travis Williamson", "time": 1593294529098, "rating": 1.0, "text": "Daughter signed on to take her GRE....took 2.5 hours to actually get connect to the exam.  6  proctors dropped her connection with no attempt by company to reconnect...7th tech got through....poor company and shame on any university or college that does work through this POOR company.....had google allowed I would have give -5 stars.  ProctorU should be ashamed of their service and close up shop.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "108022743023072443066", "name": "Miriam Band", "time": 1593025864515, "rating": 1.0, "text": "terrible waist of 8 hours trying multiple times to connect to my exam and never even starting. very frustrating. waiting on the phone for support for a long time now...", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "105308065074790083116", "name": "William Charlton", "time": 1589557166942, "rating": 1.0, "text": "Terrible company. They take your money, send test schedule confirmation in email but DO NOT schedule the exam. Then when you try to reach out to them for help your request fall on def ears. Complete waste of time and money. Comcast has better customer support!", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "117569462626276981965", "name": "Sarah Ashley Royal", "time": 1587323400661, "rating": 1.0, "text": "Proctoru is the MOST DESPICABLE. DISGUSTING WORST EXPERIENCE OF MY WHOLE EXISTENCE!!!!!!!!! I have emailed, live chatted, called and NOTHING. not spoken to ONE single real person and I have waited countless hours. COUNTLESS hours to take ONE TEST. I don’t know what’s going to have to get done to get through to them to FIX THEIR PROBLEMS but they better do something. They deserve NO buisness. RATE ZERO STARS", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "113324505211706912572", "name": "Dan Solo", "time": 1586009996528, "rating": 1.0, "text": "I am trying to register for an exam, but all the times are unavailable? How could that be? Over the span of two days with only 7 people in the class? As a result, I am attempting to touch base with their customer support, but it says (via chat) \"You are number 1 in the queue with estimated wait of 4 minutes\". I have currently been waiting 30 minutes and have gotten the same message on the phone service. This is ridiculous! I need to take my exam and there's some poorly managed company that's prohibiting me from doing so? Worst educational experience of my life. They need to drop this POS company like a hot potatoe.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "118358790006783136468", "name": "Robin Pearsall", "time": 1585945053086, "rating": 1.0, "text": "Took over an hour to even start my test. Hate everything about this. There are so many better options for secure online test taking.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "103737588802616342810", "name": "Kristen Mashburn", "time": 1545241546616, "rating": 1.0, "text": "I signed up to take my final through ProctorU.  I signed in to the testing site and was set to begin my exam.  Something happened and the computer crashed.  As a result of this, I had to log back in.  When I logged back in, my test was not available.  The representative on the phone stated that they would send a message to my professor requesting that the final be reopened so that I could complete it.\n\nFast forward, I sent a message to my professor myself alerting him of my issue and making sure that it was time stamped within the parameters for completing the exam.  To which I got a response that a message was NEVER sent to my professor alerting him of this issue.\n\nYou would think that this service was free with the type of service received.  When you pay for a service it's expected that it be received.  Not following through and not contacting my professor as discussed is uncalled for.  My grade is on the line!\n\nHorrible Horrible Horrible", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "115826981391872967100", "name": "Chase Waggoner", "time": 1568604520483, "rating": 1.0, "text": "This is absolutely, hands down, one of the worst companies I've ever had to do business with.  Their software platform is terrible, they subject your computer/data to horrible security risks, and their staff is a terrible blend of incompetent and disrespectful.  I am being 100% sincere when I say that if your college or university is considering using ProctorU to proctor their online tests, consider switching schools!", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "118321038484085422504", "name": "Alexandria Gentile", "time": 1571425842479, "rating": 1.0, "text": "I wish they would stop outsourcing their staff, because I had taken a test and submitted it. Moments later, I got a call that my test did not submit properly and I have talked to FOUR different people who clearly are not American, and either disconnected at my question or did not help my find a solution. My grade will suffer because of this. I am only giving one star because I cannot give ZERO.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "100691751445971763805", "name": "Brittany Starks", "time": 1587316334681, "rating": 1.0, "text": "Universities are doing a disservice to their students by contracting with ProctorU for virtual testing services. Moving forward, I will ask schools which service they use for virtual testing. Myself and my cohort's experience has been so poor with this company that a school's partnership with this company influences my decision to attend the school. We have encountered unavailable testing times, weak customer service support, faulty technology (i.e. erasing test responses during tests and consequently running out of time to take the exam). It really has been awful.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "106046754453014224093", "name": "Guillaume Gervais", "time": 1604696492728, "rating": 1.0, "text": "One of the worst interface's I have ever seen.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "114468419439384271453", "name": "Dustin Harmon", "time": 1531467497635, "rating": 3.0, "text": "Update:\nI was able to get everything resolved with them after a long and arduous fight. I really shouldn't have had to argue with them for so long, but I'm glad they actually resolved the issue.\nSo, it's not a scam, but there was a large amount of neglect, incompetence, and unwillingness to be accountable. I encourage others to go a different route so they don't have to deal with hours of headache. If no other route is available, strap in and record everything.\n\nOriginal review:\nDon't fall for this scam! Yes, it's a scam!\n\nThe only reason they get one star is because I can't go lower than that. Just got out of an arduous 3-hours of their \"tech support\" to have them tell me there's nothing that can be done.\n\nI signed myself up for an exam that was supposed to be tonight at 8:10 pm, and immediately encountered issues when their system wouldn't let me past the 'environment test.' It said it was too loud in a silent room and too dark even though it's extremely well-lit. I immediately took to the tech support at 8:11 and discovered there were two different links to tech support so I went with both. I was chatting with 2 different people simultaneously when one of them disconnected me, and the one who had control of my PC opened a new chat window and connected me to a different chat agent before using my computer to disconnect themselves! Every person I spoke to told me that I'd have to speak with the advocate (they kept saying that) who signed me up, but I signed myself up. They kept trying to pass the blame onto me, but I had been prepared for the exam for days. Every person I spoke to also told me that I was supposed to take the exam 2 days ago and that I had missed my exam date, but I corrected every single person (even the manager) because they were looking at the date I had signed up for the course!!! I asked them to just let me take the exam and they offered to reschedule me for later that night or refund my money. Considering that it took me so long to prep for the exam, I wanted to take it tonight. I asked for a supervisor after 1-1/2 hours, and was told repeatedly that there were no supervisors until the next day. I called their bluff, and after half-an-hour longer a manager came into the chat! Look at that! They do exist! He informed me that they have no way of getting someone into the exam. Seriously. They're only a pair of eyes to watch a person for a few hours. I asked him why their tech support even existed and he couldn't answer. He then said he couldn't reschedule or refund my money. Total scam.\n\nI recorded the final hour of interaction on my cell phone to send to the local news.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "103256218870161798412", "name": "Jim Ross", "time": 1583685222821, "rating": 1.0, "text": "Worst company I’ve ever experienced in my life, Organizations need to drop service with ProctorU. Incapable and incompetent staff with an inefficient software filled with malware.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "101488002042815008886", "name": "Shelley King", "time": 1596042199445, "rating": 1.0, "text": "Terrible service and zero customer service for my daughter after many phone calls and emails. TERRIBLE COMPANY! They charge for services not given!!!!", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "117414773295046752517", "name": "Kayla Smith", "time": 1565054326440, "rating": 1.0, "text": "Honestly, I wish it would give me an option to give ZERO stars. It deserves none what so ever. It takes at LEAST an hour every time to set up a test. It was exceptionally bad this time. An hour and a half before my test (yes, BEFORE MY TESTING TIME EVEN STARTED) I contacted a live technician and asked them to test my system to make sure it was working. After the tech tested it, he said it was running fine, and I should have no issues. Here it is, my testing time, and I have been dealing with them saying my connection isn’t strong enough for over an hour. I am currently writing this while I am STILL WAITING TO TAKE MY EXAM. I want to say that this is THE WORST possible platform to host a proctored services. Use Respondus Lockdown browser if you’re an institution, because this is ridiculous. I definitely am going to have high blood pressure going into an important exam. Thanks, ProctorU.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "104489401591911656637", "name": "Lane Gilbert", "time": 1579737099978, "rating": 1.0, "text": "Absolutely awful customer support for a relatively easy issue with exam scheduling.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "114913486140903647057", "name": "Ellen Nabors", "time": 1563840825663, "rating": 1.0, "text": "One start because that's about how many good experiences I've had with ProctorU. It is a horrible way to test. Every time I take an exam it is 1-2 hours to set up. That is completely unacceptable. I am tired of going into exams so frustrated and crunched for time. It is affecting my grades.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "109039697588407780217", "name": "Mrs. Anderson", "time": 1571459598756, "rating": 1.0, "text": "I took an exam and I was there 30 minutes before my start time. ProctorU tech did not know what she was doing and due to this I wound up only having 17 minutes of my allotted 50 minute time to take my test. Then once I started testing the tech kept clicking in talking to me and moving my mouse. Horrible experience.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "112851160604664976099", "name": "Gubzs", "time": 1555699823608, "rating": 1.0, "text": "These absolute MORONS slowly broke their systems over the course of MONTHS while I filed support ticket after support ticket telling them what was wrong. EVERY exam I wasted 20-30 minutes with their almost completely untrained tech support until they realized it was something wrong on their end that they had to fix. Finally this last time, they couldn't fix it at all and I COULDN'T TAKE MY EXAM.\n\nLet me say that again: I COULDN'T TAKE MY EXAM BECAUSE THEY DIDN'T FIX A PROBLEM WITH THEIR SERVICE THAT I HAVE BEEN CONTACTING THEM ABOUT FOR MONTHS.\n\nThis service is HORRIFIC. They treat students poorly, half of them barely speak English when you're talking to them about a problem, and the basic premise of their service DOESN'T EVEN WORK. They can't even keep a video feed running properly.\n\nI'm genuinely mad that I can't leave a zero-star review, $%&$ this absolutely worthless company. I have lost literal days of my life to this dysfunctional and pathetic excuse for a \"student accountability\" service.\n\nTo every professor that uses this service, USE. SOMETHING. ELSE.\nIT. DOES. NOT. WORK.\n\n\"We know it's bad but it's our best option\" is not an excuse. CUT. THEM. OFF.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "101342287635514232226", "name": "Ayla & Stephen Hicks", "time": 1575581184744, "rating": 1.0, "text": "Caused me 2 Fs on my finals!!! I had a 91 in math! It dropped to a 67. This makes me so mad. And they blamed me for everything that went wrong. I am so fed up with this company. Bad customer service and no care or sense of urgency.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "104211008938200402546", "name": "J F", "time": 1582226601033, "rating": 1.0, "text": "It seems like it would be convenient, but there are always issues. It's always a headache.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "104257389837008885161", "name": "Thomas Chandler", "time": 1568950966621, "rating": 1.0, "text": "As a student currently trying to take an exam, meaning im in the process of waiting to start my exam, i can hands down say that this is the worst alternative to online testing that could ever be created. The cheapest software with the worst security protocols out of any website ever. You literally have to turn off any anti virus software that you have just so that you can connect with a proctor. I scheduled my exam at 9:40 pm and it is now 10:40 pm and this is how it is every time. I really do hope the worst for this company considering how bad everyones experience is on it. Schools should be ashamed of making their students taking their tests online. If anything it is the laziest and the least cost efficient way of doing things", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "116517310214719822773", "name": "April", "time": 1568993483161, "rating": 1.0, "text": "Absolutely the worst online proctoring service in the entire world! I am currently taking my real estate exam with #RealestateU. Proctoru outsource their proctoring agent who are not fully educated or experienced! These individuals do not speak clear English to assist your needs and they do not have adequate internet connection as a requirement to complete your testing. I do not recommend them at all.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "118132312746559514857", "name": "Tyler Chambers", "time": 1595094899009, "rating": 1.0, "text": "Horrible Service. If you want to take a test you have time to go watch a movie, take a nap, and clean your house before you connect to a proctor. Waste of my time.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "100628342657416708049", "name": "Sheila Graves", "time": 1567650960919, "rating": 1.0, "text": "This has got to be the worst experience in my MBA journey.  All was well until @LSUS made it mandatory that all instructors use PROCTORU.  I could not get a proctor to supervise the  Pre-Test.  After spending 6 hours on the first day and another 4 hours on the second day, countless auto reschedules because of time outs due to no one being available, I gave up.  At this point I've spent more time trying to get through the PRETEST @PROCTORU (TO NO AVAIL),  than the time I spent on my course.  I've cut my losses and dropped the course.  They've got one more try - next term - if the problem persist, a transfer to another school will most certainly occur.  I'm trying to complete an MBA not a PROCTORU!", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "107207850596658716692", "name": "Tyler Tedlund", "time": 1556433373802, "rating": 1.0, "text": "Wow. What a pain in the butt! It took well over an hour just to START my exam. If possible, I highly recommend using a different proctor.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "101767592349614401263", "name": "Nick Dailey", "time": 1576121943391, "rating": 1.0, "text": "Takes forever to begin exams, difficult to understand some of the proctors, and if you have okay internet, don't bother. This was a terrible experience!!!", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "115487015730531801252", "name": "Sophia S.", "time": 1557355404617, "rating": 1.0, "text": "I honestly don’t even know where to begin. I’m actually thinking about taking legal action over the way ProctorU has handled things. On March 3rd, I was scheduled to take my midterm exam. ProctorU was unable to connect me to my exam and there were multiple attempts made to connect me with a proctor. After speaking with somebody at the help desk they told me there was a glitch in the system in proctorU. So they said i wouldn’t be able to take my midterm that night and that they would be reaching out to my professor to let her know about this incident. I also reached out to my professor the same night. She didn’t really care and did not allow me to take it🙄  Fast forward to the end of the semester. I look and i received a whole ZERO on the midterm which caused me to fail my whole class. I decided to write an appeal to the dean of my school regarding this matter but first I needed proctorU to document what happened the evening of March 3rd so I could sent it as proof to the dean. TELL ME WHY proctorU LIED about what really took place that night. They tried to blame this incident on me and say my connection was messing up. Well proctorU I hope you know that your the reason i failed my class. Y’all just don’t want to loose your contract with my school. Also, while your at it blaming me for this situation I find it ironic that there are so many other students that have had the same issue. I already reported you guys to the Better Business Bureau for your dishonesty. BLATANT DISHONESTY. It’s so sad. ProctorU will be out of business too.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "113397157839087981717", "name": "Cody Edgemon", "time": 1564508001525, "rating": 1.0, "text": "Awful service i had two exams scheduled and have not been able to take either of them because they took over fourty minutes to set up. Im sorry but you can not take a fifty question exam in 30 minutes. I have called customer service who has left me on hold for over 20 minutes now!.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "104186934790525121180", "name": "Jeff Bayonne", "time": 1544497852470, "rating": 1.0, "text": "ProctorU made me w8 an hour after my scheduled exam time and kept disconnecting me constantly. I wish they would improve on the quality of the service.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "102023170257175446816", "name": "Brandon Simmons", "time": 1572815483818, "rating": 1.0, "text": "Horrible experience. Never starts on time and always have problems logging in. 👎🏽👎🏽👎🏽", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "116696258793545954531", "name": "joe amburn", "time": 1563240333726, "rating": 1.0, "text": "I went to take my test the proctor started my test and exited out of my test within 3 seconds. I did not have time to read the first question. I got a 0 on the test and was very angry because the test brought my grade in my class from a B to a F. The proctor tried to fix it but the test was a one login deal. The proctor could not grasp the concept that the test was over and kept on saying that the password was entered the right way.\n\nThis is not the first time they have not been any help. They would not work with me because something came up last minute and they were going to charge me an extra 10 dollars to move my test back an hour. Every time I call customer service I get a really rude and customer service agency. They DO NOT want to help you with anything.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "104202011087566272744", "name": "Keilyn Lorenzo", "time": 1541712942802, "rating": 1.0, "text": "Program is SLOW and crashed, making me lose my exam! I had to jump through hoops and make 3 different phone calls to have my money refunded for my online exam AND to reschedule. I called their customer service desk and they couldnt do a thing but give me another number a call! DONT waste your time using them even if you have to. NOT WORTH THE TROUBLE", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "111444832138915043876", "name": "School of Thoughts Inc.", "time": 1508975633066, "rating": 1.0, "text": "This is the worst company I have experienced in a very long time. The customer service experience was HORRENDOUS and if we had not needed to use this company, I would not have. They put my child through such a horrific experience getting her computer ready for her exam - that even as a strong willed student - she was in TEARS. I had to call the supervisors of our online programs to get them to intervene. I would never recommend this organization. HORRIBLE experience.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "113523558583832418908", "name": "Michael Hansen", "time": 1534438319771, "rating": 1.0, "text": "I have used this service several times and almost always have some sort of problem with their service. It generally takes 15 to 30 minutes to get an issue resolved but this last time it has taken days. At the end of a final before submitting the test, the system stoped working. I was told that they would forward my answers to the professor but nothing was done about it. Having to go through different people and departments to finish a simple test that is pivotal to my grade has been the most ridiculous experience I could imagine. My expectations keep dropping and I continue to be disappointed. Avoid this service at all costs.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "107179273658353665078", "name": "Ashley Anthony", "time": 1529939414900, "rating": 1.0, "text": "This is the sole reason why I want to graduate already.  It never fails.  EVERY SINGLE TIME I have to take an exam, I spend 45 minutes - an hour and a half doing the, \"blame the user's everything\"\" dance with them.  I've used different computers, connections, every combination.  Somehow it's my fault at all sessions?\n\nThe 12-year-olds they hire don't make matters any easier.  I'm also tired of them dropping reservations and feeing us to death.  I was 15 minutes late because of unexpected traffic and securing the recommended space, and they just drop it without notice.  Things happen and if you're going to do that, give me a warning.  I will never use these people again if I have the choice.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "118072513952736401039", "name": "Knight", "time": 1587603494090, "rating": 1.0, "text": "Customer service doesn't even EXIST for this company. You literally wait on hold or chat for DAYS with no answer. Literally the worst company I was ever forced to attempt to interact with.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "115518018146312674082", "name": "Alli Fisher", "time": 1528825484527, "rating": 1.0, "text": "WIsh I could leave less than one star. This company is garbage. I've wasted over 3 hours trying to take a simple exam for my job. The \"proctors\" are lazy and have no concept of urgency.  They cite random \"requirements\" that are incredibly vague. Seriously, this time I've been chatting with them for 44 mins and have yet to get anywhere. Don't use these garbage mongers if you don't have to. I'm submitting an invoice to them for lost revenue.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "114611756997107828296", "name": "William Posey", "time": 1518619984664, "rating": 5.0, "text": "I had to use ProctorU for my exit exam requirements from JSU to finish my Bachelor's in Nursing.  The process was seamless in getting the necessary things installed on my laptop.  The proctor I connected with was professional, explained what he needed me to do and what I could and could not do according to JSU's directions for my exam.  Considering what this company does, they made my personal experience a good one.  I've moved onto a master’s program at UAB and see that ProctorU is a partner with them as well.  The time and convenience this company provides for me to take my exams at home is well worth it.  I would gladly use them again if needed.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "104033012752292368974", "name": "Caleb Russell", "time": 1522433304647, "rating": 1.0, "text": "I was told I would receive a refund for a balance I had on my account. I emailed them with no response then they said that they sent an email saying they do not have to refund me. I never actually received that email. Their customer service was rude and unprofessional. I'm sorry if your school makes you use this service because they are unprofessional.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "104846386183877780337", "name": "Andrew V", "time": 1606058701801, "rating": 1.0, "text": "ProctorU is a joke!", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "109813446471445621060", "name": "Samantha Mullins", "time": 1577282383477, "rating": 1.0, "text": "Horrible experience almost every week", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "100967079413385121138", "name": "15 Ascensorem", "time": 1584981755333, "rating": 1.0, "text": "Worst service!", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "116452648437109442539", "name": "Jasmine Mann", "time": 1510107358274, "rating": 1.0, "text": "Waited 30 minutes just to get connected with a proctor", "pics": null, "resp": {"time": 1510149473566, "text": "Hello Jasmine, sorry to hear that.  Was everything ok once, you were started?"}, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "111887840980268780873", "name": "Joelle Eliora", "time": 1595109813297, "rating": 4.0, "text": "(Translated by Google) Because of the pandemic, my education provider switched from a presence test to an online test with ProctorU. This not only postponed the exam by two weeks. Even the registration turned out to be difficult because the button to confirm EU citizenship was simply not clickable despite repeated attempts and multiple reloads. After a workaround, there was simply no time to be selected for the selected participation. After finally solving this problem, which the company is aware of, with a lot of trial and error, the next hurdle appeared in the payment process: Payment only possible with a credit card. A chat with customer service did not provide a solution either. So I had to get a credit card first. However, the chosen participation was only reserved for ten minutes, and the organization had announced that booking as early as possible was urgently recommended due to limited places and competitive tests. So it was said for days, trembling, whether there is still a place available until you can pay by card. Both the technology and the customer service of the company are in need of improvement. Hopefully everything will work as it should at least on the exam day in early October.\n\n(Original)\nWegen der Pandemie stellte mein Bildungsanbieter von einer Präsenzprüfung auf einen Onlinetest mit ProctorU um. Dadurch verschob sich die Prüfung nicht nur noch einmal um zwei Wochen. Schon die Registrierung erwies sich als diffizil, weil der Button zur Bestätigung der EU-Bürgerschaft trotz wiederholter Versuche und mehrfachen Neuladens einfach nicht klickbar war. Nach einem Workaround war dann als Nächstes für die ausgesuchte Teilnahme einfach keine Zeit auswählbar. Nachdem man irgendwann mit viel Rumprobieren endlich auch dieses Problem gelöst hatte, das dem Konzern bekannt ist, tauchte im Bezahlvorgang schon wieder die nächste Hürde  auf:  Zahlung nur mit Kreditkarte möglich. Ein Chat mit dem Kundenservice erbrachte auch keine Lösung. Also hatte ich mir erst einmal eine Kreditkarte anzuschaffen. Die gewählte Teilnahme blieb aber nur zehn Minuten reserviert, und die Organisation hatte verlauten lassen, wegen begrenzter Plätze und Konkurrenzprüfungen sei eine möglichst frühzeitige Buchung dringend empfohlen. Also hieß es tagelang Zittern, ob bis zur eigenen Möglichkeit der Kartenzahlung überhaupt noch ein Platz frei ist. Sowohl die Technik als auch der Kundenservice des Unternehmens sind stark verbesserungswürdig. Hoffentlich funktioniert wenigstens am Prüfungstag Anfang Oktober alles, wie es soll.", "pics": null, "resp": null, "gmap_id": "0x8889240f3f539d41:0x40d3939f17f45a0f"}
{"user_id": "104326832972226802637", "name": "Greatus Soldiera", "time": 1531395568202, "rating": 5.0, "text": "Awesome sraff", "pics": null, "resp": null, "gmap_id": "0x889264ec31a6884d:0x9396d9c875fe7170"}
{"user_id": "113516747705022907483", "name": "Ramya V", "time": 1615772177605, "rating": 5.0, "text": "Beautiful tulips 🌷to watch. Nice place to spend quality time and watch lovely tulips. 🌷💐", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNQWWNNrcA6LZP6YoqNyQrO7K3vOpb8KOirB4_6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMCCdretWIgkcnU1GlWJm-ekvwaG5ITc3QXmOj4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNHIOj1jIwzKFH7XYtrvmJtG0Q8nSZJ2InLMKTE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPx_qoG8FJ4qvqnLqme2D5YFxqXLEdTwb1BZB7z=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO9sQXMks8oVRI4temwY9s7clEpJMHLP-1wGt_5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPKqn9i_Qmd1676uV7iXr1ZT-LuAKoehhMgrZMD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMH1CRREHdNp2ogA98QcQTMRI45LGfIUpQk662L=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPlAVRvbSoghsUeBJna7EEt-UnZNiD63bSz7paB=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "104718868834246805893", "name": "Lois Miller", "time": 1616528508427, "rating": 5.0, "text": "We thoroughly enjoyed our time in the tulip fields! Well worth our 2.5 hours drive. Friendly and informative staff.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "108493517256312225588", "name": "Gini Woods", "time": 1622391814555, "rating": 5.0, "text": "This is a very organized, clean venue. We took a group of homeschooled children. The tour guide interacted well with the children and even involved them in the historical information he was sharing by assigning them ri", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "115298311690388307054", "name": "Ni N.", "time": 1556135895840, "rating": 5.0, "text": "It's nice to see the different types of tulips (during tulips festival Feb - Mar) and the American Village itself. $10 per person.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPYYmUerJIsv0KohAqFROGKsPlb3zAYnWkBTXKF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNYh-2h41oJPQrmg4QzJ7Iy-tnxWP16linJy1BV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPN2rjW2EndVeuay7GlnBGif1WzcsaT2YNz7QMQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMyMrlC2X76QA2LEDnFGkdtTBuIsAybIChSoHdw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMtucREVuYRLfUUwbvV6wVAaOYOl6DWYCi11Pjv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNTHLjg6bXQsfBmHm0DVEL8UJmFGm8b3WiqMYYc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMpn3P9YjbP4MzZMSAXigsG5zQf_0JIHjeQvE3k=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipORR3Y22Hul7MAUSDgxBsEDAYN5-lDlb7KPLC6k=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMP4MOxC_Wz-U7ZY9XuvFhXZNGsUVQveVOY20x5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPxfdb9aDeqBbcmMaGb1lHICF-BhEevpR7x2DsC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNxaHVPMzanopJLbS5Dhw8WmBRcLHY2L76HPR1U=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMQlx44JHeE3uA-phHQNZL7aWYjwSG5mMy8EwiJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP8p1plaGkXz2DSlMMUYQcy68nUCx8wDilFkBTD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPgB0raufAUQ0RE60m82bpLatmnlZRaM3mL1lsu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOh2ZX2pMExD3XAHc4IAR6K6SR8haVqRsm2p13u=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMYok2IE4UqrpjZpBsuGugU8prVYelO5WfPqZIW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMigRpmVFz4PTSdWx5G8qbFBob4C7q_qgtEam7A=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNwJQKQs1X6pr97m4zHXl1jhd6trW3KLmn_mB3l=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPWb-PhjTfjJPxsbC6ldquNwIEeT7GAnS_ea0Uq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOvCGKR0FOMcTm-hDC4aBiLUyytvytway-zj63O=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOidN7B4leOzRdrb8oDGpak5Wg23_CFwvFmgVtv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO9sEGZTXLvzjujF5uii6dUNQ9qNIKtVEvlX-C0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPLQvtOtm6oBI45B-0Wkc4HK-zhPdupSqSLLOTu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO4pdEBH2KQoXxkhuwlNB-oDwh7wYl1AWIedRNU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOU3MoeFSgFjOMbkJvJJjUGUwXyraIIt4ABHiTj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNFqVXHdle9XR-IW9-48R9bf5MdOM1v9LNq-LMD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO9QqQiWaB0IBofi0Gc0SfmhzyCyKY0FK5j_Vgi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMz4Syp3X51Myl2JL7UEYy8U2suPQnXosvs3red=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO6oEZTHZ8UiahoYr5Z1pNmCQaGZLK9b8QjG927=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNaPVH_l8W_HcmvvsUTJ43671qvXai_1NYNQ_rl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPOEqpFB5m7cBfxpYvpyBz6w1f3D91T6ZdZ2sQB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNam2FQY-KCdYNM6pYOJvd1tzzyKhJfDurhgH1W=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMmbQiUqVJFBrU_n0IOdqy6zc4iQfeqJ3YQww23=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipObatYcrvwm1TFDuEjYooBd9cc0YHcAmOLg4eZ9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO7U3AC-7YuxGWH4f_h8TCzpXBrW3AMgHExKojb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPKjioqQ8Afijj2x9lVFBAl2ImTFFMXbkgYpN0I=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipON2hK9aRe0kTTWAX-kOMU9NI6PU13UWUVFLO1H=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPxf9tXuT5DsrhmP5QfxAvWN3y2gkZWvGs1S3fb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN4Bbfrz7ZqtJR3ci5VEzekB05WAtjm_MLjAFUa=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNSluDBQEHtkUYJHKONDOhMl-PEobxblaJg1mrT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMFCMC97BXhV4Owxw6sIGsHwycOch1q6wQ6w_CV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP3QvGT8a5fi6TbYYv-psGz10I0LQNsDTsRZVVI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP8tz7G5GhHZdHnv7aWKKFDiuTHyyAuwPjWavv-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMQbwdwZNhnKMsLlpgFF1mssF8YIaUI9ZJAPqqo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNN2y2GYEA-YdzDOnLnmYYpr2KNukUezqET3lxj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN6Fms3OBR8OqWREVE7M4Fp4uyzy_kgdkkUkekd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPmfYNDJW1hNvzXWwXPcGMr96NgoPaTtldeCmjv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipONZ1Z9sf7bzPgX3RhDgbwwFZMBKuilTW3y2pHz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNtUNCKSeNifEMdgsGG_i9dCvPdmUhN5nflmqkh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOYjGCpDnt-GzY6Tc7g55NSD4nCXFioEtfSsg7J=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "117400150836996397426", "name": "Char B", "time": 1558405945817, "rating": 5.0, "text": "Ask first if a school group is going through then tag along with them to get the most out of your visit. We wondered around in the beginning then hooked up with school group. You can picnic on the grounds or you can leave and come back. $10 per person discounts for seniors and children. Don't miss out on this much history.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOGJxoYRWYnjTUglbUfeR-swL6r00o8JiX_L9_F=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPnW-bT5k6UW7mf6rzjPHTfHp1qTPidzAFfKQ9-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN8TmNpkN1wyY1IHaLN_MWKqpQ_7W9lrCCK5Yha=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO5UwOTWKTqCWXrwDP-7xFJIMNYXWMCZ08MfMFP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM8vq1E7tN-lMYtgecpbZpYo2lww23UPxSS05Ly=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPpysJYksTcN-HLH7x7xXaILzQnBgZnFEMm08Tm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPsvcZKVq_RnoqobGZW0ZN-UM72jIIz7lnRiMTD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNV6xzPFPPweCUXx_CFj_YOWUIEZa0EONb07Y4_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMaX573eVeV0D2Sew8pmh9ERpClkp5qvOVHrhS9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPXy5MekA6G-7AcSRZCWNrr1H2M2KZGqxQvWszW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOeF8DB3-3XlNl8FBT8yi3oMeqWF2XQaNnTz3aL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPGwNcjyzWMdTbEgca8cfgw9TCdhBcq7SYPe-xm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMJ-dQqPcFEwKQ1KQwE6Twl5XDg-P50NQ4dHPHN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMrOlF1OGpRTw_Bj1OyEHCrsJMh3PKthS6K4EYz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNbQCDKHis_lc4VC0n3JcRy-qDu1SpX7NeD7jCY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPU5Af6izqJtFbOcJc0L18guRkSiNQ8dNSu7fAj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOrXzxNbdjDkx7K7G2qP_PL5EF0Z0puo_iS6rPZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPOk3O8curAVyYRd9owc6uaGcdwuNlO92IMxJMh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOygs8DKh_fWN_pTmap9Z2-U2wq4WCounwAh8G9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPlc-3iSQT2lJMBUYGWt02pYWqGaESN43L-zAfx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOhS3Iy9znLrOIQgWq4N2n5G9K5s1I5t8oBFCJL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPezW0dSU-FVrWXnEoDI175TJULlRnPjHwXDbyb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNVpgsGjKtsSnrWjNSiP9FtSULLfSRWKCKJADf8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOlsjqK7SWTGGiVPH3-8KYDilvZQI0WTvZampju=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM8-200UajLtCfLSa7xKD7kruqBgpo7eU1FrLvd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipONw3K39ROx2sWiIiHlWnEqZ1Jh_LCIE5qUKPjv=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "110066589077742326221", "name": "Ismael Torres", "time": 1583716385223, "rating": 5.0, "text": "A must see. Beautiful place. Awesome staff", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPD7MQs_ODIf1gp8SnmggrpF3yeIy98IksdyFit=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPunuonCFJMXpNiDZ97uJNFAsV9ZSUUr9gdu1b9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOifd77weIJERs1xz0aKn8pDGWJneTBYHBtQDFR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMGc6v3lVfr8nva_QpnoYp-rdhjHNKrm76g166h=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNRnOnr5w3J302HWnTMup5SDAtwyiJrszQGSkwW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNmoDTgssKkK1eQcp_K-fb4YXfzqTCMZAFkawcu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN1OrMWFFKCkuEb7H3kAbIRKBPrdl0f7puJRi_j=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMra6_qMW3RPmDbuK5UUEn63TFd7L5ttqLDVEiI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOZlQB0-h2yRxLHkDcHRewvk-wP3EDrFoO6jFLC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPKSgvtIkj-xLXhsPVFu6S2LLdvPTxmEjg_5qPE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOPj-L3UUwxAGB9MPKP-i-QW3sfY2zxH9pzEVGC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMczY5VBxqe3c3iQwkGp7hMyWYT6wjQvZMLUa4f=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOcQr1j7emJZNUncchLQf1WHTY6xj4qVc1ZOlau=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM-6SQWcXvwLnGGv14bG6txeeKmNMACsLFCeyZN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN86IbZtx4t_WEAJ-Rnir68YSoOQQLVQ8JllTWy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOo1hWAhZc-hRGK_KjTcTsJpicA7su7ud0az3iL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM1NyBA1FOBlJ43raXajimOXT3drNHGJqbIdRcA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNU0iRz9gqSwnXSGOQvGXSXhVPgcBXut2EBLCYt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNoNnJavNDGV6cdBXMqkSctRIGDwNcoIxcH9NUx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOwxy1ennnJ7I1dlg-ZBSn1NHH7cJiiOdKzvtQZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOW0oWH4c21bFV2DX-D-d6Cb8JVbIzNmUqd2Qzr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN1LhzaHhhpap397aSJPnfaX054bkslrobwqwb8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOpilCPNyX15mjJg9BRlxNPDbouAISv-6fWcvP7=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM6ptlyl8ZC48UC3pIJAbAEzbRXXIV3DL_-62_j=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOaLnnn5cK10QnPb-BYlQkULodjOpPZ1hkMALx4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNr9O95kMCCbEhEQq0Jr32eG8c7IF_OwoWyOJk-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOwgpusHe3Fli0bvPKv4p4iAMM0gWap8Qnn_WKP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM1DMXuUvqKoSGNxvGmBmLWg0hOk5up8GSt4DjE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPdL7ddTA05V812X5gI7okPp8-tWtlVR_8F8CpF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOp4LqExGjl32Ba_5249nOoKyLoXSYVYPlquJsC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPcgBvhDp2-oK1DfpMYX7DzNrS_LANHSrC1TNjA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNQhNoyze0TYJRf5iZH4lBbHkbi7v2arexk5kUa=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOEEpaUP5h1ZKjgPfm6Zp_Njnl7WztHajp95xbq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP2vVzCuuSGoXKodUxXD2oIsl8u1gmlObG4iK2s=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMm26P0UB6pNNXg3NkH5DOV6S3v0kJOinJin7sB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMYhMvXSLhthZelDpdkXaWr0Yexj6fyurazqYCu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMawtCaIbzJz5l0nXHh1M-N5gOKF_sqZ7L5gZ2i=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOEtcscS40ljp4jwyQAnxVeKodZ-EByxtMTJXu5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOkPUi6SvlS1ZWO8DUAbm5qE4FzAuB5Tk5LL32d=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPNKc81WX9zcmeC0fEwXUbskcnq_-J95tb2Oyy_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN-8rL2QjOk5VEpafQWThxCaYTsojyICSOSK1XT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOGYiuN773jKVS_bQP8IRIfBZNkLTw6ThqQwoyt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOyopMYQo4OY0Ao2Dk0uckjHyHF7H06kjPYs1is=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO22Bdac_am4eCoJ5lL6dSM6EaFOMyCay4XXQ19=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNMMQITnVzYg6NsJp3HWeidkqXGbWrv_esjvxbF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNMZPlLxBTjL3daidVaN67WqYGLeULX3c2Yt9AI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMVUn5PY2RX2wofPe1ByomY5vVdlXKYLQHabqZJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM65riWF1uLor_B_TLulBg54Y9v39Mq-rr2PFag=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNhWxwfW4RS5Z2imwc_c6zckrCEUK3xoJrQPQuU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOIb8R7LGJut869oY_8t27RZ474hlSV6nj-BT1m=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "104466812793751764417", "name": "Terri Lane Robertson", "time": 1573953250435, "rating": 5.0, "text": "The kids always have a great time on their field trips here.  The characters are great at taking you back in time and letting you feel like you're \"there.\"", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMx_-wBLHURyM9bQbTs7Wt-ug--msHZAPstvbPe=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMFzV2TqHd9lZ3WOzBbRGIGg0aQzNSrpQbHEt6H=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM5MMa9cvYSY54wgpDWTNRa4b5fmNDb99wyvggr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM9J-AjsRN_EaOdtdAKGxYfUlDuHJWSKyTf_ACj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNx1y4eBP-yCWXvjqMRTyqkVyuXrJ6We5_nEw_C=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNbbeLJCr3hDTJ8RpSJEqoASeZscaaUHf5YkVLF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOc4o9GaGBMViKjxPsP63zQIdDBSYvXhLbXaxut=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPpPengGe-PVgQ6Y7uMBshtYeA0KfOIMevtz0eR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOwfzD_CFSi7D5zH0CnNPdcVX0digRGujXOooZj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMAG66TNNWQStjY_vVHSxfJls-KVupQTpFMCJLq=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "105874796861891966953", "name": "Jessica McMillian", "time": 1552106693981, "rating": 4.0, "text": "Would be awesome if there were more staff walking the area.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNyysUoK7rhnpI1U0gu96w3D89lp-HgcMKXh12O=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOpQcoWUCmdjiES0Qj7jjwyEmWZ5LZGpOmTDw3k=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPe7X3x7jWyckaHJ9xe8GqUXfZTGTDew5lnTmD6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMgGpI-RIyytce98RTdIIwqsWP3g8trjq0TQKWW=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "108363821032319171330", "name": "Courtney Ray", "time": 1527387564136, "rating": 5.0, "text": "The tulip festival was amazing! We went towards the end, but thankfully their were plenty still left! It is wonderful and you will be sad if you miss it!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOXip_FDqsiMLr7Z_b57h0BO6xEBiDyyU7JFpVp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNie3AyBjRnSYYNBYtWSJTwPsxajimMUyG4c_ud=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "105173047983860486920", "name": "Nura Nura", "time": 1602174892576, "rating": 1.0, "text": "Because love the village", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNxMHXWl4_mqxooHYdHyhK9NEH0fv4OT2Nq3imm=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "105740283759985151351", "name": "Denise Payne", "time": 1562346478293, "rating": 5.0, "text": "If you’ve never been here you simply have to go!  We live in Ohio and are back in Sweet Home Alabama visiting family. We searched online for a fireworks display and our search led us to The American Village. We went a little early and enjoyed seeing the campus and tasting the delights of the food trucks:). Our family of 6 thought it awesome that there were seats if you didn’t bring one or a blanket, picnics are allowed, and staff and volunteers were not only friendly but smiling and seemingly loving their roles!  This isn’t your ordinary history museum and the fireworks display was definitely not typical. My husband is a retired Army Captain with 22 years in service. We have visited many places and viewed many fireworks displays including ones on military posts. None have even come close to what we experienced last night!  My favorite parts, the parts that gave me chills and made tears flow, was seeing the colors presented correctly, the heartfelt gratitude of The American Village staff towards Those who serve, and the accurate depiction of our historical relevance. Thank you American Village for making our Independence Day Celebration not only the best yet, but also helping us to reflect on just how wonderful it is to be an American!  🇺🇸❤️", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "113590043741796185163", "name": "Mark Wayne Alexander", "time": 1564103411766, "rating": 5.0, "text": "Went for 4th of July festivities. Was entertained by volunteers portraying men and women from America's early history. Many different character portrayals to select from going on throughout the village. Very impressed by the replicas of buildings from early Americana such as Mt. Vernon(George Washington's home), the Old North Church(from which Paul Revere was signalled)one if by land two if by sea. And the fireworks were absolutely amazing and spectacular. Will definitely be going back. Only $5.00 to get in and enjoy all the sights and sounds of what a 4th of July celebration should be.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "100646506012247491799", "name": "Kara Hodges Cox", "time": 1509850994613, "rating": 4.0, "text": "Great history field trip for the family.  The kids really enjoyed joining the Continental Army and the Oval Office replica was cool to see.  As a family not in a tour group it would have been nice if there were more informational signage.  I would really suggest this for anyone interested in history!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "113185748019636152607", "name": "JJ Polri", "time": 1497889427035, "rating": 5.0, "text": "THE BEST KEPT SECRET IN AMERICA!!! This place is a must see, it is absolutely amazing, the role players are amazing, you truly feel like you have stepped back in time, it is a full immersive experience! Such an amazingly fun way to learn and experience history! The tulip festival time is beautiful and anytime is beautiful to go! So glad they are open Saturdays in the summer! If you live nearby or are driving through AL for any reason this is a MUST DO! Pack lunch or eat on the way because they don't serve food here but you can bring picnic lunch, and be sure to check the hours as well because they are not always open on every Saturday, but it is great when they are. Going on Presidents Day was a fantastic experience as well, nothing like getting to eat cupcakes with George Washington!!! The replica architecture is amazing it is really an incredible place to visit! You will want to spend the whole time there if you can and go to as many demonstrations as you can! Our kids LOVED the colonial soldier training! Just so fantastic in every way!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "118247168341650415382", "name": "Cheryl King", "time": 1519751276303, "rating": 5.0, "text": "HOLLAND called they are jealous! I can not keep from showing everyone I know the pictures of our trip the The Festival of Tulips.  5 acres of absolute beauty. 100,000 blooming tulips just waiting to lift your spirit and welcome Spring.  And we got to bring some home and plant them in our yard. It was an utter delight. If you live in this state....you are missing a true jewel if you miss this experience.  We will return every year for this soul lifting wonderful time.  Thank you.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "103706880733220981329", "name": "Daniel Bryson", "time": 1453769674628, "rating": 5.0, "text": "Recently attended a small conference held at American Village, and it was a terrific experience. While the weather wasn't suited to a thorough exploration of the grounds, everywhere I went and all that I saw was positive. Clean, solid, well-maintained facilities indoors as a venue, and wonderful reproductions of the various historic buildings. Montevallo, Alabama is a long way from metro Detroit, Michigan, but I would be happy to find another excuse to make the trip and see more of American Village!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "118378557251599978617", "name": "Marie Harbison", "time": 1464649402070, "rating": 5.0, "text": "My first visit in several years. So impressed with all the additional buildings and exhibits. Great display of American history. Kudos to Exec Dir Tom Walker for having the vision, pursuing his vision and implementing his vision for preserving our heritage for us and our children and grandchildren!!!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "116071568553561070356", "name": "Dommie P", "time": 1582488192871, "rating": 5.0, "text": "Came for Tulip Festival! Beautiful place!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "105654504869960827926", "name": "Dewayne Bowie", "time": 1581115369550, "rating": 5.0, "text": "Great place to learn about America history", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "112086908858663074523", "name": "Houston Mullins", "time": 1562776307046, "rating": 5.0, "text": "I went to The American Village on July 4th, and I loved it!  Awesome day there.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "118155906655792547219", "name": "Carroll Price", "time": 1460764654942, "rating": 5.0, "text": "Outstanding situation even when compared with touring of Washington or Williamsburg excellent staff.   Nice to see people with purpose in their employment posts.  Thank you for displaying  why America is desirable. A beautiful concept.  Cp", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "111026421862608160664", "name": "Luisa Reyes", "time": 1519077744766, "rating": 1.0, "text": "Given that this colonial era reproduction is out in the middle of nowhere, the main thing they have to offer people is a pleasant experience.  Something which they progressively seem opposed to doing.  Their Patrick Henry impersonator is incredible, congenial, and flat out stellar.  The rest of the staff is rude, mean, and hostile.  The noncostumed staff seem to have power trips and take pleasure in insulting people.  Mamy folks have had to complain at their ill treatment.  I've been going to their Fourth of July celebration almost since it began.  But, there seems to be a negative corrolation with the more elegant a locale it becomes, the more hostile they turn on the people.  Ironically, the village celebrates American Independence, but the staff acts like Tories.  I've been to the actual Liberty Bell, to see Mount Vernon, and visited Colonial Williamsburg.  In all of those places my experiences were far pleasanter than at the American Village.", "pics": null, "resp": {"time": 1519167167139, "text": "We at American Village regret that you had an unpleasant experience visiting yesterday and we hope that you will call us so we can learn more about the experience. We highly value our visitors and strive to provide an enjoyable venue for everyone. Please feel free to call Jeremy Ward at 205-665-3535 (x 1072) and thank you for reaching out."}, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "113958667329379467599", "name": "Benjamin L", "time": 1585881475613, "rating": 5.0, "text": "Beautiful property.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "106390132567227724263", "name": "Bill Searcy", "time": 1462315961609, "rating": 5.0, "text": "You should go and tour this placeI. It is something to see.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "115013309240790010137", "name": "Lindsey Collier", "time": 1578598873015, "rating": 5.0, "text": "Cute place!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "113257970646297135048", "name": "Scott Wade", "time": 1524073087602, "rating": 5.0, "text": "Great learning experience for kids.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "107901642284701835668", "name": "Akinajin", "time": 1502493463052, "rating": 4.0, "text": "Great history fun for the whole family!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "107124790789826844840", "name": "JK Manning", "time": 1499212428132, "rating": 5.0, "text": "The fireworks on 4th of July are great.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "108200441271329902336", "name": "J. Patrick Smith", "time": 1502086008026, "rating": 5.0, "text": "Wonderful living history programs.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "103964203229356887995", "name": "Terilyn Stewart", "time": 1528735154698, "rating": 5.0, "text": "Nice place to visit", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "115304108683892706665", "name": "Callie Broussard-Wheeler", "time": 1465424633050, "rating": 5.0, "text": "Brilliant, moving museum that is a MUST SEE!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "105222864594594227194", "name": "George Cobb", "time": 1583618887404, "rating": 5.0, "text": "Wonderful!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "116629514560677356539", "name": "MaryBrett Robinson", "time": 1551742545551, "rating": 1.0, "text": "No.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "107607414371094147710", "name": "Diane Payne", "time": 1498143806004, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "109237391688385164068", "name": "Patricia Buckey", "time": 1486666830186, "rating": 5.0, "text": "Great visit!!!!!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "116794582413402904809", "name": "Ramkesh Meena", "time": 1482500215239, "rating": 5.0, "text": "Lic village", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "118286742393074422075", "name": "Pamela Hunter", "time": 1467510763548, "rating": 5.0, "text": "Great experience, family fun !!!", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "118124919875336976201", "name": "Fernando Fiallos", "time": 1499343224944, "rating": 5.0, "text": "(Translated by Google) In a pretty place of large-scale representations of relevant places in American history.\n\n(Original)\nEn bonito lugar de representaciónes a gran escala de los lugares relevantes de la historia norteamericana.", "pics": null, "resp": null, "gmap_id": "0x88892951889d4a0d:0xd5b51426974ef905"}
{"user_id": "117703946227358848398", "name": "Emily Deem", "time": 1615239004525, "rating": 3.0, "text": "I worked here when it was Milestones. Loved the space, the kids and the experience but the way it was ran was just horrible. They didn’t care about the kids or the teachers. So glad to see it being filled with a loving environment. Miss my 2 and 4 year old room!", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "103749716764314910408", "name": "Anthony Dean", "time": 1614183259912, "rating": 5.0, "text": "BBMA has been fantastic for our infant. We are very happy with her care, but also the communication from the Staff. The Kidreport app lets us keep track of what our baby is doing through the day. We would recommend BBMA to any family looking for a school that is more than just \"daycare.\"", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "111631696327820832893", "name": "Freddy Tate", "time": 1611741349823, "rating": 5.0, "text": "The reason we accepted Big Blue Marble Academy as our child care provider for our son was simply because of first impression. This daycare offers a caring, vibrant, clean and stimulating environment for all kids.", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "103031316302630230910", "name": "Kaylie Hill", "time": 1611543409699, "rating": 5.0, "text": "Love the whole staff here!! They made the transition for both me and my child super easy!", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "114242692349494653430", "name": "Ragan White", "time": 1610722406962, "rating": 5.0, "text": "I am a first time parent, and it can be an anxious experience to start your child in daycare. I recently enrolled my son here under the new ownership of Big Blue Marble and I could not be happier with this facility! He is being engaged every day, and when I get him home he is so much more animated and talkative (as much as one can be for 4 months old). The staff takes great covid precautions with pickup, dropoffs and the rooms, and they always make it a really fun experience for him and for me every day. I think any time you take your kid to day care you need to expect that they are going to be exposed to more germs and be sick a little more, but that's going to happen whether it be day care, preschool, kindergarten, church or sports. It's unavoidable if you want your child to interact with the world outside of your home. If you are looking for a learning center / day care that offers real engagement, wonderful teachers and staff, and parent peace of mind - I highly recommend Big Blue Marble on e Glenn!", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "110865988102077324518", "name": "K. Moore", "time": 1549308311854, "rating": 1.0, "text": "My daughter worked there a few years ago during college. She had a terrible experience. She was sick so often that we made her quit! She often had worker kids which made her number of children per adult be over regulation. Toys were not cleaned effectively. I’d suggest looking elsewhere or you’ll end up paying for daycare and taking sick days from work to take care of your child.", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "117689063770602216947", "name": "Shashank Rao", "time": 1441426855097, "rating": 1.0, "text": "We have tried Milestones on two separate occasions - first when our son was an infant (8 weeks to 4 months old) and now when he turned 18 months old.  Both times the experience was HORRIBLE (not sure why we even decided to give them a second chance after the first time's issues). As an infant, he was sick every alternate week while at Milestones.  One week he would go to Milestones and catch something, then we would keep him home for a week and fix him up.  The next week he would catch something else again.  It was a perpetual cycle because of which we decided to pull him out.\n\nHe then restarted daycare (somewhere else) when he was a year old.  For 6 months he was relatively healthy - barring the occasional cough / cold.  We started him back at Milestones this week (i.e. 18  months).  He has been there all of 3 days and already he has caught a stomach bug. This place is horrible!  On day 1 when we went to pick him up, his milk cup was not washed and just sitting around.  The second day, his pacifier was missing.  When I asked the teacher where his pacifier was, she started looking among the toys.  That should have been my first clue - if the teacher is looking for a pacifier amongst the toys, god alone knows how many kids have put it in their mouth!  And the pacifier had a string attached to it, so they could just have clipped it to our son, but they did not care to do that.  The \"teachers\" as such are a bunch of college kids, and most of them have no clue what they are doing.  As such, it is a revolving door for teachers; there is so much turnover that almost anyone you speak with says they are new.  If you care for your child's health, please stay away from this place!", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "115378296404842659895", "name": "Abby Wang", "time": 1418914474916, "rating": 3.0, "text": "Their facility is very new, so it looks good if you take a tour as a first time visitor. My child kept getting sick during his stay, and I had to withdraw him from the center after I found him another place. They use plugin air fresheners with VERY STRONG scent, even an adult would feel very uncomfortable while staying in the room. I was really worried that my son's health might be hazarded by those chemical stuff. Are those things allowed to be used in a childcare center by regulation? Also, their playground is paved with pebbles, which is ridiculous and rather unsafe for outdoor activities!", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "106924736182366108753", "name": "alexis winston", "time": 1528647818899, "rating": 1.0, "text": "Bad experience while working there the staff was very awful towards me , a few girls I've known that worked there never received their money after working for weeks and  definitely my last check wasnt given to me with all my hours\nrecommend new directors in the front office.", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "109305050767514805056", "name": "SONG AaBbCc", "time": 1566223499466, "rating": 1.0, "text": "(Translated by Google) So bad.\n\n(Original)\nSo bad.", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "113100949471099715942", "name": "angie gilchrist", "time": 1623117017832, "rating": 5.0, "text": "Mathnasium has been great for us when my kid's online math class wasn't as great as what we were used to as in person classes.  Crystal worked with me to help get my kid where they needed to be when they return in the classroom. Our tutor was fabulous. He was patient and encouraging to my child. I highly recommend Mathnasium.", "pics": null, "resp": {"time": 1623118738301, "text": "Thank you...it's great to hear...Crystal  and our instructors appreciate your comments. Keep moving forward!"}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "105324510738489746216", "name": "clinton martin", "time": 1619289966868, "rating": 5.0, "text": "My son who is a 3 rd grader is a bright one and we wanted to find something that was more challenging than what the public school was currently offering. My son got a lot of one to one attention, he enjoyed Math more and ended up winning two awards in Math. His team from elementary school won 3 rd place among Huntsvile city schools and my son won first place in individual competition in his entire grade. We are very grateful to all the teachers who have kept him engaged through a very difficult year. The teachers are all so cool, they know how to talk to kids and engage them. I haven’t seen the rigid teaching style but rather saw a deliberate attempt to teach problem solving by approaching a concept from many different styles. This taught my son valuable lessons that there is more than one way to solve a problem.\nMuch appreciated and I am planning on getting my second child enrolled anytime now.", "pics": null, "resp": {"time": 1619291450674, "text": "Mr. Martin - thank you. This makes our day. It's a great feeling hearing of your son's success.\nRuss/Crystal\nMathnasium of Huntsville"}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "110519175267857320635", "name": "Tina Clarke", "time": 1616699230805, "rating": 5.0, "text": "My (8th grade) daughter has been struggling with math all year. A friend recommended Mathnasium but my daughter was hesitant and nervous to start. After the very first session, she came out smiling and saying that she loved the tutor she was paired with and that he showed her a new trick that made working the problems so much easier. She had a big math test after only 3 sessions and her score more than doubled. We've only been going a short time, but we've seen her grades continue to go up on every assignment and test. We are so happy we found Mathnasium. We started with a girl that had given up on math and was headed to summer school if not repeating the entire class. My daughter is now confident and actually enjoying math. 2 days ago I overheard her talking to a friend on the phone explaining how to do their math homework. I can't recommend Mathnasium enough to anyone who has a child struggling with math. Crystal is so nice to work with and all of their tutors are amazing! So thankful!", "pics": null, "resp": {"time": 1623118814353, "text": "Great to hear and thank you for taking the time to share."}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "109990771496129029224", "name": "Melissa Harty", "time": 1611271568862, "rating": 5.0, "text": "So happy we found Mathnasium right here in Huntsville!   My two daughters (age 8 & 9) love going here and the staff/tutors somehow make learning math fun!  They encourage personal goal-setting, and have developed a clever reward system to keep the students striving.   Honestly, mine wish they could attend more than twice per week.  No more home-work struggles and I feel such a burden lifted off my shoulders knowing that I'm supporting them.", "pics": null, "resp": {"time": 1613234098932, "text": "GREAT to hear! This is what we live for! Look forward to helping in their success."}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "113135898935611895728", "name": "Paula Phillips", "time": 1613227963844, "rating": 5.0, "text": "My daughter had many misgivings about tutoring at first, however everyone at Mathnasium Huntsville has done a wonderful job at making her feel comfortable and supported and this is clearly apparent in her academic performance. Her grades are up and so is her confidence! A big shoutout to Crystal and her crew, thank you for all you do!", "pics": null, "resp": {"time": 1613233977728, "text": "This is what we live for! Great to hear. Thank you."}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "101494871995471445076", "name": "Chris S", "time": 1581286778382, "rating": 5.0, "text": "Mathnasium significantly helped my child's grades.  You can drop off at anytime during their hours, which is so convenient.   My kids are always smiling when I pick them up.  They have a great rapport with the instructors and like earning the prizes.  The owner and manager are both great people to work with as well-very supportive. Highly recommend Mathnasium to anyone considering signing up.", "pics": null, "resp": {"time": 1581298550586, "text": "Thank you - our instructors appreciate the shout out. We work hard to assist students of all grades and aid them in their success."}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "113148993312359723587", "name": "Heather Armstrong", "time": 1588898903760, "rating": 5.0, "text": "Miss Crystal loves these kids and their progress. The staff loves what they do and gets the kids to love doing math as well.  We are so lucky we found mathnasium.  It saved so many family fights and helped our daughter find her confidence in her abilities.", "pics": null, "resp": {"time": 1623118874732, "text": "Glad to assist. We enjoy seeing our students excel and move forward."}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "113729414373974828712", "name": "Nita Herrington", "time": 1585164908678, "rating": 5.0, "text": "Incredibly effective. Straightforward process- filling in knowledge gaps and clarifying topics. Our eighth grade daughter is regaining her confidence in algebra, with improved grades after just a few weeks. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "106520617160467728093", "name": "Robyn Wainwright", "time": 1570103580240, "rating": 5.0, "text": "I am so glad we found Mathnasium. My daughter was really struggling with math and I wasn’t able to really help her. The way I was doing it and the way she was learning it was different.  She would get frustrated with me and say, “that’s not how I’m supposed to do it”! So you can imagine the frustration we were both experiencing . The staff at Mathnasium has been great and has helped my daughter a great deal. She is really enjoying it.", "pics": null, "resp": {"time": 1581298734265, "text": "Thank you Robyn. Great to hear we are assisting."}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "108889369331073129136", "name": "Heather Bookout", "time": 1552575281242, "rating": 5.0, "text": "It's a great environment with great people working there.  Both of my girls like it a lot!.  We got great grade-raising results! They keep it fun with great incentives for the kids.  Plus, we feel totally fine dropping the kids off there and running errands.", "pics": null, "resp": null, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "117448560675952219531", "name": "Kelly Finn Parker", "time": 1560028348908, "rating": 5.0, "text": "Every instructor at Mathnasium of Huntsville\nis exceptional!! They all love what they do and it shows with every child that they help.", "pics": null, "resp": {"time": 1581298839451, "text": "Kelly, thank you for your comments and 5 star rating. Team Mathnasium"}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "113155964891793879250", "name": "Lisa Andrew", "time": 1552875575862, "rating": 5.0, "text": "Great teachers. My daughter loves going there. They make math fun.", "pics": null, "resp": {"time": 1581298885132, "text": "Lisa, thank you and elated to hear we were able to assist. Team Mathnasium"}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "103291289012342498393", "name": "Ben East", "time": 1501028795263, "rating": 5.0, "text": "I've used this service from my Jr year in high school to my Freshman year in college. It has continually provided tremendous value in mathematics. The people and management are excellent and the atmosphere is positive and supportive. There's always a tutor That's able to help you work through a problem and grasp complicated concepts. Mathnasium saved me from having to repeat math classes in the past. Thanks again guys :)", "pics": null, "resp": {"time": 1501037298577, "text": "Thank you, Ben! You are always a pleasure to have in the center. I appreciate your positive attitude and willingness to learn. I'm excited to see what the future has in store for you! ~Phyllis"}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "117476151438808615830", "name": "Erin Boles", "time": 1516712445889, "rating": 5.0, "text": "This was the answer to our prayers! Phyllis Norton, the owner of the franchise in Jones Valley,  is the most amazing person!  The educator shared her own family struggle with her kids and math.  That’s why she opened this business. Her passion is evident! She  and the staff worked diligently and continue to follow up with us to make sure our child is getting what she needs. After many, many tutors and lots of other strategies, Mathnasium was what our child needed.  It offered a family peace that we had not had in a while when it came to math. I highly recommend it  here and continuinally recommend it to friends.", "pics": null, "resp": null, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "110984384137671950581", "name": "William Helmstadter", "time": 1523231588464, "rating": 5.0, "text": "Mathnasium is Amazing!  The Instructors really care and the kids enjoy going!", "pics": null, "resp": null, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "100749967659467766357", "name": "F. Slate", "time": 1537926925579, "rating": 5.0, "text": "I absolutely love the Montessori Learning Center. Ms. Charlotte and Mrs. Amanda are the best teachers you could find for your children. They are so sweet and kind to children and their parents. My son has attended two years now and has learned so much! My son started counted his toys in Spanish last night. They offer one on one learning. They have animals and learn how to take care of a garden in the back. They teach the children the most important facts and truly care about the children. I would recommend The Montessori Learning Center to anyone with daycare age children up to 1st grade. They are wanting to expand to 3rd grade students and I really hope they do.", "pics": null, "resp": null, "gmap_id": "0x8862134da073a3bf:0x87d7f84ae67a656f"}
{"user_id": "109589772433324157073", "name": "Rick Fisher", "time": 1473179120009, "rating": 5.0, "text": "Best place for your child besides home! The staff is wonderful. The method is great! Don't send your children to the horrible government run schools. The individual attention helps every level of child and you can't and won't get that at public/government school.", "pics": null, "resp": null, "gmap_id": "0x8862134da073a3bf:0x87d7f84ae67a656f"}
{"user_id": "102496161002306910888", "name": "M3Studios", "time": 1415833537481, "rating": 1.0, "text": "My 3 year old son went for three months. They kicked him out because they said he was too hard to deal with. They said he may have autism but had no evidence other than \"he was hard to deal with\".  He is now in Premier Preschool in Research Park and is much happier. They help him and have professionals come in and evaluate the children. He is a normal 3 year old boy with no problems. The Montessori Learning Center just did not know how to handle him. They are looking for easy kids to watch so they can sit around and collect checks. Would not recommend them after my experience.\n\nI assume the 5 star ratings you are giving yourself are in response to my review. I am sorry if you do not know how to handle children.\n\nIf you are reading this and looking at schools please don't take convenience into account when choosing a school. I drive across town every day to take my son to Premier Preschool and it is 1000 times better for him.", "pics": null, "resp": null, "gmap_id": "0x8862134da073a3bf:0x87d7f84ae67a656f"}
{"user_id": "111483122094619910905", "name": "Lauren Dauro", "time": 1501862465620, "rating": 5.0, "text": "Fantastic teaching staff with a wonderful curriculum.  The Montessori method is truly amazing - it's impressive to see children teach and learn from each other, just like a family.  They serve healthy snacks and use non-toxic cleaning choices.  I am so glad I chose this preschool!", "pics": null, "resp": null, "gmap_id": "0x8862134da073a3bf:0x87d7f84ae67a656f"}
{"user_id": "105475328010119681209", "name": "PT Dudley", "time": 1406490072261, "rating": 5.0, "text": "My child just graduated from Montessori Learning Center and we just LOVED It!! I can't say enough about the outstanding and professional staff at the school.  My child now is very well prepared for his new school and I would highly recommend the school to parents who want a small private school where your child gets a lot one on one attention, love and care.", "pics": null, "resp": null, "gmap_id": "0x8862134da073a3bf:0x87d7f84ae67a656f"}
{"user_id": "112555036034384766136", "name": "Jacqueline Baldone", "time": 1406564343722, "rating": 5.0, "text": "Both of my children attended Montessori Learning Center.  The teachers were wonderful and kind.  They were well prepared to enter kindergarten.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8862134da073a3bf:0x87d7f84ae67a656f"}
