{"user_id": "104536544202830851810", "name": "Bob Akers", "time": 1588019830174, "rating": 5.0, "text": "I have been using Worth Cleaners for several years and continue to be impressed with their quality, service and friendly staff. Usually visit them on a weekly basis to either drop off or pick up. Their email notifications are helpful also. During these unusual times the management and staff are doing everything they can to make sure everything runs as smoothly as possible.", "pics": null, "resp": null, "gmap_id": "0x888c2bf976f6c0f3:0xdcc5b0bc176bd3c5"}
{"user_id": "105383277358764327911", "name": "JaKierra Lee", "time": 1619926752060, "rating": 5.0, "text": "Awesome fast service", "pics": null, "resp": null, "gmap_id": "0x888c2bf976f6c0f3:0xdcc5b0bc176bd3c5"}
{"user_id": "107621512426598307261", "name": "m stoup", "time": 1603713679916, "rating": 5.0, "text": "Efficient! Friendly! Priced right!", "pics": null, "resp": null, "gmap_id": "0x888c2bf976f6c0f3:0xdcc5b0bc176bd3c5"}
{"user_id": "106003703901042237611", "name": "Kimberly Lewis", "time": 1573821601271, "rating": 1.0, "text": "I went to this location on November 7th to see of they would clean an area rug. The lady that checked me in looked at the rug, consulted with another worker that was there at the time, gave me a ticket, and told me that the rug would be ready around the same time the following week. I called on November 14th to check the status of the rug. I was told \"Yes, the rug is ready, but we couldn't clean it.\" I asked her why did anyone not call me to let me know that it could not be cleaned? Basically all I got was an \"I don't know\" and some other pathetic excuse. I immediately proceeded to pick up my uncleaned rug that has just been sitting on a table for an entire week.\nFor the entire life of me, I do not understand why something as simple as a phone call did not happen. As soon as they saw that they could not accommodate, all they had to do was call and say, \"We apologize for the inconvenience, but we cannot clean your rug.\" I would have happily returned to pick up my rug and found another company to clean it. I am pretty sure that someone knew that Friday morning after I dropped off, that they would not be able to clean my rug. But NO, the rug just sat there until I called to check on it.  A simple phone call. Communication, communication, communication. Inconsideration and/or laziness. But regardless, there was absolutely no reason why I was not contacted. This was my first and most definitely my last visit.", "pics": null, "resp": null, "gmap_id": "0x888c2bf976f6c0f3:0xdcc5b0bc176bd3c5"}
{"user_id": "107306212726433103320", "name": "Tony Drake", "time": 1517856424019, "rating": 5.0, "text": "The folks at Worth Cleaners on Vaughn Road are like family.  They hustle to get me in and out as quickly as possible since I come in on my way to work. They are always pleasant and always happy to see me.  The clothes are always clean and starched just like I like them.  I couldn't ask for better service.", "pics": null, "resp": null, "gmap_id": "0x888c2bf976f6c0f3:0xdcc5b0bc176bd3c5"}
{"user_id": "106885371602688721228", "name": "Kaleigh Flatt", "time": 1463542575892, "rating": 5.0, "text": "By far the best dry cleaners in Montgomery! I have had items ruined at some of the other dry cleaners in town and charged an arm and a leg by the others. I like that Worth Cleaners posts their prices on their website so I know how much everything's going to cost before I go. Plus their staff is super friendly. I would definitely recommend Worth Cleaners.", "pics": null, "resp": null, "gmap_id": "0x888c2bf976f6c0f3:0xdcc5b0bc176bd3c5"}
{"user_id": "114555069129825287638", "name": "Cecilia Ike", "time": 1563802165149, "rating": 1.0, "text": "If you do not care about your clothes and want them ruined, you have come to the right place. I recently purchased 2 pretty gowns for my daughters, they wore it to one family occasion before we sent it to worth cleaners. They tore one and used their dryer to shrink the organza fabric overlay of the other one. They returned the clothes without mentioning anything about the damage(very fraudulent people) and when I asked them about it, they stated that they only followed the instructions on the care label, that I needed to go back to the store where I bought it (belk, 21 days ago) and complain to the manufacturer about the wrong care label. Seriously......for even the torn outfit? I don't understand why these scammers are still in business. I left the 2 gowns with them and they are yet to contact me 3 weeks later. There are so many credible laundry services out there, do not make my mistake!!", "pics": null, "resp": {"time": 1563892726862, "text": "Dizzy, we are very sorry to hear about your experience. We strive to give every customer that walks through the door the best possible cleaning service and we are sorry that you feel that wasn't the case. Please reach out if you would like to discuss this matter any further. Thank you, Worth Cleaners."}, "gmap_id": "0x888c2bf976f6c0f3:0xdcc5b0bc176bd3c5"}
{"user_id": "106822066775998946885", "name": "Kim Lewis", "time": 1579569242238, "rating": 5.0, "text": "Good cleaners. Good customer service.", "pics": null, "resp": null, "gmap_id": "0x888c2bf976f6c0f3:0xdcc5b0bc176bd3c5"}
{"user_id": "105453859650625175754", "name": "Darrell Moses", "time": 1467215670777, "rating": 1.0, "text": "Ruined my shirt.  I sent it back several times ove4 a 2mos period and still no resolution.  Tried to contact the manager Steve Worth but he would never call me back. Staff kept acknowledging they gave him the message. Before this incident the Vaughn road staff was great.", "pics": null, "resp": null, "gmap_id": "0x888c2bf976f6c0f3:0xdcc5b0bc176bd3c5"}
{"user_id": "104522436792968627850", "name": "Heather Stage", "time": 1513989002988, "rating": 5.0, "text": "Kindest people, got me in even though I was late! Love them!", "pics": null, "resp": null, "gmap_id": "0x888c2bf976f6c0f3:0xdcc5b0bc176bd3c5"}
{"user_id": "113392264273281434276", "name": "Just 1 Man", "time": 1544395443302, "rating": 4.0, "text": "They did an excellent job on the band uniform", "pics": null, "resp": null, "gmap_id": "0x888c2bf976f6c0f3:0xdcc5b0bc176bd3c5"}
{"user_id": "109434815444559109310", "name": "David Asuncion", "time": 1507848144251, "rating": 1.0, "text": "Stains all over a brand new WHITE dress shirt, giant wrinkle in my brand new suit jacket. Steer clear of this place.", "pics": null, "resp": null, "gmap_id": "0x888c2bf976f6c0f3:0xdcc5b0bc176bd3c5"}
{"user_id": "113668404832189903977", "name": "Andrew Watson", "time": 1480691295880, "rating": 5.0, "text": "Overall pleasant experience. And they fit that stain out of my comforter.", "pics": null, "resp": null, "gmap_id": "0x888c2bf976f6c0f3:0xdcc5b0bc176bd3c5"}
{"user_id": "117285476492956827129", "name": "Stephen Pierce", "time": 1557326130380, "rating": 5.0, "text": "Great!", "pics": null, "resp": null, "gmap_id": "0x888c2bf976f6c0f3:0xdcc5b0bc176bd3c5"}
{"user_id": "107197523533139826059", "name": "Adesuwa Tina", "time": 1521080034186, "rating": 5.0, "text": "Friendly management and employees", "pics": null, "resp": null, "gmap_id": "0x888c2bf976f6c0f3:0xdcc5b0bc176bd3c5"}
{"user_id": "108860073794465432218", "name": "Cassie Connell", "time": 1523456287019, "rating": 1.0, "text": "This place is so dirty there is trash everywhere and none of the car wash bays are working. They are shoved full with quarters and I would definitely not suggest going here.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPY0-alyzOvZbvTAtIWxBzcnpyug6bIvwn5bfrr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPU6Hr4WUm7ETDOPUusWBs0ccvl3Tmn3PbRi6Xv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMUIDj8HLrG1ca3fOLubLpA-2IHr7wj96sdNW0Q=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "109887668314409103210", "name": "Theresa Plunk", "time": 1555027303350, "rating": 3.0, "text": "Not a bad place but they just put in old standard car wash not a hand wash.  They also put a dent in my rear door. As he pulled back up to building from car wash to vacuum.  The man forgot to close rear door.  Pulled forward and my door hit edge of building.  Unfortunately they did nothing about it.  Not even a discount on car wash.  Just an I'm sorry. Guess that's better than nothing.  If I wasn't standing there witnessing it happen I doubt I would have gotten that much.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "109614074682535531684", "name": "Patricia Knowles-Shreve", "time": 1570901448232, "rating": 5.0, "text": "Dropped my car off to get a inside and out wash, very happy with the results. They even cleaned the floor mats and door panels for me even though it didn’t show it as included! Will probably be back again for a full detail later.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "103305955139942538619", "name": "Pete Santorelli", "time": 1526752425597, "rating": 5.0, "text": "I've been a customer for 6yrs and this place has always treated me well. They're professional, courteous, and always take care of my vehicles. They are almost always quick with turning around my vehicle. I stick with the full service and get it every couple weeks. Will continue recommending this place!", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "112314740655853071976", "name": "Tim Stewart", "time": 1391293483847, "rating": 5.0, "text": "I was really surprised to read the reviews on here AFTER I had my car detailed. The Bailey Cove location had been recommended by my daughter. The receptionist who made the appointment was incredibly friendly and helpful. I was told the car would be ready at 4:30 and they called at 3:00. I had the ultimate detailing and certainly got my money's worth. The car interior and exterior looks brand new. This was a great experience from scheduling to picking up the car. I was even able to pay with my iPhone using Square which was a novel experience. I wouldn't hesitate to recommend them!", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "115124171940630440647", "name": "Courtney Moore", "time": 1467480332885, "rating": 5.0, "text": "Always professional and courteous!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNMtFnHpyex7lRHa6slA9PLaWalkLHuVh6N7M1G=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "110961749081376988868", "name": "Brad Hall", "time": 1568076345699, "rating": 5.0, "text": "They do a fine job cleaning, but they used a really strong tropical scent that lingered forever.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "103194188955992924305", "name": "Red Kerusso", "time": 1516391625279, "rating": 5.0, "text": "Proffessional and seamless cleaning.   They demonstrate a tenacious commitment in making your vehicle look new.  By far the best car wash business I've been to in a while.  Appreciate you and your core values. I bring all my family's vehicles here", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "100821807085632573963", "name": "Carolyn Carter", "time": 1431964254617, "rating": 5.0, "text": "I had the Express Wash last week and was VERY satisfied! They ALWAYS do a great job and are very nice and polite. I've never had any issues and I will continue to drive the hour that it takes me to get to Huntsville, to come here for a great car wash.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "107378886579746463895", "name": "Will P.", "time": 1522507451668, "rating": 5.0, "text": "I have come to this place for detailing many times and have always been satisfied, the staffs is friendly and professional, and the service is great. I have found early morning is best to save time. I will keep coming back.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "104953683938174439270", "name": "George Mantis (G-Man)", "time": 1521645570161, "rating": 2.0, "text": "3 stars for Jones Vallley, 1 star for Madison, averages to 2 stars. The Jones Valley location used to be great. Now they can never even start on your car without at least 2 hours’ wait, regardless of time of day or how busy they are. Under their previous manager, they were fast and always professional, with never a problem. Not any more.\n\nAs for Madison... After 8 years of bringing my cars here and nowhere else, I will never do business with them again. I brought my car one day for a full detailing ahead of a lease return. My appointment was for 10am but I brought them my car at 9am. The receptionist told me it'd be done by close of business (5pm). I called at 4:30, and was told 6:30. Then it 6:00 they called to say 7:30. Then at 6:30 they asked if I could wait until tomorrow!?! They had my car ALL DAY and did nothing, even with an appointment. The owner offered only superficial apologies and lots of excuses - \"we're very busy\" (but I had an appointment!) \"it's cold out\" \"we're not machines.\" Customers - especially repeat ones accustomed to excellent service - don't want to hear excuses.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "113476936199175212369", "name": "Jon Bierer", "time": 1503167451861, "rating": 5.0, "text": "Prices are great, service is great. Didn't know they were going to take my car to the wash rack next door to wash, so I was confused at first. They brought it back and detailed it. Looks beautiful.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "109397916883020785993", "name": "TomKat Fleming", "time": 1438564653908, "rating": 2.0, "text": "Very Disappointed! Using Groupon, I had 2 vehicles washed and waxed at the Jones Valley location  the same day. First, the positive: Both the young man and young lady who waited on us were courteous, friendly, and professional. The wax jobs appear good. The negative: on our SUV, the wax was applied over a non-clean roof and bug splats on the hood. We paid extra to clean the interior of each. This was not the $125 interior detail, just a $12.95 interior cleaning. Not sure what that was to include but since there was an attempt to clean the window and vacuum, I assume that was included. We removed all items from the car to make this easier. On our SUV, the carpet appeared vacuumed in some areas and \"untouched\" in others. On our sedan, the trunk was not touched. We left empty compartments open for vacuuming/cleaning; that didn't happen. On both vehicles, the seats were not vacuumed.  The interior side of the windows had streaks and smudges. We won't go back.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "107369093322119152100", "name": "Tory Meeks", "time": 1436650000009, "rating": 5.0, "text": "On the spot has always done a superb job on my truck. I let nobody else touch my truck except on the spot. The customer service is 10/10. The employees always put the customers first, which is something I love most about on the spot. I have been recommending them to everyone for a couple years and will continue to do so.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "105326850390112041572", "name": "Ingrid Royster", "time": 1480116332471, "rating": 5.0, "text": "Great job!  I just had the 2nd level car wash but the car, tires and carpet look great!  Everything was dusted and the windows look great!! All for $25!!  Super good deal!", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "104144759760384538104", "name": "Shar Saidla", "time": 1549127091663, "rating": 5.0, "text": "Immediate professional and friendly service!\nThank you for taking good care of me!", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "102761110295078641650", "name": "Kelli Sepanen-Proctor", "time": 1482333463541, "rating": 5.0, "text": "On the Spot is always friendly and professional. I've been coming here for over two years now for their services with my vehicle. They do a nice job of cleaning, waxing and washing.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "100743427865097648667", "name": "Jessica Koerner", "time": 1376775549639, "rating": 2.0, "text": "I took my car to their University Dr location about a year ago and had a great experience. Not so much at the one here in Jones Valley. I was told the day before that if I dropped my car off before 10am the next day it was guaranteed to be done by 1pm the same day. I wanted a full detail and a headlight scrub, they quoted me $115. I dropped it off at 9:45, and 1pm came and went. Around 4pm no one had called me. I called and they it would be done by 5, and that of course the 1pm was no longer guaranteed. I showed up at 5 and had to wait until 5:30 in the lobby. Then when I went to pay, they added on $65 to the headlight scrub, which was implied upfront would be a part of my detail job. This $65 quote was not on the original estimate, although it was notated they would clean the headlights. Not a fun time!", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "114977385674828243960", "name": "Paul Revy", "time": 1400522505147, "rating": 4.0, "text": "Took my SUV to be detailed at the Bailey Cove location. They took a little longer than the estimated time to do the work, but the vehicle was immaculate when they were done. Recommended", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "107603777387302284236", "name": "Jeremy M", "time": 1521302300400, "rating": 5.0, "text": "I have been using On the Spot Auto Detailing for the last few years.  The customer service has always been great and my vehicle has always been cleaned to perfection!", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "116918758840997235609", "name": "Vitaliy Didyk", "time": 1436422016949, "rating": 1.0, "text": "Terrible service,I've paid $150 and they didn't even vacuum under the seat or in the back of the trunk but did leave me with a nice dent on the door, they charge top $ to detail the car but seems to me like they don't even know the meaning of that word.\nI would highly suggest not to go to that place?do it yourself you'll definitely do a better job and I promise you it won't take as long as it does with those guys", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "105790375338598967561", "name": "Richard Klimas", "time": 1522957541976, "rating": 5.0, "text": "Excellent business.\nProfessional, courteous and timely service.\nMy car didn’t look this good when I picked it up from the dealership, brand new !?!?!\nWould highly recommend !!!!!\n“ I’ll be back !!!!”", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "107212337553056573441", "name": "Brad McClellan", "time": 1567708476391, "rating": 2.0, "text": "Not sure I'll be going back. The crevices aren't clean, the wax appears to have scratches that weren't there before", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "102370912811903461919", "name": "Forrest Tuttle", "time": 1522956811628, "rating": 5.0, "text": "First time coming here and this place is amazing, I have never seen my car so clean!!!! This is the only place I will take my car for detail and washing for as long as I live in Huntsville.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "110385946260536940561", "name": "Thomas Hatley", "time": 1399073094078, "rating": 1.0, "text": "Twice the attendant slammed my transmission into reverse while my car was moving forward.  After waiting in line for 20 minutes before my car was washed, another customer was allowed to pull up and have his car washed while he was sitting in it and mine was unattended.  I was in no hurry, and honestly don't believe saying anything would have gotten me anywhere.  After about an hour and 15 minutes, my car left only slightly cleaner than before it got there.\n\nSimply put.  Avoid this place.  Believe me, I wish I would have.\n\nEdit: I was at the Hughes Road in Madison location.  Cannot speak for the other one", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "105035441883934359323", "name": "Joe Pi", "time": 1534183463464, "rating": 1.0, "text": "I decided to have my vehicle detailed which they do for $199. I spoke with Brittney on the phone to get details of the work included and to make the appointment. To sum it up, everything except the engine! I made the appointment and wednesday was there at 8:30am as scheduled. No one was there. At approximately 9 am employees showed up and took my car. Inwas told that the credit card scanner wasn’t working so I would need to bring cash.\n\nAt 430 i called and was advised my car was done. When i got there I spoke with the man cleaning the exterior of my car. I asked if they cleaned the trunk jambs as I noticed a large deposit of mud when i got groceried the other day. He said yes. I then waited about 10 minutes for my car. I watched the man open the trunk and then wipe the trunk jambs...?\n\nIt was an overcast day and the car looked good... until I got home. My chrome exhaust was still black (i rubbed with my finger and it comes off), the fuel tank door was dirty (once again my finger lifted the dirt there), large spots on the chrome grill looked untouched, large spots on the lower door panels were untouched, smears on the windshield,and spots on the rims were untouched. I paid and their CC machine did work... amazing.\n\nI have pictures and videos of all things I mentioned.\n\nI was going to just leave it alone but knowing I paid $200 for a half a$$ job didn’t sit well with me.\n\nI have to say the interior was GREAT! A little excessive with the oils but you can tell they took their time and got everything looking sharp!\n\nOn Friday i called and got Brittney on the phone again. I asked for a manager and she said she would relay a message for me. I told her I’m calling to complain about the detail I got... she asked for details and i told her everything. She called back a few hours later and advised that the owner/manager said i can bring the car back. I advised that i didnt have all day to leave my car to be washed and waxed again. (I highly doubt it was even waxed as there was so many spots that were unwashed... the wax would have stuck to it). I told her honestly the interior looked great and id be ok with paying for that service but need to be reimbursed for the remainder. She basically told me that wasnt an option and that thisnis how the manager handled things. He doesnt talk to customers and just has her. I explained that im offering to pay for the work that was done correctly... most customers would just want a total refund. However, if she cant authorize that and the manager wont even talk to me to settle the issue, ill just have my CC company cancel the payment.\n\nI feel sad for Brittney as im sure she is put in this situation often.\n\nMy advice, stay away.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "103605980904461652377", "name": "Leidy Aquino", "time": 1510853423719, "rating": 5.0, "text": "On The Spot Is The Best Place to get your Auto detail ! I will definitely recommend them to everyone ! They will have your Vehicle looking Spotless! best customer experience ive ever had  !", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "109803221684805831190", "name": "Jeff Williams", "time": 1395176916375, "rating": 1.0, "text": "I wish I read read the reviews before buying.  I went to the small location on Hughes, and they did a horrible job on my car. I got the $60.00 \"Supreme\" wash. This is the first time I've paid to have my car cleaned and it will probably be the last.\n\nThere is a large section on my front bumper they missed. There was cleaning product pooled in my cup holders. It looked like they had just sprayed it on in places and never wiped it off. My dash and console was all spotty, and covered in a mix of dust and cleaning spray. They did not open my hatch and vacuum the back. The front was vacuumed but not well. There was a tone of very fine loose dirt  on my from floor mats. It looked like it came from the inside of the shopvac they used to vacuum the car. I can't believe they use a shopvac for this. I have leather seats, and they did not so much as wipe them down. My back seat had dirt in it from where I had sat a pair of boots. It's still there. There are little spots all over the outside of my car. I suspect that is from the spray wax they put on. I'm not sure.\n\nThe worst part is, my car has an odor now. It smells like body odor. I think that may be from the cleaning supplies they use. I don't know. I'm cleaning my car myself this week though. I've got to get the smell out. This place is horrible. I will never go back.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "102431803010449618553", "name": "Jason Carter", "time": 1467306991399, "rating": 5.0, "text": "Very friendly service. Fast and detailed. My car looks great!", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "108444739649725110691", "name": "Richard Ensley", "time": 1456609775045, "rating": 5.0, "text": "This is the best detail job I have seen in along time, also their customer service was great.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "110660122339048534933", "name": "Angela Whitlock", "time": 1458597972052, "rating": 1.0, "text": "So I went to get my car seats and carpet shampooed (interior package). First of all, the package was 124.00!!! So right off the back I'm thinking they MUST be excellent at their job. I was sadly mistaken! I dropped the car off in the morning after making an appointment online. I asked the guy on duty about what time the car would be done. He said \"about 1pm\". I was cool with that. So I left and went to run errands. Around 1:30pm I called the place to find out the status. The woman who answered the phone put me on hold for over 5 min so I hung up and drove to the place to see how things were going. When I got there there was an older woman complaining about a previous job they did to her car. I just remember her saying \"someone owes me 10 bucks to fix this\". Anyway, one worker sees me and says \"would you like to see your car?\" I said yes and followed him into the garage. The car STILL had the dark brown stains on the carpets! Before I can point it out he says \"I couldn't get it out. You should try dying the carpet.\" I was upset because the car also looked like they didn't vacuum well... if at all! Then there were dirt spots on my back window. The door jams were STILL dirty! The tires were dirty and the front bumper!  I ran my finger on both and lifted black dirt from those areas! They uses the wrong cleaning material on my middle console that caused paint to come off. I was very upset and dissatisfied snice I left it there for almost 6 hours already! I asked to speak with the manager. I told him this was no where near a good job for that price. After some deliberation, he agreed to knock off 25.00. This was a bit of a relief, but honestly, that was a 50.00 job (at best). THEN... about 2 hours later, that woman calls me back and says \"your car is ready for pickup\". I told her I already picked it up. She said \"oh I guess I called the wrong person\". I'm so annoyed with this place! They are so unorganized. Save your money and go elsewhere where they do a job that fits the amount that they are charging you. This was a waste of time. I would recommend Melvins On the Spot Car Wash in Florence, AL if you are in that area. He has had that business for 30 years! They know how to do it right and have better prices!", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "112378268514162244147", "name": "Pat Guettler", "time": 1528036188036, "rating": 5.0, "text": "I won't take my car anywhere else. Great staff. Super attentive to detail.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "110275280954051544973", "name": "john lang", "time": 1421719915412, "rating": 1.0, "text": "I read the reviews and was hesitant to buy a Groupon, but I'm pretty low maintenance, so I figured it would be fine. Nope.\n\n3 hours turned in to 8 hours. We had scheduled a 9:00 appointment and I was on the road @ 5:05 after they completed the second car. Initially, they told me around 12:00. I had to kick up a fuss to even get them to begin after 3 hours.\n\nThey didn't vacuum the whole car until I asked them about it.\n\nAfter I got home I discovered they hadn't even washed the roof of the SUV, much less waxed it.\n\nWhile we were there they lost a center cap off of some guy's BMW. The best they could do was \"sorry.\"\n\nEven with a Groupon discount it was a waste of a day and not even worth the $130 I paid for two cars.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "116453512290121227569", "name": "Ray Phillips", "time": 1467471389503, "rating": 5.0, "text": "Great car wash they do a good job in a  timely manner don't have to watt long", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "110996686715111794231", "name": "David Schultz", "time": 1428522068823, "rating": 1.0, "text": "Don't waste your time or money on these people. They are extremely overpriced and do a piss poor job. I could have washed my vehicle better with a toothbrush and a garden hose.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "110430415298834740464", "name": "Lewis Metts", "time": 1472322186520, "rating": 5.0, "text": "Locations in Madison and Jones Valley.  Have used them both.  Fantastic work!", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "110655253738272309098", "name": "Rachel Baines", "time": 1473453863463, "rating": 1.0, "text": "Absolutely terrible service. Save your money and go elsewhere!\n\nI thought maybe the other reviewers were exaggerating a tad so I decided to give this place a shot and purchased a groupon. Now I'm out $60 and my car still looks terrible. Really disappointed.  Dealing with these people was a nightmare from the get go, and now I'll have to spend more money to take my car elsewhere and have it washed and waxed properly. Do yourself a favor and stay away.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "107077560437822791724", "name": "Ryan McMahon", "time": 1468611963880, "rating": 5.0, "text": "Great expierence and very clean car! Quick to clean it up too! Thanks!", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "115858544504690588548", "name": "Douglas Meeks", "time": 1490635241206, "rating": 5.0, "text": "I have 3 cars but I have a 2005 Freestyle that I use for hauling things (like my dogs) and it is never all that clean but one day recently I was picking up one of my dogs after a bath (black haired dog) and they had forgotten to brush him out good and I had a ton of dog hair all in my car and it was overdue for a cleaning.  I took it to On-The_Spot and the guy offered me a price that I thought was too low so I made him come out and look at the mess and he added like $10.  The thing is when they got finished several hours later and I came to pick it up it looked like a freakin' miracle it was so clean (close to new car clean) so I gave them a $20 tip and paid the fee gladly since I could never have done it and even if I had tried to do it myself the finished product would have looked like trash in comparison to the job they did for me.  5 Star service in my book\n\nDouglas C. Meeks\nAmazon Top 500 ​VINE ​Reviewer, Goodreads Top 1% Reviewer, Reviewer for  Wicked Scribes and Kindle Book Review", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "112934051222361772033", "name": "Breanna Burt", "time": 1525923971743, "rating": 5.0, "text": "jv location is a great on the spot location.i took my car in to get cleaned earlier today and the guys did a very outstanding job.would recommend them.clean waiting area,smells beautiful,respectful and polite customer service...will see you guys again when i need my car cleaned again", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "108115454761450512859", "name": "XKingXclusiveX Gaming", "time": 1548516993889, "rating": 5.0, "text": "Best on the spot car wash location in Jones Valley", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "114888281921558257551", "name": "Michael Pryor", "time": 1467409498314, "rating": 5.0, "text": "Bring my car once a month....they do an excellent job !!!! Only one I trust with my vehicles in ON THE SPOT!!!", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "115441927436831442630", "name": "Rick Chaney", "time": 1458061180419, "rating": 5.0, "text": "Did a  great  job, very courteous and got car right in with no wait!", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "113736047442681242878", "name": "Tremayne Gilbert", "time": 1531408916520, "rating": 5.0, "text": "Nice place to get car wash will be back again", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "104826818369904984061", "name": "Elia Lorenzo Canseco", "time": 1504184230395, "rating": 5.0, "text": "Me love this carwash. Great service", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "113664358359073704498", "name": "Wes Cold", "time": 1451327417824, "rating": 5.0, "text": "Great customer service  clean environment great at what they do they will have you in and out fast as well", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "101913219707007647834", "name": "Michael Vollmer", "time": 1428181311841, "rating": 1.0, "text": "Worst car wash ever. Basically they just spayed it with water. I've used them twice and each time it has came back dirty. Last time they didn't even wax it but charged me $75 for it. Stay away.\n\nI was burned by the groupon scan too.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "107086150756429913554", "name": "Chad Watts", "time": 1484000676687, "rating": 5.0, "text": "They do a great job. Will be coming back.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "100058584017206995146", "name": "Daniel Staples", "time": 1405810843071, "rating": 1.0, "text": "Dp not use this location. (I don't know about the others). I bought the Groupon for the expensive one that says \" Supreme Service Wash, Swirl Remover, Polishing Crème, Banana Crème Wax - A FAST AND EASY WAY TO ELIMINATE SWIRLS FROM BOTH FRESH AND CURED PAINT SURFACES. \" Its a $135 service so it better be good. NOPE.\n\nThe car was kind of shiny but no swirls were removed. In fact, I would say the shining made it look worse than before. The carpet had a basic vacuum but some dirt and dog hair remained in spots. The only bright spot was the dash was well done. I can't imagine they spent more than 30 mins TOPS on the car leaving it the way it was. Not worth even the Groupon discount. Super disappointed. Will NEVER return.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "114830647859990606981", "name": "edwardcruz82", "time": 1452541123810, "rating": 4.0, "text": "Walked in and was able to get my car washed on the spot.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "104520241657944615698", "name": "Terrian Patrice", "time": 1457191655194, "rating": 4.0, "text": "Very clean environment and the service was great!", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "101982964178411197154", "name": "Tracy Reynolds", "time": 1459782801229, "rating": 5.0, "text": "Always the best. Never disappointed!", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "106791529330142825568", "name": "Ronald Lucid", "time": 1484410623947, "rating": 5.0, "text": "These guys are awesome!!!!!!! I have been going for years to them when they were on University Drive and now in Madison at there new facility.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "105346542132957063069", "name": "Woodrow Bowling", "time": 1445112189240, "rating": 1.0, "text": "My wife took her Camara there, and they stole the rear floor mats. 6 weeks later, I've heard, we ordered them and waiting for delivery...they came but to other location...you can't contact the owner because all numbers forward to the Madison site. Bad enough they stole the factory floor mats, but to have religious Christian quotes on the walls and do this! These people should be closed down.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "100152592722941792158", "name": "Rebecca Shaughnessy", "time": 1493223242068, "rating": 4.0, "text": "Clean, quiet waiting area, have specials and Groupon discounts. Have been here several times and will return.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "112977974226148592246", "name": "Melissa DeBerry", "time": 1488045239706, "rating": 5.0, "text": "Great car wash, but the service is superb.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "104742178654018743390", "name": "Jerrid Spinks", "time": 1471626050197, "rating": 4.0, "text": "Did nice job cleaning my car. Outstanding service.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "101805586055624800577", "name": "Alex Resendez", "time": 1436029305612, "rating": 1.0, "text": "Scheduled someone to come out and wash my car but they never came by and I never received a call as to why guess they didn't want my money... happaned about 3 months ago.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "108228175992109644920", "name": "Patrick Franklin", "time": 1515790310998, "rating": 5.0, "text": "Waiting area is awesome!!! Looking my cleaning vehicle", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "101257840573753216679", "name": "SoutherCharm2", "time": 1476454843790, "rating": 1.0, "text": "Every bay is broke. Beer cans and junk everywhere. The city need to condim this place.  DONT EVER GO HERE!!!", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "104660193972100495136", "name": "James Owen", "time": 1556834071629, "rating": 3.0, "text": "Good job", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "117746804934931899487", "name": "Tamara Ledkins", "time": 1500067517595, "rating": 5.0, "text": "Very pleasant and helpful", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "115291986505355804368", "name": "David Betz", "time": 1496520668622, "rating": 5.0, "text": "My truck came in looking like i killed every bug in Alabama. Left looking like i just bought a new truck! Thank you guys! Will be coming back!", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "101524573537050179144", "name": "G2daVee 1", "time": 1497713824462, "rating": 5.0, "text": "The folks at On the Spot always  leave my cars cleaner than any other car wash.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "117263159073156544741", "name": "tim tillman", "time": 1473522582564, "rating": 5.0, "text": "Amazing service and great wash!!", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "107085671560860361399", "name": "Christine Stewart", "time": 1488421554514, "rating": 4.0, "text": "Wonderful service", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "116920876450152039470", "name": "Whitney Robinson", "time": 1467399210663, "rating": 5.0, "text": "Short wait and good service!", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "104882950052183939837", "name": "Ricardo Jimenez", "time": 1467486499571, "rating": 5.0, "text": "5 stars. Great service", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "103024892711535615808", "name": "Henry Seright", "time": 1447019849856, "rating": 1.0, "text": "Terrible Service, and half did the job.", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
{"user_id": "107108286374912229243", "name": "Kenya Rawls", "time": 1435991051789, "rating": 1.0, "text": "The inside of my car wasn't properly cleaned and wax was all over my car. Smh\nHughes Rd. location", "pics": null, "resp": null, "gmap_id": "0x88621257eb4fc911:0x30d2bc60e10a06b4"}
