{"user_id": "114772139006624495426", "name": "Eric Trahan", "time": 1593195775414, "rating": 5.0, "text": "Took 15 minutes to make my wedge for my shoe. That's only because of the great conversation we were having. First choice for future shoe repair!", "pics": null, "resp": null, "gmap_id": "0x8889cbc0cd46c125:0x7bd2cac7f3250c69"}
{"user_id": "100583814798494601266", "name": "Blessed Mommies", "time": 1561981394666, "rating": 5.0, "text": "This guy is awesome and nice, he is reasonable. Highly recommend this place.", "pics": null, "resp": null, "gmap_id": "0x8889cbc0cd46c125:0x7bd2cac7f3250c69"}
{"user_id": "113206824405402820195", "name": "Tami Haynes", "time": 1533686509668, "rating": 5.0, "text": "I have a pair of boots that belonged to my grandmother that needed to be restitched. I just happened to pass this place on my way to get some orange rolls at All Steak and thought I'd stop by to see if anything could be done. He basically told me that he couldn't make any promises but he would certainly try. I completely understood because they were pretty badly torn. I was so surprised by the outstanding job he was able to do! I don't remember the cost but I do remember it was less than $5 and I thought to myself,  \"how is this man gonna stay in business charging pennies for this phenomenal service?\" But I guess enough people have found this little gem and he's stayed open. I am truly happy with his work.", "pics": null, "resp": null, "gmap_id": "0x8889cbc0cd46c125:0x7bd2cac7f3250c69"}
{"user_id": "109243282700499733036", "name": "Matt Kinsland", "time": 1403208357860, "rating": 5.0, "text": "Just got my cowboy boots back. They look like new. Friendly people that provide quality craftsmanship at a VERY reasonable price.", "pics": null, "resp": {"time": 1483669610020, "text": "Thanks for the review! Always happy to provide the best service to the best customers."}, "gmap_id": "0x8889cbc0cd46c125:0x7bd2cac7f3250c69"}
{"user_id": "107918651458192382523", "name": "Kami Drake", "time": 1570931487928, "rating": 5.0, "text": "I bring all of my leather shoes to Mr Briscoe for sole protectors and repairs! Great work and quality service!", "pics": null, "resp": null, "gmap_id": "0x8889cbc0cd46c125:0x7bd2cac7f3250c69"}
{"user_id": "113399469160623042639", "name": "Matt T", "time": 1485558120716, "rating": 5.0, "text": "Excellent craftsmanship and fast friendly service. You can't ask for much more than that. Highly recommended.", "pics": null, "resp": {"time": 1485620766831, "text": "Thanks for taking the time to write a review. We're happy to give you the best service in town. Tell your friends!"}, "gmap_id": "0x8889cbc0cd46c125:0x7bd2cac7f3250c69"}
{"user_id": "114627061029819117482", "name": "Meg Wilson", "time": 1628260141961, "rating": 5.0, "text": "If I could give this 10 stars, I would. I am completely blown away - the packaging alone is worth the cost! I purchased the Front Porch TN Whiskey Barrel Handle & Leather Flyswatter for my husband for his birthday - honestly as a joke (we have a long standing inside joke re: flyswatters in general) - but the quality and craftsmanship is so fantastic, it’s no longer a joke and I’m mad at myself for telling my (7 y/o) son it could “be from him” (before I saw it).\n\nFast shipping, easy shopping, beyond excellent quality - worth every penny (probably more pennies to be honest)! I will be back for more gifts in the very near future and will recommend to anyone that will listen in the meantime.", "pics": null, "resp": {"time": 1628345579232, "text": "Hey Meg,\nThis review made our day! Happy Birthday to you husband and flies be ware!"}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "101299708189626454842", "name": "Rick Lightfoot", "time": 1628102682662, "rating": 5.0, "text": "One of the best companies I have ever done done business with by far! I did a test order of one of the men’s desk valets do see about the quality before ordering several more (all the men on my Xmas list) When the caddy arrived not only was the quality top notch but it was in a very nice dust bag and hard sided gift box. Also when I ordered I missed putting in the personalization and one quick email to them and it was fixed. I would give them 10 stars if I could.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "102479486402382536955", "name": "Luci Hawes", "time": 1627330000744, "rating": 5.0, "text": "Totally exceeded my expectations!!\nI recently ordered a Bday gift, 10 days before the party. The day before the party I still didn't have the order so I was a little disappointed. Though I was hoping for it, I realize that anything personalized was likely going to take a bit longer. I emailed them voicing my concern and unexpectedly they overnighted it to me with no questions asked!\nAMAZING CUSTOMER SERVICE! THANK YOU", "pics": null, "resp": {"time": 1627331336741, "text": "Hey Luci! I hope they loved the gift! Anytime you ever need a gift, just let us know your need by date and we will do everything we can to get it to you in time. :-)"}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "108673399059537352765", "name": "Debra Stafford", "time": 1610721654778, "rating": 5.0, "text": "I ordered four of the towel holders for my closet because I wanted something nice for my new farmhouse that not only looks great but is meaningful.\nI saw theses on Facebook, looked at the Holtz Leather Site, and read their story.  We have always tried to support craftsman and small businesses and it is important to do so even more during this pandemic.\nI looked at hooks online but didn’t really see anything I liked and the prices were similar so I opted for something special that I will enjoy looking at and using versus something functional and I’m so glad I did!\nMy order was processed quickly and I received my order in a week or less. The box was packaged well and each towel holder was individually boxed beautifully. I was so impressed! Their pride of their craftsmanship and product is evident.\nI am looking forward to ordering from Holtz Leather in the future.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNlZoYgG2iINi7vApvPJsCE7ZjPBRshiSFoSVGd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOgJ3fvLgdrYUAH5YCvQQtASwi0X-rkry7EqNdp=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "107611897816292524382", "name": "ashlie cser", "time": 1622584948097, "rating": 5.0, "text": "I am a forever customer of Holtz. Each time I order the product and packaging exceeds my expectations. This last time I ordered I needed it by a certain date, their customer service is amazing. I got my order 2 days sooner than I needed it. You don't have to wait a long time for a response, questions answers and solutions are made swiftly. You will not be let down by their products!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "118298752938092469498", "name": "Matt Denure", "time": 1621359232849, "rating": 5.0, "text": "This is my second order from Holtz and I would highly recommend any product.  The quality of the leather, the stitching, and the overall craftsmanship is superb.  The only parallel I could offer would be from professional baseball gloves where you are confident that the product will last a lifetime.  I rarely write and post reviews but I am now a loyal customer who genuinely feel that others will benefit from the quality and customer service at Holtz.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "100176080180447512916", "name": "Cory Schroeder", "time": 1599597275928, "rating": 5.0, "text": "What a fantastic company!  My guitar holders were even better in person...shipping was timely, and my order showed up exactly as described on their website.  I'll definitely be buying more from them in the future!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNoMAZ0s-mVZfQVnSVdhKVX_Zna01lnGq9LtAUk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMkIKRj2ht7vNQua4-a_6W6exbV_zNgnvzEOS8j=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "108873538751571512568", "name": "Geoff George", "time": 1624546411692, "rating": 5.0, "text": "I bought 4 of the wine barrel towel hooks.  All I can say is WOW!!!  From the packaging they came in to the HIGH quality of the materials I can't believe how nice they are.  If you are looking for hooks with a rustic flair these are definitely the ones you want!!!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "109267379827291791818", "name": "Ken Berry", "time": 1627074584870, "rating": 5.0, "text": "I got my wallet in about a week with my name on it. It seems like a very quality leather wallet. I needed a wallet so bad and this is just what I was looking for!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "110627063060221610017", "name": "Joyce Ely", "time": 1600195417732, "rating": 5.0, "text": "I ordered two of the name slats to give as gifts one to my husband and one to my brother.\nThey both were over the moon when they opened the box. The smell of the wood of course they loved as men do! The craftsmanship is impeccable.\nThey are a perfect gift for anyone for anywhere-business or home!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOeB7mpGhpByQNB2ZGmtnGgk0dcm_YBFlaDBZs8=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "101803536912783560706", "name": "Susan Bain", "time": 1616085651032, "rating": 5.0, "text": "I can't brag enough about this company and the quality of their products. But, what's makes them so awesome is their customer service. I received a Christmas gift from my employer, a hand-turned wood pen and leather sleeve. My puppy helped himself to the leather sleeve! It was ruined and I was devasted. I reached out to their customer service and asked if I could just purchase the sleeve and explained what happened. After verifying some details, they found the item I was asking about. Holtz Leather sent me a new leather pen sleeve at no charge! I offered to pay again, but they said not needed. I saw the owner tell their story in 2019. I was moved by his testimony . I commend them on how they continue to grow their company with quality products and exceptional customer experiences. Customer for life!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "108001383106009159931", "name": "Jaclyn Mast", "time": 1615912723850, "rating": 5.0, "text": "WONDERFUL experience!! I cannot say enough about this company- between the exceptional customer service and beautiful, top quality product... the items purchased will be forever loved! I will definitely order from Holtz again and tell all my friends and family to visit the website!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "111394833531780246610", "name": "Kay Kujawa", "time": 1622594796722, "rating": 5.0, "text": "I purchased The Doolittle. The leather and craftsmanship is fantastic. You can’t go wrong purchasing any product from Holtz Leather Co. They are 10 stars in my book.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "113825095854927279102", "name": "donald hearn", "time": 1618859017650, "rating": 5.0, "text": "Very pleased with ordering a leather and wood flyswatter from these folks..\nWhen I contacted them for a tracking number I received it immediately..\nThe flyswatter is well made and just as advertised..trouble is, that when the flys see this heavy duty swatter, they fly away and don’t give me a chance to use it...", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "107065845760515922718", "name": "Deanna Brown", "time": 1616776969029, "rating": 5.0, "text": "I ordered a wallet for my husband . When I placed the order I had forgotten to add something and so I contacted customer service and they were very quickly to respond and took care of me right away.  When I received the wallet I was blown away by the beauty and wonderful craftsmanship.  I will definitely be buying from Holtz Leather again and will recommend to all !", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "101550199590084802741", "name": "Douglas Phillips", "time": 1608225245820, "rating": 2.0, "text": "Ordered a personalized guitar strap and the leather itself is nice but the personalized name is smaller than their logo and about the size of my thumb.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPhQ8SzJpYFISJ_Phx8sg0W7GfWxdIaCraXAXS4=w150-h150-k-no-p"]}], "resp": {"time": 1608324280942, "text": "Hey Douglas,\n\nI'm sorry for any frustration! Our team should have reached out to you for some further information. We care deeply about our product, but we also care about leaving customers with a positive experience. Be looking for a message from our Customer Care team, and we will see what we can do."}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "102315485880682485248", "name": "Beatrice Moore", "time": 1604021968180, "rating": 5.0, "text": "Bought a phone case the plum. LOVE IT! It is definitely so versatile with the wristlet, to set it up to listen to music or hold in my hand and the pocket for a card. Love it many compliments!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMdVuyiS--R2I4iJ94ANTywR0U6Xwvtfs1rDaxe=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO89SGWk5tPn5H_Qo2aiB8upm4ES-bkmWds1D0b=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "113802350558167721058", "name": "Greg Smith", "time": 1602787624720, "rating": 5.0, "text": "Really love my new whiskey-barrel stave guitar holder from Holtz Leather Co.  Uncluttered the space from floor stands, and looks great.  Came quickly after order.  Very pleased.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMJNCUVmLiwOFO11lE9ggcTNfsYfV52-JB_z5qp=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "103820876190998051358", "name": "Daniel Sauls", "time": 1615984982159, "rating": 5.0, "text": "I’ve purchased a few pieces from Holtz Leather for gifts, as well as for myself. Everyone I’ve given something to absolutely loves it. Fantastic products and customer service is outstanding. Haley and the team went above and way beyond and I really appreciate all of their help!!  Looking forward to my next purchases!!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "104727016464036122843", "name": "Tina Robinson", "time": 1617651248500, "rating": 5.0, "text": "The smile on his face said it all! This girl, with the help from my new friends at Holtz, nailed the perfect gift. Thank you Holtz team for your help with the best girlfriend every prize.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "106927928468956901711", "name": "Mary Randolph", "time": 1606622898315, "rating": 5.0, "text": "I can’t say enough about their customer service. There was a problem with the blue leather phone case and after 3 returns and replacements, we had a winner. Their customer service is like no other. They responded to my emails the same day or the next day. Their staff was extremely professional and helpful. I can’t say enough about this company. We love their products and their morals. We will definitely be return customers. Thank you Holtz!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "100610968897760692166", "name": "Ethan T", "time": 1567169266536, "rating": 5.0, "text": "A friend and I started a podcast together and one of the things we care about is not just the companies product but the people behind. So when we came across Holtz Leather Co. they checked all of our boxes. Family business ✓ American Made ✓ Great Values ✓ Tradition ✓. Now the last thing we needed was to see great customer service and great products. Well... they delivered!!! Highly Recommend working with them.\n\nDusty & Ethan from Venator Chronicles Podcast", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMFXgO8jP0UHoAq7712Fin_TC2Y0dPIBusepHt5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNY67iGeXRe8fuV-31y15EDQK3rGkTzq3_veBV1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPQHTSBJH74Rze6bwjsIu4oC1tRjsikFg4fMvyb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOfSvFiKqktemwALrZq4v2NOpcVKCW9IfOiCgFu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMrs6utjNKgNgEr2Y13u9cHlFh0gCTDEhww7JJl=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "102256970399383115575", "name": "Angelina MacDonald", "time": 1627076059786, "rating": 5.0, "text": "Came out awesome and definitely worth the wait!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNcp8m5vAtqlcZfENU4TFonU2v5tgOAZPJ6nm4Z=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOznD9FCsk7mfv3HUNOPR4glL_jUfVwC6VQut2k=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "100637882076978989131", "name": "Thomas Turino", "time": 1626582276455, "rating": 5.0, "text": "WOW!!!!!!!!! i love my new wallet. thank you and i just ordered another one just because of the quality of your product's.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "112873010867654737990", "name": "Matthew Butler", "time": 1534617288766, "rating": 5.0, "text": "Ordered five of their 'Surveyor Fine Leather Pocket Journal Covers for Field Notes.' Four as gifts and one for myself. First, the shipping and packaging was both very quick and well done, respectively. Furthermore, the presentation is top notch, especially if you're considering these as gifts (see attached photos). The box, insert, drawstring bag, etc. convey a very nice, high-quality touch. The leather also smells fantastic!\n\nI bought both black and brown covers, and both look very good. The black is more business and professional looking, while the brown has classic, rustic look.\n\nI highly recommend this family-owned company. Thanks again!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOFeNTHXR7YAhq9sTkjk7QUVaP7WSjbTniIeudG=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNYfuBNoQgBSNmJJRKQ9hdaM4bUdddENy2ED44H=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "106279464314330812819", "name": "T V", "time": 1603712747035, "rating": 5.0, "text": "I have bought a few gifts from Holtz Leather and I am always very impressed with the craftsmanship and quality.  I love browsing through their products and wish I could buy them all!  My orders came quickly and the customer service is excellent. Very friendly group! I definitely will be purchasing more items down the road! Thank you Holtz family!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "101304377509999317807", "name": "Gibbs Pools", "time": 1587577567877, "rating": 5.0, "text": "We LOVE their custom logo hats! And so does every single person we give one to. This is a hat with your businesses logo that you can guarantee the person you give it to will wear regularly.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOo0JjdfkN9eZVqc8vT7Izk_YYP0xVuEr4qiH0b=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "109840737016719385926", "name": "Shehnaz Moosa", "time": 1605475399833, "rating": 5.0, "text": "The final belt we received was gorgeous - beautiful leather, high quality craftsmanship and superior attention to detail. The customer service provided was excellent and I would not hesitate to purchase from them again. Thank you so much! My husband loved it.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "116112655361939781548", "name": "Steph", "time": 1584894665676, "rating": 5.0, "text": "I recently received the magnetic knife rack, engraved, way sooner than expected, to gift to my guy, who has extra knives that don't go in our woodblock from his time working as a butcher.  It's beautiful, and he immediately hung it!\n\nTwo of my coworkers asked about it and are planning to order soon after seeing mine- thank you for such a perfect gift!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNO1sVV-GnO14AGA4PIx_fua1C9dnxJIzzk_F7v=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "102890813703324448437", "name": "Kimberly Johnson", "time": 1599591537385, "rating": 5.0, "text": "I loved the quality of the product I purchased, however, I returned it because it didn't work for my needs like I had anticipated.  As for the return, they were soooooo kind and very accepting of the return.  Kindess today is hard to find!  Upon returning, they told me they would credit my account, and when I couldn't find where I received the credit, I contacted them again.  Again, they were quick to respond and very kind again.  And, yes, they had refunded my account, but the credit card company was the slow one in posting it.  I would give this company 5+ stars due to their kind and helpful responses.  Their products are quality, and I hope their business is a huge success!  So, if you're questioning whether you should order from them, you definitely should!  You won't be disappointed!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "107973559094143239422", "name": "Jennifer Webb", "time": 1606313595997, "rating": 5.0, "text": "I got on Holtz Leather website to order a belt. I had questions regarding delivery because I needed it sooner . So I called, to my surprise the lady that answered the phone was so sweet. See I wanted to buy this belt with engraving for my husband so that he could wear to our son's funeral. I called on a Tuesday and I received it by Thursday. The lady that answered the phone went over and beyond for me. I was so surprised by this and gave me a little hope again for humanity. I wished I remember her name but things were such a blur. If you can pass this along to her \" she is an amazing person and she has such a good soul\". You have a true GEM working for you!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "106670943147294880525", "name": "Jillian Norris", "time": 1603378090882, "rating": 5.0, "text": "My husband and I have ordered many things from Holtz. From home decor to leather goods and all have been absolutely amazing. Their customer service is outstanding. They have become my go to shopping for gifts! I highly recommend Holtz Leather!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "106508746404938013447", "name": "Patch Foster", "time": 1602602760161, "rating": 5.0, "text": "The coat hooks that we ordered from Holtz are wonderful.  Great quality, reasonable pricing and awesome customer service!  Look forward to ordering more products from this family owned and run company.  Great job Holtz!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "108096393478649993938", "name": "shannon mcferren", "time": 1608598091312, "rating": 5.0, "text": "Amazing customer service!  Fast shipping. Over all great customer service. I have several pieces from Holtz and will continue to buy from them!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "104929165917669105882", "name": "Dulce Casanova", "time": 1592268684702, "rating": 5.0, "text": "Ordered a wallet for my son and it's beautiful!! Great craftsmanship and love the simple packaging,  will definitely order from them again!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOaakid3F9pb2WllCwFmjlef_IM0NykRrP7y4zt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipON_MaO6Lak_NYNiUagQ4nTDex9YjaU_0jyJW-b=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "103902006365579107727", "name": "Vicki Black", "time": 1583437481585, "rating": 5.0, "text": "Purchased the leather handle for my 30oz Yeti with my name.  Great packaging, price, quality, and fast shipping. The quality of this item is WAY better than I expected.  Love it!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO-dq2kuAsTMHI0QbUA_eOh0HLTDWgsg-wzL1qG=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPVyngdwAitBhWtXS5Jdun05BQQvKL8k_oLzMHy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipORPXzdU-edOf8GXYzztrrA5Ed-pehpiNytysPj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNWOxCGEfoBNEmWr67GLW8FL8bblOj7QuNQx_QH=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "108764904472328810424", "name": "Brian L", "time": 1591142541106, "rating": 5.0, "text": "I ordered the Dapper Jack personalized fine leather pipe roll tobacco pouch. With any higher quality product made to order, things take time and yet it still arrived in a very reasonable amount of time in my opinion. The item is top notch and the bee's knees. There was an ordering option to personalize an area of the leather with some lettering and I added that as well. It was done professionally and precise and was shipped in packaging that showed care. The attention to detail is paramount for me. I would certainly buy from them again and I recommend them.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "102714188247874104691", "name": "Caryn Hardy", "time": 1557105969866, "rating": 5.0, "text": "Thank you, Holtz Leather!!  I can’t tell you all how much I appreciate your company bending over backwards to get me a custom hat for Big Rob’s 50th!!\nThe hat and monogrammed wallet were top notch and the craftsman ship was impeccable. The packaging had an awesome feel of quality and heritage.  It was such a fun gift to give and he wore it proudly!\nYou gals and guys are a class act!  I’m telling ALL my friends about you and will proudly shop your products in the future.\nSincerely - A very happy customer!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPDv-lFw4D2mVdrtaIxhn4BxlIpHnBhhDpRfmla=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "117033398043238132951", "name": "Shay Sheppard", "time": 1588812312504, "rating": 2.0, "text": "Got the Babe Ruth collection wallet. Certainly not vintage nor what I expected. The outside pocket with the Wilson emblem is sticky on the inside, frayed, and left gummy glue on my card. Disappointed in the quality for the price.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMBfcWfg8eAPUAhC-TeNJ0WJFx8dtfVkduN--cQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMwjmm9I7FqoINuYmEl4mBnKoVA8IyFbGUKTIWN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMNuBXBtuDvZPkoWkwmdBx7F-qLnsAv03nJZFS0=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "110696531344335022535", "name": "Raymond Lopinski II", "time": 1601868580946, "rating": 5.0, "text": "I’m overwhelmed. The quality of my “Marine logo” notebook far exceeded my expectations! What a great product. Surprisingly, even with customization it only took a week to get it. I will definitely be looking at Holtz again when I start looking for Christmas gifts.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "105189975483794678715", "name": "Devon", "time": 1603490996935, "rating": 5.0, "text": "Smells so good inside.  And so many beautiful hand-crafted items.  Love it and the family that owns it.  Beautiful inside and out!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "117994021709440350130", "name": "J Huntington", "time": 1593967797973, "rating": 5.0, "text": "I placed an order for the whiskey stave sign as a gift for my husband.  The wording was a bit more than what was shown on the site’s photos, so I reached out to customer service to be sure that it would fit.  They responded quickly to assure me that it would but that the words would be smaller than what I was viewing in their photos.  I asked them to proceed with the project and couldn’t have been happier with the result.  It did take about two weeks for my order to arrive to Vermont from the time I placed the order.  As it should be with something that is being custom crafted and shipped several hundred miles away.    My husband was also thrilled with his gift.  Will definitely purchase with them again.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "109768345298793613395", "name": "Audrey Egland", "time": 1598317641308, "rating": 5.0, "text": "Thank you for the amazing Whiskey Barrel Sign!  It is just perfect.  The quality is amazing and you even rushed it and got it to be in time for my anniversary!  I appreciate it and will definitely be recommending your company to others!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "115288131719438077304", "name": "Gabriel Cranston", "time": 1589563302331, "rating": 5.0, "text": "My wife ordered me a belt from Holtz about 5 years ago. It had a custom message written on the inside. I wear it almost every day and it still is in excellent condition. High quality leather.\n\nMother's Day 2020 -  I ordered the Logbook with my wife's logo on it. It turned out perfect. Crystal clear logo, great looking with every detail correct. The leather is of course excellent quality. I only had 1 tiny complaint. The notebook that was on the inside was incorrect (they have a few different options). I called their number listed on their website for customer service - It was a real human being, but with an accent - don't be alarmed! It was a southern belle type! They apologized, and sent a replacement notebook right away no questions asked. Needless to say, I am VERY pleased with this company! They are awesome, their service is outstanding, and their products speak for themselves! Thanks, Holtz!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "117664302080991649020", "name": "Jane Pagano", "time": 1559851963865, "rating": 5.0, "text": "Called and spoke directly with owner because time was of essence for delivery of my gift. The vanderbilt portfolio was not only ahead of scheduled delivery, but beautifully presented in a lovely bag and box. The engraving was embossed just as requested. I always prefer to support\nsmall businesses and Holtz Leather is a Keeper for sure. Thank you so much!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPCoar7J6x-hRP3BgF2Mq_Us947Q0ksyTxaAegq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNPbHO_JRPt416_RpGswoB88PR44i3q0__kyr9j=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "111355406418050351925", "name": "Elise Swackhamer", "time": 1601667777338, "rating": 5.0, "text": "We ordered custom hats for my work and Holtz Leather Co. was awesome to work with! We received our hats quickly and had great customer service thru it all. The hats turned out better than expected! We will definitely be purchasing again from Holtz!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "107725097211544321950", "name": "Carlton Burleson", "time": 1586315586052, "rating": 5.0, "text": "So far I have purchased a whisky barrel name plate for my office and these custom leather coasters.  The quality is awesome and the packaging is 1st class!  I can’t describe how pleased I am.  How I’ve never heard of them until now, I have no idea.  I have referred so many friends, because these things turn into conversation pieces. Great quality, nice people, perfect service.  Awesome company!\n-Montgomery, Texas", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMhasuaadKQKcOLwOISdF4Torq3oAvmLoBpk-Zd=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "101784653791048323455", "name": "Alexa Johnson", "time": 1604154144471, "rating": 5.0, "text": "The magnetic knife bars are beautiful.  I have purchased my 4th one for gifts and everyone loves them.  They hold the knives very well.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "109282328027806548841", "name": "R Sheffield", "time": 1609091236017, "rating": 5.0, "text": "I was given a Marine Corps wallet as  a gift for Christmas, the workmanship is wonderful, I couldn't be happier!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "109794133545754105650", "name": "Big Dizzle", "time": 1591494989885, "rating": 4.0, "text": "I have 10 belts in my closet that are size 36. They fit great. I’ve been a size 36 for 25 years. I haven’t gained any weight. I ordered a size 36, it took 2 weeks to get here, and i can’t even fasten it to the first hole. I wrote them an email about it. They sent me a link to a video so I could properly size myself, which apparently is different than any other store or manufacturer that I’ve bought my other 10 belts that fit great. They gave me the return address, no shipping label, nothing. I’m sure this is a competitive business. I haven’t seen anything that sets this company apart in any way. So, no thanks. I’ll go to Belk, spend half as much, and get a product the same day that’s better.\n\nUPDATE: They sent me a return label. Which I greatly appreciate. Makes things a lot easier.", "pics": null, "resp": {"time": 1591738538893, "text": "Hey Big,\nThank you for your feedback. We want every customer to have a great experience working with us. I am sorry we fell short of that. Our belts are sized to custom fit body size. Standard pant sizes do not match actual waist dimensions. We hoped the sizing video would be helpful. Even hearing just 1 bad customer experience is too many. We are looking into our belt sizing method and will hopefully make it less confusing. Thank you again for your feedback. I hope you will consider giving us another chance to wow you in the future.\n\nThanks!\nThe Holtz Family"}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "112195725603833845377", "name": "Kristen K", "time": 1589047535715, "rating": 5.0, "text": "Purchased a personalized barrel stave. It is absolutely beautiful. The time and effort that was put into this piece is very obvious. Thank you so much for this item. It will be a perfect father's day gift! Will definitely shop here again!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "111503166380336223356", "name": "steinmbr steinmbr", "time": 1594229904601, "rating": 5.0, "text": "What a great company!!!! I ordered a leather can koozie with custom embossed initials 2 days ago and received it today. I was STUNNED by not only the quality and craftsmanship, but also the lightening speed in which I received my order. The packaging was beautiful and the card inside was very cool as well. In a world where most companies cut costs and care about nothing but profits, its refreshing to see that there are a few people who still get it right!!!!!! This is why  WE ALL SHOULD SUPPORT SMALL BUSINESS. I will definitely shop with Holtz Leather Company again in the future. I couldn't be more impressed. I highly recommend looking at their website and all of the neat and creative and UNIQUE items that they offer MADE IN THE USA!!!!!\n\nThank you Holtz  Leather Co.\nSincerely,\nBrandon", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "114654728835961497028", "name": "Jim Skibbits", "time": 1602000211802, "rating": 5.0, "text": "From the moment I saw their ad in a magazine while waiting in a lobby and reached out immediately on my phone, all the way through to my purchase, nothing but a class act.  The customer service via email was fast, very responsive, and informative.  The products are crafted with top notch, high quality leather!  They engraved beautifully!  Cost is on point!\n\nI suggest the pen sleeves, I have fragile fountain pens and this protects them and still fits nicely in my pocket.  (Pics attached)\n\nThis is one of those companies you  find and you want to support their success because they are doing things right, and you just know you will want to do business with them for a long time whether it is for yourself or others.  You can trust they will impress!\n\nThank you Holtz Leather, until my next purchase! :)", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNV5aaNTZABeJb-s4C5P2WC-_m_T8fKllDzKijD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP9CgKHggdW5NNpxvwV6LKDoQwM_iceDtSaopVk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "113474203222986149427", "name": "Hon Ester", "time": 1608234510964, "rating": 1.0, "text": "Mass produced leather products. 1/3 the price at 1/2 the quality of the other guys. Looks similar to Col. Littleton products. Nothing to write home about.", "pics": null, "resp": {"time": 1608324061127, "text": "Hey Hon! Thanks for taking the time to share your thoughts with us. While we do push a large volume of product out the door, these items are carefully handcrafted with top quality leathers. I would love to look into any specific complaint you may have! Feel free to reach us at customercare@holtzleather.com, or call at 256-883-1111 - we'd love to review your thoughts as a team and see how we could better meet your needs."}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "117521975689986184563", "name": "DJ Desautels", "time": 1566318793363, "rating": 5.0, "text": "Ordered a custom leather patch hat and was blown away at the customer service, the quick responses for getting the details perfect, and just the overall construction of the hat. My business logo came out perfect and I highly highly recommend ordering yours today!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNiHbMtQzwrqbbYZ3TlS8UFQq2gWb1s3jfvxkNb=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "113112166745500652139", "name": "Michael Blaszczyk", "time": 1591902446198, "rating": 5.0, "text": "I had the pleasure of working with Sherry, a corporate accounts manager. My company was up against a tight turnaround to get their leather padfolios as gifts for a couple of our employees. Sherry was very responsive, understanding and accommodating to get it done. Now I understand they can't work magic and assist every single person immediately, but regardless if we got our order by our deadline or not, I appreciated their effort to work urgently. Great customers service!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "111808418956712125875", "name": "Leo Mayrinck", "time": 1617653234370, "rating": 3.0, "text": "For the hat i Give 5stars but for the customer service i give 2 or 1 star, very bad service, take forever to respond, take forever to get back with prove, shipping is long too, i order one to see the quality and service to order more but now i am not sure if I will", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "108557607178721576442", "name": "Kyle Brown", "time": 1595694924616, "rating": 5.0, "text": "Awesome folks. My wife and I both bought our wallets there. Great leather products. I use their inventor leather book everyday for work tasks. Must stop by and visit!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "109810164757516402755", "name": "Lizzy R", "time": 1564931869803, "rating": 5.0, "text": "I really liked the quality of their work.  Can’t wait to order more. The staff was really friendly and prompt to respond to my emails. Thank you Holtz!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMCxoc6T7I-cnMSTQYf-Ub0CLxQpVCuzqBuQ46i=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "100416829293296479902", "name": "Dawn McNair", "time": 1592924857368, "rating": 5.0, "text": "I ordered the customized cuff links and tie bar for my husband for Father's Day.  I was a little worried about the arrival time with all of the COVID stuff.  Not only did the gift arrive earlier than expected, it came in a nice gift box.  My husband absolutely loved his gift.  Thank you for the beautiful craftsmanship and the very reasonable price.  I look forward to ordering from you in the future.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "103843394347328455461", "name": "Lynn Raab", "time": 1600270836684, "rating": 5.0, "text": "Absolutely wonderful in all regards - from the exceptionally friendly and responsive customer service to the remarkably beautiful and unique products (I ordered both a personalized barrel head and stave). I will definitely be ordering from them again and encouraging my friends and family to do the same!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "104012246486362516273", "name": "Lisa Gosser", "time": 1575654304663, "rating": 5.0, "text": "Absolutely the best!  Ordered the new Personalized Whiskey Barrel Stave Family Name  for Christmas present and LOVED it!  Have ordered the personalized wallet, key chain and belts for gifts as well.  HAVE NOT been disappointed.  Outstanding, high quality products that have not let me down.  Highly recommend!  Will order again.  GREAT products, great customer service.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "110440843409032062743", "name": "Sarah Ivy", "time": 1588274850640, "rating": 5.0, "text": "I ordered a leather coozie for a gift for my boyfriend. It got delivered so quick. I even had his monogram engraved and it got to me within a week. I was very pleased with the quality and how good the leather smells. I know this will not be the last time I purchase from this company. I highly recommend this company if you are debating on anything! Worth every penny that was spent!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "118298827900715296881", "name": "Elle Edwards", "time": 1574228177501, "rating": 5.0, "text": "Amazing customer service! I had a last minute gift idea to get a belt with engraved message for my husband. Prior to ordering, I checked with customer service to see if it could be delivered in time for our anniversary. Their response was prompt & shipping even quicker! They were so helpful & accommodating, not to mention the belt was beautifully made & great quality. Thanks so much! My husband loved it.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "117873796972328659076", "name": "April Bodrie", "time": 1604359830788, "rating": 5.0, "text": "So professional!! My son in law loved his hat!! Fast Shipment, fantastic customer service!! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "115147863979834798190", "name": "Matthew Smith", "time": 1599767207276, "rating": 5.0, "text": "My new favorite mug! Really hope The Well and other local coffee shops use you in the future for their mugs so I can keep growing my collection of local coffee shops while also supporting you guys!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "111474995945609987853", "name": "Adam Waite", "time": 1584800822068, "rating": 5.0, "text": "I have multiple items from Holtz! I use my pocket notebook all the time and suggest it to anyone that will listen! My favorite is the wallet my kids got me last year for my birthday. I am a huge baseball fan (won't say who I root for to a kid ire) the \" kids\" ordered me the vintage baseball money clip wallet and have named it \"ball-et\" it is easily the best wallet I have ever owned and the heirloom quality will ensure it will be in my pocket years! If you are tired of replacing your wallet every year or two and want to carry a quality product with character but a Holtz product... And can a suggest the vintage baseball money clip wallet while I'm at it.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "101250018289638752672", "name": "Nick Thielmann", "time": 1581389749748, "rating": 5.0, "text": "Exceeded our expectations! We purchased wallets and a journal for our wedding party and we could not be happier with the quality, care and value.  Holtz clearly takes pride in what they make and we recommend them with full confidence. Truly handmade, as good looking as they are functional and tough. Exactly what you’d expect, but rarely find.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "104449230980503385139", "name": "Maria Murphy", "time": 1577924682727, "rating": 5.0, "text": "PERSONALIZED TENNESSEE WHISKEY BARREL MAGNETIC KNIFE BLOCK RACK - WHITE WASHED\nPictured as holding Damascus set. It’s beautifully made and better than I expected. This is a strong magnetic rack as these knives are very heavy. Customer service was responsive with any questions I had about my order and it came well packaged for gift giving. Its a very nice personal gift.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "111448564920723156611", "name": "Pam Hults", "time": 1611232514858, "rating": 5.0, "text": "Best customer service!! Great product!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "102284633692107233377", "name": "RUTH KACHATORIAN", "time": 1597954735965, "rating": 5.0, "text": "Ordered the Personalized Hand-Turned Rose Wood Fountain Pen on a Monday, and it arrived on a Thursday. Fast shipping and a great product!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "117238364972082316784", "name": "Jim Brocato", "time": 1597861240200, "rating": 5.0, "text": "I just completed and order with Holtz Leather.  All I can say is, if there products are anything like their customer service team (special shout out to Claudia, she is amazing) then I am confident we will be extremely pleased with the items we ordered.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "117336346039984957471", "name": "Alexia Gonzalez", "time": 1573598033008, "rating": 5.0, "text": "First time ordering from this Company and I must say AMAZING CUSTOMER SERVICE! I'm already looking into what else to get off their site. Nevertheless, I didn't wait long to receive my product and they were helpful regarding changes that I wanted to my order. If you are looking for that unique perfect gift you've found the right place :)", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "112534999304407898524", "name": "Wade Foster", "time": 1579053527039, "rating": 5.0, "text": "After 3 years of searching, I’ve finally found a perfect wallet! I’m beyond pleased with every aspect of this wallet. It’s a front pocket folder. A+ quality and it was at my front door in 4 days. Great customer service. Thank You!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "110687816474684493556", "name": "Liza Parkinson", "time": 1599792514979, "rating": 1.0, "text": "If you are not satisfied with the something you purchased, good luck getting a refund. The phone case I purchased was horrible and cheap and bad quality and I was unable to easily get a refund. I’m still fighting with them. I do not recommend this company at all.", "pics": null, "resp": {"time": 1600447526911, "text": "Hey Liza,\n\nI'm sorry that your phone case didn't work out for you. I've looked into your order and it looks like we responded to your email with a return label on 9/11. As soon as we receive the case back we will be happy to issue you a full refund.\n\nSincerely,\nThe Holtz Team"}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "103149048124824313548", "name": "Yvette Dunn Perry", "time": 1593458901712, "rating": 5.0, "text": "I recently purchased the Double Bookmarks and the Fine Leather Sleeve Case as high school graduation gifts. While I have not yet given them to the graduates, I am most pleased with the quality of the leather, craftsmanship, and the personalization. The Customer Service is ideal! I will be a repeat customer.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "104565425971574210047", "name": "IWANNABEFRANKWITH YOU", "time": 1539565733147, "rating": 5.0, "text": "Excellent customer service, speedy turnaround, exceeding expectations....no it’s not an experience I had with a local merchant back in 1953, it’s the mind-blowing experience I had with a shop 1,000 miles away that I’ve never even seen with my own two eyes! Holtz Leather Co. definitely has my respect and future business!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPQ9RCvLBUiWjyUkkkOOBH8XZNfkJMcGnnC6fXd=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "105813040113326542218", "name": "T Wisk", "time": 1579795134320, "rating": 5.0, "text": "I received my leather Passport holder today and I love it.  The exceptional quality is top of the line. Stitching is absolutely perfect. You should be proud of your products. I purchased a 2nd one for a friend as a gift and he is going to love it.   Easy online ordering to customize and shipping was fast. Thank you", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "114884158057909032333", "name": "CHRISTA DEVILLE", "time": 1578414364587, "rating": 5.0, "text": "Super great handle for my Yeti.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOTrb__0ne6_6GK5z-51wil077ycuZ5wJj1iIBL=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "108261731592910455842", "name": "Julie Stinnett", "time": 1588384097679, "rating": 5.0, "text": "I purchased fabric facial mask from 3 other fairly local businesses during this COVID-19 pandemic about 6 weeks ago and have yet to receive them. Still wanting to support a local business I saw an ad for Holtz Leather providing mask with a turn around time of 3-5 business days.  Sounded almost too good to be true but I place my order.  Holtz Leather you came through like Rock Stars!  Not only did my order ship as stated they were received just a few days after.  VERY well made!  You have my business always.  Thank You for helping your community and for being a stand up business!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "111354483782738703297", "name": "Mark Matthews", "time": 1578755402888, "rating": 5.0, "text": "For Christmas 2019, we purchased several things for family. The experience in the store was great and staff wonderful! The had our items monogrammed in just a few minutes and everyone we gave the gifts too loved them. We will be shopping there more!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "100635780980786918411", "name": "Marilyn Miraya", "time": 1577843844248, "rating": 5.0, "text": "Beautiful camera strap and glasses case. My husband loves leather he was excited when he opened this beautiful Christmas gift.  Great products excellent quality.  Thank you Holtz Family for your great service. Happy New Year!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "111777770277074566202", "name": "John Stewart", "time": 1578340355994, "rating": 5.0, "text": "This is one of the best small business I have worked with for promotional items. The staff is super helpful and goes out of their way to make sure you get exactly what you are looking for. I can’t recommend then enough for high quality gear that looks great and made with care.\n\nCaptain J. Stewart.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "112982096889874127801", "name": "Amanda Cole", "time": 1594893783332, "rating": 1.0, "text": "Super Disappointed with my hat!!! After viewing the proof I was so excited to get my hat in mail and was ready to order a ton more. Hat came in mail only to look NOTHING like proof did. Very misleading. Proof should have been exactly what was going to be sent.. Unfortunately Will not be recommending this company.", "pics": null, "resp": {"time": 1595445392027, "text": "Hey Amanda,\n\nI am sad to hear you were disappointed with your hats. The proof you received before production of your order should have been an accurate representation of what your patch would look like. We have reached out to you directly and I hope you will respond to us. We take our customer experience very seriously. When we miss the mark we want to make it right.\n\nSincerely,\nThe Holtz Family"}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "108259545357771046501", "name": "Jonathan & Cecelia Stone", "time": 1572475179120, "rating": 5.0, "text": "Received my Gates bill fold & love it!! The leather & craftsmanship is beautiful. Also as a sales rep I can tell you your packaging is an A + and the card, a classy touch! Love it - keep up the good work and you have won a new leather goods customer. Continued success and all the best,\nJonathan Stone", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "114210513784593736080", "name": "Alyssa Earley", "time": 1576343552224, "rating": 5.0, "text": "LOVE LOVE LOVE!!! Everything they make is just absolutely stunning and made to last. I bought my dad gifts from them for every holiday for the past two years and we both have yet to be disappointed. I can even say my gift for him this Christmas is on it's way to my house earlier than expected for the Christmas rush and I am so excited. I will be forever a Holtz Leather Co. customer.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "118362697771465930180", "name": "Jason Cooper", "time": 1585060337370, "rating": 5.0, "text": "Absolutely love my hat!!!!  Holtz Leather is amazing company to work with.  They were extremely helpful and excellent communicators.  Product showed up earlier than expected.  Cannot wait to work with them again.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "105028679453834414371", "name": "Ann Humphrey", "time": 1567605151077, "rating": 5.0, "text": "This was my first belt purchase from Holtz & it exceeded my expectations.\nSuperb quality leather & findings, great color, fit & workmanship.\nI’m sure the belt will last longer than I will.\n\nIn addition, the Company communicated every step of the way &\ndelivery time was super quick.\n\nOverall a most satisfying experience. Thanks!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "116290252127594057203", "name": "TJ Chambless", "time": 1591742595663, "rating": 5.0, "text": "I just received my Gates wallet. It is excellent quality! I also love supporting a family owned, American company!", "pics": null, "resp": {"time": 1591748522009, "text": "Hey TJ,\n\nThank you for your business and kind review! We are so glad you love your new wallet!\n\nSincerely,\nThe Holtz Family"}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "100798929140247473795", "name": "Darrell Pasley", "time": 1577145681460, "rating": 5.0, "text": "Excellent product and perfect in every way.  My son loves his Marine Gates wallet.  Thanks so much for the fast shipping.  Great to know your company still cares about the customer.\nDarrell Pasley\nRocky Face Ga", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "111037910124005168106", "name": "Julie Kincaid", "time": 1570544783144, "rating": 5.0, "text": "Great customer service!  High quality product!  Packaging was even impressive- I loved the linen bag the hats were in.  :)  My guys were more than satisfied with their hats and they are picky about their hats.  Thanks so much for the outstanding product and great online shopping experience!  I'll be back!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "103219513544746781518", "name": "Yana Shapiro", "time": 1581103382210, "rating": 5.0, "text": "I only wish I took photos of the product to attach with this review but take my word for it YOU WILL BE BEYOND SATISFIED!!! The quality of the product is amazing and the customer service is just as great! I ordered a personalized wallet and personalized cufflinks for my friend and his son. The engravings came out perfect and Holtz were able to use the sons old baseball glove which made the gift that much more sentimental. I am really thankful to the guys at Holtz for their wonderful service starting with taking the order, shipping the box for the old glove and then making sure they did their best to use the glove and personalize all items. They were prompt to respond to any of my questions and shipped it timely for my friend to get the gift for his son’s bar mitzvah! My friend and his son are beyond thrilled at the matching cufflinks and love how  original this gift is. The quality of the wallet is great and again, they were able to use the old glove inside of the wallet. I highly recommend this company and any of their products for yourself and certainly for any gift giving!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "101946135179086517925", "name": "Terri Prickett", "time": 1560629745886, "rating": 5.0, "text": "I saw these beautiful wallets made out of old baseball mitts (the Great Bambino) and thought my son would like one to replace his recently lost wallet. I figured it would make a fantastic Christmas gift (I like to shop early so I can pick out  just the right gift!). I received it in the mail yesterday and was so excited to give it to him I couldn't wait for Christmas. He loved it. The quality and workmanship is fantastic! He is proudly showing it off. We will purchase here again!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "113439760450685936993", "name": "Robert Rice", "time": 1609881756980, "rating": 5.0, "text": "Unbelievable Product!!! Thank you!! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "115257517032912776789", "name": "J K", "time": 1570818722143, "rating": 5.0, "text": "Such an awesome experience! Turn around was way faster than I expected, communication was fantastic, and the product is out of this world. As a fellow small business owner I am super impressed and will be ordering again! Thank you!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "115648510814794414626", "name": "Abigail Medford", "time": 1582051267995, "rating": 5.0, "text": "WOW. I ordered a leather dress belt for my husband for our anniversary. It came in just now, and it is just amazing. Great quality, great packaging, and American made! Perfect gift!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "106662140370584360738", "name": "Jen Con", "time": 1569448244179, "rating": 5.0, "text": "This was my first purchase from Holtz.  Not only did I receive a quality product, I also received customer service that was top notch.  From the assistance designing my product to the delivery of the product well before the anticipated delivery date, the entire experience has been pleasure.  I would highly recommend their products and their team members are excellent.  Thank you, thank you, thank you!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "110652136523060535617", "name": "Jennifer Osborn", "time": 1563551649834, "rating": 5.0, "text": "We have ordered several rounds of hats from Holtz for our business as well as several personal gifts.   We are thoroughly happy with the service and the quality with each and every order. I would highly recommend this company to any looking for a unique gift or quality items for a business.  Well done Holtz!  We loved the blacked out hats.  If you do come out with more colors for the women's hats let us know!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "113334479710105788521", "name": "8z Marketing", "time": 1501783238514, "rating": 5.0, "text": "We ordered a large quantity of hats from Holtz, and they are awesome! High quality and super cool.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOQcdfTDG_rrO_qWb0nJN9lYhy3JP31ISPvfDIA=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "108789307961304155596", "name": "Heather Reuther", "time": 1560782299295, "rating": 5.0, "text": "I have ordered several gifts from Holtz Leather Co. Everything has been great quality! Perfect for a unique personalized gift. I recently ordered a custom hat for my dad for Father’s Day and I needed some help to make it special and so I called and actually talked to the family members. Customer relations at its finest. They will always have my business!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "109938991106642755128", "name": "Jim Linn", "time": 1601644449687, "rating": 5.0, "text": "Outstanding craftsmanship. Beautiful leather journal.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "114308068780442340232", "name": "brenda morton", "time": 1587600449274, "rating": 5.0, "text": "2 Face Masks received today- Excellent Quality- worth the waiit I went to Holtz first to get a quality product!  Just fabulous", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "111989566801916840074", "name": "K M", "time": 1576272910936, "rating": 1.0, "text": "Purchased the “behemoth of bust” wallet for a Christmas present. The one I received is nothing like the advertised item. Dark leather with no name on it like “Mike Piazza” or anything. But they did manage to stamp their logo on the back that takes up half of the exterior side of the wallet. For the price, the leather is decent enough. But again, I was wanting what was advertised and got the complete opposite. I won’t be a repeat customer.", "pics": null, "resp": {"time": 1576862358036, "text": "KM, thanks so much for taking the time to leave your feedback. Every vintage baseball glove is a little different so every wallet is as well, but I understand it is frustrating to get something that is not what you expected. We take pride in our product and our customer service, so if we miss the mark in either we always want to make it right! We would love to get some additional information from you - please email us at customercare@holtzleather.com so we can discuss some options."}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "113141226768301147458", "name": "Vanessa Dean", "time": 1577998165784, "rating": 5.0, "text": "I ordered a belt as a wedding gift for my husband.  I was nervous about ordering it, but Oh My Goodness, this belt is stunning. Thank you all so much for the amazing quality.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "113397469010539798797", "name": "J D", "time": 1573241080603, "rating": 1.0, "text": "When purchasing a custom hat with leather patch, I received one with a huge “holtz leather” logo on the side of it. I didn’t ask for a refund,  it instead emailed several times to see if I could order another custom hat without the additional leather patch on the side. All of my emails were ignored, so I finally called and was rudely informed they were not willing to remove their logo from my custom hat. There are a lot of companies that do custom hats out there and I advice going to someone else with better customer service.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "107331975333739414250", "name": "Wesley Kinslow", "time": 1564170627187, "rating": 5.0, "text": "Fantastic communication and an even better product! I asked if they could get my order in a short time frame and they assured me throughout the process that it would come on time - and they did what they said they'd do!\n\nThe product itself is phenomenal and far exceeds my expectations. The leather is supple and perfectly crafted. I'll be using this lanyard for years to come.\n\nThank you again!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "112864732310263381567", "name": "Krista Wilson", "time": 1569429537199, "rating": 5.0, "text": "Great quality product! Very easy to communicate with and I even received my order earlier than expected. Would highly recommend and will definitely reorder!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "109565511548086465901", "name": "Kenneth Strickland", "time": 1583115317379, "rating": 5.0, "text": "Very helpful get our logo ready. Love our new hats!! Thanks so much!! Looking foreword to ordering again.\nOlivia", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNqnTsX8tJWsn2g1F570Vl4elrKLdiDhQl_fF3q=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "106337985292605342528", "name": "Bailee Paul", "time": 1545495691185, "rating": 5.0, "text": "I ordered a belt for my fiancé for Christmas and I absolutely love it! It came in the mail very fast. I will definitely be ordering some more products from this company! I love their story. May God bless them and their company. They also have the best customer service! Very impressed.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "111860124487319742469", "name": "Pooja Patel", "time": 1524765003044, "rating": 5.0, "text": "Had one of the best customer service experience while ordering a key ring for my boyfriends birthday gift. They were quick to respond to my request and the gift got to him the same day of his birthday and he absolutely loved it. The packaging was great and the quality of the product is wonderful too. Definitely will be ordering more stuff from them for future occasions.  Keep up the good work guys!\n-PP", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "117701545720232882216", "name": "catherine eusebio", "time": 1586391331090, "rating": 5.0, "text": "I purchased the phone case. The function is great and I love the look of this leather. Arrived quickly.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "113528433291214324398", "name": "Anne Bell", "time": 1571675693385, "rating": 5.0, "text": "What a great experience! After reading the story behind Holtz Leather Company, I wanted to do business with them! It’s an American family owned business who puts their trust in God.  Thank you! And, thank you for the fast turn around time from ordered to delivered!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "101620589339508948702", "name": "David Dobbins", "time": 1581702941406, "rating": 5.0, "text": "I was totally pleased with my purchase of a wallet.  The craftsmanship is excellent.  It is a handsome product.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "117944751316222698277", "name": "B L", "time": 1572036954631, "rating": 2.0, "text": "Got the whiskey barrel guitar hangars for my birthday today. They look awesome but the hangers they use on the back are super cheap. One screw came broke off, the other one broke off when i went to remove it to move the hanger bracket over. The hangars are meant for using nails and none of my many wall anchor screw heads will fit inside and Im not hanging my expensive guitars on a nail in drywall. So now i have to try to figure out some other way to hang them up. Not impressed with the cheap hardware.", "pics": null, "resp": {"time": 1574118400961, "text": "We are so sorry for the inconvenience with our guitar hanger! We would love to send you some replacement hardware. If you could reach out to us at customercare@holtzleather.com we will be happy to take care of that for you."}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "109583436207115905372", "name": "Dalina Dominguez", "time": 1572672162770, "rating": 5.0, "text": "I've placed a couple of custom orders and the results have exceeded my expectations. The team is very friendly, helpful and professional. I would highly recommend and will absolutely order some more of their gorgeous products again. Thank you Holtz team!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "118252799817899429824", "name": "Ali Koenig", "time": 1560459360841, "rating": 5.0, "text": "Have ordered now 4 items from this amazing company and have been pleased with everything!! Great for personal and gift ideas. Worked with me on timeframes to secure a gift of happiness! Texas Native but Went to college in Alabama (go gamecocks) so super proud to support!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "104182678040930340489", "name": "Laura Teets", "time": 1546914726020, "rating": 5.0, "text": "The employees and service are outstanding! The Holtz team worked with me to design beautiful, custom Christmas gifts. Great communication, fast order turn around, and exceptionally high quality products. I am extremely happy with Holtz Leather. Be sure to visit the store on Meridian Street in Huntsville; great atmosphere with something for everyone!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "109416115773083330355", "name": "Dominick Luciano", "time": 1553262575475, "rating": 5.0, "text": "The quality of the hats and the price we paid were second to none. The office loved them, and we're ordering more now for promotional items. Customer service is beyond what you'd expect, thankful to have such a unique option for our business. Also they look cute on kids :)", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMgj7-vU22Tp5l4wABs_VECR1ouncYXgZbf0RoD=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "105834371065080080546", "name": "Brian Hughes", "time": 1561044531554, "rating": 5.0, "text": "Ordered the Gates Bi-fold wallet and was thrilled with it. The quality of the leather and workmanship are first class! This is a great company and I will do business with them again!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "103378578271136673645", "name": "Jason Schermerhorn", "time": 1574058709754, "rating": 5.0, "text": "Love the product, love the packaging!  My wife bought me a Marine Corps emblem A4 Moleskine folio from Holtz Leather - it is a beautiful work of art.  Extremely high quality, arrived quickly, and the packaging was also beautiful.  Holtz Leather creates exquisite products.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMfSDZaWoCkiOLg7u-vLCymex1hFLzz_X7W5ogv=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "111810696910968872504", "name": "Aaron Colvin", "time": 1550167257223, "rating": 5.0, "text": "I have ordered multiple items from this company and have been very impressed with the results. They have all been gifts and each one leaves the recipient in Aw of the quality and personal touch that Holtz puts into their product. I will be a long time client of this American Made company!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "109155366165253437672", "name": "Ronda Gray", "time": 1579470161131, "rating": 5.0, "text": "Absolutely a positive experience as a first time customer. Had an issue with an order and it was resolved promptly and in time for Christmas.  I will be a returning customer", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "116889080952121133345", "name": "Martie Brothers", "time": 1547301692904, "rating": 5.0, "text": "Ordered the Vanderbilt Fine Leather Portfolio Padfolio as a gift for my son and was overwhelmingly impressed with the package he received.  The portfolio is indeed quality work, true craftsmanship and the leather is beautiful.  The extra steps provided in the packaging/presentation of this gift spoke volumes to me as a consumer.  The portfolio included a legal pad with the Holtz logo, a pencil, brochure of the Holtz history and came in a linen bag inside a deep blue gift box.  These little touches elevated this gift and made it all the more special. Holtz Leather you have a new fan and I will definitely be a repeat customer!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "101862859513939685525", "name": "Girard Ruff", "time": 1543887685489, "rating": 5.0, "text": "Received the .30 caliber olive wood pen from my daughter for my birthday.  Many, many compliments, it is of course my favorite pen!!\nI needed to contact the company for a  little customer service and Melissa responded in a timely manner.  This is definitely a company\nthat deserves our business.  I know they have more of mine!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "105824982545760936350", "name": "General Information", "time": 1583968046476, "rating": 5.0, "text": "We absolutely LOVE our hats and beanies at Faith Center Foursquare church! We highly recommend!! Amazing company!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "102173516600146270823", "name": "Walker Realty", "time": 1579019774997, "rating": 5.0, "text": "Top of the line workmanship.  Made in America.  Support Small Business!  Their wallet is well worth the money.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "106207361361446371576", "name": "Barry Kneller", "time": 1584459542392, "rating": 5.0, "text": "Amazing quality! They did a superb job with the hats I ordered.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "105893773924056777209", "name": "Francie Romanchik", "time": 1565036944736, "rating": 5.0, "text": "I ordered 3 different logos at the same time and the hats came out better than I could have expected! The quality is top notch, and the customer service is amazing! I will definitely be using them for future gifts!!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "103303126723097839480", "name": "Cara Howard", "time": 1561393511878, "rating": 5.0, "text": "Holston leather company did a great job on my father's day gift. I ordered an engraved wallet and it came out great I will use them in the future for sure. Thank you so much", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "117985253932901567112", "name": "Amy Stickels", "time": 1594319566523, "rating": 5.0, "text": "Beautiful products and they go above and beyond for their customers!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "117196191090289006712", "name": "Taylor Keaten", "time": 1568052531796, "rating": 5.0, "text": "My wife got my a beautiful pen last year from Holtz.  It was incredible and I have loved it well ever since.  When I dropp the pen on the tip, and it ceased to function I was very upset.  I expected that I wouldn't be able to get it repaired as it is not a typical \"branded\" fountain pen.  I reached out and asked for the spare part that I needed to replace and customer service was remarkable in their response time.  They replaced the part with expedited shipping even!  It was great service and will draw me to purchase their other goods in the future.  Thank you Holtz!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "101095073392267259601", "name": "Emma Kolmetz", "time": 1582749342574, "rating": 5.0, "text": "After losing my phone case wrist strap, and calling to buy a replacement, Holtz Leather mailed me a replacement at no cost the same day!  I love my phone case & would buy again!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "116740320338786681711", "name": "Ryan Travers", "time": 1582503461814, "rating": 5.0, "text": "the quality is top notch and the customer service on another level of amazing\n\nthank you\n\ni will be working with them everytime so happy", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "117898039690688896652", "name": "Carrie Clauson", "time": 1571863708875, "rating": 1.0, "text": "Ordered  2 weeks ago when they told me production time was 1-2 weeks. Now that keeps changing. Found out production time is 2-3 weeks now. Had a wedding to go to next weekend and it’s not going to be here. Now I am totally embarrassed to give them their gift late. I wish I wouldn’t have given them a try. Big mistake on my part!", "pics": null, "resp": {"time": 1574118492462, "text": "Hey Carrie! I have personally checked into your order, and it looks like we were able to get it to you on time! I'm so sorry for any frustration, and I hope that the happy couple enjoys that gift for years to come. Let us know if we can do anything else for you."}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "112147405724881981538", "name": "Hawley Anderson", "time": 1569952668874, "rating": 5.0, "text": "Really beautiful craftsmanship.  Soft leather.  Really fast turn around to make a custom item.  Lovely.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "100470152558220200112", "name": "Jeff Speight", "time": 1579806754628, "rating": 5.0, "text": "Top of the line products very precise.  Thank you for my wonderful front pocket wallet", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "104450175196694410966", "name": "VIRA MORENO", "time": 1577315304545, "rating": 5.0, "text": "The hat I ordered turned out beautiful. Thank you so much!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "105557390661882535545", "name": "Robert Reese", "time": 1588267432555, "rating": 1.0, "text": "i bought two of their mask the straps were purple lace men do not buy this product very poorly made did not fit me our my wife color really bad not for men at all called to see if they would replace the straps never got back wiyh me like to return them and get my money back", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "100875352432867845496", "name": "Lisa McWilliams", "time": 1577069089436, "rating": 5.0, "text": "I cannot say enough good things about this company!! First of all I ordered a personalized belt for our son that lives  out of state, they rushed to get it to me before we traveled to be with him and the family for Christmas!\nAs if that wasn’t nice enough, the beautiful belt arrived, and unfortunately I had ordered it too small!!! :( although this was TOTALLY  my fault, they made me  a new one , and altho I NEVER expected to get it before Christmas, it just arrived!!!! I cannot believe it’s here already !! We leave tomorrow morning for Nashville and I have this beautiful belt to take with me!! Thank you Holtz, talk about going above and beyond.  I’m your new biggest fan! :)\nSincerely\nLisa McWilliams", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "113363941313371572697", "name": "Rachel Campbell", "time": 1530032522546, "rating": 5.0, "text": "This company was such a pleasure to work with.  I ordered a custom hat for my husband for Father's Day, not expecting to receive it in time because production was listed online as 3-4 weeks and I had only ordered it two weeks before Father's Day.  I was content to just give it to him when it got here.  But they got it to me in time without me even asking!  It was like they just knew it was going to be a gift.  Great products, great people.  Definitely plan to work with them again!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "111572404918840469967", "name": "Chad Urdahl", "time": 1559595649781, "rating": 5.0, "text": "The process of submitting my custom logo was simple, the turnaround time on a one-off hat order was impressive and the quality/craftsmanship in finished product surpassed my already high hopes. Holtz Leather earned a fan in me and I won’t hesitate to send friends & family their way.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "107827322186894683709", "name": "Michael Watson", "time": 1559232800468, "rating": 5.0, "text": "I gave their folios as gifts and the recipients were floored. Great quality and attention to detail. Keep up the great work!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "111278503182370622618", "name": "K. C. Lewis", "time": 1550773100742, "rating": 5.0, "text": "Stoked.  Got a custom patch hat with my company logo.  These gals/guys just plain get it.  Attention to detail was unbelievable and I could not be happier with the end product.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "117568757997137039906", "name": "Lawrence McCord", "time": 1558701051163, "rating": 1.0, "text": "I was really looking forward to my custom logo'ed hat. The logo and leather patch look great - but the quality of the hat itself was very poor and noticeably cheap. I compared the size of the bill to the size in their marketing images - and they are two completely different hats. Bait and switch?\n\nMy goal in purchasing one hat was to see the quality and design so I get one for my entire staff. Whoops! Not going to give this hat out to anybody. If it has my brand on it - it has to be high quality, the Holtz custom hat was a disappointment to say the least.", "pics": null, "resp": {"time": 1559074824956, "text": "Hey Lawrence,\n\nI am sorry to hear that you are disappointed with your hat. We use Richardson 112 Snapback Hats, which are the same hats as featured in our marketing and website images. They are one size adjustable snapback hats so they look a little different on different people. On our website, the main image is of a woman wearing the hat so the bill does appear larger compared to her head size. However, we did have a variety of photos on our website and social media pages showing the hat on other models.  We're sorry for any misunderstanding, and we hope we can do business with you in the future!"}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "106341211124100012611", "name": "Sandra Auditore", "time": 1568382465378, "rating": 5.0, "text": "Excellent products, excellent service and products arrive right on time. Thanks to James for customer service who answered all my questions and helped me get my package on time.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "113879886023679812303", "name": "Jessie Junior", "time": 1557158895860, "rating": 5.0, "text": "I love this place! I use one of the minimalist wallets and probably always will! It has lasted over 2 years now w/o any issues!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "102184023170050127647", "name": "Mark Boyce", "time": 1566329459601, "rating": 5.0, "text": "High quality product. A loving family committed to serving God and their customers.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "115684598191423766953", "name": "Steve Rierson", "time": 1578676513420, "rating": 1.0, "text": "Awful experience.  Ordered a wallet to be made from my sons baseball glove from his undefeated high school season to replace a wallet that had been stolen to be given as a Christmas gift on Dec 6 which was 9 days before the \"guaranteed delivery by Christmas\" date in the email blast ad I received.  I'm sure you know where this is going.  Paid my money and waited for the box to arrive to send glove back for production.  Funny thing was I was still receiving email blasts selling the \"guaranteed delivery  by Christmas\" ads. The box finally showed up 11 days later on the 17th.  I know it is Christmas time but that did seem to take longer that it should have taken.  I called the company and was told that there was some delay in shipping (duh). I asked if I sent the glove back right away would they still make the \"guaranteed delivery by Christmas\".   I was told NO WAY with the shipping back and forth and the 2 day production time it wasn't going to happen.  I offered to pay for over night shipping to them which would get the box to them on the 18th - 2 days for production - 20th - they could pick up the tab for over night return getting it back to me on the 21st or the 22nd at the latest.  NO  I offered to pay for the over night shipping both ways.  NO  I asked why not?  Was told we wouldn't have time to make it.  What?  You took the order.  You took the money.  You knew it was to be made.  From the pictures the glove isn't the main part of the wallet. I still needed to get him a wallet....they already had my money....they have a store front... You would think they would try and sell me something.  I was told they have nothing in the store to send me.  What? Nothing in the showcase? Sold out on the 17th of December?\nCancelled the order and was told 2 days to get money back.  It took 4 but I was glad to get it back(haha).  Too bad - I liked the wallet concept.  If anyone knows a company that can do this that will do what they say let me know", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "101770555244321364992", "name": "Mark Hill", "time": 1587595875047, "rating": 5.0, "text": "Amazing craftsmanship in the Whiskey Barrel Stave sign. Absolutely beautiful!!!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "103360368176389923292", "name": "Taunya Hermann", "time": 1556576452797, "rating": 5.0, "text": "I never write reviews, but these guys are AMAZING and I can’t thank them enough! I had no idea what to gift to my husband who was graduating BYU, until I saw Holtz leather portfolio. It looks as beautiful as it did online and my husband loves it!\nI was nervous it wouldn’t arrive on time, so I immediately chatted with a rep online, who responded right away and assured me they would make it happen. They did... and a day earlier than I was expecting. Thank you! Thank you!\nNot only was my experience with Holtz exceptional, but this is an exquisite and durable portfolio that my husband will be able to use for years.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "114890603678618626271", "name": "Kimberly Parker", "time": 1518610799039, "rating": 5.0, "text": "I LOVE the store and the people that work there. I went in yesterday (day before Valentine’s Day) to get my husband a bi fold leather wallet and personalize it. The wallet they make is beautiful and sturdy and the personalization process was super fast. I love that they make ALL their OWN leather products in their shop upstairs. It makes their stuff even better in my mind! Not to mention all the staff was beyond gracious with me having a number of my very loud and sadly wild children with me.(it was during their nap times)  So that’s was another huge plus :)", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "115239637688063920912", "name": "cstam105", "time": 1522764566351, "rating": 5.0, "text": "Ordered customized wallets for groomsmen but had one wallet that I wanted to change last minute.  Holtz Leather Co Customer Service responded by e-mail very quickly and was very flexible! Can't wait to get them in the mail.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "111536294022464743284", "name": "Bonnie Rose", "time": 1561550735443, "rating": 5.0, "text": "Amazing!!! I love the custom hat they created, and I will be ordering more! The process was seamless, and the turn around time was impressive! Absolutely recommend!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "109264237360376889821", "name": "Elia Arangure", "time": 1531526394712, "rating": 5.0, "text": "Outstanding customer service! Whether it’s through email or over the phone they always get back in touch so quickly and not only that but start on the job right when you place the order. I have ordered gifts for my boyfriend in two different occasions and they never let me down:)", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "108722363532989773046", "name": "Jake Monroe", "time": 1560869136441, "rating": 5.0, "text": "Absolutely beautiful leather products. I was blown away by the quality of the key lanyard I ordered. An excellent, artisanal,  American business that I will continue to shop from in the future.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "101753479140694832503", "name": "Camille Adams", "time": 1571796122388, "rating": 5.0, "text": "WONDERFUL customer service and great quality leather used on the the custom hats! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "105711460937433825912", "name": "Geo Chem Dump Alert", "time": 1527303977252, "rating": 5.0, "text": "I received the custom leather wallet I ordered today for my daughter.  The wallet is absolutely beautiful & I am extremely pleased with their product.  I will definitely be ordering from Holtz Leather Company again.\n\nThank you,\nM. Roberts", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "113718710205618400896", "name": "Kyle Davis", "time": 1565099710078, "rating": 5.0, "text": "Very impressed with this company because they have very quick response times, They are very polite, and you get to deal with real people instead of automated systems!  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "114998095659207298144", "name": "Kim Walker", "time": 1518793844712, "rating": 5.0, "text": "I was introduced to Holtz Leather by one of your beautiful Pinterest ads at Christmas. As a result I bought 3 items for my husband. Now, we are both raving fans. You do amazing work. True craftsmen. Your customer service is on point, too. I love your family-roots story and wish you great success!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "116613299214761537553", "name": "Original 1", "time": 1576986989179, "rating": 1.0, "text": "They are not true to description. I ordered a vintage wallet. I know it says they will all look different compared to picture but mine looked brand new not vintage.", "pics": null, "resp": {"time": 1578526484569, "text": "Hello,\nI am sad to hear that you were not satisfied with your wallet. It is always our goal to blow our customers away when they open their package so if we missed the mark we want to make it right. Please email us at customercare@holtzleather.com so we can get some more information from you."}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "110044544284657267539", "name": "Shelly Kraus", "time": 1565100428412, "rating": 5.0, "text": "You guys did an amazing job on the custom leather patch hats I ordered. Thanks for the awesome customer service and craftsmanship.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "109189425748551680992", "name": "Lauren Whittinghill", "time": 1545777123182, "rating": 5.0, "text": "I ordered the Gates Personalized Bifold Money Clip Wallet. I ordered 12/12 and received it on 12/21. The quality of work is amazing. The leather is extremely smooth, the stitching is tight and clean, and the personalized message is easy to read and straight. My husband absolutely loves it.... AND it fits all his cards from his old bifold wallet. I will definitely be ordering from you guys again. God bless!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipObmSK5ux9h4qreD3_oTqauhTXMry6uh_2ZzPUf=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMujCU6IUWbjs1tJMMgwhL3ROkN2BTTkiXuSXne=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "111925518047317734773", "name": "Melanie Runsick", "time": 1551328351647, "rating": 5.0, "text": "Ordered several gifts from Holtz. They’re always loved & cherished. Amazing quality & I LOVED reading your “about” on your website.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "100220653120172482069", "name": "John Kizer", "time": 1580145337913, "rating": 5.0, "text": "Fast shipping and very good quality! Impressive!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "102143265757441412815", "name": "Elissa Trevino", "time": 1529975228464, "rating": 5.0, "text": "Isn’t nice to dial a number and you don’t have to go through all the hoop la to talk to a robot. Melissa answered the phone and was awesome. I accidentally ordered the wrong size belt for my boyfriend which I personalized and they actually made me a new one! No hassles! How kind is that?! The quality is great and I can’t wait to order more products from Holtz. My brother (who is very picky on quality) LOVED his unique Fathers Day gifts Holtz from his kids too!\nPS No wonder why you’re Glenn Beck approved!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "110082845198511308429", "name": "Kelsey Pierotti", "time": 1565023043254, "rating": 5.0, "text": "Absolutely loved working with Holtz Leather!! We received a large order in a timely manner and it is great quality!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "108242877724643939776", "name": "Dave Callahan", "time": 1566386037999, "rating": 5.0, "text": "Great quality, design and customer service! Will definitely order again!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "115082413857215240510", "name": "Lucil Gustave", "time": 1526095409238, "rating": 5.0, "text": "I ordered a leather bow tie for my husband birthday, and he absolutely loved it. I specifically asked that it arrive by his birthday and it did. Great company excellent product. I will be ordering from Holtz Leather again.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "106618446047374607162", "name": "Stephanie Thomason", "time": 1550241901974, "rating": 5.0, "text": "I ordered a personalized belt for my husband and it turned out perfect! I will definitely be buying more items from Holts Leather!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "106574505171443762124", "name": "Cynthia Osborne", "time": 1559956071165, "rating": 5.0, "text": "I’ve ordered from Holtz twice, leather goods and wood gifts. Everything they make is quality work and I love that they monogram your gifts. I’ll continue to order.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "103703946286010188822", "name": "William Rapp", "time": 1565955856741, "rating": 2.0, "text": "Ordered a bifold wallet for my husband's 70th birthday .  He's an avid baseball fan so I thought this was perfect.  The wallet shown online -you can see a bit of the brand name on the flaps inside like Rawlings/Spaulding or you can see  part of the player's signature thus making it immediately identifiable as a baseball glove.  The one I received had nothing visible on it to identify it to someone who isn't so much a baseball fan.  I was so disappointed that I wanted to send it back.  Reading the return policy I realized I had had his initials stamped on it therefore it was not returnable.  The kicker is that you cannot place an order without having someone's initials stamped on it.  So very disappointed that I thought I had found his perfect gift-but not.", "pics": null, "resp": {"time": 1566483047095, "text": "Hey William,\n\nWe are so sorry to hear this! We take great care to deliver a quality product, but even more so to deliver quality customer service. When we miss the mark we will do whatever we can to make it right. We are reaching out to you with further information. Thank you so much for sharing your concerns with us, and let us know if there is anything else we can do for you!\n\nSincerely,\nThe Holtz Family"}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "113213502862264517277", "name": "Patrick Camargo", "time": 1547870566770, "rating": 5.0, "text": "Great quality, very timely turnaround on orders.  I purchased the sleeve for a Macbook Pro, it's a little bigger than I thought, it definitely will fit just about any 15\" laptop, and it certainly appears to be well crafted and durable.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "116036634485948883878", "name": "Ashley P", "time": 1508217121826, "rating": 5.0, "text": "I came home to find my boyfriends anniversary gift !!!!!!! I am so excited to give it to him he is going to love it ...holtz leather company you guys did an amazing job!!! I couldn't ask for more! The quality is so rich and authentic ! I will definitely be ordering Christmas gifts soon!:) thanks again ! 100% satisfied !!!!🙌🏼", "pics": null, "resp": {"time": 1508247156043, "text": "Thanks for the kind words! We are so happy to hear you like the product! Happy anniversary! We look forward to working with you again for Christmas gifts!"}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "101425834196242126488", "name": "Ryan Wilson", "time": 1583943000898, "rating": 1.0, "text": "Belt wore out faster than my cheap Chinese leather ones.", "pics": null, "resp": {"time": 1584398331982, "text": "Hey Ryan,\n\nThank you for sharing your feedback. Our leather goods are designed to last. If yours did not, please contact our Customer Service team at 256-883-1111 or customercare@holtzleather.com. They will work with you to send your belt back for a new one.\n\nSincerely,\nHoltz Team"}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "112177303469931458406", "name": "Andrew Chambers", "time": 1570811345456, "rating": 5.0, "text": "I had Holtz make a custom hat and they exceed my expectations. It is exactly what I wanted and it only took 13 days from placing my order to it arriving on my front porch!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "100080473159994156460", "name": "chris whelan", "time": 1559607305211, "rating": 5.0, "text": "awesome product and fast delivery.   Quality leather.   Thank you again!!!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "117900684755457437425", "name": "william murphy", "time": 1565796682188, "rating": 5.0, "text": "Love my wallet tough as nails and comfortable to carry!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "111887848227393681053", "name": "Dominic Capitoni", "time": 1568853881879, "rating": 5.0, "text": "Great craftsmanship and made by a hardworking American family!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "116656976353211034513", "name": "Josh Williams", "time": 1521906836975, "rating": 5.0, "text": "Awesome product!  Ordered a hat and it is by far the highest quality you can receive for the money! thanks again Holtz leather!! will be purchasing again!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "114840041580873964127", "name": "Romas Dixon", "time": 1534383711056, "rating": 5.0, "text": "Order purse for wife just because. They nail it. I think she love it better than thousand dollar Louis  Vuitton", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "106267719047720056913", "name": "Amanda Schrenk", "time": 1535825153582, "rating": 5.0, "text": "Helpful employees, pleasant atmosphere, and quality products! My husband and I were very impressed and will be coming back!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "115622397405395503773", "name": "jennifer ross", "time": 1560377310135, "rating": 5.0, "text": "Great customer service! Great quality and beautiful products!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "106599034495074503300", "name": "Mac Thomas", "time": 1546144864983, "rating": 4.0, "text": "Very nice handmade leather products very helpful very kind", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "114715270485564395699", "name": "Sarah Eledui", "time": 1511701243119, "rating": 5.0, "text": "The new shop is beautiful! The people are so friendly and kind and their work is very detailed and full of thought and care.", "pics": null, "resp": {"time": 1511792985476, "text": "Thank you for coming by our new retail store and for your kind words!"}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "104145705059005691869", "name": "Kim Barton", "time": 1545155807001, "rating": 1.0, "text": "Ordered items on December 5th. Half were monogrammed. I paid $18.99 for 2 day shipping. All my items were shipped on December 12th. A week after Inplaced the order. It is December 17th and I still do not have my items and I just called customer service and it appears I now have 2 tracking numbers rather than the one I was supplied with on December 5th. I purchased monogrammed passport cases for my children as they left on a trip to South Africa on Dec. 16th. I called customer service and they assured me that I would receive my items on Dec. 14th. My children are is South Africa and who knows where my Holtz items are. Never ordering from them again. My advice you should not either!!", "pics": null, "resp": {"time": 1545931267473, "text": "Hey Kim,\n\nI'm so sorry your order did not arrive in time for your children to receive them before they left for South Africa! I know how disappointing that must have been, and for that I am truly sorry.  I wanted to address your concerns and see if I can help alleviate some of the frustration and/or stress around this.\n\nThe shipment came in two boxes largely due to the size of products purchased. The box we ship our whiskey barrel marshmallow roasters in is 48x8x8, and that will not hold things like the Vanderbilt journal which is much wider than that box would allow. We take great pride in presentation and want you to receive our products in excellent shape, and as such we are very particular with how we ship everything. I am so sorry if that extra tracking number did not come through to you - those automated emails may have missed that one.\n\nAs for the delay in shipment, we are a small family-owned company that hand crafts each of these products. We put out a very large volume between our online orders and our brick and mortar store in Huntsville - but we do not have the staff to be able to put out products the same day they are purchased - especially at Christmas time. Our lead times definitely lengthen around the holidays; so the priority shipping is an add on just for that method of shipping - it does not remove the production period. I see that you contacted us on the 11th requesting to have it by that Friday, 12/14, and we were actually able to push it out the door on the 12th which should have gotten it to you in time. Unfortunately it got held up at the post office for 4 days, which is why it did not get to you in time.\n\nI know this does not negate the fact that you didn't get your items in time, and again we are so sorry about that!\n\nI hope you had a merry Christmas and your children enjoyed their travels!"}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "105160190810031886965", "name": "mary brooke", "time": 1559999580533, "rating": 1.0, "text": "Terrible company with rude staff. Products are obviously cheap, and I was looking forward to getting what I purchased but was disappointed by the materials.", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "105464711874939728098", "name": "Paige Townsend", "time": 1544021715926, "rating": 5.0, "text": "Absolutely amazing quality products, and wonderful customer service! I ordered eight different items from Holtz Leather for Christmas gifts, and my expectations were exceeded on all of them - especially the custom logo hat!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "105608487921764651870", "name": "Kenneth Santos", "time": 1564068978208, "rating": 5.0, "text": "I’m a big hat person and over the years I’ve struggled to find a hat I can use as a company hat as well as a hat to go out with. I order one just to check it out and once I recieved it I ordered more for my employees and friends!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "106001827122642982673", "name": "Jason Butler", "time": 1513915701000, "rating": 5.0, "text": "Awesome Place. Great Products. Nice people", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "113041398845701437895", "name": "Justin Gizinski", "time": 1507309522604, "rating": 5.0, "text": "No where else can you order a single custom leather patch hat for such a low price, amazing quality, fast turnaround and looks great!!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "112770333224571661781", "name": "fabian Bonilla", "time": 1557594946815, "rating": 1.0, "text": "First of all the quality is not up to level with the price, I paid top dollar for Chinese quality workmanship, second i waited for my item as long as if it was coming from China, ridiculous, i wont be ordering from them again.", "pics": null, "resp": {"time": 1557780918960, "text": "Hey Fabian,\n\nI see that you ordered a Pioneer Passport Wallet, personalized with a logo and name. We contacted you via the email and phone number you provided on your order, on 4/25, 4/30, 5/3, and 5/6 to get your logo file. Our final email on 5/6 notified you that we would ship the item without the logo if we did not hear back from you. With no response, we shipped your order with only the name on 5/9.\n\nI hate to hear your experience with us did not live up to your expectations. I understand the frustration you must feel to have waited for an order and it is not exactly what you had hoped for. Please contact our Customer Service team at 256-883-1111. We would love the opportunity to improve your experience."}, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "103848864853108816684", "name": "Drew Shankweiler", "time": 1571179656734, "rating": 5.0, "text": "These belts are the bees-knees!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "111985316947291577318", "name": "Andrew Lay", "time": 1568425387849, "rating": 5.0, "text": "Great!", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
{"user_id": "115053996129348850857", "name": "Idk Idk", "time": 1564428349732, "rating": 5.0, "text": "Amazing", "pics": null, "resp": null, "gmap_id": "0x886215cba217cce7:0xe04a5ad9b6a5c690"}
