{"user_id": "106393880518477061437", "name": "Jerry D Snead", "time": 1628707108954, "rating": 5.0, "text": "McCord was recommended by a neighbor. I called and set an appointment. They were quick and professional.\nWhen James arrived, he quickly assessed the multiple installations and repair I needed. He then methodically attacked them, completing one after the other. There were several unexpected problems, but he kept at it until I was satisfied.\nI heartily recommend McCord Electric to anyone who needs a professional. Great people to work with!!", "pics": null, "resp": {"time": 1628721348308, "text": "Thanks for your business!\nIt was a pleasure"}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "107007242207044319761", "name": "Robert Rutledge", "time": 1512072085430, "rating": 5.0, "text": "Awsome electrical service. Marty is very professional and yet personable. I had problems with the GFI outlets on the outside of the house. Marty walked me thru the whole process of checking them out and finding where the problem was.\n\nWhile he was there, we planned out exterior lighting I will be adding as well as installing interior LED cans. It's going to look great and will lower my cooling bill. LED lights put off almost no heat compared to incandescent lighting. He will be the one I hire for that project, too.\n\nIt's great to find \"my guy\" to take care of electrical issues.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP7kHzD0SkgQZ5KAHXStw4-bRGFFHqGhSH5rLC0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMYNjbGn7juIK72bguyPBDgcQieQXi1trFxWSid=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "108368771310707701994", "name": "Bruce Barrett", "time": 1516920440827, "rating": 5.0, "text": "The first time I called McCord, they did a great job installing ceiling fans. So I called them again to remodel new lights in a \"turtleback\" ceiling. Marty and Wade positioned the fixtures perfectly. They completed the job efficiently, professionally, and cleanly. There wasn't even any dust from cutting through drywall. All I did was move back the furniture and enjoy the new lighting. I highly recommend McCord Electric Service. They are the \"GO TO\" electricians in my book, with 6-star service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOEBEIuYYv_KfNfPdfGtaiFE0Zd0lO4WSO2tjoz=w150-h150-k-no-p"]}], "resp": {"time": 1516929635611, "text": "Thanks for your business. We appreciate it."}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "113054051282962751751", "name": "Barney Zeitvogel", "time": 1609348319703, "rating": 5.0, "text": "Would definitely use again.  Marty took care of everything we needed to get done.", "pics": null, "resp": {"time": 1627680669315, "text": "Thank you for allowing McCord Electric to serve you."}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "103001921389184437395", "name": "Michael Baker", "time": 1563798948533, "rating": 5.0, "text": "Mr. McCord was very professional and completed my 100 amp service as asked and as quoted. He actually even put an extra receptacle for no charge. His attention to detail and doing the project correctly was second to none. If you need an electrician in the Alabama Gulf Coast area, I strongly recommend his service.\n\nThanks again,\nMike", "pics": null, "resp": {"time": 1627680737475, "text": "You are very kind to leave such a great review of our electrical service."}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "108771211274595016803", "name": "Seth Phelps", "time": 1505769481981, "rating": 5.0, "text": "Marty McCord offers quality electric work at a reasonable price and is prompt and honest in his dealings. I don't know what more you could ask of someone. We happened upon him thinking it was another electric company and have been thankful since. I would recommend him for any electrical work, be it small or large, as he has the experience, knowledge and desire to leave a customer satisfied.", "pics": null, "resp": {"time": 1505837362010, "text": "Thank You Seth, my pleasure."}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "108039206098157453023", "name": "STACY MURDOCH", "time": 1533763534321, "rating": 5.0, "text": "Marty McCord and his co-worker,  Wade... are the BEST!  So accommodating and just on it with our electrical (numerous!) needs at our OB condo. We really lucked out opting to call these guys, was really just a fluke.  So happy to find “the guys” to take care of our electrical needs.", "pics": null, "resp": null, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "113318296399112104544", "name": "MIke Kanoza", "time": 1559492659788, "rating": 5.0, "text": "Marty was extremely helpful, knowledgeable and did great job adding a new outlet on our patio for ceiling fan- on time and very reasonable charge for his services-\nWe would not hesitate to call him again for any electrical work we have!\nThanks Marty", "pics": null, "resp": null, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "103319775399863248517", "name": "Douglas Yawn", "time": 1535124366885, "rating": 5.0, "text": "Our Orange Beach condo had two separate electrical issues. We had not previously used an electrician but chose McCord based upon their good reviews. We were not disappointed. Ben Clark arrived on time, worked diligently to identify the source of our problems and made the necessary repairs. One of the problems was caused by contractor errors when the condo was constructed over 30 years ago. We now have what everyone needs, a go to electrician. For professionalism, courtesy, experience and fair pricing, we highly recommend McCord Electric.", "pics": null, "resp": null, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "113670239001173091208", "name": "John Kirchhof", "time": 1550033977846, "rating": 5.0, "text": "I was having trouble with a GFI in our bathroom.  I called McCord Electric Service and Marty gave me a time he could meet me.  Marty showed up at that time and figured out what the problem was and fixed it right away.  I just found my new electrician.  I highly recommend McCord Electric if you need an honest and excellent electrical service. Thanks.", "pics": null, "resp": {"time": 1550330161434, "text": "Thank You John It was a pleasure"}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "113788011623700451968", "name": "Max Speed", "time": 1561562099428, "rating": 5.0, "text": "We recently moved to the area and needed an electrician to fix my DIY goof up. Not knowing who to call, we went pot luck...and struck gold! Call this guy if you need assistance!", "pics": null, "resp": {"time": 1627680787091, "text": "Our electrical service is here for you day or nigh. Call weekends too if you have an emergency."}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "105224655143846699764", "name": "kristie Barba", "time": 1516754115334, "rating": 5.0, "text": "Not only did he Marty return my calls quickly when I called to ask questions  but he was very prompt and well educated ! He showed up and provided an excellence service for our new kitchen lighting ! Marty is now in my contacts as our electrician ! Will recommend him for any job !", "pics": null, "resp": {"time": 1516764564579, "text": "Thanks so much."}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "104146346592967747767", "name": "Machelle Thompsôn", "time": 1515179085267, "rating": 5.0, "text": "Marty  was wonderful. Found our problem quickly and had lights back on within an hour.", "pics": null, "resp": {"time": 1515181054710, "text": "Thanks for your business. I really appreciate it."}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "100980857664612769756", "name": "Benjamin Miles", "time": 1534436543728, "rating": 5.0, "text": "Fast friendly service, clean work and good price!", "pics": null, "resp": null, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "113687326717291046082", "name": "Cindy Turner", "time": 1504637530222, "rating": 5.0, "text": "I had a ceiling fan replaced and he replaced my flouriscent kitchen lighting with new LED can lights. He was on time, cleaned up after he was done and charged me a fare price. I am recommending him to all my friends.", "pics": null, "resp": {"time": 1505837327388, "text": "Thank You Cindy"}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "113850475802972492686", "name": "Nancy Williams", "time": 1516677323084, "rating": 5.0, "text": "This is the second time we've used Mr.  McCord services.   He's professional,  on time,  and is fair on pricing.   Very pleasant experience.", "pics": null, "resp": {"time": 1516717702705, "text": "My pleasure. Thanks for your business"}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "103811717545694232069", "name": "Nedra Smith", "time": 1580772780839, "rating": 1.0, "text": "Did not return my call", "pics": null, "resp": null, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "116218328897504428456", "name": "Sandra Oneill", "time": 1559413431291, "rating": 1.0, "text": "Never returned my call.", "pics": null, "resp": {"time": 1559422576645, "text": "Sandra,  sorry I missed your call. I have been very busy. I have looked thru my call log and do not see your name. Are you sure you called me?"}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "111683293636435602975", "name": "Atalie Whitley", "time": 1543194309486, "rating": 5.0, "text": "Fantastic customer service. Our home was never more beautiful for Christmas! They were able to accommodate our schedule and did a great job!", "pics": null, "resp": null, "gmap_id": "0x8888de4d33c7f81b:0xa0222c065716cfd5"}
{"user_id": "109372217053533667982", "name": "Darryl Peterson", "time": 1560287190392, "rating": 1.0, "text": "I have tried multiple times and multiple ways to contact them and ask a question.  If they will not answer a question from a prospect, I fear how they would respond to a client with an issue.  I will not be finding out.", "pics": null, "resp": null, "gmap_id": "0x8888de4d33c7f81b:0xa0222c065716cfd5"}
{"user_id": "102171166101909900289", "name": "Steven Rayne", "time": 1546367791944, "rating": 5.0, "text": "Excellent individuals to assist in Holiday and Landscaping lighting and decor", "pics": null, "resp": null, "gmap_id": "0x8888de4d33c7f81b:0xa0222c065716cfd5"}
{"user_id": "118183919919448339330", "name": "Steven Morgan", "time": 1531008143392, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x8888de4d33c7f81b:0xa0222c065716cfd5"}
{"user_id": "106911159980853960578", "name": "juan alcocer", "time": 1600047773889, "rating": 5.0, "text": "👍👍👍👍👍", "pics": null, "resp": null, "gmap_id": "0x8888de4d33c7f81b:0xa0222c065716cfd5"}
{"user_id": "108221045164758997700", "name": "micah andrews", "time": 1611381111321, "rating": 5.0, "text": "Good company and nice people.  The yard guy is pretty dang slick with his lull ability, hats off.", "pics": null, "resp": null, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "100366330684148043556", "name": "Daniel Noll", "time": 1537714969073, "rating": 1.0, "text": "Let me tell you a story about these guys. This story takes place in the relatively small parking lot of the hotel I am staying in.\n\nBefore we get started though, know that I tried to resolve this issue directly with the company. The responses I received from them began with a man named \"Andrew\" responding to my initial email with \"who the heck is this\".\n\nIn the attached pictures you will see what their workers did. Things the company clearly considers acceptable, because their attitude towards the situation was condescending at best.\n\nThing #1: You'll see 3 trailers here. One is a different company, one is Scott's Services (the middle one) and one is unmarked. It's not easy to see how many spots they are taking up, but at least 6.\n\nThe drivers were there, and were aware of the problems they were causing. People were actively driving around the lot trying to find parking spots. You can also see the company name on the truck here.\n\nThere is another truck here that is apparently also theirs. After the front desk agent of the hotel asked them to stop blocking parking spaces, they refused, claiming they were stuck. After the agent left they had a good laugh about it, and then moved into the unmarked truck.\n\nThing #2: This is the other side of the parking lot. Another of their vehicles. A much smaller vehicle. One capable of fitting into a single space, and yet they managed to take up two with this one as well. Surely this truck was not stuck as well. What stopped them from fixing this one and freeing up a space?\n\nUpon reporting this behavior to the company, I was told by the person named Andrew that I had a personal problem, and that the hotel should deal with the issue if they feel they need to. I should also stop trying to get hard working people in trouble just because I cannot park where I want. Because everyone knows only Scott's Services' workers are hard working - none of the other patrons of the hotel they inconvenienced were hard working people as well.\n\nIn the adult world we do not get \"in trouble\"; We get held accountable for our actions. The company's refusal to hold their employees accountable for their behavior is a clear declaration that the behavior is condoned by the company, and that these actions accurately reflect the values of Scott's Services.\n\nConsider these things when you consider working with them. This is how they might choose to behave.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNotWXTHDswMaStIri7oO1KYTHcdDg-iMZM7EcH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMIccL5azPhSQVorayMuH0fSQ-MeP3tLWdwfrfu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPYlAUxH76tGUHIMWgqp0OIhoIpA1rtx96Fa9j5=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "110079574381439375015", "name": "DiGiorno 1", "time": 1597964636118, "rating": 5.0, "text": "These guys go above and beyond.  Thank you for paying attention to detail and making the experience quick and painless", "pics": null, "resp": null, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "100129000262680898620", "name": "Phil Green", "time": 1576173371493, "rating": 5.0, "text": "Great and friendly service. can handle any need I have. On time and affordable.\nI Recommend their services", "pics": null, "resp": {"time": 1579125202491, "text": "Thanks so much for your kind words."}, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "104735457715599888855", "name": "Brandon Felice", "time": 1543165254877, "rating": 5.0, "text": "foremer employee. loved the staff and the job. great place to start a career and performs the best service of any non union company out there", "pics": null, "resp": null, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "116604375826105954376", "name": "billy gurak", "time": 1544458601351, "rating": 5.0, "text": "I have been with this company for over a decade.  Whether it has been losing my father or having a tree come through my house they have worked with me on time I needed off. They truly treat you like family.", "pics": null, "resp": null, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "113595226729417891245", "name": "Jose Lopez", "time": 1595016543247, "rating": 5.0, "text": "Love the service here", "pics": null, "resp": null, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "111153154520895431231", "name": "classic32428", "time": 1563994987098, "rating": 1.0, "text": "Had a bucket truck roll into me and take off hit my trailer I was pulling...... down here in Panama city on 23th street and hwy77.............", "pics": null, "resp": {"time": 1579125321246, "text": "I am sorry that happened, I believe the tech did not realize he hit you at the time but came back once he was informed to complete the necessary paperwork."}, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "110722574138138867621", "name": "Tony Worrell", "time": 1547668797665, "rating": 5.0, "text": "Great people", "pics": null, "resp": null, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "112039914496720690151", "name": "Janeth Rivera", "time": 1594659935453, "rating": 5.0, "text": "(Translated by Google) Very friendly good attention to delivery a large space to turn\n\n(Original)\nMuy amables buena atención a los delivery un espacio grande para dar vuelta", "pics": null, "resp": null, "gmap_id": "0x88890d91da79e17f:0xb7995bed26179105"}
{"user_id": "111275415841861100572", "name": "Mickey Ergle", "time": 1602617856016, "rating": 5.0, "text": "Gerald came out the day I called. My outside box was damaged by hurricane Sally. He go me going safely that night. Then the next day installed us a new main box. It was even cheaper than I could have asked for. His professional and personal attitude was well above great. These are the folks to call.", "pics": null, "resp": null, "gmap_id": "0x889a059e53009e01:0xf82c6070f4dbaa5b"}
{"user_id": "103383984334527242454", "name": "Snapple K", "time": 1595956125696, "rating": 5.0, "text": "Very knowledgeable engineers. I was amazed at the resolution they came up with. It worked and I am very satisfied! If I should ever need electrical work again I will absolutely call them first.", "pics": null, "resp": null, "gmap_id": "0x889a059e53009e01:0xf82c6070f4dbaa5b"}
{"user_id": "100306485671671333541", "name": "Jim Meyer", "time": 1591452879476, "rating": 5.0, "text": "Needed to correct the mis_application of a remodeling project. Electric Power was on the job within an hour and done within two. Thoroughly professional and knowledgeable. They will be on our recommended list.", "pics": null, "resp": null, "gmap_id": "0x889a059e53009e01:0xf82c6070f4dbaa5b"}
{"user_id": "111516304611972823209", "name": "Electric Power", "time": 1595954752671, "rating": 5.0, "text": "Arrived on time - did the work professionally - respected our property - priced right! Couldn't ask for anything more. Re-hire without hesitation!", "pics": null, "resp": null, "gmap_id": "0x889a059e53009e01:0xf82c6070f4dbaa5b"}
{"user_id": "102345302808573138515", "name": "Sam Donaldson", "time": 1595955637680, "rating": 5.0, "text": "Very professional, quick response, even advised on a few things we were doing ourselves. Assisted after the work was done, and much more affordable than Lowe s on lighting install.", "pics": null, "resp": null, "gmap_id": "0x889a059e53009e01:0xf82c6070f4dbaa5b"}
{"user_id": "113633572107690851539", "name": "Phillip Hilley", "time": 1595966185097, "rating": 5.0, "text": "Outstanding service!", "pics": null, "resp": null, "gmap_id": "0x889a059e53009e01:0xf82c6070f4dbaa5b"}
